
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Сверка с брокером БК РЕГИОН",
		"2.90",
		"",
		Истина,
		"СкриншотФормы");
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьРезультатСравнения(Брокер, Депозитарий, Период, Каталог, СверкаСМесячнымОтчетомБрокера, СчетаДУ = Неопределено) Экспорт
	
	Если СверкаСМесячнымОтчетомБрокера Тогда
		НачалоПериода	= НачалоМесяца(Период);
		КонецПериода	= КонецМесяца(Период);
	Иначе
		НачалоПериода	= Период;
		КонецПериода	= КонецДня(Период);
	КонецЕсли;
		
	// Получаем данные файлов с отчетами брокера.
	ДанныеОтчетов = ПолучитьДанныеОтчетов(Брокер, НачалоПериода, КонецПериода, Каталог, СверкаСМесячнымОтчетомБрокера,,,СчетаДУ);
	
	Если ДанныеОтчетов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Подготавливаем структуру для результатов сверки.
	// Таблица для списка проверенных счетов доверительного управления и стратегий.
	СчетаДоверительногоУправления = Новый ТаблицаЗначений;
	СчетаДоверительногоУправления.Колонки.Добавить("СчетДоверительногоУправления",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	СчетаДоверительногоУправления.Колонки.Добавить("Стратегия",						Новый ОписаниеТипов("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));
	СчетаДоверительногоУправления.Колонки.Добавить("ВремяПолученияДанных",			Новый ОписаниеТипов("Дата"));
	
	// Массив типов для колонки "Субъект аналитики".
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СчетаДоверительногоУправления"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));
	
	МассивТиповДБО = Новый Массив;
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.Договоры"));
	
	// Таблица для расхождений, выявленных при сверке.
	Расхождения = Новый ТаблицаЗначений;
	Расхождения.Колонки.Добавить("ДоговорБрокерскогоОбслуживания",	Новый ОписаниеТипов(МассивТиповДБО));
	Расхождения.Колонки.Добавить("СубъектАналитики",				Новый ОписаниеТипов(МассивТипов));
	Расхождения.Колонки.Добавить("ВалютнаяСекция",					Новый ОписаниеТипов("Булево"));
	Расхождения.Колонки.Добавить("НачалоПериода",					Новый ОписаниеТипов("Дата"));
	Расхождения.Колонки.Добавить("КонецПериода",					Новый ОписаниеТипов("Дата"));
	Расхождения.Колонки.Добавить("ВнебиржевойРынок",				Новый ОписаниеТипов("Булево"));
	Расхождения.Колонки.Добавить("Валюта",							Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Расхождения.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	Расхождения.Колонки.Добавить("Блок",							Новый ОписаниеТипов("Строка"));
	Расхождения.Колонки.Добавить("ДатаОперации",					Новый ОписаниеТипов("Дата"));
	Расхождения.Колонки.Добавить("Показатель",						Новый ОписаниеТипов("Строка"));
	Расхождения.Колонки.Добавить("Брокер",							Новый ОписаниеТипов("Число"));
	Расхождения.Колонки.Добавить("УчетнаяСистема",					Новый ОписаниеТипов("Число"));
	Расхождения.Колонки.Добавить("Расхождение",						Новый ОписаниеТипов("Булево"));
	
	Результат = Новый Структура("СверенныеСчетаДоверительногоУправления, Расхождения", СчетаДоверительногоУправления, Расхождения); 
	
	КлючиДляСверки = ПолучитьКлючиДляСверки(ДанныеОтчетов.МВТ, Брокер, СверкаСМесячнымОтчетомБрокера, НачалоПериода, КонецПериода, СчетаДУ);
	
	#Область Сравнение_данных
	
	// Получаем результат сверки по ключам с полным периодом сверки (сутки / месяц);
	Если КлючиДляСверки.СПолнымПериодом.Количество() > 0 Тогда
		
		// Сравниваем данные отчетов по ключам.
		РезультатСравнения = ПроизвестиСверку(ДанныеОтчетов.МВТ, НачалоПериода, КонецПериода, Брокер, Депозитарий, Истина, СчетаДУ);
		
		// Дополняем результат сверки результатами сравнения отчетов по ключам.
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатСравнения.СверенныеСчетаДоверительногоУправления,	Результат.СверенныеСчетаДоверительногоУправления);
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатСравнения.Расхождения,							Результат.Расхождения);
		
	КонецЕсли;
	
	// Получаем результат сверки по ключам с разделенным периодом сверки (начало месяца - дата расторжения ДБО (включая) / дата расторжения ДБО (исключая) - конец месяца).
	Если СверкаСМесячнымОтчетомБрокера
		И КлючиДляСверки.СРазделеннымПериодом.Количество() > 0 Тогда
		
		Для Каждого Ключ Из КлючиДляСверки.СРазделеннымПериодом Цикл
			
			// Сравниваем данные отчетов по ключам.
			РезультатСравнения = ПроизвестиСверку(ДанныеОтчетов.МВТ, Ключ.НачалоПериода, Ключ.КонецПериода, Брокер, Депозитарий, Ложь);
			
			// Дополняем результат сверки результатами сравнения отчетов по ключам.
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатСравнения.СверенныеСчетаДоверительногоУправления,	Результат.СверенныеСчетаДоверительногоУправления);
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РезультатСравнения.Расхождения,							Результат.Расхождения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Заполнение_времени_получения_данных
	
	Для Каждого СверенныеДанные Из Результат.СверенныеСчетаДоверительногоУправления Цикл
		
		ВремяПолученияДанных = ДанныеОтчетов.ВремяПолученияДанных.Получить(СверенныеДанные.Стратегия);
		Если ВремяПолученияДанных <> Неопределено Тогда
			СверенныеДанные.ВремяПолученияДанных = ВремяПолученияДанных;
		КонецЕсли;
			
		ВремяПолученияДанных = ДанныеОтчетов.ВремяПолученияДанных.Получить(СверенныеДанные.СчетДоверительногоУправления);
		Если ВремяПолученияДанных <> Неопределено Тогда
			СверенныеДанные.ВремяПолученияДанных = ВремяПолученияДанных;
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	Возврат Результат;
	
КонецФункции

Функция ФайлИмпортаСоответствуетСхемеXSD(МассивДанных, СхемаИмя) Экспорт
	
	ФайлСхемы = Новый Файл(КаталогВременныхФайлов() + "Schema.xsd");
	Если ФайлСхемы.Существует() Тогда
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
	КонецЕсли;
	
	МакетСхемыXSD = ЭтотОбъект.ПолучитьМакет(СхемаИмя);
	
	Попытка
		МакетСхемыXSD.Записать(ФайлСхемы.ПолноеИмя);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось записать файл схемы в каталог временных файлов!" + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		КомОбъектКэшСхем = Новый COMОбъект("MSXML2.XMLSchemaCache.6.0");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось создать объект XMLSchemaCache" + Символы.ПС + ОписаниеОшибки());
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		КомОбъектКэшСхем.add(, ФайлСхемы.ПолноеИмя);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось подключить схему: " + Символы.ПС + ОписаниеОшибки());
		УдалитьФайлы(ФайлСхемы.ПолноеИмя);
		Возврат Ложь;
	КонецПопытки;
	
	ИмяФайлаДанных = ПолучитьИмяВременногоФайла("xml");
		
	Для Каждого ФайлДанных Из МассивДанных Цикл
		
		ФайлДанных.ДвоичныеДанные.Записать(ИмяФайлаДанных);
		
		Попытка
			КомОбъектДок = Новый COMОбъект("MSXML2.DOMDocument.6.0");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл не прошел проверку! Ошибка: Не удалось создать объект DOMDocument" + Символы.ПС + ОписаниеОшибки());
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
		КонецПопытки;
		
		КомОбъектДок.schemas          = КомОбъектКэшСхем;
		КомОбъектДок.async            = Ложь;
		КомОбъектДок.validateOnParse  = Истина;
		КомОбъектДок.resolveExternals = Истина;
		КомОбъектДок.SetProperty("MultipleErrorMessages", Истина);
		
		Попытка
			КомОбъектДок.load(ИмяФайлаДанных);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("XML файл [" + ФайлДанных.ИмяФайла + "] не прошел проверку! Ошибка: Не удалось загрузить файл остатков в объект DOMDocument" + Символы.ПС + ОписаниеОшибки());
			УдалитьФайлы(ИмяФайлаДанных);
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
		КонецПопытки;

		Если КомОбъектДок.parseError.errorCode <> 0 Тогда 
			
			ТекстСообщения = "Файл импорта [" + ФайлДанных.ИмяФайла + "] не соответствует схеме XSD."; 
		
			Для Каждого Ошибка из КомОбъектДок.parseError.AllErrors  Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + СокрЛП(Ошибка.errorXPath) + " Ошибка: " + СокрЛП(Ошибка.reason);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			УдалитьФайлы(ИмяФайлаДанных);
			УдалитьФайлы(ФайлСхемы.ПолноеИмя);
			Возврат Ложь;
			
		КонецЕсли;
			
	КонецЦикла;
	
	УдалитьФайлы(ИмяФайлаДанных);
	УдалитьФайлы(ФайлСхемы.ПолноеИмя);
	
	Возврат Истина;
	
КонецФункции // ФайлИмпортаСоответствуетСхемеXSD

Функция ПроизвестиСверку(МВТ, НачалоПериода, КонецПериода, Брокер, Депозитарий, ПолныйПериод, СчетаДУ = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("Организация",							Организация);
	Запрос.УстановитьПараметр("Брокер",									Брокер);
	Запрос.УстановитьПараметр("Депозитарий",							Депозитарий);
	Запрос.УстановитьПараметр("БрокерЮридическоеЛицо",					Брокер.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ВалютнаяСекция",							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX"));
	Запрос.УстановитьПараметр("СверятьБезУчетаВалютнойСекции",			СверятьБезУчетаВалютнойСекции);
	Запрос.УстановитьПараметр("НачалоПериода",							НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",							КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница",					Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУчета",							Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("ПолныйПериод",							ПолныйПериод);
	Запрос.УстановитьПараметр("Ключ",   								"УчетНеВедется");
	
	ИспользоватьОтборПоВидамДоговоровСчетовДУ = РаботаСВнешнимиСистемами.ИмпортРазделенПоОчередям(ЭтотОбъект.Организация) И  ЭтотОбъект.ОчередьЗагрузки <> 0;
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВидамДоговоровСчетовДУ", ИспользоватьОтборПоВидамДоговоровСчетовДУ);
	
	Если ИспользоватьОтборПоВидамДоговоровСчетовДУ Тогда
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", РаботаСВнешнимиСистемами.ПолучитьВидыДоговорДоверительногоУправленияДляОчереди(ЭтотОбъект.Организация, ЭтотОбъект.ОчередьЗагрузки));
	Иначе
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", Новый Массив());
	КонецЕсли;
	
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Расхождения = Запрос.Выполнить().Выгрузить();
	
	РезультатСравнения = Новый Структура("СверенныеСчетаДоверительногоУправления, Расхождения",
		МВТ.Таблицы["_СверенныеСчета"].ПолучитьДанные().Выгрузить(),
		Расхождения);
	
	Возврат РезультатСравнения;
	
КонецФункции

Функция ПолучитьКлючиДляСверки(МВТ, Брокер, СверкаСМесячнымОтчетомБрокера, НачалоПериода, КонецПериода, СчетаДУ = Неопределено)
	
	Если Не СчетаДУ = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтратегииИндивидуальногоИнвестированияСрезПоследних1.СчетДоверительногоУправления КАК СчетДУ
			|ИЗ
			|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
			|			&КоненцПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В (&СчетаДУ)) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&КоненцПериода, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних1
			|		ПО СтратегииИндивидуальногоИнвестированияСрезПоследних.Организация = СтратегииИндивидуальногоИнвестированияСрезПоследних1.Организация
			|			И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = СтратегииИндивидуальногоИнвестированияСрезПоследних1.Стратегия";
		Запрос.УстановитьПараметр("КоненцПериода", КонецПериода);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетаДУ", СчетаДУ);
		
		МассивСчетовСтратегии = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДУ");
		
		Если МассивСчетовСтратегии.Количество() > 0 Тогда
			РаботаСКоллекциями.ДополнитьМассив(СчетаДУ, МассивСчетовСтратегии, Истина);	
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("Брокер",							Брокер);
	Запрос.УстановитьПараметр("СверкаСМесячнымОтчетомБрокера",	СверкаСМесячнымОтчетомБрокера);
	Запрос.УстановитьПараметр("НачалоПериода",					НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",					КонецПериода);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоСчетамДУ", НЕ (СчетаДУ = Неопределено));
	Запрос.УстановитьПараметр("СчетаДУ", СчетаДУ);
	Запрос.УстановитьПараметр("Ключ",   "УчетНеВедется");
			
	ИспользоватьОтборПоВидамДоговоровСчетовДУ = РаботаСВнешнимиСистемами.ИмпортРазделенПоОчередям(ЭтотОбъект.Организация) И  ЭтотОбъект.ОчередьЗагрузки <> 0;
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВидамДоговоровСчетовДУ", ИспользоватьОтборПоВидамДоговоровСчетовДУ);
	
	Если ИспользоватьОтборПоВидамДоговоровСчетовДУ Тогда
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", РаботаСВнешнимиСистемами.ПолучитьВидыДоговорДоверительногоУправленияДляОчереди(ЭтотОбъект.Организация, ЭтотОбъект.ОчередьЗагрузки));
	Иначе
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", Новый Массив());
	КонецЕсли;	
	
	Запрос.Текст =
#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Объект КАК Счет
		|ПОМЕСТИТЬ _НеИспользуемыеСчетаДУ
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект ССЫЛКА Справочник.СчетаДоверительногоУправления
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ
		|	И ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДБО,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СДУ,
		|	&СверкаСМесячнымОтчетомБрокера
		|		И НЕ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|		И НЕ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|		И УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения < &КонецПериода КАК РазделитьПериодСверки,
		|	ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРасторжения
		|ПОМЕСТИТЬ _ДБОСДУ
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Брокер = &Брокер
		|				И (НЕ &ИспользоватьОтборПоСчетамДУ ИЛИ СчетДоверительногоУправления В (&СчетаДУ)) 
		|				И (НЕ &ИспользоватьОтборПоВидамДоговоровСчетовДУ ИЛИ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровСчетовДУ))
		|				И НЕ СчетДоверительногоУправления  В
		|				(ВЫБРАТЬ
		|					ВТ.Счет
		|				ИЗ
		|					_НеИспользуемыеСчетаДУ КАК ВТ)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код <> ""0""
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &НачалоПериода)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДБОСДУ.ДБО КАК ДБО,
		|	_ДБОСДУ.РазделитьПериодСверки КАК РазделитьПериодСверки,
		|	_ДБОСДУ.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _ДБОСтратегий
		|ИЗ
		|	_ДБОСДУ КАК _ДБОСДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДБОСДУ.ДБО,
		|	_ДБОСДУ.РазделитьПериодСверки,
		|	_ДБОСДУ.ДатаРасторжения
		//|
		//|ИМЕЮЩИЕ
		//|	КОЛИЧЕСТВО(_ДБОСДУ.СДУ) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДБОСтратегий.ДБО КАК ДБО,
		|	СтратегииИндивидуальногоИнвестирования.Ссылка КАК Стратегия,
		|	_ДБОСДУ.СДУ КАК СДУ,
		|	_ДБОСтратегий.РазделитьПериодСверки КАК РазделитьПериодСверки,
		|	_ДБОСтратегий.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _Стратегии
		|ИЗ
		|	_ДБОСтратегий КАК _ДБОСтратегий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ПО _ДБОСтратегий.ДБО = СтратегииИндивидуальногоИнвестирования.ОсновнойБрокерскийДоговор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДБОСДУ КАК _ДБОСДУ
		|		ПО _ДБОСтратегий.ДБО = _ДБОСДУ.ДБО
		|ГДЕ
		|	(_ДБОСтратегий.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _ДБОСтратегий.ДатаРасторжения >= &КонецПериода)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Стратегии.ДБО КАК ДБО,
		|	_Стратегии.Стратегия КАК СА,
		|	_Стратегии.СДУ КАК СДУ,
		|	_Стратегии.РазделитьПериодСверки КАК РазделитьПериодСверки,
		|	_Стратегии.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _Ключи
		|ИЗ
		|	_Стратегии КАК _Стратегии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДБОСДУ.ДБО,
		|	_ДБОСДУ.СДУ,
		|	_ДБОСДУ.СДУ,
		|	_ДБОСДУ.РазделитьПериодСверки,
		|	_ДБОСДУ.ДатаРасторжения
		|ИЗ
		|	_ДБОСДУ КАК _ДБОСДУ
		|ГДЕ
		|	НЕ _ДБОСДУ.ДБО В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					_Стратегии.ДБО КАК ДБО
		|				ИЗ
		|					_Стратегии КАК _Стратегии)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК РазделенПериодСверки,
		|	_Ключи.ДБО КАК ДБО,
		|	_Ключи.СА КАК СА,
		|	_Ключи.СДУ КАК СДУ,
		|	&НачалоПериода КАК НачалоПериода,
		|	_Ключи.ДатаРасторжения КАК КонецПериода
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Ключи КАК _Ключи
		|ГДЕ
		|	_Ключи.РазделитьПериодСверки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	_Ключи.ДБО,
		|	_Ключи.СА,
		|	_Ключи.СДУ,
		|	ДОБАВИТЬКДАТЕ(_Ключи.ДатаРасторжения, ДЕНЬ, 1),
		|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
		|ИЗ
		|	_Ключи КАК _Ключи
		|ГДЕ
		|	_Ключи.РазделитьПериодСверки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	_Ключи.ДБО,
		|	_Ключи.СА,
		|	_Ключи.СДУ,
		|	&НачалоПериода,
		|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
		|ИЗ
		|	_Ключи КАК _Ключи
		|ГДЕ
		|	НЕ _Ключи.РазделитьПериодСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.ДБО КАК ДБО,
		|	_ИтоговаяТаблица.СА КАК СА,
		|	_ИтоговаяТаблица.СДУ КАК СДУ,
		|	_ИтоговаяТаблица.НачалоПериода КАК НачалоПериода,
		|	_ИтоговаяТаблица.КонецПериода КАК КонецПериода
		|ПОМЕСТИТЬ _КлючиСПолнымПериодом
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|ГДЕ
		|	НЕ _ИтоговаяТаблица.РазделенПериодСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.ДБО КАК ДБО,
		|	_ИтоговаяТаблица.СА КАК СА,
		|	_ИтоговаяТаблица.СДУ КАК СДУ,
		|	_ИтоговаяТаблица.НачалоПериода КАК НачалоПериода,
		|	_ИтоговаяТаблица.КонецПериода КАК КонецПериода
		|ПОМЕСТИТЬ _КлючиСРазделеннымПериодом
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|ГДЕ
		|	_ИтоговаяТаблица.РазделенПериодСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлючиСПолнымПериодом.ДБО КАК ДБО,
		|	_КлючиСПолнымПериодом.СА КАК СА,
		|	_КлючиСПолнымПериодом.СДУ КАК СДУ,
		|	_КлючиСПолнымПериодом.НачалоПериода КАК НачалоПериода,
		|	_КлючиСПолнымПериодом.КонецПериода КАК КонецПериода
		|ИЗ
		|	_КлючиСПолнымПериодом КАК _КлючиСПолнымПериодом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КлючиСРазделеннымПериодом.НачалоПериода КАК НачалоПериода,
		|	_КлючиСРазделеннымПериодом.КонецПериода КАК КонецПериода
		|ИЗ
		|	_КлючиСРазделеннымПериодом КАК _КлючиСРазделеннымПериодом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДБОСДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДБОСтратегий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Стратегии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Ключи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяТаблица";
#КонецОбласти

	ПакетныйРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура();
	Результат.Вставить("СПолнымПериодом",		ПакетныйРезультатЗапроса[8].Выгрузить());
	Результат.Вставить("СРазделеннымПериодом",	ПакетныйРезультатЗапроса[9].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Функция ПоместитьДанныеОтчетовВМВТ(ДанныеОтчетов, Брокер, КонецПериода)
	
	Результат = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
		
	Запрос.МенеджерВременныхТаблиц = Результат;
	
	Запрос.УстановитьПараметр("Организация",							Организация);
	Запрос.УстановитьПараметр("Брокер",									Брокер);
	Запрос.УстановитьПараметр("КонецПериода",							КонецПериода);
	Запрос.УстановитьПараметр("СверятьБезУчетаВалютнойСекции",			СверятьБезУчетаВалютнойСекции);
	Запрос.УстановитьПараметр("ОстаткиДенежныхСредств",					ДанныеОтчетов.ОстаткиДенежныхСредств);
	Запрос.УстановитьПараметр("ОбязательстваПоДенежнымСредствам",		ДанныеОтчетов.ОбязательстваПоДенежнымСредствам);
	Запрос.УстановитьПараметр("ОстаткиЗадолженностиПоКомиссииНаНачало",	ДанныеОтчетов.ОстаткиЗадолженностиПоКомиссииНаНачало);
	Запрос.УстановитьПараметр("НачисленнаяКомиссияЗаПериод",			ДанныеОтчетов.НачисленнаяКомиссияЗаПериод);
	Запрос.УстановитьПараметр("ОплаченнаяКомиссияЗаПериод",				ДанныеОтчетов.ОплаченнаяКомиссияЗаПериод);
	Запрос.УстановитьПараметр("ОстаткиЗадолженностиПоКомиссииНаКонец",	ДанныеОтчетов.ОстаткиЗадолженностиПоКомиссииНаКонец);
	Запрос.УстановитьПараметр("ДвиженияДенежныхСредств",				ДанныеОтчетов.ДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("ЗаблокированныеДенежныеСредства",		ДанныеОтчетов.ЗаблокированныеДенежныеСредства);
	Запрос.УстановитьПараметр("ОжидаемыеПоступленияДенежныхСредств",	ДанныеОтчетов.ОжидаемыеПоступленияДенежныхСредств);
	Запрос.УстановитьПараметр("КонверсионныеСделки",					ДанныеОтчетов.КонверсионныеСделки);
	Запрос.УстановитьПараметр("НезавершенныеКонверсионныеСделки",		ДанныеОтчетов.НезавершенныеКонверсионныеСделки);
	Запрос.УстановитьПараметр("ОстаткиАкций",							ДанныеОтчетов.ОстаткиАкций);
	Запрос.УстановитьПараметр("ОстаткиОблигаций",						ДанныеОтчетов.ОстаткиОблигаций);
	Запрос.УстановитьПараметр("ОстаткиПаев",							ДанныеОтчетов.ОстаткиПаев);
	Запрос.УстановитьПараметр("ЗадолженностьПоЦБ",						ДанныеОтчетов.ЗадолженностьПоЦБ);
	Запрос.УстановитьПараметр("ДвиженияАкций",							ДанныеОтчетов.ДвиженияАкций);
	Запрос.УстановитьПараметр("ДвиженияОблигаций",						ДанныеОтчетов.ДвиженияОблигаций);
	Запрос.УстановитьПараметр("ДвиженияПаев",							ДанныеОтчетов.ДвиженияПаев);
	Запрос.УстановитьПараметр("ОжидаемыеПоступленияАкций",				ДанныеОтчетов.ОжидаемыеПоступленияАкций);
	Запрос.УстановитьПараметр("ОжидаемыеПоступленияОблигаций",			ДанныеОтчетов.ОжидаемыеПоступленияОблигаций);
	Запрос.УстановитьПараметр("ОжидаемыеПоступленияПаев",				ДанныеОтчетов.ОжидаемыеПоступленияПаев);
	Запрос.УстановитьПараметр("ЗаблокированныеАкции",					ДанныеОтчетов.ЗаблокированныеАкции);
	Запрос.УстановитьПараметр("ЗаблокированныеОблигации",				ДанныеОтчетов.ЗаблокированныеОблигации);
	Запрос.УстановитьПараметр("ЗаблокированныеПаи",						ДанныеОтчетов.ЗаблокированныеПаи);
	
	Запрос.Текст =
#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.ДБО КАК ДБО,
		|	ОстаткиДенежныхСредств.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОстаткиДенежныхСредств.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОстаткиДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ОстаткиДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ОстаткиДенежныхСредств.ВнебиржевойРынок КАК ВнебиржевойРынок,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредств.НачальныйОстаток КАК НачальныйОстатокБрокер,
		|	ОстаткиДенежныхСредств.КонечныйОстаток КАК КонечныйОстатокБрокер
		|ПОМЕСТИТЬ ВТ_ОстаткиДенежныхСредств
		|ИЗ
		|	&ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбязательстваПоДенежнымСредствам.ДБО КАК ДБО,
		|	ОбязательстваПоДенежнымСредствам.СА КАК СА,
		|	ОбязательстваПоДенежнымСредствам.НачалоПериода КАК НачалоПериода,
		|	ОбязательстваПоДенежнымСредствам.КонецПериода КАК КонецПериода,
		|	ОбязательстваПоДенежнымСредствам.Валюта КАК Валюта,
		|	ОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженностьБрокер,
		|	ОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженность КАК КредиторскаяЗадолженностьБрокер
		|ПОМЕСТИТЬ ВТ_ОбязательстваПоДенежнымСредствам
		|ИЗ
		|	&ОбязательстваПоДенежнымСредствам КАК ОбязательстваПоДенежнымСредствам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.ДБО КАК ДБО,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.СА КАК СА,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.НачалоПериода КАК НачалоПериода,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.КонецПериода КАК КонецПериода,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.Валюта КАК Валюта,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.ТипКомиссии КАК ТипКомиссии,
		|	ОстаткиЗадолженностиПоКомиссииНаНачало.Сумма КАК НачальныйОстатокБрокер
		|ПОМЕСТИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало
		|ИЗ
		|	&ОстаткиЗадолженностиПоКомиссииНаНачало КАК ОстаткиЗадолженностиПоКомиссииНаНачало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленнаяКомиссияЗаПериод.ДБО КАК ДБО,
		|	НачисленнаяКомиссияЗаПериод.СА КАК СА,
		|	НачисленнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
		|	НачисленнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
		|	НачисленнаяКомиссияЗаПериод.Валюта КАК Валюта,
		|	НачисленнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
		|	НачисленнаяКомиссияЗаПериод.Сумма КАК СуммаБрокер
		|ПОМЕСТИТЬ ВТ_НачисленнаяКомиссияЗаПериод
		|ИЗ
		|	&НачисленнаяКомиссияЗаПериод КАК НачисленнаяКомиссияЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплаченнаяКомиссияЗаПериод.ДБО КАК ДБО,
		|	ОплаченнаяКомиссияЗаПериод.СА КАК СА,
		|	ОплаченнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
		|	ОплаченнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
		|	ОплаченнаяКомиссияЗаПериод.Валюта КАК Валюта,
		|	ОплаченнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
		|	ОплаченнаяКомиссияЗаПериод.Сумма КАК СуммаБрокер
		|ПОМЕСТИТЬ ВТ_ОплаченнаяКомиссияЗаПериод
		|ИЗ
		|	&ОплаченнаяКомиссияЗаПериод КАК ОплаченнаяКомиссияЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.ДБО КАК ДБО,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.СА КАК СА,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.НачалоПериода КАК НачалоПериода,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.КонецПериода КАК КонецПериода,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.Валюта КАК Валюта,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.ТипКомиссии КАК ТипКомиссии,
		|	ОстаткиЗадолженностиПоКомиссииНаКонец.Сумма КАК КонечныйОстатокБрокер
		|ПОМЕСТИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец
		|ИЗ
		|	&ОстаткиЗадолженностиПоКомиссииНаКонец КАК ОстаткиЗадолженностиПоКомиссииНаКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияДенежныхСредств.ДБО КАК ДБО,
		|	ДвиженияДенежныхСредств.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ДвиженияДенежныхСредств.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ДвиженияДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ДвиженияДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ДвиженияДенежныхСредств.Валюта КАК Валюта,
		|	ДвиженияДенежныхСредств.Приход КАК ПриходБрокер,
		|	ДвиженияДенежныхСредств.Расход КАК РасходБрокер
		|ПОМЕСТИТЬ ВТ_ДвиженияДенежныхСредств
		|ИЗ
		|	&ДвиженияДенежныхСредств КАК ДвиженияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаблокированныеДенежныеСредства.ДБО КАК ДБО,
		|	ЗаблокированныеДенежныеСредства.СА КАК СА,
		|	ЗаблокированныеДенежныеСредства.НачалоПериода КАК НачалоПериода,
		|	ЗаблокированныеДенежныеСредства.КонецПериода КАК КонецПериода,
		|	ЗаблокированныеДенежныеСредства.Валюта КАК Валюта,
		|	ЗаблокированныеДенежныеСредства.Сумма КАК СуммаБрокер
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеДенежныеСредства
		|ИЗ
		|	&ЗаблокированныеДенежныеСредства КАК ЗаблокированныеДенежныеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОжидаемыеПоступленияДенежныхСредств.ДБО КАК ДБО,
		|	ОжидаемыеПоступленияДенежныхСредств.СА КАК СА,
		|	ОжидаемыеПоступленияДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ОжидаемыеПоступленияДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ОжидаемыеПоступленияДенежныхСредств.Валюта КАК Валюта,
		|	ОжидаемыеПоступленияДенежныхСредств.Сумма КАК СуммаБрокер
		|ПОМЕСТИТЬ ВТ_ОжидаемыеПоступленияДенежныхСредств
		|ИЗ
		|	&ОжидаемыеПоступленияДенежныхСредств КАК ОжидаемыеПоступленияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонверсионныеСделки.ДБО КАК ДБО,
		|	КонверсионныеСделки.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ КонверсионныеСделки.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	КонверсионныеСделки.НачалоПериода КАК НачалоПериода,
		|	КонверсионныеСделки.КонецПериода КАК КонецПериода,
		|	КонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
		|	КонверсионныеСделки.Дата КАК Дата,
		|	КонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
		|	КонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
		|	КонверсионныеСделки.Курс КАК Курс,
		|	КонверсионныеСделки.Сумма КАК Сумма,
		|	КонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
		|	КонверсионныеСделки.Контрвалюта КАК Контрвалюта,
		|	КонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ ВТ_КонверсионныеСделки
		|ИЗ
		|	&КонверсионныеСделки КАК КонверсионныеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НезавершенныеКонверсионныеСделки.ДБО КАК ДБО,
		|	НезавершенныеКонверсионныеСделки.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ НезавершенныеКонверсионныеСделки.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	НезавершенныеКонверсионныеСделки.НачалоПериода КАК НачалоПериода,
		|	НезавершенныеКонверсионныеСделки.КонецПериода КАК КонецПериода,
		|	НезавершенныеКонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
		|	НезавершенныеКонверсионныеСделки.Дата КАК Дата,
		|	НезавершенныеКонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
		|	НезавершенныеКонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
		|	НезавершенныеКонверсионныеСделки.Курс КАК Курс,
		|	НезавершенныеКонверсионныеСделки.Сумма КАК Сумма,
		|	НезавершенныеКонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
		|	НезавершенныеКонверсионныеСделки.Контрвалюта КАК Контрвалюта,
		|	НезавершенныеКонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ ВТ_НезавершенныеКонверсионныеСделки
		|ИЗ
		|	&НезавершенныеКонверсионныеСделки КАК НезавершенныеКонверсионныеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАкций.ДБО КАК ДБО,
		|	ОстаткиАкций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОстаткиАкций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОстаткиАкций.НачалоПериода КАК НачалоПериода,
		|	ОстаткиАкций.КонецПериода КАК КонецПериода,
		|	ОстаткиАкций.Акция КАК ЦБ,
		|	ОстаткиАкций.НачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиАкций.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиАкций
		|ИЗ
		|	&ОстаткиАкций КАК ОстаткиАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиОблигаций.ДБО КАК ДБО,
		|	ОстаткиОблигаций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОстаткиОблигаций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОстаткиОблигаций.НачалоПериода КАК НачалоПериода,
		|	ОстаткиОблигаций.КонецПериода КАК КонецПериода,
		|	ОстаткиОблигаций.Облигация КАК ЦБ,
		|	ОстаткиОблигаций.НачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиОблигаций.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиОблигаций
		|ИЗ
		|	&ОстаткиОблигаций КАК ОстаткиОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиПаев.ДБО КАК ДБО,
		|	ОстаткиПаев.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОстаткиПаев.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОстаткиПаев.НачалоПериода КАК НачалоПериода,
		|	ОстаткиПаев.КонецПериода КАК КонецПериода,
		|	ОстаткиПаев.Пай КАК ЦБ,
		|	ОстаткиПаев.НачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиПаев.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиПаев
		|ИЗ
		|	&ОстаткиПаев КАК ОстаткиПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиАкций.ДБО КАК ДБО,
		|	ВТ_ОстаткиАкций.СА КАК СА,
		|	ВТ_ОстаткиАкций.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОстаткиАкций.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОстаткиАкций.КонецПериода КАК КонецПериода,
		|	ВТ_ОстаткиАкций.ЦБ КАК ЦБ,
		|	ВТ_ОстаткиАкций.НачальныйОстаток КАК НачальныйОстаток,
		|	ВТ_ОстаткиАкций.КонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиЦенныхБумаг
		|ИЗ
		|	ВТ_ОстаткиАкций КАК ВТ_ОстаткиАкций
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОстаткиОблигаций.ДБО,
		|	ВТ_ОстаткиОблигаций.СА,
		|	ВТ_ОстаткиОблигаций.ВалютнаяСекция,
		|	ВТ_ОстаткиОблигаций.НачалоПериода,
		|	ВТ_ОстаткиОблигаций.КонецПериода,
		|	ВТ_ОстаткиОблигаций.ЦБ,
		|	ВТ_ОстаткиОблигаций.НачальныйОстаток,
		|	ВТ_ОстаткиОблигаций.КонечныйОстаток
		|ИЗ
		|	ВТ_ОстаткиОблигаций КАК ВТ_ОстаткиОблигаций
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПаев.ДБО,
		|	ВТ_ОстаткиПаев.СА,
		|	ВТ_ОстаткиПаев.ВалютнаяСекция,
		|	ВТ_ОстаткиПаев.НачалоПериода,
		|	ВТ_ОстаткиПаев.КонецПериода,
		|	ВТ_ОстаткиПаев.ЦБ,
		|	ВТ_ОстаткиПаев.НачальныйОстаток,
		|	ВТ_ОстаткиПаев.КонечныйОстаток
		|ИЗ
		|	ВТ_ОстаткиПаев КАК ВТ_ОстаткиПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияАкций.ДБО КАК ДБО,
		|	ДвиженияАкций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ДвиженияАкций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ДвиженияАкций.НачалоПериода КАК НачалоПериода,
		|	ДвиженияАкций.КонецПериода КАК КонецПериода,
		|	ДвиженияАкций.Акция КАК ЦБ,
		|	ДвиженияАкций.ДатаОперации КАК ДатаОперации,
		|	ДвиженияАкций.Приход КАК Приход,
		|	ДвиженияАкций.Расход КАК Расход
		|ПОМЕСТИТЬ ВТ_ДвиженияАкций
		|ИЗ
		|	&ДвиженияАкций КАК ДвиженияАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияОблигаций.ДБО КАК ДБО,
		|	ДвиженияОблигаций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ДвиженияОблигаций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ДвиженияОблигаций.НачалоПериода КАК НачалоПериода,
		|	ДвиженияОблигаций.КонецПериода КАК КонецПериода,
		|	ДвиженияОблигаций.Облигация КАК ЦБ,
		|	ДвиженияОблигаций.ДатаОперации КАК ДатаОперации,
		|	ДвиженияОблигаций.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияОблигаций
		|ИЗ
		|	&ДвиженияОблигаций КАК ДвиженияОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияПаев.ДБО КАК ДБО,
		|	ДвиженияПаев.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ДвиженияПаев.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ДвиженияПаев.НачалоПериода КАК НачалоПериода,
		|	ДвиженияПаев.КонецПериода КАК КонецПериода,
		|	ДвиженияПаев.Пай КАК ЦБ,
		|	ДвиженияПаев.ДатаОперации КАК ДатаОперации,
		|	ДвиженияПаев.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияПаев
		|ИЗ
		|	&ДвиженияПаев КАК ДвиженияПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДвиженияОблигаций.ДБО КАК ДБО,
		|	ВТ_ДвиженияОблигаций.СА КАК СА,
		|	ВТ_ДвиженияОблигаций.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ДвиженияОблигаций.НачалоПериода КАК НачалоПериода,
		|	ВТ_ДвиженияОблигаций.КонецПериода КАК КонецПериода,
		|	ВТ_ДвиженияОблигаций.ЦБ КАК ЦБ,
		|	ВТ_ДвиженияОблигаций.ДатаОперации КАК ДатаОперации,
		|	ВТ_ДвиженияОблигаций.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДвиженияЦенныхБумаг
		|ИЗ
		|	ВТ_ДвиженияОблигаций КАК ВТ_ДвиженияОблигаций
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДвиженияПаев.ДБО,
		|	ВТ_ДвиженияПаев.СА,
		|	ВТ_ДвиженияПаев.ВалютнаяСекция,
		|	ВТ_ДвиженияПаев.НачалоПериода,
		|	ВТ_ДвиженияПаев.КонецПериода,
		|	ВТ_ДвиженияПаев.ЦБ,
		|	ВТ_ДвиженияПаев.ДатаОперации,
		|	ВТ_ДвиженияПаев.Количество
		|ИЗ
		|	ВТ_ДвиженияПаев КАК ВТ_ДвиженияПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностьПоЦБ.ДБО КАК ДБО,
		|	ЗадолженностьПоЦБ.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗадолженностьПоЦБ.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ЗадолженностьПоЦБ.НачалоПериода КАК НачалоПериода,
		|	ЗадолженностьПоЦБ.КонецПериода КАК КонецПериода,
		|	ЗадолженностьПоЦБ.ЦеннаяБумага КАК ЦБ,
		|	ЗадолженностьПоЦБ.ИсходящийОстаток КАК ИсходящийОстаток,
		|	ЗадолженностьПоЦБ.ОбязательстваКПолучению КАК ОбязательстваКПолучению,
		|	ЗадолженностьПоЦБ.ОбязательстваКВыбытию КАК ОбязательстваКВыбытию,
		|	ЗадолженностьПоЦБ.ПлановыйИсходящийОстаток КАК ПлановыйИсходящийОстаток
		|ПОМЕСТИТЬ ВТ_ЗадолженностьПоЦБ
		|ИЗ
		|	&ЗадолженностьПоЦБ КАК ЗадолженностьПоЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОжидаемыеПоступленияАкций.ДБО КАК ДБО,
		|	ОжидаемыеПоступленияАкций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОжидаемыеПоступленияАкций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОжидаемыеПоступленияАкций.НачалоПериода КАК НачалоПериода,
		|	ОжидаемыеПоступленияАкций.КонецПериода КАК КонецПериода,
		|	ОжидаемыеПоступленияАкций.ДатаОперации КАК ДатаОперации,
		|	ОжидаемыеПоступленияАкций.Акция КАК Акция,
		|	ОжидаемыеПоступленияАкций.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ОжидаемыеПоступленияАкций
		|ИЗ
		|	&ОжидаемыеПоступленияАкций КАК ОжидаемыеПоступленияАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОжидаемыеПоступленияОблигаций.ДБО КАК ДБО,
		|	ОжидаемыеПоступленияОблигаций.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОжидаемыеПоступленияОблигаций.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОжидаемыеПоступленияОблигаций.НачалоПериода КАК НачалоПериода,
		|	ОжидаемыеПоступленияОблигаций.КонецПериода КАК КонецПериода,
		|	ОжидаемыеПоступленияОблигаций.ДатаОперации КАК ДатаОперации,
		|	ОжидаемыеПоступленияОблигаций.Облигация КАК Облигация,
		|	ОжидаемыеПоступленияОблигаций.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ОжидаемыеПоступленияОблигаций
		|ИЗ
		|	&ОжидаемыеПоступленияОблигаций КАК ОжидаемыеПоступленияОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОжидаемыеПоступленияПаев.ДБО КАК ДБО,
		|	ОжидаемыеПоступленияПаев.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ОжидаемыеПоступленияПаев.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ОжидаемыеПоступленияПаев.НачалоПериода КАК НачалоПериода,
		|	ОжидаемыеПоступленияПаев.КонецПериода КАК КонецПериода,
		|	ОжидаемыеПоступленияПаев.ДатаОперации КАК ДатаОперации,
		|	ОжидаемыеПоступленияПаев.Пай КАК Пай,
		|	ОжидаемыеПоступленияПаев.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ОжидаемыеПоступленияПаев
		|ИЗ
		|	&ОжидаемыеПоступленияПаев КАК ОжидаемыеПоступленияПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаблокированныеАкции.ДБО КАК ДБО,
		|	ЗаблокированныеАкции.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗаблокированныеАкции.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ЗаблокированныеАкции.НачалоПериода КАК НачалоПериода,
		|	ЗаблокированныеАкции.КонецПериода КАК КонецПериода,
		|	ЗаблокированныеАкции.Акция КАК Акция,
		|	ЗаблокированныеАкции.Заблокировано КАК Заблокировано
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеАкции
		|ИЗ
		|	&ЗаблокированныеАкции КАК ЗаблокированныеАкции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаблокированныеОблигации.ДБО КАК ДБО,
		|	ЗаблокированныеОблигации.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗаблокированныеОблигации.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ЗаблокированныеОблигации.НачалоПериода КАК НачалоПериода,
		|	ЗаблокированныеОблигации.КонецПериода КАК КонецПериода,
		|	ЗаблокированныеОблигации.Облигация КАК Облигация,
		|	ЗаблокированныеОблигации.Заблокировано КАК Заблокировано
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеОблигации
		|ИЗ
		|	&ЗаблокированныеОблигации КАК ЗаблокированныеОблигации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаблокированныеПаи.ДБО КАК ДБО,
		|	ЗаблокированныеПаи.СА КАК СА,
		|	ВЫБОР
		|		КОГДА &СверятьБезУчетаВалютнойСекции
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗаблокированныеПаи.ВалютнаяСекция
		|	КОНЕЦ КАК ВалютнаяСекция,
		|	ЗаблокированныеПаи.НачалоПериода КАК НачалоПериода,
		|	ЗаблокированныеПаи.КонецПериода КАК КонецПериода,
		|	ЗаблокированныеПаи.Пай КАК Пай,
		|	ЗаблокированныеПаи.Заблокировано КАК Заблокировано
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеПаи
		|ИЗ
		|	&ЗаблокированныеПаи КАК ЗаблокированныеПаи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаблокированныеАкции.ДБО КАК ДБО,
		|	ВТ_ЗаблокированныеАкции.СА КАК СА,
		|	ВТ_ЗаблокированныеАкции.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ЗаблокированныеАкции.НачалоПериода КАК НачалоПериода,
		|	ВТ_ЗаблокированныеАкции.КонецПериода КАК КонецПериода,
		|	ВТ_ЗаблокированныеАкции.Акция КАК ЦБ,
		|	ВТ_ЗаблокированныеАкции.Заблокировано КАК Заблокировано
		|ПОМЕСТИТЬ ВТ_ЗаблокированныеЦенныеБумаги
		|ИЗ
		|	ВТ_ЗаблокированныеАкции КАК ВТ_ЗаблокированныеАкции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаблокированныеОблигации.ДБО,
		|	ВТ_ЗаблокированныеОблигации.СА,
		|	ВТ_ЗаблокированныеОблигации.ВалютнаяСекция,
		|	ВТ_ЗаблокированныеОблигации.НачалоПериода,
		|	ВТ_ЗаблокированныеОблигации.КонецПериода,
		|	ВТ_ЗаблокированныеОблигации.Облигация,
		|	ВТ_ЗаблокированныеОблигации.Заблокировано
		|ИЗ
		|	ВТ_ЗаблокированныеОблигации КАК ВТ_ЗаблокированныеОблигации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаблокированныеПаи.ДБО,
		|	ВТ_ЗаблокированныеПаи.СА,
		|	ВТ_ЗаблокированныеПаи.ВалютнаяСекция,
		|	ВТ_ЗаблокированныеПаи.НачалоПериода,
		|	ВТ_ЗаблокированныеПаи.КонецПериода,
		|	ВТ_ЗаблокированныеПаи.Пай,
		|	ВТ_ЗаблокированныеПаи.Заблокировано
		|ИЗ
		|	ВТ_ЗаблокированныеПаи КАК ВТ_ЗаблокированныеПаи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.ДБО КАК ДБО,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.СА КАК СА,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.КонецПериода КАК КонецПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.Валюта КАК Валюта,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.ТипКомиссии КАК ТипКомиссии,
		|	СУММА(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.НачальныйОстатокБрокер) КАК НачальныйОстатокБрокер
		|ПОМЕСТИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые
		|ИЗ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.ДБО,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.СА,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.НачалоПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.КонецПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.Валюта,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.ТипКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.ДБО КАК ДБО,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.СА КАК СА,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.КонецПериода КАК КонецПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.Валюта КАК Валюта,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.ТипКомиссии КАК ТипКомиссии,
		|	СУММА(ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.КонечныйОстатокБрокер) КАК КонечныйОстатокБрокер
		|ПОМЕСТИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые
		|ИЗ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.ДБО,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.СА,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.НачалоПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.КонецПериода,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.Валюта,
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.ТипКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиДенежныхСредств.ДБО КАК ДБО,
		|	ВТ_ОстаткиДенежныхСредств.СА КАК СА,
		|	ВТ_ОстаткиДенежныхСредств.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОстаткиДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОстаткиДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ВТ_ОстаткиДенежныхСредств.ВнебиржевойРынок КАК ВнебиржевойРынок,
		|	ВТ_ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ВТ_ОстаткиДенежныхСредств.НачальныйОстатокБрокер) КАК НачальныйОстатокБрокер,
		|	СУММА(ВТ_ОстаткиДенежныхСредств.КонечныйОстатокБрокер) КАК КонечныйОстатокБрокер
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредств
		|ИЗ
		|	ВТ_ОстаткиДенежныхСредств КАК ВТ_ОстаткиДенежныхСредств
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиДенежныхСредств.ДБО,
		|	ВТ_ОстаткиДенежныхСредств.СА,
		|	ВТ_ОстаткиДенежныхСредств.ВалютнаяСекция,
		|	ВТ_ОстаткиДенежныхСредств.Валюта,
		|	ВТ_ОстаткиДенежныхСредств.ВнебиржевойРынок,
		|	ВТ_ОстаткиДенежныхСредств.НачалоПериода,
		|	ВТ_ОстаткиДенежныхСредств.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	ВалютнаяСекция,
		|	ВнебиржевойРынок,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОбязательстваПоДенежнымСредствам.ДБО КАК ДБО,
		|	ВТ_ОбязательстваПоДенежнымСредствам.СА КАК СА,
		|	ВТ_ОбязательстваПоДенежнымСредствам.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОбязательстваПоДенежнымСредствам.КонецПериода КАК КонецПериода,
		|	ВТ_ОбязательстваПоДенежнымСредствам.Валюта КАК Валюта,
		|	СУММА(ВТ_ОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженностьБрокер) КАК ДебиторскаяЗадолженностьБрокер,
		|	СУММА(ВТ_ОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженностьБрокер) КАК КредиторскаяЗадолженностьБрокер
		|ПОМЕСТИТЬ _ОбязательстваПоДенежнымСредствам
		|ИЗ
		|	ВТ_ОбязательстваПоДенежнымСредствам КАК ВТ_ОбязательстваПоДенежнымСредствам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбязательстваПоДенежнымСредствам.ДБО,
		|	ВТ_ОбязательстваПоДенежнымСредствам.СА,
		|	ВТ_ОбязательстваПоДенежнымСредствам.Валюта,
		|	ВТ_ОбязательстваПоДенежнымСредствам.НачалоПериода,
		|	ВТ_ОбязательстваПоДенежнымСредствам.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ДБО, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ДБО) КАК ДБО,
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.СА, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.СА) КАК СА,
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.НачалоПериода, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.НачалоПериода) КАК НачалоПериода,
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.КонецПериода, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.КонецПериода) КАК КонецПериода,
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.Валюта, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.Валюта) КАК Валюта,
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ТипКомиссии, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ТипКомиссии) КАК ТипКомиссии,
		|	СУММА(ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.НачальныйОстатокБрокер, 0)) КАК НачальныйОстатокБрокер,
		|	СУММА(ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.КонечныйОстатокБрокер, 0)) КАК КонечныйОстатокБрокер
		|ПОМЕСТИТЬ _ОстаткиЗадолженностиПоКомиссии
		|ИЗ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые
		|		ПО ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ДБО = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ДБО
		|			И ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.СА = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.СА
		|			И ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.НачалоПериода = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.НачалоПериода
		|			И ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.КонецПериода = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.КонецПериода
		|			И ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.Валюта = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.Валюта
		|			И ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ТипКомиссии = ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ТипКомиссии
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ДБО, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ДБО),
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.СА, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.СА),
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.НачалоПериода, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.НачалоПериода),
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.КонецПериода, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.КонецПериода),
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.Валюта, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.Валюта),
		|	ЕСТЬNULL(ВТ_ОстаткиЗадолженностиПоКомиссииНаНачалоСвернутые.ТипКомиссии, ВТ_ОстаткиЗадолженностиПоКомиссииНаКонецСвернутые.ТипКомиссии)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НачисленнаяКомиссияЗаПериод.ДБО КАК ДБО,
		|	ВТ_НачисленнаяКомиссияЗаПериод.СА КАК СА,
		|	ВТ_НачисленнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
		|	ВТ_НачисленнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
		|	ВТ_НачисленнаяКомиссияЗаПериод.Валюта КАК Валюта,
		|	ВТ_НачисленнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
		|	СУММА(ВТ_НачисленнаяКомиссияЗаПериод.СуммаБрокер) КАК СуммаБрокер
		|ПОМЕСТИТЬ _НачисленнаяКомиссияЗаПериод
		|ИЗ
		|	ВТ_НачисленнаяКомиссияЗаПериод КАК ВТ_НачисленнаяКомиссияЗаПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НачисленнаяКомиссияЗаПериод.ДБО,
		|	ВТ_НачисленнаяКомиссияЗаПериод.СА,
		|	ВТ_НачисленнаяКомиссияЗаПериод.Валюта,
		|	ВТ_НачисленнаяКомиссияЗаПериод.ТипКомиссии,
		|	ВТ_НачисленнаяКомиссияЗаПериод.НачалоПериода,
		|	ВТ_НачисленнаяКомиссияЗаПериод.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта,
		|	ТипКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОплаченнаяКомиссияЗаПериод.ДБО КАК ДБО,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.СА КАК СА,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.Валюта КАК Валюта,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
		|	СУММА(ВТ_ОплаченнаяКомиссияЗаПериод.СуммаБрокер) КАК СуммаБрокер
		|ПОМЕСТИТЬ _ОплаченнаяКомиссияЗаПериод
		|ИЗ
		|	ВТ_ОплаченнаяКомиссияЗаПериод КАК ВТ_ОплаченнаяКомиссияЗаПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОплаченнаяКомиссияЗаПериод.ДБО,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.СА,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.Валюта,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.ТипКомиссии,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.НачалоПериода,
		|	ВТ_ОплаченнаяКомиссияЗаПериод.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта,
		|	ТипКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДвиженияДенежныхСредств.ДБО КАК ДБО,
		|	ВТ_ДвиженияДенежныхСредств.СА КАК СА,
		|	ВТ_ДвиженияДенежныхСредств.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ДвиженияДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ВТ_ДвиженияДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ВТ_ДвиженияДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ВТ_ДвиженияДенежныхСредств.ПриходБрокер) КАК ПриходБрокер,
		|	СУММА(ВТ_ДвиженияДенежныхСредств.РасходБрокер) КАК РасходБрокер
		|ПОМЕСТИТЬ _ДвиженияДенежныхСредств
		|ИЗ
		|	ВТ_ДвиженияДенежныхСредств КАК ВТ_ДвиженияДенежныхСредств
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияДенежныхСредств.ДБО,
		|	ВТ_ДвиженияДенежныхСредств.СА,
		|	ВТ_ДвиженияДенежныхСредств.ВалютнаяСекция,
		|	ВТ_ДвиженияДенежныхСредств.Валюта,
		|	ВТ_ДвиженияДенежныхСредств.НачалоПериода,
		|	ВТ_ДвиженияДенежныхСредств.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	ВалютнаяСекция,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаблокированныеДенежныеСредства.ДБО КАК ДБО,
		|	ВТ_ЗаблокированныеДенежныеСредства.СА КАК СА,
		|	ВТ_ЗаблокированныеДенежныеСредства.НачалоПериода КАК НачалоПериода,
		|	ВТ_ЗаблокированныеДенежныеСредства.КонецПериода КАК КонецПериода,
		|	ВТ_ЗаблокированныеДенежныеСредства.Валюта КАК Валюта,
		|	СУММА(ВТ_ЗаблокированныеДенежныеСредства.СуммаБрокер) КАК СуммаБрокер
		|ПОМЕСТИТЬ _ЗаблокированныеДенежныеСредства
		|ИЗ
		|	ВТ_ЗаблокированныеДенежныеСредства КАК ВТ_ЗаблокированныеДенежныеСредства
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаблокированныеДенежныеСредства.ДБО,
		|	ВТ_ЗаблокированныеДенежныеСредства.СА,
		|	ВТ_ЗаблокированныеДенежныеСредства.Валюта,
		|	ВТ_ЗаблокированныеДенежныеСредства.НачалоПериода,
		|	ВТ_ЗаблокированныеДенежныеСредства.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.ДБО КАК ДБО,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.СА КАК СА,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.КонецПериода КАК КонецПериода,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ВТ_ОжидаемыеПоступленияДенежныхСредств.СуммаБрокер) КАК СуммаБрокер
		|ПОМЕСТИТЬ _ОжидаемыеПоступленияДенежныхСредств
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств КАК ВТ_ОжидаемыеПоступленияДенежныхСредств
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.ДБО,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.СА,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.Валюта,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияДенежныхСредств.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_КонверсионныеСделки.ДБО КАК ДБО,
		|	ВТ_КонверсионныеСделки.СА КАК СА,
		|	ВТ_КонверсионныеСделки.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_КонверсионныеСделки.НачалоПериода КАК НачалоПериода,
		|	ВТ_КонверсионныеСделки.КонецПериода КАК КонецПериода,
		|	ВТ_КонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
		|	ВТ_КонверсионныеСделки.Дата КАК Дата,
		|	ВТ_КонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
		|	ВТ_КонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
		|	ВТ_КонверсионныеСделки.Курс КАК Курс,
		|	ВТ_КонверсионныеСделки.Сумма КАК Сумма,
		|	ВТ_КонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
		|	ВТ_КонверсионныеСделки.Контрвалюта КАК Контрвалюта,
		|	ВТ_КонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ _КонверсионныеСделки
		|ИЗ
		|	ВТ_КонверсионныеСделки КАК ВТ_КонверсионныеСделки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НезавершенныеКонверсионныеСделки.ДБО КАК ДБО,
		|	ВТ_НезавершенныеКонверсионныеСделки.СА КАК СА,
		|	ВТ_НезавершенныеКонверсионныеСделки.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_НезавершенныеКонверсионныеСделки.НачалоПериода КАК НачалоПериода,
		|	ВТ_НезавершенныеКонверсионныеСделки.КонецПериода КАК КонецПериода,
		|	ВТ_НезавершенныеКонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
		|	ВТ_НезавершенныеКонверсионныеСделки.Дата КАК Дата,
		|	ВТ_НезавершенныеКонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
		|	ВТ_НезавершенныеКонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
		|	ВТ_НезавершенныеКонверсионныеСделки.Курс КАК Курс,
		|	ВТ_НезавершенныеКонверсионныеСделки.Сумма КАК Сумма,
		|	ВТ_НезавершенныеКонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
		|	ВТ_НезавершенныеКонверсионныеСделки.Контрвалюта КАК Контрвалюта,
		|	ВТ_НезавершенныеКонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ _НезавершенныеКонверсионныеСделки
		|ИЗ
		|	ВТ_НезавершенныеКонверсионныеСделки КАК ВТ_НезавершенныеКонверсионныеСделки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиЦенныхБумаг.ДБО КАК ДБО,
		|	ВТ_ОстаткиЦенныхБумаг.СА КАК СА,
		|	ВТ_ОстаткиЦенныхБумаг.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОстаткиЦенныхБумаг.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОстаткиЦенныхБумаг.КонецПериода КАК КонецПериода,
		|	ВТ_ОстаткиЦенныхБумаг.ЦБ КАК ЦБ,
		|	СУММА(ВТ_ОстаткиЦенныхБумаг.НачальныйОстаток) КАК НачальныйОстаток,
		|	СУММА(ВТ_ОстаткиЦенныхБумаг.КонечныйОстаток) КАК КонечныйОстаток
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
		|ИЗ
		|	ВТ_ОстаткиЦенныхБумаг КАК ВТ_ОстаткиЦенныхБумаг
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиЦенныхБумаг.ДБО,
		|	ВТ_ОстаткиЦенныхБумаг.СА,
		|	ВТ_ОстаткиЦенныхБумаг.ВалютнаяСекция,
		|	ВТ_ОстаткиЦенныхБумаг.ЦБ,
		|	ВТ_ОстаткиЦенныхБумаг.НачалоПериода,
		|	ВТ_ОстаткиЦенныхБумаг.КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	ВалютнаяСекция,
		|	ЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗадолженностьПоЦБ.ДБО КАК ДБО,
		|	ВТ_ЗадолженностьПоЦБ.СА КАК СА,
		|	ВТ_ЗадолженностьПоЦБ.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ЗадолженностьПоЦБ.НачалоПериода КАК НачалоПериода,
		|	ВТ_ЗадолженностьПоЦБ.КонецПериода КАК КонецПериода,
		|	ВТ_ЗадолженностьПоЦБ.ЦБ КАК ЦБ,
		|	СУММА(ВТ_ЗадолженностьПоЦБ.ИсходящийОстаток) КАК ИсходящийОстаток,
		|	СУММА(ВТ_ЗадолженностьПоЦБ.ОбязательстваКПолучению) КАК ОбязательстваКПолучению,
		|	СУММА(ВТ_ЗадолженностьПоЦБ.ОбязательстваКВыбытию) КАК ОбязательстваКВыбытию,
		|	СУММА(ВТ_ЗадолженностьПоЦБ.ПлановыйИсходящийОстаток) КАК ПлановыйИсходящийОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоЦБ
		|ИЗ
		|	ВТ_ЗадолженностьПоЦБ КАК ВТ_ЗадолженностьПоЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадолженностьПоЦБ.ДБО,
		|	ВТ_ЗадолженностьПоЦБ.СА,
		|	ВТ_ЗадолженностьПоЦБ.ВалютнаяСекция,
		|	ВТ_ЗадолженностьПоЦБ.НачалоПериода,
		|	ВТ_ЗадолженностьПоЦБ.КонецПериода,
		|	ВТ_ЗадолженностьПоЦБ.ЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДвиженияАкций.ДБО КАК ДБО,
		|	ВТ_ДвиженияАкций.СА КАК СА,
		|	ВТ_ДвиженияАкций.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ДвиженияАкций.НачалоПериода КАК НачалоПериода,
		|	ВТ_ДвиженияАкций.КонецПериода КАК КонецПериода,
		|	ВТ_ДвиженияАкций.ЦБ КАК ЦБ,
		|	ВТ_ДвиженияАкций.ДатаОперации КАК ДатаОперации,
		|	СУММА(ВТ_ДвиженияАкций.Приход) КАК Приход,
		|	СУММА(ВТ_ДвиженияАкций.Расход) КАК Расход
		|ПОМЕСТИТЬ _ДвиженияАкций
		|ИЗ
		|	ВТ_ДвиженияАкций КАК ВТ_ДвиженияАкций
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияАкций.ДБО,
		|	ВТ_ДвиженияАкций.СА,
		|	ВТ_ДвиженияАкций.ВалютнаяСекция,
		|	ВТ_ДвиженияАкций.НачалоПериода,
		|	ВТ_ДвиженияАкций.КонецПериода,
		|	ВТ_ДвиженияАкций.ЦБ,
		|	ВТ_ДвиженияАкций.ДатаОперации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	ВалютнаяСекция,
		|	ЦБ,
		|	ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДвиженияЦенныхБумаг.ДБО КАК ДБО,
		|	ВТ_ДвиженияЦенныхБумаг.СА КАК СА,
		|	ВТ_ДвиженияЦенныхБумаг.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ДвиженияЦенныхБумаг.НачалоПериода КАК НачалоПериода,
		|	ВТ_ДвиженияЦенныхБумаг.КонецПериода КАК КонецПериода,
		|	ВТ_ДвиженияЦенныхБумаг.ЦБ КАК ЦБ,
		|	ВТ_ДвиженияЦенныхБумаг.ДатаОперации КАК ДатаОперации,
		|	СУММА(ВТ_ДвиженияЦенныхБумаг.Количество) КАК Количество
		|ПОМЕСТИТЬ _ДвиженияЦенныхБумаг
		|ИЗ
		|	ВТ_ДвиженияЦенныхБумаг КАК ВТ_ДвиженияЦенныхБумаг
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияЦенныхБумаг.ДБО,
		|	ВТ_ДвиженияЦенныхБумаг.СА,
		|	ВТ_ДвиженияЦенныхБумаг.ВалютнаяСекция,
		|	ВТ_ДвиженияЦенныхБумаг.НачалоПериода,
		|	ВТ_ДвиженияЦенныхБумаг.КонецПериода,
		|	ВТ_ДвиженияЦенныхБумаг.ЦБ,
		|	ВТ_ДвиженияЦенныхБумаг.ДатаОперации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДБО,
		|	СА,
		|	ВалютнаяСекция,
		|	ЦБ,
		|	ДатаОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОжидаемыеПоступленияАкций.ДБО КАК ДБО,
		|	ВТ_ОжидаемыеПоступленияАкций.СА КАК СА,
		|	ВТ_ОжидаемыеПоступленияАкций.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияАкций.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияАкций.КонецПериода КАК КонецПериода,
		|	ВТ_ОжидаемыеПоступленияАкций.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияАкций.Акция КАК Акция,
		|	СУММА(ВТ_ОжидаемыеПоступленияАкций.Количество) КАК Количество
		|ПОМЕСТИТЬ _ОжидаемыеПоступленияАкций
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияАкций КАК ВТ_ОжидаемыеПоступленияАкций
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОжидаемыеПоступленияАкций.ДБО,
		|	ВТ_ОжидаемыеПоступленияАкций.СА,
		|	ВТ_ОжидаемыеПоступленияАкций.ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияАкций.НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияАкций.КонецПериода,
		|	ВТ_ОжидаемыеПоступленияАкций.ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияАкций.Акция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОжидаемыеПоступленияОблигаций.ДБО КАК ДБО,
		|	ВТ_ОжидаемыеПоступленияОблигаций.СА КАК СА,
		|	ВТ_ОжидаемыеПоступленияОблигаций.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияОблигаций.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияОблигаций.КонецПериода КАК КонецПериода,
		|	ВТ_ОжидаемыеПоступленияОблигаций.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияОблигаций.Облигация КАК Облигация,
		|	СУММА(ВТ_ОжидаемыеПоступленияОблигаций.Количество) КАК Количество
		|ПОМЕСТИТЬ _ОжидаемыеПоступленияОблигаций
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияОблигаций КАК ВТ_ОжидаемыеПоступленияОблигаций
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОжидаемыеПоступленияОблигаций.ДБО,
		|	ВТ_ОжидаемыеПоступленияОблигаций.СА,
		|	ВТ_ОжидаемыеПоступленияОблигаций.ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияОблигаций.НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияОблигаций.КонецПериода,
		|	ВТ_ОжидаемыеПоступленияОблигаций.ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияОблигаций.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОжидаемыеПоступленияПаев.ДБО КАК ДБО,
		|	ВТ_ОжидаемыеПоступленияПаев.СА КАК СА,
		|	ВТ_ОжидаемыеПоступленияПаев.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияПаев.НачалоПериода КАК НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияПаев.КонецПериода КАК КонецПериода,
		|	ВТ_ОжидаемыеПоступленияПаев.ДатаОперации КАК ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияПаев.Пай КАК Пай,
		|	СУММА(ВТ_ОжидаемыеПоступленияПаев.Количество) КАК Количество
		|ПОМЕСТИТЬ _ОжидаемыеПоступленияПаев
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияПаев КАК ВТ_ОжидаемыеПоступленияПаев
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОжидаемыеПоступленияПаев.ДБО,
		|	ВТ_ОжидаемыеПоступленияПаев.СА,
		|	ВТ_ОжидаемыеПоступленияПаев.ВалютнаяСекция,
		|	ВТ_ОжидаемыеПоступленияПаев.НачалоПериода,
		|	ВТ_ОжидаемыеПоступленияПаев.КонецПериода,
		|	ВТ_ОжидаемыеПоступленияПаев.ДатаОперации,
		|	ВТ_ОжидаемыеПоступленияПаев.Пай
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаблокированныеЦенныеБумаги.ДБО КАК ДБО,
		|	ВТ_ЗаблокированныеЦенныеБумаги.СА КАК СА,
		|	ВТ_ЗаблокированныеЦенныеБумаги.ВалютнаяСекция КАК ВалютнаяСекция,
		|	ВТ_ЗаблокированныеЦенныеБумаги.НачалоПериода КАК НачалоПериода,
		|	ВТ_ЗаблокированныеЦенныеБумаги.КонецПериода КАК КонецПериода,
		|	ВТ_ЗаблокированныеЦенныеБумаги.ЦБ КАК ЦБ,
		|	СУММА(ВТ_ЗаблокированныеЦенныеБумаги.Заблокировано) КАК Заблокировано
		|ПОМЕСТИТЬ _ЗаблокированныеЦенныеБумаги
		|ИЗ
		|	ВТ_ЗаблокированныеЦенныеБумаги КАК ВТ_ЗаблокированныеЦенныеБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаблокированныеЦенныеБумаги.ДБО,
		|	ВТ_ЗаблокированныеЦенныеБумаги.СА,
		|	ВТ_ЗаблокированныеЦенныеБумаги.ВалютнаяСекция,
		|	ВТ_ЗаблокированныеЦенныеБумаги.ЦБ,
		|	ВТ_ЗаблокированныеЦенныеБумаги.НачалоПериода,
		|	ВТ_ЗаблокированныеЦенныеБумаги.КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиДенежныхСредствБрокер.СА КАК СубъектАналитики
		|ПОМЕСТИТЬ _СверенныеСубъекты
		|ИЗ
		|	_ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредствБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ОбязательстваПоДенежнымСредствамБрокер.СА
		|ИЗ
		|	_ОбязательстваПоДенежнымСредствам КАК _ОбязательстваПоДенежнымСредствамБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДвиженияДенежныхСредствБрокер.СА
		|ИЗ
		|	_ДвиженияДенежныхСредств КАК _ДвиженияДенежныхСредствБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ЗаблокированныеДенежныеСредстваБрокер.СА
		|ИЗ
		|	_ЗаблокированныеДенежныеСредства КАК _ЗаблокированныеДенежныеСредстваБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ОжидаемыеПоступленияДенежныхСредствБрокер.СА
		|ИЗ
		|	_ОжидаемыеПоступленияДенежныхСредств КАК _ОжидаемыеПоступленияДенежныхСредствБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ОстаткиЦенныхБумагБрокер.СА
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумагБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ЗаблокированныеЦенныеБумагиБрокер.СА
		|ИЗ
		|	_ЗаблокированныеЦенныеБумаги КАК _ЗаблокированныеЦенныеБумагиБрокер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало.СА
		|ИЗ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НачисленнаяКомиссияЗаПериод.СА
		|ИЗ
		|	ВТ_НачисленнаяКомиссияЗаПериод КАК ВТ_НачисленнаяКомиссияЗаПериод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОплаченнаяКомиссияЗаПериод.СА
		|ИЗ
		|	ВТ_ОплаченнаяКомиссияЗаПериод КАК ВТ_ОплаченнаяКомиссияЗаПериод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец.СА
		|ИЗ
		|	ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец КАК ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ЗадолженностьПоЦБ.СА
		|ИЗ
		|	ВТ_ЗадолженностьПоЦБ КАК ВТ_ЗадолженностьПоЦБ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОжидаемыеПоступленияАкций.СА
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияАкций КАК ВТ_ОжидаемыеПоступленияАкций
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОжидаемыеПоступленияОблигаций.СА
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияОблигаций КАК ВТ_ОжидаемыеПоступленияОблигаций
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОжидаемыеПоступленияПаев.СА
		|ИЗ
		|	ВТ_ОжидаемыеПоступленияПаев КАК ВТ_ОжидаемыеПоступленияПаев
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_КонверсионныеСделки.СА
		|ИЗ
		|	_КонверсионныеСделки КАК _КонверсионныеСделки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_НезавершенныеКонверсионныеСделки.СА
		|ИЗ
		|	_НезавершенныеКонверсионныеСделки КАК _НезавершенныеКонверсионныеСделки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДвиженияЦенныхБумаг.СА
		|ИЗ
		|	_ДвиженияЦенныхБумаг КАК _ДвиженияЦенныхБумаг
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДвиженияАкций.СА
		|ИЗ
		|	ВТ_ДвиженияАкций КАК ВТ_ДвиженияАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СверенныеСчетаДУ.СубъектАналитики КАК СчетДоверительногоУправления,
		|	NULL КАК Стратегия
		|ПОМЕСТИТЬ _СверенныеСчетаДоверительногоУправления
		|ИЗ
		|	_СверенныеСубъекты КАК _СверенныеСчетаДУ
		|ГДЕ
		|	_СверенныеСчетаДУ.СубъектАналитики ССЫЛКА Справочник.СчетаДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления,
		|	СтратегииИИ.Ссылка
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИИ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СверенныеСубъекты КАК _СверенныеСтратегии
		|			ПО (_СверенныеСтратегии.СубъектАналитики = СтратегииИИ.Ссылка)
		|		ПО (СтратегииИИ.ОсновнойБрокерскийДоговор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СверенныеСубъекты КАК _СверенныеСчетаДУ
		|		ПО (_СверенныеСчетаДУ.СубъектАналитики = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления)
		|ГДЕ
		|	_СверенныеСчетаДУ.СубъектАналитики ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОбязательстваПоДенежнымСредствам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаНачало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НачисленнаяКомиссияЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОплаченнаяКомиссияЗаПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиЗадолженностиПоКомиссииНаКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДвиженияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗаблокированныеДенежныеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОжидаемыеПоступленияДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_КонверсионныеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НезавершенныеКонверсионныеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОстаткиЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗадолженностьПоЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДвиженияАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДвиженияОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДвиженияПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДвиженияЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОжидаемыеПоступленияАкций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОжидаемыеПоступленияОблигаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОжидаемыеПоступленияПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗаблокированныеАкции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗаблокированныеОблигации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗаблокированныеПаи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗаблокированныеЦенныеБумаги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СверенныеСубъекты";
#КонецОбласти
	
	Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция СверитьОстаткиСДаннымиФайловOTBR(НачалоПериода, КонецПериода, Каталоги, Брокер, Депозитарий, СчетаДУ) Экспорт
	
	Если НачалоПериода < Дата(2020,11,15) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сверка остатков с файлами OTBR осуществляется с 15.11.2020!");
		Возврат Неопределено;
	КонецЕсли;

	МассивКаталогов = СтрРазделить(Каталоги, Символ(0182));
	
	КаталогиСФайлами = Новый Массив;
	
	Для Каждого Каталог ИЗ МассивКаталогов Цикл
		
		ОбъектФайл = Новый Файл(Каталог);
		
		Если ОбъектФайл.Существует() И ОбъектФайл.ЭтоКаталог() Тогда
			КаталогиСФайлами.Добавить(Новый Структура("КаталогИмя, Файлы, ЕстьФайлы", Каталог, НайтиФайлы(Каталог, "*", Истина), Ложь));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует папка [" + Каталог + "]!");	
		КонецЕсли;
		
	КонецЦикла;
			
	МассивФайлов  = Новый Массив;
	ДатаФайла = НачалоПериода;
	
	МассивДатИсключенныхИзСверки = Новый Массив;
	
	Пока ДатаФайла <= КонецПериода Цикл
		
		ЕстьФайлыЗаТекущуюДату = Ложь;
		
		Для Каждого Каталог Из КаталогиСФайлами Цикл
			
			Для Каждого Файл Из Каталог.Файлы Цикл
				
				ЕстьФайлыВКаталоге = Ложь;
				
				Если Лев(Файл.Имя, 32) = "BrokerReport_" + Формат(ДатаФайла, "ДФ=дд.ММ.гг") + "_-_" + Формат(ДатаФайла, "ДФ=дд.ММ.гг") И Прав(Файл.Имя, 4) = ".xml" Тогда
					МассивФайлов.Добавить(Новый Структура("ИмяФайла, Дата, ДвоичныеДанные", Файл.Имя, ДатаФайла, Новый ДвоичныеДанные(Файл.ПолноеИмя)));
					ЕстьФайлыВКаталоге     = Истина;
					ЕстьФайлыЗаТекущуюДату = Истина;
				КонецЕсли;
				
				Если Каталог.ЕстьФайлы = Ложь И ЕстьФайлыВКаталоге = Истина Тогда 
					Каталог.ЕстьФайлы = Истина;
				КонецЕсли;
				
			КонецЦикла;
						
		КонецЦикла;

		Если ЕстьФайлыЗаТекущуюДату = Ложь Тогда
			МассивДатИсключенныхИзСверки.Добавить(ДатаФайла);
		КонецЕсли;
		
		ДатаФайла = ДатаФайла + 86400;
	КонецЦикла;
	
	Для Каждого Каталог Из КаталогиСФайлами Цикл
		
		Если Каталог.ЕстьФайлы = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В папке [" + Каталог.КаталогИмя + "] отсутствуют файлы OTBR за период [" + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " - " + Формат(КонецПериода, "ДФ=dd.MM.yyyy") + "].");
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ФайлИмпортаСоответствуетСхемеXSD(МассивФайлов, "Схема_OTBR") Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Макет = ЭтотОбъект.ПолучитьМакет("Схема_OTBR");

	ЧтениеСхемыOTBR = Новый ЧтениеXML;
	ЧтениеСхемыOTBR.УстановитьСтроку(Макет.ПолучитьТекст());
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеСхемыOTBR);
	
	ПостроительСхемXML = Новый ПостроительСхемXML;
	СхемаXML = ПостроительСхемXML.СоздатьСхемуXML(ДокументDOM);
	
	НаборСхемXML = Новый НаборСхемXML;
	НаборСхемXML.Добавить(СхемаXML);
	
	СвояФабрикаXDTO = Новый ФабрикаXDTO(НаборСхемXML);
	ТипXDTO = СвояФабрикаXDTO.Тип("xmlns:xs=""xmlns:xs=""http://www.w3.org/2001/XMLSchema""", "Data");
	
	ИмяФайлаДанныхНаСервере = ПолучитьИмяВременногоФайла("xml");
		
	СтруктураВнешнихДанных = ПолучитьСтруктуруДанныхOTBR();
	
	Для Каждого СтрокаФайловИмпорта Из МассивФайлов Цикл
			
		СтрокаФайловИмпорта.ДвоичныеДанные.Записать(ИмяФайлаДанныхНаСервере);
		
		ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаДанныхНаСервере, КодировкаТекста.UTF8);
		СтрокаXML = ЧтениеТекста.Прочитать();
		СтрокаXML = СтрЗаменить(СтрокаXML, "<Data", "<Data xmlns:xs=""http://www.w3.org/2001/XMLSchema"" ");
		                                                                                              
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		
		ОбъектXDTO = СвояФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		
		Если ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
			ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ОбъектXDTO, СтруктураВнешнихДанных, СтрокаФайловИмпорта.ИмяФайла, СтрокаФайловИмпорта.Дата);								
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить объект XDTO");
			Возврат Неопределено;
		КонецЕсли;
		
		ЧтениеТекста.Закрыть();
	КонецЦикла;
	
	// Заменяем коды счетов для УКПИ
	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		Для Каждого ТекСтрока Из СтруктураВнешнихДанных.Accounts_Divisions Цикл
			ПозицияПодчеркивания = СтрНайти(ТекСтрока.Number, "_");
			Если ПозицияПодчеркивания > 0 Тогда
				ТекСтрока.Number = Лев(ТекСтрока.Number, ПозицияПодчеркивания - 1);	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	// Убираем постфикс SPFI для производных инструментов
    Для Каждого ТекСтрока Из СтруктураВнешнихДанных.Accounts_Divisions Цикл
		ПозицияПодчеркивания = СтрНайти(ТекСтрока.Number, "_SPFI");
		Если ПозицияПодчеркивания > 0 Тогда
			ТекСтрока.Number = Лев(ТекСтрока.Number, ПозицияПодчеркивания - 1);	
		КонецЕсли;
	КонецЦикла;
		
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПервыхУзлов.Ключ КАК Ключ,
		|	ДанныеПервыхУзлов.ФайлСоответствуетФормату КАК ФайлСоответствуетФормату
		|ПОМЕСТИТЬ _ДанныеПервыхУзлов
		|ИЗ
		|	&ДанныеПервыхУзлов КАК ДанныеПервыхУзлов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Ссылка КАК Счет
		|ПОМЕСТИТЬ _СчетаИсключеныИзЗагрузки
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект ССЫЛКА Справочник.СчетаДоверительногоУправления
		|	И ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.СчетаДоверительногоУправления).Организация = &Организация
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ
		|	И ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетаДоверительногоУправления.Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.Ссылка В (&НеопределенныеСчета)
		|			ИЛИ &ОтборОчередьЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения КАК ДатаРасторженияСчета,
		|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторженияДоговора,
		|	ВЫБОР
		|		КОГДА _СчетаИсключеныИзЗагрузки.Счет ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИсключенИзЗагрузки,
		|	ВЫБОР
		|		КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления В (&СчетаДУ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УчаствуетВОтборе
		|ПОМЕСТИТЬ _КодыСчетов
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаИсключеныИзЗагрузки КАК _СчетаИсключеныИзЗагрузки
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = _СчетаИсключеныИзЗагрузки.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Accounts.ID КАК ID,
		|	Accounts.Firm_ID КАК Firm_ID,
		|	Accounts.Partner_ID КАК Partner_ID,
		|	Accounts.Agreement_ID КАК Agreement_ID,
		|	Accounts.Number КАК Number,
		|	Accounts.Type КАК Type,
		|	Accounts.Sub_Type КАК Sub_Type,
		|	Accounts.Ключ КАК Ключ
		|ПОМЕСТИТЬ _Accounts
		|ИЗ
		|	&Accounts КАК Accounts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Accounts_Divisions.ID КАК ID,
		|	Accounts_Divisions.Account_ID КАК Account_ID,
		|	Accounts_Divisions.Number КАК Number,
		|	Accounts_Divisions.Секция КАК Секция
		|ПОМЕСТИТЬ _Accounts_Divisions
		|ИЗ
		|	&Accounts_Divisions КАК Accounts_Divisions
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	
		|	_Accounts_Divisions.ID КАК Account_Division_ID,
		|	_Accounts_Divisions.Account_ID КАК Account_ID,
		|	_Accounts_Divisions.Number КАК Account_Division_Number,
		|	_Accounts_Divisions.Секция КАК Секция,
		|	_КодыСчетов.Организация КАК Организация,
		|	_КодыСчетов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетов.Брокер КАК Брокер,
		|	_КодыСчетов.ДатаРасторженияСчета КАК ДатаРасторженияСчета,
		|	_КодыСчетов.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора,
		|	_КодыСчетов.ИсключенИзЗагрузки КАК ИсключенИзЗагрузки,
		|	_КодыСчетов.УчаствуетВОтборе КАК УчаствуетВОтборе
		|ПОМЕСТИТЬ _КодыСчетовВнутреннегоУчета
		|ИЗ
		|	_Accounts КАК _Accounts
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Accounts.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Accounts_Divisions КАК _Accounts_Divisions
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыСчетов КАК _КодыСчетов
		|			ПО _Accounts_Divisions.Number = _КодыСчетов.Код
		|		ПО _Accounts.ID = _Accounts_Divisions.Account_ID
		|ГДЕ
		|	_Accounts.Type = ""Accounts.Type.Investment""
		|	И НЕ _Accounts_Divisions.Number ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоЦеннымБумагам.Организация КАК Организация,
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет КАК Счет,
		|	ВЫБОР
		|		КОГДА КодыВоВнешнихСистемахСрезПоследних.Код ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)
		|							И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий = &Депозитарий
		|						ТОГДА ""Основной в НРД""
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение)
		|						ТОГДА ""Касса Векселя""
		|					КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|							И ПОДСТРОКА(ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.НомерСчета, 1, 2) = ""36""
		|							И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий <> &Депозитарий
		|						ТОГДА ""СпецДЕП Т+""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ КодыВоВнешнихСистемахСрезПоследних.Код
		|	КОНЕЦ КАК КодДепозитарногоСчета,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_ID КАК Account_Division_ID
		|ПОМЕСТИТЬ _ВсеДепозитарныеСчета
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|					&КонецПериода,
		|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ОтчетБрокераБКРегион)
		|						И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних
		|			ПО ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = КодыВоВнешнихСистемахСрезПоследних.Объект
		|		ПО _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления = ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления
		|			И _КодыСчетовВнутреннегоУчета.Организация = ИсполнителиПоЦеннымБумагам.Организация
		|ГДЕ
		|	(ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > &КонецПериода
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия <= &КонецПериода
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсполнителиПоЦеннымБумагам.Организация = &Организация
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Брокер = &Брокер
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий = &Депозитарий)
		|	И _КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КодыСчетовВнутреннегоУчета.Организация,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.СчетУчетаДеривативов),
		|	""FORTS"",
		|	_КодыСчетовВнутреннегоУчета.Account_Division_ID
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|ГДЕ
		|	_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.КодДепозитарногоСчета КАК КодДепозитарногоСчета,
		|	ВложенныйЗапрос.Account_Division_ID КАК Account_Division_ID,
		|	ВложенныйЗапрос.КоличествоСчетов КАК КоличествоСчетов,
		|	_ВсеДепозитарныеСчета.Счет КАК Счет
		|ПОМЕСТИТЬ _ДепозитарныеСчета
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ВсеДепозитарныеСчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ВсеДепозитарныеСчета.КодДепозитарногоСчета КАК КодДепозитарногоСчета,
		|			_ВсеДепозитарныеСчета.Account_Division_ID КАК Account_Division_ID,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеДепозитарныеСчета.Счет) КАК КоличествоСчетов,
		|			_ВсеДепозитарныеСчета.Организация КАК Организация
		|		ИЗ
		|			_ВсеДепозитарныеСчета КАК _ВсеДепозитарныеСчета
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ВсеДепозитарныеСчета.СчетДоверительногоУправления,
		|			_ВсеДепозитарныеСчета.КодДепозитарногоСчета,
		|			_ВсеДепозитарныеСчета.Account_Division_ID,
		|			_ВсеДепозитарныеСчета.Организация) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеДепозитарныеСчета КАК _ВсеДепозитарныеСчета
		|			ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеДепозитарныеСчета.СчетДоверительногоУправления
		|				И ВложенныйЗапрос.Account_Division_ID = _ВсеДепозитарныеСчета.Account_Division_ID
		|				И ВложенныйЗапрос.КодДепозитарногоСчета = _ВсеДепозитарныеСчета.КодДепозитарногоСчета
		|				И (ВложенныйЗапрос.КоличествоСчетов = 1)
		|		ПО _КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _КодыСчетовВнутреннегоУчета.Account_Division_ID = ВложенныйЗапрос.Account_Division_ID
		|			И (ВложенныйЗапрос.КодДепозитарногоСчета <> """")
		|			И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыЦенныхБумаг.ID КАК ID,
		|	КодыЦенныхБумаг.Тип КАК Тип
		|ПОМЕСТИТЬ _КодыЦенныхБумаг
		|ИЗ
		|	&КодыЦенныхБумаг КАК КодыЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Currencies.ID КАК ID,
		|	Currencies.ISO_Code КАК ISO_Code
		|ПОМЕСТИТЬ _Currencies
		|ИЗ
		|	&Currencies КАК Currencies
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И (ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения))) КАК КодыВоВнешнихСистемахСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА КодыВоВнешнихСистемахСрезПоследних.Объект ССЫЛКА Справочник.Акции
		|				ТОГДА ВЫРАЗИТЬ(КодыВоВнешнихСистемахСрезПоследних.Объект КАК Справочник.Акции).ДатаАннулирования >= &КонецПериода
		|						ИЛИ ВЫРАЗИТЬ(КодыВоВнешнихСистемахСрезПоследних.Объект КАК Справочник.Акции).ДатаАннулирования = ДАТАВРЕМЯ(1, 1, 1)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыЦенныхБумаг.ID КАК Matrix_ID,
		|	_КодыЦенныхБумаг.Тип КАК ТипБумаги,
		|	_ДанныеРегистра.ГруппаОбъектов КАК ГруппаОбъектов,
		|	_ДанныеРегистра.Объект КАК СсылкаЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_КодыЦенныхБумаг КАК _КодыЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _КодыЦенныхБумаг.ID = _ДанныеРегистра.Код
		|			И (НЕ _ДанныеРегистра.ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Currencies.ID КАК Matrix_ID,
		|	ЕСТЬNULL(_Currencies.ISO_Code, ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Наименование) КАК ISO_Code,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Код КАК ЧисловойКод,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.Валюты).Ссылка КАК ВалютаСсылка
		|ПОМЕСТИТЬ _Валюты
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Currencies КАК _Currencies
		|		ПО _ДанныеРегистра.Код = _Currencies.ID
		|ГДЕ
		|	_ДанныеРегистра.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРегистра.ГруппаОбъектов КАК ГруппаОбъектов,
		|	ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.МестаХранения).Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ Т+""
		|			ТОГДА ""MICEX""
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ FX""
		|			ТОГДА ""MOEX.FX""
		|		КОГДА _ДанныеРегистра.Код = ""ММВБ FORTS""
		|			ТОГДА ""FORTS""
		|		КОГДА _ДанныеРегистра.Код = ""Внебиржевой""
		|			ТОГДА ""OTC""
		|	КОНЕЦ КАК Код
		|ПОМЕСТИТЬ _МестаХраненияДенежныхСредств
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|ГДЕ
		|	_ДанныеРегистра.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.МестаХранения)
		|	И ВЫРАЗИТЬ(_ДанныеРегистра.Объект КАК Справочник.МестаХранения).ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыСчетовВнутреннегоУчета.Account_Division_ID КАК Account_Division_ID,
		|	_КодыСчетовВнутреннегоУчета.Account_ID КАК Account_ID,
		|	_КодыСчетовВнутреннегоУчета.Account_Division_Number КАК Account_Division_Number,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыСчетовВнутреннегоУчета.ДатаРасторженияСчета КАК ДатаРасторженияСчета,
		|	_КодыСчетовВнутреннегоУчета.ДатаРасторженияДоговора КАК ДатаРасторженияДоговора
		|ИЗ
		|	_КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|ГДЕ
		|	(_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления ЕСТЬ NULL
		|			ИЛИ _КодыСчетовВнутреннегоУчета.ДатаРасторженияСчета < &НачалоПериода
		|				И _КодыСчетовВнутреннегоУчета.ДатаРасторженияСчета <> ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _КодыСчетовВнутреннегоУчета.ДатаРасторженияДоговора < &НачалоПериода
		|				И _КодыСчетовВнутреннегоУчета.ДатаРасторженияДоговора <> ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.Matrix_ID КАК Matrix_ID,
		|	_ЦенныеБумаги.ТипБумаги КАК ТипБумаги
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	_ЦенныеБумаги.СсылкаЦеннаяБумага ЕСТЬ NULL
		|	И _ЦенныеБумаги.ТипБумаги <> ""Derivatives""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Валюты.Matrix_ID КАК Matrix_ID,
		|	_Валюты.ISO_Code КАК ISO_Code
		|ИЗ
		|	_Валюты КАК _Валюты
		|ГДЕ
		|	_Валюты.ВалютаСсылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПервыхУзлов.Ключ КАК Ключ,
		|	_ДанныеПервыхУзлов.ФайлСоответствуетФормату КАК ФайлСоответствуетФормату
		|ИЗ
		|	_ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|ГДЕ
		|	_ДанныеПервыхУзлов.ФайлСоответствуетФормату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Accounts
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Accounts_Divisions
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КодыСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КодыЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Currencies
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеРегистра";
#КонецОбласти

	НепоределенныеСчета = Новый Массив;
	НепоределенныеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_Траст"));
	НепоределенныеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_РЭМ"));
	
	Запрос.УстановитьПараметр("КонецПериода"       , КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода"      , НачалоПериода);
	Запрос.УстановитьПараметр("Ключ"               , "УчетНеВедется");
	Запрос.УстановитьПараметр("Организация"        , ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер"             , Брокер);
	Запрос.УстановитьПараметр("Депозитарий"        , Депозитарий);
	Запрос.УстановитьПараметр("Accounts"           , СтруктураВнешнихДанных.Accounts);
	Запрос.УстановитьПараметр("Accounts_Divisions" , СтруктураВнешнихДанных.Accounts_Divisions);
	Запрос.УстановитьПараметр("Currencies"         , СтруктураВнешнихДанных.Currencies);
	Запрос.УстановитьПараметр("КодыЦенныхБумаг"    , СтруктураВнешнихДанных.КодыЦенныхБумаг);
	Запрос.УстановитьПараметр("ДанныеПервыхУзлов"  , СтруктураВнешнихДанных.ДанныеПервыхУзлов);
	Запрос.УстановитьПараметр("СчетаДУ"            , ?(СчетаДУ = Неопределено, Справочники.СчетаДоверительногоУправления.ПустаяСсылка(), СчетаДУ));
	Запрос.УстановитьПараметр("НеопределенныеСчета", НепоределенныеСчета);
	Запрос.УстановитьПараметр("ГруппаОбъектов"     , Справочники.ГруппыИмпортируемыхОбъектов.ДепозитарныеСчета);
	
	Если ЭтотОбъект.ОчередьЗагрузки = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОчередьЗагрузки", "ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборОчередьЗагрузки", "НЕ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровСчетовДУ)");
		Запрос.УстановитьПараметр("ВидыДоговоровСчетовДУ", РаботаСВнешнимиСистемами.ПолучитьВидыДоговорДоверительногоУправленияДляОчереди(ЭтотОбъект.Организация, ЭтотОбъект.ОчередьЗагрузки));
	КонецЕсли;
		
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[14].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СчетДоверительногоУправления) Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДатаРасторженияСчета) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В отчете OTBR присутствуют данные счета ДУ [" + Выборка.СчетДоверительногоУправления + "], у которого истек срок действия договора доверительного управления [" + Формат(Выборка.ДатаРасторженияСчета, "ДФ=dd.MM.yyyy") + " г.]");	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДатаРасторженияДоговора) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В отчете OTBR присутствуют данные счета ДУ [" + Выборка.СчетДоверительногоУправления + "], у которого истек срок действия договора с брокером [" + Формат(Выборка.ДатаРасторженияДоговора, "ДФ=dd.MM.yyyy") + " г.]");	
			КонецЕсли;
				
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Коды счетов ДУ у брокера] не найден счет ДУ по коду [" + Выборка.Account_Division_Number + "]. Матрикс ID счета [" + Выборка.Account_ID + "], матрикс ID портфеля [" + Выборка.Account_Division_ID + "].");	
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка = Результат[15].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Коды во внешних системах] не найдена бумага [" + Выборка.ТипБумаги + "] по коду [" + Выборка.Matrix_ID + "].");	
	КонецЦикла;
		
	Выборка = Результат[16].Выбрать();	
		
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В регистре [Коды во внешних системах] не найдена валюта [" + Выборка.ISO_Code + "] по коду [" + Выборка.Matrix_ID + "].");	
	КонецЦикла;
		
	Если Результат[17].Пустой() Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В папке [" + Каталог + "] отсутствуют файлы OTBR соответствующие параметрам импорта.");	
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДатыПериода
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ДанныеКалендаря.Дата В (&ДатыИсключены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Depo_Remains.Ключ КАК Ключ,
		|	Depo_Remains.Date КАК Date,
		|	Depo_Remains.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	Depo_Remains.Depo_Storage_Place КАК Depo_Storage_Place,
		|	Depo_Remains.Division_Type КАК Division_Type,
		|	Depo_Remains.Security_ID КАК Security_ID,
		|	Depo_Remains.Volume КАК Volume
		|ПОМЕСТИТЬ _Depo_Remains
		|ИЗ
		|	&Depo_Remains КАК Depo_Remains
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Money_Remains.Ключ КАК Ключ,
		|	Money_Remains.Date КАК Date,
		|	Money_Remains.Inner_Account_Division_ID КАК Inner_Account_Division_ID,
		|	Money_Remains.Money_Storage_Place КАК Money_Storage_Place,
		|	Money_Remains.Division_Type КАК Division_Type,
		|	Money_Remains.Currency_Code КАК Currency_Code,
		|	Money_Remains.Amount КАК Amount
		|ПОМЕСТИТЬ _Money_Remains
		|ИЗ
		|	&Money_Remains КАК Money_Remains
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_Money_Remains.Amount) КАК Сумма,
		|	_Money_Remains.Division_Type КАК Division_Type,
		|	ВЫБОР
		|		КОГДА _Money_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Charges"")
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		КОГДА _Money_Remains.Division_Type = ""Obligations.Receipt""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА _Money_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Receipt"")
		|			ТОГДА ""По сделкам""
		|		КОГДА _Money_Remains.Division_Type = ""Obligations.Charges""
		|			ТОГДА ""По комиссии""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Задолженность,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Валюты.ВалютаСсылка КАК Валюта,
		|	_МестаХраненияДенежныхСредств.Ссылка КАК МестоХранения,
		|	_Money_Remains.Date КАК Date
		|ПОМЕСТИТЬ _ДенежныеСредства_OTBR
		|ИЗ
		|	_Money_Remains КАК _Money_Remains
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Money_Remains.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Money_Remains.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|			И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
		|			И (_КодыСчетовВнутреннегоУчета.УчаствуетВОтборе = &ОтборПоСчетуДУ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _Валюты
		|		ПО _Money_Remains.Currency_Code = _Валюты.ISO_Code
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МестаХраненияДенежныхСредств КАК _МестаХраненияДенежныхСредств
		|		ПО _Money_Remains.Money_Storage_Place = _МестаХраненияДенежныхСредств.Код
		|ГДЕ
		|	_Money_Remains.Date МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_Валюты.ВалютаСсылка,
		|	_МестаХраненияДенежныхСредств.Ссылка,
		|	_Money_Remains.Division_Type,
		|	ВЫБОР
		|		КОГДА _Money_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Charges"")
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		КОГДА _Money_Remains.Division_Type = ""Obligations.Receipt""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _Money_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Receipt"")
		|			ТОГДА ""По сделкам""
		|		КОГДА _Money_Remains.Division_Type = ""Obligations.Charges""
		|			ТОГДА ""По комиссии""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	_Money_Remains.Date
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_Depo_Remains.Volume) КАК Количество,
		|	_Depo_Remains.Division_Type КАК Division_Type,
		|	ВЫБОР
		|		КОГДА _Depo_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Charges"")
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		КОГДА _Depo_Remains.Division_Type = ""Obligations.Receipt""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЗадолженности,
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЦенныеБумаги.СсылкаЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ДепозитарныеСчета.Счет, ВЫБОР
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""СпецДЕП Т+""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько 36-х разделов""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден 36-ой раздел""
		|					КОНЕЦ
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""Касса Векселя""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько счетов ответственного хранения""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден счет ответственного хранения""
		|					КОНЕЦ
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""Основной в НРД""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько основных депозитарных счетов в депозитарии БК Регион""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден основной депозитарный счет в депозитарии БК Регион""
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|						ТОГДА ""ОШИБКА.Найдено несколько депозитарных счетов по коду [""
		|					ИНАЧЕ ""ОШИБКА.Не найден депозитарный счет по коду [""
		|				КОНЕЦ + _Depo_Remains.Depo_Storage_Place + ""]""
		|		КОНЕЦ) КАК ДепозитарныйСчет,
		|	_Depo_Remains.Date КАК Date
		|ПОМЕСТИТЬ _ЦенныеБумаги_OTBR		
		|ИЗ
		|	_Depo_Remains КАК _Depo_Remains
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеПервыхУзлов КАК _ДанныеПервыхУзлов
		|		ПО _Depo_Remains.Ключ = _ДанныеПервыхУзлов.Ключ
		|			И (_ДанныеПервыхУзлов.ФайлСоответствуетФормату = ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыСчетовВнутреннегоУчета КАК _КодыСчетовВнутреннегоУчета
		|		ПО _Depo_Remains.Inner_Account_Division_ID = _КодыСчетовВнутреннегоУчета.Account_Division_ID
		|			И (_КодыСчетовВнутреннегоУчета.ИсключенИзЗагрузки = ЛОЖЬ)
		|			И (_КодыСчетовВнутреннегоУчета.УчаствуетВОтборе = &ОтборПоСчетуДУ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _Depo_Remains.Security_ID = _ЦенныеБумаги.Matrix_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ПО _Depo_Remains.Depo_Storage_Place = _ДепозитарныеСчета.КодДепозитарногоСчета
		|			И _Depo_Remains.Inner_Account_Division_ID = _ДепозитарныеСчета.Account_Division_ID
		|ГДЕ
		|	_Depo_Remains.Date МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ _Depo_Remains.Depo_Storage_Place ПОДОБНО ""%OTC деривативы%""
		|
		|СГРУППИРОВАТЬ ПО
		|	_КодыСчетовВнутреннегоУчета.СчетДоверительногоУправления,
		|	_ЦенныеБумаги.СсылкаЦеннаяБумага,
		|	_Depo_Remains.Division_Type,
		|	ВЫБОР
		|		КОГДА _Depo_Remains.Division_Type В (""Obligations.Delivery"", ""Obligations.Charges"")
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		КОГДА _Depo_Remains.Division_Type = ""Obligations.Receipt""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЕСТЬNULL(_ДепозитарныеСчета.Счет, ВЫБОР
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""СпецДЕП Т+""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько 36-х разделов""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден 36-ой раздел""
		|					КОНЕЦ
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""Касса Векселя""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько счетов ответственного хранения""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден счет ответственного хранения""
		|					КОНЕЦ
		|			КОГДА _Depo_Remains.Depo_Storage_Place = ""Основной в НРД""
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|							ТОГДА ""ОШИБКА.В исполнителях найдено несколько основных депозитарных счетов в депозитарии БК Регион""
		|						ИНАЧЕ ""ОШИБКА.В исполнителях не найден основной депозитарный счет в депозитарии БК Регион""
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(_ДепозитарныеСчета.КоличествоСчетов, 0) > 1
		|						ТОГДА ""ОШИБКА.Найдено несколько депозитарных счетов по коду [""
		|					ИНАЧЕ ""ОШИБКА.Не найден депозитарный счет по коду [""
		|				КОНЕЦ + _Depo_Remains.Depo_Storage_Place + ""]""
		|		КОНЕЦ),
		|	_Depo_Remains.Date
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения КАК МестоХранения,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток
		|			ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаОборот
		|		КОНЕЦ) КАК Сумма,
		|	_ДатыПериода.Дата КАК Дата
		|ПОМЕСТИТЬ _ДенежныеСредства1С
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Брокер = &Брокер
		|					И Организация = &Организация
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|		ПО _ДатыПериода.Дата >= ОстаткиДенежныхСредствОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
		|	_ДатыПериода.Дата
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток
		|			ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.СуммаОборот
		|		КОНЕЦ) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) КАК Количество,
		|	_ДатыПериода.Дата КАК Дата
		|ПОМЕСТИТЬ _ЦенныеБумаги1С
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Организация = &Организация
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|		ПО _ДатыПериода.Дата >= ОстаткиЦенныхБумагОстаткиИОбороты.Период
		|ГДЕ
		|	(ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.Брокер = &Брокер
		|			ИЛИ ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.Депозитарий = &Депозитарий
		|			ИЛИ ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет В
		|				(ВЫБРАТЬ
		|					_ЦенныеБумаги_OTBR.ДепозитарныйСчет
		|				ИЗ
		|					_ЦенныеБумаги_OTBR))
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет,
		|	_ДатыПериода.Дата
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженностиДС,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта <> &РоссийскийРубль
		|				И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.ВалютаОплаты <> ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта
		|			ТОГДА &РоссийскийРубль
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта
		|	КОНЕЦ КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) КАК КоличествоОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаКонечныйОстаток + ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаКупонаКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаОборот + ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаКупонаОборот
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта <> &РоссийскийРубль
		|					И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.ВалютаОплаты <> ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта
		|				ТОГДА КурсыВалют.Курс / КурсыВалют.Кратность
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК СуммаОстаток,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ КАК ТипЗадолженностиЦБ,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.МестоХранения КАК МестоХранения,
		|	_ДатыПериода.Дата КАК Дата,
		|	СделкаРЕПОЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет
		|ПОМЕСТИТЬ _ЗадолженностьПоВторойЧастиРепо
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Организация = &Организация
		|					И СделкаРЕПО.Брокер = &Брокер
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|			ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = СделкаРЕПОЦенныеБумаги.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (НАЧАЛОПЕРИОДА(ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.Дата, ДЕНЬ) = КурсыВалют.Период)
		|				И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта = КурсыВалют.Валюта
		|		ПО _ДатыПериода.Дата >= ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.МестоХранения,
		|	_ДатыПериода.Дата,
		|	СделкаРЕПОЦенныеБумаги.ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта <> &РоссийскийРубль
		|				И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.ВалютаОплаты <> ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта
		|			ТОГДА &РоссийскийРубль
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Валюта
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) КАК КоличествоОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДатыПериода.Дата КАК Дата,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание.МестоХранения КАК МестоХранения,
		|	ЕСТЬNULL(СделкаЦенныеБумаги.ДепозитарныйСчет, СделкаРЕПОЦенныеБумаги.ДепозитарныйСчет) КАК ДепозитарныйСчет
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагам
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Организация = &Организация
		|					И (ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Брокер = &Брокер
		|						ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.СделкаРЕПО).Брокер = &Брокер)
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО ((ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Документ.Сделка)) = СделкаЦенныеБумаги.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|			ПО ((ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО)) = СделкаРЕПОЦенныеБумаги.Ссылка)
		|		ПО _ДатыПериода.Дата >= ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Организация,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага,
		|	_ДатыПериода.Дата,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание.МестоХранения,
		|	ЕСТЬNULL(СделкаЦенныеБумаги.ДепозитарныйСчет, СделкаРЕПОЦенныеБумаги.ДепозитарныйСчет)
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ),
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Организация,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.ЦеннаяБумага,
		|	_ДатыПериода.Дата,
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Поручение.ДепозитарныйСчет
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагамПоПоручениям.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Организация = &Организация
		|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					И Поручение.ДепозитарныйСчет.Депозитарий = &Депозитарий
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты
		|		ПО _ДатыПериода.Дата >= ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Организация,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.ЦеннаяБумага,
		|	_ДатыПериода.Дата,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Поручение.ДепозитарныйСчет
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоЦеннымБумагамПоПоручениямОстаткиИОбороты.КоличествоОборот
		|		КОНЕЦ) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоВторойЧастиРепо.ТипЗадолженностиЦБ,
		|	_ЗадолженностьПоВторойЧастиРепо.СчетДоверительногоУправления,
		|	_ЗадолженностьПоВторойЧастиРепо.КоличествоОстаток,
		|	_ЗадолженностьПоВторойЧастиРепо.Организация,
		|	_ЗадолженностьПоВторойЧастиРепо.ЦеннаяБумага,
		|	_ЗадолженностьПоВторойЧастиРепо.Дата,
		|	_ЗадолженностьПоВторойЧастиРепо.МестоХранения,
		|	_ЗадолженностьПоВторойЧастиРепо.ДепозитарныйСчет
		|ИЗ
		|	_ЗадолженностьПоВторойЧастиРепо КАК _ЗадолженностьПоВторойЧастиРепо
		|ГДЕ
		|	_ЗадолженностьПоВторойЧастиРепо.КоличествоОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоЦеннымБумагам.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностьПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагам.Организация КАК Организация,
		|	_ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗадолженностьПоЦеннымБумагам.МестоХранения КАК МестоХранения,
		|	_ЗадолженностьПоЦеннымБумагам.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	СУММА(_ЗадолженностьПоЦеннымБумагам.КоличествоОстаток) КАК Количество,
		|	_ЗадолженностьПоЦеннымБумагам.Дата КАК Дата
		|ПОМЕСТИТЬ _ИтоговаяЗадолженностьПоЦБ
		|ИЗ
		|	_ЗадолженностьПоЦеннымБумагам КАК _ЗадолженностьПоЦеннымБумагам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоЦеннымБумагам.ТипЗадолженности,
		|	_ЗадолженностьПоЦеннымБумагам.СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагам.Организация,
		|	_ЗадолженностьПоЦеннымБумагам.ЦеннаяБумага,
		|	_ЗадолженностьПоЦеннымБумагам.МестоХранения,
		|	_ЗадолженностьПоЦеннымБумагам.ДепозитарныйСчет,
		|	_ЗадолженностьПоЦеннымБумагам.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|			ТОГДА ""По сделкам""
		|		ИНАЧЕ ""По комиссии""
		|	КОНЕЦ КАК Задолженность,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта <> &РоссийскийРубль
		|				И (ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|						И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта
		|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|						И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта)
		|			ТОГДА &РоссийскийРубль
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта
		|	КОНЕЦ КАК Валюта,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаОборот + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаОборот
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта <> &РоссийскийРубль
		|					И (ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|							И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта
		|						ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|							И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта)
		|				ТОГДА КурсыВалют.Курс / КурсыВалют.Кратность
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание.МестоХранения КАК МестоХранения,
		|	_ДатыПериода.Дата КАК Дата
		|ПОМЕСТИТЬ _ЗадолженностьПоДенежнымСредствам
		|ИЗ
		|	_ДатыПериода КАК _ДатыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериодаГраница,
		|				День,
		|				,
		|				Организация = &Организация
		|					И Основание.Брокер = &Брокер
		|					И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|					И ВЫБОР
		|						КОГДА &ОтборПоСчетуДУ
		|							ТОГДА СчетДоверительногоУправления В (&СчетаДУ)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И НЕ СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								ВТ.Счет
		|							ИЗ
		|								_СчетаИсключеныИзЗагрузки КАК ВТ)) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (ВЫБОР
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|						ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка).Дата, ДЕНЬ) = КурсыВалют.Период
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|						ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО).Дата, ДЕНЬ) = КурсыВалют.Период
		|				КОНЕЦ)
		|				И ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта = КурсыВалют.Валюта
		|		ПО _ДатыПериода.Дата >= ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|			ТОГДА ""По сделкам""
		|		ИНАЧЕ ""По комиссии""
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание.МестоХранения,
		|	_ДатыПериода.Дата,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта <> &РоссийскийРубль
		|				И (ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|						И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта
		|					ИЛИ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|						И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО).ВалютаОплаты <> ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта)
		|			ТОГДА &РоссийскийРубль
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток
		|			ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаОборот + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаОборот
		|		КОНЕЦ) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоВторойЧастиРепо.ТипЗадолженностиДС,
		|	""По сделкам"",
		|	_ЗадолженностьПоВторойЧастиРепо.СчетДоверительногоУправления,
		|	_ЗадолженностьПоВторойЧастиРепо.Валюта,
		|	_ЗадолженностьПоВторойЧастиРепо.СуммаОстаток,
		|	_ЗадолженностьПоВторойЧастиРепо.МестоХранения,
		|	_ЗадолженностьПоВторойЧастиРепо.Дата
		|ИЗ
		|	_ЗадолженностьПоВторойЧастиРепо КАК _ЗадолженностьПоВторойЧастиРепо
		|ГДЕ
		|	_ЗадолженностьПоВторойЧастиРепо.СуммаОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностьПоДенежнымСредствам.Задолженность КАК Задолженность,
		|	_ЗадолженностьПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоДенежнымСредствам.Валюта КАК Валюта,
		|	ВЫРАЗИТЬ(СУММА(_ЗадолженностьПоДенежнымСредствам.Сумма) КАК ЧИСЛО(19, 2)) КАК Сумма,
		|	_ЗадолженностьПоДенежнымСредствам.Дата КАК Дата
		|ПОМЕСТИТЬ _ИтоговаяЗадолженностьПоДС
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствам КАК _ЗадолженностьПоДенежнымСредствам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоДенежнымСредствам.ТипЗадолженности,
		|	_ЗадолженностьПоДенежнымСредствам.Задолженность,
		|	_ЗадолженностьПоДенежнымСредствам.СчетДоверительногоУправления,
		|	_ЗадолженностьПоДенежнымСредствам.Валюта,
		|	_ЗадолженностьПоДенежнымСредствам.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.СчетДоверительногоУправления, _ДенежныеСредства1С.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВложенныйЗапрос.МестоХранения, _ДенежныеСредства1С.МестоХранения) КАК МестоХранения,
		|	ЕСТЬNULL(ВложенныйЗапрос.Валюта, _ДенежныеСредства1С.Валюта) КАК Валюта,
		|	ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК СуммаБрокер,
		|	ЕСТЬNULL(_ДенежныеСредства1С.Сумма, 0) КАК Сумма1С,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) <> ЕСТЬNULL(_ДенежныеСредства1С.Сумма, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Расхождение,
		|	ЕСТЬNULL(ВложенныйЗапрос.Дата, _ДенежныеСредства1С.Дата) КАК Дата
		|ИЗ
		|	_ДенежныеСредства1С КАК _ДенежныеСредства1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДенежныеСредства_OTBR.Сумма КАК Сумма,
		|			_ДенежныеСредства_OTBR.Division_Type КАК Division_Type,
		|			_ДенежныеСредства_OTBR.ТипЗадолженности КАК ТипЗадолженности,
		|			_ДенежныеСредства_OTBR.Задолженность КАК Задолженность,
		|			_ДенежныеСредства_OTBR.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ДенежныеСредства_OTBR.Валюта КАК Валюта,
		|			_ДенежныеСредства_OTBR.МестоХранения КАК МестоХранения,
		|			_ДенежныеСредства_OTBR.Date КАК Дата
		|		ИЗ
		|			_ДенежныеСредства_OTBR КАК _ДенежныеСредства_OTBR
		|		ГДЕ
		|			_ДенежныеСредства_OTBR.Division_Type = ""Remains.Out"") КАК ВложенныйЗапрос
		|		ПО _ДенежныеСредства1С.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _ДенежныеСредства1С.МестоХранения = ВложенныйЗапрос.МестоХранения
		|			И _ДенежныеСредства1С.Валюта = ВложенныйЗапрос.Валюта
		|			И _ДенежныеСредства1С.Дата = ВложенныйЗапрос.Дата
		|ГДЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) <> ЕСТЬNULL(_ДенежныеСредства1С.Сумма, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	СчетДоверительногоУправления,
		|	МестоХранения,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.СчетДоверительногоУправления, _ЦенныеБумаги1С.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВложенныйЗапрос.ЦеннаяБумага, _ЦенныеБумаги1С.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ВложенныйЗапрос.ДепозитарныйСчет, _ЦенныеБумаги1С.ДепозитарныйСчет) КАК ДепозитарныйСчет,
		|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК КоличествоБрокер,
		|	ЕСТЬNULL(_ЦенныеБумаги1С.Количество, 0) КАК Количество1С,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) <> ЕСТЬNULL(_ЦенныеБумаги1С.Количество, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Расхождение,
		|	ЕСТЬNULL(ВложенныйЗапрос.Дата, _ЦенныеБумаги1С.Дата) КАК Дата
		|ИЗ
		|	_ЦенныеБумаги1С КАК _ЦенныеБумаги1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ЦенныеБумаги_OTBR.Количество КАК Количество,
		|			_ЦенныеБумаги_OTBR.Division_Type КАК Division_Type,
		|			_ЦенныеБумаги_OTBR.ТипЗадолженности КАК ТипЗадолженности,
		|			_ЦенныеБумаги_OTBR.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ЦенныеБумаги_OTBR.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_ЦенныеБумаги_OTBR.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|			_ЦенныеБумаги_OTBR.Date КАК Дата
		|		ИЗ
		|			_ЦенныеБумаги_OTBR КАК _ЦенныеБумаги_OTBR
		|		ГДЕ
		|			_ЦенныеБумаги_OTBR.Division_Type = ""Remains.Out"") КАК ВложенныйЗапрос
		|		ПО _ЦенныеБумаги1С.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _ЦенныеБумаги1С.ЦеннаяБумага = ВложенныйЗапрос.ЦеннаяБумага
		|			И _ЦенныеБумаги1С.ДепозитарныйСчет = ВложенныйЗапрос.ДепозитарныйСчет
		|			И _ЦенныеБумаги1С.Дата = ВложенныйЗапрос.Дата
		|ГДЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) <> ЕСТЬNULL(_ЦенныеБумаги1С.Количество, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	СчетДоверительногоУправления,
		|	ЦеннаяБумага,
		|	ДепозитарныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.СчетДоверительногоУправления, _ИтоговаяЗадолженностьПоДС.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТипЗадолженности, _ИтоговаяЗадолженностьПоДС.ТипЗадолженности) КАК ТипЗадолженности,
		|	ЕСТЬNULL(ВложенныйЗапрос.Задолженность, _ИтоговаяЗадолженностьПоДС.Задолженность) КАК Задолженность,
		|	ЕСТЬNULL(ВложенныйЗапрос.Валюта, _ИтоговаяЗадолженностьПоДС.Валюта) КАК Валюта,
		|	ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК СуммаБрокер,
		|	ЕСТЬNULL(_ИтоговаяЗадолженностьПоДС.Сумма, 0) КАК Сумма1С,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) <> ЕСТЬNULL(_ИтоговаяЗадолженностьПоДС.Сумма, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Расхождение,
		|	ЕСТЬNULL(ВложенныйЗапрос.Дата, _ИтоговаяЗадолженностьПоДС.Дата) КАК Дата
		|ИЗ
		|	_ИтоговаяЗадолженностьПоДС КАК _ИтоговаяЗадолженностьПоДС
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(_ДенежныеСредства_OTBR.Сумма) КАК Сумма,
		|			_ДенежныеСредства_OTBR.ТипЗадолженности КАК ТипЗадолженности,
		|			_ДенежныеСредства_OTBR.Задолженность КАК Задолженность,
		|			_ДенежныеСредства_OTBR.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ДенежныеСредства_OTBR.Валюта КАК Валюта,
		|			_ДенежныеСредства_OTBR.Date КАК Дата
		|		ИЗ
		|			_ДенежныеСредства_OTBR КАК _ДенежныеСредства_OTBR
		|		ГДЕ
		|			_ДенежныеСредства_OTBR.Division_Type В (""Obligations.Delivery"", ""Obligations.Receipt"", ""Obligations.Charges"")
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДенежныеСредства_OTBR.ТипЗадолженности,
		|			_ДенежныеСредства_OTBR.Задолженность,
		|			_ДенежныеСредства_OTBR.СчетДоверительногоУправления,
		|			_ДенежныеСредства_OTBR.Валюта,
		|			_ДенежныеСредства_OTBR.Date) КАК ВложенныйЗапрос
		|		ПО _ИтоговаяЗадолженностьПоДС.ТипЗадолженности = ВложенныйЗапрос.ТипЗадолженности
		|			И _ИтоговаяЗадолженностьПоДС.Задолженность = ВложенныйЗапрос.Задолженность
		|			И _ИтоговаяЗадолженностьПоДС.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _ИтоговаяЗадолженностьПоДС.Валюта = ВложенныйЗапрос.Валюта
		|			И _ИтоговаяЗадолженностьПоДС.Дата = ВложенныйЗапрос.Дата
		|ГДЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) <> ЕСТЬNULL(_ИтоговаяЗадолженностьПоДС.Сумма, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	СчетДоверительногоУправления,
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.СчетДоверительногоУправления, ВложенныйЗапросЗадолженность1С.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВложенныйЗапрос.ДепозитарныйСчет, ВложенныйЗапросЗадолженность1С.ДепозитарныйСчет) КАК ДепозитарныйСчет,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТипЗадолженности, ВложенныйЗапросЗадолженность1С.ТипЗадолженности) КАК ТипЗадолженности,
		|	ЕСТЬNULL(ВложенныйЗапрос.ЦеннаяБумага, ВложенныйЗапросЗадолженность1С.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК КоличествоБрокер,
		|	ЕСТЬNULL(ВложенныйЗапросЗадолженность1С.Количество, 0) КАК Количество1С,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) <> ЕСТЬNULL(ВложенныйЗапросЗадолженность1С.Количество, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Расхождение,
		|	ЕСТЬNULL(ВложенныйЗапрос.Дата, ВложенныйЗапросЗадолженность1С.Дата) КАК Дата
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЦенныеБумаги_OTBR.Количество КАК Количество,
		|		_ЦенныеБумаги_OTBR.Division_Type КАК Division_Type,
		|		_ЦенныеБумаги_OTBR.ТипЗадолженности КАК ТипЗадолженности,
		|		_ЦенныеБумаги_OTBR.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ЦенныеБумаги_OTBR.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ЦенныеБумаги_OTBR.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|		_ЦенныеБумаги_OTBR.Date КАК Дата
		|	ИЗ
		|		_ЦенныеБумаги_OTBR КАК _ЦенныеБумаги_OTBR
		|	ГДЕ
		|		_ЦенныеБумаги_OTBR.Division_Type В (""Obligations.Delivery"", ""Obligations.Receipt"")) КАК ВложенныйЗапрос
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ИтоговаяЗадолженностьПоЦБ.ТипЗадолженности КАК ТипЗадолженности,
		|			_ИтоговаяЗадолженностьПоЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ИтоговаяЗадолженностьПоЦБ.Организация КАК Организация,
		|			_ИтоговаяЗадолженностьПоЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_ИтоговаяЗадолженностьПоЦБ.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|			_ИтоговаяЗадолженностьПоЦБ.Количество КАК Количество,
		|			_ИтоговаяЗадолженностьПоЦБ.Дата КАК Дата
		|		ИЗ
		|			_ИтоговаяЗадолженностьПоЦБ КАК _ИтоговаяЗадолженностьПоЦБ
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА _ИтоговаяЗадолженностьПоЦБ.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|						ТОГДА _ИтоговаяЗадолженностьПоЦБ.ДепозитарныйСчет.Депозитарий = &Депозитарий
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|			И НЕ _ИтоговаяЗадолженностьПоЦБ.ДепозитарныйСчет ЕСТЬ NULL) КАК ВложенныйЗапросЗадолженность1С
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = ВложенныйЗапросЗадолженность1С.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ТипЗадолженности = ВложенныйЗапросЗадолженность1С.ТипЗадолженности
		|			И ВложенныйЗапрос.ДепозитарныйСчет = ВложенныйЗапросЗадолженность1С.ДепозитарныйСчет
		|			И ВложенныйЗапрос.ЦеннаяБумага = ВложенныйЗапросЗадолженность1С.ЦеннаяБумага
		|			И ВложенныйЗапрос.Дата = ВложенныйЗапросЗадолженность1С.Дата
		|ГДЕ
		|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) <> ЕСТЬNULL(ВложенныйЗапросЗадолженность1С.Количество, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	СчетДоверительногоУправления,
		|	ЦеннаяБумага,
		|	ДепозитарныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Depo_Remains
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Money_Remains
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДенежныеСредства_OTBR
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЦенныеБумаги_OTBR
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДенежныеСредства1С
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЦенныеБумаги1С
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностьПоВторойЧастиРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностьПоЦеннымБумагам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяЗадолженностьПоЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностьПоДенежнымСредствам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговаяЗадолженностьПоДС";
	
#КонецОбласти
	
	Запрос.УстановитьПараметр("НачалоПериода"      , НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"       , КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация"        , ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Брокер"             , Брокер);
	Запрос.УстановитьПараметр("Депозитарий"        , Депозитарий);
	Запрос.УстановитьПараметр("Money_Remains"      , СтруктураВнешнихДанных.Money_Remains);
	Запрос.УстановитьПараметр("Depo_Remains"       , СтруктураВнешнихДанных.Depo_Remains);
	Запрос.УстановитьПараметр("ОтборПоСчетуДУ"     , (СчетаДУ <> Неопределено));
	Запрос.УстановитьПараметр("СчетаДУ"            , СчетаДУ);
	Запрос.УстановитьПараметр("РоссийскийРубль"    , ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("ДатыИсключены"      , МассивДатИсключенныхИзСверки);
	
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатСверкиОстатковДС      = Результат[12].Выгрузить();
	РезультатСверкиОстатковЦБ      = Результат[13].Выгрузить();
	РезультатСверкиЗадолженностиДС = Результат[14].Выгрузить();
	РезультатСверкиЗадолженностиЦБ = Результат[15].Выгрузить();
	
	Возврат Новый Структура("СверкаДС, СверкаЦБ, СверкаЗадолженностьДС, СверкаЗадолженностьЦБ", РезультатСверкиОстатковДС, РезультатСверкиОстатковЦБ, РезультатСверкиЗадолженностиДС, РезультатСверкиЗадолженностиЦБ);
	
КонецФункции //СверитьОстаткиСДаннымиФайловOTBR

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапроса()
	
	Возврат
#Область ТекстЗапроса
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_КлючиСПолнымПериодом.ДБО КАК ДБО,
			|	_КлючиСПолнымПериодом.СА КАК СА,
			|	_КлючиСПолнымПериодом.СДУ КАК СДУ,
			|	_КлючиСПолнымПериодом.НачалоПериода КАК НачалоПериода,
			|	_КлючиСПолнымПериодом.КонецПериода КАК КонецПериода
			|ПОМЕСТИТЬ _Ключи
			|ИЗ
			|	_КлючиСПолнымПериодом КАК _КлючиСПолнымПериодом
			|ГДЕ
			|	&ПолныйПериод
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_КлючиСРазделеннымПериодом.ДБО,
			|	_КлючиСРазделеннымПериодом.СА,
			|	_КлючиСРазделеннымПериодом.СДУ,
			|	_КлючиСРазделеннымПериодом.НачалоПериода,
			|	_КлючиСРазделеннымПериодом.КонецПериода
			|ИЗ
			|	_КлючиСРазделеннымПериодом КАК _КлючиСРазделеннымПериодом
			|ГДЕ
			|	НЕ &ПолныйПериод
			|	И _КлючиСРазделеннымПериодом.НачалоПериода = &НачалоПериода
			|	И _КлючиСРазделеннымПериодом.КонецПериода = &КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОстаткиДенежныхСредств.ДБО КАК ДБО,
			|	_ОстаткиДенежныхСредств.СА КАК СА,
			|	_ОстаткиДенежныхСредств.НачалоПериода КАК НачалоПериода,
			|	_ОстаткиДенежныхСредств.КонецПериода КАК КонецПериода,
			|	_ОстаткиДенежныхСредств.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОстаткиДенежныхСредств.ВнебиржевойРынок КАК ВнебиржевойРынок,
			|	_ОстаткиДенежныхСредств.Валюта КАК Валюта,
			|	СУММА(_ОстаткиДенежныхСредств.НачальныйОстатокБрокер) КАК НачальныйОстатокБрокер,
			|	СУММА(_ОстаткиДенежныхСредств.КонечныйОстатокБрокер) КАК КонечныйОстатокБрокер
			|ПОМЕСТИТЬ _ОстаткиДенежныхСредствБрокер
			|ИЗ
			|	_ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредств
			|ГДЕ
			|	(_ОстаткиДенежныхСредств.ДБО, _ОстаткиДенежныхСредств.СА, _ОстаткиДенежныхСредств.НачалоПериода, _ОстаткиДенежныхСредств.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОстаткиДенежныхСредств.ДБО,
			|	_ОстаткиДенежныхСредств.СА,
			|	_ОстаткиДенежныхСредств.ВалютнаяСекция,
			|	_ОстаткиДенежныхСредств.ВнебиржевойРынок,
			|	_ОстаткиДенежныхСредств.Валюта,
			|	_ОстаткиДенежныхСредств.НачалоПериода,
			|	_ОстаткиДенежныхСредств.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	ВнебиржевойРынок,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбязательстваПоДенежнымСредствам.ДБО КАК ДБО,
			|	_ОбязательстваПоДенежнымСредствам.СА КАК СА,
			|	_ОбязательстваПоДенежнымСредствам.НачалоПериода КАК НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствам.КонецПериода КАК КонецПериода,
			|	_ОбязательстваПоДенежнымСредствам.Валюта КАК Валюта,
			|	СУММА(_ОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженностьБрокер) КАК ДебиторскаяЗадолженностьБрокер,
			|	СУММА(_ОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженностьБрокер) КАК КредиторскаяЗадолженностьБрокер
			|ПОМЕСТИТЬ _ОбязательстваПоДенежнымСредствамБрокер
			|ИЗ
			|	_ОбязательстваПоДенежнымСредствам КАК _ОбязательстваПоДенежнымСредствам
			|ГДЕ
			|	(_ОбязательстваПоДенежнымСредствам.ДБО, _ОбязательстваПоДенежнымСредствам.СА, _ОбязательстваПоДенежнымСредствам.НачалоПериода, _ОбязательстваПоДенежнымСредствам.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОбязательстваПоДенежнымСредствам.ДБО,
			|	_ОбязательстваПоДенежнымСредствам.СА,
			|	_ОбязательстваПоДенежнымСредствам.Валюта,
			|	_ОбязательстваПоДенежнымСредствам.НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствам.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОстаткиЗадолженностиПоКомиссии.ДБО КАК ДБО,
			|	_ОстаткиЗадолженностиПоКомиссии.СА КАК СА,
			|	_ОстаткиЗадолженностиПоКомиссии.НачалоПериода КАК НачалоПериода,
			|	_ОстаткиЗадолженностиПоКомиссии.КонецПериода КАК КонецПериода,
			|	_ОстаткиЗадолженностиПоКомиссии.Валюта КАК Валюта,
			|	_ОстаткиЗадолженностиПоКомиссии.ТипКомиссии КАК ТипКомиссии,
			|	СУММА(_ОстаткиЗадолженностиПоКомиссии.НачальныйОстатокБрокер) КАК НачальныйОстатокБрокер,
			|	СУММА(_ОстаткиЗадолженностиПоКомиссии.КонечныйОстатокБрокер) КАК КонечныйОстатокБрокер
			|ПОМЕСТИТЬ _ОстаткиЗадолженностиПоКомиссииБрокер
			|ИЗ
			|	_ОстаткиЗадолженностиПоКомиссии КАК _ОстаткиЗадолженностиПоКомиссии
			|ГДЕ
			|	(_ОстаткиЗадолженностиПоКомиссии.ДБО, _ОстаткиЗадолженностиПоКомиссии.СА, _ОстаткиЗадолженностиПоКомиссии.НачалоПериода, _ОстаткиЗадолженностиПоКомиссии.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОстаткиЗадолженностиПоКомиссии.ДБО,
			|	_ОстаткиЗадолженностиПоКомиссии.СА,
			|	_ОстаткиЗадолженностиПоКомиссии.Валюта,
			|	_ОстаткиЗадолженностиПоКомиссии.НачалоПериода,
			|	_ОстаткиЗадолженностиПоКомиссии.КонецПериода,
			|	_ОстаткиЗадолженностиПоКомиссии.ТипКомиссии
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_НачисленнаяКомиссияЗаПериод.ДБО КАК ДБО,
			|	_НачисленнаяКомиссияЗаПериод.СА КАК СА,
			|	_НачисленнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
			|	_НачисленнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
			|	_НачисленнаяКомиссияЗаПериод.Валюта КАК Валюта,
			|	_НачисленнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
			|	СУММА(_НачисленнаяКомиссияЗаПериод.СуммаБрокер) КАК СуммаБрокер
			|ПОМЕСТИТЬ _НачисленнаяКомиссияЗаПериодБрокер
			|ИЗ
			|	_НачисленнаяКомиссияЗаПериод КАК _НачисленнаяКомиссияЗаПериод
			|ГДЕ
			|	(_НачисленнаяКомиссияЗаПериод.ДБО, _НачисленнаяКомиссияЗаПериод.СА, _НачисленнаяКомиссияЗаПериод.НачалоПериода, _НачисленнаяКомиссияЗаПериод.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_НачисленнаяКомиссияЗаПериод.ДБО,
			|	_НачисленнаяКомиссияЗаПериод.СА,
			|	_НачисленнаяКомиссияЗаПериод.Валюта,
			|	_НачисленнаяКомиссияЗаПериод.ТипКомиссии,
			|	_НачисленнаяКомиссияЗаПериод.НачалоПериода,
			|	_НачисленнаяКомиссияЗаПериод.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта,
			|	ТипКомиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОплаченнаяКомиссияЗаПериод.ДБО КАК ДБО,
			|	_ОплаченнаяКомиссияЗаПериод.СА КАК СА,
			|	_ОплаченнаяКомиссияЗаПериод.НачалоПериода КАК НачалоПериода,
			|	_ОплаченнаяКомиссияЗаПериод.КонецПериода КАК КонецПериода,
			|	_ОплаченнаяКомиссияЗаПериод.Валюта КАК Валюта,
			|	_ОплаченнаяКомиссияЗаПериод.ТипКомиссии КАК ТипКомиссии,
			|	СУММА(_ОплаченнаяКомиссияЗаПериод.СуммаБрокер) КАК СуммаБрокер
			|ПОМЕСТИТЬ _ОплаченнаяКомиссияЗаПериодБрокер
			|ИЗ
			|	_ОплаченнаяКомиссияЗаПериод КАК _ОплаченнаяКомиссияЗаПериод
			|ГДЕ
			|	(_ОплаченнаяКомиссияЗаПериод.ДБО, _ОплаченнаяКомиссияЗаПериод.СА, _ОплаченнаяКомиссияЗаПериод.НачалоПериода, _ОплаченнаяКомиссияЗаПериод.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОплаченнаяКомиссияЗаПериод.ДБО,
			|	_ОплаченнаяКомиссияЗаПериод.СА,
			|	_ОплаченнаяКомиссияЗаПериод.Валюта,
			|	_ОплаченнаяКомиссияЗаПериод.ТипКомиссии,
			|	_ОплаченнаяКомиссияЗаПериод.НачалоПериода,
			|	_ОплаченнаяКомиссияЗаПериод.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта,
			|	ТипКомиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДвиженияДенежныхСредств.ДБО КАК ДБО,
			|	_ДвиженияДенежныхСредств.СА КАК СА,
			|	_ДвиженияДенежныхСредств.НачалоПериода КАК НачалоПериода,
			|	_ДвиженияДенежныхСредств.КонецПериода КАК КонецПериода,
			|	_ДвиженияДенежныхСредств.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ДвиженияДенежныхСредств.Валюта КАК Валюта,
			|	СУММА(_ДвиженияДенежныхСредств.ПриходБрокер) КАК ПриходБрокер,
			|	СУММА(_ДвиженияДенежныхСредств.РасходБрокер) КАК РасходБрокер
			|ПОМЕСТИТЬ _ДвиженияДенежныхСредствБрокер
			|ИЗ
			|	_ДвиженияДенежныхСредств КАК _ДвиженияДенежныхСредств
			|ГДЕ
			|	(_ДвиженияДенежныхСредств.ДБО, _ДвиженияДенежныхСредств.СА, _ДвиженияДенежныхСредств.НачалоПериода, _ДвиженияДенежныхСредств.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДвиженияДенежныхСредств.ДБО,
			|	_ДвиженияДенежныхСредств.СА,
			|	_ДвиженияДенежныхСредств.ВалютнаяСекция,
			|	_ДвиженияДенежныхСредств.Валюта,
			|	_ДвиженияДенежныхСредств.НачалоПериода,
			|	_ДвиженияДенежныхСредств.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗаблокированныеДенежныеСредства.ДБО КАК ДБО,
			|	_ЗаблокированныеДенежныеСредства.СА КАК СА,
			|	_ЗаблокированныеДенежныеСредства.НачалоПериода КАК НачалоПериода,
			|	_ЗаблокированныеДенежныеСредства.КонецПериода КАК КонецПериода,
			|	_ЗаблокированныеДенежныеСредства.Валюта КАК Валюта,
			|	СУММА(_ЗаблокированныеДенежныеСредства.СуммаБрокер) КАК СуммаБрокер
			|ПОМЕСТИТЬ _ЗаблокированныеДенежныеСредстваБрокер
			|ИЗ
			|	_ЗаблокированныеДенежныеСредства КАК _ЗаблокированныеДенежныеСредства
			|ГДЕ
			|	(_ЗаблокированныеДенежныеСредства.ДБО, _ЗаблокированныеДенежныеСредства.СА, _ЗаблокированныеДенежныеСредства.НачалоПериода, _ЗаблокированныеДенежныеСредства.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЗаблокированныеДенежныеСредства.ДБО,
			|	_ЗаблокированныеДенежныеСредства.СА,
			|	_ЗаблокированныеДенежныеСредства.Валюта,
			|	_ЗаблокированныеДенежныеСредства.НачалоПериода,
			|	_ЗаблокированныеДенежныеСредства.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияДенежныхСредств.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредств.СА КАК СА,
			|	_ОжидаемыеПоступленияДенежныхСредств.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредств.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияДенежныхСредств.Валюта КАК Валюта,
			|	СУММА(_ОжидаемыеПоступленияДенежныхСредств.СуммаБрокер) КАК СуммаБрокер
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияДенежныхСредствБрокер
			|ИЗ
			|	_ОжидаемыеПоступленияДенежныхСредств КАК _ОжидаемыеПоступленияДенежныхСредств
			|ГДЕ
			|	(_ОжидаемыеПоступленияДенежныхСредств.ДБО, _ОжидаемыеПоступленияДенежныхСредств.СА, _ОжидаемыеПоступленияДенежныхСредств.НачалоПериода, _ОжидаемыеПоступленияДенежныхСредств.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияДенежныхСредств.ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредств.СА,
			|	_ОжидаемыеПоступленияДенежныхСредств.Валюта,
			|	_ОжидаемыеПоступленияДенежныхСредств.НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредств.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КонверсионныеСделки.ДБО КАК ДБО,
			|	_КонверсионныеСделки.СА КАК СА,
			|	_КонверсионныеСделки.НачалоПериода КАК НачалоПериода,
			|	_КонверсионныеСделки.КонецПериода КАК КонецПериода,
			|	_КонверсионныеСделки.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_КонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
			|	_КонверсионныеСделки.Дата КАК Дата,
			|	_КонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
			|	_КонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
			|	_КонверсионныеСделки.Курс КАК Курс,
			|	_КонверсионныеСделки.Сумма КАК Сумма,
			|	_КонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
			|	_КонверсионныеСделки.Контрвалюта КАК Контрвалюта,
			|	_КонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
			|ПОМЕСТИТЬ _КонверсионныеСделкиБрокер
			|ИЗ
			|	_КонверсионныеСделки КАК _КонверсионныеСделки
			|ГДЕ
			|	(_КонверсионныеСделки.ДБО, _КонверсионныеСделки.СА, _КонверсионныеСделки.НачалоПериода, _КонверсионныеСделки.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_КонверсионныеСделки.ДБО,
			|	_КонверсионныеСделки.СА,
			|	_КонверсионныеСделки.НачалоПериода,
			|	_КонверсионныеСделки.КонецПериода,
			|	_КонверсионныеСделки.ВнебиржеваяСделка,
			|	_КонверсионныеСделки.Дата,
			|	_КонверсионныеСделки.ДатаВалютирования,
			|	_КонверсионныеСделки.НаправлениеСделки,
			|	_КонверсионныеСделки.Курс,
			|	_КонверсионныеСделки.Сумма,
			|	_КонверсионныеСделки.БазоваяВалюта,
			|	_КонверсионныеСделки.Контрвалюта,
			|	_КонверсионныеСделки.КомиссияБрокера,
			|	_КонверсионныеСделки.ВалютнаяСекция
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_НезавершенныеКонверсионныеСделки.ДБО КАК ДБО,
			|	_НезавершенныеКонверсионныеСделки.СА КАК СА,
			|	_НезавершенныеКонверсионныеСделки.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_НезавершенныеКонверсионныеСделки.НачалоПериода КАК НачалоПериода,
			|	_НезавершенныеКонверсионныеСделки.КонецПериода КАК КонецПериода,
			|	_НезавершенныеКонверсионныеСделки.ВнебиржеваяСделка КАК ВнебиржеваяСделка,
			|	_НезавершенныеКонверсионныеСделки.Дата КАК Дата,
			|	_НезавершенныеКонверсионныеСделки.ДатаВалютирования КАК ДатаВалютирования,
			|	_НезавершенныеКонверсионныеСделки.НаправлениеСделки КАК НаправлениеСделки,
			|	_НезавершенныеКонверсионныеСделки.Курс КАК Курс,
			|	_НезавершенныеКонверсионныеСделки.Сумма КАК Сумма,
			|	_НезавершенныеКонверсионныеСделки.БазоваяВалюта КАК БазоваяВалюта,
			|	_НезавершенныеКонверсионныеСделки.Контрвалюта КАК Контрвалюта,
			|	_НезавершенныеКонверсионныеСделки.КомиссияБрокера КАК КомиссияБрокера
			|ПОМЕСТИТЬ _НезавершенныеКонверсионныеСделкиБрокер
			|ИЗ
			|	_НезавершенныеКонверсионныеСделки КАК _НезавершенныеКонверсионныеСделки
			|ГДЕ
			|	(_НезавершенныеКонверсионныеСделки.ДБО, _НезавершенныеКонверсионныеСделки.СА, _НезавершенныеКонверсионныеСделки.НачалоПериода, _НезавершенныеКонверсионныеСделки.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_НезавершенныеКонверсионныеСделки.ДБО,
			|	_НезавершенныеКонверсионныеСделки.СА,
			|	_НезавершенныеКонверсионныеСделки.НачалоПериода,
			|	_НезавершенныеКонверсионныеСделки.КонецПериода,
			|	_НезавершенныеКонверсионныеСделки.ВнебиржеваяСделка,
			|	_НезавершенныеКонверсионныеСделки.Дата,
			|	_НезавершенныеКонверсионныеСделки.ДатаВалютирования,
			|	_НезавершенныеКонверсионныеСделки.НаправлениеСделки,
			|	_НезавершенныеКонверсионныеСделки.Курс,
			|	_НезавершенныеКонверсионныеСделки.Сумма,
			|	_НезавершенныеКонверсионныеСделки.БазоваяВалюта,
			|	_НезавершенныеКонверсионныеСделки.Контрвалюта,
			|	_НезавершенныеКонверсионныеСделки.КомиссияБрокера,
			|	_НезавершенныеКонверсионныеСделки.ВалютнаяСекция
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОстаткиЦенныхБумаг.ДБО КАК ДБО,
			|	_ОстаткиЦенныхБумаг.СА КАК СА,
			|	_ОстаткиЦенныхБумаг.НачалоПериода КАК НачалоПериода,
			|	_ОстаткиЦенныхБумаг.КонецПериода КАК КонецПериода,
			|	_ОстаткиЦенныхБумаг.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОстаткиЦенныхБумаг.ЦБ КАК ЦБ,
			|	СУММА(_ОстаткиЦенныхБумаг.НачальныйОстаток) КАК НачальныйОстаток,
			|	СУММА(_ОстаткиЦенныхБумаг.КонечныйОстаток) КАК КонечныйОстаток
			|ПОМЕСТИТЬ _ОстаткиЦенныхБумагБрокер
			|ИЗ
			|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
			|ГДЕ
			|	(_ОстаткиЦенныхБумаг.ДБО, _ОстаткиЦенныхБумаг.СА, _ОстаткиЦенныхБумаг.НачалоПериода, _ОстаткиЦенныхБумаг.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОстаткиЦенныхБумаг.ДБО,
			|	_ОстаткиЦенныхБумаг.СА,
			|	_ОстаткиЦенныхБумаг.ВалютнаяСекция,
			|	_ОстаткиЦенныхБумаг.ЦБ,
			|	_ОстаткиЦенныхБумаг.НачалоПериода,
			|	_ОстаткиЦенныхБумаг.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	ЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗадолженностьПоЦБ.ДБО КАК ДБО,
			|	_ЗадолженностьПоЦБ.СА КАК СА,
			|	_ЗадолженностьПоЦБ.НачалоПериода КАК НачалоПериода,
			|	_ЗадолженностьПоЦБ.КонецПериода КАК КонецПериода,
			|	_ЗадолженностьПоЦБ.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ЗадолженностьПоЦБ.ЦБ КАК ЦБ,
			|	_ЗадолженностьПоЦБ.ИсходящийОстаток КАК ИсходящийОстаток,
			|	_ЗадолженностьПоЦБ.ОбязательстваКПолучению КАК ОбязательстваКПолучению,
			|	_ЗадолженностьПоЦБ.ОбязательстваКВыбытию КАК ОбязательстваКВыбытию,
			|	_ЗадолженностьПоЦБ.ПлановыйИсходящийОстаток КАК ПлановыйИсходящийОстаток
			|ПОМЕСТИТЬ _ЗадолженностьПоЦББрокер
			|ИЗ
			|	_ЗадолженностьПоЦБ КАК _ЗадолженностьПоЦБ
			|ГДЕ
			|	(_ЗадолженностьПоЦБ.ДБО, _ЗадолженностьПоЦБ.СА, _ЗадолженностьПоЦБ.НачалоПериода, _ЗадолженностьПоЦБ.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЗадолженностьПоЦБ.ДБО,
			|	_ЗадолженностьПоЦБ.СА,
			|	_ЗадолженностьПоЦБ.ВалютнаяСекция,
			|	_ЗадолженностьПоЦБ.ЦБ,
			|	_ЗадолженностьПоЦБ.НачалоПериода,
			|	_ЗадолженностьПоЦБ.КонецПериода,
			|	_ЗадолженностьПоЦБ.ИсходящийОстаток,
			|	_ЗадолженностьПоЦБ.ОбязательстваКПолучению,
			|	_ЗадолженностьПоЦБ.ОбязательстваКВыбытию,
			|	_ЗадолженностьПоЦБ.ПлановыйИсходящийОстаток
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	ЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДвиженияЦенныхБумаг.ДБО КАК ДБО,
			|	_ДвиженияЦенныхБумаг.СА КАК СА,
			|	_ДвиженияЦенныхБумаг.НачалоПериода КАК НачалоПериода,
			|	_ДвиженияЦенныхБумаг.КонецПериода КАК КонецПериода,
			|	_ДвиженияЦенныхБумаг.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ДвиженияЦенныхБумаг.ЦБ КАК ЦБ,
			|	_ДвиженияЦенныхБумаг.ДатаОперации КАК ДатаОперации,
			|	СУММА(_ДвиженияЦенныхБумаг.Приход) КАК Приход,
			|	СУММА(_ДвиженияЦенныхБумаг.Расход) КАК Расход
			|ПОМЕСТИТЬ _ДвиженияАкцийБрокер
			|ИЗ
			|	_ДвиженияАкций КАК _ДвиженияЦенныхБумаг
			|ГДЕ
			|	(_ДвиженияЦенныхБумаг.ДБО, _ДвиженияЦенныхБумаг.СА, _ДвиженияЦенныхБумаг.НачалоПериода, _ДвиженияЦенныхБумаг.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДвиженияЦенныхБумаг.ДБО,
			|	_ДвиженияЦенныхБумаг.СА,
			|	_ДвиженияЦенныхБумаг.ВалютнаяСекция,
			|	_ДвиженияЦенныхБумаг.НачалоПериода,
			|	_ДвиженияЦенныхБумаг.КонецПериода,
			|	_ДвиженияЦенныхБумаг.ЦБ,
			|	_ДвиженияЦенныхБумаг.ДатаОперации
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	ЦБ,
			|	ДатаОперации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДвиженияЦенныхБумаг.ДБО КАК ДБО,
			|	_ДвиженияЦенныхБумаг.СА КАК СА,
			|	_ДвиженияЦенныхБумаг.НачалоПериода КАК НачалоПериода,
			|	_ДвиженияЦенныхБумаг.КонецПериода КАК КонецПериода,
			|	_ДвиженияЦенныхБумаг.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ДвиженияЦенныхБумаг.ЦБ КАК ЦБ,
			|	_ДвиженияЦенныхБумаг.ДатаОперации КАК ДатаОперации,
			|	СУММА(_ДвиженияЦенныхБумаг.Количество) КАК Количество
			|ПОМЕСТИТЬ _ДвиженияЦенныхБумагБрокер
			|ИЗ
			|	_ДвиженияЦенныхБумаг КАК _ДвиженияЦенныхБумаг
			|ГДЕ
			|	(_ДвиженияЦенныхБумаг.ДБО, _ДвиженияЦенныхБумаг.СА, _ДвиженияЦенныхБумаг.НачалоПериода, _ДвиженияЦенныхБумаг.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДвиженияЦенныхБумаг.ДБО,
			|	_ДвиженияЦенныхБумаг.СА,
			|	_ДвиженияЦенныхБумаг.ВалютнаяСекция,
			|	_ДвиженияЦенныхБумаг.НачалоПериода,
			|	_ДвиженияЦенныхБумаг.КонецПериода,
			|	_ДвиженияЦенныхБумаг.ЦБ,
			|	_ДвиженияЦенныхБумаг.ДатаОперации
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	ЦБ,
			|	ДатаОперации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияАкций.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияАкций.СА КАК СА,
			|	_ОжидаемыеПоступленияАкций.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияАкций.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияАкций.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияАкций.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияАкций.Акция КАК Акция,
			|	СУММА(_ОжидаемыеПоступленияАкций.Количество) КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияАкцийБрокер
			|ИЗ
			|	_ОжидаемыеПоступленияАкций КАК _ОжидаемыеПоступленияАкций
			|ГДЕ
			|	(_ОжидаемыеПоступленияАкций.ДБО, _ОжидаемыеПоступленияАкций.СА, _ОжидаемыеПоступленияАкций.НачалоПериода, _ОжидаемыеПоступленияАкций.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияАкций.ДБО,
			|	_ОжидаемыеПоступленияАкций.СА,
			|	_ОжидаемыеПоступленияАкций.ВалютнаяСекция,
			|	_ОжидаемыеПоступленияАкций.НачалоПериода,
			|	_ОжидаемыеПоступленияАкций.КонецПериода,
			|	_ОжидаемыеПоступленияАкций.ДатаОперации,
			|	_ОжидаемыеПоступленияАкций.Акция
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияОблигаций.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияОблигаций.СА КАК СА,
			|	_ОжидаемыеПоступленияОблигаций.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияОблигаций.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияОблигаций.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияОблигаций.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияОблигаций.Облигация КАК Облигация,
			|	СУММА(_ОжидаемыеПоступленияОблигаций.Количество) КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияОблигацийБрокер
			|ИЗ
			|	_ОжидаемыеПоступленияОблигаций КАК _ОжидаемыеПоступленияОблигаций
			|ГДЕ
			|	(_ОжидаемыеПоступленияОблигаций.ДБО, _ОжидаемыеПоступленияОблигаций.СА, _ОжидаемыеПоступленияОблигаций.НачалоПериода, _ОжидаемыеПоступленияОблигаций.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияОблигаций.ДБО,
			|	_ОжидаемыеПоступленияОблигаций.СА,
			|	_ОжидаемыеПоступленияОблигаций.ВалютнаяСекция,
			|	_ОжидаемыеПоступленияОблигаций.НачалоПериода,
			|	_ОжидаемыеПоступленияОблигаций.КонецПериода,
			|	_ОжидаемыеПоступленияОблигаций.ДатаОперации,
			|	_ОжидаемыеПоступленияОблигаций.Облигация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияПаев.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияПаев.СА КАК СА,
			|	_ОжидаемыеПоступленияПаев.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияПаев.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияПаев.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияПаев.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияПаев.Пай КАК Пай,
			|	СУММА(_ОжидаемыеПоступленияПаев.Количество) КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияПаевБрокер
			|ИЗ
			|	_ОжидаемыеПоступленияПаев КАК _ОжидаемыеПоступленияПаев
			|ГДЕ
			|	(_ОжидаемыеПоступленияПаев.ДБО, _ОжидаемыеПоступленияПаев.СА, _ОжидаемыеПоступленияПаев.НачалоПериода, _ОжидаемыеПоступленияПаев.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияПаев.ДБО,
			|	_ОжидаемыеПоступленияПаев.СА,
			|	_ОжидаемыеПоступленияПаев.ВалютнаяСекция,
			|	_ОжидаемыеПоступленияПаев.НачалоПериода,
			|	_ОжидаемыеПоступленияПаев.КонецПериода,
			|	_ОжидаемыеПоступленияПаев.ДатаОперации,
			|	_ОжидаемыеПоступленияПаев.Пай
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗаблокированныеЦенныеБумаги.ДБО КАК ДБО,
			|	_ЗаблокированныеЦенныеБумаги.СА КАК СА,
			|	_ЗаблокированныеЦенныеБумаги.НачалоПериода КАК НачалоПериода,
			|	_ЗаблокированныеЦенныеБумаги.КонецПериода КАК КонецПериода,
			|	_ЗаблокированныеЦенныеБумаги.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ЗаблокированныеЦенныеБумаги.ЦБ КАК ЦБ,
			|	СУММА(_ЗаблокированныеЦенныеБумаги.Заблокировано) КАК Заблокировано
			|ПОМЕСТИТЬ _ЗаблокированныеЦенныеБумагиБрокер
			|ИЗ
			|	_ЗаблокированныеЦенныеБумаги КАК _ЗаблокированныеЦенныеБумаги
			|ГДЕ
			|	(_ЗаблокированныеЦенныеБумаги.ДБО, _ЗаблокированныеЦенныеБумаги.СА, _ЗаблокированныеЦенныеБумаги.НачалоПериода, _ЗаблокированныеЦенныеБумаги.КонецПериода) В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.ДБО КАК ДБО,
			|				_Ключи.СА КАК СА,
			|				_Ключи.НачалоПериода КАК НачалоПериода,
			|				_Ключи.КонецПериода КАК КонецПериода
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЗаблокированныеЦенныеБумаги.ДБО,
			|	_ЗаблокированныеЦенныеБумаги.СА,
			|	_ЗаблокированныеЦенныеБумаги.ВалютнаяСекция,
			|	_ЗаблокированныеЦенныеБумаги.ЦБ,
			|	_ЗаблокированныеЦенныеБумаги.НачалоПериода,
			|	_ЗаблокированныеЦенныеБумаги.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	ЛОЖЬ КАК ВнебиржевойРынок,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта КАК Валюта,
			|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальныйОстатокСистема,
			|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечныйОстатокСистема
			|ПОМЕСТИТЬ _ОстаткиДенежныхСредствСистема
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Организация = &Организация
			|				И Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И НЕ МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ОстаткиДенежныхСредствОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.КонецПериода,
			|	_Ключи.НачалоПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ,
			|	ИСТИНА,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
			|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток),
			|	СУММА(ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток)
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Организация = &Организация
			|				И Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ОстаткиДенежныхСредствОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.КонецПериода,
			|	_Ключи.НачалоПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	Валюта,
			|	ВнебиржевойРынок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ КАК ВалютаОплаты,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ДебиторскаяЗадолженность,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток - ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КредиторскаяЗадолженность,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДатаКурса,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Основание
			|ПОМЕСТИТЬ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&КонецПериодаГраница,
			|			Организация = &Организация
			|				И Основание.Брокер = &Брокер
			|				И (НЕ ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Прочее))
			|					ИЛИ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВариационнойМарже), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходамИРасходам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимУслугам)))
			|				И НЕ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоФорвардуПоставки))
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ,
			|	_Ключи.КонецПериода,
			|	_Ключи.НачалоПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода,
			|	ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта,
			|	ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаОстаток + ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаКупонаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				ТОГДА -ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаОстаток - ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаКупонаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ),
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
			|			&КонецПериодаГраница,
			|			Организация = &Организация
			|				И СделкаРЕПО.Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта,
			|	_Ключи.КонецПериода,
			|	_Ключи.НачалоПериода,
			|	ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДБО КАК ДБО,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.СА КАК СА,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.Основание КАК Основание,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.НачалоПериода КАК НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаОплаты,
			|	СУММА(ВЫБОР
			|			КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|					И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|					И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|					И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|				ТОГДА (ВЫРАЗИТЬ(УсловияСделокСрезПоследних.КурсОплаты КАК ЧИСЛО)) * _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДебиторскаяЗадолженность
			|			ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДебиторскаяЗадолженность
			|		КОНЕЦ) КАК ДебиторскаяЗадолженность,
			|	СУММА(ВЫБОР
			|			КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|					И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|					И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|					И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|				ТОГДА (ВЫРАЗИТЬ(УсловияСделокСрезПоследних.КурсОплаты КАК ЧИСЛО)) * _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.КредиторскаяЗадолженность
			|			ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.КредиторскаяЗадолженность
			|		КОНЕЦ) КАК КредиторскаяЗадолженность,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ КАК ДатаКурса
			|ПОМЕСТИТЬ _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности
			|ИЗ
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям КАК _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И Сделка В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.Основание КАК Основание
			|						ИЗ
			|							_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям КАК _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям)) КАК УсловияСделокСрезПоследних
			|		ПО _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.Основание = УсловияСделокСрезПоследних.Сделка
			|			И _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> УсловияСделокСрезПоследних.ВалютаОплаты
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДБО,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.СА,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.Основание,
			|	ВЫБОР
			|		КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствамСистемаПоОснованиям.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ КАК ТипКомиссии,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальныйОстаток,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечныйОстаток
			|ПОМЕСТИТЬ _ОстаткиЗадолженностиПоКомиссииСистема
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Организация = &Организация
			|				И Контрагент = &БрокерЮридическоеЛицо
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ КАК ТипКомиссии,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК Сумма
			|ПОМЕСТИТЬ _НачисленнаяКомиссияЗаПериодСистема
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Период,
			|			Организация = &Организация
			|				И Контрагент = &БрокерЮридическоеЛицо
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта,
			|	ТипКомиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ КАК ТипКомиссии,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК Сумма
			|ПОМЕСТИТЬ _ОплаченнаяКомиссияЗаПериодСистема
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Период,
			|			Организация = &Организация
			|				И Контрагент = &БрокерЮридическоеЛицо
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|			ТОГДА ""Торговая комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|			ТОГДА ""Брокерская комиссия""
			|		КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
			|			ТОГДА ""Депозитарная комиссия""
			|		ИНАЧЕ ""Прочее""
			|	КОНЕЦ,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	Валюта,
			|	ТипКомиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	ОстаткиДенежныхСредствОбороты.Валюта КАК Валюта,
			|	СУММА(ОстаткиДенежныхСредствОбороты.СуммаПриход) КАК Приход,
			|	СУММА(ОстаткиДенежныхСредствОбороты.СуммаРасход) КАК Расход
			|ПОМЕСТИТЬ _ДвиженияДенежныхСредствСистема
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Период,
			|			Организация = &Организация
			|				И Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)) КАК ОстаткиДенежныхСредствОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиДенежныхСредствОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ОстаткиДенежныхСредствОбороты.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ,
			|	ОстаткиДенежныхСредствОбороты.Валюта,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютнаяСекция,
			|	Валюта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ КАК ВалютаОплаты,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток) КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДатаКурса,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Основание
			|ПОМЕСТИТЬ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&КонецПериодаГраница,
			|			Организация = &Организация
			|				И Основание.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Сделки))
			|				И ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоФорвардуПоставки)
			|				И Основание.Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютаЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ДБО КАК ДБО,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.СА КАК СА,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Основание КАК Основание,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.НачалоПериода КАК НачалоПериода,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаОплаты,
			|	СУММА(ВЫБОР
			|			КОГДА _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|					И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|					И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|					И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|				ТОГДА (ВЫРАЗИТЬ(УсловияСделокСрезПоследних.КурсОплаты КАК ЧИСЛО)) * _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Сумма
			|			ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ КАК ДатаКурса
			|ПОМЕСТИТЬ _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности
			|ИЗ
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям КАК _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И Сделка В
			|						(ВЫБРАТЬ
			|							_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Основание КАК Основание
			|						ИЗ
			|							_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям КАК _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям)) КАК УсловияСделокСрезПоследних
			|		ПО _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Основание = УсловияСделокСрезПоследних.Сделка
			|			И _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> УсловияСделокСрезПоследних.ВалютаОплаты
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ДБО,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.СА,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.Основание,
			|	ВЫБОР
			|		КОГДА _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.НачалоПериода,
			|	_ЗаблокированныеДенежныеСредстваСистемаПоОснованиям.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ КАК ВалютаОплаты,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток) КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ КАК ДатаКурса,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Основание
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&КонецПериодаГраница,
			|			Организация = &Организация
			|				И Основание.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Сделки))
			|				И ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоФорвардуПоставки)
			|				И Основание.Брокер = &Брокер
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВалютаОплаты
			|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.Валюта
			|	КОНЕЦ,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Сделка
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаРЕПО
			|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
			|			ТОГДА НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ)
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
			|	КОНЕЦ,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА,
			|	ВалютаОплаты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.СА КАК СА,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаЗадолженности,
			|	ВЫБОР
			|		КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ КАК ВалютаОплаты,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Основание КАК Основание,
			|	СУММА(ВЫБОР
			|			КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|					И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|					И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|					И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|				ТОГДА (ВЫРАЗИТЬ(УсловияСделокСрезПоследних.КурсОплаты КАК ЧИСЛО)) * _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Сумма
			|			ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ КАК ДатаКурса
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности
			|ИЗ
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям КАК _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И Сделка В
			|						(ВЫБРАТЬ
			|							_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Основание КАК Основание
			|						ИЗ
			|							_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям КАК _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям)) КАК УсловияСделокСрезПоследних
			|		ПО _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Основание = УсловияСделокСрезПоследних.Сделка
			|			И _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> УсловияСделокСрезПоследних.ВалютаОплаты
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.СА,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.Основание,
			|	ВЫБОР
			|		КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|				И НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ЧИСЛО)
			|			ТОГДА УсловияСделокСрезПоследних.ВалютаОплаты
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности <> &ВалютаУчета
			|			ТОГДА ЕСТЬNULL(УсловияСделокСрезПоследних.ВалютаОплаты, _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаОплаты)
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ВалютаЗадолженности
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ УсловияСделокСрезПоследних.ВалютаОплаты ЕСТЬ NULL
			|				И УсловияСделокСрезПоследних.СобственныйКурсОплаты
			|				И ТИПЗНАЧЕНИЯ(УсловияСделокСрезПоследних.КурсОплаты) = ТИП(ДАТА)
			|				И УсловияСделокСрезПоследних.КурсОплаты <= &КонецПериода
			|			ТОГДА УсловияСделокСрезПоследних.КурсОплаты
			|		ИНАЧЕ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.ДатаКурса
			|	КОНЕЦ,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КурсыВалют.Период КАК Период,
			|	КурсыВалют.Валюта КАК Валюта,
			|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Коэффициент
			|ПОМЕСТИТЬ _КурсыВалют
			|ИЗ
			|	РегистрСведений.КурсыВалют КАК КурсыВалют
			|ГДЕ
			|	(КурсыВалют.Период, КурсыВалют.Валюта) В
			|			(ВЫБРАТЬ
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ДатаКурса КАК Период,
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаЗадолженности КАК Валюта
			|			ИЗ
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности КАК _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности
			|		
			|			ОБЪЕДИНИТЬ
			|		
			|			ВЫБРАТЬ
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ДатаКурса,
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаОплаты
			|			ИЗ
			|				_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности КАК _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности
			|		
			|			ОБЪЕДИНИТЬ
			|		
			|			ВЫБРАТЬ
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ДатаКурса,
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаЗадолженности
			|			ИЗ
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности КАК _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности
			|		
			|			ОБЪЕДИНИТЬ
			|		
			|			ВЫБРАТЬ
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ДатаКурса,
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаЗадолженности
			|			ИЗ
			|				_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности КАК _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДатаКурса,
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаЗадолженности
			|			ИЗ
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности КАК _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДатаКурса,
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаОплаты
			|			ИЗ
			|				_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности КАК _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КурсыВалют.Период КАК Период,
			|	_КурсыВалют.Валюта КАК Валюта,
			|	_КурсыВалют1.Валюта КАК ВалютаПересчета,
			|	_КурсыВалют.Коэффициент / _КурсыВалют1.Коэффициент КАК Коэффициент
			|ПОМЕСТИТЬ _КоэффициентыВалютДляПересчета
			|ИЗ
			|	_КурсыВалют КАК _КурсыВалют
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют1
			|		ПО _КурсыВалют.Период = _КурсыВалют1.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДБО КАК ДБО,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.СА КАК СА,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.НачалоПериода КАК НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.КонецПериода КАК КонецПериода,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаОплаты КАК Валюта,
			|	СУММА(ВЫБОР
			|			КОГДА _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДебиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент - (ВЫРАЗИТЬ(_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДебиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2))) > 0.05
			|				ТОГДА 0.01
			|			ИНАЧЕ 0
			|		КОНЕЦ + (ВЫРАЗИТЬ(_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДебиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2)))) КАК ДебиторскаяЗадолженность,
			|	СУММА(ВЫБОР
			|			КОГДА _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.КредиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент - (ВЫРАЗИТЬ(_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.КредиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2))) > 0.05
			|				ТОГДА 0.01
			|			ИНАЧЕ 0
			|		КОНЕЦ + (ВЫРАЗИТЬ(_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.КредиторскаяЗадолженность * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2)))) КАК КредиторскаяЗадолженность
			|ПОМЕСТИТЬ _ОбязательстваПоДенежнымСредствамСистема
			|ИЗ
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности КАК _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КоэффициентыВалютДляПересчета КАК _КоэффициентыВалютДляПересчета
			|		ПО _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаЗадолженности = _КоэффициентыВалютДляПересчета.Валюта
			|			И _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаОплаты = _КоэффициентыВалютДляПересчета.ВалютаПересчета
			|			И _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДатаКурса = _КоэффициентыВалютДляПересчета.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ДБО,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.СА,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.ВалютаОплаты,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.НачалоПериода,
			|	_ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности.КонецПериода
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДБО,
			|	СА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ДБО КАК ДБО,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.СА КАК СА,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.НачалоПериода КАК НачалоПериода,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.КонецПериода КАК КонецПериода,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаОплаты КАК Валюта,
			|	СУММА(ВЫБОР
			|			КОГДА _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент - (ВЫРАЗИТЬ(_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2))) > 0.05
			|				ТОГДА 0.01
			|			ИНАЧЕ 0
			|		КОНЕЦ + (ВЫРАЗИТЬ(_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2)))) КАК Сумма
			|ПОМЕСТИТЬ _ЗаблокированныеДенежныеСредстваСистема
			|ИЗ
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности КАК _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КоэффициентыВалютДляПересчета КАК _КоэффициентыВалютДляПересчета
			|		ПО _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаЗадолженности = _КоэффициентыВалютДляПересчета.Валюта
			|			И _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаОплаты = _КоэффициентыВалютДляПересчета.ВалютаПересчета
			|			И _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ДатаКурса = _КоэффициентыВалютДляПересчета.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ДБО,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.СА,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.ВалютаОплаты,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.НачалоПериода,
			|	_ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.СА КАК СА,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаОплаты КАК Валюта,
			|	СУММА(ВЫБОР
			|			КОГДА _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент - (ВЫРАЗИТЬ(_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2))) > 0.05
			|				ТОГДА 0.01
			|			ИНАЧЕ 0
			|		КОНЕЦ + (ВЫРАЗИТЬ(_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.Сумма * _КоэффициентыВалютДляПересчета.Коэффициент КАК ЧИСЛО(19, 2)))) КАК Сумма
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияДенежныхСредствСистема
			|ИЗ
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности КАК _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КоэффициентыВалютДляПересчета КАК _КоэффициентыВалютДляПересчета
			|		ПО _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаЗадолженности = _КоэффициентыВалютДляПересчета.Валюта
			|			И _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаОплаты = _КоэффициентыВалютДляПересчета.ВалютаПересчета
			|			И _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ДатаКурса = _КоэффициентыВалютДляПересчета.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.СА,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.ВалютаОплаты,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ СделкаСВалютой.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	СделкаСВалютой.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)) КАК ВнебиржеваяСделка,
			|	СделкаСВалютой.Дата КАК Дата,
			|	СделкаСВалютой.ДатаИсполнения КАК ДатаВалютирования,
			|	СделкаСВалютой.ВидСделки КАК НаправлениеСделки,
			|	СделкаСВалютой.Курс КАК Курс,
			|	СделкаСВалютой.Сумма КАК Сумма,
			|	СделкаСВалютой.Валюта КАК БазоваяВалюта,
			|	СделкаСВалютой.Контрвалюта КАК Контрвалюта,
			|	ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0) КАК КомиссияБрокера
			|ПОМЕСТИТЬ _КонверсионныеСделкиСистема
			|ИЗ
			|	Документ.СделкаСВалютой КАК СделкаСВалютой
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО СделкаСВалютой.СчетДоверительногоУправления = _Ключи.СДУ
			|			И СделкаСВалютой.Дата >= _Ключи.НачалоПериода
			|			И (НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ) <= _Ключи.КонецПериода)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
			|				&НачалоПериода,
			|				&КонецПериода,
			|				Период,
			|				Организация = &Организация
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|					И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Документ.СделкаСВалютой)) КАК РасходыПоСделкеОбороты
			|		ПО СделкаСВалютой.Ссылка = РасходыПоСделкеОбороты.Сделка
			|			И СделкаСВалютой.СчетДоверительногоУправления = РасходыПоСделкеОбороты.СчетДоверительногоУправления
			|ГДЕ
			|	СделкаСВалютой.Организация = &Организация
			|	И СделкаСВалютой.Проведен
			|	И СделкаСВалютой.Брокер = &Брокер
			|	И СделкаСВалютой.ТипСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.ФорвардПоставочный)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ СделкаСВалютой.МестоХранения = &ВалютнаяСекция
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	СделкаСВалютой.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)) КАК ВнебиржеваяСделка,
			|	СделкаСВалютой.Дата КАК Дата,
			|	СделкаСВалютой.ДатаИсполнения КАК ДатаВалютирования,
			|	СделкаСВалютой.ВидСделки КАК НаправлениеСделки,
			|	СделкаСВалютой.Курс КАК Курс,
			|	СделкаСВалютой.Сумма КАК Сумма,
			|	СделкаСВалютой.Валюта КАК БазоваяВалюта,
			|	СделкаСВалютой.Контрвалюта КАК Контрвалюта,
			|	ЕСТЬNULL(РасходыПоСделкеОбороты.СуммаОборот, 0) КАК КомиссияБрокера
			|ПОМЕСТИТЬ _НезавершенныеКонверсионныеСделкиСистема
			|ИЗ
			|	Документ.СделкаСВалютой КАК СделкаСВалютой
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО СделкаСВалютой.СчетДоверительногоУправления = _Ключи.СДУ
			|			И (НАЧАЛОПЕРИОДА(СделкаСВалютой.Дата, ДЕНЬ) <= _Ключи.КонецПериода)
			|			И СделкаСВалютой.ДатаИсполнения > _Ключи.КонецПериода
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
			|				,
			|				&КонецПериода,
			|				Период,
			|				Организация = &Организация
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|					И ТИПЗНАЧЕНИЯ(Сделка) = ТИП(Документ.СделкаСВалютой)) КАК РасходыПоСделкеОбороты
			|		ПО СделкаСВалютой.Ссылка = РасходыПоСделкеОбороты.Сделка
			|			И СделкаСВалютой.СчетДоверительногоУправления = РасходыПоСделкеОбороты.СчетДоверительногоУправления
			|ГДЕ
			|	СделкаСВалютой.Организация = &Организация
			|	И СделкаСВалютой.Проведен
			|	И СделкаСВалютой.Брокер = &Брокер
			|	И СделкаСВалютой.ТипСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыСделокСВалютой.ФорвардПоставочный)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦБ,
			|	СУММА(ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК ЧИСЛО(19, 2))) КАК НачальныйОстаток,
			|	СУММА(ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК ЧИСЛО(19, 2))) КАК КонечныйОстаток
			|ПОМЕСТИТЬ _ОстаткиЦенныхБумагСистема
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			ДвиженияИГраницыПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И (ЦеннаяБумага ССЫЛКА Справочник.Акции
			|					ИЛИ ЦеннаяБумага ССЫЛКА Справочник.Облигации
			|					ИЛИ ЦеннаяБумага ССЫЛКА Справочник.Паи
			|					ИЛИ ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
			|				И (ДепозитарныйСчет.Брокер = &Брокер
			|					ИЛИ ДепозитарныйСчет.Депозитарий = &Депозитарий)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ _ИсключаемыеСделки
			|ИЗ
			|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|ГДЕ
			|	СделкаЦенныеБумаги.Ссылка.Организация = &Организация
			|	И СделкаЦенныеБумаги.Ссылка.Проведен
			|	И СделкаЦенныеБумаги.Ссылка.Дата <= &КонецПериода
			|	И СделкаЦенныеБумаги.ДепозитарныйСчет.Депозитарий <> &Депозитарий
			|	И СделкаЦенныеБумаги.Ссылка.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка,
			|	СделкаРЕПОЦенныеБумагиВторойЧасти.ЦеннаяБумага
			|ИЗ
			|	Документ.СделкаРЕПО.ЦенныеБумагиВторойЧасти КАК СделкаРЕПОЦенныеБумагиВторойЧасти
			|ГДЕ
			|	СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка.Организация = &Организация
			|	И СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка.Проведен
			|	И СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка.Дата <= &КонецПериода
			|	И СделкаРЕПОЦенныеБумагиВторойЧасти.ДепозитарныйСчет.Депозитарий <> &Депозитарий
			|	И СделкаРЕПОЦенныеБумагиВторойЧасти.Ссылка.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задолженность.ДБО КАК ДБО,
			|	Задолженность.СА КАК СА,
			|	Задолженность.НачалоПериода КАК НачалоПериода,
			|	Задолженность.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	Задолженность.ЦБ КАК ЦБ,
			|	СУММА(Остаток.ИсходящийОстаток) КАК ИсходящийОстаток,
			|	СУММА(Задолженность.ОбязательстваКПолучению) КАК ОбязательстваКПолучению,
			|	СУММА(Задолженность.ОбязательстваКВыбытию) КАК ОбязательстваКВыбытию,
			|	СУММА(ЕСТЬNULL(Остаток.ИсходящийОстаток, 0) + Задолженность.ОбязательстваКПолучению - Задолженность.ОбязательстваКВыбытию) КАК ПлановыйИсходящийОстаток
			|ПОМЕСТИТЬ _ЗадолженностьПоЦБСистема
			|ИЗ
			|	(ВЫБРАТЬ
			|		_Ключи.ДБО КАК ДБО,
			|		_Ключи.СА КАК СА,
			|		_Ключи.НачалоПериода КАК НачалоПериода,
			|		_Ключи.КонецПериода КАК КонецПериода,
			|		Задолженность.ЦБ КАК ЦБ,
			|		СУММА(Задолженность.ОбязательстваКПолучению) КАК ОбязательстваКПолучению,
			|		СУММА(Задолженность.ОбязательстваКВыбытию) КАК ОбязательстваКВыбытию
			|	ИЗ
			|		_Ключи КАК _Ключи
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СДУ,
			|				ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦБ,
			|				СУММА(ВЫБОР
			|						КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|							ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|						ИНАЧЕ 0
			|					КОНЕЦ) КАК ОбязательстваКПолучению,
			|				СУММА(ВЫБОР
			|						КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|							ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|						ИНАЧЕ 0
			|					КОНЕЦ) КАК ОбязательстваКВыбытию
			|			ИЗ
			|				РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|						&КонецПериода,
			|						Организация = &Организация
			|							И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
			|							И Основание.Брокер = &Брокер) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|					ЛЕВОЕ СОЕДИНЕНИЕ _ИсключаемыеСделки КАК _ИсключаемыеСделки
			|					ПО ЗадолженностиПоЦеннымБумагамОстатки.Основание = _ИсключаемыеСделки.Сделка
			|						И ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага = _ИсключаемыеСделки.ЦеннаяБумага
			|			ГДЕ
			|				_ИсключаемыеСделки.Сделка ЕСТЬ NULL
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
			|				ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления,
			|				ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага,
			|				СУММА(ВЫБОР
			|						КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|							ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
			|						ИНАЧЕ 0
			|					КОНЕЦ),
			|				СУММА(ВЫБОР
			|						КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|							ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
			|						ИНАЧЕ 0
			|					КОНЕЦ)
			|			ИЗ
			|				РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
			|						&КонецПериода,
			|						Организация = &Организация
			|							И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки))
			|							И СделкаРЕПО.Брокер = &Брокер
			|							И НЕ СделкаРЕПО.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления,
			|				ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага) КАК Задолженность
			|			ПО (Задолженность.СДУ = _Ключи.СДУ)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Задолженность.ЦБ,
			|		_Ключи.ДБО,
			|		_Ключи.СА,
			|		_Ключи.НачалоПериода,
			|		_Ключи.КонецПериода) КАК Задолженность
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_Ключи.ДБО КАК ДБО,
			|			_Ключи.СА КАК СА,
			|			_Ключи.НачалоПериода КАК НачалоПериода,
			|			_Ключи.КонецПериода КАК КонецПериода,
			|			ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦБ,
			|			СУММА(ОстаткиЦенныхБумагОстатки.КоличествоОстаток) КАК ИсходящийОстаток
			|		ИЗ
			|			_Ключи КАК _Ключи
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
			|						&КонецПериода,
			|						Организация = &Организация
			|							И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки))
			|							И (ДепозитарныйСчет.Брокер = &Брокер
			|								ИЛИ ДепозитарныйСчет.Депозитарий = &Депозитарий)) КАК ОстаткиЦенныхБумагОстатки
			|				ПО (ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = _Ключи.СДУ)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОстаткиЦенныхБумагОстатки.ЦеннаяБумага,
			|			_Ключи.ДБО,
			|			_Ключи.СА,
			|			_Ключи.НачалоПериода,
			|			_Ключи.КонецПериода) КАК Остаток
			|		ПО Задолженность.ДБО = Остаток.ДБО
			|			И Задолженность.СА = Остаток.СА
			|			И Задолженность.НачалоПериода = Остаток.НачалоПериода
			|			И Задолженность.КонецПериода = Остаток.КонецПериода
			|			И Задолженность.ЦБ = Остаток.ЦБ
			|
			|СГРУППИРОВАТЬ ПО
			|	Задолженность.ЦБ,
			|	Задолженность.ДБО,
			|	Задолженность.СА,
			|	Задолженность.НачалоПериода,
			|	Задолженность.КонецПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага КАК ЦБ,
			|	ОстаткиЦенныхБумагОбороты.Период КАК ДатаОперации,
			|	СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход) КАК Приход,
			|	СУММА(ОстаткиЦенныхБумагОбороты.КоличествоРасход) КАК Расход
			|ПОМЕСТИТЬ _ДвиженияАкцийСистема
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			День,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И (ЦеннаяБумага ССЫЛКА Справочник.Акции
			|					ИЛИ ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки)
			|				И (ДепозитарныйСчет.Брокер = &Брокер
			|					ИЛИ ДепозитарныйСчет.Депозитарий = &Депозитарий)) КАК ОстаткиЦенныхБумагОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|			И ОстаткиЦенныхБумагОбороты.Период >= _Ключи.НачалоПериода
			|			И ОстаткиЦенныхБумагОбороты.Период <= _Ключи.КонецПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода,
			|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
			|	ОстаткиЦенныхБумагОбороты.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Ключи.ДБО КАК ДБО,
			|	_Ключи.СА КАК СА,
			|	_Ключи.НачалоПериода КАК НачалоПериода,
			|	_Ключи.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага КАК ЦБ,
			|	ОстаткиЦенныхБумагОбороты.Период КАК ДатаОперации,
			|	СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход + ОстаткиЦенныхБумагОбороты.КоличествоРасход) КАК Количество
			|ПОМЕСТИТЬ _ДвиженияЦенныхБумагСистема
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			День,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи)
			|				И (ЦеннаяБумага ССЫЛКА Справочник.Облигации
			|					ИЛИ ЦеннаяБумага ССЫЛКА Справочник.Паи)
			|				И (ДепозитарныйСчет.Брокер = &Брокер
			|					ИЛИ ДепозитарныйСчет.Депозитарий = &Депозитарий)) КАК ОстаткиЦенныхБумагОбороты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|		ПО ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления = _Ключи.СДУ
			|			И ОстаткиЦенныхБумагОбороты.Период >= _Ключи.НачалоПериода
			|			И ОстаткиЦенныхБумагОбороты.Период <= _Ключи.КонецПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	_Ключи.ДБО,
			|	_Ключи.СА,
			|	_Ключи.НачалоПериода,
			|	_Ключи.КонецПериода,
			|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
			|	ОстаткиЦенныхБумагОбороты.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задолженность.ДБО КАК ДБО,
			|	Задолженность.СА КАК СА,
			|	Задолженность.НачалоПериода КАК НачалоПериода,
			|	Задолженность.КонецПериода КАК КонецПериода,
			|	ВЫБОР
			|		КОГДА &СверятьБезУчетаВалютнойСекции
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВалютнаяСекция,
			|	Задолженность.ДатаОперации КАК ДатаОперации,
			|	Задолженность.ЦБ КАК ЦБ,
			|	СУММА(Задолженность.Количество) КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияЦБ
			|ИЗ
			|	(ВЫБРАТЬ
			|		_Ключи.ДБО КАК ДБО,
			|		_Ключи.СА КАК СА,
			|		_Ключи.НачалоПериода КАК НачалоПериода,
			|		_Ключи.КонецПериода КАК КонецПериода,
			|		Задолженность.ДатаОперации КАК ДатаОперации,
			|		Задолженность.ЦБ КАК ЦБ,
			|		СУММА(Задолженность.Количество) КАК Количество
			|	ИЗ
			|		_Ключи КАК _Ключи
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СДУ,
			|				ВЫБОР
			|					КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|						ТОГДА УсловияСделокСрезПоследних.ДатаПоставки
			|					ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаПоставки
			|				КОНЕЦ КАК ДатаОперации,
			|				ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦБ,
			|				СУММА(ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток) КАК Количество
			|			ИЗ
			|				РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|						&КонецПериода,
			|						Организация = &Организация
			|							И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
			|							И Основание.Брокер = &Брокер
			|							И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
			|					ПО ((ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Документ.СделкаРЕПО)) = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО)
			|						И (ВЫБОР
			|							КОГДА ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Документ.СделкаРЕПО).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|								ТОГДА УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 1
			|							ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2
			|						КОНЕЦ)
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(, Организация = &Организация) КАК УсловияСделокСрезПоследних
			|					ПО ((ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Документ.Сделка)) = УсловияСделокСрезПоследних.Сделка)
			|					ЛЕВОЕ СОЕДИНЕНИЕ _ИсключаемыеСделки КАК _ИсключаемыеСделки
			|					ПО ЗадолженностиПоЦеннымБумагамОстатки.Основание = _ИсключаемыеСделки.Сделка
			|						И ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага = _ИсключаемыеСделки.ЦеннаяБумага
			|			ГДЕ
			|				_ИсключаемыеСделки.Сделка ЕСТЬ NULL
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
			|				ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага,
			|				ВЫБОР
			|					КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|						ТОГДА УсловияСделокСрезПоследних.ДатаПоставки
			|					ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаПоставки
			|				КОНЕЦ) КАК Задолженность
			|			ПО (Задолженность.СДУ = _Ключи.СДУ)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Задолженность.ЦБ,
			|		_Ключи.ДБО,
			|		_Ключи.СА,
			|		_Ключи.НачалоПериода,
			|		_Ключи.КонецПериода,
			|		Задолженность.ДатаОперации) КАК Задолженность
			|
			|СГРУППИРОВАТЬ ПО
			|	Задолженность.ЦБ,
			|	Задолженность.ДБО,
			|	Задолженность.СА,
			|	Задолженность.НачалоПериода,
			|	Задолженность.КонецПериода,
			|	Задолженность.ДатаОперации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияЦБ.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияЦБ.СА КАК СА,
			|	_ОжидаемыеПоступленияЦБ.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияЦБ.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияЦБ.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияЦБ.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияЦБ.ЦБ КАК Акция,
			|	_ОжидаемыеПоступленияЦБ.Количество КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияАкцийСистема
			|ИЗ
			|	_ОжидаемыеПоступленияЦБ КАК _ОжидаемыеПоступленияЦБ
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(_ОжидаемыеПоступленияЦБ.ЦБ) = ТИП(Справочник.Акции)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияЦБ.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияЦБ.СА КАК СА,
			|	_ОжидаемыеПоступленияЦБ.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияЦБ.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияЦБ.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияЦБ.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияЦБ.ЦБ КАК Облигация,
			|	_ОжидаемыеПоступленияЦБ.Количество КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияОблигацийСистема
			|ИЗ
			|	_ОжидаемыеПоступленияЦБ КАК _ОжидаемыеПоступленияЦБ
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(_ОжидаемыеПоступленияЦБ.ЦБ) = ТИП(Справочник.Облигации)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОжидаемыеПоступленияЦБ.ДБО КАК ДБО,
			|	_ОжидаемыеПоступленияЦБ.СА КАК СА,
			|	_ОжидаемыеПоступленияЦБ.НачалоПериода КАК НачалоПериода,
			|	_ОжидаемыеПоступленияЦБ.КонецПериода КАК КонецПериода,
			|	_ОжидаемыеПоступленияЦБ.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ОжидаемыеПоступленияЦБ.ДатаОперации КАК ДатаОперации,
			|	_ОжидаемыеПоступленияЦБ.ЦБ КАК Пай,
			|	_ОжидаемыеПоступленияЦБ.Количество КАК Количество
			|ПОМЕСТИТЬ _ОжидаемыеПоступленияПаевСистема
			|ИЗ
			|	_ОжидаемыеПоступленияЦБ КАК _ОжидаемыеПоступленияЦБ
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(_ОжидаемыеПоступленияЦБ.ЦБ) = ТИП(Справочник.Паи)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаблокированныеЦенныеБумагиСистема.ДБО КАК ДБО,
			|	ЗаблокированныеЦенныеБумагиСистема.СА КАК СА,
			|	ЗаблокированныеЦенныеБумагиСистема.НачалоПериода КАК НачалоПериода,
			|	ЗаблокированныеЦенныеБумагиСистема.КонецПериода КАК КонецПериода,
			|	ЗаблокированныеЦенныеБумагиСистема.ВалютнаяСекция КАК ВалютнаяСекция,
			|	ЗаблокированныеЦенныеБумагиСистема.ЦБ КАК ЦБ,
			|	ЗаблокированныеЦенныеБумагиСистема.Заблокировано КАК Заблокировано
			|ПОМЕСТИТЬ _ЗаблокированныеЦенныеБумагиСводнаяСистема
			|ИЗ
			|	_ОстаткиЦенныхБумагСистема КАК _ОстаткиЦенныхБумагСистема
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_Ключи.ДБО КАК ДБО,
			|			_Ключи.СА КАК СА,
			|			_Ключи.НачалоПериода КАК НачалоПериода,
			|			_Ключи.КонецПериода КАК КонецПериода,
			|			ВЫБОР
			|				КОГДА &СверятьБезУчетаВалютнойСекции
			|					ТОГДА НЕОПРЕДЕЛЕНО
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ КАК ВалютнаяСекция,
			|			ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦБ,
			|			СУММА(ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК ЧИСЛО(19, 2))) КАК Заблокировано
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|					&КонецПериодаГраница,
			|					ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|						И ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|						И Основание.Брокер = &Брокер
			|						И СчетДоверительногоУправления В
			|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|								_Ключи.СДУ КАК СДУ
			|							ИЗ
			|								_Ключи КАК _Ключи)) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Ключи КАК _Ключи
			|				ПО ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления = _Ключи.СДУ
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага,
			|			_Ключи.ДБО,
			|			_Ключи.СА,
			|			_Ключи.НачалоПериода,
			|			_Ключи.КонецПериода) КАК ЗаблокированныеЦенныеБумагиСистема
			|		ПО _ОстаткиЦенныхБумагСистема.ДБО = ЗаблокированныеЦенныеБумагиСистема.ДБО
			|			И _ОстаткиЦенныхБумагСистема.СА = ЗаблокированныеЦенныеБумагиСистема.СА
			|			И _ОстаткиЦенныхБумагСистема.НачалоПериода = ЗаблокированныеЦенныеБумагиСистема.НачалоПериода
			|			И _ОстаткиЦенныхБумагСистема.КонецПериода = ЗаблокированныеЦенныеБумагиСистема.КонецПериода
			|			И _ОстаткиЦенныхБумагСистема.ВалютнаяСекция = ЗаблокированныеЦенныеБумагиСистема.ВалютнаяСекция
			|			И _ОстаткиЦенныхБумагСистема.ЦБ = ЗаблокированныеЦенныеБумагиСистема.ЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.ДБО, _ОстаткиДенежныхСредствСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.СА, _ОстаткиДенежныхСредствСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.НачалоПериода, _ОстаткиДенежныхСредствСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.КонецПериода, _ОстаткиДенежныхСредствСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.ВалютнаяСекция, _ОстаткиДенежныхСредствСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.ВнебиржевойРынок, _ОстаткиДенежныхСредствСистема.ВнебиржевойРынок) КАК ВнебиржевойРынок,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.Валюта, _ОстаткиДенежныхСредствСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.НачальныйОстатокБрокер, 0) КАК НачальныйОстаток,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.КонечныйОстатокБрокер, 0) КАК КонечныйОстаток,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствСистема.НачальныйОстатокСистема, 0) КАК НачальныйОстатокУС,
			|	ЕСТЬNULL(_ОстаткиДенежныхСредствСистема.КонечныйОстатокСистема, 0) КАК КонечныйОстатокУС
			|ПОМЕСТИТЬ _РасхожденияОстаткиДенежныхСредств
			|ИЗ
			|	_ОстаткиДенежныхСредствБрокер КАК _ОстаткиДенежныхСредствБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиДенежныхСредствСистема КАК _ОстаткиДенежныхСредствСистема
			|		ПО _ОстаткиДенежныхСредствБрокер.ДБО = _ОстаткиДенежныхСредствСистема.ДБО
			|			И _ОстаткиДенежныхСредствБрокер.СА = _ОстаткиДенежныхСредствСистема.СА
			|			И _ОстаткиДенежныхСредствБрокер.ВалютнаяСекция = _ОстаткиДенежныхСредствСистема.ВалютнаяСекция
			|			И _ОстаткиДенежныхСредствБрокер.Валюта = _ОстаткиДенежныхСредствСистема.Валюта
			|			И _ОстаткиДенежныхСредствБрокер.ВнебиржевойРынок = _ОстаткиДенежныхСредствСистема.ВнебиржевойРынок
			|			И _ОстаткиДенежныхСредствБрокер.НачалоПериода = _ОстаткиДенежныхСредствСистема.НачалоПериода
			|			И _ОстаткиДенежныхСредствБрокер.КонецПериода = _ОстаткиДенежныхСредствСистема.КонецПериода
			|ГДЕ
			|	(ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.НачальныйОстатокБрокер, 0) <> ЕСТЬNULL(_ОстаткиДенежныхСредствСистема.НачальныйОстатокСистема, 0)
			|			ИЛИ ЕСТЬNULL(_ОстаткиДенежныхСредствБрокер.КонечныйОстатокБрокер, 0) <> ЕСТЬNULL(_ОстаткиДенежныхСредствСистема.КонечныйОстатокСистема, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.ДБО, _ОбязательстваПоДенежнымСредствамСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.СА, _ОбязательстваПоДенежнымСредствамСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.НачалоПериода, _ОбязательстваПоДенежнымСредствамСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.КонецПериода, _ОбязательстваПоДенежнымСредствамСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.Валюта, _ОбязательстваПоДенежнымСредствамСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.ДебиторскаяЗадолженностьБрокер, 0) КАК ДебиторскаяЗадолженность,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.КредиторскаяЗадолженностьБрокер, 0) КАК КредиторскаяЗадолженность,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамСистема.ДебиторскаяЗадолженность, 0) КАК ДебиторскаяЗадолженностьУС,
			|	ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамСистема.КредиторскаяЗадолженность, 0) КАК КредиторскаяЗадолженностьУС
			|ПОМЕСТИТЬ _РасхожденияОбязательстваПоДенежнымСредствам
			|ИЗ
			|	_ОбязательстваПоДенежнымСредствамБрокер КАК _ОбязательстваПоДенежнымСредствамБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОбязательстваПоДенежнымСредствамСистема КАК _ОбязательстваПоДенежнымСредствамСистема
			|		ПО _ОбязательстваПоДенежнымСредствамБрокер.ДБО = _ОбязательстваПоДенежнымСредствамСистема.ДБО
			|			И _ОбязательстваПоДенежнымСредствамБрокер.СА = _ОбязательстваПоДенежнымСредствамСистема.СА
			|			И _ОбязательстваПоДенежнымСредствамБрокер.Валюта = _ОбязательстваПоДенежнымСредствамСистема.Валюта
			|			И _ОбязательстваПоДенежнымСредствамБрокер.НачалоПериода = _ОбязательстваПоДенежнымСредствамСистема.НачалоПериода
			|			И _ОбязательстваПоДенежнымСредствамБрокер.КонецПериода = _ОбязательстваПоДенежнымСредствамСистема.КонецПериода
			|ГДЕ
			|	(ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.ДебиторскаяЗадолженностьБрокер, 0) <> ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамСистема.ДебиторскаяЗадолженность, 0)
			|			ИЛИ ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамБрокер.КредиторскаяЗадолженностьБрокер, 0) <> ЕСТЬNULL(_ОбязательстваПоДенежнымСредствамСистема.КредиторскаяЗадолженность, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.ДБО, _ОстаткиЗадолженностиПоКомиссииСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.СА, _ОстаткиЗадолженностиПоКомиссииСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.НачалоПериода, _ОстаткиЗадолженностиПоКомиссииСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.КонецПериода, _ОстаткиЗадолженностиПоКомиссииСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.Валюта, _ОстаткиЗадолженностиПоКомиссииСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.ТипКомиссии, _ОстаткиЗадолженностиПоКомиссииСистема.ТипКомиссии) КАК ТипКомиссии,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.НачальныйОстатокБрокер, 0) КАК НачальныйОстаток,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.КонечныйОстатокБрокер, 0) КАК КонечныйОстаток,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииСистема.НачальныйОстаток, 0) КАК НачальныйОстатокУС,
			|	ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииСистема.КонечныйОстаток, 0) КАК КонечныйОстатокУС
			|ПОМЕСТИТЬ _РасхожденияОстаткиЗадолженностиПоКомиссии
			|ИЗ
			|	_ОстаткиЗадолженностиПоКомиссииБрокер КАК _ОстаткиЗадолженностиПоКомиссииБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиЗадолженностиПоКомиссииСистема КАК _ОстаткиЗадолженностиПоКомиссииСистема
			|		ПО _ОстаткиЗадолженностиПоКомиссииБрокер.ДБО = _ОстаткиЗадолженностиПоКомиссииСистема.ДБО
			|			И _ОстаткиЗадолженностиПоКомиссииБрокер.СА = _ОстаткиЗадолженностиПоКомиссииСистема.СА
			|			И _ОстаткиЗадолженностиПоКомиссииБрокер.Валюта = _ОстаткиЗадолженностиПоКомиссииСистема.Валюта
			|			И _ОстаткиЗадолженностиПоКомиссииБрокер.НачалоПериода = _ОстаткиЗадолженностиПоКомиссииСистема.НачалоПериода
			|			И _ОстаткиЗадолженностиПоКомиссииБрокер.КонецПериода = _ОстаткиЗадолженностиПоКомиссииСистема.КонецПериода
			|			И _ОстаткиЗадолженностиПоКомиссииБрокер.ТипКомиссии = _ОстаткиЗадолженностиПоКомиссииСистема.ТипКомиссии
			|ГДЕ
			|	(ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.НачальныйОстатокБрокер, 0) <> ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииСистема.НачальныйОстаток, 0)
			|			ИЛИ ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииБрокер.КонечныйОстатокБрокер, 0) <> ЕСТЬNULL(_ОстаткиЗадолженностиПоКомиссииСистема.КонечныйОстаток, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.ДБО, _НачисленнаяКомиссияЗаПериодСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.СА, _НачисленнаяКомиссияЗаПериодСистема.СА) КАК СА,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.НачалоПериода, _НачисленнаяКомиссияЗаПериодСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.КонецПериода, _НачисленнаяКомиссияЗаПериодСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.Валюта, _НачисленнаяКомиссияЗаПериодСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.ТипКомиссии, _НачисленнаяКомиссияЗаПериодСистема.ТипКомиссии) КАК ТипКомиссии,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.СуммаБрокер, 0) КАК Сумма,
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодСистема.Сумма, 0) КАК СуммаУС
			|ПОМЕСТИТЬ _РасхожденияНачисленнаяКомиссияЗаПериод
			|ИЗ
			|	_НачисленнаяКомиссияЗаПериодБрокер КАК _НачисленнаяКомиссияЗаПериодБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _НачисленнаяКомиссияЗаПериодСистема КАК _НачисленнаяКомиссияЗаПериодСистема
			|		ПО _НачисленнаяКомиссияЗаПериодБрокер.ДБО = _НачисленнаяКомиссияЗаПериодСистема.ДБО
			|			И _НачисленнаяКомиссияЗаПериодБрокер.СА = _НачисленнаяКомиссияЗаПериодСистема.СА
			|			И _НачисленнаяКомиссияЗаПериодБрокер.Валюта = _НачисленнаяКомиссияЗаПериодСистема.Валюта
			|			И _НачисленнаяКомиссияЗаПериодБрокер.ТипКомиссии = _НачисленнаяКомиссияЗаПериодСистема.ТипКомиссии
			|			И _НачисленнаяКомиссияЗаПериодБрокер.НачалоПериода = _НачисленнаяКомиссияЗаПериодСистема.НачалоПериода
			|			И _НачисленнаяКомиссияЗаПериодБрокер.КонецПериода = _НачисленнаяКомиссияЗаПериодСистема.КонецПериода
			|ГДЕ
			|	ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодБрокер.СуммаБрокер, 0) <> ЕСТЬNULL(_НачисленнаяКомиссияЗаПериодСистема.Сумма, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.ДБО, _ОплаченнаяКомиссияЗаПериодСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.СА, _ОплаченнаяКомиссияЗаПериодСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.НачалоПериода, _ОплаченнаяКомиссияЗаПериодСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.КонецПериода, _ОплаченнаяКомиссияЗаПериодСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.Валюта, _ОплаченнаяКомиссияЗаПериодСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.ТипКомиссии, _ОплаченнаяКомиссияЗаПериодСистема.ТипКомиссии) КАК ТипКомиссии,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.СуммаБрокер, 0) КАК Сумма,
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодСистема.Сумма, 0) КАК СуммаУС
			|ПОМЕСТИТЬ _РасхожденияОплаченнаяКомиссияЗаПериод
			|ИЗ
			|	_ОплаченнаяКомиссияЗаПериодБрокер КАК _ОплаченнаяКомиссияЗаПериодБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОплаченнаяКомиссияЗаПериодСистема КАК _ОплаченнаяКомиссияЗаПериодСистема
			|		ПО _ОплаченнаяКомиссияЗаПериодБрокер.ДБО = _ОплаченнаяКомиссияЗаПериодСистема.ДБО
			|			И _ОплаченнаяКомиссияЗаПериодБрокер.СА = _ОплаченнаяКомиссияЗаПериодСистема.СА
			|			И _ОплаченнаяКомиссияЗаПериодБрокер.Валюта = _ОплаченнаяКомиссияЗаПериодСистема.Валюта
			|			И _ОплаченнаяКомиссияЗаПериодБрокер.ТипКомиссии = _ОплаченнаяКомиссияЗаПериодСистема.ТипКомиссии
			|			И _ОплаченнаяКомиссияЗаПериодБрокер.НачалоПериода = _ОплаченнаяКомиссияЗаПериодСистема.НачалоПериода
			|			И _ОплаченнаяКомиссияЗаПериодБрокер.КонецПериода = _ОплаченнаяКомиссияЗаПериодСистема.КонецПериода
			|ГДЕ
			|	ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодБрокер.СуммаБрокер, 0) <> ЕСТЬNULL(_ОплаченнаяКомиссияЗаПериодСистема.Сумма, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.ДБО, _ДвиженияДенежныхСредствСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.СА, _ДвиженияДенежныхСредствСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.НачалоПериода, _ДвиженияДенежныхСредствСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.КонецПериода, _ДвиженияДенежныхСредствСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.ВалютнаяСекция, _ДвиженияДенежныхСредствСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.Валюта, _ДвиженияДенежныхСредствСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.ПриходБрокер, 0) КАК Приход,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.РасходБрокер, 0) КАК Расход,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствСистема.Приход, 0) КАК ПриходУС,
			|	ЕСТЬNULL(_ДвиженияДенежныхСредствСистема.Расход, 0) КАК РасходУС
			|ПОМЕСТИТЬ _РасхожденияДвиженияДенежныхСредств
			|ИЗ
			|	_ДвиженияДенежныхСредствБрокер КАК _ДвиженияДенежныхСредствБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ДвиженияДенежныхСредствСистема КАК _ДвиженияДенежныхСредствСистема
			|		ПО _ДвиженияДенежныхСредствБрокер.ДБО = _ДвиженияДенежныхСредствСистема.ДБО
			|			И _ДвиженияДенежныхСредствБрокер.СА = _ДвиженияДенежныхСредствСистема.СА
			|			И _ДвиженияДенежныхСредствБрокер.ВалютнаяСекция = _ДвиженияДенежныхСредствСистема.ВалютнаяСекция
			|			И _ДвиженияДенежныхСредствБрокер.Валюта = _ДвиженияДенежныхСредствСистема.Валюта
			|			И _ДвиженияДенежныхСредствБрокер.НачалоПериода = _ДвиженияДенежныхСредствСистема.НачалоПериода
			|			И _ДвиженияДенежныхСредствБрокер.КонецПериода = _ДвиженияДенежныхСредствСистема.КонецПериода
			|ГДЕ
			|	(ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.ПриходБрокер, 0) <> ЕСТЬNULL(_ДвиженияДенежныхСредствСистема.Приход, 0)
			|			ИЛИ ЕСТЬNULL(_ДвиженияДенежныхСредствБрокер.РасходБрокер, 0) <> ЕСТЬNULL(_ДвиженияДенежныхСредствСистема.Расход, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.ДБО, _ЗаблокированныеДенежныеСредстваСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.СА, _ЗаблокированныеДенежныеСредстваСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.НачалоПериода, _ЗаблокированныеДенежныеСредстваСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.КонецПериода, _ЗаблокированныеДенежныеСредстваСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.Валюта, _ЗаблокированныеДенежныеСредстваСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.СуммаБрокер, 0) КАК Сумма,
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваСистема.Сумма, 0) КАК СуммаУС
			|ПОМЕСТИТЬ _РасхожденияЗаблокированныеДенежныеСредства
			|ИЗ
			|	_ЗаблокированныеДенежныеСредстваБрокер КАК _ЗаблокированныеДенежныеСредстваБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗаблокированныеДенежныеСредстваСистема КАК _ЗаблокированныеДенежныеСредстваСистема
			|		ПО _ЗаблокированныеДенежныеСредстваБрокер.ДБО = _ЗаблокированныеДенежныеСредстваСистема.ДБО
			|			И _ЗаблокированныеДенежныеСредстваБрокер.СА = _ЗаблокированныеДенежныеСредстваСистема.СА
			|			И _ЗаблокированныеДенежныеСредстваБрокер.Валюта = _ЗаблокированныеДенежныеСредстваСистема.Валюта
			|			И _ЗаблокированныеДенежныеСредстваБрокер.НачалоПериода = _ЗаблокированныеДенежныеСредстваСистема.НачалоПериода
			|			И _ЗаблокированныеДенежныеСредстваБрокер.КонецПериода = _ЗаблокированныеДенежныеСредстваСистема.КонецПериода
			|ГДЕ
			|	ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваБрокер.СуммаБрокер, 0) <> ЕСТЬNULL(_ЗаблокированныеДенежныеСредстваСистема.Сумма, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.ДБО, _ОжидаемыеПоступленияДенежныхСредствСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.СА, _ОжидаемыеПоступленияДенежныхСредствСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.НачалоПериода, _ОжидаемыеПоступленияДенежныхСредствСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.КонецПериода, _ОжидаемыеПоступленияДенежныхСредствСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.Валюта, _ОжидаемыеПоступленияДенежныхСредствСистема.Валюта) КАК Валюта,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.СуммаБрокер, 0) КАК Сумма,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствСистема.Сумма, 0) КАК СуммаУС
			|ПОМЕСТИТЬ _РасхожденияОжидаемыеПоступленияДенежныхСредств
			|ИЗ
			|	_ОжидаемыеПоступленияДенежныхСредствБрокер КАК _ОжидаемыеПоступленияДенежныхСредствБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОжидаемыеПоступленияДенежныхСредствСистема КАК _ОжидаемыеПоступленияДенежныхСредствСистема
			|		ПО _ОжидаемыеПоступленияДенежныхСредствБрокер.ДБО = _ОжидаемыеПоступленияДенежныхСредствСистема.ДБО
			|			И _ОжидаемыеПоступленияДенежныхСредствБрокер.СА = _ОжидаемыеПоступленияДенежныхСредствСистема.СА
			|			И _ОжидаемыеПоступленияДенежныхСредствБрокер.Валюта = _ОжидаемыеПоступленияДенежныхСредствСистема.Валюта
			|			И _ОжидаемыеПоступленияДенежныхСредствБрокер.НачалоПериода = _ОжидаемыеПоступленияДенежныхСредствСистема.НачалоПериода
			|			И _ОжидаемыеПоступленияДенежныхСредствБрокер.КонецПериода = _ОжидаемыеПоступленияДенежныхСредствСистема.КонецПериода
			|ГДЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствБрокер.СуммаБрокер, 0) <> ЕСТЬNULL(_ОжидаемыеПоступленияДенежныхСредствСистема.Сумма, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.ДБО, _КонверсионныеСделкиСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.СА, _КонверсионныеСделкиСистема.СА) КАК СА,
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.ВалютнаяСекция, _КонверсионныеСделкиСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.НачалоПериода, _КонверсионныеСделкиСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.КонецПериода, _КонверсионныеСделкиСистема.КонецПериода) КАК КонецПериода,
			|	СУММА(ВЫБОР
			|			КОГДА _КонверсионныеСделкиБрокер.СА ЕСТЬ NULL
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоСделокБрокер,
			|	СУММА(ВЫБОР
			|			КОГДА _КонверсионныеСделкиСистема.СА ЕСТЬ NULL
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоСделокСистема
			|ПОМЕСТИТЬ _РасхожденияКонверсионныеСделки
			|ИЗ
			|	_КонверсионныеСделкиБрокер КАК _КонверсионныеСделкиБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _КонверсионныеСделкиСистема КАК _КонверсионныеСделкиСистема
			|		ПО _КонверсионныеСделкиБрокер.ДБО = _КонверсионныеСделкиСистема.ДБО
			|			И _КонверсионныеСделкиБрокер.СА = _КонверсионныеСделкиСистема.СА
			|			И _КонверсионныеСделкиБрокер.НачалоПериода = _КонверсионныеСделкиСистема.НачалоПериода
			|			И _КонверсионныеСделкиБрокер.КонецПериода = _КонверсионныеСделкиСистема.КонецПериода
			|			И _КонверсионныеСделкиБрокер.ВнебиржеваяСделка = _КонверсионныеСделкиСистема.ВнебиржеваяСделка
			|			И _КонверсионныеСделкиБрокер.Дата = _КонверсионныеСделкиСистема.Дата
			|			И _КонверсионныеСделкиБрокер.ДатаВалютирования = _КонверсионныеСделкиСистема.ДатаВалютирования
			|			И _КонверсионныеСделкиБрокер.НаправлениеСделки = _КонверсионныеСделкиСистема.НаправлениеСделки
			|			И _КонверсионныеСделкиБрокер.Курс = _КонверсионныеСделкиСистема.Курс
			|			И _КонверсионныеСделкиБрокер.Сумма = _КонверсионныеСделкиСистема.Сумма
			|			И _КонверсионныеСделкиБрокер.БазоваяВалюта = _КонверсионныеСделкиСистема.БазоваяВалюта
			|			И _КонверсионныеСделкиБрокер.Контрвалюта = _КонверсионныеСделкиСистема.Контрвалюта
			|			И _КонверсионныеСделкиБрокер.КомиссияБрокера = _КонверсионныеСделкиСистема.КомиссияБрокера
			|			И _КонверсионныеСделкиБрокер.ВалютнаяСекция = _КонверсионныеСделкиСистема.ВалютнаяСекция
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.ДБО, _КонверсионныеСделкиСистема.ДБО),
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.СА, _КонверсионныеСделкиСистема.СА),
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.НачалоПериода, _КонверсионныеСделкиСистема.НачалоПериода),
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.КонецПериода, _КонверсионныеСделкиСистема.КонецПериода),
			|	ЕСТЬNULL(_КонверсионныеСделкиБрокер.ВалютнаяСекция, _КонверсионныеСделкиСистема.ВалютнаяСекция)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.ДБО, _НезавершенныеКонверсионныеСделкиСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.СА, _НезавершенныеКонверсионныеСделкиСистема.СА) КАК СА,
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.ВалютнаяСекция, _НезавершенныеКонверсионныеСделкиСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.НачалоПериода, _НезавершенныеКонверсионныеСделкиСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.КонецПериода, _НезавершенныеКонверсионныеСделкиСистема.КонецПериода) КАК КонецПериода,
			|	СУММА(ВЫБОР
			|			КОГДА _НезавершенныеКонверсионныеСделкиБрокер.СА ЕСТЬ NULL
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоСделокБрокер,
			|	СУММА(ВЫБОР
			|			КОГДА _НезавершенныеКонверсионныеСделкиСистема.СА ЕСТЬ NULL
			|				ТОГДА 0
			|			ИНАЧЕ 1
			|		КОНЕЦ) КАК КоличествоСделокСистема
			|ПОМЕСТИТЬ _РасхожденияНезавершенныеКонверсионныеСделки
			|ИЗ
			|	_НезавершенныеКонверсионныеСделкиБрокер КАК _НезавершенныеКонверсионныеСделкиБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _НезавершенныеКонверсионныеСделкиСистема КАК _НезавершенныеКонверсионныеСделкиСистема
			|		ПО _НезавершенныеКонверсионныеСделкиБрокер.ДБО = _НезавершенныеКонверсионныеСделкиСистема.ДБО
			|			И _НезавершенныеКонверсионныеСделкиБрокер.СА = _НезавершенныеКонверсионныеСделкиСистема.СА
			|			И _НезавершенныеКонверсионныеСделкиБрокер.НачалоПериода = _НезавершенныеКонверсионныеСделкиСистема.НачалоПериода
			|			И _НезавершенныеКонверсионныеСделкиБрокер.КонецПериода = _НезавершенныеКонверсионныеСделкиСистема.КонецПериода
			|			И _НезавершенныеКонверсионныеСделкиБрокер.ВнебиржеваяСделка = _НезавершенныеКонверсионныеСделкиСистема.ВнебиржеваяСделка
			|			И _НезавершенныеКонверсионныеСделкиБрокер.Дата = _НезавершенныеКонверсионныеСделкиСистема.Дата
			|			И _НезавершенныеКонверсионныеСделкиБрокер.ДатаВалютирования = _НезавершенныеКонверсионныеСделкиСистема.ДатаВалютирования
			|			И _НезавершенныеКонверсионныеСделкиБрокер.НаправлениеСделки = _НезавершенныеКонверсионныеСделкиСистема.НаправлениеСделки
			|			И _НезавершенныеКонверсионныеСделкиБрокер.Курс = _НезавершенныеКонверсионныеСделкиСистема.Курс
			|			И _НезавершенныеКонверсионныеСделкиБрокер.Сумма = _НезавершенныеКонверсионныеСделкиСистема.Сумма
			|			И _НезавершенныеКонверсионныеСделкиБрокер.БазоваяВалюта = _НезавершенныеКонверсионныеСделкиСистема.БазоваяВалюта
			|			И _НезавершенныеКонверсионныеСделкиБрокер.Контрвалюта = _НезавершенныеКонверсионныеСделкиСистема.Контрвалюта
			|			И _НезавершенныеКонверсионныеСделкиБрокер.КомиссияБрокера = _НезавершенныеКонверсионныеСделкиСистема.КомиссияБрокера
			|			И _НезавершенныеКонверсионныеСделкиБрокер.ВалютнаяСекция = _НезавершенныеКонверсионныеСделкиСистема.ВалютнаяСекция
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.ДБО, _НезавершенныеКонверсионныеСделкиСистема.ДБО),
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.СА, _НезавершенныеКонверсионныеСделкиСистема.СА),
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.НачалоПериода, _НезавершенныеКонверсионныеСделкиСистема.НачалоПериода),
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.КонецПериода, _НезавершенныеКонверсионныеСделкиСистема.КонецПериода),
			|	ЕСТЬNULL(_НезавершенныеКонверсионныеСделкиБрокер.ВалютнаяСекция, _НезавершенныеКонверсионныеСделкиСистема.ВалютнаяСекция)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.ДБО, _ОстаткиЦенныхБумагСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.СА, _ОстаткиЦенныхБумагСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.НачалоПериода, _ОстаткиЦенныхБумагСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.КонецПериода, _ОстаткиЦенныхБумагСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.ВалютнаяСекция, _ОстаткиЦенныхБумагСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.ЦБ, _ОстаткиЦенныхБумагСистема.ЦБ) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.НачальныйОстаток, 0) КАК НачальныйОстаток,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.КонечныйОстаток, 0) КАК КонечныйОстаток,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагСистема.НачальныйОстаток, 0) КАК НачальныйОстатокУС,
			|	ЕСТЬNULL(_ОстаткиЦенныхБумагСистема.КонечныйОстаток, 0) КАК КонечныйОстатокУС
			|ПОМЕСТИТЬ _РасхожденияОстаткиЦенныхБумаг
			|ИЗ
			|	_ОстаткиЦенныхБумагБрокер КАК _ОстаткиЦенныхБумагБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагСистема КАК _ОстаткиЦенныхБумагСистема
			|		ПО _ОстаткиЦенныхБумагБрокер.ДБО = _ОстаткиЦенныхБумагСистема.ДБО
			|			И _ОстаткиЦенныхБумагБрокер.СА = _ОстаткиЦенныхБумагСистема.СА
			|			И _ОстаткиЦенныхБумагБрокер.ВалютнаяСекция = _ОстаткиЦенныхБумагСистема.ВалютнаяСекция
			|			И _ОстаткиЦенныхБумагБрокер.ЦБ = _ОстаткиЦенныхБумагСистема.ЦБ
			|			И _ОстаткиЦенныхБумагБрокер.НачалоПериода = _ОстаткиЦенныхБумагСистема.НачалоПериода
			|			И _ОстаткиЦенныхБумагБрокер.КонецПериода = _ОстаткиЦенныхБумагСистема.КонецПериода
			|ГДЕ
			|	(ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.НачальныйОстаток, 0) <> ЕСТЬNULL(_ОстаткиЦенныхБумагСистема.НачальныйОстаток, 0)
			|			ИЛИ ЕСТЬNULL(_ОстаткиЦенныхБумагБрокер.КонечныйОстаток, 0) <> ЕСТЬNULL(_ОстаткиЦенныхБумагСистема.КонечныйОстаток, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ДБО, _ЗадолженностьПоЦБСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.СА, _ЗадолженностьПоЦБСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.НачалоПериода, _ЗадолженностьПоЦБСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.КонецПериода, _ЗадолженностьПоЦБСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ВалютнаяСекция, _ЗадолженностьПоЦБСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ЦБ, _ЗадолженностьПоЦБСистема.ЦБ) КАК ЦБ,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ИсходящийОстаток, 0) КАК ИсходящийОстаток,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ОбязательстваКПолучению, 0) КАК ОбязательстваКПолучению,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ОбязательстваКВыбытию, 0) КАК ОбязательстваКВыбытию,
			|	ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ПлановыйИсходящийОстаток, 0) КАК ПлановыйИсходящийОстаток,
			|	ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ИсходящийОстаток, 0) КАК ИсходящийОстатокУС,
			|	ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ОбязательстваКПолучению, 0) КАК ОбязательстваКПолучениюУС,
			|	ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ОбязательстваКВыбытию, 0) КАК ОбязательстваКВыбытиюУС,
			|	ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ПлановыйИсходящийОстаток, 0) КАК ПлановыйИсходящийОстатокУС
			|ПОМЕСТИТЬ _РасхожденияЗадолженностьПоЦБ
			|ИЗ
			|	_ЗадолженностьПоЦББрокер КАК _ЗадолженностьПоЦББрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗадолженностьПоЦБСистема КАК _ЗадолженностьПоЦБСистема
			|		ПО _ЗадолженностьПоЦББрокер.ДБО = _ЗадолженностьПоЦБСистема.ДБО
			|			И _ЗадолженностьПоЦББрокер.СА = _ЗадолженностьПоЦБСистема.СА
			|			И _ЗадолженностьПоЦББрокер.НачалоПериода = _ЗадолженностьПоЦБСистема.НачалоПериода
			|			И _ЗадолженностьПоЦББрокер.КонецПериода = _ЗадолженностьПоЦБСистема.КонецПериода
			|			И _ЗадолженностьПоЦББрокер.ВалютнаяСекция = _ЗадолженностьПоЦБСистема.ВалютнаяСекция
			|			И _ЗадолженностьПоЦББрокер.ЦБ = _ЗадолженностьПоЦБСистема.ЦБ
			|ГДЕ
			|	(ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ИсходящийОстаток, 0) <> ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ИсходящийОстаток, 0)
			|			ИЛИ ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ОбязательстваКПолучению, 0) <> ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ОбязательстваКПолучению, 0)
			|			ИЛИ ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ОбязательстваКВыбытию, 0) <> ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ОбязательстваКВыбытию, 0)
			|			ИЛИ ЕСТЬNULL(_ЗадолженностьПоЦББрокер.ПлановыйИсходящийОстаток, 0) <> ЕСТЬNULL(_ЗадолженностьПоЦБСистема.ПлановыйИсходящийОстаток, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.ДБО, _ДвиженияАкцийСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.СА, _ДвиженияАкцийСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.НачалоПериода, _ДвиженияАкцийСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.КонецПериода, _ДвиженияАкцийСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.ВалютнаяСекция, _ДвиженияАкцийСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.ЦБ, _ДвиженияАкцийСистема.ЦБ) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.ДатаОперации, _ДвиженияАкцийСистема.ДатаОперации) КАК ДатаОперации,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.Приход, 0) КАК Приход,
			|	ЕСТЬNULL(_ДвиженияАкцийСистема.Приход, 0) КАК ПриходУС,
			|	ЕСТЬNULL(_ДвиженияАкцийБрокер.Расход, 0) КАК Расход,
			|	ЕСТЬNULL(_ДвиженияАкцийСистема.Расход, 0) КАК РасходУС
			|ПОМЕСТИТЬ _РасхожденияДвиженияАкций
			|ИЗ
			|	_ДвиженияАкцийБрокер КАК _ДвиженияАкцийБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ДвиженияАкцийСистема КАК _ДвиженияАкцийСистема
			|		ПО _ДвиженияАкцийБрокер.ДБО = _ДвиженияАкцийСистема.ДБО
			|			И _ДвиженияАкцийБрокер.СА = _ДвиженияАкцийСистема.СА
			|			И _ДвиженияАкцийБрокер.НачалоПериода = _ДвиженияАкцийСистема.НачалоПериода
			|			И _ДвиженияАкцийБрокер.КонецПериода = _ДвиженияАкцийСистема.КонецПериода
			|			И _ДвиженияАкцийБрокер.ВалютнаяСекция = _ДвиженияАкцийСистема.ВалютнаяСекция
			|			И _ДвиженияАкцийБрокер.ЦБ = _ДвиженияАкцийСистема.ЦБ
			|			И _ДвиженияАкцийБрокер.ДатаОперации = _ДвиженияАкцийСистема.ДатаОперации
			|ГДЕ
			|	(ЕСТЬNULL(_ДвиженияАкцийБрокер.Приход, 0) <> ЕСТЬNULL(_ДвиженияАкцийСистема.Приход, 0)
			|			ИЛИ ЕСТЬNULL(_ДвиженияАкцийБрокер.Расход, 0) <> ЕСТЬNULL(_ДвиженияАкцийСистема.Расход, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.ДБО, _ДвиженияЦенныхБумагСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.СА, _ДвиженияЦенныхБумагСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.НачалоПериода, _ДвиженияЦенныхБумагСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.КонецПериода, _ДвиженияЦенныхБумагСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.ВалютнаяСекция, _ДвиженияЦенныхБумагСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.ЦБ, _ДвиженияЦенныхБумагСистема.ЦБ) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.ДатаОперации, _ДвиженияЦенныхБумагСистема.ДатаОперации) КАК ДатаОперации,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагСистема.Количество, 0) КАК КоличествоУС
			|ПОМЕСТИТЬ _РасхожденияДвиженияЦенныхБумаг
			|ИЗ
			|	_ДвиженияЦенныхБумагБрокер КАК _ДвиженияЦенныхБумагБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ДвиженияЦенныхБумагСистема КАК _ДвиженияЦенныхБумагСистема
			|		ПО _ДвиженияЦенныхБумагБрокер.ДБО = _ДвиженияЦенныхБумагСистема.ДБО
			|			И _ДвиженияЦенныхБумагБрокер.СА = _ДвиженияЦенныхБумагСистема.СА
			|			И _ДвиженияЦенныхБумагБрокер.НачалоПериода = _ДвиженияЦенныхБумагСистема.НачалоПериода
			|			И _ДвиженияЦенныхБумагБрокер.КонецПериода = _ДвиженияЦенныхБумагСистема.КонецПериода
			|			И _ДвиженияЦенныхБумагБрокер.ВалютнаяСекция = _ДвиженияЦенныхБумагСистема.ВалютнаяСекция
			|			И _ДвиженияЦенныхБумагБрокер.ЦБ = _ДвиженияЦенныхБумагСистема.ЦБ
			|			И _ДвиженияЦенныхБумагБрокер.ДатаОперации = _ДвиженияЦенныхБумагСистема.ДатаОперации
			|ГДЕ
			|	ЕСТЬNULL(_ДвиженияЦенныхБумагБрокер.Количество, 0) <> ЕСТЬNULL(_ДвиженияЦенныхБумагСистема.Количество, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.ДБО, _ОжидаемыеПоступленияАкцийСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.СА, _ОжидаемыеПоступленияАкцийСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.НачалоПериода, _ОжидаемыеПоступленияАкцийСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.КонецПериода, _ОжидаемыеПоступленияАкцийСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.ВалютнаяСекция, _ОжидаемыеПоступленияАкцийСистема.Акция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.Акция, _ОжидаемыеПоступленияАкцийСистема.Акция) КАК Акция,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.ДатаОперации, _ОжидаемыеПоступленияАкцийСистема.ДатаОперации) КАК ДатаОперации,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийСистема.Количество, 0) КАК КоличествоУС
			|ПОМЕСТИТЬ _РасхожденияОжидаемыеПоступленияАкций
			|ИЗ
			|	_ОжидаемыеПоступленияАкцийБрокер КАК _ОжидаемыеПоступленияАкцийБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОжидаемыеПоступленияАкцийСистема КАК _ОжидаемыеПоступленияАкцийСистема
			|		ПО _ОжидаемыеПоступленияАкцийБрокер.ДБО = _ОжидаемыеПоступленияАкцийСистема.ДБО
			|			И _ОжидаемыеПоступленияАкцийБрокер.СА = _ОжидаемыеПоступленияАкцийСистема.СА
			|			И _ОжидаемыеПоступленияАкцийБрокер.НачалоПериода = _ОжидаемыеПоступленияАкцийСистема.НачалоПериода
			|			И _ОжидаемыеПоступленияАкцийБрокер.КонецПериода = _ОжидаемыеПоступленияАкцийСистема.КонецПериода
			|			И _ОжидаемыеПоступленияАкцийБрокер.ВалютнаяСекция = _ОжидаемыеПоступленияАкцийСистема.ВалютнаяСекция
			|			И _ОжидаемыеПоступленияАкцийБрокер.Акция = _ОжидаемыеПоступленияАкцийСистема.Акция
			|			И _ОжидаемыеПоступленияАкцийБрокер.ДатаОперации = _ОжидаемыеПоступленияАкцийСистема.ДатаОперации
			|ГДЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияАкцийБрокер.Количество, 0) <> ЕСТЬNULL(_ОжидаемыеПоступленияАкцийСистема.Количество, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.ДБО, _ОжидаемыеПоступленияОблигацийСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.СА, _ОжидаемыеПоступленияОблигацийСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.НачалоПериода, _ОжидаемыеПоступленияОблигацийСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.КонецПериода, _ОжидаемыеПоступленияОблигацийСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.Облигация, _ОжидаемыеПоступленияОблигацийСистема.Облигация) КАК Облигация,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.ДатаОперации, _ОжидаемыеПоступленияОблигацийСистема.ДатаОперации) КАК ДатаОперации,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийСистема.Количество, 0) КАК КоличествоУС
			|ПОМЕСТИТЬ _РасхожденияОжидаемыеПоступленияОблигаций
			|ИЗ
			|	_ОжидаемыеПоступленияОблигацийБрокер КАК _ОжидаемыеПоступленияОблигацийБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОжидаемыеПоступленияОблигацийСистема КАК _ОжидаемыеПоступленияОблигацийСистема
			|		ПО _ОжидаемыеПоступленияОблигацийБрокер.ДБО = _ОжидаемыеПоступленияОблигацийСистема.ДБО
			|			И _ОжидаемыеПоступленияОблигацийБрокер.СА = _ОжидаемыеПоступленияОблигацийСистема.СА
			|			И _ОжидаемыеПоступленияОблигацийБрокер.НачалоПериода = _ОжидаемыеПоступленияОблигацийСистема.НачалоПериода
			|			И _ОжидаемыеПоступленияОблигацийБрокер.КонецПериода = _ОжидаемыеПоступленияОблигацийСистема.КонецПериода
			|			И _ОжидаемыеПоступленияОблигацийБрокер.ВалютнаяСекция = _ОжидаемыеПоступленияОблигацийСистема.ВалютнаяСекция
			|			И _ОжидаемыеПоступленияОблигацийБрокер.ДатаОперации = _ОжидаемыеПоступленияОблигацийСистема.ДатаОперации
			|			И _ОжидаемыеПоступленияОблигацийБрокер.Облигация = _ОжидаемыеПоступленияОблигацийСистема.Облигация
			|ГДЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийБрокер.Количество, 0) <> ЕСТЬNULL(_ОжидаемыеПоступленияОблигацийСистема.Количество, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.ДБО, _ОжидаемыеПоступленияПаевСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.СА, _ОжидаемыеПоступленияПаевСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.НачалоПериода, _ОжидаемыеПоступленияПаевСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.КонецПериода, _ОжидаемыеПоступленияПаевСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.Пай, _ОжидаемыеПоступленияПаевСистема.Пай) КАК Пай,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.ДатаОперации, _ОжидаемыеПоступленияПаевСистема.ДатаОперации) КАК ДатаОперации,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.Количество, 0) КАК Количество,
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевСистема.Количество, 0) КАК КоличествоУС
			|ПОМЕСТИТЬ _РасхожденияОжидаемыеПоступленияПаев
			|ИЗ
			|	_ОжидаемыеПоступленияПаевБрокер КАК _ОжидаемыеПоступленияПаевБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ОжидаемыеПоступленияПаевСистема КАК _ОжидаемыеПоступленияПаевСистема
			|		ПО _ОжидаемыеПоступленияПаевБрокер.ДБО = _ОжидаемыеПоступленияПаевСистема.ДБО
			|			И _ОжидаемыеПоступленияПаевБрокер.СА = _ОжидаемыеПоступленияПаевСистема.СА
			|			И _ОжидаемыеПоступленияПаевБрокер.НачалоПериода = _ОжидаемыеПоступленияПаевСистема.НачалоПериода
			|			И _ОжидаемыеПоступленияПаевБрокер.КонецПериода = _ОжидаемыеПоступленияПаевСистема.КонецПериода
			|			И _ОжидаемыеПоступленияПаевБрокер.ВалютнаяСекция = _ОжидаемыеПоступленияПаевСистема.ВалютнаяСекция
			|			И _ОжидаемыеПоступленияПаевБрокер.ДатаОперации = _ОжидаемыеПоступленияПаевСистема.ДатаОперации
			|			И _ОжидаемыеПоступленияПаевБрокер.Пай = _ОжидаемыеПоступленияПаевСистема.Пай
			|ГДЕ
			|	ЕСТЬNULL(_ОжидаемыеПоступленияПаевБрокер.Количество, 0) <> ЕСТЬNULL(_ОжидаемыеПоступленияПаевСистема.Количество, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.ДБО, _ЗаблокированныеЦенныеБумагиСводнаяСистема.ДБО) КАК ДБО,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.СА, _ЗаблокированныеЦенныеБумагиСводнаяСистема.СА) КАК СА,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.НачалоПериода, _ЗаблокированныеЦенныеБумагиСводнаяСистема.НачалоПериода) КАК НачалоПериода,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.КонецПериода, _ЗаблокированныеЦенныеБумагиСводнаяСистема.КонецПериода) КАК КонецПериода,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.ВалютнаяСекция, _ЗаблокированныеЦенныеБумагиСводнаяСистема.ВалютнаяСекция) КАК ВалютнаяСекция,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.ЦБ, _ЗаблокированныеЦенныеБумагиСводнаяСистема.ЦБ) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.Заблокировано, 0) КАК Заблокировано,
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиСводнаяСистема.Заблокировано, 0) КАК ЗаблокированоУС
			|ПОМЕСТИТЬ _РасхожденияЗаблокированныеЦенныеБумаги
			|ИЗ
			|	_ЗаблокированныеЦенныеБумагиБрокер КАК _ЗаблокированныеЦенныеБумагиБрокер
			|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗаблокированныеЦенныеБумагиСводнаяСистема КАК _ЗаблокированныеЦенныеБумагиСводнаяСистема
			|		ПО _ЗаблокированныеЦенныеБумагиБрокер.ДБО = _ЗаблокированныеЦенныеБумагиСводнаяСистема.ДБО
			|			И _ЗаблокированныеЦенныеБумагиБрокер.СА = _ЗаблокированныеЦенныеБумагиСводнаяСистема.СА
			|			И _ЗаблокированныеЦенныеБумагиБрокер.ВалютнаяСекция = _ЗаблокированныеЦенныеБумагиСводнаяСистема.ВалютнаяСекция
			|			И _ЗаблокированныеЦенныеБумагиБрокер.ЦБ = _ЗаблокированныеЦенныеБумагиСводнаяСистема.ЦБ
			|			И _ЗаблокированныеЦенныеБумагиБрокер.НачалоПериода = _ЗаблокированныеЦенныеБумагиСводнаяСистема.НачалоПериода
			|			И _ЗаблокированныеЦенныеБумагиБрокер.КонецПериода = _ЗаблокированныеЦенныеБумагиСводнаяСистема.КонецПериода
			|ГДЕ
			|	ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиБрокер.Заблокировано, 0) <> ЕСТЬNULL(_ЗаблокированныеЦенныеБумагиСводнаяСистема.Заблокировано, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РасхожденияОстаткиДенежныхСредств.ДБО КАК ДоговорБрокерскогоОбслуживания,
			|	_РасхожденияОстаткиДенежныхСредств.СА КАК СубъектАналитики,
			|	_РасхожденияОстаткиДенежныхСредств.НачалоПериода КАК НачалоПериода,
			|	_РасхожденияОстаткиДенежныхСредств.КонецПериода КАК КонецПериода,
			|	_РасхожденияОстаткиДенежныхСредств.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_РасхожденияОстаткиДенежныхСредств.ВнебиржевойРынок КАК ВнебиржевойРынок,
			|	_РасхожденияОстаткиДенежныхСредств.Валюта КАК Валюта,
			|	NULL КАК ЦеннаяБумага,
			|	""Остатки денежных средств"" КАК Блок,
			|	NULL КАК ДатаОперации,
			|	""Начальный остаток"" КАК Показатель,
			|	_РасхожденияОстаткиДенежныхСредств.НачальныйОстаток КАК Брокер,
			|	_РасхожденияОстаткиДенежныхСредств.НачальныйОстатокУС КАК УчетнаяСистема
			|ПОМЕСТИТЬ _ИтоговаяТаблица
			|ИЗ
			|	_РасхожденияОстаткиДенежныхСредств КАК _РасхожденияОстаткиДенежныхСредств
			|ГДЕ
			|	_РасхожденияОстаткиДенежныхСредств.НачальныйОстаток <> _РасхожденияОстаткиДенежныхСредств.НачальныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОстаткиДенежныхСредств.ДБО,
			|	_РасхожденияОстаткиДенежныхСредств.СА,
			|	_РасхожденияОстаткиДенежныхСредств.НачалоПериода,
			|	_РасхожденияОстаткиДенежныхСредств.КонецПериода,
			|	_РасхожденияОстаткиДенежныхСредств.ВалютнаяСекция,
			|	_РасхожденияОстаткиДенежныхСредств.ВнебиржевойРынок,
			|	_РасхожденияОстаткиДенежныхСредств.Валюта,
			|	NULL,
			|	""Остатки денежных средств"",
			|	NULL,
			|	""Конечный остаток"",
			|	_РасхожденияОстаткиДенежныхСредств.КонечныйОстаток,
			|	_РасхожденияОстаткиДенежныхСредств.КонечныйОстатокУС
			|ИЗ
			|	_РасхожденияОстаткиДенежныхСредств КАК _РасхожденияОстаткиДенежныхСредств
			|ГДЕ
			|	_РасхожденияОстаткиДенежныхСредств.КонечныйОстаток <> _РасхожденияОстаткиДенежныхСредств.КонечныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОбязательстваПоДенежнымСредствам.ДБО,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.СА,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.НачалоПериода,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.Валюта,
			|	NULL,
			|	""Обязательства по денежным средствам"",
			|	NULL,
			|	""Дебиторская задолженность"",
			|	_РасхожденияОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженность,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженностьУС
			|ИЗ
			|	_РасхожденияОбязательстваПоДенежнымСредствам КАК _РасхожденияОбязательстваПоДенежнымСредствам
			|ГДЕ
			|	_РасхожденияОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженность <> _РасхожденияОбязательстваПоДенежнымСредствам.ДебиторскаяЗадолженностьУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОбязательстваПоДенежнымСредствам.ДБО,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.СА,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.НачалоПериода,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.Валюта,
			|	NULL,
			|	""Обязательства по денежным средствам"",
			|	NULL,
			|	""Кредиторская задолженность"",
			|	_РасхожденияОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженность,
			|	_РасхожденияОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженностьУС
			|ИЗ
			|	_РасхожденияОбязательстваПоДенежнымСредствам КАК _РасхожденияОбязательстваПоДенежнымСредствам
			|ГДЕ
			|	_РасхожденияОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженность <> _РасхожденияОбязательстваПоДенежнымСредствам.КредиторскаяЗадолженностьУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.ДБО,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.СА,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.НачалоПериода,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.Валюта,
			|	NULL,
			|	ВЫБОР
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Торговая комиссия""
			|			ТОГДА ""Остатки начисленной торговой комиссии за период""
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Брокерская комиссия""
			|			ТОГДА ""Остатки начисленной брокерской комиссии за период""
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Депозитарная комиссия""
			|			ТОГДА ""Остатки начисленной депозитарной комиссии за период""
			|		ИНАЧЕ ""Остатки начисленной прочей комиссии за период""
			|	КОНЕЦ,
			|	NULL,
			|	""Начальный остаток"",
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.НачальныйОстаток,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.НачальныйОстатокУС
			|ИЗ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии КАК _РасхожденияОстаткиЗадолженностиПоКомиссии
			|ГДЕ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.НачальныйОстаток <> _РасхожденияОстаткиЗадолженностиПоКомиссии.НачальныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.ДБО,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.СА,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.НачалоПериода,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.Валюта,
			|	NULL,
			|	ВЫБОР
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Торговая комиссия""
			|			ТОГДА ""Остатки начисленной торговой комиссии за период""
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Брокерская комиссия""
			|			ТОГДА ""Остатки начисленной брокерской комиссии за период""
			|		КОГДА _РасхожденияОстаткиЗадолженностиПоКомиссии.ТипКомиссии = ""Депозитарная комиссия""
			|			ТОГДА ""Остатки начисленной депозитарной комиссии за период""
			|		ИНАЧЕ ""Остатки начисленной прочей комиссии за период""
			|	КОНЕЦ,
			|	NULL,
			|	""Конечный остаток"",
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.КонечныйОстаток,
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.КонечныйОстатокУС
			|ИЗ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии КАК _РасхожденияОстаткиЗадолженностиПоКомиссии
			|ГДЕ
			|	_РасхожденияОстаткиЗадолженностиПоКомиссии.КонечныйОстаток <> _РасхожденияОстаткиЗадолженностиПоКомиссии.КонечныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.ДБО,
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.СА,
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.НачалоПериода,
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.Валюта,
			|	NULL,
			|	ВЫБОР
			|		КОГДА _РасхожденияНачисленнаяКомиссияЗаПериод.ТипКомиссии = ""Торговая комиссия""
			|			ТОГДА ""Начисленная торговая комиссия за период""
			|		КОГДА _РасхожденияНачисленнаяКомиссияЗаПериод.ТипКомиссии = ""Брокерская комиссия""
			|			ТОГДА ""Начисленная брокерская комиссия за период""
			|		КОГДА _РасхожденияНачисленнаяКомиссияЗаПериод.ТипКомиссии = ""Депозитарная комиссия""
			|			ТОГДА ""Начисленная депозитарной комиссия за период""
			|		ИНАЧЕ ""Начисленная прочая комиссия за период""
			|	КОНЕЦ,
			|	NULL,
			|	""Сумма"",
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.Сумма,
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.СуммаУС
			|ИЗ
			|	_РасхожденияНачисленнаяКомиссияЗаПериод КАК _РасхожденияНачисленнаяКомиссияЗаПериод
			|ГДЕ
			|	_РасхожденияНачисленнаяКомиссияЗаПериод.Сумма <> _РасхожденияНачисленнаяКомиссияЗаПериод.СуммаУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.ДБО,
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.СА,
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.НачалоПериода,
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.Валюта,
			|	NULL,
			|	ВЫБОР
			|		КОГДА _РасхожденияОплаченнаяКомиссияЗаПериод.ТипКомиссии = ""Торговая комиссия""
			|			ТОГДА ""Оплаченная торговая комиссия за период""
			|		КОГДА _РасхожденияОплаченнаяКомиссияЗаПериод.ТипКомиссии = ""Брокерская комиссия""
			|			ТОГДА ""Оплаченная брокерская комиссия за период""
			|		КОГДА _РасхожденияОплаченнаяКомиссияЗаПериод.ТипКомиссии = ""Депозитарная комиссия""
			|			ТОГДА ""Оплаченная депозитарной комиссия за период""
			|		ИНАЧЕ ""Оплаченная прочая комиссия за период""
			|	КОНЕЦ,
			|	NULL,
			|	""Сумма"",
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.Сумма,
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.СуммаУС
			|ИЗ
			|	_РасхожденияОплаченнаяКомиссияЗаПериод КАК _РасхожденияОплаченнаяКомиссияЗаПериод
			|ГДЕ
			|	_РасхожденияОплаченнаяКомиссияЗаПериод.Сумма <> _РасхожденияОплаченнаяКомиссияЗаПериод.СуммаУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияДвиженияДенежныхСредств.ДБО,
			|	_РасхожденияДвиженияДенежныхСредств.СА,
			|	_РасхожденияДвиженияДенежныхСредств.НачалоПериода,
			|	_РасхожденияДвиженияДенежныхСредств.КонецПериода,
			|	_РасхожденияДвиженияДенежныхСредств.ВалютнаяСекция,
			|	NULL,
			|	_РасхожденияДвиженияДенежныхСредств.Валюта,
			|	NULL,
			|	""Движения денежных средств"",
			|	NULL,
			|	""Приход"",
			|	_РасхожденияДвиженияДенежныхСредств.Приход,
			|	_РасхожденияДвиженияДенежныхСредств.ПриходУС
			|ИЗ
			|	_РасхожденияДвиженияДенежныхСредств КАК _РасхожденияДвиженияДенежныхСредств
			|ГДЕ
			|	_РасхожденияДвиженияДенежныхСредств.Приход <> _РасхожденияДвиженияДенежныхСредств.ПриходУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияДвиженияДенежныхСредств.ДБО,
			|	_РасхожденияДвиженияДенежныхСредств.СА,
			|	_РасхожденияДвиженияДенежныхСредств.НачалоПериода,
			|	_РасхожденияДвиженияДенежныхСредств.КонецПериода,
			|	_РасхожденияДвиженияДенежныхСредств.ВалютнаяСекция,
			|	NULL,
			|	_РасхожденияДвиженияДенежныхСредств.Валюта,
			|	NULL,
			|	""Движения денежных средств"",
			|	NULL,
			|	""Расход"",
			|	_РасхожденияДвиженияДенежныхСредств.Расход,
			|	_РасхожденияДвиженияДенежныхСредств.РасходУС
			|ИЗ
			|	_РасхожденияДвиженияДенежныхСредств КАК _РасхожденияДвиженияДенежныхСредств
			|ГДЕ
			|	_РасхожденияДвиженияДенежныхСредств.Расход <> _РасхожденияДвиженияДенежныхСредств.РасходУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗаблокированныеДенежныеСредства.ДБО,
			|	_РасхожденияЗаблокированныеДенежныеСредства.СА,
			|	_РасхожденияЗаблокированныеДенежныеСредства.НачалоПериода,
			|	_РасхожденияЗаблокированныеДенежныеСредства.КонецПериода,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗаблокированныеДенежныеСредства.Валюта,
			|	NULL,
			|	""Заблокированные денежные средства"",
			|	NULL,
			|	""Сумма"",
			|	_РасхожденияЗаблокированныеДенежныеСредства.Сумма,
			|	_РасхожденияЗаблокированныеДенежныеСредства.СуммаУС
			|ИЗ
			|	_РасхожденияЗаблокированныеДенежныеСредства КАК _РасхожденияЗаблокированныеДенежныеСредства
			|ГДЕ
			|	_РасхожденияЗаблокированныеДенежныеСредства.Сумма <> _РасхожденияЗаблокированныеДенежныеСредства.СуммаУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОжидаемыеПоступленияДенежныхСредств.ДБО,
			|	_ОжидаемыеПоступленияДенежныхСредств.СА,
			|	_ОжидаемыеПоступленияДенежныхСредств.НачалоПериода,
			|	_ОжидаемыеПоступленияДенежныхСредств.КонецПериода,
			|	NULL,
			|	NULL,
			|	_ОжидаемыеПоступленияДенежныхСредств.Валюта,
			|	NULL,
			|	""Ожидаемые поступления денежных средств"",
			|	NULL,
			|	""Сумма"",
			|	_ОжидаемыеПоступленияДенежныхСредств.Сумма,
			|	_ОжидаемыеПоступленияДенежныхСредств.СуммаУС
			|ИЗ
			|	_РасхожденияОжидаемыеПоступленияДенежныхСредств КАК _ОжидаемыеПоступленияДенежныхСредств
			|ГДЕ
			|	_ОжидаемыеПоступленияДенежныхСредств.Сумма <> _ОжидаемыеПоступленияДенежныхСредств.СуммаУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОстаткиЦенныхБумаг.ДБО,
			|	_РасхожденияОстаткиЦенныхБумаг.СА,
			|	_РасхожденияОстаткиЦенныхБумаг.НачалоПериода,
			|	_РасхожденияОстаткиЦенныхБумаг.КонецПериода,
			|	_РасхожденияОстаткиЦенныхБумаг.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Акции
			|			ТОГДА ""Остатки акций""
			|		КОГДА _РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Облигации
			|			ТОГДА ""Остатки облигаций""
			|		ИНАЧЕ ""Остатки паев""
			|	КОНЕЦ,
			|	NULL,
			|	""Начальный остаток"",
			|	_РасхожденияОстаткиЦенныхБумаг.НачальныйОстаток,
			|	_РасхожденияОстаткиЦенныхБумаг.НачальныйОстатокУС
			|ИЗ
			|	_РасхожденияОстаткиЦенныхБумаг КАК _РасхожденияОстаткиЦенныхБумаг
			|ГДЕ
			|	_РасхожденияОстаткиЦенныхБумаг.НачальныйОстаток <> _РасхожденияОстаткиЦенныхБумаг.НачальныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОстаткиЦенныхБумаг.ДБО,
			|	_РасхожденияОстаткиЦенныхБумаг.СА,
			|	_РасхожденияОстаткиЦенныхБумаг.НачалоПериода,
			|	_РасхожденияОстаткиЦенныхБумаг.КонецПериода,
			|	_РасхожденияОстаткиЦенныхБумаг.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Акции
			|			ТОГДА ""Остатки акций""
			|		КОГДА _РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Облигации
			|			ТОГДА ""Остатки облигаций""
			|		КОГДА _РасхожденияОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
			|			ТОГДА ""Остатки ДР""
			|		ИНАЧЕ ""Остатки паев""
			|	КОНЕЦ,
			|	NULL,
			|	""Конечный остаток"",
			|	_РасхожденияОстаткиЦенныхБумаг.КонечныйОстаток,
			|	_РасхожденияОстаткиЦенныхБумаг.КонечныйОстатокУС
			|ИЗ
			|	_РасхожденияОстаткиЦенныхБумаг КАК _РасхожденияОстаткиЦенныхБумаг
			|ГДЕ
			|	_РасхожденияОстаткиЦенныхБумаг.КонечныйОстаток <> _РасхожденияОстаткиЦенныхБумаг.КонечныйОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗаблокированныеЦенныеБумаги.ДБО,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.СА,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.НачалоПериода,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.КонецПериода,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.ЦеннаяБумага,
			|	""Заблокированные ценные бумаги"",
			|	NULL,
			|	""Количество"",
			|	_РасхожденияЗаблокированныеЦенныеБумаги.Заблокировано,
			|	_РасхожденияЗаблокированныеЦенныеБумаги.ЗаблокированоУС
			|ИЗ
			|	_РасхожденияЗаблокированныеЦенныеБумаги КАК _РасхожденияЗаблокированныеЦенныеБумаги
			|ГДЕ
			|	_РасхожденияЗаблокированныеЦенныеБумаги.Заблокировано <> _РасхожденияЗаблокированныеЦенныеБумаги.ЗаблокированоУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КодыУБрокера.ДоговорБрокерскогоОбслуживания,
			|	КодыУБрокера.СчетДоверительногоУправления,
			|	&НачалоПериода,
			|	&КонецПериода,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	""Нет отчета брокера"",
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И Брокер = &Брокер
			|				И НЕ СчетДоверительногоУправления В
			|						(ВЫБРАТЬ
			|							_СверенныеСчетаДоверительногоУправления.СчетДоверительногоУправления
			|						ИЗ
			|							_СверенныеСчетаДоверительногоУправления)
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Ключи.СДУ КАК СДУ
			|					ИЗ
			|						_Ключи КАК _Ключи
			|					ГДЕ
			|						_Ключи.НачалоПериода = &НачалоПериода
			|						И _Ключи.КонецПериода = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ))) КАК КодыУБрокера
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО (СчетаДоверительногоУправления.Ссылка = КодыУБрокера.СчетДоверительногоУправления)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыУБрокера.ДоговорБрокерскогоОбслуживания)
			|ГДЕ
			|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
			|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &НачалоПериода)
			|	И СчетаДоверительногоУправления.ДатаЗаключения <= &КонецПериода
			|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &НачалоПериода)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗадолженностьПоЦБ.ДБО,
			|	_РасхожденияЗадолженностьПоЦБ.СА,
			|	_РасхожденияЗадолженностьПоЦБ.НачалоПериода,
			|	_РасхожденияЗадолженностьПоЦБ.КонецПериода,
			|	_РасхожденияЗадолженностьПоЦБ.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗадолженностьПоЦБ.ЦБ,
			|	""Обязательства по ЦБ"",
			|	NULL,
			|	""Исходящий остаток"",
			|	_РасхожденияЗадолженностьПоЦБ.ИсходящийОстаток,
			|	_РасхожденияЗадолженностьПоЦБ.ИсходящийОстатокУС
			|ИЗ
			|	_РасхожденияЗадолженностьПоЦБ КАК _РасхожденияЗадолженностьПоЦБ
			|ГДЕ
			|	_РасхожденияЗадолженностьПоЦБ.ИсходящийОстаток <> _РасхожденияЗадолженностьПоЦБ.ИсходящийОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗадолженностьПоЦБ.ДБО,
			|	_РасхожденияЗадолженностьПоЦБ.СА,
			|	_РасхожденияЗадолженностьПоЦБ.НачалоПериода,
			|	_РасхожденияЗадолженностьПоЦБ.КонецПериода,
			|	_РасхожденияЗадолженностьПоЦБ.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗадолженностьПоЦБ.ЦБ,
			|	""Обязательства по ЦБ"",
			|	NULL,
			|	""Обязательства к получению"",
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКПолучению,
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКПолучениюУС
			|ИЗ
			|	_РасхожденияЗадолженностьПоЦБ КАК _РасхожденияЗадолженностьПоЦБ
			|ГДЕ
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКПолучению <> _РасхожденияЗадолженностьПоЦБ.ОбязательстваКПолучениюУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗадолженностьПоЦБ.ДБО,
			|	_РасхожденияЗадолженностьПоЦБ.СА,
			|	_РасхожденияЗадолженностьПоЦБ.НачалоПериода,
			|	_РасхожденияЗадолженностьПоЦБ.КонецПериода,
			|	_РасхожденияЗадолженностьПоЦБ.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗадолженностьПоЦБ.ЦБ,
			|	""Обязательства по ЦБ"",
			|	NULL,
			|	""Обязательства к выбытию"",
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКВыбытию,
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКВыбытиюУС
			|ИЗ
			|	_РасхожденияЗадолженностьПоЦБ КАК _РасхожденияЗадолженностьПоЦБ
			|ГДЕ
			|	_РасхожденияЗадолженностьПоЦБ.ОбязательстваКВыбытию <> _РасхожденияЗадолженностьПоЦБ.ОбязательстваКВыбытиюУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияЗадолженностьПоЦБ.ДБО,
			|	_РасхожденияЗадолженностьПоЦБ.СА,
			|	_РасхожденияЗадолженностьПоЦБ.НачалоПериода,
			|	_РасхожденияЗадолженностьПоЦБ.КонецПериода,
			|	_РасхожденияЗадолженностьПоЦБ.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияЗадолженностьПоЦБ.ЦБ,
			|	""Обязательства по ЦБ"",
			|	NULL,
			|	""Плановый исходящий остаток"",
			|	_РасхожденияЗадолженностьПоЦБ.ПлановыйИсходящийОстаток,
			|	_РасхожденияЗадолженностьПоЦБ.ПлановыйИсходящийОстатокУС
			|ИЗ
			|	_РасхожденияЗадолженностьПоЦБ КАК _РасхожденияЗадолженностьПоЦБ
			|ГДЕ
			|	_РасхожденияЗадолженностьПоЦБ.ПлановыйИсходящийОстаток <> _РасхожденияЗадолженностьПоЦБ.ПлановыйИсходящийОстатокУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОжидаемыеПоступленияАкций.ДБО,
			|	_РасхожденияОжидаемыеПоступленияАкций.СА,
			|	_РасхожденияОжидаемыеПоступленияАкций.НачалоПериода,
			|	_РасхожденияОжидаемыеПоступленияАкций.КонецПериода,
			|	_РасхожденияОжидаемыеПоступленияАкций.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияОжидаемыеПоступленияАкций.Акция,
			|	""Ожидаемые поступления акций"",
			|	_РасхожденияОжидаемыеПоступленияАкций.ДатаОперации,
			|	""Количество"",
			|	_РасхожденияОжидаемыеПоступленияАкций.Количество,
			|	_РасхожденияОжидаемыеПоступленияАкций.КоличествоУС
			|ИЗ
			|	_РасхожденияОжидаемыеПоступленияАкций КАК _РасхожденияОжидаемыеПоступленияАкций
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОжидаемыеПоступленияОблигаций.ДБО,
			|	_РасхожденияОжидаемыеПоступленияОблигаций.СА,
			|	_РасхожденияОжидаемыеПоступленияОблигаций.НачалоПериода,
			|	_РасхожденияОжидаемыеПоступленияОблигаций.КонецПериода,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_РасхожденияОжидаемыеПоступленияОблигаций.Облигация,
			|	""Ожидаемые поступления облигаций"",
			|	_РасхожденияОжидаемыеПоступленияОблигаций.ДатаОперации,
			|	""Количество"",
			|	_РасхожденияОжидаемыеПоступленияОблигаций.Количество,
			|	_РасхожденияОжидаемыеПоступленияОблигаций.КоличествоУС
			|ИЗ
			|	_РасхожденияОжидаемыеПоступленияОблигаций КАК _РасхожденияОжидаемыеПоступленияОблигаций
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияОжидаемыеПоступленияПаев.ДБО,
			|	_РасхожденияОжидаемыеПоступленияПаев.СА,
			|	_РасхожденияОжидаемыеПоступленияПаев.НачалоПериода,
			|	_РасхожденияОжидаемыеПоступленияПаев.КонецПериода,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_РасхожденияОжидаемыеПоступленияПаев.Пай,
			|	""Ожидаемые поступления паев"",
			|	_РасхожденияОжидаемыеПоступленияПаев.ДатаОперации,
			|	""Количество"",
			|	_РасхожденияОжидаемыеПоступленияПаев.Количество,
			|	_РасхожденияОжидаемыеПоступленияПаев.КоличествоУС
			|ИЗ
			|	_РасхожденияОжидаемыеПоступленияПаев КАК _РасхожденияОжидаемыеПоступленияПаев
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияКонверсионныеСделки.ДБО,
			|	_РасхожденияКонверсионныеСделки.СА,
			|	_РасхожденияКонверсионныеСделки.НачалоПериода,
			|	_РасхожденияКонверсионныеСделки.КонецПериода,
			|	_РасхожденияКонверсионныеСделки.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	NULL,
			|	""Конверсионные сделки"",
			|	NULL,
			|	""Количество сделок"",
			|	_РасхожденияКонверсионныеСделки.КоличествоСделокБрокер,
			|	_РасхожденияКонверсионныеСделки.КоличествоСделокСистема
			|ИЗ
			|	_РасхожденияКонверсионныеСделки КАК _РасхожденияКонверсионныеСделки
			|ГДЕ
			|	_РасхожденияКонверсионныеСделки.КоличествоСделокБрокер <> _РасхожденияКонверсионныеСделки.КоличествоСделокСистема
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияНезавершенныеКонверсионныеСделки.ДБО,
			|	_РасхожденияНезавершенныеКонверсионныеСделки.СА,
			|	_РасхожденияНезавершенныеКонверсионныеСделки.НачалоПериода,
			|	_РасхожденияНезавершенныеКонверсионныеСделки.КонецПериода,
			|	_РасхожденияНезавершенныеКонверсионныеСделки.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	NULL,
			|	""Незавершенные конверсионные сделки"",
			|	NULL,
			|	""Количество сделок"",
			|	_РасхожденияНезавершенныеКонверсионныеСделки.КоличествоСделокБрокер,
			|	_РасхожденияНезавершенныеКонверсионныеСделки.КоличествоСделокСистема
			|ИЗ
			|	_РасхожденияНезавершенныеКонверсионныеСделки КАК _РасхожденияНезавершенныеКонверсионныеСделки
			|ГДЕ
			|	_РасхожденияНезавершенныеКонверсионныеСделки.КоличествоСделокБрокер <> _РасхожденияНезавершенныеКонверсионныеСделки.КоличествоСделокСистема
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияДвиженияЦенныхБумаг.ДБО,
			|	_РасхожденияДвиженияЦенныхБумаг.СА,
			|	_РасхожденияДвиженияЦенныхБумаг.НачалоПериода,
			|	_РасхожденияДвиженияЦенныхБумаг.КонецПериода,
			|	_РасхожденияДвиженияЦенныхБумаг.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияДвиженияЦенныхБумаг.ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(_РасхожденияДвиженияЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|			ТОГДА ""Движения облигаций""
			|		ИНАЧЕ ""Движения паев""
			|	КОНЕЦ,
			|	_РасхожденияДвиженияЦенныхБумаг.ДатаОперации,
			|	""Количество"",
			|	_РасхожденияДвиженияЦенныхБумаг.Количество,
			|	_РасхожденияДвиженияЦенныхБумаг.КоличествоУС
			|ИЗ
			|	_РасхожденияДвиженияЦенныхБумаг КАК _РасхожденияДвиженияЦенныхБумаг
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияДвиженияАкций.ДБО,
			|	_РасхожденияДвиженияАкций.СА,
			|	_РасхожденияДвиженияАкций.НачалоПериода,
			|	_РасхожденияДвиженияАкций.КонецПериода,
			|	_РасхожденияДвиженияАкций.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияДвиженияАкций.ЦеннаяБумага,
			|	""Движения акций"",
			|	_РасхожденияДвиженияАкций.ДатаОперации,
			|	""Приход"",
			|	_РасхожденияДвиженияАкций.Приход,
			|	_РасхожденияДвиженияАкций.ПриходУС
			|ИЗ
			|	_РасхожденияДвиженияАкций КАК _РасхожденияДвиженияАкций
			|ГДЕ
			|	_РасхожденияДвиженияАкций.Приход <> _РасхожденияДвиженияАкций.ПриходУС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_РасхожденияДвиженияАкций.ДБО,
			|	_РасхожденияДвиженияАкций.СА,
			|	_РасхожденияДвиженияАкций.НачалоПериода,
			|	_РасхожденияДвиженияАкций.КонецПериода,
			|	_РасхожденияДвиженияАкций.ВалютнаяСекция,
			|	NULL,
			|	NULL,
			|	_РасхожденияДвиженияАкций.ЦеннаяБумага,
			|	""Движения акций"",
			|	_РасхожденияДвиженияАкций.ДатаОперации,
			|	""Расход"",
			|	_РасхожденияДвиженияАкций.Расход,
			|	_РасхожденияДвиженияАкций.РасходУС
			|ИЗ
			|	_РасхожденияДвиженияАкций КАК _РасхожденияДвиженияАкций
			|ГДЕ
			|	_РасхожденияДвиженияАкций.Расход <> _РасхожденияДвиженияАкций.РасходУС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СверенныеСчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СверенныеСчетаДоверительногоУправления.Стратегия КАК Стратегия
			|ПОМЕСТИТЬ _СверенныеСчета
			|ИЗ
			|	_СверенныеСчетаДоверительногоУправления КАК _СверенныеСчетаДоверительногоУправления
			|ГДЕ
			|	_СверенныеСчетаДоверительногоУправления.СчетДоверительногоУправления В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Ключи.СДУ КАК СДУ
			|			ИЗ
			|				_Ключи КАК _Ключи)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ИтоговаяТаблица.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания,
			|	_ИтоговаяТаблица.СубъектАналитики КАК СубъектАналитики,
			|	_ИтоговаяТаблица.НачалоПериода КАК НачалоПериода,
			|	_ИтоговаяТаблица.КонецПериода КАК КонецПериода,
			|	_ИтоговаяТаблица.ВалютнаяСекция КАК ВалютнаяСекция,
			|	_ИтоговаяТаблица.ВнебиржевойРынок КАК ВнебиржевойРынок,
			|	_ИтоговаяТаблица.Валюта КАК Валюта,
			|	_ИтоговаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ИтоговаяТаблица.Блок КАК Блок,
			|	_ИтоговаяТаблица.ДатаОперации КАК ДатаОперации,
			|	_ИтоговаяТаблица.Показатель КАК Показатель,
			|	_ИтоговаяТаблица.Брокер КАК Брокер,
			|	_ИтоговаяТаблица.УчетнаяСистема КАК УчетнаяСистема,
			|	ИСТИНА КАК Расхождение
			|ИЗ
			|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
			|
			|УПОРЯДОЧИТЬ ПО
			|	_ИтоговаяТаблица.ДоговорБрокерскогоОбслуживания.Код,
			|	_ИтоговаяТаблица.СубъектАналитики.Наименование,
			|	НачалоПериода,
			|	_ИтоговаяТаблица.ВалютнаяСекция,
			|	_ИтоговаяТаблица.Валюта,
			|	_ИтоговаяТаблица.ЦеннаяБумага,
			|	_ИтоговаяТаблица.Блок,
			|	_ИтоговаяТаблица.Показатель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _Ключи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиДенежныхСредствБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОбязательстваПоДенежнымСредствамБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиЗадолженностиПоКомиссииБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _НачисленнаяКомиссияЗаПериодБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОплаченнаяКомиссияЗаПериодБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияДенежныхСредствБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеДенежныеСредстваБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияДенежныхСредствБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _КонверсионныеСделкиБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _НезавершенныеКонверсионныеСделкиБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗадолженностьПоЦББрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияАкцийБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияЦенныхБумагБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияАкцийБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияОблигацийБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияПаевБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеЦенныеБумагиБрокер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиДенежныхСредствСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОбязательстваПоДенежнымСредствамСистемаПоОснованиям
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОбязательстваПоДенежнымСредствамСистемаВВалютеЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиЗадолженностиПоКомиссииСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _НачисленнаяКомиссияЗаПериодСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОплаченнаяКомиссияЗаПериодСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияДенежныхСредствСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеДенежныеСредстваСистемаПоОснованиям
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеДенежныеСредстваСистемаВВалютеЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияДенежныхСредствСистемаПоОснованиям
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияДенежныхСредствСистемаВВалютеЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _КурсыВалют
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _КоэффициентыВалютДляПересчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОбязательстваПоДенежнымСредствамСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеДенежныеСредстваСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияДенежныхСредствСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _КонверсионныеСделкиСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _НезавершенныеКонверсионныеСделкиСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ИсключаемыеСделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗадолженностьПоЦБСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияАкцийСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ДвиженияЦенныхБумагСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияАкцийСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияОблигацийСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ОжидаемыеПоступленияПаевСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ЗаблокированныеЦенныеБумагиСводнаяСистема
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОстаткиДенежныхСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОбязательстваПоДенежнымСредствам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОстаткиЗадолженностиПоКомиссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияНачисленнаяКомиссияЗаПериод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОплаченнаяКомиссияЗаПериод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияДвиженияДенежныхСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияЗаблокированныеДенежныеСредства
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОжидаемыеПоступленияДенежныхСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияКонверсионныеСделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияНезавершенныеКонверсионныеСделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОстаткиЦенныхБумаг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияЗадолженностьПоЦБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияДвиженияАкций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияДвиженияЦенныхБумаг
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОжидаемыеПоступленияАкций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОжидаемыеПоступленияОблигаций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияОжидаемыеПоступленияПаев
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РасхожденияЗаблокированныеЦенныеБумаги
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ИтоговаяТаблица";
#КонецОбласти
	
КонецФункции

Функция ПодготовитьПустуюСтруктуруРезультата(ЗагружаемыеРазделы, ПропускатьСтрокиЕслиЦБНеНайдена)
	
	Результат = Новый Структура;
	
	ТипыСубъектаАналитики = Новый Массив;
	ТипыСубъектаАналитики.Добавить(Тип("СправочникСсылка.СчетаДоверительногоУправления"));
	ТипыСубъектаАналитики.Добавить(Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));
	
	МассивТиповДБО = Новый Массив;
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.Договоры"));
	
	МассивТиповЦеннаяБумага = Новый Массив;
	МассивТиповЦеннаяБумага.Добавить(Тип("СправочникСсылка.Акции"));
	МассивТиповЦеннаяБумага.Добавить(Тип("СправочникСсылка.Облигации"));
	МассивТиповЦеннаяБумага.Добавить(Тип("СправочникСсылка.Паи"));
	МассивТиповЦеннаяБумага.Добавить(Тип("СправочникСсылка.ДепозитарныеРасписки"));
	
	МассивТиповАкций = Новый Массив;
	МассивТиповАкций.Добавить(Тип("СправочникСсылка.Акции"));
	МассивТиповАкций.Добавить(Тип("СправочникСсылка.ДепозитарныеРасписки"));

	ОписаниеТипаДБО				= Новый ОписаниеТипов(МассивТиповДБО);
	ОписаниеТипаСА				= Новый ОписаниеТипов(ТипыСубъектаАналитики);
	ОписаниеТипаЦеннаяБумага	= Новый ОписаниеТипов(МассивТиповЦеннаяБумага);
	ОписаниеТипаВалюты			= Новый ОписаниеТипов("СправочникСсылка.Валюты");
	ОписаниеТипаБулево			= Новый ОписаниеТипов("Булево");
	ОписаниеТипаЧисло			= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(22,5));
	ОписаниеТипаСтрока21		= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(21));
	ОписаниеТипаСтрока250		= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(250));
	ОписаниеТипаАкция			= Новый ОписаниеТипов(МассивТиповАкций);
	ОписаниеТипаОблигация		= Новый ОписаниеТипов("СправочникСсылка.Облигации");
	ОписаниеТипаПай				= Новый ОписаниеТипов("СправочникСсылка.Паи");
	ОписаниеТипаДатаВремя		= Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ОписаниеТипаВидыСделок		= Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСделок");
	
	Если ЗагружаемыеРазделы.ОстаткиДенежныхСредств Тогда
	
		ОстаткиДенежныхСредств = Новый ТаблицаЗначений;
		ОстаткиДенежныхСредств.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ОстаткиДенежныхСредств.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОстаткиДенежныхСредств.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ОстаткиДенежныхСредств.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОстаткиДенежныхСредств.Колонки.Добавить("КонецПериода",			ОписаниеТипаДатаВремя);
		ОстаткиДенежныхСредств.Колонки.Добавить("ВнебиржевойРынок",		ОписаниеТипаБулево);
		ОстаткиДенежныхСредств.Колонки.Добавить("Валюта",				ОписаниеТипаВалюты);
		ОстаткиДенежныхСредств.Колонки.Добавить("НачальныйОстаток",		ОписаниеТипаЧисло);
		ОстаткиДенежныхСредств.Колонки.Добавить("КонечныйОстаток",		ОписаниеТипаЧисло);
		
		Результат.Вставить("ОстаткиДенежныхСредств", ОстаткиДенежныхСредств);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОбязательстваПоДенежнымСредствам Тогда
	
		ОбязательстваПоДенежнымСредствам = Новый ТаблицаЗначений;
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("ДБО",							ОписаниеТипаДБО);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("СА",								ОписаниеТипаСА);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("НачалоПериода",					ОписаниеТипаДатаВремя);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("КонецПериода",					ОписаниеТипаДатаВремя);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("Валюта",							ОписаниеТипаВалюты);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("НачальныйОстаток",				ОписаниеТипаЧисло);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("ДебиторскаяЗадолженность",		ОписаниеТипаЧисло);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("КредиторскаяЗадолженность",		ОписаниеТипаЧисло);
		ОбязательстваПоДенежнымСредствам.Колонки.Добавить("КонечныйОстаток",				ОписаниеТипаЧисло);
		
		Результат.Вставить("ОбязательстваПоДенежнымСредствам", ОбязательстваПоДенежнымСредствам);		
	
	КонецЕсли; 

	Если ЗагружаемыеРазделы.ОстаткиЗадолженностиПоКомиссииНаНачало Тогда
	
		ОстаткиЗадолженностиПоКомиссии = Новый ТаблицаЗначений;
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("КонецПериода",			ОписаниеТипаДатаВремя);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("Валюта",				ОписаниеТипаВалюты);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("ТипКомиссии",			ОписаниеТипаСтрока21);
		ОстаткиЗадолженностиПоКомиссии.Колонки.Добавить("Сумма",				ОписаниеТипаЧисло);
		
		Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаНачало", ОстаткиЗадолженностиПоКомиссии);		
	
	КонецЕсли;

	Если ЗагружаемыеРазделы.НачисленнаяКомиссияЗаПериод Тогда
	
		НачисленнаяКомиссияЗаПериод = Новый ТаблицаЗначений;
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("СА",				ОписаниеТипаСА);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("Валюта",			ОписаниеТипаВалюты);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("ТипКомиссии",		ОписаниеТипаСтрока21);
		НачисленнаяКомиссияЗаПериод.Колонки.Добавить("Сумма",			ОписаниеТипаЧисло);
		
		Результат.Вставить("НачисленнаяКомиссияЗаПериод", НачисленнаяКомиссияЗаПериод);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОплаченнаяКомиссияЗаПериод Тогда
	
		ОплаченнаяКомиссияЗаПериод = Новый ТаблицаЗначений;
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("Валюта",			ОписаниеТипаВалюты);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("ТипКомиссии",		ОписаниеТипаСтрока21);
		ОплаченнаяКомиссияЗаПериод.Колонки.Добавить("Сумма",			ОписаниеТипаЧисло);
		
		Результат.Вставить("ОплаченнаяКомиссияЗаПериод", ОплаченнаяКомиссияЗаПериод);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОстаткиЗадолженностиПоКомиссииНаКонец Тогда
	
		ОстаткиЗадолженностиПоКомиссииНаКонец = Новый ТаблицаЗначений;
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("ДБО",			ОписаниеТипаДБО);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("СА",			ОписаниеТипаСА);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("Валюта",		ОписаниеТипаВалюты);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("ТипКомиссии",	ОписаниеТипаСтрока21);
		ОстаткиЗадолженностиПоКомиссииНаКонец.Колонки.Добавить("Сумма",			ОписаниеТипаЧисло);
		
		Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаКонец", ОстаткиЗадолженностиПоКомиссииНаКонец);		
	
	КонецЕсли; 
	
	Если ЗагружаемыеРазделы.ДвиженияДенежныхСредств Тогда
	
		ДвиженияДенежныхСредств = Новый ТаблицаЗначений;
		ДвиженияДенежныхСредств.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ДвиженияДенежныхСредств.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ДвиженияДенежныхСредств.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ДвиженияДенежныхСредств.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ДвиженияДенежныхСредств.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ДвиженияДенежныхСредств.Колонки.Добавить("Валюта",				ОписаниеТипаВалюты);
		ДвиженияДенежныхСредств.Колонки.Добавить("Приход",				ОписаниеТипаЧисло);
		ДвиженияДенежныхСредств.Колонки.Добавить("Расход",				ОписаниеТипаЧисло);
		
		Результат.Вставить("ДвиженияДенежныхСредств", ДвиженияДенежныхСредств);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ЗаблокированныеДенежныеСредства Тогда
	
		ЗаблокированныеДенежныеСредства = Новый ТаблицаЗначений;
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("Валюта",				ОписаниеТипаВалюты);
		ЗаблокированныеДенежныеСредства.Колонки.Добавить("Сумма",				ОписаниеТипаЧисло);
		
		Результат.Вставить("ЗаблокированныеДенежныеСредства", ЗаблокированныеДенежныеСредства);		
	
	КонецЕсли; 

	Если ЗагружаемыеРазделы.КонверсионныеСделки Тогда
	
		КонверсионныеСделки = Новый ТаблицаЗначений;
		КонверсионныеСделки.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		КонверсионныеСделки.Колонки.Добавить("СА",					ОписаниеТипаСА);
		КонверсионныеСделки.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		КонверсионныеСделки.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		КонверсионныеСделки.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		КонверсионныеСделки.Колонки.Добавить("ВнебиржеваяСделка",	ОписаниеТипаБулево);
		КонверсионныеСделки.Колонки.Добавить("Дата",				ОписаниеТипаДатаВремя);
		КонверсионныеСделки.Колонки.Добавить("ДатаВалютирования",	ОписаниеТипаДатаВремя);
		КонверсионныеСделки.Колонки.Добавить("НаправлениеСделки",	ОписаниеТипаВидыСделок);
		КонверсионныеСделки.Колонки.Добавить("Курс",				ОписаниеТипаЧисло);
		КонверсионныеСделки.Колонки.Добавить("Сумма",				ОписаниеТипаЧисло);
		КонверсионныеСделки.Колонки.Добавить("БазоваяВалюта",		ОписаниеТипаВалюты);
		КонверсионныеСделки.Колонки.Добавить("Контрвалюта",			ОписаниеТипаВалюты);
		КонверсионныеСделки.Колонки.Добавить("КомиссияБрокера",		ОписаниеТипаЧисло);
		
		Результат.Вставить("КонверсионныеСделки", КонверсионныеСделки);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.НезавершенныеКонверсионныеСделки Тогда
	
		НезавершенныеКонверсионныеСделки = Новый ТаблицаЗначений;
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("СА",					ОписаниеТипаСА);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("ВнебиржеваяСделка",	ОписаниеТипаБулево);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("Дата",				ОписаниеТипаДатаВремя);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("ДатаВалютирования",	ОписаниеТипаДатаВремя);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("НаправлениеСделки",	ОписаниеТипаВидыСделок);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("Курс",				ОписаниеТипаЧисло);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("Сумма",				ОписаниеТипаЧисло);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("БазоваяВалюта",		ОписаниеТипаВалюты);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("Контрвалюта",		ОписаниеТипаВалюты);
		НезавершенныеКонверсионныеСделки.Колонки.Добавить("КомиссияБрокера",	ОписаниеТипаЧисло);
		
		Результат.Вставить("НезавершенныеКонверсионныеСделки", НезавершенныеКонверсионныеСделки);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОжидаемыеПоступленияДенежныхСредств Тогда
	
		ОжидаемыеПоступленияДенежныхСредств = Новый ТаблицаЗначений;
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("Валюта",				ОписаниеТипаВалюты);
		ОжидаемыеПоступленияДенежныхСредств.Колонки.Добавить("Сумма",				ОписаниеТипаЧисло);
		
		Результат.Вставить("ОжидаемыеПоступленияДенежныхСредств", ОжидаемыеПоступленияДенежныхСредств);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ОстаткиАкций Тогда
	
		ОстаткиАкций = Новый ТаблицаЗначений;
		ОстаткиАкций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ОстаткиАкций.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОстаткиАкций.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ОстаткиАкций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОстаткиАкций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОстаткиАкций.Колонки.Добавить("Акция",				ОписаниеТипаАкция);
		ОстаткиАкций.Колонки.Добавить("НачальныйОстаток",	ОписаниеТипаЧисло);
		ОстаткиАкций.Колонки.Добавить("КонечныйОстаток",	ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ОстаткиАкций.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ОстаткиАкций.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ОстаткиАкций.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ОстаткиАкций", ОстаткиАкций);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ЗаблокированныеАкции Тогда
	
		ЗаблокированныеАкции = Новый ТаблицаЗначений;
		ЗаблокированныеАкции.Колонки.Добавить("ДБО",			ОписаниеТипаДБО);
		ЗаблокированныеАкции.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ЗаблокированныеАкции.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ЗаблокированныеАкции.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ЗаблокированныеАкции.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		ЗаблокированныеАкции.Колонки.Добавить("Акция",			ОписаниеТипаАкция);
		ЗаблокированныеАкции.Колонки.Добавить("Заблокировано",	ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ЗаблокированныеАкции.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ЗаблокированныеАкции.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ЗаблокированныеАкции.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ЗаблокированныеАкции", ЗаблокированныеАкции);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ОстаткиОблигаций Тогда
	
		ОстаткиОблигаций = Новый ТаблицаЗначений;
		ОстаткиОблигаций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ОстаткиОблигаций.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОстаткиОблигаций.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ОстаткиОблигаций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОстаткиОблигаций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОстаткиОблигаций.Колонки.Добавить("Облигация",			ОписаниеТипаОблигация);
		ОстаткиОблигаций.Колонки.Добавить("НачальныйОстаток",	ОписаниеТипаЧисло);
		ОстаткиОблигаций.Колонки.Добавить("КонечныйОстаток",	ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ОстаткиОблигаций.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ОстаткиОблигаций.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ОстаткиОблигаций.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ОстаткиОблигаций", ОстаткиОблигаций);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ЗаблокированныеОблигации Тогда
	
		ЗаблокированныеОблигации = Новый ТаблицаЗначений;
		ЗаблокированныеОблигации.Колонки.Добавить("ДБО",			ОписаниеТипаДБО);
		ЗаблокированныеОблигации.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ЗаблокированныеОблигации.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ЗаблокированныеОблигации.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ЗаблокированныеОблигации.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		ЗаблокированныеОблигации.Колонки.Добавить("Облигация",		ОписаниеТипаОблигация);
		ЗаблокированныеОблигации.Колонки.Добавить("Заблокировано",	ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ЗаблокированныеОблигации.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ЗаблокированныеОблигации.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ЗаблокированныеОблигации.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ЗаблокированныеОблигации", ЗаблокированныеОблигации);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ОстаткиПаев Тогда
	
		ОстаткиПаев = Новый ТаблицаЗначений;
		ОстаткиПаев.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ОстаткиПаев.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ОстаткиПаев.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ОстаткиПаев.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОстаткиПаев.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОстаткиПаев.Колонки.Добавить("Пай",					ОписаниеТипаПай);
		ОстаткиПаев.Колонки.Добавить("НачальныйОстаток",	ОписаниеТипаЧисло);
		ОстаткиПаев.Колонки.Добавить("КонечныйОстаток",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ОстаткиПаев.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ОстаткиПаев.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ОстаткиПаев.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ОстаткиПаев", ОстаткиПаев);		
	
	КонецЕсли; 

	
	Если ЗагружаемыеРазделы.ЗаблокированныеПаи Тогда
	
		ЗаблокированныеПаи = Новый ТаблицаЗначений;
		ЗаблокированныеПаи.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		ЗаблокированныеПаи.Колонки.Добавить("СА",					ОписаниеТипаСА);
		ЗаблокированныеПаи.Колонки.Добавить("ВалютнаяСекция",		ОписаниеТипаБулево);
		ЗаблокированныеПаи.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ЗаблокированныеПаи.Колонки.Добавить("КонецПериода",			ОписаниеТипаДатаВремя);
		ЗаблокированныеПаи.Колонки.Добавить("Пай",					ОписаниеТипаПай);
		ЗаблокированныеПаи.Колонки.Добавить("Заблокировано",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ЗаблокированныеПаи.Колонки.Добавить("РегНомер", ОписаниеТипаСтрока250);
			ЗаблокированныеПаи.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ЗаблокированныеПаи.Колонки.Добавить("Рынок", 	ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ЗаблокированныеПаи", ЗаблокированныеПаи);		
	
	КонецЕсли; 
	
	Если ЗагружаемыеРазделы.ЗадолженностьПоЦБ Тогда
	
		ЗадолженностьПоЦБ = Новый ТаблицаЗначений;
		ЗадолженностьПоЦБ.Колонки.Добавить("ДБО",						ОписаниеТипаДБО);
		ЗадолженностьПоЦБ.Колонки.Добавить("СА",						ОписаниеТипаСА);
		ЗадолженностьПоЦБ.Колонки.Добавить("ВалютнаяСекция",			ОписаниеТипаБулево);
		ЗадолженностьПоЦБ.Колонки.Добавить("НачалоПериода",				ОписаниеТипаДатаВремя);
		ЗадолженностьПоЦБ.Колонки.Добавить("КонецПериода",				ОписаниеТипаДатаВремя);
		ЗадолженностьПоЦБ.Колонки.Добавить("ЦеннаяБумага",				ОписаниеТипаЦеннаяБумага);
		ЗадолженностьПоЦБ.Колонки.Добавить("ИсходящийОстаток",			ОписаниеТипаЧисло);
		ЗадолженностьПоЦБ.Колонки.Добавить("ОбязательстваКПолучению",	ОписаниеТипаЧисло);
		ЗадолженностьПоЦБ.Колонки.Добавить("ОбязательстваКВыбытию",		ОписаниеТипаЧисло);
		ЗадолженностьПоЦБ.Колонки.Добавить("ПлановыйИсходящийОстаток",	ОписаниеТипаЧисло);
		
		Результат.Вставить("ЗадолженностьПоЦБ", ЗадолженностьПоЦБ);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ДвиженияАкций Тогда
	
		ДвиженияАкций = Новый ТаблицаЗначений;
		ДвиженияАкций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ДвиженияАкций.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ДвиженияАкций.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ДвиженияАкций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ДвиженияАкций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ДвиженияАкций.Колонки.Добавить("Акция",				ОписаниеТипаАкция);
		ДвиженияАкций.Колонки.Добавить("ДатаОперации",		ОписаниеТипаДатаВремя);
		ДвиженияАкций.Колонки.Добавить("Приход",			ОписаниеТипаЧисло);
		ДвиженияАкций.Колонки.Добавить("Расход",			ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ДвиженияАкций.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ДвиженияАкций.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ДвиженияАкций.Колонки.Добавить("Рынок", 	ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ДвиженияАкций", ДвиженияАкций);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ДвиженияОблигаций Тогда
	
		ДвиженияОблигаций = Новый ТаблицаЗначений;
		ДвиженияОблигаций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ДвиженияОблигаций.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ДвиженияОблигаций.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ДвиженияОблигаций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ДвиженияОблигаций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ДвиженияОблигаций.Колонки.Добавить("Облигация",			ОписаниеТипаОблигация);
		ДвиженияОблигаций.Колонки.Добавить("ДатаОперации",		ОписаниеТипаДатаВремя);
		ДвиженияОблигаций.Колонки.Добавить("Количество",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ДвиженияОблигаций.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ДвиженияОблигаций.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ДвиженияОблигаций.Колонки.Добавить("Рынок", 	ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ДвиженияОблигаций", ДвиженияОблигаций);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ДвиженияПаев Тогда
	
		ДвиженияПаев = Новый ТаблицаЗначений;
		ДвиженияПаев.Колонки.Добавить("ДБО",			ОписаниеТипаДБО);
		ДвиженияПаев.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ДвиженияПаев.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ДвиженияПаев.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ДвиженияПаев.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		ДвиженияПаев.Колонки.Добавить("Пай",			ОписаниеТипаПай);
		ДвиженияПаев.Колонки.Добавить("ДатаОперации",	ОписаниеТипаДатаВремя);
		ДвиженияПаев.Колонки.Добавить("Количество",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			ДвиженияПаев.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			ДвиженияПаев.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			ДвиженияПаев.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("ДвиженияПаев", ДвиженияПаев);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОжидаемыеПоступленияАкций Тогда
	
		ОжидаемыеПоступленияАкций = Новый ТаблицаЗначений;
		ОжидаемыеПоступленияАкций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("Акция",				ОписаниеТипаАкция);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("ДатаОперации",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияАкций.Колонки.Добавить("Количество",		ОписаниеТипаЧисло);
		
		Результат.Вставить("ОжидаемыеПоступленияАкций", ОжидаемыеПоступленияАкций);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОжидаемыеПоступленияОблигаций Тогда
	
		ОжидаемыеПоступленияОблигаций = Новый ТаблицаЗначений;
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("ДБО",				ОписаниеТипаДБО);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("НачалоПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("КонецПериода",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("Облигация",			ОписаниеТипаОблигация);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("ДатаОперации",		ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияОблигаций.Колонки.Добавить("Количество",		ОписаниеТипаЧисло);
		
		Результат.Вставить("ОжидаемыеПоступленияОблигаций", ОжидаемыеПоступленияОблигаций);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.ОжидаемыеПоступленияПаев Тогда
	
		ОжидаемыеПоступленияПаев = Новый ТаблицаЗначений;
		ОжидаемыеПоступленияПаев.Колонки.Добавить("ДБО",			ОписаниеТипаДБО);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("СА",				ОписаниеТипаСА);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("ВалютнаяСекция",	ОписаниеТипаБулево);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("НачалоПериода",	ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("КонецПериода",	ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("Пай",			ОписаниеТипаПай);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("ДатаОперации",	ОписаниеТипаДатаВремя);
		ОжидаемыеПоступленияПаев.Колонки.Добавить("Количество",		ОписаниеТипаЧисло);
		
		Результат.Вставить("ОжидаемыеПоступленияПаев", ОжидаемыеПоступленияПаев);		
	
	КонецЕсли;
	
	Если ЗагружаемыеРазделы.СделкиСАкциями Тогда
	
		СделкиСАкциями = Новый ТаблицаЗначений;
		СделкиСАкциями.Колонки.Добавить("ДБО",						ОписаниеТипаДБО);
		СделкиСАкциями.Колонки.Добавить("СА",						ОписаниеТипаСА);
		СделкиСАкциями.Колонки.Добавить("ВалютнаяСекция",			ОписаниеТипаБулево);
		СделкиСАкциями.Колонки.Добавить("НачалоПериода",			ОписаниеТипаДатаВремя);
		СделкиСАкциями.Колонки.Добавить("КонецПериода",				ОписаниеТипаДатаВремя);
		СделкиСАкциями.Колонки.Добавить("ДатаВремяСделки",			ОписаниеТипаДатаВремя);
		СделкиСАкциями.Колонки.Добавить("МестоЗаключенияСделки",	ОписаниеТипаСтрока250);
		СделкиСАкциями.Колонки.Добавить("Акция",					ОписаниеТипаАкция);
		СделкиСАкциями.Колонки.Добавить("ВидОперации",				ОписаниеТипаСтрока250);
		СделкиСАкциями.Колонки.Добавить("ДопУсловия",				ОписаниеТипаСтрока250);
		СделкиСАкциями.Колонки.Добавить("Количество",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		СделкиСАкциями.Колонки.Добавить("Цена",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		СделкиСАкциями.Колонки.Добавить("Сумма",					ОписаниеТипаЧисло);
		СделкиСАкциями.Колонки.Добавить("СтавкаРЕПО",				ОписаниеТипаЧисло);
		СделкиСАкциями.Колонки.Добавить("ВалютаЦены",				ОписаниеТипаВалюты);
		СделкиСАкциями.Колонки.Добавить("ВалютаРасчетов",			ОписаниеТипаВалюты);
		СделкиСАкциями.Колонки.Добавить("СуммаСделкиРасчетная",		ОписаниеТипаЧисло);
		СделкиСАкциями.Колонки.Добавить("БиржеваяКомиссия",			ОписаниеТипаЧисло);
		СделкиСАкциями.Колонки.Добавить("БрокерскаяКомиссия",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			СделкиСАкциями.Колонки.Добавить("РегНомер", ОписаниеТипаСтрока250);
			СделкиСАкциями.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			СделкиСАкциями.Колонки.Добавить("Рынок", 	ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("СделкиСАкциями", СделкиСАкциями);
	
	КонецЕсли; 

	Если ЗагружаемыеРазделы.СделкиСОблигациями Тогда
	
		СделкиСОблигациями = Новый ТаблицаЗначений;
		СделкиСОблигациями.Колонки.Добавить("ДБО",						ОписаниеТипаДБО);
		СделкиСОблигациями.Колонки.Добавить("СА",						ОписаниеТипаСА);
		СделкиСОблигациями.Колонки.Добавить("ВалютнаяСекция",			ОписаниеТипаБулево);
		СделкиСОблигациями.Колонки.Добавить("НачалоПериода",			ОписаниеТипаДатаВремя);
		СделкиСОблигациями.Колонки.Добавить("КонецПериода",				ОписаниеТипаДатаВремя);
		СделкиСОблигациями.Колонки.Добавить("ДатаВремяСделки",			ОписаниеТипаДатаВремя);
		СделкиСОблигациями.Колонки.Добавить("МестоЗаключенияСделки",	ОписаниеТипаСтрока250);
		СделкиСОблигациями.Колонки.Добавить("Облигация",				ОписаниеТипаОблигация);
		СделкиСОблигациями.Колонки.Добавить("ВидОперации",				ОписаниеТипаСтрока250);
		СделкиСОблигациями.Колонки.Добавить("ДопУсловия",				ОписаниеТипаСтрока250);
		СделкиСОблигациями.Колонки.Добавить("Количество",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		СделкиСОблигациями.Колонки.Добавить("Цена",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		СделкиСОблигациями.Колонки.Добавить("Сумма",					ОписаниеТипаЧисло);
		СделкиСОблигациями.Колонки.Добавить("НКД",						ОписаниеТипаЧисло);
		СделкиСОблигациями.Колонки.Добавить("СтавкаРЕПО",				ОписаниеТипаЧисло);
		СделкиСОблигациями.Колонки.Добавить("ВалютаЦены",				ОписаниеТипаВалюты);
		СделкиСОблигациями.Колонки.Добавить("ВалютаРасчетов",			ОписаниеТипаВалюты);
		СделкиСОблигациями.Колонки.Добавить("СуммаСделкиРасчетная",		ОписаниеТипаЧисло);
		СделкиСОблигациями.Колонки.Добавить("БиржеваяКомиссия",			ОписаниеТипаЧисло);
		СделкиСОблигациями.Колонки.Добавить("БрокерскаяКомиссия",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			СделкиСОблигациями.Колонки.Добавить("РегНомер", ОписаниеТипаСтрока250);
			СделкиСОблигациями.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			СделкиСОблигациями.Колонки.Добавить("Рынок", 	ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("СделкиСОблигациями", СделкиСОблигациями);
	
	КонецЕсли; 
	
	Если ЗагружаемыеРазделы.СделкиСПаями Тогда
	
		СделкиСПаями = Новый ТаблицаЗначений;
		СделкиСПаями.Колонки.Добавить("ДБО",					ОписаниеТипаДБО);
		СделкиСПаями.Колонки.Добавить("СА",						ОписаниеТипаСА);
		СделкиСПаями.Колонки.Добавить("ВалютнаяСекция",			ОписаниеТипаБулево);
		СделкиСПаями.Колонки.Добавить("НачалоПериода",			ОписаниеТипаДатаВремя);
		СделкиСПаями.Колонки.Добавить("КонецПериода",			ОписаниеТипаДатаВремя);
		СделкиСПаями.Колонки.Добавить("ДатаВремяСделки",		ОписаниеТипаДатаВремя);
		СделкиСПаями.Колонки.Добавить("МестоЗаключенияСделки",	ОписаниеТипаСтрока250);
		СделкиСПаями.Колонки.Добавить("Пай",					ОписаниеТипаПай);
		СделкиСПаями.Колонки.Добавить("ВидОперации",			ОписаниеТипаСтрока250);
		СделкиСПаями.Колонки.Добавить("ДопУсловия",				ОписаниеТипаСтрока250);
		СделкиСПаями.Колонки.Добавить("Количество",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		СделкиСПаями.Колонки.Добавить("Цена",					Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		СделкиСПаями.Колонки.Добавить("Сумма",					ОписаниеТипаЧисло);
		СделкиСПаями.Колонки.Добавить("СтавкаРЕПО",				ОписаниеТипаЧисло);
		СделкиСПаями.Колонки.Добавить("ВалютаЦены",				ОписаниеТипаВалюты);
		СделкиСПаями.Колонки.Добавить("ВалютаРасчетов",			ОписаниеТипаВалюты);
		СделкиСПаями.Колонки.Добавить("БиржеваяКомиссия",		ОписаниеТипаЧисло);
		СделкиСПаями.Колонки.Добавить("БрокерскаяКомиссия",		ОписаниеТипаЧисло);
		
		Если Не ПропускатьСтрокиЕслиЦБНеНайдена Тогда
			СделкиСПаями.Колонки.Добавить("РегНомер", 	ОписаниеТипаСтрока250);
			СделкиСПаями.Колонки.Добавить("Эмитент", 	ОписаниеТипаСтрока250);
			СделкиСПаями.Колонки.Добавить("Рынок", 		ОписаниеТипаСтрока21);
		КонецЕсли; 
		
		Результат.Вставить("СделкиСПаями", СделкиСПаями);
	
	КонецЕсли; 
	
	Результат.Вставить("ВремяПолученияДанных", Новый Соответствие);	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетДУ(Организация, Брокер, ДатаОтчета, Код, ОтборСчетаДУ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Брокер"      , Брокер);
	Запрос.УстановитьПараметр("ДатаОтчета"  , ДатаОтчета);
	Запрос.УстановитьПараметр("Код"         , Код);
	Запрос.УстановитьПараметр("ОтборПоСчету", ?(ОтборСчетаДУ = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("МассивСчетов", ?(ОтборСчетаДУ = Неопределено, Новый Массив, ОтборСчетаДУ));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СДУ,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК Договор,
		|	ВЫБОР
		|		КОГДА &ОтборПоСчету
		|			ТОГДА ВЫБОР
		|					КОГДА КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления В (&МассивСчетов)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ФлСверятьДанныеПоСубъекту
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаОтчета,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|ГДЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код = &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА &ОтборПоСчету
		|				ТОГДА ВЫБОР
		|						КОГДА СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления В (&МассивСчетов)
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ)
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаОтчета, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|ГДЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойКодУБрокера = &Код
		|	И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокер = &Брокер
		|
		|СГРУППИРОВАТЬ ПО
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		И ЗначениеЗаполнено(Выборка.СДУ)
		И ЗначениеЗаполнено(Выборка.Договор) Тогда
		Возврат Новый Структура("СубъектАналитики, Договор, СверятьДанныеПоСубъекту", Выборка.СДУ, Выборка.Договор, Выборка.ФлСверятьДанныеПоСубъекту);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДоговорБО(Организация, Брокер, Номер, Дата, ДатаОтчета, ОтборСчетаДУ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Контрагент"  , Брокер.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Номер"       , Номер);
	Запрос.УстановитьПараметр("Дата"        , Дата);
	Запрос.УстановитьПараметр("ДатаОтчета"  , ДатаОтчета);
	Запрос.УстановитьПараметр("ОтборПоСчету", ?(ОтборСчетаДУ = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("МассивСчетов", ?(ОтборСчетаДУ = Неопределено, Новый Массив, ОтборСчетаДУ));

	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия,
	    |	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор КАК Договор,
	    |	МАКСИМУМ(ВЫБОР
	    |			КОГДА &ОтборПоСчету
	    |				ТОГДА ВЫБОР
	    |						КОГДА СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления В (&МассивСчетов)
	    |							ТОГДА ИСТИНА
	    |						ИНАЧЕ ЛОЖЬ
	    |					КОНЕЦ
	    |			ИНАЧЕ ИСТИНА
	    |		КОНЕЦ) КАК ФлСверятьДанныеПоСубъекту
	    |ИЗ
	    |	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаОтчета, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
	    |ГДЕ
	    |	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор.Организация = &Организация
	    |	И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор.Контрагент = &Контрагент
	    |	И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор.НомерДоговора = &Номер
	    |	И СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор.ДатаЗаключения = &Дата
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия,
	    |	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.ОсновнойБрокерскийДоговор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Договор, СубъектАналитики, СверятьДанныеПоСубъекту", Выборка.Договор, Выборка.Стратегия, Выборка.ФлСверятьДанныеПоСубъекту);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВалютуПоНаименованию(СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	(Валюты.Наименование = &СтрокаПоиска
		|			ИЛИ Валюты.НаименованиеПолное = &СтрокаПоиска)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Валюта;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипКомиссии(ТипКомиссииСтрокой)
	
	Если ТипКомиссииСтрокой = "КОМИССИЯ БИРЖИ" Тогда
		Возврат "Торговая комиссия";
	ИначеЕсли ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ БРОКЕРСКОЙ КОМИССИИ ПО ЭМИССИОННЫМ ЦЕННЫМ БУМАГАМ"
		ИЛИ ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ БРОКЕРСКОЙ КОМИССИИ ПО ВЕКСЕЛЯМ"
		ИЛИ ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ КОМИССИИ ЗА РЕПО"
		ИЛИ ТипКомиссииСтрокой = "КОМИССИЯ БРОКЕРА ЗА ОПЕРАЦИИ НА ВАЛЮТНОМ РЫНКЕ"
		ИЛИ ТипКомиссииСтрокой = "КОМИССИЯ БРОКЕРА ЗА ОПЕРАЦИИ НА ВАЛЮТНОМ РЫНКЕ И РЫНКЕ ДРАГОЦЕННЫХ МЕТАЛЛОВ"
		ИЛИ ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ БРОКЕРСКОЙ КОМИССИИ ПО СРОЧНОМУ РЫНКУ"
		ИЛИ ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ БРОКЕРСКОЙ КОМИССИ ПО СРОЧНОМУ РЫНКУ" //была ошибка в отчете брокера - КОМИССИ
		ИЛИ ТипКомиссииСтрокой = "КОМИССИЯ ЗА КЛИРИНГ"
		ИЛИ ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ ЗА ПОСРЕДНИЧЕСКИЕ УСЛУГИ"
		ИЛИ ТипКомиссииСтрокой = "ВОЗМЕЩЕНИЕ РАСХОДОВ БРОКЕРА" Тогда
		Возврат "Брокерская комиссия";
	ИначеЕсли ТипКомиссииСтрокой = "НАЧИСЛЕНИЕ ДЕПОЗИТАРНЫХ УСЛУГ" Тогда
		Возврат "Депозитарная комиссия"
	Иначе
		Возврат "Прочее";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦеннуюБумагу(Тип, Код)
	
	Если Код = "не предусмотрен" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить ценную бумагу по коду '%1'!", Код));
		Возврат Неопределено;
	ИначеЕсли Код = "1-04-33498-E"
		И Тип = "Акция" Тогда
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАО");
	КонецЕсли;
	
	Если Тип = "Акция" Тогда
		Алиас = "Акции";
		ИмяПоляРегНомер = "ГосударственныйРегистрационныйНомер";
		ТипДляСообщения = "акцию";
		ТипДляСообщенияОДублях = "акций";
	ИначеЕсли Тип = "Облигация" Тогда
		Алиас = "Облигации";
		ИмяПоляРегНомер = "ГосударственныйРегистрационныйНомер";
		ТипДляСообщения = "облигацию";
		ТипДляСообщенияОДублях = "облигаций";
	ИначеЕсли Тип = "Пай" Тогда
		Алиас = "Паи";
		ИмяПоляРегНомер = "ГосударственныйРегистрационныйНомер";
		ТипДляСообщения = "пай";
		ТипДляСообщенияОДублях = "паев";
	ИначеЕсли Тип = "ДепозитарнаяРасписка" Тогда
		Алиас = "ДепозитарныеРасписки";
		ИмяПоляРегНомер = "РегистрационныйНомер";
		ТипДляСообщения = "депозитарная расписка";
		ТипДляСообщенияОДублях = "депозитарных расписок";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сверка по ценным бумагам производится только по акциям, облигациям или паям!");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	" + Алиас + ".Ссылка КАК ЦеннаяБумага
		|ИЗ
		|	Справочник." + Алиас + " КАК " + Алиас + "
		|ГДЕ
		|	" + Алиас + "." + ИмяПоляРегНомер + " = &Код
		|	И НЕ " + Алиас + ".ПометкаУдаления
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КодыВТорговыхСистемахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			,
		|			Объект ССЫЛКА Справочник." + Алиас + "
		|				И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|ГДЕ
		|	КодыВТорговыхСистемахСрезПоследних.Код = &Код
		|	И НЕ КодыВТорговыхСистемахСрезПоследних.Объект.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("По гос. рег. номеру / ISIN '%1' обнаружено несколько %2!", Код, ТипДляСообщенияОДублях));
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦеннаяБумага;
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить %1 по гос. рег. номеру / ISIN '%2'!", ТипДляСообщения, Код));
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦеннуюБумагуПоКодуIsin(КодIsin)
	
	КодIsin = Врег(КодIsin);
	
	Если КодIsin = "НЕ ПРЕДУСМОТРЕН" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить ценную бумагу по коду ISIN '%1'!", КодIsin));
		Возврат Неопределено;
		
	ИначеЕсли КодIsin = "RU000A0JPNM1" Тогда
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАО");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			,
		|		 ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|ГДЕ
		|	КодыВТорговыхСистемахСрезПоследних.Код = &КодIsin
		|	И НЕ КодыВТорговыхСистемахСрезПоследних.Объект.ПометкаУдаления";
	
	
	Запрос.УстановитьПараметр("КодIsin", КодIsin);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("По коду ISIN '%1' обнаружено несколько ценных бумаг!", КодIsin));
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦеннаяБумага;
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось ценную бумагу по коду ISIN '%1'!", КодIsin));
		
		Возврат Неопределено;
		
	КонецЕсли;

КонецФункции

Функция ПолучитьЦеннуюБумагуПоКоду(Код, Серия)
	
	Если Код = "1-04-33498-E" Тогда // в справочние 1С присутствуют две бумаги с таким кодом 
		Возврат ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАО");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Код"  , Код);
	Запрос.УстановитьПараметр("Серия", Серия);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Акции.Ссылка КАК ЦеннаяБумага
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.ГосударственныйРегистрационныйНомер = &Код
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Облигации.Ссылка
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|ГДЕ
		|	Облигации.ГосударственныйРегистрационныйНомер = &Код
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Паи.Ссылка
		|ИЗ
		|	Справочник.Паи КАК Паи
		|ГДЕ
		|	Паи.ГосударственныйРегистрационныйНомер = &Код
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Векселя.Ссылка
		|ИЗ
		|	Справочник.Векселя КАК Векселя
		|ГДЕ
		|	Векселя.Номер = &Код И Векселя.Серия = &Серия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|ГДЕ
		|	КодыВТорговыхСистемахСрезПоследних.Код = &Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда // Нашли ЦБ.
		Выборка.Следующий();
		Возврат Выборка.ЦеннаяБумага;
	ИначеЕсли Выборка.Количество() = 0 Тогда // Не нашли ЦБ.
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить ценную бумагу по коду '%1'!", Код));
		Возврат Неопределено;
	ИначеЕсли Выборка.Количество() > 1 Тогда // Нашли несколько ЦБ.
		Выборка.Следующий();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось определить ценную бумагу. По коду '%1' найдено несколько ценных бумаг.", Код));
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтроку(Текст, Индекс, Смещение = 1)
	
	Индекс = Индекс + Смещение;
	
	Результат = СтрЗаменить(СокрЛП(СтрПолучитьСтроку(Текст, Индекс)), Символы.НПП, "");
	
	Если Результат = "</TD>" Тогда
		// такое бывает, когда значение поля пустое, например 
		// <td class="left">
        // </td>
		Возврат ПолучитьСтроку(Текст, Индекс);
	Иначе
		Возврат Результат;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьСодержимоеФайлов(Знач Каталоги, СверкаСМесячнымОтчетомБрокера, ВремяПолученияДанных = Неопределено)
	
	// Результат теперь возвращает массив структур (ДатаСоздания, Данные):
	//  ДатаСоздания - Дата		- наименьшее из даты создания и даты изменения файла.
	//							  Файлы из архива наследуют даты.
	//  Данные		 - Строка	- текст файла
	
	Результат	 = Новый Массив;
	Файлы		 = Новый Массив;
	
	Если ЭтоАдресВременногоХранилища(Каталоги) Тогда
		
		ПараметрыФайла = ПолучитьИзВременногоХранилища(Каталоги);
		ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла(ПараметрыФайла.Расширение);
		ПараметрыФайла.ДвоичныеДанные.Записать(ПутьКВременномуФайлу);
		
		ОбъектФайл = Новый Файл(ПутьКВременномуФайлу);
		ЗаполнитьФайлы(ОбъектФайл, Файлы, Каталоги);
		
	Иначе
		
		МассивКаталогов = СтрРазделить(Каталоги, Символ(0182));
				
		Для Каждого Каталог ИЗ МассивКаталогов Цикл
			ОбъектФайл = Новый Файл(Каталог);
			ЗаполнитьФайлы(ОбъектФайл, Файлы, Каталог);
		КонецЦикла;
				
	КонецЕсли;

	Для Каждого ТекФайл Из Файлы Цикл
		
		Если ТекФайл.Расширение = ".zip" Тогда
			
			ПутьКФайламИзАрхива = КаталогВременныхФайлов() + ТекФайл.ИмяБезРасширения;
			
			ЧтениеZIP = Новый ЧтениеZipФайла(ТекФайл.ПолноеИмя);
			
			Попытка
				ЧтениеZIP.ИзвлечьВсе(ПутьКФайламИзАрхива, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			Исключение
				Сообщить("Ошибка при распаковке архива '" + ТекФайл.ПолноеИмя + "':" + Символы.ПС + ОписаниеОшибки());
				Возврат Неопределено;
			КонецПопытки;
			
			ВремяПолученияФайла = ?(ВремяПолученияДанных = Неопределено, ОпределитьДатуСозданияФайла(ТекФайл.ПолноеИмя), ВремяПолученияДанных);	
			
			СодержимоеФайлов = ПолучитьСодержимоеФайлов(ПутьКФайламИзАрхива, СверкаСМесячнымОтчетомБрокера, ВремяПолученияФайла);
			
			Если СодержимоеФайлов <> Неопределено Тогда
				РаботаСКоллекциями.ДополнитьМассив(Результат, СодержимоеФайлов);
			КонецЕсли;
			
			УдалитьФайлы(ПутьКФайламИзАрхива);
			
		ИначеЕсли ТекФайл.Расширение = ".htm" ИЛИ ТекФайл.Расширение = ".html" Тогда
			
			ТД = Новый ТекстовыйДокумент;
			
			Попытка
				ТД.Прочитать(ТекФайл.ПолноеИмя);
			Исключение
				Сообщить("Ошибка при чтении файла '" + ТекФайл.ПолноеИмя + "':" + Символы.ПС + ОписаниеОшибки());
				Возврат Неопределено;
			КонецПопытки;
			
			ВремяПолученияФайла = ?(ВремяПолученияДанных = Неопределено, ОпределитьДатуСозданияФайла(ТекФайл.ПолноеИмя), ВремяПолученияДанных);	
			
			Результат.Добавить(Новый Структура("ВремяПолученияДанных, Данные", ВремяПолученияФайла, СтрЗаменить(ТД.ПолучитьТекст(), "&nbsp;", "")));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоАдресВременногоХранилища(Каталог) Тогда
		УдалитьФайлы(ПутьКВременномуФайлу);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьФайлы(ОбъектФайл, Файлы, Каталог)
	
	Если ОбъектФайл.Существует() И ОбъектФайл.ЭтоКаталог() Тогда
		
		ФайлыТекущегоКаталога = НайтиФайлы(Каталог, "*", Истина);
		
		Для Каждого Файл Из ФайлыТекущегоКаталога Цикл
			Файлы.Добавить(Файл);
		КонецЦикла;
		
	Иначе
		Если ОбъектФайл.Существует() Тогда
			Файлы.Добавить(ОбъектФайл);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ОпределитьДатуСозданияФайла(ПолноеИмяФайла)
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	ДатаИзменения = Файл.ПолучитьВремяИзменения();
	
	Попытка
		FSO = Новый COMОбъект("Scripting.FileSystemObject");
		ДатаСоздания = FSO.GetFile(ПолноеИмяФайла).DateCreated;
	Исключение
		ДатаСоздания = Неопределено;
	КонецПопытки;
	
	Если ДатаСоздания = Неопределено Тогда
		ДатаСоздания = ДатаИзменения;
	Иначе
		ДатаСоздания = Мин(ДатаСоздания, ДатаИзменения);
	КонецЕсли;
	
	Возврат ДатаСоздания;
	
КонецФункции

Функция ПолучитьНовуюСтрокуДанныхОтчета(ДоговорБрокерскогоОбслуживания, СубъектАналитики, ВалютнаяСекция, НачалоПериода, КонецПериода)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДБО",				ДоговорБрокерскогоОбслуживания);
	Результат.Вставить("СА",				СубъектАналитики);
	Результат.Вставить("ВалютнаяСекция",	ВалютнаяСекция);
	Результат.Вставить("НачалоПериода",		НачалоПериода);
	Результат.Вставить("КонецПериода",		КонецПериода);
	
	Возврат Результат;
	
КонецФункции

Функция ДесериализоватьДанныеОтчета(НачалоПериода, КонецПериода, ТекстФайла, Организация, Брокер, КешОбъектов, ЗагружаемыеРазделы, ПропускатьСтрокиЕслиЦБНеНайдена, СверкаСМесячнымОтчетомБрокера, ОтборСчетаДУ = Неопределено, ЕстьДанныеЗаПериод = Ложь)
	
	ТекстФайла = ВРег(ТекстФайла);
	
	Результат = Новый Структура;
	
	ДатаФормированияОтчетаОпределена            = Не ЗагружаемыеРазделы.ДатаФормированияОтчета;
	ПериодОтчетаОпределен						= Не ЗагружаемыеРазделы.ДатаОтчета;
	ДБОИСАОпределены							= Не ЗагружаемыеРазделы.ДБОИСА;
	ОстаткиОбработаны							= Не ЗагружаемыеРазделы.ОстаткиДенежныхСредств;
	ОбязательстваОбработаны						= Не ЗагружаемыеРазделы.ОбязательстваПоДенежнымСредствам;
	КомиссияОбработана							= Не (ЗагружаемыеРазделы.ОстаткиЗадолженностиПоКомиссииНаНачало Или ЗагружаемыеРазделы.ОстаткиЗадолженностиПоКомиссииНаКонец Или ЗагружаемыеРазделы.НачисленнаяКомиссияЗаПериод Или ЗагружаемыеРазделы.ОплаченнаяКомиссияЗаПериод);
	ДвиженияОбработаны							= Не ЗагружаемыеРазделы.ДвиженияДенежныхСредств;
	ЗаблокированныеДСОбработаны					= Не ЗагружаемыеРазделы.ЗаблокированныеДенежныеСредства;
	ДСКПоступлениюОбработаны					= Не ЗагружаемыеРазделы.ОжидаемыеПоступленияДенежныхСредств;
	КонверсионныеСделкиОбработаны				= Не ЗагружаемыеРазделы.КонверсионныеСделки;
	НезавершенныеКонверсионныеСделкиОбработаны	= Не ЗагружаемыеРазделы.НезавершенныеКонверсионныеСделки;
	ОстаткиЦБОбработаны							= Не (ЗагружаемыеРазделы.ОстаткиАкций Или ЗагружаемыеРазделы.ОстаткиОблигаций Или ЗагружаемыеРазделы.ОстаткиПаев 
													Или ЗагружаемыеРазделы.ЗаблокированныеАкции Или ЗагружаемыеРазделы.ЗаблокированныеОблигации Или ЗагружаемыеРазделы.ЗаблокированныеПаи);
	ЗадолженностьПоЦБОбработана					= Не ЗагружаемыеРазделы.ЗадолженностьПоЦБ;
	ДвиженияЦБОбработаны						= Не (ЗагружаемыеРазделы.ДвиженияАкций Или ЗагружаемыеРазделы.ДвиженияОблигаций Или ЗагружаемыеРазделы.ДвиженияПаев);
	ОжидаемыеПоступленияЦБОбработаны			= Не (ЗагружаемыеРазделы.ОжидаемыеПоступленияАкций Или ЗагружаемыеРазделы.ОжидаемыеПоступленияОблигаций Или ЗагружаемыеРазделы.ОжидаемыеПоступленияПаев);
	СделкиСЦБОбработаны							= Не (ЗагружаемыеРазделы.СделкиСАкциями Или ЗагружаемыеРазделы.СделкиСОблигациями Или ЗагружаемыеРазделы.СделкиСПаями);
	
	ДатаОтчета		= Неопределено;
	ДБО				= Неопределено;
	СА				= Неопределено;
	       					
	Для ИндексСтроки = 1 По СтрЧислоСтрок(ТекстФайла) Цикл
		
		Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 0);
		
		Если СтрНайти(Строка, "</HTML>") <> 0
			Или СтрНайти(Строка, "<H4>ДВИЖЕНИЕ ЦЕННЫХ БУМАГ (СПИСАНИЕ / ЗАЧИСЛЕНИЕ):</H4>") <> 0 
			Или СтрНайти(Строка, "СДЕЛКИ СО СРОЧНЫМИ КОНТРАКТАМИ ПО СЧЕТУ КЛИЕНТА ЗА ОТЧЕТНЫЙ ПЕРИОД (ФЬЮЧЕРСЫ):") <> 0
			Или (СделкиСЦБОбработаны И КонверсионныеСделкиОбработаны И НезавершенныеКонверсионныеСделкиОбработаны
				И СтрНайти(Строка, "<H5>СДЕЛКИ С ЦЕННЫМИ БУМАГАМИ ПО СЧЕТУ КЛИЕНТА ЗА ОТЧЕТНЫЙ ПЕРИОД:</H5>") > 0) Тогда
			
			Прервать;
			
		КонецЕсли;
		
		#Область ОпределениеДатыОтчета
		
		// Определяем дату формирования отчета
		Если Не ДатаФормированияОтчетаОпределена Тогда
			
			Если СтрНайти(Строка, "ДАТА:") > 0 Тогда
				// сама дата содержится в следующей строке
				ДатаФормированияОтчета = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				ДатаФормированияОтчета = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаФормированияОтчета, 10));
				
				Результат.Вставить("ДатаФормированияОтчета", ДатаФормированияОтчета);
				
				ДатаФормированияОтчетаОпределена = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем дату и период отчета.
		Если НЕ ПериодОтчетаОпределен Тогда
			
			Если СтрНайти(Строка, "ОТЧЕТ КЛИЕНТУ ЗА ПЕРИОД С") > 0 Тогда
				
				ПериодОтчетаОпределен = Истина;
				
				// Определяем начало периода отчета.
				Строка				= ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				НачалоПериодаОтчета	= Дата(Сред(Строка, 7, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
				ДатаОтчета			= КонецПериода;
				
				// Определяем конец периода отчета.
				Строка				= ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, ".") = 0 Тогда
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				КонецЕсли;
				
				Строка = СтрЗаменить(Строка, " ", "");
				Строка = СтрЗаменить(Строка, "ПО", "");
				Строка = СтрЗаменить(Строка, Символы.ПС, "");
				
				КонецПериодаОтчета	= Дата(Сред(Строка, 7, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
				
				// Проверяем соответствие периода сверки с датой отчета.
				Если СверкаСМесячнымОтчетомБрокера
						И (НачалоПериодаОтчета <> НачалоПериода
							ИЛИ КонецМесяца(КонецПериодаОтчета) <> КонецПериода)
					ИЛИ НЕ СверкаСМесячнымОтчетомБрокера
							И (НачалоПериодаОтчета <> НачалоПериода
								ИЛИ КонецДня(КонецПериодаОтчета) <> КонецПериода) Тогда
					Возврат Неопределено;
				КонецЕсли;
				
				Результат.Вставить("НачалоПериода",	НачалоПериодаОтчета);
				Результат.Вставить("КонецПериода",	КонецПериодаОтчета);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		#КонецОбласти
		#Область ОпределениеДБОИСДУ
		
		// Определяем договор брокерского обслуживания и счет доверительного управления.
		Если НЕ ДБОИСАОпределены Тогда
			
			Если СтрНайти(Строка, "НОМЕР ИНВЕСТИЦИОННОГО СЧЕТА:") > 0 Тогда
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
			 	КодСДУ = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "</TD>", ""), "<TD>", ""), "</TR>", "");
				    								
				Если Прав(КодСДУ, 1) = "V" Тогда
					ВалютнаяСекция = Истина;
					КодСДУ = СтрЗаменить(КодСДУ, "V", "");
				Иначе
					ВалютнаяСекция = Ложь;
				КонецЕсли;
				
				Результат.Вставить("Валютный", ВалютнаяСекция);
				
				ДанныеСДУ = ПолучитьСчетДУ(Организация, Брокер, ДатаОтчета, КодСДУ, ОтборСчетаДУ);
				
				Если ДанныеСДУ <> Неопределено Тогда
					
					СА	= ДанныеСДУ.СубъектАналитики;
					ДБО	= ДанныеСДУ.Договор;
					
					ДБОИСАОпределены = Истина;
					
					Если Не ДанныеСДУ.СверятьДанныеПоСубъекту Тогда
						//не удовл. усл. отбора, но файлы есть 
						ЕстьДанныеЗаПериод = Истина;
						Возврат Неопределено;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли СтрНайти(Строка, "СОГЛАШЕНИЕ О БРОКЕРСКОМ ОБСЛУЖИВАНИИ:") > 0 Тогда
				//Получаем номер ДБО
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				НомерДБО = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD>", ""), " ОТ", ""), " ", "");
				
				// Получаем дату ДБО
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, ".") = 0 Тогда
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				КонецЕсли;
				
				Строка = Лев(Строка, СтрНайти(Строка, "</TD>") - 1);
				
				ДатаДБО = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
				
				ДанныеОДоговоре = ПолучитьДоговорБО(Организация, Брокер, НомерДБО, ДатаДБО, ДатаОтчета, ОтборСчетаДУ);
				
				Если ДанныеОДоговоре = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить договор брокерского обслуживания с № " + НомерДБО + " и датой " + Формат(ДатаДБО, "ДФ=dd.MM.yyyy") + "! Сверка с данным отчетом брокера не будет произведена.");
					Прервать;
				КонецЕсли;
				
				ДБО	= ДанныеОДоговоре.Договор;
				СА	= ДанныеОДоговоре.СубъектАналитики;
				ДБОИСАОпределены = Истина;
				
				Если Не ДанныеОДоговоре.СверятьДанныеПоСубъекту Тогда
					ЕстьДанныеЗаПериод = Истина;
					Возврат Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
			Результат.Вставить("СА", СА);
			Результат.Вставить("ДБО", ДБО);
			
			Продолжить;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеОстатковДС
		// Определяем остаток ДС.
		Если Не ОстаткиОбработаны Тогда
			
			Если СтрНайти(Строка, "<H5>ОСТАТОК ДЕНЕЖНЫХ СРЕДСТВ") > 0 Тогда
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TABLE") > 0 Тогда
					
					Остатки = Новый Массив;
					
					ОбработкаОстатковДС = Истина;
					
					Пока ОбработкаОстатковДС Цикл
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "ВХОДЯЩИЙ ОСТАТОК ДС НА НАЧАЛО ПЕРИОДА,") > 0 Тогда
							
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
							
							Код = Лев(Строка, 3);
							
							Валюта = КешОбъектов.Валюты.Получить(Код);
							
							Если Валюта = Неопределено Тогда
								Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
								КешОбъектов.Валюты.Вставить(Код, Валюта);
							КонецЕсли;
							
							// Если остатки ДС 0, то расшифровки не будет.
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2);
							НачальныйОстаток = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT COLORED"">", ""), "</TD>", ""));
							
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 5);
							КонечныйОстаток = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT COLORED"">", ""), "</TD>", ""));
							
							Если НачальныйОстаток = 0 И КонечныйОстаток = 0 Тогда
								НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
								
								НоваяСтрока.Вставить("ВнебиржевойРынок");
								НоваяСтрока.Вставить("НачальныйОстаток");
								НоваяСтрока.Вставить("КонечныйОстаток");
								НоваяСтрока.Вставить("Валюта", Валюта);
								
								Остатки.Добавить(НоваяСтрока);
								
								Продолжить;
							КонецЕсли;
							
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 7);
							
							ОбработкаОстатковПоВалюте = Истина;
							СмещениеСтроки = 4;
							
							Пока ОбработкаОстатковПоВалюте Цикл
								
								НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
								
								НоваяСтрока.Вставить("ВнебиржевойРынок");
								НоваяСтрока.Вставить("НачальныйОстаток");
								НоваяСтрока.Вставить("КонечныйОстаток");
								НоваяСтрока.Вставить("Валюта", Валюта);
								
								НоваяСтрока.ВнебиржевойРынок = СтрНайти(Строка, "ВНЕБИРЖЕВОЙ РЫНОК") > 0;
								
								Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
								
								НоваяСтрока.НачальныйОстаток = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
								
								Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2 + СмещениеСтроки);
								СмещениеСтроки = 0;
								
								НоваяСтрока.КонечныйОстаток = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
								
								Остатки.Добавить(НоваяСтрока);
								
								Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 3);
								
								Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") = 0 Тогда
									ИндексСтроки = ИндексСтроки - 3;
									ОбработкаОстатковПоВалюте = Ложь;
								КонецЕсли;
								
							КонецЦикла;
							
							Продолжить;
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "</TABLE>") Тогда
							ОбработкаОстатковДС = Ложь;
							ОстаткиОбработаны = Истина;
							Результат.Вставить("ОстаткиДенежныхСредств", Остатки);
						КонецЕсли;
						
					КонецЦикла;
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеОбязательствПоДС
		// Определяем обязательства по ДС.
		Если Не ОбязательстваОбработаны И СтрНайти(Строка, "<H5>ОБЯЗАТЕЛЬСТВА ПО ДС") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 9);
			
			ЗадолженностиПоДС = Новый Массив;
			
			ОбработкаЗадолженностиДС = Истина;
				
			Пока ОбработкаЗадолженностиДС Цикл			
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("Валюта");
					НоваяСтрока.Вставить("НачальныйОстаток");
					НоваяСтрока.Вставить("ДебиторскаяЗадолженность");
					НоваяСтрока.Вставить("КредиторскаяЗадолженность");
					НоваяСтрока.Вставить("КонечныйОстаток");
					
					Наименование = СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", "");
					
					Валюта = КешОбъектов.Валюты.Получить(Наименование);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Наименование = "РУБЛЬ РФ", "Российский рубль", Наименование));
						КешОбъектов.Валюты.Вставить(Наименование, Валюта);
						НоваяСтрока.Валюта = Валюта;
					Иначе
						НоваяСтрока.Валюта = Валюта;
					КонецЕсли;
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					НоваяСтрока.НачальныйОстаток = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					НоваяСтрока.ДебиторскаяЗадолженность = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					НоваяСтрока.КредиторскаяЗадолженность = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					НоваяСтрока.КонечныйОстаток = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), "</TR>", ""), "</TBODY>", ""), "</TABLE>", ""));
					
					ЗадолженностиПоДС.Добавить(НоваяСтрока);
					
				КонецЕсли;
				
				Если СтрНайти(Строка, "</TABLE>") Тогда
					ОбработкаЗадолженностиДС = Ложь;
					ОбязательстваОбработаны = Истина;
					Результат.Вставить("ОбязательстваПоДенежнымСредствам", ЗадолженностиПоДС);
				КонецЕсли;
				
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеКомиссии
		// Определяем комиссию за период.
		Если НЕ КомиссияОбработана И СтрНайти(Строка, "<H5>КОМИССИЯ ЗА ОТЧЕТНЫЙ ПЕРИОД:</H5>") > 0 Тогда
			
			ОбработкаКомиссии = Истина;
			
			Пока ОбработкаКомиссии Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				// Блоки по комиссии могут отсутствовать,
				// поэтому, если не обнаружили в текущей строке ни одного блока по комиссии - заканчиваем обработку комиссии
				// и возвращаем индекс строки на предыдущую строку, для нормальной дальнейшей обработки.
				Если СтрНайти(Строка, "<H5>ЗАДОЛЖЕННОСТЬ НА НАЧАЛО ПЕРИОДА:</H5>") = 0
					И СтрНайти(Строка, "<H5>НАЧИСЛЕНО ЗА ПЕРИОД:</H5>") = 0
					И СтрНайти(Строка, "<H5>ОПЛАТА ЗАДОЛЖЕННОСТЕЙ ПО КОМИССИИ ЗА ПЕРИОД:</H5>") = 0
					И СтрНайти(Строка, "<H5>ЗАДОЛЖЕННОСТЬ НА КОНЕЦ ПЕРИОДА:</H5>") = 0 Тогда
					ИндексСтроки = ИндексСтроки - 2;
					ОбработкаКомиссии = Ложь;
					КомиссияОбработана = Истина;
				КонецЕсли;
				
				Если СтрНайти(Строка, "<H5>ЗАДОЛЖЕННОСТЬ НА НАЧАЛО ПЕРИОДА:</H5>") > 0 Тогда
					
					ОстаткиЗадолженностиПоКомиссииНаНачало = Новый Массив;
					
					ОбработкаНачальныхОстатковКомиссии = Истина;
					
					Пока ОбработкаНачальныхОстатковКомиссии Цикл
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "<TD STYLE=""WIDTH:10%"">") > 0 Тогда
						
							// Очередная строка начальных остатков задолженностей по комиисии.
							КодВалюты = СтрЗаменить(СтрЗаменить(Строка, "<TD STYLE=""WIDTH:10%"">", ""), "</TD>", "");
							
							Валюта = КешОбъектов.Валюты.Получить(КодВалюты);
							
							Если Валюта = Неопределено Тогда
								Валюта = ПолучитьВалютуПоНаименованию(?(КодВалюты = "РУБ", "RUB", КодВалюты));
								КешОбъектов.Валюты.Вставить(КодВалюты, Валюта);
							КонецЕсли;
							
							НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрока.Вставить("ТипКомиссии");
							НоваяСтрока.Вставить("Сумма");
							НоваяСтрока.Вставить("Валюта", Валюта);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
							НоваяСтрока.ТипКомиссии = ПолучитьТипКомиссии(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">") > 0 Тогда
							
							НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">", ""), "</TD>", ""));
							
							ОстаткиЗадолженностиПоКомиссииНаНачало.Добавить(НоваяСтрока);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
							ОбработкаНачальныхОстатковКомиссии = Ложь;
							Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаНачало", ОстаткиЗадолженностиПоКомиссииНаНачало);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрНайти(Строка, "<H5>НАЧИСЛЕНО ЗА ПЕРИОД:</H5>") > 0 Тогда
					
					НачисленнаяКомиссияЗаПериод = Новый Массив;
					
					ОбработкаНачисленнойКомиссии = Истина;
					
					Пока ОбработкаНачисленнойКомиссии Цикл
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "<TD STYLE=""WIDTH:10%"">") > 0 Тогда
						
							// Очередная строка начисленной задолженности по комиисии.
							КодВалюты = СтрЗаменить(СтрЗаменить(Строка, "<TD STYLE=""WIDTH:10%"">", ""), "</TD>", "");
							
							Валюта = КешОбъектов.Валюты.Получить(КодВалюты);
							
							Если Валюта = Неопределено Тогда
								Валюта = ПолучитьВалютуПоНаименованию(?(КодВалюты = "РУБ", "RUB", КодВалюты));
								КешОбъектов.Валюты.Вставить(КодВалюты, Валюта);
							КонецЕсли;
							
							НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрока.Вставить("ТипКомиссии");
							НоваяСтрока.Вставить("Сумма");
							НоваяСтрока.Вставить("Валюта", Валюта);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
							НоваяСтрока.ТипКомиссии = ПолучитьТипКомиссии(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">") > 0 Тогда
							
							НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">", ""), "</TD>", ""));
							
							НачисленнаяКомиссияЗаПериод.Добавить(НоваяСтрока);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
							ОбработкаНачисленнойКомиссии = Ложь;
							Результат.Вставить("НачисленнаяКомиссияЗаПериод", НачисленнаяКомиссияЗаПериод);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрНайти(Строка, "<H5>ОПЛАТА ЗАДОЛЖЕННОСТЕЙ ПО КОМИССИИ ЗА ПЕРИОД:</H5>") > 0 Тогда
					
					ОплаченнаяКомиссияЗаПериод = Новый Массив;
					
					ОбработкаОплаченнойКомиссии = Истина;
					
					Пока ОбработкаОплаченнойКомиссии Цикл
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "<TD STYLE=""WIDTH:10%"">") > 0 Тогда
						
							// Очередная строка начисленной задолженности по комиисии.
							КодВалюты = СтрЗаменить(СтрЗаменить(Строка, "<TD STYLE=""WIDTH:10%"">", ""), "</TD>", "");
							
							Валюта = КешОбъектов.Валюты.Получить(КодВалюты);
							
							Если Валюта = Неопределено Тогда
								Валюта = ПолучитьВалютуПоНаименованию(?(КодВалюты = "РУБ", "RUB", КодВалюты));
								КешОбъектов.Валюты.Вставить(КодВалюты, Валюта);
							КонецЕсли;
							
							НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрока.Вставить("ТипКомиссии");
							НоваяСтрока.Вставить("Сумма");
							НоваяСтрока.Вставить("Валюта", Валюта);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
							НоваяСтрока.ТипКомиссии = ПолучитьТипКомиссии(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">") > 0 Тогда
							
							НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">", ""), "</TD>", ""));
							
							ОплаченнаяКомиссияЗаПериод.Добавить(НоваяСтрока);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
							ОбработкаОплаченнойКомиссии = Ложь;
							Результат.Вставить("ОплаченнаяКомиссияЗаПериод", ОплаченнаяКомиссияЗаПериод);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрНайти(Строка, "<H5>ЗАДОЛЖЕННОСТЬ НА КОНЕЦ ПЕРИОДА:</H5>") > 0 Тогда
					
					ОстаткиЗадолженностиПоКомиссииНаКонец = Новый Массив;
					
					ОбработкаКонечныхОстатковКомиссии = Истина;
					
					Пока ОбработкаКонечныхОстатковКомиссии Цикл
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "<TD STYLE=""WIDTH:10%"">") > 0 Тогда
						
							// Очередная строка начальных остатков задолженностей по комиисии.
							КодВалюты = СтрЗаменить(СтрЗаменить(Строка, "<TD STYLE=""WIDTH:10%"">", ""), "</TD>", "");
							
							Валюта = КешОбъектов.Валюты.Получить(КодВалюты);
							
							Если Валюта = Неопределено Тогда
								Валюта = ПолучитьВалютуПоНаименованию(?(КодВалюты = "РУБ", "RUB", КодВалюты));
								КешОбъектов.Валюты.Вставить(КодВалюты, Валюта);
							КонецЕсли;
							
							НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрока.Вставить("ТипКомиссии");
							НоваяСтрока.Вставить("Сумма");
							НоваяСтрока.Вставить("Валюта", Валюта);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
							НоваяСтрока.ТипКомиссии = ПолучитьТипКомиссии(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						КонецЕсли;
						
						Если СтрНайти(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">") > 0 Тогда
							
							НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"" STYLE=""WIDTH:25%"">", ""), "</TD>", ""));
							
							ОстаткиЗадолженностиПоКомиссииНаКонец.Добавить(НоваяСтрока);
							
						КонецЕсли;
						
						Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
							ОбработкаКонечныхОстатковКомиссии	= Ложь;
							Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаКонец", ОстаткиЗадолженностиПоКомиссииНаКонец);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеДвиженийДС
		// Определяем списания / зачисления ДС.
		Если НЕ ДвиженияОбработаны И СтрНайти(Строка, "<H5>СПИСАНИЕ / ЗАЧИСЛЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 9);
			
			ОбработкаДвижений = Истина;
			
			Движения = Новый Массив;
			
			Пока ОбработкаДвижений Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TD>") > 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("Валюта");
					НоваяСтрока.Вставить("Приход");
					НоваяСтрока.Вставить("Расход");
					
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", "");
					Код = Прав(Строка, 3);
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
						НоваяСтрока.Валюта = Валюта;
					Иначе
						НоваяСтрока.Валюта = Валюта;
					КонецЕсли;
					
					НоваяСтрока.Приход = Число(Лев(Строка, СтрДлина(Строка) - 4));
					
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", "");
					НоваяСтрока.Расход = Число(Лев(Строка, СтрДлина(Строка) - 4));
					
					Движения.Добавить(НоваяСтрока);
					
				КонецЕсли;
					
				Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
					ОбработкаДвижений = Ложь;
					ДвиженияОбработаны = Истина;
					Результат.Вставить("ДвиженияДенежныхСредств", Движения);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеЗаблокированныхДС
		// Определяем заблокированные ДС.
		Если НЕ ЗаблокированныеДСОбработаны И СтрНайти(Строка, "<H5>ЗАБЛОКИРОВАННЫЕ ДЕНЕЖНЫЕ СРЕДСТВА ДЛЯ ИСПОЛНЕНИЯ ПОРУЧЕНИЙ И ОБЯЗАТЕЛЬСТВ ПО СДЕЛКАМ:</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 7);
			
			ОбработкаЗаблокированныхДС = Истина;
			
			ЗаблокированныеДС = Новый Массив;
			
			Пока ОбработкаЗаблокированныхДС Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TD>") > 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("Валюта");
					НоваяСтрока.Вставить("Сумма");
					
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", "");
					Код = Прав(Строка, 3);
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
						НоваяСтрока.Валюта = Валюта;
					Иначе
						НоваяСтрока.Валюта = Валюта;
					КонецЕсли;
					
					НоваяСтрока.Сумма = Число(Лев(Строка, СтрДлина(Строка) - 4));
					
					ЗаблокированныеДС.Добавить(НоваяСтрока);
					
				КонецЕсли;
					
				Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
					ОбработкаЗаблокированныхДС = Ложь;
					ЗаблокированныеДСОбработаны = Истина;
					Результат.Вставить("ЗаблокированныеДенежныеСредства", ЗаблокированныеДС);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		#КонецОбласти
		#Область ОпределениеДСКПоступлению
		// Определяем ДС к поступлению.
		Если НЕ ДСКПоступлениюОбработаны И СтрНайти(Строка, "<H5>ОЖИДАЕМЫЕ ПОСТУПЛЕНИЯ ДЕНЕЖНЫХ СРЕДСТВ ПО ИСПОЛНЕННЫМ ПОРУЧЕНИЯМ И СДЕЛКАМ:</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 7);
			
			ОбработкаДСКПоступлению = Истина;
			
			ДСКПоступлению = Новый Массив;
			
			Пока ОбработкаДСКПоступлению Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TD>") > 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("Валюта");
					НоваяСтрока.Вставить("Сумма");
					
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", "");
					Код = Прав(Строка, 3);
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
						НоваяСтрока.Валюта = Валюта;
					Иначе
						НоваяСтрока.Валюта = Валюта;
					КонецЕсли;
					
					НоваяСтрока.Сумма = Число(Лев(Строка, СтрДлина(Строка) - 4));
					
					ДСКПоступлению.Добавить(НоваяСтрока);
					
				КонецЕсли;
					
				Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
					ОбработкаДСКПоступлению = Ложь;
					ДСКПоступлениюОбработаны = Истина;
					Результат.Вставить("ОжидаемыеПоступленияДенежныхСредств", ДСКПоступлению);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		#КонецОбласти
#Область КонверсионныеСделки
		
		Если Не КонверсионныеСделкиОбработаны И СтрНайти(Строка, "<H5>КОНВЕРСИОННЫЕ / FX СДЕЛКИ") > 0 Тогда
			
			ОбработкаКонверсионныхСделок	= Истина;
			КонверсионныеСделки				= Новый Массив;
			
			Смещение = 16;
			
			Пока ОбработкаКонверсионныхСделок Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, Смещение);
				
				Смещение = 1;
				
				Если СтрНайти(Строка, "<TR") <> 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("ВнебиржеваяСделка");
					НоваяСтрока.Вставить("Дата");
					НоваяСтрока.Вставить("ДатаВалютирования");
					НоваяСтрока.Вставить("НаправлениеСделки");
					НоваяСтрока.Вставить("Курс");
					НоваяСтрока.Вставить("Сумма");
					НоваяСтрока.Вставить("БазоваяВалюта");
					НоваяСтрока.Вставить("СуммаВВалютеРасчетов");
					НоваяСтрока.Вставить("Контрвалюта");
					НоваяСтрока.Вставить("КомиссияБрокера");
					
					// Место совершения.
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2);
					
					НоваяСтрока.ВнебиржеваяСделка = СтрНайти(Строка, "ВНЕБИРЖЕВОЙ РЫНОК") <> 0;
					
					// Дата сделки.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.Дата = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
					
					// Дата валютирования.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.ДатаВалютирования = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
					
					// Время сделки.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.Дата = Дата(Год(НоваяСтрока.Дата), Месяц(НоваяСтрока.Дата), День(НоваяСтрока.Дата), Лев(Строка, 2), Сред(Строка, 4, 2), Прав(Строка, 2));
					
					// Пропускаем валютную пару.
					Пока СтрНайти(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "</TD>") = 0 Цикл
					КонецЦикла;
					
					// Направление сделки.
					НоваяСтрока.НаправлениеСделки = ?(СтрНайти(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "ПРОДАЖА") <> 0, Перечисления.ВидыСделок.Продажа, Перечисления.ВидыСделок.Покупка);
					
					// Курс.
					НоваяСтрока.Курс = Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					
					// Сумма.
					НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), "&nbsp;", ""));
					
					// Базовая валюта.
					Код = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
					КонецЕсли;
					
					НоваяСтрока.БазоваяВалюта = Валюта;
					
					// Контрвалюта.
					Код = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
					КонецЕсли;
					
					НоваяСтрока.Контрвалюта	= Валюта;
					
					// Сумма в валюте расчетов
					
					// Комиссия брокера.
					НоваяСтрока.КомиссияБрокера = Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					
					КонверсионныеСделки.Добавить(НоваяСтрока);
					
				ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда
					ОбработкаКонверсионныхСделок	= Ложь;
					КонверсионныеСделкиОбработаны	= Истина;
					Результат.Вставить("КонверсионныеСделки", КонверсионныеСделки);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
#КонецОбласти
#Область НезавершенныеКонверсионныеСделки
		
		Если Не НезавершенныеКонверсионныеСделкиОбработаны И 
				(СтрНайти(Строка, "<H5>НЕЗАВЕРШЕННЫЕ КОНВЕРСИОННЫЕ / FX СДЕЛКИ / СДЕЛКИ С ДРАГ. МЕТАЛЛАМИ:</H5>") > 0 
				ИЛИ СтрНайти(Строка, "<H5>НЕЗАВЕРШЕННЫЕ КОНВЕРСИОННЫЕ / FX СДЕЛКИ:</H5>") > 0) Тогда
			
			ОбработкаНезавершенныхКонверсионныхСделок	= Истина;
			НезавершенныеКонверсионныеСделки			= Новый Массив;
			
			Смещение = 16;
			
			Пока ОбработкаНезавершенныхКонверсионныхСделок Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, Смещение);
				
				Смещение = 1;
				
				Если СтрНайти(Строка, "<TR") <> 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("ВнебиржеваяСделка");
					НоваяСтрока.Вставить("Дата");
					НоваяСтрока.Вставить("ДатаВалютирования");
					НоваяСтрока.Вставить("НаправлениеСделки");
					НоваяСтрока.Вставить("Курс");
					НоваяСтрока.Вставить("Сумма");
					НоваяСтрока.Вставить("БазоваяВалюта");
					НоваяСтрока.Вставить("Контрвалюта");
					НоваяСтрока.Вставить("КомиссияБрокера");
					
					// Место совершения.
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2);
					
					НоваяСтрока.ВнебиржеваяСделка = СтрНайти(Строка, "ВНЕБИРЖЕВОЙ РЫНОК") <> 0;
					
					// Дата сделки.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.Дата = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
					
					// Дата валютирования.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.ДатаВалютирования = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
					
					// Время сделки.
					Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					НоваяСтрока.Дата = Дата(Год(НоваяСтрока.Дата), Месяц(НоваяСтрока.Дата), День(НоваяСтрока.Дата), Лев(Строка, 2), Сред(Строка, 4, 2), Прав(Строка, 2));
					
					// Пропускаем валютную пару.
					Пока СтрНайти(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "</TD>") = 0 Цикл
					КонецЦикла;
					
					// Направление сделки.
					НоваяСтрока.НаправлениеСделки = ?(СтрНайти(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "ПРОДАЖА") <> 0, Перечисления.ВидыСделок.Продажа, Перечисления.ВидыСделок.Покупка);
					
					// Курс.
					НоваяСтрока.Курс = Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					
					// Сумма.
					НоваяСтрока.Сумма = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), "&nbsp;", ""));
					
					// Базовая валюта.
					Код = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
					КонецЕсли;
					
					НоваяСтрока.БазоваяВалюта = Валюта;
					
					// Контрвалюта.
					Код = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
					
					Валюта = КешОбъектов.Валюты.Получить(Код);
					
					Если Валюта = Неопределено Тогда
						Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
						КешОбъектов.Валюты.Вставить(Код, Валюта);
					КонецЕсли;
					
					НоваяСтрока.Контрвалюта	= Валюта;
					
					// Комиссия брокера.
					НоваяСтрока.КомиссияБрокера = Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					
					НезавершенныеКонверсионныеСделки.Добавить(НоваяСтрока);
					
				ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда
					ОбработкаНезавершенныхКонверсионныхСделок	= Ложь;
					НезавершенныеКонверсионныеСделкиОбработаны	= Истина;
					Результат.Вставить("НезавершенныеКонверсионныеСделки", НезавершенныеКонверсионныеСделки);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
#КонецОбласти
#Область ЦенныеБумаги
		// Определяем ДС к поступлению.
		Если НЕ ОстаткиЦБОбработаны И СтрНайти(Строка, "<H5>ОСТАТКИ ЦЕННЫХ БУМАГ:</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);

#Область ОстаткиАкций
			Если (ЗагружаемыеРазделы.ОстаткиАкций Или ЗагружаемыеРазделы.ЗаблокированныеАкции) И СтрНайти(Строка, "<H5>АКЦИИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 10);
				
				ОбработкаАкций = Истина;
				
				ОстаткиАкций			= Новый Массив;
				ЗаблокированныеАкции	= Новый Массив;
				
				Пока ОбработкаАкций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Акция");
						НоваяСтрока.Вставить("НачальныйОстаток");
						НоваяСтрока.Вставить("КонечныйОстаток");
						НоваяСтрока.Вставить("Заблокировано");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Акция.
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
												
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Акция = КешОбъектов.Акции.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Акция) Тогда
							Тип = ?(СтрНачинаетсяС(Строка, "ГДР") ИЛИ СтрНачинаетсяС(Строка, "АДР"), "ДепозитарнаяРасписка", "Акция");
							Акция = ПолучитьЦеннуюБумагу(Тип, Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Акция) Тогда
							НоваяСтрока.Акция = Акция;
							КешОбъектов.Акции.Вставить(Код, Акция);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 4);
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = ?(Тип = "Акция", "Акции", "ДепозитарныеРасписки");
						
						// Основной ДС.
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "</TD>") = 0 Тогда
							Строка = Строка + ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						КонецЕсли;
						
						МестоХранения = НРег(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						
						// Начальный остаток.
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.НачальныйОстаток = Число(Строка);
						
						// Конечный остаток.
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.КонечныйОстаток = Число(Строка);
						
						// Заблокировано.
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						Заблокировано = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), "</TR>", ""), "</TBODY>", ""), "</TABLE>", ""), " ", ""));
						
						Если Заблокировано <> 0 Тогда
							НоваяСтрокаЗаблокированныеАкции = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
							НоваяСтрокаЗаблокированныеАкции.Вставить("Акция",			Акция);
							НоваяСтрокаЗаблокированныеАкции.Вставить("Заблокировано",	Заблокировано);
							
							ЗаблокированныеАкции.Добавить(НоваяСтрокаЗаблокированныеАкции);
						КонецЕсли;
						
						ОстаткиАкций.Добавить(НоваяСтрока);
						
						КонецСтроки = Ложь;
						
						Пока Не КонецСтроки Цикл
						
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
							КонецСтроки = (Строка = "</TR>");
						
						КонецЦикла; 
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаАкций = Ложь;
						
						Результат.Вставить("ОстаткиАкций",			ОстаткиАкций);
						Результат.Вставить("ЗаблокированныеАкции",	ЗаблокированныеАкции);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти
#Область ОстаткиОблигаций
			Если (ЗагружаемыеРазделы.ОстаткиОблигаций Или ЗагружаемыеРазделы.ЗаблокированныеОблигации) И СтрНайти(Строка, "<H5>ОБЛИГАЦИИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 10);
				
				ОбработкаОблигаций = Истина;
				
				ОстаткиОблигаций			= Новый Массив;
				ЗаблокированныеОблигации	= Новый Массив;
				
				Пока ОбработкаОблигаций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Облигация");
						НоваяСтрока.Вставить("НачальныйОстаток");
						НоваяСтрока.Вставить("КонечныйОстаток");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Облигация.
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Облигация = КешОбъектов.Облигации.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Облигация) Тогда
							Облигация = ПолучитьЦеннуюБумагу("Облигация", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Облигация) Тогда
							НоваяСтрока.Облигация = Облигация;
							КешОбъектов.Облигации.Вставить(Код, Облигация);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 4);
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = "Облигации";
						
						// Основной ДС.
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Если СтрНайти(Строка, "</TD>") = 0 Тогда
							Строка = Строка + ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						КонецЕсли;
						
						МестоХранения = НРег(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", ""));
						
						// Начальный остаток.
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.НачальныйОстаток = Число(Строка);
						
						// Конечный остаток.
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.КонечныйОстаток = Число(Строка);
						
						// Заблокировано.
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						Заблокировано = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), "</TR>", ""), "</TBODY>", ""), "</TABLE>", ""), " ", ""));
						
						Если Заблокировано <> 0 Тогда
							НоваяСтрокаЗаблокированныеОблигации = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрокаЗаблокированныеОблигации.Вставить("Облигация",		Облигация);
							НоваяСтрокаЗаблокированныеОблигации.Вставить("Заблокировано",	Заблокировано);
							
							ЗаблокированныеОблигации.Добавить(НоваяСтрокаЗаблокированныеОблигации);
						КонецЕсли;
						
						ОстаткиОблигаций.Добавить(НоваяСтрока);
						
						КонецСтроки = Ложь;
						
						Пока Не КонецСтроки Цикл
						
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
							КонецСтроки = (Строка = "</TR>");
						
						КонецЦикла;
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаОблигаций = Ложь;
						
						Результат.Вставить("ОстаткиОблигаций",			ОстаткиОблигаций);
						Результат.Вставить("ЗаблокированныеОблигации",	ЗаблокированныеОблигации);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти
#Область ОстаткиПаев
			Если (ЗагружаемыеРазделы.ОстаткиПаев Или ЗагружаемыеРазделы.ЗаблокированныеПаи) И СтрНайти(Строка, "<H5>ПАИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 10);
				
				ОбработкаПаев = Истина;
				
				ОстаткиПаев			= Новый Массив;
				ЗаблокированныеПаи	= Новый Массив;
				
				Пока ОбработкаПаев Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Пай");
						НоваяСтрока.Вставить("НачальныйОстаток");
						НоваяСтрока.Вставить("КонечныйОстаток");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Пай.
						Строка = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "</TD>", "");
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Пай = КешОбъектов.Паи.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Пай) Тогда
							Пай = ПолучитьЦеннуюБумагу("Пай", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Пай) Тогда
							НоваяСтрока.Пай = Пай;
							КешОбъектов.Паи.Вставить(Код, Пай);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 4);
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = "Паи";
						
						// Основной ДС.
						МестоХранения = НРег(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2));
						
						// Начальный остаток.
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.НачальныйОстаток = Число(Строка);
						
						// Конечный остаток.
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.КонечныйОстаток = Число(Строка);
						
						// Заблокировано.
						Заблокировано = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						
						Если Заблокировано <> 0 Тогда
							НоваяСтрокаЗаблокированныеПаи = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
							
							НоваяСтрокаЗаблокированныеПаи.Вставить("Пай",			Пай);
							НоваяСтрокаЗаблокированныеПаи.Вставить("Заблокировано",	Заблокировано);
							
							ЗаблокированныеПаи.Добавить(НоваяСтрокаЗаблокированныеПаи);
						КонецЕсли;
						
						ОстаткиПаев.Добавить(НоваяСтрока);
						
						КонецСтроки = Ложь;
						
						Пока Не КонецСтроки Цикл
						
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
							КонецСтроки = (Строка = "</TR>");
						
						КонецЦикла;
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаПаев = Ложь;
						
						Результат.Вставить("ОстаткиПаев",			ОстаткиПаев);
						Результат.Вставить("ЗаблокированныеПаи",	ЗаблокированныеПаи);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти
			
			ОстаткиЦБОбработаны = Истина;
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, -1);
			
		КонецЕсли;
#КонецОбласти
#Область ЗадолженностьПоЦБ
	    //Определяем блок задолженностей по ЦБ
		Если НЕ ЗадолженностьПоЦБОбработана И СтрНайти(Строка, "<H5>ОБЯЗАТЕЛЬСТВА ПО ЦБ:</H5>") > 0 Тогда
			
			ЗадолженностьПоЦБ = Новый Массив;
			
			Пока НЕ ЗадолженностьПоЦБОбработана Цикл
				
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
				Если СтрНайти(Строка, "<TD CLASS=""LEFT"">") > 0 Тогда
					
					НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
					
					НоваяСтрока.Вставить("ЦеннаяБумага");
					НоваяСтрока.Вставить("ИсходящийОстаток");
					НоваяСтрока.Вставить("ОбязательстваКПолучению");
					НоваяСтрока.Вставить("ОбязательстваКВыбытию");
					НоваяСтрока.Вставить("ПлановыйИсходящийОстаток");
					
					// Код ЦБ в таблице находится в скобках. Иногда перед кодом указывается номер выпуска через /.
					// В качестве кода используется или гос. рег. номер, или ISIN.
					ЦеннаяБумага = Неопределено; // СтрЗаменить(СтрЗаменить(Строка, ")</TD>", ""), "<TD CLASS=""LEFT"">", "");
					
					// Получаем код.
					
					Если НачалоДня(ДатаОтчета) >= Дата(2022,10,07) Тогда
						
						Код = Прав(СтрЗаменить(Строка, "</TD>", ""), 12);
						
						ЦеннаяБумага = КешОбъектов.ЦенныеБумаги.Получить(Код);
						
						Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
							ЦеннаяБумага = ПолучитьЦеннуюБумагуПоКодуISIN(Код);
						КонецЕсли;
							
					Иначе

						ЦеннаяБумага = СтрЗаменить(СтрЗаменить(Строка, ")</TD>", ""), "<TD CLASS=""LEFT"">", "");
						
						Код   = Сред(ЦеннаяБумага, СтрНайти(ЦеннаяБумага, "(") + 1);
						Серия = "";
						// Отрезаем номер выпуска, если указан.
						Если СтрНайти(Код, "/") > 0 Тогда
							Серия = Лев(Код, СтрНайти(Код, "/") - 1);
							Код   = Сред(Код, СтрНайти(Код, "/") + 1);
						КонецЕсли;
						
						ЦеннаяБумага = КешОбъектов.ЦенныеБумаги.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(ЦеннаяБумага) Тогда
							ЦеннаяБумага = ПолучитьЦеннуюБумагуПоКоду(Код, Серия);
						КонецЕсли;
						
					КонецЕсли;
										
					Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
						НоваяСтрока.ЦеннаяБумага = ЦеннаяБумага;
						КешОбъектов.ЦенныеБумаги.Вставить(Код, ЦеннаяБумага);
					Иначе
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока.ИсходящийОстаток			= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					НоваяСтрока.ОбязательстваКПолучению		= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					НоваяСтрока.ОбязательстваКВыбытию		= -1*Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					НоваяСтрока.ПлановыйИсходящийОстаток	= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
					
					ЗадолженностьПоЦБ.Добавить(НоваяСтрока);
					
				КонецЕсли;
				
				Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
					ЗадолженностьПоЦБОбработана = Истина;
					Результат.Вставить("ЗадолженностьПоЦБ", ЗадолженностьПоЦБ);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
#КонецОбласти
#Область ДвижениеЦБ

		Если НЕ ДвиженияЦБОбработаны И СтрНайти(Строка, "<H5>ДВИЖЕНИЕ ЦЕННЫХ БУМАГ (СПИСАНИЕ / ЗАЧИСЛЕНИЕ):</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
			
			#Область Акции
			// Таблица акций.
			Если ЗагружаемыеРазделы.ДвиженияАкций И СтрНайти(Строка, "<H5>АКЦИИ:</H5>") > 0 Тогда
				
				ОбработкаАкций	= Истина;
				ДвиженияАкций	= Новый Массив;
				Смещение		= 10;
				
				Пока ОбработкаАкций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, Смещение);
					
					Смещение = 1;
					
					Если СтрНайти(Строка, "<TR") <> 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Акция");
						НоваяСтрока.Вставить("ДатаОперации");
						НоваяСтрока.Вставить("Приход");
						НоваяСтрока.Вставить("Расход");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Акция.
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Акция = КешОбъектов.Акции.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Акция) Тогда
							Тип = ?(СтрНачинаетсяС(Строка, "ГДР") ИЛИ СтрНачинаетсяС(Строка, "АДР"), "ДепозитарнаяРасписка", "Акция");
							Акция = ПолучитьЦеннуюБумагу(Тип, Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Акция) Тогда
							НоваяСтрока.Акция = Акция;
							КешОбъектов.Акции.Вставить(Код, Акция);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = ?(Тип = "Акция", "Акции", "ДепозитарныеРасписки");
						
						НоваяСтрока.Приход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						НоваяСтрока.Расход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 1), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						
						ДвиженияАкций.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда
						ОбработкаАкций = Ложь;
						Результат.Вставить("ДвиженияАкций", ДвиженияАкций);
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			#КонецОбласти
			
			#Область Облигации
			// Таблица облигаций.
			Если ЗагружаемыеРазделы.ДвиженияОблигаций И СтрНайти(Строка, "<H5>ОБЛИГАЦИИ:</H5>") > 0 Тогда
				
				ОбработкаОблигаций	= Истина;
				ДвиженияОблигаций	= Новый Массив;
				Смещение			= 9;
				
				Пока ОбработкаОблигаций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, Смещение);
					
					Смещение = 1;
					
					Если СтрНайти(Строка, "<TR") <> 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Облигация");
						НоваяСтрока.Вставить("ДатаОперации");
						НоваяСтрока.Вставить("Количество");
						
						Если ДатаФормированияОтчета >= Дата(2024, 12, 05) Тогда
							НоваяСтрока.Вставить("Приход");
							НоваяСтрока.Вставить("Расход");							
						КонецЕсли;					
						
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Облигация.
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Облигация = КешОбъектов.Облигации.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Облигация) Тогда
							Облигация = ПолучитьЦеннуюБумагу("Облигация", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Облигация) Тогда
							НоваяСтрока.Облигация = Облигация;
							КешОбъектов.Облигации.Вставить(Код, Облигация);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = "Облигации";
												
						Если ДатаФормированияОтчета >= Дата(2024, 12, 05) Тогда
							НоваяСтрока.Приход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
							НоваяСтрока.Расход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 1), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
							НоваяСтрока.Количество = ?(НоваяСтрока.Приход > НоваяСтрока.Расход, НоваяСтрока.Приход - НоваяСтрока.Расход, НоваяСтрока.Расход - НоваяСтрока.Приход);
						Иначе
							НоваяСтрока.Количество = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						КонецЕсли;
						
						ДвиженияОблигаций.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда
						ОбработкаОблигаций = Ложь;
						Результат.Вставить("ДвиженияОблигаций", ДвиженияОблигаций);
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			#КонецОбласти
			
			#Область Паи
			// Таблица паев.
			Если ЗагружаемыеРазделы.ДвиженияПаев И СтрНайти(Строка, "<H5>ПАИ:</H5>") > 0 Тогда
				
				ОбработкаПаев	= Истина;
				ДвиженияПаев	= Новый Массив;
				Смещение		= 9;
				
				Пока ОбработкаПаев Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, Смещение);
					
					Смещение = 1;
					
					Если СтрНайти(Строка, "<TR") <> 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
					НоваяСтрока.Вставить("Пай");
					НоваяСтрока.Вставить("ДатаОперации");
					НоваяСтрока.Вставить("Количество");
					
					Если ДатаФормированияОтчета >= Дата(2024, 12, 05) Тогда
						НоваяСтрока.Вставить("Приход");
						НоваяСтрока.Вставить("Расход");
					КонецЕсли;
					
					НоваяСтрока.Вставить("РегНомер");
					НоваяСтрока.Вставить("Эмитент");
					НоваяСтрока.Вставить("Рынок");
						
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Прав(Строка, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Эмитент
						Эмитент = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						// Пай.
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Пай = КешОбъектов.Паи.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Пай) Тогда
							Пай = ПолучитьЦеннуюБумагу("Пай", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Пай) Тогда
							НоваяСтрока.Пай = Пай;
							КешОбъектов.Паи.Вставить(Код, Пай);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Эмитент;
						НоваяСтрока.Рынок = "Паи";
						
					Если ДатаФормированияОтчета >= Дата(2024, 12, 05) Тогда
						НоваяСтрока.Приход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						НоваяСтрока.Расход = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 1), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
						НоваяСтрока.Количество = ?(НоваяСтрока.Приход > НоваяСтрока.Расход, НоваяСтрока.Приход - НоваяСтрока.Расход, НоваяСтрока.Расход - НоваяСтрока.Приход);
					Иначе
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2);
						
						Если СтрНайти(Строка, "<TD CLASS=""RIGHT"">") = 0 Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						КонецЕсли;
						
						НоваяСтрока.Количество = Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка, "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", ""));
					КонецЕсли;
						
						ДвиженияПаев.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда
						ОбработкаПаев = Ложь;
						Результат.Вставить("ДвиженияПаев", ДвиженияПаев);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			#КонецОбласти
			
			ДвиженияЦБОбработаны = Истина;
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, -1);
			
		КонецЕсли;
		
#КонецОбласти
#Область ОжидаемыеПоступленияЦБ
		//Определяем блок задолженностей по ЦБ
		Если НЕ ОжидаемыеПоступленияЦБОбработаны И СтрНайти(Строка, "<H5>ОЖИДАЕМЫЕ ПОСТУПЛЕНИЯ ЦЕННЫХ БУМАГ ПО ИСПОЛНЕННЫМ ПОРУЧЕНИЯМ И СДЕЛКАМ:</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
			
#Область Акции
			// Таблица акций.
			Если ЗагружаемыеРазделы.ОжидаемыеПоступленияАкций И СтрНайти(Строка, "<H5>АКЦИИ:</H5>") > 0 Тогда
				
				ОбработкаАкций				= Истина;
				ОжидаемыеПоступленияАкций	= Новый Массив;
				
				СмещениеСтроки = 9;
				
				Пока ОбработкаАкций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, СмещениеСтроки);
					
					СмещениеСтроки = 1;
					
					Если СтрНайти(Строка, "<TR") <> 0 Тогда	// Начало новой строки таблицы.
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Акция");
						НоваяСтрока.Вставить("ДатаОперации");
						НоваяСтрока.Вставить("Количество");
						
						// Дата операции.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Сред(Строка, 7, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Акция.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD>", ""), "</TD>", "");
						Код = Сред(Строка, СтрНайти(Строка, "ГОС. РЕГ. ") + 10);
						
						Акция = КешОбъектов.Акции.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Акция) Тогда
							
							Акция = ПолучитьЦеннуюБумагу("Акция", Код);
							
							Если ЗначениеЗаполнено(Акция) Тогда
								КешОбъектов.Акции.Вставить(Код, Акция);
							ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
								Продолжить;
							КонецЕсли;
							
						КонецЕсли;
						
						НоваяСтрока.Акция		= Акция;
						НоваяСтрока.Количество	= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
						
						ОжидаемыеПоступленияАкций.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда	// Конец таблицы акций.
						ОбработкаАкций = Ложь;
						Результат.Вставить("ОжидаемыеПоступленияАкций", ОжидаемыеПоступленияАкций);
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;	
#КонецОбласти
#Область Облигации
			
			// Таблица облигаций.
			Если ЗагружаемыеРазделы.ОжидаемыеПоступленияОблигаций И СтрНайти(Строка, "<H5>ОБЛИГАЦИИ:</H5>") > 0 Тогда
				
				ОбработкаОблигаций				= Истина;
				ОжидаемыеПоступленияОблигаций	= Новый Массив;
				
				СмещениеСтроки = 9;
				
				Пока ОбработкаОблигаций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, СмещениеСтроки);
					
					СмещениеСтроки = 1;
					
					Если СтрНайти(Строка, "<TR") <> 0 Тогда	// Начало новой строки таблицы.
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Облигация");
						НоваяСтрока.Вставить("ДатаОперации");
						НоваяСтрока.Вставить("Количество");
						
						// Дата операции.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Сред(Строка, 7, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Облигация.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD>", ""), "</TD>", "");
						Код = Сред(Строка, СтрНайти(Строка, "ГОС. РЕГ. ") + 10);
						
						Облигация = КешОбъектов.Облигации.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Облигация) Тогда
							
							Облигация = ПолучитьЦеннуюБумагу("Облигация", Код);
							
							Если ЗначениеЗаполнено(Облигация) Тогда
								КешОбъектов.Облигации.Вставить(Код, Облигация);
							ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
								Продолжить;
							КонецЕсли;
							
						КонецЕсли;
						
						НоваяСтрока.Облигация	= Облигация;
						НоваяСтрока.Количество	= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
						
						ОжидаемыеПоступленияОблигаций.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда	// Конец таблицы облигаций.
						ОбработкаОблигаций = Ложь;
						Результат.Вставить("ОжидаемыеПоступленияОблигаций", ОжидаемыеПоступленияОблигаций);
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти
#Область Паи
			// Таблица паев.
			Если ЗагружаемыеРазделы.ОжидаемыеПоступленияПаев И СтрНайти(Строка, "<H5>ПАИ:</H5>") > 0 Тогда
				
				ОбработкаПаев				= Истина;
				ОжидаемыеПоступленияПаев	= Новый Массив;
				
				СмещениеСтроки = 9;
				
				Пока ОбработкаПаев Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, СмещениеСтроки);
					
					СмещениеСтроки = 1;;
					
					Если СтрНайти(Строка, "<TR>") <> 0 Тогда	// Начало новой строки таблицы.
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("Пай");
						НоваяСтрока.Вставить("ДатаОперации");
						НоваяСтрока.Вставить("Количество");
						
						// Дата операции.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", ""), "</TD>", "");
						
						НоваяСтрока.ДатаОперации = Дата(Сред(Строка, 7, 4), Сред(Строка, 4, 2), Лев(Строка, 2));
						
						// Пай.
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD>", ""), "</TD>", "");
						Код = Сред(Строка, СтрНайти(Строка, "ГОС. РЕГ. ") + 10);
						
						Пай = КешОбъектов.Паи.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Пай) Тогда
							
							Пай = ПолучитьЦеннуюБумагу("Пай", Код);
							
							Если ЗначениеЗаполнено(Пай) Тогда
								КешОбъектов.Паи.Вставить(Код, Пай);
							ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
								Продолжить;
							КонецЕсли;
							
						КонецЕсли;
						
						НоваяСтрока.Пай			= Пай;
						НоваяСтрока.Количество	= Число(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""));
						
						ОжидаемыеПоступленияПаев.Добавить(НоваяСтрока);
						
					ИначеЕсли СтрНайти(Строка, "</TABLE>") <> 0 Тогда	// Конец таблицы паев.
						ОбработкаПаев = Ложь;
						Результат.Вставить("ОжидаемыеПоступленияПаев", ОжидаемыеПоступленияПаев);
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
#КонецОбласти
			
			ОжидаемыеПоступленияЦБОбработаны = Истина;
			
		КонецЕсли;
#КонецОбласти
		#Область Сделки
		Если Не СделкиСЦБОбработаны И СтрНайти(Строка, "<H5>СДЕЛКИ С ЦЕННЫМИ БУМАГАМИ ПО СЧЕТУ КЛИЕНТА ЗА ОТЧЕТНЫЙ ПЕРИОД:</H5>") > 0 Тогда
			
			Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
				
			#Область Сделки_с_акциями
				
			Если ЗагружаемыеРазделы.СделкиСАкциями И СтрНайти(Строка, "<H5>АКЦИИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 17);
				
				ОбработкаАкций = Истина;
				
				СделкиСАкциями = Новый Массив;
				
				Пока ОбработкаАкций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD>") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("ДатаВремяСделки");
						НоваяСтрока.Вставить("МестоЗаключенияСделки");
						НоваяСтрока.Вставить("Акция");
						НоваяСтрока.Вставить("ВидОперации");
						НоваяСтрока.Вставить("ДопУсловия");
						НоваяСтрока.Вставить("Количество");
						НоваяСтрока.Вставить("Цена");
						НоваяСтрока.Вставить("Сумма");
						НоваяСтрока.Вставить("СтавкаРЕПО");
						НоваяСтрока.Вставить("ВалютаЦены");
						НоваяСтрока.Вставить("ВалютаРасчетов");
						НоваяСтрока.Вставить("СуммаСделкиРасчетная");
						НоваяСтрока.Вставить("БиржеваяКомиссия");
						НоваяСтрока.Вставить("БрокерскаяКомиссия");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Дата и время
						Строка = Сред(СтрЗаменить(Строка, "</TD>", ""), 5);
						НоваяСтрока.ДатаВремяСделки = Дата(Строка);
						
						// Номер и дата поручения
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						// Место заключения сделки
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						НоваяСтрока.МестоЗаключенияСделки = Строка;
						
						// Акция
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Акция = КешОбъектов.Акции.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Акция) Тогда
							Тип = ?(СтрНачинаетсяС(Строка, "ГДР") ИЛИ СтрНачинаетсяС(Строка, "АДР"), "ДепозитарнаяРасписка", "Акция");
							Акция = ПолучитьЦеннуюБумагу(Тип, Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Акция) Тогда
							НоваяСтрока.Акция = Акция;
							КешОбъектов.Акции.Вставить(Код, Акция);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 9);
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Лев(Строка, СтрНайти(Строка, ",") - 1);
						НоваяСтрока.Рынок = ?(Тип = "Акция", "Акции", "ДепозитарныеРасписки");
						
						// Вид операции и доп. условия
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						ВидОперации = Лев(Строка, СтрНайти(Строка, ".") - 1);
						ДопУсловия = Сред(Строка, СтрДлина(ВидОперации) + 3);
						НоваяСтрока.ВидОперации = ВидОперации;
						НоваяСтрока.ДопУсловия = ДопУсловия;
						
						// Количество
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Количество = Число(Строка);
						
						// Цена
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Цена = Число(Строка);
						
						// Сумма
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Сумма = Число(Строка);
						
						// СтавкаРЕПО
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.СтавкаРЕПО = Число(?(Строка = "", 0, Строка));
						
						// Валюта цены
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", "");
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаЦены = Валюта;
						Иначе
							НоваяСтрока.ВалютаЦены = Валюта;
						КонецЕсли;
						
						// Валюта расчетов
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "</TD>", "");
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаРасчетов = Валюта;
						Иначе
							НоваяСтрока.ВалютаРасчетов = Валюта;
						КонецЕсли;
						
						// Сумма сделки расчетная
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.СуммаСделкиРасчетная = Число(Строка);
						
						// Биржевая комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БиржеваяКомиссия = Число(Строка);
						
						// Брокерская комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БрокерскаяКомиссия = Число(Строка);
						
						СделкиСАкциями.Добавить(НоваяСтрока);
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаАкций = Ложь;
						
						Результат.Вставить("СделкиСАкциями", СделкиСАкциями);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
			#КонецОбласти 
			#Область Сделки_с_облигациями
				
			Если ЗагружаемыеРазделы.СделкиСОблигациями И СтрНайти(Строка, "<H5>ОБЛИГАЦИИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 18);
				
				ОбработкаОблигаций = Истина;
				
				СделкиСОблигациями = Новый Массив;
				
				Пока ОбработкаОблигаций Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD>") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("ДатаВремяСделки");
						НоваяСтрока.Вставить("МестоЗаключенияСделки");
						НоваяСтрока.Вставить("Облигация");
						НоваяСтрока.Вставить("ВидОперации");
						НоваяСтрока.Вставить("ДопУсловия");
						НоваяСтрока.Вставить("Количество");
						НоваяСтрока.Вставить("Цена");
						НоваяСтрока.Вставить("Сумма");
						НоваяСтрока.Вставить("НКД");
						НоваяСтрока.Вставить("СтавкаРЕПО");
						НоваяСтрока.Вставить("ВалютаЦены");
						НоваяСтрока.Вставить("ВалютаРасчетов");
						НоваяСтрока.Вставить("СуммаСделкиРасчетная");
						НоваяСтрока.Вставить("БиржеваяКомиссия");
						НоваяСтрока.Вставить("БрокерскаяКомиссия");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Дата и время
						Строка = Сред(СтрЗаменить(Строка, "</TD>", ""), 5);
						НоваяСтрока.ДатаВремяСделки = Дата(Строка);
						
						// Номер и дата поручения
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						// Место заключения сделки
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						НоваяСтрока.МестоЗаключенияСделки = Строка;
						
						// Облигация
						Строка = ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки);
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Облигация = КешОбъектов.Облигации.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Облигация) Тогда
							Облигация = ПолучитьЦеннуюБумагу("Облигация", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Облигация) Тогда
							НоваяСтрока.Облигация = Облигация;
							КешОбъектов.Облигации.Вставить(Код, Облигация);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 10);
							Продолжить;
						КонецЕсли;
												
						НоваяСтрока.РегНомер = Код;                                    
						НоваяСтрока.Эмитент = Лев(СтрЗаменить(Строка, "<TD CLASS=""LEFT"">", ""), СтрНайти(Строка, ",") - 1);
						
						// Вид операции и доп. условия
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						ПоложениеТочки = СтрНайти(Строка, ".");
						Если ПоложениеТочки > 0 Тогда
						    ВидОперации = Лев(Строка, СтрНайти(Строка, ".") - 1);
							ДопУсловия = Сред(Строка, СтрДлина(ВидОперации) + 3);
						Иначе
							ВидОперации = Строка;
							ДопУсловия = "";
						КонецЕсли; 
						НоваяСтрока.ВидОперации = ВидОперации;
						НоваяСтрока.ДопУсловия = ДопУсловия;
						
						// Количество
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Количество = Число(Строка);
						
						// Цена
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Цена = Число(Строка);
						
						// Сумма
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Сумма = Число(Строка);
						
						// НКД
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.НКД = Число(Строка);
						
						// СтавкаРЕПО
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.СтавкаРЕПО = Число(?(Строка = "", 0, Строка));
						
						// Валюта цены
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", "");
						Если Код = "</td>" Тогда
							Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", "");
						КонецЕсли; 
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаЦены = Валюта;
						Иначе
							НоваяСтрока.ВалютаЦены = Валюта;
						КонецЕсли;
						
						// Валюта расчетов
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "</TD>", "");
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаРасчетов = Валюта;
						Иначе
							НоваяСтрока.ВалютаРасчетов = Валюта;
						КонецЕсли;
						
						// Сумма сделки расчетная
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						Попытка
							НоваяСтрока.СуммаСделкиРасчетная = Число(Строка);
						Исключение
							Сообщить(Строка);
						КонецПопытки; 
						
						
						// Биржевая комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БиржеваяКомиссия = Число(Строка);
						
						// Брокерская комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БрокерскаяКомиссия = Число(Строка);
						
						СделкиСОблигациями.Добавить(НоваяСтрока);
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаОблигаций = Ложь;
						
						Результат.Вставить("СделкиСОблигациями", СделкиСОблигациями);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		#КонецОбласти 
		#Область Сделки_с_паями
				
			Если ЗагружаемыеРазделы.СделкиСПаями И СтрНайти(Строка, "<H5>ПАИ:</H5>") > 0 Тогда
								
				Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 16);
				
				ОбработкаПаев = Истина;
				
				СделкиСПаями = Новый Массив;
				
				Пока ОбработкаПаев Цикл
					
					Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
					
					Если СтрНайти(Строка, "<TD>") > 0 Тогда
						
						НоваяСтрока = ПолучитьНовуюСтрокуДанныхОтчета(ДБО, СА, ВалютнаяСекция, НачалоПериодаОтчета, КонецПериодаОтчета);
						
						НоваяСтрока.Вставить("ДатаВремяСделки");
						НоваяСтрока.Вставить("МестоЗаключенияСделки");
						НоваяСтрока.Вставить("Пай");
						НоваяСтрока.Вставить("ВидОперации");
						НоваяСтрока.Вставить("ДопУсловия");
						НоваяСтрока.Вставить("Количество");
						НоваяСтрока.Вставить("Цена");
						НоваяСтрока.Вставить("Сумма");
						НоваяСтрока.Вставить("СтавкаРЕПО");
						НоваяСтрока.Вставить("ВалютаЦены");
						НоваяСтрока.Вставить("ВалютаРасчетов");
						НоваяСтрока.Вставить("БиржеваяКомиссия");
						НоваяСтрока.Вставить("БрокерскаяКомиссия");
						НоваяСтрока.Вставить("РегНомер");
						НоваяСтрока.Вставить("Эмитент");
						НоваяСтрока.Вставить("Рынок");
						
						// Дата и время
						Строка = Сред(СтрЗаменить(Строка, "</TD>", ""), 5);
						НоваяСтрока.ДатаВремяСделки = Дата(Строка);
						
						// Номер и дата поручения
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
						// Место заключения сделки
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						НоваяСтрока.МестоЗаключенияСделки = Строка;
						
						// Пай
						Строка = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "</TD>", "");
						
						Код = ПолучитьКодЦеннойБумагиИзСтроки(Строка);
						
						Пай = КешОбъектов.Паи.Получить(Код);
						
						Если НЕ ЗначениеЗаполнено(Пай) Тогда
							Пай = ПолучитьЦеннуюБумагу("Пай", Код);
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Пай) Тогда
							НоваяСтрока.Пай = Пай;
							КешОбъектов.Паи.Вставить(Код, Пай);
						ИначеЕсли ПропускатьСтрокиЕслиЦБНеНайдена Тогда
							Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки, 8);
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока.РегНомер = Код;
						НоваяСтрока.Эмитент = Лев(Строка, СтрНайти(Строка, ",") - 1);
						
						// Вид операции и доп. условия
						Строка = СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "<TD CLASS=""LEFT"">", ""), "</TD>", "");
						
						ВидОперации = Лев(Строка, СтрНайти(Строка, ".") - 1);
						ДопУсловия = Сред(Строка, СтрДлина(ВидОперации) + 3);
						НоваяСтрока.ВидОперации = ВидОперации;
						НоваяСтрока.ДопУсловия = ДопУсловия;
						
						// Количество
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Количество = Число(Строка);
						
						// Цена
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Цена = Число(Строка);
						
						// Сумма
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.Сумма = Число(Строка);
						
						// СтавкаРЕПО
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.СтавкаРЕПО = Число(?(Строка = "", 0, Строка));
						
						// Валюта цены
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD>", "");
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаЦены = Валюта;
						Иначе
							НоваяСтрока.ВалютаЦены = Валюта;
						КонецЕсли;
						
						// Валюта расчетов
						Код = СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки, 2), "</TD>", "");
						Валюта = КешОбъектов.Валюты.Получить(Код);
					
						Если Валюта = Неопределено Тогда
							Валюта = ПолучитьВалютуПоНаименованию(?(Код = "РУБ", "RUB", Код));
							КешОбъектов.Валюты.Вставить(Код, Валюта);
							НоваяСтрока.ВалютаРасчетов = Валюта;
						Иначе
							НоваяСтрока.ВалютаРасчетов = Валюта;
						КонецЕсли;
						
						// Биржевая комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БиржеваяКомиссия = Число(Строка);
						
						// Брокерская комиссия
						Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучитьСтроку(ТекстФайла, ИндексСтроки), "<TD CLASS=""RIGHT"">", ""), "</TD>", ""), " ", "");
						НоваяСтрока.БрокерскаяКомиссия = Число(Строка);
						
						СделкиСПаями.Добавить(НоваяСтрока);
						
					КонецЕсли;
					
					Если СтрНайти(Строка, "</TABLE>") > 0 Тогда
						
						ОбработкаПаев = Ложь;
						
						Результат.Вставить("СделкиСПаями", СделкиСПаями);
						
						Строка = ПолучитьСтроку(ТекстФайла, ИндексСтроки);
						
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
			#КонецОбласти
			
			СделкиСЦБОбработаны = Истина;
			
		КонецЕсли;

		#КонецОбласти 
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеОтчетов(Брокер, НачалоПериода, КонецПериода, Знач Каталог, СверкаСМесячнымОтчетомБрокера, ЗагружаемыеРазделы = Неопределено, ПропускатьСтрокиЕслиЦБНеНайдена = Истина, СчетаДУ = Неопределено)
	
	МассивТиповДБО = Новый Массив;
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.ДоговорыБрокерскогоОбслуживания"));
	МассивТиповДБО.Добавить(Тип("СправочникСсылка.Договоры"));
	
	ТаблицаДляПроверкиНаличияДублейОтчетов = Новый ТаблицаЗначений;
	ТаблицаДляПроверкиНаличияДублейОтчетов.Колонки.Добавить("ДБО",				Новый ОписаниеТипов(МассивТиповДБО));
	ТаблицаДляПроверкиНаличияДублейОтчетов.Колонки.Добавить("Валютный",			Новый ОписаниеТипов("Булево"));
	ТаблицаДляПроверкиНаличияДублейОтчетов.Колонки.Добавить("ПорядковыйНомер",	Новый ОписаниеТипов("Число"));
	ТаблицаДляПроверкиНаличияДублейОтчетов.Колонки.Добавить("НачалоПериода",	Новый ОписаниеТипов("Дата"));
	ТаблицаДляПроверкиНаличияДублейОтчетов.Колонки.Добавить("КонецПериода",		Новый ОписаниеТипов("Дата"));
	
	ЗагружаемыеРазделы = ПодготовитьСтруктуруЗагружаемыхРазделов(ЗагружаемыеРазделы);
	
	ДанныеОтчетов = ПодготовитьПустуюСтруктуруРезультата(ЗагружаемыеРазделы, ПропускатьСтрокиЕслиЦБНеНайдена);
	
	#Область Загрузка_данных_отчетов_брокера
	
	СодержимоеФайлов = ПолучитьСодержимоеФайлов(Каталог, СверкаСМесячнымОтчетомБрокера);
	
	ЕстьДанныеЗаПериод = Ложь;
	
	Если СодержимоеФайлов <> Неопределено Тогда
		
		КешОбъектов = Новый Структура;
		КешОбъектов.Вставить("Валюты",			Новый Соответствие);
		КешОбъектов.Вставить("Акции",			Новый Соответствие);
		КешОбъектов.Вставить("Облигации",		Новый Соответствие);
		КешОбъектов.Вставить("Паи",				Новый Соответствие);
		КешОбъектов.Вставить("ЦенныеБумаги",	Новый Соответствие);
		
		Для Каждого ТекОтчет Из СодержимоеФайлов Цикл
			
			ДанныеОтчета =
				ДесериализоватьДанныеОтчета(
					НачалоПериода,
					КонецПериода,
					ТекОтчет.Данные,
					Организация,
					Брокер,
					КешОбъектов,
					ЗагружаемыеРазделы,
					ПропускатьСтрокиЕслиЦБНеНайдена,
					СверкаСМесячнымОтчетомБрокера,
					СчетаДУ,
					ЕстьДанныеЗаПериод);
			
			Если ДанныеОтчета <> Неопределено Тогда
				
				ЕстьДанныеЗаПериод = Истина;
				
				НоваяСтрока					= ТаблицаДляПроверкиНаличияДублейОтчетов.Добавить();
				НоваяСтрока.ПорядковыйНомер	= ТаблицаДляПроверкиНаличияДублейОтчетов.Количество();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеОтчета);
				
				// Переносим данные отчета в общую таблицу
				
				Для каждого Раздел Из ДанныеОтчета Цикл
					Если ДанныеОтчетов.Свойство(Раздел.Ключ) Тогда 
						Для Каждого ТекСтрока Из ДанныеОтчета[Раздел.Ключ] Цикл
							НоваяСтрока = ДанныеОтчетов[Раздел.Ключ].Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла; 
				
				// Запоминаем время получения данных СА
				// Если данные получены из нескольких файлов,
				// то возьмем наиболее позднее время создания файла 
				
				Если ДанныеОтчета.Свойство("СА") Тогда
					
					ВремяПолученияДанных = ДанныеОтчетов.ВремяПолученияДанных.Получить(ДанныеОтчета.СА);
					Если ВремяПолученияДанных = Неопределено Тогда
						ДанныеОтчетов.ВремяПолученияДанных.Вставить(ДанныеОтчета.СА, ТекОтчет.ВремяПолученияДанных);
					Иначе
						ДанныеОтчетов.ВремяПолученияДанных.Вставить(ДанныеОтчета.СА, Макс(ТекОтчет.ВремяПолученияДанных, ВремяПолученияДанных));
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	#КонецОбласти
	
	#Область Проверка_наличия_дублей_отчетов

	Если НЕ ЕстьДанныеЗаПериод Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В папке [" + Каталог + "] за указанный период нет файлов с отчетами брокера!");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДляПроверкиНаличияДублейОтчетов", ТаблицаДляПроверкиНаличияДублейОтчетов);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДляПроверкиНаличияДублейОтчетов.ДБО КАК ДБО,
		|	ТаблицаДляПроверкиНаличияДублейОтчетов.Валютный КАК Валютный,
		|	ТаблицаДляПроверкиНаличияДублейОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ТаблицаДляПроверкиНаличияДублейОтчетов.НачалоПериода КАК НачалоПериода,
		|	ТаблицаДляПроверкиНаличияДублейОтчетов.КонецПериода КАК КонецПериода
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	&ТаблицаДляПроверкиНаличияДублейОтчетов КАК ТаблицаДляПроверкиНаличияДублейОтчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Данные.ДБО КАК ДБО,
		|	_Данные.Валютный КАК Валютный,
		|	_Данные.НачалоПериода КАК НачалоПериода,
		|	_Данные.КонецПериода КАК КонецПериода
		|ИЗ
		|	_Данные КАК _Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Данные КАК _Данные1
		|		ПО _Данные.ПорядковыйНомер <> _Данные1.ПорядковыйНомер
		|			И _Данные.ДБО = _Данные1.ДБО
		|			И _Данные.Валютный = _Данные1.Валютный
		|			И _Данные.ДБО <> НЕОПРЕДЕЛЕНО
		|			И (_Данные1.НачалоПериода МЕЖДУ _Данные.НачалоПериода И _Данные.КонецПериода
		|				ИЛИ _Данные1.КонецПериода МЕЖДУ _Данные.НачалоПериода И _Данные.КонецПериода)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДБО,
		|	Валютный,
		|	НачалоПериода,
		|	КонецПериода
		|ИТОГИ ПО
		|	ДБО,
		|	Валютный";
	
	ВыборкаДБО = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДБО.Следующий() Цикл
		
		ДанныеОтчетов = Неопределено;
		
		ВыборкаВалютный = ВыборкаДБО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВалютный.Следующий() Цикл
			
			ТекстСообщения = "По договору " + ВыборкаДБО.ДБО;
			
			ТекстСообщения = ТекстСообщения + " с признаком 'Валютный' = '" + Формат(ВыборкаВалютный.Валютный, "БЛ=Нет; БИ=Да") + "' обнаружено наличие дублей файлов-отчетов брокера по периодам:";
			
			Выборка = ВыборкаВалютный.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + "с " + Формат(Выборка.НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(Выборка.КонецПериода, "ДФ=dd.MM.yyyy");
				
			КонецЦикла;
			
			ТекстСообщения = ТекстСообщения + "
				|Это означает, что в каталоге '" + Каталог + "' существует несколько файлов-отчетов, содержащих информацию за одинаковый период, и дублирующих данные друг друга.";
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЦикла;
		
	КонецЦикла;
	
	#КонецОбласти
	
	Если ДанныеОтчетов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВремяПолученияДанных",	ДанныеОтчетов.ВремяПолученияДанных);
	Результат.Вставить("МВТ",					ПоместитьДанныеОтчетовВМВТ(ДанныеОтчетов, Брокер, КонецПериода));
	
	Возврат Результат;

КонецФункции 

Функция ПодготовитьСтруктуруЗагружаемыхРазделов(ЗагружаемыеРазделы)

	Результат = Новый Структура;
	
	Результат.Вставить("ДатаФормированияОтчета", Истина);
	Результат.Вставить("ДатаОтчета",             Истина);
	Результат.Вставить("ДБОИСА",                 Истина);
	
	Результат.Вставить("ОстаткиДенежныхСредств",			Истина);
	Результат.Вставить("ОбязательстваПоДенежнымСредствам",	Истина);
	
	Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаНачало",	Истина);
	Результат.Вставить("НачисленнаяКомиссияЗаПериод",				Истина);
	Результат.Вставить("ОплаченнаяКомиссияЗаПериод",				Истина);
	Результат.Вставить("ОстаткиЗадолженностиПоКомиссииНаКонец",		Истина);
	
	Результат.Вставить("ДвиженияДенежныхСредств",				Истина);
	Результат.Вставить("ЗаблокированныеДенежныеСредства",		Истина);
	Результат.Вставить("ОжидаемыеПоступленияДенежныхСредств",	Истина);
	
	Результат.Вставить("КонверсионныеСделки",				Истина);
	Результат.Вставить("НезавершенныеКонверсионныеСделки",	Истина);
	
	Результат.Вставить("ЗаблокированныеАкции",		Истина);
	Результат.Вставить("ЗаблокированныеОблигации",	Истина);
	Результат.Вставить("ЗаблокированныеПаи",		Истина);
	
	Результат.Вставить("ОстаткиАкций",		Истина);
	Результат.Вставить("ОстаткиОблигаций",	Истина);
	Результат.Вставить("ОстаткиПаев",		Истина);
	
	Результат.Вставить("ЗадолженностьПоЦБ", Истина);
	
	Результат.Вставить("ДвиженияАкций",		Истина);
	Результат.Вставить("ДвиженияОблигаций",	Истина);
	Результат.Вставить("ДвиженияПаев",		Истина);
	
	Результат.Вставить("ОжидаемыеПоступленияАкций",		Истина);
	Результат.Вставить("ОжидаемыеПоступленияОблигаций",	Истина);
	Результат.Вставить("ОжидаемыеПоступленияПаев",		Истина);
	
	Результат.Вставить("СделкиСАкциями",		Ложь);
	Результат.Вставить("СделкиСОблигациями",	Ложь);
	Результат.Вставить("СделкиСПаями",			Ложь);
	
	Если ЗагружаемыеРазделы <> Неопределено Тогда
		Для каждого ЭлементСтруктуры Из Результат Цикл
			Результат[ЭлементСтруктуры.Ключ] = (ЗагружаемыеРазделы.Найти(ЭлементСтруктуры.Ключ) <> Неопределено);
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

Функция ПолучитьСтруктуруДанныхOTBR()
	
	СтруктураДанных = Новый Структура("Accounts, Accounts_Divisions, Agreements, Currencies, Currencies_Pairs, КодыЦенныхБумаг, Depo_Remains, Money_Remains");
	
	Accounts = Новый ТаблицаЗначений;
	Accounts.Колонки.Добавить("Ключ"        , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Accounts.Колонки.Добавить("ID"          , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts.Колонки.Добавить("Firm_ID"     , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts.Колонки.Добавить("Partner_ID"  , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts.Колонки.Добавить("Agreement_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts.Колонки.Добавить("Number"      , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts.Колонки.Добавить("Type"        , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Accounts.Колонки.Добавить("Sub_Type"    , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	СтруктураДанных.Accounts = Accounts;
	
	Accounts_Divisions = Новый ТаблицаЗначений;
	Accounts_Divisions.Колонки.Добавить("Ключ"      , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Accounts_Divisions.Колонки.Добавить("ID"        , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts_Divisions.Колонки.Добавить("Account_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts_Divisions.Колонки.Добавить("Number"    , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Accounts_Divisions.Колонки.Добавить("Секция"    , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	СтруктураДанных.Accounts_Divisions = Accounts_Divisions;
	
	Agreements = Новый ТаблицаЗначений;
	Agreements.Колонки.Добавить("Ключ"       , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Agreements.Колонки.Добавить("ID"         , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Agreements.Колонки.Добавить("Number"     , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Agreements.Колонки.Добавить("Type"       , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Agreements.Колонки.Добавить("Date_Signed", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	СтруктураДанных.Agreements = Agreements;
	
	Currencies = Новый ТаблицаЗначений;
	Currencies.Колонки.Добавить("Ключ"    , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Currencies.Колонки.Добавить("ID"      , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Currencies.Колонки.Добавить("ISO_Code", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	СтруктураДанных.Currencies = Currencies;
	
	Currencies_Pairs = Новый ТаблицаЗначений;
	Currencies_Pairs.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Currencies_Pairs.Колонки.Добавить("ID"  , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Currencies_Pairs.Колонки.Добавить("Code", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	СтруктураДанных.Currencies_Pairs = Currencies_Pairs;
	
	КодыЦенныхБумаг = Новый ТаблицаЗначений; // Bonds, Shares, Bills, Derivatives, DRs, Funds,
	КодыЦенныхБумаг.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	КодыЦенныхБумаг.Колонки.Добавить("ID"  , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	КодыЦенныхБумаг.Колонки.Добавить("Тип" , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	СтруктураДанных.КодыЦенныхБумаг = КодыЦенныхБумаг;
	
	Depo_Remains = Новый ТаблицаЗначений;
	Depo_Remains.Колонки.Добавить("Ключ"                     , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Depo_Remains.Колонки.Добавить("Date"                     , Новый ОписаниеТипов("Дата"));
	Depo_Remains.Колонки.Добавить("Inner_Account_Division_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Depo_Remains.Колонки.Добавить("Depo_Storage_Place"       , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Depo_Remains.Колонки.Добавить("Division_Type"            , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Depo_Remains.Колонки.Добавить("Security_ID"              , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Depo_Remains.Колонки.Добавить("Volume"                   , Новый ОписаниеТипов("Число"));
	СтруктураДанных.Depo_Remains = Depo_Remains;
	
	Money_Remains = Новый ТаблицаЗначений;
	Money_Remains.Колонки.Добавить("Ключ"                     , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Money_Remains.Колонки.Добавить("Date"                     , Новый ОписаниеТипов("Дата"));
	Money_Remains.Колонки.Добавить("Inner_Account_Division_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Money_Remains.Колонки.Добавить("Money_Storage_Place"      , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Money_Remains.Колонки.Добавить("Division_Type"            , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	Money_Remains.Колонки.Добавить("Currency_Code"            , Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	Money_Remains.Колонки.Добавить("Amount"                   , Новый ОписаниеТипов("Число"));
	СтруктураДанных.Money_Remains = Money_Remains;

	ДанныеПервыхУзлов = Новый ТаблицаЗначений;
	ДанныеПервыхУзлов.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ДанныеПервыхУзлов.Колонки.Добавить("ЗначенияАтрибутов");
	ДанныеПервыхУзлов.Колонки.Добавить("ФайлСоответствуетФормату", Новый ОписаниеТипов("Булево"));
	
	СтруктураДанных.Вставить("ДанныеПервыхУзлов", ДанныеПервыхУзлов);
	
	Возврат СтруктураДанных;
	
КонецФункции //ПолучитьСтруктуруДанныхOTBR

Процедура ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ОбъектXDTO, СтруктураДанных, ИмяФайла, ДатаСверки, ИмяТаблицы = "", РекурсивныйВызов = Ложь)
	
	Если Не РекурсивныйВызов Тогда
		ДанныеПервогоУзла = Новый Структура("Account_Number, Date_From, Date_To, Recipient, Sender, Sender_System");
	КонецЕсли;
	
	Для Каждого СвойствоОбъектаXDTO Из ОбъектXDTO.Свойства() Цикл
		
		//Исключены операции и неиспользуемые справочники.
		Если СвойствоОбъектаXDTO.Имя = "Operations" Или СвойствоОбъектаXDTO.Имя = "Firms" 
			Или СвойствоОбъектаXDTO.Имя = "Persons" Или СвойствоОбъектаXDTO.Имя = "Enums_Values" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СвойствоОбъектаXDTO.Форма = ФормаXML.Элемент Тогда
			
			Если СвойствоОбъектаXDTO.ВерхняяГраница = 1 Тогда  //у cписка XDTO ВерхняяГраница = -1 
				ЗначениеСвойстваОбъектаXDTO = ОбъектXDTO.Получить(СвойствоОбъектаXDTO);
			Иначе
				ЗначениеСвойстваОбъектаXDTO = ОбъектXDTO.ПолучитьСписок(СвойствоОбъектаXDTO);
			КонецЕсли;
			
			Если СвойствоОбъектаXDTO.Имя = "Record" Тогда //Может состоять из списка, может состоять из атрибутов (если одна запись)
				
				// Bonds, Shares, Bills, Derivatives, DRs, Funds,
				// Для сверки остатков цб нам нужен только код матрих
				Если СтрНайти("Bonds, Shares, Bills, Derivatives, DRs, Funds", ИмяТаблицы) > 0 Тогда
					ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO(ЗначениеСвойстваОбъектаXDTO, СтруктураДанных["КодыЦенныхБумаг"], ИмяТаблицы, ИмяФайла, Истина);
				ИначеЕсли СтруктураДанных.Свойство(ИмяТаблицы) Тогда
					ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO(ЗначениеСвойстваОбъектаXDTO, СтруктураДанных[ИмяТаблицы], ИмяТаблицы, ИмяФайла, Ложь);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не настроена загрузка для элемента файла " + ИмяТаблицы + "");
				КонецЕсли;
			
				Продолжить;
			
			Иначе
				ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO(ЗначениеСвойстваОбъектаXDTO, СтруктураДанных, ИмяФайла, ДатаСверки, СвойствоОбъектаXDTO.Имя, Истина);
			КонецЕсли
			
		ИначеЕсли СвойствоОбъектаXDTO.Форма = ФормаXML.Атрибут Тогда
			
			Если ДанныеПервогоУзла.Свойство(СвойствоОбъектаXDTO.Имя) Тогда
				
				ДанныеПервогоУзла[СвойствоОбъектаXDTO.Имя] = ОбъектXDTO.Получить(СвойствоОбъектаXDTO);
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта " + ИмяФайла + " в первом узле присутствует неописанный атрибут [" + СвойствоОбъектаXDTO.Имя + "]"); 
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не настроено правило десериализации для типа: " + ТипЗнч(ЗначениеСвойстваОбъектаXDTO) + "!");		
		КонецЕсли;
		
	КонецЦикла;
	
	Если РекурсивныйВызов Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Если Не ЗначениеЗаполнено(ДанныеПервогоУзла.Account_Number)  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] не заполнено значение атрибута первого узла [Account_Number]!");	
		ЕстьОшибки = Истина;
	КонецЕсли;
		
	Если ДанныеПервогоУзла.Date_From <> Формат(ДатаСверки, "ДФ=""гггг-ММ-дд""") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Date_From = " + ДанныеПервогоУзла.Date_From + "] не соответствет дате импорта!");
		ЕстьОшибки = Истина;
	КонецЕсли;
		
	Если ДанныеПервогоУзла.Date_To <> Формат(ДатаСверки, "ДФ=""гггг-ММ-дд""") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Date_To = " + ДанныеПервогоУзла.Date_To + "] не соответствет дате импорта!");
		ЕстьОшибки = Истина;
	КонецЕсли;
			
	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionAM" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionAM.PIF")  
		Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionTR" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionTR.PIF") 
		Или ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") И Не (ДанныеПервогоУзла.Recipient = "OTBR.RegionPI" Или ДанныеПервогоУзла.Recipient = "OTBR.RegionPI.PIF") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Recipient = " + ДанныеПервогоУзла.Recipient + "] не соответствет организации [" + ЭтотОбъект.Организация + "]!");	
		ЕстьОшибки = Истина;
	КонецЕсли;
			
	Если ДанныеПервогоУзла.Sender <> "Region.BC" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Sender = " + ДанныеПервогоУзла.Sender + "] не соответствет формату обмена данных!");
		ЕстьОшибки = Истина;
	КонецЕсли;
				
	Если ДанныеПервогоУзла.Sender_System <> "MX1" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] значение атрибута первого узла [Sender_System = " + ДанныеПервогоУзла.Sender_System + "] не соответствет формату обмена данных!");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	НоваяСтрока                          = СтруктураДанных.ДанныеПервыхУзлов.Добавить();
	НоваяСтрока.Ключ                     = ИмяФайла;
	НоваяСтрока.ЗначенияАтрибутов        = ДанныеПервогоУзла;
	НоваяСтрока.ФайлСоответствуетФормату = Не ЕстьОшибки;
			
КонецПроцедуры //ЗаполнитьСтруктуруДаннымиИзОбъектаXTDO

Процедура ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO(ЗначниеОбъектаXDTO, ТаблицаПриемникДанных, ТаблицаИсточникИмя, ИмяФайла, ЗаписывитьТолькоID)
	
	Если ТипЗнч(ЗначниеОбъектаXDTO) = Тип("ОбъектXDTO") Тогда
				
		НоваяСтрока = ТаблицаПриемникДанных.Добавить();
		
		Для Каждого Свойство Из ЗначниеОбъектаXDTO.Свойства() Цикл
			
			Если ЗаписывитьТолькоID И Свойство.Имя = "ID" Тогда
				
				НоваяСтрока[Свойство.Имя] = ЗначниеОбъектаXDTO[Свойство.Имя];
				НоваяСтрока.Тип = ТаблицаИсточникИмя;
				Прервать;
				
			КонецЕсли;
			
			Если ТаблицаПриемникДанных.Колонки.Найти(Свойство.Имя) = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] присутствует атрибут [" + Свойство.Имя + "], который не описан в таблице [" + ТаблицаИсточникИмя + "] структуры данных!");
			Иначе
				
				Если ТаблицаИсточникИмя = "Accounts_Divisions" И Свойство.Имя = "Number" Тогда
				
					Данные = ПолучитьКодИСекцию(ЗначниеОбъектаXDTO[Свойство.Имя]);	
					НоваяСтрока[Свойство.Имя] = Данные.Код;
					НоваяСтрока.Секция = Данные.Секция;
					
				ИначеЕсли (ТаблицаИсточникИмя = "Depo_Remains" Или ТаблицаИсточникИмя = "Money_Remains") И  Свойство.Имя = "Date" Тогда
					НоваяСтрока[Свойство.Имя] = Дата(СтрЗаменить(ЗначниеОбъектаXDTO[Свойство.Имя], "-", ""));	
				Иначе
					НоваяСтрока[Свойство.Имя] = ЗначниеОбъектаXDTO[Свойство.Имя];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока.Ключ = ИмяФайла;
		
	ИначеЕсли ТипЗнч(ЗначниеОбъектаXDTO) = Тип("СписокXDTO") Тогда
	
		Для Каждого СтрокаСписка Из ЗначниеОбъектаXDTO Цикл
			
			НоваяСтрока = ТаблицаПриемникДанных.Добавить();
			
			Для Каждого Свойство Из СтрокаСписка.Свойства() Цикл
				
				Если ЗаписывитьТолькоID И Свойство.Имя = "ID" Тогда
					
					НоваяСтрока[Свойство.Имя] = СтрокаСписка[Свойство.Имя];
					НоваяСтрока.Тип = ТаблицаИсточникИмя;
					Прервать;
					
				КонецЕсли;
				
				Если ТаблицаПриемникДанных.Колонки.Найти(Свойство.Имя) = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле импорта [" + ИмяФайла + "] присутствует атрибут [" + Свойство.Имя + "], который не описан в таблице [" + ТаблицаИсточникИмя + "] структуры данных!");
				Иначе
										
					Если ТаблицаИсточникИмя = "Accounts_Divisions" И Свойство.Имя = "Number" Тогда
						
						Данные = ПолучитьКодИСекцию(СтрокаСписка[Свойство.Имя]);
						НоваяСтрока[Свойство.Имя] = Данные.Код;
						НоваяСтрока.Секция = Данные.Секция;
						
					ИначеЕсли (ТаблицаИсточникИмя = "Depo_Remains" Или ТаблицаИсточникИмя = "Money_Remains") И  Свойство.Имя = "Date" Тогда
						
						НоваяСтрока[Свойство.Имя] = Дата(СтрЗаменить(СтрокаСписка[Свойство.Имя], "-", ""));
										
					Иначе
						НоваяСтрока[Свойство.Имя] = СтрокаСписка[Свойство.Имя];
					КонецЕсли;

				КонецЕсли;
				
			КонецЦикла;
			
			НоваяСтрока.Ключ = ИмяФайла;
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры //ЗаполнитьТаблицуЗначенийДаннымиИзОбъектаXTDO()

Функция ПолучитьКодИСекцию(Номер)
	
	Код = "";
	Секция = "";
	
	Если СтрНайти(Номер, "_VN") > 0 Тогда
		Код = СтрЗаменить(Номер, "_VN", "");
		Секция = "Внебиржевая";
	ИначеЕсли СтрНайти(Номер, "_OTC") > 0 Тогда //новые коды
		Код = СтрЗаменить(Номер, "_OTC", "");
		Секция = "Внебиржевая";
	ИначеЕсли СтрНайти(Номер, "_FX") > 0 Тогда //новые коды
		Код = СтрЗаменить(Номер, "_FX", "");
		Секция = "Валютная";
	ИначеЕсли СтрНайти(Номер, "_V") > 0 Тогда
		Код = СтрЗаменить(Номер, "_V", "");
		Секция = "Валютная";
	ИначеЕсли СтрНайти(Номер, "V") > 0 Тогда
		Код = СтрЗаменить(Номер, "V", "");
		Секция = "Валютная";
	ИначеЕсли СтрНайти(Номер, "_R") > 0 Тогда 
		Код = СтрЗаменить(Номер, "_R", "");
		Секция = "Репо";
	ИначеЕсли СтрНайти(Номер, "_FO") > 0 Тогда //новые коды
		Код = СтрЗаменить(Номер, "_FO", "");
		Секция = "Фортс";
	ИначеЕсли СтрНайти(Номер, "_F") > 0 Тогда
		Код = СтрЗаменить(Номер, "_F", "");
		Секция = "Фортс";
	Иначе
		Код = Номер;
		Секция = "Основная";
	КонецЕсли;

	Возврат Новый Структура("Код, Секция", Код, Секция);
	
КонецФункции //ПолучитьКодИСекцию

// Функция исключительно для вызова извне.
Функция ПолучитьСтруктуруРезультата(Брокер, Период, Каталог, СверкаСМесячнымОтчетомБрокера, ЗагружаемыеРазделы = Неопределено, ПропускатьСтрокиЕслиЦБНеНайдена = Истина) Экспорт

	ЗагружаемыеРазделы = ПодготовитьСтруктуруЗагружаемыхРазделов(ЗагружаемыеРазделы);
	
	Результат = ПодготовитьПустуюСтруктуруРезультата(ЗагружаемыеРазделы, ПропускатьСтрокиЕслиЦБНеНайдена);
	
	#Область ЗагрузкаДанныхОтчетовБрокера
	СодержимоеФайлов = ПолучитьСодержимоеФайлов(Каталог, СверкаСМесячнымОтчетомБрокера);
	
	Если СодержимоеФайлов <> Неопределено Тогда
		
		КешОбъектов = Новый Структура;
		КешОбъектов.Вставить("Валюты",		Новый Соответствие);
		КешОбъектов.Вставить("Акции",		Новый Соответствие);
		КешОбъектов.Вставить("Облигации",	Новый Соответствие);
		КешОбъектов.Вставить("Паи",			Новый Соответствие);
		
		Для Каждого ТекОтчет Из СодержимоеФайлов Цикл
			
			ДанныеОтчета = ДесериализоватьДанныеОтчета(НачалоДня(Период), КонецДня(Период), ТекОтчет.Данные, Организация, Брокер, КешОбъектов, ЗагружаемыеРазделы, ПропускатьСтрокиЕслиЦБНеНайдена, СверкаСМесячнымОтчетомБрокера);
			
			Если ДанныеОтчета <> Неопределено Тогда
				Для каждого Раздел Из ДанныеОтчета Цикл
					Если Результат.Свойство(Раздел.Ключ) Тогда 
						Для Каждого ТекСтрока Из ДанныеОтчета[Раздел.Ключ] Цикл
							НоваяСтрока = Результат[Раздел.Ключ].Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла; 
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	#КонецОбласти
	
	Возврат Результат;

КонецФункции

Функция ПолучитьКодЦеннойБумагиИзСтроки(Строка)

	Код = "";
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("ГДР, ГОС. РЕГ. ");
	Идентификаторы.Добавить("ГДР, ISIN ");
	Идентификаторы.Добавить("АДР, ГОС. РЕГ. ");
	Идентификаторы.Добавить("АДР, ISIN ");
	Идентификаторы.Добавить("ГОС. РЕГ. ");
	Идентификаторы.Добавить("ISIN ");
	
	Для каждого Идентификатор Из Идентификаторы Цикл
	
		ПозицияИдентификатора = СтрНайти(Строка, Идентификатор);
		Если ПозицияИдентификатора > 0 Тогда
			
			Код = Сред(Строка, ПозицияИдентификатора + СтрДлина(Идентификатор));
			Прервать;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Код = "" Тогда
		Код = Строка;
	КонецЕсли; 
	
	Если СтрНачинаетсяС(Код, ВРег("не предусмотрен")) Тогда
		
		Код = ВРег("не предусмотрен");
		
	Иначе
		
		Разделители = Новый Массив;
		Разделители.Добавить(" ");
		Разделители.Добавить(",");
		
		Для каждого Разделитель Из Разделители Цикл
			
			ПозицияРазделителя = СтрНайти(Код, Разделитель);
			
			Если ПозицияРазделителя > 0 Тогда
			
				Код = Лев(Код, ПозицияРазделителя - 1);
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 
		
	Возврат Код;

КонецФункции
 
Функция ПолучитьЗначениеЯчейки(ТекстФайла, ИндексСтроки)

	Строка = "";
	Пока Не СтрЗаканчиваетсяНа(Строка, "</TD>") Цикл
		
		Строка = Строка + ПолучитьСтроку(ТекстФайла, ИндексСтроки);
	
	КонецЦикла; 
	
	Строка = СтрЗаменить(СтрЗаменить(Строка, "<TD>", ""), "</TD>", "");
	
	Возврат Строка;

КонецФункции
 

#КонецОбласти
