
Функция ПолучитьКредитныйИнструмент(ДанныеОбъекта) Экспорт
	
	СубъектАналитики = Новый Структура("ДепозитныйВклад, КредитныйИнструмент");
	ЗаполнитьЗначенияСвойств(СубъектАналитики, ДанныеОбъекта);
	
	Если ЗначениеЗаполнено(СубъектАналитики.ДепозитныйВклад) Тогда
		Возврат СубъектАналитики.ДепозитныйВклад;
	ИначеЕсли ЗначениеЗаполнено(СубъектАналитики.КредитныйИнструмент) Тогда
		Возврат СубъектАналитики.КредитныйИнструмент;
	Иначе
		Если ТипЗнч(ДанныеОбъекта) = Тип("Структура") Тогда
			Ссылка = Неопределено;
			Если ДанныеОбъекта.Свойство("Ссылка",Ссылка) И НЕ ЗначениеЗаполнено(Ссылка) Тогда
				//все ок, овый документ еще не заполнен
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		ВызватьИсключение "Не удалось получить депозитный вклад"
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ДанныеОбъекта, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		 Период = ?(ЗначениеЗаполнено(ДанныеОбъекта.Ссылка), Новый Граница(ДанныеОбъекта.МоментВремени(), ВидГраницы.Исключая), ТекущаяДатаСеанса());
	КонецЕсли; 

	НоминалИДатаПогашенияКредитногоИнструмента = Новый Структура("ТекущийНоминал, ДатаПогашения");
	КредитныйИнструмент = ПолучитьКредитныйИнструмент(ДанныеОбъекта);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток, 0) КАК ТекущийНоминал,
		|	ЕСТЬNULL(УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, НЕОПРЕДЕЛЕНО) КАК ДатаПогашения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&Период,
		|			КредитныйИнструмент = &КредитныйИнструмент
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент = &КредитныйИнструмент
		|					И ДатаНачалаДействияУсловий <= &ДатаПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментовСрезПоследних.Действует)
		|
		|УПОРЯДОЧИТЬ ПО
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий УБЫВ";

	Запрос.УстановитьПараметр("КредитныйИнструмент",          КредитныйИнструмент);
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("ДатаПериода", 				  СистемныеФункции.ПолучитьДатуИзГраницы(Период));
	Запрос.УстановитьПараметр("Организация", 				  ДанныеОбъекта.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеОбъекта.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НоминалИДатаПогашенияКредитногоИнструмента, Выборка);
	Иначе
		НоминалИДатаПогашенияКредитногоИнструмента.ТекущийНоминал = 0;
		НоминалИДатаПогашенияКредитногоИнструмента.ДатаПогашения  = Неопределено;
	КонецЕсли;
		
	Возврат НоминалИДатаПогашенияКредитногоИнструмента;

КонецФункции

Функция ПолучитьДатуПогашенияКредитногоИнструмента(КредитныйИнструмент, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЕСТЬNULL(УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, НЕОПРЕДЕЛЕНО) КАК ДатаПогашения
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Период,
		|			КредитныйИнструмент = &КредитныйИнструмент
		|				И ДатаНачалаДействияУсловий <= &ДатаПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Действует
		|
		|УПОРЯДОЧИТЬ ПО
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий УБЫВ";

	Запрос.УстановитьПараметр("КредитныйИнструмент",          КредитныйИнструмент);
	Запрос.УстановитьПараметр("Период", 					  Период);
	Запрос.УстановитьПараметр("ДатаПериода", 				  СистемныеФункции.ПолучитьДатуИзГраницы(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаПогашения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДанныеКредитногоИнструмента(КредитныйИнструмент, Знач Период = Неопределено) Экспорт
	
	ДанныеКредитногоИнструмента = Новый Структура("ДатаПогашения, Процент, Контрагент, КраткоеНаименованиеКонтрагента, Номинал, НомерДоговора, ДатаОткрытия, НаименованиеБанка, ДоВостребования, ЭтоЗаймПолученный, ВидКредитногоИнструмента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментов.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментов.Процент КАК Процент,
		|	ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо КАК Контрагент,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток, 0) КАК Номинал,
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.Ссылка.НомерПодтверждения = """"
		|			ТОГДА ДепозитныеВклады.Ссылка.БанковскийСчет.Договор.НомерДоговора
		|		ИНАЧЕ ДепозитныеВклады.Ссылка.БанковскийСчет.Договор.НомерДоговора + ""("" + ДепозитныеВклады.Ссылка.НомерПодтверждения + "")""
		|	КОНЕЦ КАК НомерДоговора,
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.Ссылка.ДатаПодтверждения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДепозитныеВклады.Ссылка.БанковскийСчет.Договор.ДатаЗаключения
		|		ИНАЧЕ ДепозитныеВклады.Ссылка.ДатаПодтверждения
		|	КОНЕЦ КАК ДатаОткрытия,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеБанка,
		|	ДепозитныеВклады.ДоВостребования КАК ДоВостребования,
		|	ЛОЖЬ КАК ЭтоЗаймПолученный,
		|	УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеКонтрагента,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный) КАК ВидКредитногоИнструмента,
		|	УсловияКредитныхИнструментов.СрокВозвратаДепозитаПоТребованиюКлиента КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент = &КредитныйИнструмент
		|					И ДатаНачалаДействияУсловий <= &ДатаПериода) КАК УсловияКредитныхИнструментов
		|		ПО ДепозитныеВклады.Ссылка = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментов.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(&Период, КредитныйИнструмент = &КредитныйИнструмент) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПО ДепозитныеВклады.Ссылка = ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	ДепозитныеВклады.Ссылка = &КредитныйИнструмент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияКредитныхИнструментов.ДатаПогашения,
		|	УсловияКредитныхИнструментов.Процент,
		|	УсловияКредитныхИнструментов.Контрагент,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток, 0),
		|	Займы.НомерДоговора,
		|	НАЧАЛОПЕРИОДА(НоминалыКредитныхИнструментовСрезПервых.Период, ДЕНЬ),
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу, РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество),
		|	НЕОПРЕДЕЛЕНО,
		|	Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Полученный),
		|	УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, 1, 1) + ""."" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, 1, 1) + "".""),
		|	Займы.ВидКредитногоИнструмента,
		|	УсловияКредитныхИнструментов.СрокВозвратаДепозитаПоТребованиюКлиента
		|ИЗ
		|	Справочник.Займы КАК Займы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент = &КредитныйИнструмент
		|					И ДатаНачалаДействияУсловий <= &ДатаПериода) КАК УсловияКредитныхИнструментов
		|		ПО Займы.Ссылка = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментов.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Организация = &Организация) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО (УсловияКредитныхИнструментов.Контрагент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Организация = &Организация) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО (УсловияКредитныхИнструментов.Контрагент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(&Период, КредитныйИнструмент = &КредитныйИнструмент) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПО Займы.Ссылка = ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых(, КредитныйИнструмент = &КредитныйИнструмент) КАК НоминалыКредитныхИнструментовСрезПервых
		|		ПО Займы.Ссылка = НоминалыКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|ГДЕ
		|	Займы.Ссылка = &КредитныйИнструмент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействияУсловий УБЫВ";
	
	Если Период = Неопределено Тогда 
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Период",          		Период);
	Запрос.Параметры.Вставить("КредитныйИнструмент", 	КредитныйИнструмент);
	Запрос.Параметры.Вставить("Организация", 			КредитныйИнструмент.Организация);
	Запрос.УстановитьПараметр("ДатаПериода", 			СистемныеФункции.ПолучитьДатуИзГраницы(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКредитногоИнструмента, Выборка);
	КонецЕсли;
	
	Возврат ДанныеКредитногоИнструмента;
	
КонецФункции

Функция ПроверитьУникальностьПериодаНачисленияПроцентов(ДанныеОбъекта, Отказ) Экспорт

	Если ДанныеОбъекта.ЧастичныйПриходПроцентов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.НачалоПериода) И Не ЗначениеЗаполнено(ДанныеОбъекта.ОкончаниеПериода) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КредитныйИнструмент = ПолучитьКредитныйИнструмент(ДанныеОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПроцентыПоКредитнымИнструментам.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПроцентыПоКредитнымИнструментам КАК ПроцентыПоКредитнымИнструментам
		|ГДЕ
		|	ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = &КредитныйИнструмент
		|	И ПроцентыПоКредитнымИнструментам.Организация = &Организация
		|	И ПроцентыПоКредитнымИнструментам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (&НачалоПериода МЕЖДУ ПроцентыПоКредитнымИнструментам.НачалоПериода И ПроцентыПоКредитнымИнструментам.ОкончаниеПериода
		|			ИЛИ &ОкончаниеПериода МЕЖДУ ПроцентыПоКредитнымИнструментам.НачалоПериода И ПроцентыПоКредитнымИнструментам.ОкончаниеПериода)
		|	И НЕ ПроцентыПоКредитнымИнструментам.Частичный
		|	И ПроцентыПоКредитнымИнструментам.Регистратор <> &Регистратор";
		
	Запрос.УстановитьПараметр("КредитныйИнструмент",          КредитныйИнструмент);
	Запрос.УстановитьПараметр("Организация",                  ДанныеОбъекта.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеОбъекта.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода",                ДанныеОбъекта.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",             ДанныеОбъекта.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Регистратор",                  ДанныеОбъекта.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период начисления процентов пересекается с периодом документа " + Выборка.Регистратор + "!", ДанныеОбъекта, "НачалоПериода",, Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПериодНачисленияПроцентов(ДанныеОбъекта) Экспорт
	
	ПериодНачисленияПроцентов = Новый Структура("НачалоПериода, ОкончаниеПериода", Дата(1, 1, 1), Дата(1, 1, 1));
	
	КредитныйИнструмент = ПолучитьКредитныйИнструмент(ДанныеОбъекта);
	
	Если Не ЗначениеЗаполнено(КредитныйИнструмент) Или Не ЗначениеЗаполнено(ДанныеОбъекта.Организация)
		Или Не ЗначениеЗаполнено(ДанныеОбъекта.СчетДоверительногоУправления)
	Тогда
		Возврат ПериодНачисленияПроцентов;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА ВЫБОР
		|					КОГДА ДОБАВИТЬКДАТЕ(ПроцентыПоКредитнымИнструментам.ОкончаниеПериода, ДЕНЬ, 1) > ДепозитныеВклады.ДатаНачалаНачисленияПроцентов
		|						ТОГДА ДОБАВИТЬКДАТЕ(ПроцентыПоКредитнымИнструментам.ОкончаниеПериода, ДЕНЬ, 1)
		|					ИНАЧЕ ДепозитныеВклады.ДатаНачалаНачисленияПроцентов
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ПроцентыПоКредитнымИнструментам.ОкончаниеПериода > НоминалыКредитныхИнструментовСрезПервых.Период
		|					ТОГДА ДОБАВИТЬКДАТЕ(ПроцентыПоКредитнымИнструментам.ОкончаниеПериода, ДЕНЬ, 1)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НоминалыКредитныхИнструментовСрезПервых.Период, ДЕНЬ, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК НачалоПериода
		|ИЗ
		|	РегистрСведений.ПроцентыПоКредитнымИнструментам.СрезПоследних(
		|			&Период,
		|			КредитныйИнструмент = &КредитныйИнструмент
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ПроцентыПоКредитнымИнструментам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых КАК НоминалыКредитныхИнструментовСрезПервых
		|			ПО Займы.Ссылка = НоминалыКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|		ПО ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = Займы.Ссылка";
			
	Запрос.УстановитьПараметр("КредитныйИнструмент",          КредитныйИнструмент);
	Запрос.УстановитьПараметр("Период",                       ?(ЗначениеЗаполнено(ДанныеОбъекта.Ссылка), Новый Граница(ДанныеОбъекта.Ссылка.МоментВремени(), ВидГраницы.Исключая), ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация",                  ДанныеОбъекта.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеОбъекта.СчетДоверительногоУправления);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПериодНачисленияПроцентов, Выборка);
	КонецЕсли;
	
	Возврат ПериодНачисленияПроцентов;
	
КонецФункции // ПолучитьПериодНачисленияПроцентов

Функция РасчетВисокосныхИОбычныхДней(Знач НачальнаяДата, Знач КонечнаяДата, ЭтоДепозитныйВклад = Истина) Экспорт
	//для депозитных вкладов:
	//	1. возвращает "ночи", т.е получив период 31.21.2019 - 01.01.2010 вернет 0 Дней365 и 1 Дней366.
	//	2. т.к. проценты начисляются с начальной даты (исключая) по конечную включительно, условия начинают действовать со следующей даты.
	//для займов:
	//	1. возвращает прошедшие "дни", т.е. получив период 31.21.2019 - 01.01.2010 вернет 1 Дней365 и 0 Дней366.
	//	2. т.к. проценты начисляются за период с начальной даты включительно по конечную (исключительно), условия начинают действовать с даты изменения.
	//НачальнаяДата - дата изменения условий или дата размещения кредитного инструмента, КонечнаяДата - следующая дата изменения условий

	НачальнаяДата	= НачалоДня(НачальнаяДата);
	КонечнаяДата	= НачалоДня(КонечнаяДата);
	
	Дней366 = 0;
	Дней365 = 0;
	
	Если Год(НачальнаяДата) = Год(КонечнаяДата) Тогда
		Если ДеньГода(КонецГода(НачальнаяДата)) = 366 Тогда
			Дней366	= (КонечнаяДата - НачальнаяДата) / 86400;
		Иначе
			Дней365	= (КонечнаяДата - НачальнаяДата) / 86400;
		КонецЕсли;
		Возврат Новый Структура("Дней365,Дней366", Дней365, Дней366);
	КонецЕсли;
	
	Если ДеньГода(КонецГода(НачальнаяДата)) = 366 Тогда
		Дней366	= ДеньГода(КонецГода(НачальнаяДата)) - ДеньГода(НачальнаяДата) + ?(НЕ ЭтоДепозитныйВклад, 1, 0);
	Иначе
		Дней365	= ДеньГода(КонецГода(НачальнаяДата)) - ДеньГода(НачальнаяДата) + ?(НЕ ЭтоДепозитныйВклад, 1, 0);
	КонецЕсли;
	
	Если ДеньГода(КонецГода(КонечнаяДата)) = 366 Тогда
		Дней366 = Дней366 + ДеньГода(КонечнаяДата) - ?(НЕ ЭтоДепозитныйВклад, 1, 0);
	Иначе
		Дней365 = Дней365 + ДеньГода(КонечнаяДата) - ?(НЕ ЭтоДепозитныйВклад, 1, 0);
	КонецЕсли;
	
	Для Сч = Год(НачальнаяДата) + 1 По Год(КонечнаяДата) - 1 Цикл
		Если ДеньГода(КонецГода(Дата(Сч, 12, 31))) = 366 Тогда
			Дней366 = Дней366 + 366;
		Иначе
			Дней365 = Дней365 + 365;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Дней365,Дней366", Дней365, Дней366);

КонецФункции

Функция ПолучитьТипКредитногоИнструмента(КредитныйИнструмент) Экспорт 
	
	ТипЗначения = ТипЗнч(КредитныйИнструмент);
	
	Если ТипЗначения = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Возврат Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Займы") Тогда
		Возврат Перечисления.ТипыКредитныхИнструментов.Займ
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтоимостьКредитногоИнструмента(КредитныйИнструмент, Период, СчетДоверительногоУправления, Номинал = 0, Проценты = 0) Экспорт
	
	КредитныеИнструменты = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период,,,,, КредитныйИнструмент);
	
	СтрокаКредитныеИнструменты = КредитныеИнструменты.Найти(КредитныйИнструмент, "КредитныйИнструмент");
	
	Если СтрокаКредитныеИнструменты = Неопределено Тогда
		Номинал  = 0;
		Проценты = 0;
	Иначе
		Номинал  = СтрокаКредитныеИнструменты.Номинал;
		Проценты = СтрокаКредитныеИнструменты.Проценты;
	КонецЕсли;
	
	Возврат Номинал + Проценты;
	
КонецФункции

#Область ПроцедурыРасчетаСтоимостиКредитногоИнструмента

// Функция возвращает линейную стоимость кредитных инструментов, по которым есть остатки на &Период
Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
																	Знач Период, 
																	ТипКредитногоИнструмента = Неопределено,
																	НеУчитыватьДосрочноПолученныеПроценты = Ложь, 
																	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, 
																	ВЦеломПоДоговоруДУ = Ложь, 
																	КредитныйИнструмент = Неопределено,
																	ПроизвольнаяПроцентнаяСтавка = Неопределено,
																	ПоДатуПогашения = Ложь, 
																	ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток = Неопределено) Экспорт
																	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаСтоимостиКредитныхИнструментов = ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
		Период, ТипКредитногоИнструмента, НеУчитыватьДосрочноПолученныеПроценты, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, 
		ВЦеломПоДоговоруДУ, КредитныйИнструмент, ПроизвольнаяПроцентнаяСтавка, ПоДатуПогашения, МенеджерВременныхТаблиц);																
																	
	Если ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток <> Неопределено Тогда																
		ДобавитьСтрокиНоминалаВТаблицуСтоимостиКредитныхИнструментов(ТаблицаСтоимостиКредитныхИнструментов, МенеджерВременныхТаблиц, Период, Ложь, Истина);
		
		ПотокиКредитныхИнструментов = СвернутьТаблицуСтоимостиКредитногоИнструментаПоПотокам(ТаблицаСтоимостиКредитныхИнструментов);
	КонецЕсли;
	
	//Свернем таблицу, чтобы избавиться от лишних колонок. Колонку Номинал презаполним текущим номиналом
	ТаблицаСтоимостиКредитныхИнструментов.Свернуть("КредитныйИнструмент, Основание, ВидАктива", "Проценты, Задолженность, Номинал");
	
	//Добавим недостающую колонку с датой потока и разобъем нужные активы на денежные потоки
	Если ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток <> Неопределено Тогда	
		
		УдалитьСтрокиТаблицаСтоимостиКредитныхИнструментов = Новый Массив;
		ТаблицаСтоимостиКредитныхИнструментов.Колонки.Добавить("ДатаДенежногоПотока", Новый ОписаниеТипов("Дата"));
		
		КоличествоСтрокТаблицаСтоимостиКредитныхИнструментов = ТаблицаСтоимостиКредитныхИнструментов.Количество();
		Для СЦ = 0 ПО КоличествоСтрокТаблицаСтоимостиКредитныхИнструментов-1 Цикл
			
			СтрокаТаблицаСтоимостиКредитныхИнструментов = ТаблицаСтоимостиКредитныхИнструментов.Получить(СЦ);
			
			Если РаботаСоСтоимостьюПоРыночнойСтавке.НужныОтдельныеСтавкиПоПотокам(СчетДоверительногоУправления, СтрокаТаблицаСтоимостиКредитныхИнструментов.КредитныйИнструмент, 
					СтрокаТаблицаСтоимостиКредитныхИнструментов.ВидАктива, ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток) 
			Тогда
				
				УдалитьСтрокиТаблицаСтоимостиКредитныхИнструментов.Добавить(СтрокаТаблицаСтоимостиКредитныхИнструментов);
				СтрокиПотоков = ПотокиКредитныхИнструментов.НайтиСтроки(Новый Структура("КредитныйИнструмент, Основание", СтрокаТаблицаСтоимостиКредитныхИнструментов.КредитныйИнструмент, СтрокаТаблицаСтоимостиКредитныхИнструментов.Основание));
				
				Для Каждого СтрокаПотока Из СтрокиПотоков Цикл
					
					СтрокаСДатойПотока = ТаблицаСтоимостиКредитныхИнструментов.НайтиСтроки(Новый Структура("КредитныйИнструмент, Основание, ДатаДенежногоПотока",СтрокаТаблицаСтоимостиКредитныхИнструментов.КредитныйИнструмент, СтрокаТаблицаСтоимостиКредитныхИнструментов.Основание, СтрокаПотока.Период));
					Если СтрокаСДатойПотока.Количество()<>0 Тогда 
						//строка уже есть, добавим номинал или проценты
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов = СтрокаСДатойПотока[0];
					Иначе
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов = ТаблицаСтоимостиКредитныхИнструментов.Добавить();
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.КредитныйИнструмент = СтрокаТаблицаСтоимостиКредитныхИнструментов.КредитныйИнструмент;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Основание = СтрокаТаблицаСтоимостиКредитныхИнструментов.Основание;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.ВидАктива = СтрокаТаблицаСтоимостиКредитныхИнструментов.ВидАктива;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока = СтрокаПотока.Период;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Проценты = 0;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Задолженность = 0;
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Номинал = 0;
					КонецЕсли;
					
					Если СтрокаПотока.Тип = "Номинал" Тогда
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Номинал = НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Номинал + СтрокаПотока.Сумма;
					Иначе
						НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Проценты = НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Проценты + СтрокаПотока.Сумма;
					КонецЕсли;
					
					//для оплаченных процентов можно удалить пустые строки
					Если НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Номинал  = 0 И НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов.Проценты = 0 Тогда
						ТаблицаСтоимостиКредитныхИнструментов.Удалить(НоваяСтрокаТаблицаСтоимостиКредитныхИнструментов);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаКУдалению Из УдалитьСтрокиТаблицаСтоимостиКредитныхИнструментов Цикл
			ТаблицаСтоимостиКредитныхИнструментов.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
	//подготовим текущие номиналы
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(НоминалыКредитныхИнструментовСрезПоследних.Сумма, 0) КАК Номинал,
		|	_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_КредитныеИнструменты.Основание КАК Основание,
		|	_КредитныеИнструменты.ВидАктива КАК ВидАктива
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						К.КредитныйИнструмент
		|					ИЗ
		|						_КредитныеИнструменты КАК К)) КАК НоминалыКредитныхИнструментовСрезПоследних
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = НоминалыКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	_КредитныеИнструменты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0),
		|	_КредитныеИнструменты.КредитныйИнструмент,
		|	_КредитныеИнструменты.Основание,
		|	_КредитныеИнструменты.ВидАктива
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&Период,
		|				Основание В
		|						(ВЫБРАТЬ
		|							К.Основание
		|						ИЗ
		|							_КредитныеИнструменты КАК К)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму)
		|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО _КредитныеИнструменты.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание
		|ГДЕ
		|	_КредитныеИнструменты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоминалы = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаНоминалы.Следующий() Цикл
		СтрокиСтоимости = ТаблицаСтоимостиКредитныхИнструментов.НайтиСтроки(Новый Структура("КредитныйИнструмент, Основание", ВыборкаНоминалы.КредитныйИнструмент,ВыборкаНоминалы.Основание ));
		Если СтрокиСтоимости.Количество() <> 0 Тогда
			Для Каждого СтрокаСтоимости Из СтрокиСтоимости Цикл
				//для денежного потока номинал перезаписывать не надо, там правильный номинал
				Если ТаблицаСтоимостиКредитныхИнструментов.Колонки.Найти("ДатаДенежногоПотока") = Неопределено 
					ИЛИ НЕ ЗначениеЗаполнено(СтрокаСтоимости.ДатаДенежногоПотока) Тогда
					СтрокаСтоимости.Номинал = ВыборкаНоминалы.Номинал;
				КонецЕсли;
			КонецЦикла;
		Иначе
			//в дату размещения проценты еще не начислены
			СтрокаСтоимости = ТаблицаСтоимостиКредитныхИнструментов.Добавить();
			
			СтрокаСтоимости.КредитныйИнструмент = ВыборкаНоминалы.КредитныйИнструмент;
			СтрокаСтоимости.ВидАктива 			= ВыборкаНоминалы.ВидАктива;
			СтрокаСтоимости.Основание 			= ВыборкаНоминалы.Основание;
			СтрокаСтоимости.Проценты 			= 0;
			СтрокаСтоимости.Задолженность 		= 0;
			СтрокаСтоимости.Номинал 			= ВыборкаНоминалы.Номинал;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСтоимостиКредитныхИнструментов;
	
КонецФункции

Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРасшифровки(СчетДоверительногоУправления, 
																	Знач Период, 
																	ТипКредитногоИнструмента = Неопределено,
																	НеУчитыватьДосрочноПолученныеПроценты = Ложь, 
																	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, 
																	ВЦеломПоДоговоруДУ = Ложь, 
																	КредитныйИнструмент = Неопределено,
																	ПроизвольнаяПроцентнаяСтавка = Неопределено,
																	ПоДатуПогашения = Ложь) Экспорт
																
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаСтоимостиКредитныхИнструментов = ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
																	Период, 
																	ТипКредитногоИнструмента,
																	НеУчитыватьДосрочноПолученныеПроценты, 
																	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, 
																	ВЦеломПоДоговоруДУ, 
																	КредитныйИнструмент,
																	ПроизвольнаяПроцентнаяСтавка,
																	ПоДатуПогашения,
																	МенеджерВременныхТаблиц);																
	
	ДобавитьСтрокиНоминалаВТаблицуСтоимостиКредитныхИнструментов(ТаблицаСтоимостиКредитныхИнструментов, МенеджерВременныхТаблиц, Период, Истина, Ложь);
		
	ТаблицаСтоимостиКредитныхИнструментов.Сортировать("КредитныйИнструмент, Период");
	
	Возврат ТаблицаСтоимостиКредитныхИнструментов;
	
КонецФункции

Функция ПолучитьДенежныйПотокПоКредитномуИнструменту(СчетДоверительногоУправления, КредитныйИнструмент, Период) Экспорт

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаСтоимостиКредитногоИнструмента = ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
		Период, ?(ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.Займы"), Перечисления.ТипыКредитныхИнструментов.Займ, Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад),,,, 
		КредитныйИнструмент, , Истина,МенеджерВременныхТаблиц);																
	
	ДобавитьСтрокиНоминалаВТаблицуСтоимостиКредитныхИнструментов(ТаблицаСтоимостиКредитногоИнструмента, МенеджерВременныхТаблиц, Период, Ложь, Истина);
		
	Возврат СвернутьТаблицуСтоимостиКредитногоИнструментаПоПотокам(ТаблицаСтоимостиКредитногоИнструмента);
	
КонецФункции

Функция СвернутьТаблицуСтоимостиКредитногоИнструментаПоПотокам(ТаблицаСтоимостиКредитногоИнструмента)
	
	ПлановыеВыплаты = Новый ТаблицаЗначений;
	ПлановыеВыплаты.Колонки.Добавить("КредитныйИнструмент");
	ПлановыеВыплаты.Колонки.Добавить("Основание");
	ПлановыеВыплаты.Колонки.Добавить("Период", 				Новый ОписаниеТипов("Дата"));
	ПлановыеВыплаты.Колонки.Добавить("ПроцентныйПериод", 	Новый ОписаниеТипов("Дата"));
	ПлановыеВыплаты.Колонки.Добавить("Сумма", 				Новый ОписаниеТипов("Число"));
	ПлановыеВыплаты.Колонки.Добавить("Тип", 				Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаПотока Из ТаблицаСтоимостиКредитногоИнструмента Цикл
		
		Если СтрокаПотока.Проценты = 0 Тогда
			СтрокиВыплат = ПлановыеВыплаты.НайтиСтроки(Новый Структура("КредитныйИнструмент, Тип, Период", СтрокаПотока.КредитныйИнструмент, "Номинал", СтрокаПотока.ДатаДенежногоПотока));
			Если СтрокиВыплат.Количество() = 0 Тогда
				СтрокаВыплат = ПлановыеВыплаты.Добавить();
				СтрокаВыплат.КредитныйИнструмент = СтрокаПотока.КредитныйИнструмент;
				СтрокаВыплат.Основание = СтрокаПотока.Основание;
				СтрокаВыплат.Период = СтрокаПотока.ДатаДенежногоПотока;
				СтрокаВыплат.Сумма = СтрокаПотока.Номинал;
				СтрокаВыплат.Тип = "Номинал";
			Иначе
				СтрокаВыплат = СтрокиВыплат[0];
				СтрокаВыплат.Сумма = СтрокаВыплат.Сумма + СтрокаПотока.Номинал;
			КонецЕсли;
		Иначе
			СтрокиПроцентногоПериода = ПлановыеВыплаты.НайтиСтроки(Новый Структура("КредитныйИнструмент, Основание, Тип, ПроцентныйПериод", СтрокаПотока.КредитныйИнструмент, СтрокаПотока.Основание, "Проценты", СтрокаПотока.ДатаНачисления));
			Если СтрокиПроцентногоПериода.Количество() = 0 Тогда
				СтрокаВыплат = ПлановыеВыплаты.Добавить();
				СтрокаВыплат.КредитныйИнструмент = СтрокаПотока.КредитныйИнструмент;
				СтрокаВыплат.Основание = СтрокаПотока.Основание;
				СтрокаВыплат.Период = СтрокаПотока.ДатаДенежногоПотока;
				СтрокаВыплат.ПроцентныйПериод = СтрокаПотока.ДатаНачисления;
				СтрокаВыплат.Сумма = СтрокаПотока.Проценты;
				СтрокаВыплат.Тип = "Проценты";
			Иначе
				//свернем суммы с разными знаками (выплаты и начисления)
				СуммаКЗакрытию = СтрокаПотока.Проценты;
				Для Каждого СтрокаПроцентногоПериода ИЗ СтрокиПроцентногоПериода Цикл
					Если СтрокаПроцентногоПериода.Сумма = 0 ИЛИ СуммаКЗакрытию = 0 Тогда
						Продолжить;
					КонецЕсли;
					Если СуммаКЗакрытию * СтрокаПроцентногоПериода.Сумма < 0 Тогда
						Разность = СуммаКЗакрытию + СтрокаПроцентногоПериода.Сумма;
						Если СуммаКЗакрытию * Разность > 0  Тогда
							//закрыли списание
							СтрокаПроцентногоПериода.Сумма = 0;
							СуммаКЗакрытию = Разность;
						Иначе
							//уже есть большая сумма, уменьшаем ее
							СтрокаПроцентногоПериода.Сумма = СтрокаПроцентногоПериода.Сумма + СуммаКЗакрытию;
							СуммаКЗакрытию = 0;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				Если СуммаКЗакрытию <> 0 Тогда
					СтрокаВыплат = ПлановыеВыплаты.Добавить();
					СтрокаВыплат.КредитныйИнструмент = СтрокаПотока.КредитныйИнструмент;
					СтрокаВыплат.Основание = СтрокаПотока.Основание;
					СтрокаВыплат.Период = СтрокаПотока.ДатаДенежногоПотока;
					СтрокаВыплат.ПроцентныйПериод = СтрокаПотока.ДатаНачисления;
					СтрокаВыплат.Сумма = СуммаКЗакрытию;
					СтрокаВыплат.Тип = "Проценты";
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПлановыеВыплаты.Свернуть("КредитныйИнструмент, Основание, Период, Тип", "Сумма");
	
	Возврат ПлановыеВыплаты;
	
КонецФункции

// Функция возвращает таблицу, содержащую расчитанные проценты и выплаты процентов
// По окончании МенеджерВременныхТаблиц содержит таблицу _КредитныеИнструменты, удовлетворяющие заданным условиям
Функция ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
																	Знач Период, 
																	ТипКредитногоИнструмента = Неопределено,
																	НеУчитыватьДосрочноПолученныеПроценты = Ложь, 
																	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, 
																	ВЦеломПоДоговоруДУ = Ложь, 
																	КредитныйИнструмент = Неопределено,
																	ПроизвольнаяПроцентнаяСтавка = Неопределено,
																	ПоДатуПогашения = Ложь,
																	МенеджерВременныхТаблиц = Неопределено) Экспорт 
																	
	Если МенеджерВременныхТаблиц = Неопределено Тогда																
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ПоместитьКредитныеИнструментыВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, СчетДоверительногоУправления, 
		Период, ТипКредитногоИнструмента, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, ВЦеломПоДоговоруДУ, 
		КредитныйИнструмент, ПоДатуПогашения);		
															
	СтоимостьКредитныхИнструментов = ПолучитьСтруктуруТаблицыСтоимостиКредитныхИнструментов();
	
	ДобавитьСтрокиВыплатПроцентовВТаблицуСтоимостиКредитныхИнструментов(СтоимостьКредитныхИнструментов, МенеджерВременныхТаблиц, Период, НеУчитыватьДосрочноПолученныеПроценты);
	
	ДобавитьСтрокиРасчетаПроцентовВТаблицуСтоимостиКредитныхИнструментов(СтоимостьКредитныхИнструментов, МенеджерВременныхТаблиц, Период, ПроизвольнаяПроцентнаяСтавка, ПоДатуПогашения);
	
	//корректировки копеек между начисленными и выплаченными процентами депозитов(?)
	Корректировки = СтоимостьКредитныхИнструментов.Скопировать();
	Корректировки.Колонки.Добавить("КоличествоСтрок");
	Корректировки.ЗаполнитьЗначения(1, "КоличествоСтрок");
	
	Корректировки.Свернуть("КредитныйИнструмент, ВидАктива, ДатаНачисления", "Проценты,Задолженность,КоличествоСтрок");
	
	Для Каждого СтрокаКорректировки Из Корректировки Цикл
		Если СтрокаКорректировки.КоличествоСтрок > 1  
			И (СтрокаКорректировки.Проценты <> 0 ИЛИ СтрокаКорректировки.Задолженность <> 0) Тогда
			
			Если ТипЗнч(СтрокаКорректировки.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
				Продолжить;
			КонецЕсли;
			
			//ЧастичнаяОплата - чтобы не перепутать корректировку и частичную оплату
			ПараметрыПоиска = Новый Структура("КредитныйИнструмент, ВидАктива, ДатаНачисления, Операция, ЧастичнаяОплата", СтрокаКорректировки.КредитныйИнструмент, СтрокаКорректировки.ВидАктива, СтрокаКорректировки.ДатаНачисления, "Выплата процентов", Ложь);
			НайденныеСтроки = СтоимостьКредитныхИнструментов.НайтиСтроки(ПараметрыПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСтоимостиКредитныхИнструментов, НайденныеСтроки[0], "КредитныйИнструмент, ВидАктива, Период, Номинал, Процент");
				НоваяСтрокаСтоимостиКредитныхИнструментов.Проценты		= - СтрокаКорректировки.Проценты;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Задолженность = - СтрокаКорректировки.Задолженность;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Операция = "Корректировка";
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтоимостьКредитныхИнструментов;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыСтоимостиКредитныхИнструментов()
	
	ТипДенежныеСуммы = Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип;
	
	СтоимостьКредитныхИнструментов = Новый ТаблицаЗначений;
	СтоимостьКредитныхИнструментов.Колонки.Добавить("КредитныйИнструмент"	, Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады, СправочникСсылка.Займы"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ВидАктива"				, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыАктивовДляПроверкиНаРыночность"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Основание"				, Документы.ТипВсеСсылки());
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Период"				, Новый ОписаниеТипов("Дата"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Номинал"				, ТипДенежныеСуммы);
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Процент"				, Метаданные.ОпределяемыеТипы.ПроцентнаяСтавка.Тип);
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Проценты"				, Новый ОписаниеТипов("Число"));//ТипСуммыПроцентов);
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Задолженность"			, ТипДенежныеСуммы);//Сумма начисленные за периоды до даты запроса
	СтоимостьКредитныхИнструментов.Колонки.Добавить("Операция"				, Новый ОписаниеТипов("Строка"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ДатаНачисления"		, Новый ОписаниеТипов("Дата"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ДатаДенежногоПотока"	, Новый ОписаниеТипов("Дата"));
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ДатаПогашенияНоминала"	, Новый ОписаниеТипов("Дата"));//для частичных погашений отдельно рассчитываем проценты и их округление
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ДатаОкругления"		, Новый ОписаниеТипов("Дата"));//для займов полученных
	СтоимостьКредитныхИнструментов.Колонки.Добавить("ЧастичнаяОплата"		, Новый ОписаниеТипов("Булево"));
	
	Возврат СтоимостьКредитныхИнструментов;
	
КонецФункции

Функция ПоместитьКредитныеИнструментыВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц,
																	СчетДоверительногоУправления, 
																	Знач Период, 
																	ТипКредитногоИнструмента = Неопределено,
																	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, 
																	ВЦеломПоДоговоруДУ = Ложь, 
																	КредитныйИнструмент = Неопределено,
																	ПоДатуПогашения = Ложь)
	Запрос = Новый Запрос;
	
#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК КредитныйИнструмент,
		|	Неопределено КАК Основание
		|ПОМЕСТИТЬ _КредитныеИнструменты0
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&Граница,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (&КредитныйИнструмент = НЕОПРЕДЕЛЕНО
		|					ИЛИ КредитныйИнструмент = &КредитныйИнструмент)
		|				И (&ТипКредитногоИнструмента = НЕОПРЕДЕЛЕНО
		|					ИЛИ ТипКредитногоИнструмента = &ТипКредитногоИнструмента)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеКредитногоИнструмента.КредитныйИнструмент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&Граница,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = ЗакрытиеКредитногоИнструмента.Ссылка
		|			И (ЗакрытиеКредитногоИнструмента.РежимЗакрытия = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияКредитногоИнструмента.Полное))
		|ГДЕ
		|	&ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеДаты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВсеДаты.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	ВсеДаты.Период КАК Период,
		|	УсловияКредитныхИнструментов.Действует КАК Действует
		|ПОМЕСТИТЬ _СрезПоследнихНаДатыПроверкиНаРыночность
		|ИЗ
		|	(ВЫБРАТЬ
		|		_КредитныеИнструменты0.КредитныйИнструмент КАК КредитныйИнструмент,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|		МАКСИМУМ(УсловияКредитныхИнструментов.Период) КАК Период
		|	ИЗ
		|		_КредитныеИнструменты0 КАК _КредитныеИнструменты0
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|			ПО _КредитныеИнструменты0.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|	ГДЕ
		|		(УсловияКредитныхИнструментов.Период < &Период
		|					И ТИПЗНАЧЕНИЯ(_КредитныеИнструменты0.КредитныйИнструмент) = ТИП(Справочник.ДепозитныеВклады)
		|				ИЛИ УсловияКредитныхИнструментов.Период <= &Период
		|					И ТИПЗНАЧЕНИЯ(_КредитныеИнструменты0.КредитныйИнструмент) = ТИП(Справочник.Займы))
		|		И (УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий < &Период
		|					И ТИПЗНАЧЕНИЯ(_КредитныеИнструменты0.КредитныйИнструмент) = ТИП(Справочник.ДепозитныеВклады)
		|				ИЛИ УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий <= &Период
		|					И ТИПЗНАЧЕНИЯ(_КредитныеИнструменты0.КредитныйИнструмент) = ТИП(Справочник.Займы))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_КредитныеИнструменты0.КредитныйИнструмент,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ВсеДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО ВсеДаты.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВсеДаты.Период = УсловияКредитныхИнструментов.Период
		|			И ВсеДаты.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|ГДЕ
		|	УсловияКредитныхИнструментов.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СрезПоследнихНаДатыПроверкиНаРыночность.КредитныйИнструмент КАК КредитныйИнструмент,
		|	МАКСИМУМ(_СрезПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|ПОМЕСТИТЬ _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность
		|ИЗ
		|	_СрезПоследнихНаДатыПроверкиНаРыночность КАК _СрезПоследнихНаДатыПроверкиНаРыночность
		|
		|СГРУППИРОВАТЬ ПО
		|	_СрезПоследнихНаДатыПроверкиНаРыночность.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КредитныеИнструменты0.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_КредитныеИнструменты0.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДепозитныеВклады.ДатаНачалаНачисленияПроцентов, ДЕНЬ, -1)
		|		КОГДА _КредитныеИнструменты0.Основание <> Неопределено
		|			ТОГДА ВЫРАЗИТЬ(_КредитныеИнструменты0.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).Дата
		|		КОГДА НЕ Займы.Ссылка ЕСТЬ NULL
		|			ТОГДА НоминалыКредитныхИнструментовСрезПервых.Период
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА _КредитныеИнструменты0.Основание <> Неопределено
		|			ТОГДА &Период
		|		КОГДА &ПоДатуПогашения
		|			ТОГДА УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|		КОГДА УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения > &Период
		|			ТОГДА &Период
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ КАК ДатаОкончания,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА _КредитныеИнструменты0.Основание <> Неопределено
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|		КОГДА НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты)
		|		КОГДА НЕ Займы.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.)
		|	КОНЕЦ КАК ВидАктива
		|ПОМЕСТИТЬ _КредитныеИнструменты
		|ИЗ
		|	_КредитныеИнструменты0 КАК _КредитныеИнструменты0
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Граница,
		|				(КредитныйИнструмент, ДатаНачалаДействияУсловий) В
		|					(ВЫБРАТЬ
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность.КредитныйИнструмент КАК КредитныйИнструмент,
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий
		|					ИЗ
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность КАК _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность)) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО _КредитныеИнструменты0.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО _КредитныеИнструменты0.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО _КредитныеИнструменты0.КредитныйИнструмент = Займы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых(
		|				,
		|				&КредитныйИнструмент = НЕОПРЕДЕЛЕНО
		|					ИЛИ КредитныйИнструмент = &КредитныйИнструмент) КАК НоминалыКредитныхИнструментовСрезПервых
		|		ПО _КредитныеИнструменты0.КредитныйИнструмент = НоминалыКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|ГДЕ
		|	(&НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = ЛОЖЬ
		|			ИЛИ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения > &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КредитныеИнструменты0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СрезПоследнихНаДатыПроверкиНаРыночность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность";
	
#КонецОбласти

	Запрос.УстановитьПараметр("Граница"											, Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период"											, Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"					, СчетДоверительногоУправления);	
	Запрос.УстановитьПараметр("НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия", НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия);	
	Запрос.УстановитьПараметр("КредитныйИнструмент"								, КредитныйИнструмент);		
	Запрос.УстановитьПараметр("ТипКредитногоИнструмента"						, ТипКредитногоИнструмента);		
	Запрос.УстановитьПараметр("ПоДатуПогашения"									, ПоДатуПогашения);		
	
	Если ВЦеломПоДоговоруДУ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "			СчетДоверительногоУправления = &СчетДоверительногоУправления", "			СчетДоверительногоУправления В(&СписокСтратегий)");
		Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(СчетДоверительногоУправления));
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
																	
КонецФункции

// Функция добавляет в таблицу СтоимостьКредитныхИнструментов строки номинала в зависимости от параметра ДляРасшифровки:
//		= Истина: строки соответствуют размещениям и погашениям номинала 
//				Например,	 01.01.2020: +200
//							 01.02.2020: -100
//							 01.03.2020: +300
//							 01.05.2020: -400
//		= Ложь	: строки содержат денежные потоки по ЛИФО, сформированные при размещениях и погашениях номинала
//				Для приведенного выше примера график потоков:
//
//			|	     |         |ХХХХХХХХХ|
//          |        |         |ХХХХХХХХХ|
//          |ХХХХХХХХ|         |ХХХХХХХХХ|
//			|ХХХХХХХХ|ХХХХХХХХХ|ХХХХХХХХХ|ХХХХХХХ
//			|январь  |февраль  |март     |апрель
//
//			Потоки в таблице:
//          	с 01.01.2020 по 01.05.2020  = 100
//				с 01.01.2020 по 01.02.2020 	= 100
//				с 01.03.2020 по 01.04.2020	= 300
//
//		Параметр  ТолькоБудущиеДенежныеПотоки применяется для варианта (ДляРасшифровки = Ложь) и исключает уже погашенные потоки из таблицы.
//			Т.е. для приведенного примера При значении параметра Период = 01.03.2020 в итоговой таблице останется: 
//          	с 01.01.2020 по 01.05.2020  = 100
//				с 01.03.2020 по 01.04.2020	= 300
//
Функция ДобавитьСтрокиНоминалаВТаблицуСтоимостиКредитныхИнструментов(СтоимостьКредитныхИнструментов, МенеджерВременныхТаблиц, Знач Период, ДляРасшифровки, ТолькоБудущиеДенежныеПотоки)
	
	ЭтоУКПИ = Ложь;
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_КредитныеИнструменты.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
		|	ЗадолженностиПоДенежнымСредствам.ВидДвижения КАК ВидДвижения,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма
		|ПОМЕСТИТЬ _ДвижениеСуммыЗайма
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО _КредитныеИнструменты.Основание = ЗадолженностиПоДенежнымСредствам.Основание
		|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму))
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	И _КредитныеИнструменты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|	И ЗадолженностиПоДенежнымСредствам.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_КредитныеИнструменты.Основание КАК Основание,
		|	_КредитныеИнструменты.ДатаПогашения КАК ДатаПогашения,
		|	НоминалыКредитныхИнструментов.Период КАК Период,
		|	НоминалыКредитныхИнструментов.Сумма КАК Сумма,
		|	_КредитныеИнструменты.ВидАктива КАК ВидАктива,
		|	_КредитныеИнструменты.КредитныйИнструмент.Организация КАК Организация
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|			И (НоминалыКредитныхИнструментов.Период >= НАЧАЛОПЕРИОДА(_КредитныеИнструменты.ДатаНачала, ДЕНЬ))
		|			И (НоминалыКредитныхИнструментов.Период <= КОНЕЦПЕРИОДА(_КредитныеИнструменты.ДатаОкончания, ДЕНЬ))
		|			И (НоминалыКредитныхИнструментов.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|ГДЕ
		|	_КредитныеИнструменты.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КредитныеИнструменты.КредитныйИнструмент,
		|	_КредитныеИнструменты.Основание,
		|	_КредитныеИнструменты.ДатаПогашения,
		|	ПериодыНоминалов.Период,
		|	ПериодыНоминалов.Сумма,
		|	_КредитныеИнструменты.ВидАктива,
		|	_КредитныеИнструменты.КредитныйИнструмент.Организация
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДвижениеСуммыЗайма.КредитныйИнструмент КАК КредитныйИнструмент,
		|			_ДвижениеСуммыЗайма.Основание КАК Основание,
		|			_ДвижениеСуммыЗайма.Период КАК Период,
		|			СУММА(ВЫБОР
		|					КОГДА _ДвижениеСуммыЗайма1.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА 1
		|					ИНАЧЕ -1
		|				КОНЕЦ * _ДвижениеСуммыЗайма1.Сумма) КАК Сумма
		|		ИЗ
		|			_ДвижениеСуммыЗайма КАК _ДвижениеСуммыЗайма
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ДвижениеСуммыЗайма КАК _ДвижениеСуммыЗайма1
		|				ПО _ДвижениеСуммыЗайма.КредитныйИнструмент = _ДвижениеСуммыЗайма1.КредитныйИнструмент
		|					И _ДвижениеСуммыЗайма.Основание = _ДвижениеСуммыЗайма1.Основание
		|					И (_ДвижениеСуммыЗайма1.Период <= _ДвижениеСуммыЗайма.Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДвижениеСуммыЗайма.КредитныйИнструмент,
		|			_ДвижениеСуммыЗайма.Основание,
		|			_ДвижениеСуммыЗайма.Период) КАК ПериодыНоминалов
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = ПериодыНоминалов.КредитныйИнструмент
		|			И _КредитныеИнструменты.Основание = ПериодыНоминалов.Основание
		|ГДЕ
		|	_КредитныеИнструменты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КредитныйИнструмент,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДвижениеСуммыЗайма";
	
	Запрос.УстановитьПараметр("Период"											, Период);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//получим потоки по номиналу с датами погашения
	НоминалыКредитныхИнструментов = РезультатЗапроса.Выгрузить();
	
	КоличествоСтрокНоминалов = НоминалыКредитныхИнструментов.Количество()-1;
	ТекущийКредитныйИнструмент = Неопределено;
	ТекущаяСумма = 0;
	
	Для НомерСтроки = 0 ПО КоличествоСтрокНоминалов Цикл
		
		ТекущаяСтрока = НоминалыКредитныхИнструментов.Получить(НомерСтроки);
		
		Если НомерСтроки = 0 Тогда
			//организация всегда одна, т.к. вызывающие процедуры отбирают по счетуДУ
			ЭтоУКПИ = ТекущаяСтрока.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
		КонецЕсли;
		
		Если ТекущийКредитныйИнструмент <> ТекущаяСтрока.КредитныйИнструмент Тогда
			
			
			ТекущийКредитныйИнструмент = ТекущаяСтрока.КредитныйИнструмент;
			ТекущаяСумма = ТекущаяСтрока.Сумма;
			
			НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
			НоваяСтрокаСтоимостиКредитныхИнструментов.КредитныйИнструмент		= ТекущийКредитныйИнструмент;
			НоваяСтрокаСтоимостиКредитныхИнструментов.ВидАктива					= ТекущаяСтрока.ВидАктива;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Основание					= ТекущаяСтрока.Основание;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Период					= ТекущаяСтрока.Период;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Номинал					= ТекущаяСтрока.Сумма;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Процент					= 0;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Операция					= "Размещение";
			НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока		= ТекущаяСтрока.ДатаПогашения;
			Продолжить;
		КонецЕсли;
		
		Дельта = ТекущаяСтрока.Сумма - ТекущаяСумма;
		ТекущаяСумма = ТекущаяСумма + Дельта;
		
		Если Дельта > 0 Тогда
			
			НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
			НоваяСтрокаСтоимостиКредитныхИнструментов.КредитныйИнструмент		= ТекущийКредитныйИнструмент;
			НоваяСтрокаСтоимостиКредитныхИнструментов.ВидАктива					= ТекущаяСтрока.ВидАктива;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Основание					= ТекущаяСтрока.Основание;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Период					= ТекущаяСтрока.Период;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Номинал					= ТекущаяСтрока.Сумма;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Процент					= 0;
			НоваяСтрокаСтоимостиКредитныхИнструментов.Операция					= "Размещение";
			НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока		= ТекущаяСтрока.ДатаПогашения;
			
		ИначеЕсли Дельта < 0 Тогда
			
			Если ДляРасшифровки Тогда
				НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
				НоваяСтрокаСтоимостиКредитныхИнструментов.КредитныйИнструмент		= ТекущийКредитныйИнструмент;
				НоваяСтрокаСтоимостиКредитныхИнструментов.ВидАктива					= ТекущаяСтрока.ВидАктива;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Основание					= ТекущаяСтрока.Основание;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Период					= ТекущаяСтрока.Период;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Номинал					= Дельта;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Процент					= 0;
				НоваяСтрокаСтоимостиКредитныхИнструментов.Операция					= "Погашение";
				НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока		= ТекущаяСтрока.Период;
			Иначе
				//распишем потоки по ЛИФО, обходим СтоимостьКредитныхИнструментов с конца
				КоличествоСтрокСтоимостьКредитныхИнструментов = СтоимостьКредитныхИнструментов.Количество();
				Для НомерСтрокиСтоимостьКредитныхИнструментов = - КоличествоСтрокСтоимостьКредитныхИнструментов+1 По 0 Цикл
					Если Дельта = 0 Тогда
						Прервать;
					КонецЕсли;
					ТекущаяСтрокаПрихода = СтоимостьКредитныхИнструментов.Получить(-НомерСтрокиСтоимостьКредитныхИнструментов);
					Если ТекущаяСтрокаПрихода.КредитныйИнструмент <> ТекущийКредитныйИнструмент Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По кредитному инструменту "+ТекущийКредитныйИнструмент+" обнаружено избыточное списание номинала",ТекущийКредитныйИнструмент,,,);
						Прервать;
					КонецЕсли;
					Если ТекущаяСтрокаПрихода.ДатаДенежногоПотока = ТекущаяСтрока.ДатаПогашения Тогда
						СуммаКПогашению = Мин(-Дельта, ТекущаяСтрокаПрихода.Номинал);
						Если СуммаКПогашению = ТекущаяСтрокаПрихода.Номинал Тогда
							ТекущаяСтрокаПрихода.ДатаДенежногоПотока  = ТекущаяСтрока.Период;
							Дельта = Дельта + СуммаКПогашению;
						ИначеЕсли СуммаКПогашению < ТекущаяСтрокаПрихода.Номинал Тогда
							ТекущаяСтрокаПрихода.Номинал = ТекущаяСтрокаПрихода.Номинал - СуммаКПогашению;
							Если НЕ ТолькоБудущиеДенежныеПотоки Тогда
								НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаСтоимостиКредитныхИнструментов, ТекущаяСтрокаПрихода);
								НоваяСтрокаСтоимостиКредитныхИнструментов.Номинал = СуммаКПогашению;
								НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока  = ТекущаяСтрока.Период;
							КонецЕсли;
							Дельта = Дельта + СуммаКПогашению;
							
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
	//#386115: для УКПИ с 30.07.2021 дату потока смещаем на первый рабочий день 
	Если ЭтоУКПИ И Период >= Дата(2021,07,30) Тогда 
		Для Каждого СтрокаСтоимостиКредитныхИнструментов из СтоимостьКредитныхИнструментов Цикл
			//сдвигаем дату потока только для тела
			Если СтрокаСтоимостиКредитныхИнструментов.Номинал >0  Тогда
				СтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(СтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока),1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ДобавитьСтрокиВыплатПроцентовВТаблицуСтоимостиКредитныхИнструментов(СтоимостьКредитныхИнструментов, МенеджерВременныхТаблиц, Знач Период, НеУчитыватьДосрочноПолученныеПроценты)
			
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВложенныйЗапрос.ВидАктива КАК ВидАктива,
		|	ВложенныйЗапрос.Основание КАК Основание,
		|	ВложенныйЗапрос.Период КАК Период,
		|	НоминалыКредитныхИнструментов.Сумма КАК Номинал,
		|	УсловияКредитныхИнструментов.Процент КАК Процент,
		|	-ВложенныйЗапрос.Сумма КАК Проценты,
		|	ВЫБОР
		|		КОГДА УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Авансом)
		|			ТОГДА 0
		|		КОГДА ВложенныйЗапрос.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))
		|			ТОГДА 0
		|		ИНАЧЕ -ВложенныйЗапрос.Сумма
		|	КОНЕЦ КАК Задолженность,
		|	УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	""Выплата процентов"" КАК Операция,
		|	ВложенныйЗапрос.ДатаНачисления КАК ДатаНачисления,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ДатаДенежногоПотока,
		|	ВложенныйЗапрос.Частичный КАК ЧастичнаяОплата,
		|	ВложенныйЗапрос.ДатаПогашения КАК ДатаПогашения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПроцентыПоКредитнымИнструментам.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_КредитныеИнструменты.ВидАктива КАК ВидАктива,
		|		_КредитныеИнструменты.Основание КАК Основание,
		|		ПроцентыПоКредитнымИнструментам.Период КАК Период,
		|		ПроцентыПоКредитнымИнструментам.ОкончаниеПериода КАК ДатаНачисления,
		|		ПроцентыПоКредитнымИнструментам.Сумма КАК Сумма,
		|		МАКСИМУМ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий,
		|		МАКСИМУМ(НоминалыКредитныхИнструментов.Период) КАК ПериодНоминалов,
		|		ПроцентыПоКредитнымИнструментам.Частичный КАК Частичный,
		|		_КредитныеИнструменты.ДатаПогашения КАК ДатаПогашения
		|	ИЗ
		|		РегистрСведений.ПроцентыПоКредитнымИнструментам КАК ПроцентыПоКредитнымИнструментам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КредитныеИнструменты КАК _КредитныеИнструменты
		|			ПО ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = _КредитныеИнструменты.КредитныйИнструмент
		|				И (_КредитныеИнструменты.Основание = Неопределено)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|					&Период,
		|					ДатаНачалаДействияУсловий <= &Период
		|						И КредитныйИнструмент В
		|							(ВЫБРАТЬ
		|								К.КредитныйИнструмент
		|							ИЗ
		|								_КредитныеИнструменты КАК К)) КАК УсловияКредитныхИнструментов
		|			ПО ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|				И ПроцентыПоКредитнымИнструментам.Период >= УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|				И (УсловияКредитныхИнструментов.Действует)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|			ПО ПроцентыПоКредитнымИнструментам.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|				И (ВЫБОР
		|					КОГДА _КредитныеИнструменты.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))
		|						ТОГДА ПроцентыПоКредитнымИнструментам.Период > НоминалыКредитныхИнструментов.Период
		|					ИНАЧЕ ПроцентыПоКредитнымИнструментам.Период >= НоминалыКредитныхИнструментов.Период
		|				КОНЕЦ)
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &НеУчитыватьДосрочноПолученныеПроценты
		|					ТОГДА ВЫБОР
		|							КОГДА ПроцентыПоКредитнымИнструментам.ОкончаниеПериода > ПроцентыПоКредитнымИнструментам.Период
		|								ТОГДА ПроцентыПоКредитнымИнструментам.ОкончаниеПериода
		|							ИНАЧЕ ПроцентыПоКредитнымИнструментам.Период
		|						КОНЕЦ
		|				ИНАЧЕ ПроцентыПоКредитнымИнструментам.Период
		|			КОНЕЦ < &Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПроцентыПоКредитнымИнструментам.КредитныйИнструмент,
		|		_КредитныеИнструменты.ВидАктива,
		|		_КредитныеИнструменты.Основание,
		|		ПроцентыПоКредитнымИнструментам.Период,
		|		ПроцентыПоКредитнымИнструментам.Сумма,
		|		ПроцентыПоКредитнымИнструментам.ОкончаниеПериода,
		|		ПроцентыПоКредитнымИнструментам.Частичный,
		|		_КредитныеИнструменты.ДатаПогашения) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						К.КредитныйИнструмент
		|					ИЗ
		|						_КредитныеИнструменты КАК К)) КАК УсловияКредитныхИнструментов
		|		ПО ВложенныйЗапрос.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВложенныйЗапрос.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|		ПО ВложенныйЗапрос.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|			И ВложенныйЗапрос.ПериодНоминалов = НоминалыКредитныхИнструментов.Период";
	
	Запрос.УстановитьПараметр("Период"											, КонецДня(Период));
	Запрос.УстановитьПараметр("НеУчитыватьДосрочноПолученныеПроценты"			, НеУчитыватьДосрочноПолученныеПроценты);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); //выплаты процентов
	Пока Выборка.Следующий() Цикл
		СтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтоимостиКредитныхИнструментов, Выборка);
		СтрокаСтоимостиКредитныхИнструментов.ДатаНачисления = ПолучитьКонецПроцентногоПериода(СтрокаСтоимостиКредитныхИнструментов.ДатаНачисления,Выборка.ПериодичностьВыплатыПроцентов, Выборка.ДатаПогашения);
	КонецЦикла;
	
КонецФункции

Функция ДобавитьСтрокиРасчетаПроцентовВТаблицуСтоимостиКредитныхИнструментов(СтоимостьКредитныхИнструментов, МенеджерВременныхТаблиц, Знач Период, ПроизвольнаяПроцентнаяСтавка, ПоДатуПогашения)
	
	//на случай частичных погашений получим денежные потоки по номиналам
	НоминалыКредитныхИнструментов = ПолучитьСтруктуруТаблицыСтоимостиКредитныхИнструментов();
	ДобавитьСтрокиНоминалаВТаблицуСтоимостиКредитныхИнструментов(НоминалыКредитныхИнструментов, МенеджерВременныхТаблиц, Период, Ложь, Ложь);
	
	//свернем потоки номиналов по датам погашения. Таблица будет использована для текущих номиналов
	НоминалыКредитныхИнструментовПоДатамПогашения = НоминалыКредитныхИнструментов.Скопировать();
	НоминалыКредитныхИнструментовПоДатамПогашения.Свернуть("КредитныйИнструмент,ДатаДенежногоПотока","Номинал");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	//Различие займов и депозитных вкладов в запросе:
	//1. При заполнении _ПериодыНоминаловДляУсловий для займов период номинала увеличиваем на 1, т.к. новый номинал начнет действовать только на следующий день. 
	//   Для депозитов всегда берем номинал на утро (овернайт - начисляем на сумму, которая пролежала ночь)
	//2. При заполнении _ПериодыИзмененияПроцентов и _ПериодыИзмененияПериодичностиВыплатыПроцентов для займов, смещаем дату первых условий, 
	//   т.к за первый день проценты не рассчитываются
	//3. НачалоПериода и ОкончаниеПериода в запросе для займов и депозитов трактуются по-разному:
	//		- депозиты считают ночи между датами периода
	//		- займы считают дни включая НачалоПериода и исключая ОкончаниеПериода. Для последнего периода займа в коде принудително добавляется 1 день, 
	//		  чтобы рассчитать последний день включительно. По этой же причине Период в таблице НоваяСтрокаСтоимостиКредитныхИнструментов уменьшается на 1 день.
#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеДаты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВсеДаты.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	ВсеДаты.Период КАК Период,
		|	УсловияКредитныхИнструментов.Действует КАК Действует
		|ПОМЕСТИТЬ _СрезПоследнихНаДатыНачалаКредитныхИнструментов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|		МАКСИМУМ(УсловияКредитныхИнструментов.Период) КАК Период
		|	ИЗ
		|		_КредитныеИнструменты КАК _КредитныеИнструменты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|			ПО _КредитныеИнструменты.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|	ГДЕ
		|		УсловияКредитныхИнструментов.Период <= _КредитныеИнструменты.ДатаНачала
		|		И УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий <= _КредитныеИнструменты.ДатаНачала
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_КредитныеИнструменты.КредитныйИнструмент,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ВсеДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО ВсеДаты.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВсеДаты.Период = УсловияКредитныхИнструментов.Период
		|			И ВсеДаты.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|ГДЕ
		|	УсловияКредитныхИнструментов.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СрезПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	МАКСИМУМ(_СрезПоследнихНаДатыНачалаКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|ПОМЕСТИТЬ _ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов
		|ИЗ
		|	_СрезПоследнихНаДатыНачалаКредитныхИнструментов КАК _СрезПоследнихНаДатыНачалаКредитныхИнструментов
		|
		|СГРУППИРОВАТЬ ПО
		|	_СрезПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК Период,
		|	УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментов.Процент КАК Процент,
		|	""Условия на начало"" КАК Комментарий
		|ПОМЕСТИТЬ _УсловияКредитныхИнструментов
		|ИЗ
		|	_ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов КАК _ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СрезПоследнихНаДатыНачалаКредитныхИнструментов КАК _СрезПоследнихНаДатыНачалаКредитныхИнструментов
		|		ПО _ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент = _СрезПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент
		|			И _ДатыАктуальныхУсловийСрезаПоследнихНаДатыНачалаКредитныхИнструментов.ДатаНачалаДействияУсловий = _СрезПоследнихНаДатыНачалаКредитныхИнструментов.ДатаНачалаДействияУсловий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО (_СрезПоследнихНаДатыНачалаКредитныхИнструментов.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент)
		|			И (_СрезПоследнихНаДатыНачалаКредитныхИнструментов.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий)
		|			И (_СрезПоследнихНаДатыНачалаКредитныхИнструментов.Период = УсловияКредитныхИнструментов.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КредитныеИнструменты.КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент,
		|	""Изменения условий""
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент
		|					ИЗ
		|						_КредитныеИнструменты КАК _КредитныеИнструменты)) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий > _КредитныеИнструменты.ДатаНачала)
		|			И (УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий <= _КредитныеИнструменты.ДатаОкончания)
		|			И (УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий <= &Период)
		|			И (УсловияКредитныхИнструментовСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВЫБОР
		|		КОГДА _КредитныеИнструменты.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(НоминалыКредитныхИнструментов.Период, ДЕНЬ), ДЕНЬ, 1)
		|		КОГДА _КредитныеИнструменты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(_КредитныеИнструменты.КредитныйИнструмент) = ТИП(Справочник.Займы)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(НоминалыКредитныхИнструментов.Период, ДЕНЬ), ДЕНЬ, 1)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(НоминалыКредитныхИнструментов.Период, ДЕНЬ)
		|	КОНЕЦ КАК Период,
		|	НоминалыКредитныхИнструментов.Сумма КАК Сумма,
		|	_КредитныеИнструменты.ВидАктива КАК ВидАктива
		|ПОМЕСТИТЬ _ПериодыНоминаловДляУсловий
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|			И (НоминалыКредитныхИнструментов.Период >= НАЧАЛОПЕРИОДА(_КредитныеИнструменты.ДатаНачала, ДЕНЬ))
		|			И (НоминалыКредитныхИнструментов.Период < КОНЕЦПЕРИОДА(_КредитныеИнструменты.ДатаОкончания, ДЕНЬ))
		|			И (НоминалыКредитныхИнструментов.Период < &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВЫБОР
		|		КОГДА _ПервыеНоминалы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))
		|				И _УсловияКредитныхИнструментов.Период < _ПервыеНоминалы.ДатаПервогоНоминала
		|			ТОГДА ДОБАВИТЬКДАТЕ(_УсловияКредитныхИнструментов.Период, ДЕНЬ, 1)
		|		КОГДА _ПервыеНоминалы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(_ПервыеНоминалы.КредитныйИнструмент) = ТИП(СПравочник.Займы)
		|				И _УсловияКредитныхИнструментов.Период < _ПервыеНоминалы.ДатаПервогоНоминала
		|			ТОГДА ДОБАВИТЬКДАТЕ(_УсловияКредитныхИнструментов.Период, ДЕНЬ, 1)
		|		ИНАЧЕ _УсловияКредитныхИнструментов.Период
		|	КОНЕЦ КАК Период,
		|	_УсловияКредитныхИнструментов.Процент КАК Процент
		|ПОМЕСТИТЬ _ПериодыИзмененияПроцентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_УсловияКредитныхИнструментов.Период КАК Период,
		|		_УсловияКредитныхИнструментов.Процент КАК Процент,
		|		МАКСИМУМ(_УсловияКредитныхИнструментовПредыдущие.Период) КАК ПериодПредыдущихУсловий
		|	ИЗ
		|		_УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментов
		|			ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментовПредыдущие
		|			ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _УсловияКредитныхИнструментовПредыдущие.КредитныйИнструмент
		|				И _УсловияКредитныхИнструментов.Период > _УсловияКредитныхИнструментовПредыдущие.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_УсловияКредитныхИнструментов.КредитныйИнструмент,
		|		_УсловияКредитныхИнструментов.Период,
		|		_УсловияКредитныхИнструментов.Процент) КАК _УсловияКредитныхИнструментов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментовПредыдущие
		|		ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _УсловияКредитныхИнструментовПредыдущие.КредитныйИнструмент
		|			И _УсловияКредитныхИнструментов.ПериодПредыдущихУсловий = _УсловияКредитныхИнструментовПредыдущие.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыНоминаловДляУсловий.КредитныйИнструмент КАК КредитныйИнструмент,
		|			_ПериодыНоминаловДляУсловий.ВидАктива КАК ВидАктива,
		|			МИНИМУМ(_ПериодыНоминаловДляУсловий.Период) КАК ДатаПервогоНоминала
		|		ИЗ
		|			_ПериодыНоминаловДляУсловий КАК _ПериодыНоминаловДляУсловий
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыНоминаловДляУсловий.КредитныйИнструмент,
		|			_ПериодыНоминаловДляУсловий.ВидАктива) КАК _ПервыеНоминалы
		|		ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _ПервыеНоминалы.КредитныйИнструмент
		|ГДЕ
		|	(_УсловияКредитныхИнструментовПредыдущие.Процент ЕСТЬ NULL
		|			ИЛИ _УсловияКредитныхИнструментовПредыдущие.Процент <> _УсловияКредитныхИнструментов.Процент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВЫБОР
		|		КОГДА _ПервыеНоминалы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))
		|				И _УсловияКредитныхИнструментов.Период < _ПервыеНоминалы.ДатаПервогоНоминала
		|			ТОГДА ДОБАВИТЬКДАТЕ(_УсловияКредитныхИнструментов.Период, ДЕНЬ, 1)
		|		КОГДА _ПервыеНоминалы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(_ПервыеНоминалы.КредитныйИнструмент) = ТИП(Справочник.Займы)
		|				И _УсловияКредитныхИнструментов.Период < _ПервыеНоминалы.ДатаПервогоНоминала
		|			ТОГДА ДОБАВИТЬКДАТЕ(_УсловияКредитныхИнструментов.Период, ДЕНЬ, 1)
		|		ИНАЧЕ _УсловияКредитныхИнструментов.Период
		|	КОНЕЦ КАК Период,
		|	_УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов
		|ПОМЕСТИТЬ _ПериодыИзмененияПериодичностиВыплатыПроцентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_УсловияКредитныхИнструментов.Период КАК Период,
		|		_УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|		МАКСИМУМ(_УсловияКредитныхИнструментовПредыдущие.Период) КАК ПериодПредыдущихУсловий
		|	ИЗ
		|		_УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментов
		|			ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментовПредыдущие
		|			ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _УсловияКредитныхИнструментовПредыдущие.КредитныйИнструмент
		|				И _УсловияКредитныхИнструментов.Период > _УсловияКредитныхИнструментовПредыдущие.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_УсловияКредитныхИнструментов.КредитныйИнструмент,
		|		_УсловияКредитныхИнструментов.Период,
		|		_УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов) КАК _УсловияКредитныхИнструментов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментовПредыдущие
		|		ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _УсловияКредитныхИнструментовПредыдущие.КредитныйИнструмент
		|			И _УсловияКредитныхИнструментов.ПериодПредыдущихУсловий = _УсловияКредитныхИнструментовПредыдущие.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыНоминаловДляУсловий.КредитныйИнструмент КАК КредитныйИнструмент,
		|			_ПериодыНоминаловДляУсловий.ВидАктива КАК ВидАктива,
		|			МИНИМУМ(_ПериодыНоминаловДляУсловий.Период) КАК ДатаПервогоНоминала
		|		ИЗ
		|			_ПериодыНоминаловДляУсловий КАК _ПериодыНоминаловДляУсловий
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыНоминаловДляУсловий.КредитныйИнструмент,
		|			_ПериодыНоминаловДляУсловий.ВидАктива) КАК _ПервыеНоминалы
		|		ПО _УсловияКредитныхИнструментов.КредитныйИнструмент = _ПервыеНоминалы.КредитныйИнструмент
		|ГДЕ
		|	(_УсловияКредитныхИнструментовПредыдущие.ПериодичностьВыплатыПроцентов ЕСТЬ NULL
		|			ИЛИ _УсловияКредитныхИнструментовПредыдущие.ПериодичностьВыплатыПроцентов <> _УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВложенныйЗапрос.Период КАК Период
		|ПОМЕСТИТЬ _ПериодыКредитныхИнструментов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыИзмененияПроцентов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_ПериодыИзмененияПроцентов.Период КАК Период
		|	ИЗ
		|		_ПериодыИзмененияПроцентов КАК _ПериодыИзмененияПроцентов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ПериодыИзмененияПериодичностиВыплатыПроцентов.КредитныйИнструмент,
		|		_ПериодыИзмененияПериодичностиВыплатыПроцентов.Период
		|	ИЗ
		|		_ПериодыИзмененияПериодичностиВыплатыПроцентов КАК _ПериодыИзмененияПериодичностиВыплатыПроцентов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ПериодыНоминаловДляУсловий.КредитныйИнструмент,
		|		_ПериодыНоминаловДляУсловий.Период
		|	ИЗ
		|		_ПериодыНоминаловДляУсловий КАК _ПериодыНоминаловДляУсловий) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВложенныйЗапрос.Период КАК Период,
		|	_УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	ВЫБОР
		|		КОГДА &ПроизвольнаяПроцентнаяСтавка <> НЕОПРЕДЕЛЕНО
		|				И ВложенныйЗапрос.Период >= ПоследнееИзменениеПроцентов.Период
		|			ТОГДА &ПроизвольнаяПроцентнаяСтавка
		|		ИНАЧЕ _УсловияКредитныхИнструментов.Процент
		|	КОНЕЦ КАК Процент
		|ПОМЕСТИТЬ _ПериодыКредитныхИнструментовСУсловиями
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_ПериодыКредитныхИнструментов.Период КАК Период,
		|		МАКСИМУМ(_УсловияКредитныхИнструментов.Период) КАК ПериодУсловий
		|	ИЗ
		|		_ПериодыКредитныхИнструментов КАК _ПериодыКредитныхИнструментов
		|			ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментов
		|			ПО _ПериодыКредитныхИнструментов.КредитныйИнструмент = _УсловияКредитныхИнструментов.КредитныйИнструмент
		|				И _ПериодыКредитныхИнструментов.Период >= _УсловияКредитныхИнструментов.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПериодыКредитныхИнструментов.КредитныйИнструмент,
		|		_ПериодыКредитныхИнструментов.Период) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментов КАК _УсловияКредитныхИнструментов
		|		ПО ВложенныйЗапрос.КредитныйИнструмент = _УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВложенныйЗапрос.ПериодУсловий = _УсловияКредитныхИнструментов.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыИзмененияПроцентов.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_ПериодыИзмененияПроцентов.Период) КАК Период
		|		ИЗ
		|			_ПериодыИзмененияПроцентов КАК _ПериодыИзмененияПроцентов
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыИзмененияПроцентов.КредитныйИнструмент) КАК ПоследнееИзменениеПроцентов
		|		ПО ВложенныйЗапрос.КредитныйИнструмент = ПоследнееИзменениеПроцентов.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	ВложенныйЗапрос.Процент КАК Процент,
		|	НоминалыКредитныхИнструментов.Сумма КАК Номинал
		|ПОМЕСТИТЬ _ПериодыКредитныхИнструментовСНоминалами
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыКредитныхИнструментовСУсловиями.КредитныйИнструмент КАК КредитныйИнструмент,
		|		_ПериодыКредитныхИнструментовСУсловиями.Период КАК Период,
		|		_ПериодыКредитныхИнструментовСУсловиями.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|		_ПериодыКредитныхИнструментовСУсловиями.Процент КАК Процент,
		|		МАКСИМУМ(_ПериодыНоминаловДляУсловий.Период) КАК ПериодНоминала
		|	ИЗ
		|		_ПериодыКредитныхИнструментовСУсловиями КАК _ПериодыКредитныхИнструментовСУсловиями
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыНоминаловДляУсловий КАК _ПериодыНоминаловДляУсловий
		|			ПО _ПериодыКредитныхИнструментовСУсловиями.КредитныйИнструмент = _ПериодыНоминаловДляУсловий.КредитныйИнструмент
		|				И (_ПериодыКредитныхИнструментовСУсловиями.Период >= НАЧАЛОПЕРИОДА(_ПериодыНоминаловДляУсловий.Период, ДЕНЬ))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПериодыКредитныхИнструментовСУсловиями.КредитныйИнструмент,
		|		_ПериодыКредитныхИнструментовСУсловиями.Период,
		|		_ПериодыКредитныхИнструментовСУсловиями.ПериодичностьВыплатыПроцентов,
		|		_ПериодыКредитныхИнструментовСУсловиями.Процент) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|		ПО ВложенныйЗапрос.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|			И ВложенныйЗапрос.ПериодНоминала = НоминалыКредитныхИнструментов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыКредитныхИнструментовСНоминалами.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_КредитныеИнструменты.ВидАктива КАК ВидАктива,
		|	_КредитныеИнструменты.Основание КАК Основание,
		|	_ПериодыКредитныхИнструментовСНоминалами.Период КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА НЕ МИНИМУМ(_ПериодыКредитныхИнструментовСНоминаламиСледующийПериод.Период) ЕСТЬ NULL
		|			ТОГДА МИНИМУМ(_ПериодыКредитныхИнструментовСНоминаламиСледующийПериод.Период)
		|		КОГДА &ПоДатуПогашения
		|			ТОГДА _КредитныеИнструменты.ДатаПогашения
		|		ИНАЧЕ _КредитныеИнструменты.ДатаОкончания
		|	КОНЕЦ КАК ОкончаниеПериода,
		|	МИНИМУМ(_ПериодыКредитныхИнструментовСНоминаламиСледующийПериод.Период) ЕСТЬ NULL КАК ПоследнийПериод,
		|	_КредитныеИнструменты.ДатаПогашения КАК ДатаПогашения,
		|	_ПериодыКредитныхИнструментовСНоминалами.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_ПериодыКредитныхИнструментовСНоминалами.Процент КАК Процент,
		|	_ПериодыКредитныхИнструментовСНоминалами.Номинал КАК Номинал
		|ИЗ
		|	_ПериодыКредитныхИнструментовСНоминалами КАК _ПериодыКредитныхИнструментовСНоминалами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыКредитныхИнструментовСНоминалами КАК _ПериодыКредитныхИнструментовСНоминаламиСледующийПериод
		|		ПО _ПериодыКредитныхИнструментовСНоминалами.КредитныйИнструмент = _ПериодыКредитныхИнструментовСНоминаламиСледующийПериод.КредитныйИнструмент
		|			И _ПериодыКредитныхИнструментовСНоминалами.Период < _ПериодыКредитныхИнструментовСНоминаламиСледующийПериод.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КредитныеИнструменты КАК _КредитныеИнструменты
		|		ПО _ПериодыКредитныхИнструментовСНоминалами.КредитныйИнструмент = _КредитныеИнструменты.КредитныйИнструмент
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПериодыКредитныхИнструментовСНоминалами.КредитныйИнструмент,
		|	_ПериодыКредитныхИнструментовСНоминалами.Период,
		|	_КредитныеИнструменты.ДатаПогашения,
		|	_ПериодыКредитныхИнструментовСНоминалами.ПериодичностьВыплатыПроцентов,
		|	_ПериодыКредитныхИнструментовСНоминалами.Процент,
		|	_КредитныеИнструменты.ДатаОкончания,
		|	_ПериодыКредитныхИнструментовСНоминалами.Номинал,
		|	_КредитныеИнструменты.Основание,
		|	_КредитныеИнструменты.ВидАктива
		|
		|УПОРЯДОЧИТЬ ПО
		|	КредитныйИнструмент,
		|	НачалоПериода
		|ИТОГИ
		|	МАКСИМУМ(ДатаПогашения)
		|ПО
		|	КредитныйИнструмент";
	
#КонецОбласти

	Запрос.УстановитьПараметр("Граница"											, Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период"											, Период);
	Запрос.УстановитьПараметр("ПроизвольнаяПроцентнаяСтавка"					, ПроизвольнаяПроцентнаяСтавка);		
	Запрос.УстановитьПараметр("ПоДатуПогашения"									, ПоДатуПогашения);		
	   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		ЭтоДепозитныйВклад = ТипЗнч(Выборка.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
		ЭтоЗаймПолученный = НЕ ЭтоДепозитныйВклад И Выборка.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Полученный;
		
		//#техдолг: надо бы вынести признак для погашения с фиксацией в регистре НоминалыКредитныхИнструментов на случай ввода начальных остатков.
		// или в УсловияКредитныхИнструментов, но часто одну формулировку читают по-разному, поэтому прав заимодавец или как договорятся :)
		//Проценты при частичном погашении могут выплачиваться на погашаему сумму или на всю сумму. Других вариантов пока не было
		ПриЧастичномПогашенииВыплачиваютсяПроцентыНаПогашаемуюСумму = ЭтоЗаймПолученный;
		
		СтрокиНоминаловКредитногоИнструмента = НоминалыКредитныхИнструментов.НайтиСтроки(Новый Структура("КредитныйИнструмент",Выборка.КредитныйИнструмент));
		СтрокиНоминаловКредитныхИнструментовПоДатамПогашения = НоминалыКредитныхИнструментовПоДатамПогашения.НайтиСтроки(Новый Структура("КредитныйИнструмент",Выборка.КредитныйИнструмент));

		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//цикл по потокам номиналов частичного погашения. Потоки номиналов частичного размещения делить не надо.
			
			Если СтрокиНоминаловКредитныхИнструментовПоДатамПогашения.Количество() <> 1 Тогда
				//для каждой строки установим сумму номинала, актуальную(!) на период расчета процентов
				Для Каждого СтрокаНоминаловКредитныхИнструментовПоДатамПогашения ИЗ СтрокиНоминаловКредитныхИнструментовПоДатамПогашения Цикл
					СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.Номинал = 0;
					Для Каждого СтрокаНоминаловКредитногоИнструмента ИЗ СтрокиНоминаловКредитногоИнструмента Цикл
						Если СтрокаНоминаловКредитногоИнструмента.ДатаДенежногоПотока < ВыборкаДетальныеЗаписи.НачалоПериода Тогда
							Продолжить;
						КонецЕсли;
						Если СтрокаНоминаловКредитногоИнструмента.ДатаДенежногоПотока = СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.ДатаДенежногоПотока Тогда
							СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.Номинал = СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.Номинал + СтрокаНоминаловКредитногоИнструмента.Номинал;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Иначе
				//частичных погашений не было, считаем общей суммой
			КонецЕсли;
			
			Для Каждого СтрокаНоминаловКредитныхИнструментовПоДатамПогашения из СтрокиНоминаловКредитныхИнструментовПоДатамПогашения Цикл
				
				ТекущийНоминал = СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.Номинал;
				
				Если ТекущийНоминал = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаНачалаПериодаРасчетаПроцентов = ВыборкаДетальныеЗаписи.НачалоПериода;
				
				Пока ДатаНачалаПериодаРасчетаПроцентов < ВыборкаДетальныеЗаписи.ОкончаниеПериода Цикл 
					
					ВыплатаПоГрафику = Истина;
					
					//если нужно разделить большой период на части, кратные периоду выплаты процентов (месяц/квартал), то считаем по конечную дату периода включительно
					ЭтоКонецПериодаВыплатыПроцентовЗайма = Ложь;
					
					Если ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.Ежемесячно Тогда
						ДатаОкончанияПериодаРасчетаПроцентов = НачалоДня(КонецМесяца(ДатаНачалаПериодаРасчетаПроцентов + 86400));
						ЭтоКонецПериодаВыплатыПроцентовЗайма = НЕ ЭтоДепозитныйВклад;
					ИначеЕсли ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.Ежеквартально Тогда
						ДатаОкончанияПериодаРасчетаПроцентов = НачалоДня(КонецКвартала(ДатаНачалаПериодаРасчетаПроцентов + 86400));
						ЭтоКонецПериодаВыплатыПроцентовЗайма = НЕ ЭтоДепозитныйВклад;
					Иначе
						ДатаОкончанияПериодаРасчетаПроцентов = ВыборкаДетальныеЗаписи.ОкончаниеПериода;
					КонецЕсли;
					
					ДатаНачисленияПоЗайму = 0;
					//для непогашенных номиналов. Проценты по погашенным номиналам рассчитаны общей суммой и оплачены
					Если СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.ДатаДенежногоПотока > Период Тогда
						//для займов полученных - последний рабочий день месяца (методика ЗПИФ_УКПИ)
						Если ЭтоЗаймПолученный  Тогда
							ДатаНачисленияПоЗайму = НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(КонецМесяца(ДатаОкончанияПериодаРасчетаПроцентов-86400))));
							ПоследнийРабочийДеньМесяца = НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(КонецМесяца(ДатаНачалаПериодаРасчетаПроцентов))));
							Если ПоследнийРабочийДеньМесяца < НачалоДня(ДатаНачалаПериодаРасчетаПроцентов) Тогда
								//если последний рабочий день уже прошел, считаем с нерабочего конца месяца за следующий месяц 
								ПоследнийРабочийДеньМесяца = НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(КонецМесяца(ДобавитьМесяц(ДатаНачалаПериодаРасчетаПроцентов,1)))));
							КонецЕсли;
							Если ПоследнийРабочийДеньМесяца > НачалоДня(ДатаНачалаПериодаРасчетаПроцентов) Тогда
								Если ПоследнийРабочийДеньМесяца < НачалоДня(ДатаОкончанияПериодаРасчетаПроцентов) Тогда
									//прибавляем день, т.к. займы считаем днями
									ДатаОкончанияПериодаРасчетаПроцентов = ПоследнийРабочийДеньМесяца + 86400;
									ДатаНачисленияПоЗайму = НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(КонецМесяца(ДатаОкончанияПериодаРасчетаПроцентов-86400))));
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;
					ИначеЕсли ПриЧастичномПогашенииВыплачиваютсяПроцентыНаПогашаемуюСумму Тогда
						ДатаНачисленияПоЗайму = СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.ДатаДенежногоПотока;
					КонецЕсли;
					
					//дата выплаты
					ДатаДенежногоПотока= ДатаОкончанияПериодаРасчетаПроцентов;
					
					Если ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.ВКонцеСрока Тогда
						
						ДатаДенежногоПотока	= ВыборкаДетальныеЗаписи.ДатаПогашения;
					
					Иначе
						
						//для займов проценты выплачиваются на следующий день по окончании периода расчета процентов
						Если НЕ ЭтоДепозитныйВклад Тогда
							ДатаДенежногоПотока = ДатаОкончанияПериодаРасчетаПроцентов + 86400;
						КонецЕсли;
						
						//решили что для депозитов тоже надо по рабочим дням считать потоки
						Если ДатаДенежногоПотока > ВыборкаДетальныеЗаписи.ДатаПогашения Тогда
							ДатаДенежногоПотока = ВыборкаДетальныеЗаписи.ДатаПогашения;
						КонецЕсли;
						Если  ДатаДенежногоПотока <> ВыборкаДетальныеЗаписи.ДатаПогашения Тогда
							ДатаДенежногоПотока		= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ДатаДенежногоПотока),1);
						КонецЕсли;
						
					КонецЕсли;
					
					Если ДатаОкончанияПериодаРасчетаПроцентов > ВыборкаДетальныеЗаписи.ОкончаниеПериода Тогда
						ДатаОкончанияПериодаРасчетаПроцентов = ВыборкаДетальныеЗаписи.ОкончаниеПериода;
						ЭтоКонецПериодаВыплатыПроцентовЗайма = Ложь;
						ВыплатаПоГрафику = ВыборкаДетальныеЗаписи.ОкончаниеПериода < Период;
					КонецЕсли;
					
					Если НЕ ЭтоДепозитныйВклад
						И ВыборкаДетальныеЗаписи.ПоследнийПериод Тогда
						//считаем по дату окончания включительно
						ЭтоКонецПериодаВыплатыПроцентовЗайма = Истина;
					КонецЕсли;

					Дни = РасчетВисокосныхИОбычныхДней(ДатаНачалаПериодаРасчетаПроцентов, ДатаОкончанияПериодаРасчетаПроцентов + ?(ЭтоКонецПериодаВыплатыПроцентовЗайма,86400,0), ЭтоДепозитныйВклад);
					
					ПроцентыНачисленныеВПериоде = ТекущийНоминал * ВыборкаДетальныеЗаписи.Процент / 100 * (Дни["Дней365"] / 365 + Дни["Дней366"] / 366);
					
					КонецПериодаНачисленияПроцентов = ДатаОкончанияПериодаРасчетаПроцентов - ?(НЕ ЭтоДепозитныйВклад,86400,0);
					
					НоваяСтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Добавить();
					НоваяСтрокаСтоимостиКредитныхИнструментов.КредитныйИнструмент		= Выборка.КредитныйИнструмент;
					НоваяСтрокаСтоимостиКредитныхИнструментов.ВидАктива					= ВыборкаДетальныеЗаписи.ВидАктива;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Основание					= ВыборкаДетальныеЗаписи.Основание;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Период					= КонецПериодаНачисленияПроцентов;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Номинал					= ТекущийНоминал;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Процент					= ВыборкаДетальныеЗаписи.Процент;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Проценты					= ПроцентыНачисленныеВПериоде;
					НоваяСтрокаСтоимостиКредитныхИнструментов.Операция					= ?(ЗначениеЗаполнено(ПроцентыНачисленныеВПериоде), "Начисление с " + Формат(ДатаНачалаПериодаРасчетаПроцентов, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончанияПериодаРасчетаПроцентов, "ДФ=dd.MM.yyyy"), "");
					НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаНачисления 			= ?(ЭтоДепозитныйВклад, 
											КонецПериодаНачисленияПроцентов, 
											?(ДатаНачисленияПоЗайму=0,ПолучитьКонецПроцентногоПериода(КонецПериодаНачисленияПроцентов, ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов,  ВыборкаДетальныеЗаписи.ДатаПогашения),ДатаНачисленияПоЗайму));
					НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаДенежногоПотока		= ДатаДенежногоПотока;
					
					НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаПогашенияНоминала		= СтрокаНоминаловКредитныхИнструментовПоДатамПогашения.ДатаДенежногоПотока;
					Если Не ЭтоДепозитныйВклад И Не ПриЧастичномПогашенииВыплачиваютсяПроцентыНаПогашаемуюСумму Тогда
						//заменить на ближайщую дату погашения текущих процентов при частичном или полном погашении. Для просроченных займов отсутствует
						ДатаПогашенияТекущегоНоминала = ПолучитьДатуПогашенияТекущегоНоминала(СтрокиНоминаловКредитныхИнструментовПоДатамПогашения, КонецПериодаНачисленияПроцентов); 
						Если ЗначениеЗаполнено(ДатаПогашенияТекущегоНоминала) Тогда
							НоваяСтрокаСтоимостиКредитныхИнструментов.ДатаПогашенияНоминала = ДатаПогашенияТекущегоНоминала;
						КонецЕсли;
					КонецЕсли;
					
					Если ВыплатаПоГрафику И ЭтоДепозитныйВклад
						И НЕ ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.ВКонцеСрока
						И НЕ ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.Авансом Тогда 
						НоваяСтрокаСтоимостиКредитныхИнструментов.Задолженность		= ПроцентыНачисленныеВПериоде;
					КонецЕсли;

					ДатаНачалаПериодаРасчетаПроцентов = ДатаОкончанияПериодаРасчетаПроцентов + ?(ЭтоКонецПериодаВыплатыПроцентовЗайма,86400,0);
					
				КонецЦикла;
				
			КонецЦикла;	
		КонецЦикла;
		
	КонецЦикла;
	
	//округлить по периодам выплаты процентов
	ДатыНачисленияПроцентовКредитныхИнструментов = СтоимостьКредитныхИнструментов.Скопировать(,"КредитныйИнструмент, Основание, ДатаНачисления, ДатаПогашенияНоминала");
	ДатыНачисленияПроцентовКредитныхИнструментов.Свернуть("КредитныйИнструмент, Основание, ДатаНачисления, ДатаПогашенияНоминала");
	Для Каждого СтрокаДатНачисления из ДатыНачисленияПроцентовКредитныхИнструментов Цикл
		СтрокиСтоимости = СтоимостьКредитныхИнструментов.НайтиСтроки(Новый Структура("КредитныйИнструмент, Основание, ДатаНачисления, ДатаПогашенияНоминала",
			СтрокаДатНачисления.КредитныйИнструмент,СтрокаДатНачисления.Основание,СтрокаДатНачисления.ДатаНачисления, СтрокаДатНачисления.ДатаПогашенияНоминала));
		//оставим погрешность в той строке, в которой она накопилась.	
		ПогрешностьОкругления = 0;
		Для Каждого СтрокаСтоимости из СтрокиСтоимости Цикл
			Если Лев(СтрокаСтоимости.Операция, 13) <> "Начисление с " Тогда
				Продолжить;
			КонецЕсли;
			ПогрешностьОкругления = ПогрешностьОкругления + СтрокаСтоимости.Проценты;
			СтрокаСтоимости.Проценты = Окр(ПогрешностьОкругления, 2);			
			ПогрешностьОкругления = ПогрешностьОкругления - СтрокаСтоимости.Проценты;
		КонецЦикла;				
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДатуПогашенияТекущегоНоминала(СтрокиНоминаловКредитныхИнструментовПоДатамПогашения, ДатаНачисления)
	
	ДатаЧастичногоПогашения = Дата(1,1,1);
	
	Для Каждого СтрокаНоминала из СтрокиНоминаловКредитныхИнструментовПоДатамПогашения Цикл
		Если СтрокаНоминала.Номинал = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаНоминала.ДатаДенежногоПотока >= ДатаНачисления 
			И (ДатаЧастичногоПогашения > СтрокаНоминала.ДатаДенежногоПотока ИЛИ НЕ ЗначениеЗаполнено(ДатаЧастичногоПогашения)) 
		Тогда
			ДатаЧастичногоПогашения = СтрокаНоминала.ДатаДенежногоПотока;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДатаЧастичногоПогашения;
	
КонецФункции

Функция ПолучитьКонецПроцентногоПериода(Дата, ПериодичностьВыплатыПроцентов, ДатаПогашения)
	
	Результат = Дата;
	
	Если ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.Ежемесячно Тогда
		Результат = НачалоДня(КонецМесяца(Дата));
	ИначеЕсли ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.Ежеквартально Тогда
		Результат = НачалоДня(КонецКвартала(Дата));
	ИначеЕсли ПериодичностьВыплатыПроцентов = Перечисления.ПериодичностиВыплатыПроцентов.ВКонцеСрока Тогда
		Результат	= ДатаПогашения;
	Иначе
		Результат = Дата;
	КонецЕсли;
	
	Если  Результат > ДатаПогашения Тогда
		Результат	= ДатаПогашения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляБухгалтерскойПереоценки(Организация, СчетДоверительногоУправления, Период, ВидУчета, ТипКредитногоИнструмента = Неопределено) Экспорт

	ИмяДвижений = Метаданные.Перечисления.ВидыУчета.ЗначенияПеречисления[Перечисления.ВидыУчета.Индекс(ВидУчета)].Имя;
	
	УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
		Период,
		Организация,
		СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		ВидУчета,
		"УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов");
		
	Если УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов Тогда
			
		Депозиты = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, ТипКредитногоИнструмента, Истина,, Истина);
		
		ВидыСубконто = Новый Массив;
	    ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
		
		Для каждого СтрокаДепозиты Из Депозиты Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.СуммаОборотДт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ДоходыБудущихПериодов),
				|			&ВидыСубконто,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И Субконто1 = &ДепозитныйВклад,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", ИмяДвижений);
				
			Запрос.УстановитьПараметр("Валюта", СтрокаДепозиты.КредитныйИнструмент.БанковскийСчет.Валюта);
			Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
			Запрос.УстановитьПараметр("НачалоПериода", СтрокаДепозиты.КредитныйИнструмент.ДатаРегистрации);
			Запрос.УстановитьПараметр("КонецПериода", НачалоДня(Период));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ДепозитныйВклад", СтрокаДепозиты.КредитныйИнструмент);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СтрокаДепозиты.Проценты = Окр(Окр(СтрокаДепозиты.Проценты, 3), 2) - ВыборкаДетальныеЗаписи.СуммаОборотДт;
			КонецЕсли;
			
		КонецЦикла;

		Возврат Депозиты;
		
	Иначе
		Возврат ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, ТипКредитногоИнструмента,,, Истина);
	КонецЕсли;

КонецФункции

// Функция возвращает стоимость депозитов по счёту ду на &Период для РСА: Номинал и Проценты, корректировка ЭСП уже учтена в процентах (или номинале).
// ПоРыночнойСтавке: Ложь - линейный расчёт, Истина - расчёт по рыночоной ставке
Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРСА(СчетДоверительногоУправления, Знач Период, ТипКредитногоИнструмента = Неопределено, 
	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, ПоРыночнойСтавке = Истина, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт	
	
	//не передавать цель в качестве параметра, для других целей функция не используется
	ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	
	Если ПоРыночнойСтавке Тогда
		СтоимостьКредитныхИнструментов = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(СчетДоверительногоУправления, 
			Период, ЦельРасчета, ТипКредитногоИнструмента, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, МенеджерВременныхТаблиц, Отказ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НеУчитывать580ПИОтнестиКорректировкуНаТело.Объект КАК ДепозитныйВклад
			|ИЗ
			|	РегистрСведений.ЗначенияДополнительныхСведений КАК НеУчитывать580ПИОтнестиКорректировкуНаТело
			|ГДЕ
			|	НеУчитывать580ПИОтнестиКорректировкуНаТело.Свойство.Ключ = ""НеУчитывать580ПИОтнестиКорректировкуНаТело""
			|	И НеУчитывать580ПИОтнестиКорректировкуНаТело.Объект В(&МассивДепозитов)
			|	И НеУчитывать580ПИОтнестиКорректировкуНаТело.Значение = ИСТИНА";
		
		Запрос.УстановитьПараметр("МассивДепозитов", СтоимостьКредитныхИнструментов.ВыгрузитьКолонку("КредитныйИнструмент"));
		
		ДепозитыКорректировкаЭСПВТеле = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДепозитныйВклад");
		
		Для Каждого СтрокаСтоимостиКредитныхИнструментов Из СтоимостьКредитныхИнструментов Цикл
			Если ДепозитыКорректировкаЭСПВТеле.Найти(СтрокаСтоимостиКредитныхИнструментов.КредитныйИнструмент) = Неопределено Тогда
				СтрокаСтоимостиКредитныхИнструментов.Проценты = СтрокаСтоимостиКредитныхИнструментов.Проценты + СтрокаСтоимостиКредитныхИнструментов.ПроцентыЭСП;
			Иначе
				СтрокаСтоимостиКредитныхИнструментов.Номинал = СтрокаСтоимостиКредитныхИнструментов.Номинал + СтрокаСтоимостиКредитныхИнструментов.ПроцентыЭСП;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики КАК Займ,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость КАК Стоимость
			|ИЗ
			|	РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
			|			&Период,
			|			СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Займы)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
			|ГДЕ
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия >= &Период
			|	И ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики В(&МассивЗаймов)";
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("МассивЗаймов", СтоимостьКредитныхИнструментов.ВыгрузитьКолонку("КредитныйИнструмент"));
		
		ЗаймыСПрофОценкой = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаЗаймыСПрофОценкой Из ЗаймыСПрофОценкой Цикл
			СтрокаЗайма = СтоимостьКредитныхИнструментов.Найти(СтрокаЗаймыСПрофОценкой.Займ, "КредитныйИнструмент");
			Если СтрокаЗайма <> Неопределено Тогда
				СтрокаСтоимостиКредитныхИнструментов.Номинал  = СтрокаЗаймыСПрофОценкой.Стоимость;
				СтрокаСтоимостиКредитныхИнструментов.Проценты = 0;
				СтрокаСтоимостиКредитныхИнструментов.ПроцентыЭСП = 0;
			КонецЕсли;
		КонецЦикла;
		
	Иначе //Линейно
		СтоимостьКредитныхИнструментов = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, ТипКредитногоИнструмента, , 
			НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия);
	КонецЕсли;
	
	Если СтоимостьКредитныхИнструментов.Колонки.Найти("СуммаРезерва") = Неопределено Тогда
		СтоимостьКредитныхИнструментов.Колонки.Добавить("СуммаРезерва", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;
	
	Возврат СтоимостьКредитныхИнструментов;
	
КонецФункции

// Функция определяет стоимость депозитов с учётом периодичности оценки, периодичности расчёта корректировки ЭСП - подходит для всех целей расчёта.
Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(СчетДоверительногоУправления, Знач Период, 
	ЦельРасчета, ТипКредитногоИнструмента = Неопределено, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт
	
	ПоследнийДеньМесяца			= КонецДня(?(КонецДня(Период) = КонецМесяца(Период), Период, КонецМесяца(ДобавитьМесяц(Период, -1))));
	ПоследнийРабочийДеньМесяца	= КонецДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ПоследнийДеньМесяца));
	
	
	КредитныеИнструменты = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, ТипКредитногоИнструмента, , НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия);

	//Настройки на дату оценки
	Запрос = Новый Запрос;

	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	КредитныеИнструменты.ВидАктива КАК ВидАктива
		|ПОМЕСТИТЬ _КредитныеИнструменты0
		|ИЗ
		|	&КредитныеИнструменты КАК КредитныеИнструменты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	КредитныеИнструменты.ВидАктива КАК ВидАктива,
		|	ВЫБОР
		|		КОГДА НЕ КредитныеИнструменты.ВидАктива В (&ВидыАктивовЗависимыеОтВидаКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.)
		|		КОГДА ТИПЗНАЧЕНИЯ(КредитныеИнструменты.КредитныйИнструмент) = ТИП(Справочник.Займы)
		|			ТОГДА УсловияКредитныхИнструментовСрезПоследних.Контрагент.ВидЮрФизЛица
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.)
		|	КОНЕЦ КАК ВидКонтрагента
		|ПОМЕСТИТЬ _КредитныеИнструменты
		|ИЗ
		|	_КредитныеИнструменты0 КАК КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО КредитныеИнструменты.КредитныйИнструмент = Займы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|						&Период,
		|						ДатаНачалаДействияУсловий <= &Период
		|							И КредитныйИнструмент В
		|								(ВЫБРАТЬ
		|									_КредитныеИнструменты0.КредитныйИнструмент КАК КредитныйИнструмент
		|								ИЗ
		|									_КредитныеИнструменты0 КАК _КредитныеИнструменты0)) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|						&Период,
		|						ДатаНачалаДействияУсловий <= &Период
		|							И КредитныйИнструмент В
		|								(ВЫБРАТЬ
		|									_КредитныеИнструменты0.КредитныйИнструмент КАК КредитныйИнструмент
		|								ИЗ
		|									_КредитныеИнструменты0 КАК _КредитныеИнструменты0)) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО КредитныеИнструменты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
		|ПОМЕСТИТЬ _МинимальныеДатыРасчета
		|ИЗ
		|	(ВЫБРАТЬ
		|		_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|		ВЫРАЗИТЬ(_КредитныеИнструменты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации КАК Период
		|	ИЗ
		|		_КредитныеИнструменты КАК _КредитныеИнструменты
		|	ГДЕ
		|		_КредитныеИнструменты.КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_КредитныеИнструменты.КредитныйИнструмент,
		|		НоминалыКредитныхИнструментовСрезПервых.Период
		|	ИЗ
		|		_КредитныеИнструменты КАК _КредитныеИнструменты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых(
		|					,
		|					КредитныйИнструмент В
		|						(ВЫБРАТЬ
		|							_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент
		|						ИЗ
		|							_КредитныеИнструменты КАК _КредитныеИнструменты
		|						ГДЕ
		|							_КредитныеИнструменты.КредитныйИнструмент ССЫЛКА Справочник.Займы)) КАК НоминалыКредитныхИнструментовСрезПервых
		|			ПО _КредитныеИнструменты.КредитныйИнструмент = НоминалыКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|	ГДЕ
		|		_КредитныеИнструменты.КредитныйИнструмент ССЫЛКА Справочник.Займы
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент,
		|		ДенежныеСредстваВКредитныхИнструментах.Период
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
		|	ГДЕ
		|		ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ДенежныеСредстваВКредитныхИнструментах.Период < &Период
		|		И ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент В
		|				(ВЫБРАТЬ
		|					_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент
		|				ИЗ
		|					_КредитныеИнструменты КАК _КредитныеИнструменты)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВЫБОР
		|		КОГДА НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL
		|			ТОГДА ДепозитныеВклады.ДатаРегистрации
		|		КОГДА НЕ Займы.Ссылка ЕСТЬ NULL
		|			ТОГДА НоминалыКредитныхИнструментовСрезПервых.Период
		|	КОНЕЦ КАК ДатаРегистрации,
		|	ЕСТЬNULL(НастройкиРасчетаНаДатаОценки.НеПоказыватьОтрицательныеПроценты, ЛОЖЬ) КАК НеПоказыватьОтрицательныеПроценты,
		|	ЕСТЬNULL(НеУчитывать580ПИОтнестиКорректировкуНаТело.Значение, ЛОЖЬ) КАК НеУчитывать580ПИОтнестиКорректировкуНаТело,
		|	ВЫБОР
		|		КОГДА _КредитныеИнструменты.КредитныйИнструмент ССЫЛКА Справочник.Займы
		|			ТОГДА &Период
		|		КОГДА ЕСТЬNULL(СписыватьКредиторкуВКонцеМесяца.Значение, ЛОЖЬ) = ИСТИНА
		|				И _МинимальныеДатыРасчета.Период < &ПоследнийДеньМесяца
		|			ТОГДА &ПоследнийДеньМесяца
		|		КОГДА ЕСТЬNULL(СписыватьКредиторкуВКонцеМесяца.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА _МинимальныеДатыРасчета.Период
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьОценки = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА &Период
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьОценки = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|				И _МинимальныеДатыРасчета.Период < &ПоследнийДеньМесяца
		|			ТОГДА &ПоследнийДеньМесяца
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьОценки = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.ЕжемесячноВПоследнийРабочийДень)
		|				И _МинимальныеДатыРасчета.Период < &ПоследнийРабочийДеньМесяца
		|			ТОГДА &ПоследнийРабочийДеньМесяца
		|		ИНАЧЕ _МинимальныеДатыРасчета.Период
		|	КОНЕЦ КАК ДатаОценки,
		|	ВЫБОР
		|		КОГДА _КредитныеИнструменты.КредитныйИнструмент ССЫЛКА Справочник.Займы
		|			ТОГДА &Период
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьРасчетаКорректировкиЭСП = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно)
		|			ТОГДА &Период
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьРасчетаКорректировкиЭСП = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежемесячно)
		|				И _МинимальныеДатыРасчета.Период < &ПоследнийДеньМесяца
		|			ТОГДА &ПоследнийДеньМесяца
		|		КОГДА НастройкиРасчетаНаДатаОценки.ПериодичностьРасчетаКорректировкиЭСП = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.ЕжемесячноВПоследнийРабочийДень)
		|				И _МинимальныеДатыРасчета.Период < &ПоследнийРабочийДеньМесяца
		|			ТОГДА &ПоследнийРабочийДеньМесяца
		|		ИНАЧЕ КОНЕЦПЕРИОДА(_МинимальныеДатыРасчета.Период, ДЕНЬ)
		|	КОНЕЦ КАК ДатаРасчетаКорректировкиЭСП
		|ИЗ
		|	_КредитныеИнструменты КАК _КредитныеИнструменты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = Займы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Субъект = &СчетДоверительногоУправления
		|					И ЦельРасчета = &ЦельРасчета
		|					И СхемаПроверкиСущественностиОтклонений <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетНеРеализован)
		|					И ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))) КАК НастройкиРасчетаКлиентаНаДатаОценки
		|		ПО (ВЫБОР
		|				КОГДА НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL
		|					ТОГДА ДепозитныеВклады.БанковскийСчет.Валюта = НастройкиРасчетаКлиентаНаДатаОценки.Валюта
		|							И НастройкиРасчетаКлиентаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты)
		|				КОГДА НЕ Займы.Ссылка ЕСТЬ NULL
		|						И Займы.Валюта = НастройкиРасчетаКлиентаНаДатаОценки.Валюта
		|					ТОГДА НастройкиРасчетаКлиентаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные)
		|								И Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)
		|							ИЛИ НастройкиРасчетаКлиентаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)
		|								И Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Полученный)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (НастройкиРасчетаКлиентаНаДатаОценки.ВидКонтрагента = _КредитныеИнструменты.ВидКонтрагента)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ЦельРасчета = &ЦельРасчета
		|					И СхемаПроверкиСущественностиОтклонений <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетНеРеализован)
		|					И ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные))) КАК НастройкиРасчетаНаДатаОценки
		|		ПО (ЕСТЬNULL(НастройкиРасчетаКлиентаНаДатаОценки.Субъект, КлиентыДоверительногоУправленияСрезПоследних.Клиент) = НастройкиРасчетаНаДатаОценки.Субъект)
		|			И (НастройкиРасчетаНаДатаОценки.СхемаПроверкиСущественностиОтклонений <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять))
		|			И (ВЫБОР
		|				КОГДА НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL
		|					ТОГДА НастройкиРасчетаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты)
		|							И ДепозитныеВклады.БанковскийСчет.Валюта = НастройкиРасчетаНаДатаОценки.Валюта
		|				КОГДА НЕ Займы.Ссылка ЕСТЬ NULL
		|						И Займы.Валюта = НастройкиРасчетаНаДатаОценки.Валюта
		|					ТОГДА НастройкиРасчетаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные)
		|								И Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)
		|							ИЛИ НастройкиРасчетаНаДатаОценки.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)
		|								И Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Полученный)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (НастройкиРасчетаНаДатаОценки.ВидКонтрагента = _КредитныеИнструменты.ВидКонтрагента)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК СписыватьКредиторкуВКонцеМесяца
		|		ПО (СписыватьКредиторкуВКонцеМесяца.Объект = _КредитныеИнструменты.КредитныйИнструмент)
		|			И (СписыватьКредиторкуВКонцеМесяца.Свойство.Ключ = ""СписыватьКредиторкуВКонцеМесяца"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МинимальныеДатыРасчета КАК _МинимальныеДатыРасчета
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = _МинимальныеДатыРасчета.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НеУчитывать580ПИОтнестиКорректировкуНаТело
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = НеУчитывать580ПИОтнестиКорректировкуНаТело.Объект
		|			И (НеУчитывать580ПИОтнестиКорректировкуНаТело.Свойство.Ключ = ""НеУчитывать580ПИОтнестиКорректировкуНаТело"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых(
		|				,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_КредитныеИнструменты.КредитныйИнструмент КАК КредитныйИнструмент
		|					ИЗ
		|						_КредитныеИнструменты КАК _КредитныеИнструменты)) КАК НоминалыКредитныхИнструментовСрезПервых
		|		ПО _КредитныеИнструменты.КредитныйИнструмент = НоминалыКредитныхИнструментовСрезПервых.КредитныйИнструмент";
#КонецОбласти

	Запрос.УстановитьПараметр("Граница"						, Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период"						, Период);
	Запрос.УстановитьПараметр("ПоследнийДеньМесяца"			, ПоследнийДеньМесяца);
	Запрос.УстановитьПараметр("ПоследнийРабочийДеньМесяца"	, ПоследнийРабочийДеньМесяца);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, СчетДоверительногоУправления.Организация);
	Запрос.УстановитьПараметр("ЦельРасчета"					, ЦельРасчета);
	Запрос.УстановитьПараметр("КредитныеИнструменты"		, КредитныеИнструменты);
	Запрос.УстановитьПараметр("ВидыАктивовЗависимыеОтВидаКонтрагента",	РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидыАктивовЗависимыеОтВидаКонтрагента());

	НастройкиКредитныхИнструментов = Запрос.Выполнить().Выгрузить();
	
	КредитныеИнструментыРасчитанныеПолностью	= Новый Соответствие;
	КредитныеИнструментыРасчитанныеЛинейно		= Новый Соответствие;
	
	КредитныеИнструментыПоРычночнойСтавке = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавке(СчетДоверительногоУправления, Период, ЦельРасчета, ТипКредитногоИнструмента, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, МенеджерВременныхТаблиц, Отказ);	
	КредитныеИнструментыРасчитанныеПолностью.Вставить(Период, КредитныеИнструментыПоРычночнойСтавке.Скопировать());
	КредитныеИнструментыПоРычночнойСтавке.Очистить();
		
	Для Каждого СтрокаНастройки Из НастройкиКредитныхИнструментов Цикл
		//для кредитных инструментов в разных валютах, могут быть разные даты расчёта
		Если КредитныеИнструментыРасчитанныеПолностью.Получить(СтрокаНастройки.ДатаРасчетаКорректировкиЭСП) = Неопределено Тогда
			КредитныеИнструментыРасчитанныеПолностью.Вставить(СтрокаНастройки.ДатаРасчетаКорректировкиЭСП, ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавке(СчетДоверительногоУправления, СтрокаНастройки.ДатаРасчетаКорректировкиЭСП, ЦельРасчета, ТипКредитногоИнструмента, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия, МенеджерВременныхТаблиц, Отказ));
		КонецЕсли;
		
		НоваяСтрокаКредитныхИнструментов = КредитныеИнструментыПоРычночнойСтавке.Добавить();
		
		//В полном расчёте есть все данные по депозиту
		Для Каждого СтрокаДанных Из КредитныеИнструментыРасчитанныеПолностью.Получить(СтрокаНастройки.ДатаРасчетаКорректировкиЭСП) Цикл
			Если СтрокаНастройки.КредитныйИнструмент = СтрокаДанных.КредитныйИнструмент Тогда 
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКредитныхИнструментов, СтрокаДанных);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Если корректировка расчитывается в другой день, пересчитаем номинал и процент на дату оценки
		Если СтрокаНастройки.ДатаРасчетаКорректировкиЭСП <> СтрокаНастройки.ДатаОценки Тогда
			Если КредитныеИнструментыРасчитанныеЛинейно.Получить(СтрокаНастройки.ДатаОценки) = Неопределено Тогда
				КредитныеИнструментыРасчитанныеЛинейно.Вставить(СтрокаНастройки.ДатаОценки, ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, СтрокаНастройки.ДатаОценки, ТипКредитногоИнструмента, , НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия));
			КонецЕсли;
			
			Для Каждого СтрокаДанных Из КредитныеИнструментыРасчитанныеЛинейно.Получить(СтрокаНастройки.ДатаОценки) Цикл
				Если СтрокаНастройки.КредитныйИнструмент = СтрокаДанных.КредитныйИнструмент Тогда 
					ЗаполнитьЗначенияСвойств(НоваяСтрокаКредитныхИнструментов, СтрокаДанных);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокаНастройки.НеПоказыватьОтрицательныеПроценты
			И НЕ СтрокаНастройки.НеУчитывать580ПИОтнестиКорректировкуНаТело
			И НоваяСтрокаКредитныхИнструментов.Проценты + НоваяСтрокаКредитныхИнструментов.ПроцентыЭСП < 0 Тогда
			НоваяСтрокаКредитныхИнструментов.Проценты = 0;
			НоваяСтрокаКредитныхИнструментов.ПроцентыЭСП = 0;
		КонецЕсли;
	
	КонецЦикла;
	
	Если МенеджерВременныхТаблиц <> Неопределено 
	   И МенеджерВременныхТаблиц.Таблицы.Найти("_РасшифровкаСтоимостиАктивовПоРыночнойСтавке") <> Неопределено
	   И НЕ Отказ Тогда //если отказ расшифровка уже добавлена
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(КредитныеИнструментыПоРычночнойСтавке, "_РасшифровкаСтоимостиАктивовПоРыночнойСтавке", МенеджерВременныхТаблиц);
	КонецЕсли;
	
	Возврат КредитныеИнструментыПоРычночнойСтавке;
	
КонецФункции

// Функция возвращает стоимость депозитов по счёту ДУ по рычночной ставке: получение остатков и применение настроек проверки на рыночность
Функция ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавке(СчетДоверительногоУправления, Знач Период, ЦельРасчета, 
	ТипКредитногоИнструмента = Неопределено, НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт
	
	КредитныеИнструменты = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, ТипКредитногоИнструмента, , НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия);
	
	КредитныеИнструментыПоРычночнойСтавке = РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке(КредитныеИнструменты, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ);
	
	Возврат КредитныеИнструментыПоРычночнойСтавке;
	
КонецФункции

Функция НазваниеКредитногоИнструментаРодительныйПадеж(КредитныйИнструмент) Экспорт
	
	Если ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда	
		Возврат "депозитного вклада";
	ИначеЕсли ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		Если КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
			Возврат "займа выданного";
		Иначе
			Возврат "займа полученного";
		КонецЕсли; 
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неизвестный кредитный инструмент!", КредитныйИнструмент);
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьСтоимостиПросроченныхЗаймовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Знач Период, 
	НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия = Ложь, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт
		
	//не передавать цель в качестве параметра, для других целей функция не используется
	ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	
	//Линейно. Просроченная задолженность по рынку не оценивается
	СтоимостьКредитныхИнструментов = ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, Период, Перечисления.ВидыАктивов.ДебиторскаяЗадолженность, , 
			НеУчитыватьКредитныеИнструментыПослеДатыЗакрытия);
			
	КоличествоПросроченныхЗаймов = СтоимостьКредитныхИнструментов.Количество();
	Если КоличествоПросроченныхЗаймов>0 И Период >= Дата(2022,6,21) Тогда		
		//#434641 - дефолт		
		ДефолтныйЗайм = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПросрочкаЗаймаКотенко_РПИ");
		Для сц = - КоличествоПросроченныхЗаймов + 1 По 0 Цикл
			СтрокаСтоимостиКредитныхИнструментов = СтоимостьКредитныхИнструментов.Получить(сц);
			Если СтрокаСтоимостиКредитныхИнструментов.Основание = ДефолтныйЗайм Тогда
				СтоимостьКредитныхИнструментов.Удалить(СтрокаСтоимостиКредитныхИнструментов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
			
	Если СтоимостьКредитныхИнструментов.Колонки.Найти("СуммаРезерва") = Неопределено Тогда
		СтоимостьКредитныхИнструментов.Колонки.Добавить("СуммаРезерва", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;
	Если СтоимостьКредитныхИнструментов.Колонки.Найти("ЕстьОбесценение") = Неопределено Тогда
		СтоимостьКредитныхИнструментов.Колонки.Добавить("ЕстьОбесценение", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	Если СтоимостьКредитныхИнструментов.Колонки.Найти("Актив") = Неопределено Тогда
		СтоимостьКредитныхИнструментов.Колонки.Добавить("Актив", Новый ОписаниеТипов("СправочникСсылка.Займы"));
		СтоимостьКредитныхИнструментов.ЗагрузитьКолонку(СтоимостьКредитныхИнструментов.ВыгрузитьКолонку("КредитныйИнструмент"), "Актив");
	КонецЕсли;
	
	РаботаСоСтоимостьюПоРыночнойСтавке.ПрименитьОбесценение(СтоимостьКредитныхИнструментов, СчетДоверительногоУправления, Период, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении, Отказ);
	
	Возврат СтоимостьКредитныхИнструментов;
	
КонецФункции

// Функция возвращает справедливую стоимость погашаемой суммы займа
Функция ПолучитьСправедливуюСтоимостьПогашенияКредитногоИнструмента(ДокументЗакрытияКредитногоИнструмента, Знач Период, Отказ = Ложь) Экспорт
	
	Результат = 0;
	
	//не передавать цель в качестве параметра, для других целей функция не используется
	ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеКредитногоИнструмента.Дата КАК Дата,
		|	ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ЗакрытиеКредитногоИнструмента.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(перечисление.ВидыКредитныхИнструментов.Выданный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные)
		|		КОГДА Займы.ВидКредитногоИнструмента = ЗНАЧЕНИЕ(перечисление.ВидыКредитныхИнструментов.Полученный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты)
		|	КОНЕЦ КАК ВидАктива
		|ИЗ
		|	Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО ЗакрытиеКредитногоИнструмента.КредитныйИнструмент = Займы.Ссылка
		|ГДЕ
		|	ЗакрытиеКредитногоИнструмента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗакрытияКредитногоИнструмента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Результат = ДокументЗакрытияКредитногоИнструмента.Сумма;
		//Заполним денежный поток погашения
		ПотокПоЗакрытию = ПолучитьСтруктуруТаблицыСтоимостиКредитныхИнструментов();
		
		СтрокаПотока = ПотокПоЗакрытию.Добавить();
		СтрокаПотока.КредитныйИнструмент = ВыборкаДетальныеЗаписи.КредитныйИнструмент;
		СтрокаПотока.Основание = ДокументЗакрытияКредитногоИнструмента;
		
		СтрокаПотока.ВидАктива = ВыборкаДетальныеЗаписи.ВидАктива;
		СтрокаПотока.ДатаДенежногоПотока = ПолучитьДатуПогашенияКредитногоИнструмента(ВыборкаДетальныеЗаписи.КредитныйИнструмент, ВыборкаДетальныеЗаписи.Дата);
		СтрокаПотока.Проценты = 0;
		СтрокаПотока.Задолженность = 0;
		СтрокаПотока.Номинал = ВыборкаДетальныеЗаписи.Сумма;
		
		ПотокиПоАктивуПоРыночнойСтавке = РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке(
											ПотокПоЗакрытию,
											ДокументЗакрытияКредитногоИнструмента.СчетДоверительногоУправления, 
											Период, 
											ЦельРасчета,, 
											Отказ); 
											
		Для Каждого Поток из ПотокиПоАктивуПоРыночнойСтавке Цикл
			Результат = Результат + Поток.ПроцентыЭСП + Поток.СуммаРезерва;
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРасчетныйСчетВозвратаДенежныхСредств(Дата, Организация, КредитныйИнструмент) Экспорт
	
	//Для Займов вида "Полученный" с счета "РасчетныйСчетВозвратаДенежныхСредств" списываются денежные средства.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств
		|ПОМЕСТИТЬ _ВсеУсловияКредитногоИнструмента
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Дата,
		|			Организация = &организация
		|				И КредитныйИнструмент = &КредитныйИнструмент) КАК УсловияКредитныхИнструментовСрезПоследних
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий <= &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ВсеУсловияКредитногоИнструмента.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств
		|ИЗ
		|	_ВсеУсловияКредитногоИнструмента КАК _ВсеУсловияКредитногоИнструмента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ВсеУсловияКредитногоИнструмента.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_ВсеУсловияКредитногоИнструмента.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|		ИЗ
		|			_ВсеУсловияКредитногоИнструмента КАК _ВсеУсловияКредитногоИнструмента
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ВсеУсловияКредитногоИнструмента.КредитныйИнструмент) КАК ВложенныйЗапрос
		|		ПО _ВсеУсловияКредитногоИнструмента.КредитныйИнструмент = ВложенныйЗапрос.КредитныйИнструмент
		|			И _ВсеУсловияКредитногоИнструмента.ДатаНачалаДействияУсловий = ВложенныйЗапрос.ДатаНачалаДействияУсловий";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КредитныйИнструмент", КредитныйИнструмент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РасчетныйСчетВозвратаДенежныхСредств;	
	КонецЦикла;
		
КонецФункции

Функция НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(Организация, КредитныйИнструмент) Экспорт
	
	// Реквизит заполняем только для УК РЭМ и Траст, кроме биржевых депозитов
	
	Возврат (Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
				Или Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"))
		И Не ЭтоБиржевойДепозит(КредитныйИнструмент); 
	
КонецФункции
 
Функция ЭтоБиржевойДепозит(КредитныйИнструмент) Экспорт
	
	Возврат ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады")
		И ЗначениеЗаполнено(КредитныйИнструмент)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КредитныйИнструмент, "МестоХранения") = Справочники.МестаХранения.ММВБ_ДепозитыСЦК;
	
КонецФункции
