#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Клиент = Параметры.Клиент;
	
	ПоСостояниюНа = ТекущаяДата();
	
	Если ПолноправныйПользователь Тогда
		НовыйЭлемент = Элементы.Добавить("Организация", Тип("ПолеФормы"), Элементы.ВерхЛево);
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаОчистки			= Истина;
		НовыйЭлемент.КнопкаОткрытия			= Ложь;
		НовыйЭлемент.КнопкаСоздания			= Ложь;
		НовыйЭлемент.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Верх;
	Иначе
		НовыйЭлемент = Элементы.Добавить("Организация", Тип("ПолеФормы"), Элементы.ВерхЛево);
		НовыйЭлемент.Вид				= ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Гиперссылка		= Истина;
		НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	НовыйЭлемент.ПутьКДанным = "Организация";
	
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОрганизацияПриИзменении");
	
	Если Параметры.Отбор <> Неопределено
		И Параметры.Отбор.Свойство("Договор")
		И ЗначениеЗаполнено(Параметры.Отбор.Договор) Тогда
		
		ВидДоговораДоговор	= Параметры.Отбор.Договор;
		Организация			= ВидДоговораДоговор.Организация;
		
		Элементы.Организация.ТолькоПросмотр			= Истина;
		Элементы.ВидДоговораДоговор.ТолькоПросмотр	= Истина;
		
	Иначе
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ГруппировкаПакетов = "" Тогда
		ГруппировкаПакетов = "ПоПериодичности";
	КонецЕсли;
	
	ОбновитьПакеты();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ГруппаОтчетовПриИзменении(Элемент)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоговорПриИзменении(Элемент)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСостояниюНаПриИзменении(Элемент)
	
	Если ПроверитьЗаполнение() Тогда
		ОбновитьПакеты();
	Иначе
		ОчиститьПакеты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПриАктивизацииСтроки(Элемент)
	
	ОбновитьСостав();
	
	ТекущиеДанные = Элементы.Пакеты.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ТекущиеДанные.ВыводитьФормирование Тогда
			Элементы.ВидСостава.Доступность = Ложь;
		Иначе
			Элементы.ВидСостава.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.ВидСостава.Доступность = Ложь;
		УстановитьТекущуюСтрокуСостава();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСоставаПриИзменении(Элемент)
	
	ОбновитьСостав();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьКомандСостава();
	
	ОбновитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = ПолучитьПараметрыФормыНастройкиСостава("Просмотр");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуСостава(ПараметрыФормы);
		ОбновитьПакеты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьКомандНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеОтчетыПриИзменении(Элемент)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = ПолучитьПараметрыФормыЗначенияНастройки("Просмотр");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуНастройки(ПараметрыФормы);
		ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ПакетыПоменятьПорядокГруппировки(Команда)
	
	Если ГруппировкаПакетов = "ПоПериодичности" Тогда
		ГруппировкаПакетов = "ПоОтчетам";
	Иначе
		ГруппировкаПакетов = "ПоПериодичности";
	КонецЕсли;
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыОбновить(Команда)
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОбновить(Команда)
	
	ОбновитьСостав();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставФормировать(Команда)
	
	ИзменитьСостав("Добавление", Истина);
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНеФормировать(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = ПолучитьПараметрыФормыНастройкиСостава("ОтменаФормирования");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуСостава(ПараметрыФормы);
		ОбновитьПакеты();
	КонецЕсли;           
	
КонецПроцедуры

&НаКлиенте
Процедура СоставИзменитьДатуНастройки(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = ПолучитьПараметрыФормыНастройкиСостава("Редактирование");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуСостава(ПараметрыФормы);
		ОбновитьПакеты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНаследовать(Команда)
	
	ИзменитьСостав("Наследование");
	
	ОбновитьПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыДобавитьОтчет(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыНастройкиСостава("Добавление");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуСостава(ПараметрыФормы);
		ОбновитьПакеты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыОтключитьФормирование(Команда)
	
	Если Не ЗначениеЗаполнено(ВидДоговораДоговор) Тогда
		Если Вопрос("Поле 'Вид договора / договор' не заполнено, поэтому отчеты будут отключены у всех договоров клиента! Продолжить?'", РежимДиалогаВопрос.ДаНет,,, "Внимание!!!") = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
	ДатаОтключения = ПоСостояниюНа;
	Если Не ВвестиЗначение(ДатаОтключения, "Укажите дату отключения формирования отчетов", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата))) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаПакеты = Элементы.Пакеты.ТекущиеДанные;
	СтруктураОтбора = ПолучитьСтруктуруОтбораОтчетов(ТекущаяСтрокаПакеты);
			
	ОтключитьФормирование(СтруктураОтбора, Клиент, ВидДоговораДоговор, ПоСостояниюНа, ДатаОтключения);
		
	ОбновитьПакеты();

КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтключить(Команда)
	
	ИзменитьНастройку("Наследование");
	
	ОбновитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУдалить(Команда)
	
	ИзменитьНастройку("Удаление");
	
	ОбновитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДобавитьЗначение(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыЗначенияНастройки("Добавление");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуНастройки(ПараметрыФормы);
		ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИзменить(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыЗначенияНастройки("Редактирование");
	
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФормуНастройки(ПараметрыФормы);
		ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбновить(Команда)
	
	ОбновитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Для Каждого Строка Из Пакеты.ПолучитьЭлементы() Цикл
		Элементы.Пакеты.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Для Каждого Строка Из Пакеты.ПолучитьЭлементы() Цикл
		СвернутьВетку(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставУдалитьНастройку(Команда)
	
	ИзменитьСостав("Удаление");
	
	ОбновитьПакеты();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура УстановитьВидимостьКомандНастроек()
	
	ТекущиеДанныеНастройки	= Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанныеНастройки = Неопределено Тогда
		Элементы.НастройкиКонтекстноеМенюДобавитьЗначение.Видимость	= Ложь;
		Элементы.НастройкиКонтекстноеМенюИзменить.Видимость			= Ложь;
		Элементы.НастройкиКонтекстноеМенюОтключить.Видимость		= Ложь;
		Элементы.НастройкиКонтекстноеМенюУдалить.Видимость			= Ложь;
	Иначе
		Элементы.НастройкиКонтекстноеМенюДобавитьЗначение.Видимость	= Истина;
		Элементы.НастройкиКонтекстноеМенюИзменить.Видимость			= ЗначениеЗаполнено(ТекущиеДанныеНастройки.ДатаНастройки);
		Элементы.НастройкиКонтекстноеМенюОтключить.Видимость		= ТекущиеДанныеНастройки.СобственноеЗначение;
		Элементы.НастройкиКонтекстноеМенюУдалить.Видимость			= ЗначениеЗаполнено(ТекущиеДанныеНастройки.ДатаНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПакетыНаСервере()
	
	Пакеты.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Период",				ПоСостояниюНа);
	Запрос.УстановитьПараметр("Клиент",				Клиент);
	Запрос.УстановитьПараметр("Периодичность",		Периодичность);
	Запрос.УстановитьПараметр("ПустаяДата",			Дата(1, 1, 1));
	
	Если ЗначениеЗаполнено(ГруппаОтчетов) Тогда
		Запрос.УстановитьПараметр("ГруппыОтчетов", ГруппаОтчетов);
	Иначе
		ГруппыОтчетов = Новый Массив;
		ГруппыОтчетов.Добавить(Справочники.Отчеты.Бухгалтерия);
		ГруппыОтчетов.Добавить(Справочники.Отчеты.БэкОфис);
		
		Запрос.УстановитьПараметр("ГруппыОтчетов", ГруппыОтчетов);
	КонецЕсли;
	
	Договор		= Неопределено;
	ВидДоговора	= Неопределено;
	
	Если ЗначениеЗаполнено(ВидДоговораДоговор) Тогда
		Если ТипЗнч(ВидДоговораДоговор) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			ВидДоговора	= ВидДоговораДоговор;
		Иначе
			Договор		= ВидДоговораДоговор;
			ВидДоговора	= ВидДоговораДоговор.ВидДоговораДоверительногоУправления;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ВидДоговора",	ВидДоговора);
	Запрос.УстановитьПараметр("ВсеОтчеты",		ВсеОтчеты);
	
	ПоместитьДействующиеДоговорыКлиентаВЗапрос(Запрос, Истина);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СоставИНастройкиОтчетовСрезПоследних.Отчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Отчеты.Бухгалтерия))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Отчеты.Бухгалтерия)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Отчеты.БэкОфис)
		|	КОНЕЦ КАК ГруппаОтчетов,
		|	СоставИНастройкиОтчетовСрезПоследних.Периодичность КАК Периодичность,
		|	СоставИНастройкиОтчетовСрезПоследних.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетовСрезПоследних.Значение = ИСТИНА КАК ВходитВСостав
		|ПОМЕСТИТЬ _Пакеты
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|				И ВЫБОР
		|					КОГДА &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|						ТОГДА Организация = &Организация
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И Отчет В ИЕРАРХИИ (&ГруппыОтчетов)
		|				И ВЫБОР
		|					КОГДА &Периодичность <> ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ПустаяСсылка)
		|						ТОГДА Периодичность = &Периодичность
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Договор
		|					КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И ВЫРАЗИТЬ(Субъект КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = &ВидДоговора
		|					ИНАЧЕ Субъект = &Клиент
		|							ИЛИ Субъект В
		|								(ВЫБРАТЬ
		|									_ДействующиеДоговорыКлиента.Договор
		|								ИЗ
		|									_ДействующиеДоговорыКлиента)
		|				КОНЕЦ) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Пакеты.Организация КАК Организация,
		|	_Пакеты.ГруппаОтчетов КАК ГруппаОтчетов,
		|	_Пакеты.Периодичность КАК Периодичность,
		|	_Пакеты.Отчет КАК Отчет,
		|	_Пакеты1.Отчет ЕСТЬ NULL КАК ИсключенИзСостава
		|ИЗ
		|	_Пакеты КАК _Пакеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Пакеты КАК _Пакеты1
		|		ПО _Пакеты.Организация = _Пакеты1.Организация
		|			И _Пакеты.ГруппаОтчетов = _Пакеты1.ГруппаОтчетов
		|			И _Пакеты.Периодичность = _Пакеты1.Периодичность
		|			И _Пакеты.Отчет = _Пакеты1.Отчет
		|			И (_Пакеты1.ВходитВСостав)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ &ВсеОтчеты
		|				ТОГДА НЕ _Пакеты1.Отчет ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|ИТОГИ ПО
		|	Организация,
		|	ГруппаОтчетов";
	#КонецОбласти
	
	Если ГруппировкаПакетов = "ПоПериодичности" Тогда
		Запрос.Текст = Запрос.Текст + ", Периодичность";
	Иначе
		Запрос.Текст = Запрос.Текст + ", Отчет";
	КонецЕсли;
	
	ВывестиПакеты(Пакеты.ПолучитьЭлементы(), Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПервыеУровниДереваПакетов()
	
	Для Каждого Элемент Из Пакеты.ПолучитьЭлементы() Цикл
		Элементы.Пакеты.Развернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПакеты(Коллекция, Данные)
	
	Пока Данные.Следующий() Цикл
		
		ТекущаяГруппировка = Данные.Группировка();
		
		ВыводитьСтроку = ТекущаяГруппировка = "Организация" И ПолноправныйПользователь И НЕ ЗначениеЗаполнено(Организация)
						ИЛИ ТекущаяГруппировка = "ГруппаОтчетов" И НЕ ЗначениеЗаполнено(ГруппаОтчетов)
						ИЛИ ТекущаяГруппировка = "Периодичность" И НЕ ЗначениеЗаполнено(Периодичность)
						ИЛИ ТекущаяГруппировка = "Отчет" И (ГруппировкаПакетов <> "ПоОтчетам" ИЛИ НЕ ЗначениеЗаполнено(Периодичность))
						ИЛИ ТекущаяГруппировка = "";
						
		Если ВыводитьСтроку Тогда
			НоваяСтрока = Коллекция.Добавить();
			
			Если ТекущаяГруппировка = "" Тогда
				Если ГруппировкаПакетов = "ПоОтчетам" И НЕ ЗначениеЗаполнено(Периодичность) Тогда
					ПолеПредставления = "Периодичность";
				Иначе
					ПолеПредставления = "Отчет";
				КонецЕсли;
			Иначе
				ПолеПредставления = ТекущаяГруппировка;
			КонецЕсли;
			
			НоваяСтрока.Представление			= Данные[ПолеПредставления];
			НоваяСтрока.Организация				= Данные.Организация;
			НоваяСтрока.ГруппаОтчетов			= Данные.ГруппаОтчетов;
			НоваяСтрока.Периодичность			= Данные.Периодичность;
			НоваяСтрока.Отчет					= Данные.Отчет;
			НоваяСтрока.ВыводитьФормирование	= Данные.Уровень() = 3;
			НоваяСтрока.ИсключенИзСостава		= Данные.ИсключенИзСостава;
			
			ПодчиненнаяКоллекиця = НоваяСтрока.ПолучитьЭлементы();
		Иначе
			ПодчиненнаяКоллекиця = Коллекция;
		КонецЕсли;
						
		Если Данные.Уровень() = 2 Тогда
			Обход = ОбходРезультатаЗапроса.Прямой;
		Иначе
			Обход = ОбходРезультатаЗапроса.ПоГруппировкам;
		КонецЕсли;
		
		Если Данные.Уровень() < 3 Тогда
			ВывестиПакеты(ПодчиненнаяКоллекиця, Данные.Выбрать(Обход));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПредставления()
	
	ЗаголовокПредставления = "";
	
	Если ПолноправныйПользователь Тогда
		Если ЗначениеЗаполнено(Организация) Тогда
			ЗаголовокПредставления = Строка(Организация) + " / ";
		Иначе
			ЗаголовокПредставления = "Организация / ";
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаОтчетов) Тогда
		ЗаголовокПредставления = ЗаголовокПредставления + Строка(ГруппаОтчетов) + " / ";
	Иначе
		ЗаголовокПредставления = ЗаголовокПредставления + "Группа отчетов / ";
	КонецЕсли;
	
	Если ГруппировкаПакетов = "ПоПериодичности" Тогда
		Если ЗначениеЗаполнено(Периодичность) Тогда
			ЗаголовокПредставления = ЗаголовокПредставления + Строка(Периодичность) + " / Отчет";
		Иначе
			ЗаголовокПредставления = ЗаголовокПредставления + "Периодичность / Отчет";
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Периодичность) Тогда
			ЗаголовокПредставления = ЗаголовокПредставления + Строка(Периодичность) + " / Отчет";
		Иначе
			ЗаголовокПредставления = ЗаголовокПредставления + "Отчет / Периодичность";
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПакетыПредставление.Заголовок = ЗаголовокПредставления;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКомандыСменыГруппировки()
	
	Если ГруппировкаПакетов = "ПоПериодичности" Тогда
		Элементы.ПакетыКонтекстноеМенюПоменятьПорядокГруппировки.Заголовок = "Группировать по отчетам";
	Иначе
		Элементы.ПакетыКонтекстноеМенюПоменятьПорядокГруппировки.Заголовок = "Группировать по периодичности";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьКлючСтрокиПакетов(СтрокаПакетов)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Организация",	СтрокаПакетов.Организация);
	Результат.Вставить("ГруппаОтчетов",	СтрокаПакетов.ГруппаОтчетов);
	Результат.Вставить("Периодичность",	СтрокаПакетов.Периодичность);
	Результат.Вставить("Отчет",			СтрокаПакетов.Отчет);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиСтрокуПакетаПоКлючу(Ключ, Коллекция, Уровни, ТекущийУровень)
	
	Результат = Неопределено;
	
	Уровень = Уровни[ТекущийУровень];
	
	Для Каждого Элемент Из Коллекция Цикл
		
		Если Элемент[Уровень] = Ключ[Уровень] Тогда
			Если Уровни.Количество()-1 > ТекущийУровень Тогда
				РезультатПоискаВПодчиенных = НайтиСтрокуПакетаПоКлючу(Ключ, Элемент.ПолучитьЭлементы(), Уровни, ТекущийУровень + 1);
				
				Если РезультатПоискаВПодчиенных = Неопределено Тогда
					Результат = Элемент;
				Иначе
					Результат = РезультатПоискаВПодчиенных;
				КонецЕсли; 
			Иначе
				Результат = Элемент;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИдентификаторСтрокиПакетаПоКлючу(Ключ, Уровни)
	
	Строка = НайтиСтрокуПакетаПоКлючу(Ключ, Пакеты.ПолучитьЭлементы(), Уровни, 0);
	
	Если Строка <> Неопределено Тогда
		Возврат Строка.ПолучитьИдентификатор();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьУровниДереваПакетов()
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Результат.Добавить("Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГруппаОтчетов) Тогда
		Результат.Добавить("ГруппаОтчетов");
	КонецЕсли;
	
	Если ГруппировкаПакетов = "ПоПериодичности" Тогда
		Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
			Результат.Добавить("Периодичность");
		КонецЕсли;
		
		Результат.Добавить("Отчет");
	Иначе
		Результат.Добавить("Отчет");
		
		Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
			Результат.Добавить("Периодичность");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтрокуПакетов(Ключ)
	
	Уровни = ПолучитьУровниДереваПакетов();
	
	ИдентификаторСтроки = ПолучитьИдентификаторСтрокиПакетаПоКлючу(Ключ, Уровни);
	
	Если ИдентификаторСтроки <> Неопределено Тогда
		Элементы.Пакеты.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПакеты()
	
	ТекущиеДанные = Элементы.Пакеты.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		КлючВыбраннойСтроки = СформироватьКлючСтрокиПакетов(ТекущиеДанные);
	Иначе
		КлючВыбраннойСтроки = Неопределено;
	КонецЕсли;
	
	УстановитьЗаголовокКомандыСменыГруппировки();
	УстановитьЗаголовокПредставления();
	ЗаполнитьПакетыНаСервере();
	РазвернутьПервыеУровниДереваПакетов();
	
	Если КлючВыбраннойСтроки <> Неопределено Тогда
		УстановитьТекущуюСтрокуПакетов(КлючВыбраннойСтроки);
	КонецЕсли;
	
	ОбновитьСостав();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПакеты()
	
	Пакеты.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостав(Ключ)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			ПоСостояниюНа);
	Запрос.УстановитьПараметр("Организация",	Ключ.Организация);
	Запрос.УстановитьПараметр("Клиент",			Клиент);
	Запрос.УстановитьПараметр("Периодичность",	Ключ.Периодичность);
	Запрос.УстановитьПараметр("Отчет",			Ключ.Отчет);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1, 1, 1));
	
	Договор		= Неопределено;
	ВидДоговора	= Неопределено;
	
	Если ЗначениеЗаполнено(ВидДоговораДоговор) Тогда
		Если ТипЗнч(ВидДоговораДоговор) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			ВидДоговора	= ВидДоговораДоговор;
		Иначе
			Договор		= ВидДоговораДоговор;
			ВидДоговора	= ВидДоговораДоговор.ВидДоговораДоверительногоУправления;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ВидДоговора",	ВидДоговора);
	
	ПоместитьДействующиеДоговорыКлиентаВЗапрос(Запрос);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Субъект КАК Субъект,
		|	СоставИНастройкиОтчетовСрезПоследних.ВидДоговора КАК ВидДоговора,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА ВЫБОР
		|					КОГДА СоставИНастройкиОтчетовСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|						ТОГДА ""Клиент""
		|					ИНАЧЕ ""ВидДоговора""
		|				КОНЕЦ
		|		ИНАЧЕ ""Договор""
		|	КОНЕЦ КАК ВидЗаписи,
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Значение,
		|	СоставИНастройкиОтчетовСрезПоследних.Период КАК ДатаНастройки,
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения КАК ВидЗначения,
		|	СоставИНастройкиОтчетовСрезПоследних.Примечание КАК Примечание
		|ПОМЕСТИТЬ _НастройкиСоставаОтчетов
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|				И Организация = &Организация
		|				И Отчет = &Отчет
		|				И Периодичность = &Периодичность
		|				И ВЫБОР
		|					КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Договор
		|					КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И ВЫРАЗИТЬ(Субъект КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = &ВидДоговора
		|					ИНАЧЕ Субъект = &Клиент
		|							ИЛИ Субъект В
		|								(ВЫБРАТЬ
		|									_ДействующиеДоговорыКлиента.Договор
		|								ИЗ
		|									_ДействующиеДоговорыКлиента)
		|				КОНЕЦ) КАК СоставИНастройкиОтчетовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Клиент КАК Клиент,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговора,
		|	ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка) КАК Договор,
		|	""Клиент"" КАК Уровень
		|ПОМЕСТИТЬ _СтруктураДоговоровКлиента		
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДействующиеДоговорыКлиента.Клиент,
		|	_ДействующиеДоговорыКлиента.ВидДоговора,
		|	ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка),
		|	""ВидДоговора""
		|ИЗ
		|	_ДействующиеДоговорыКлиента КАК _ДействующиеДоговорыКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ДействующиеДоговорыКлиента.Клиент,
		|	_ДействующиеДоговорыКлиента.ВидДоговора,
		|	_ДействующиеДоговорыКлиента.Договор,
		|	""Договор""
		|ИЗ
		|	_ДействующиеДоговорыКлиента КАК _ДействующиеДоговорыКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СтруктураДоговоровКлиента.Уровень КАК Уровень,
		|	_СтруктураДоговоровКлиента.Клиент КАК Клиент,
		|	_СтруктураДоговоровКлиента.ВидДоговора КАК ВидДоговора,
		|	_СтруктураДоговоровКлиента.Договор КАК Договор,
		|	ЕСТЬNULL(_НастройкиСоставаОтчетов.ДатаНастройки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНастройки,
		|	ЕСТЬNULL(_НастройкиСоставаОтчетов.ВидЗначения, ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.ПоУмолчанию)) = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное) КАК СобственноеЗначение,
		|	ЕСТЬNULL(_НастройкиСоставаОтчетов.Значение, ЛОЖЬ) КАК Формировать,
		|	ВЫБОР
		|		КОГДА _СтруктураДоговоровКлиента.Уровень = ""Клиент""
		|			ТОГДА 0
		|		КОГДА _СтруктураДоговоровКлиента.Уровень = ""ВидДоговора""
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ДляСортировкиПоТипуСтроки,
		|	_НастройкиСоставаОтчетов.Примечание КАК Примечание
		|ИЗ
		|	_СтруктураДоговоровКлиента КАК _СтруктураДоговоровКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаОтчетов КАК _НастройкиСоставаОтчетов
		|		ПО _СтруктураДоговоровКлиента.Уровень = _НастройкиСоставаОтчетов.ВидЗаписи
		|			И (ВЫБОР
		|				КОГДА _СтруктураДоговоровКлиента.Уровень = ""Клиент""
		|					ТОГДА _СтруктураДоговоровКлиента.Клиент = _НастройкиСоставаОтчетов.Субъект
		|				КОГДА _СтруктураДоговоровКлиента.Уровень = ""ВидДоговора""
		|					ТОГДА _СтруктураДоговоровКлиента.Клиент = _НастройкиСоставаОтчетов.Субъект
		|							И _СтруктураДоговоровКлиента.ВидДоговора = _НастройкиСоставаОтчетов.ВидДоговора
		|				КОГДА _СтруктураДоговоровКлиента.Уровень = ""Договор""
		|					ТОГДА _СтруктураДоговоровКлиента.Договор = _НастройкиСоставаОтчетов.Субъект
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ВидДоговора,
		|	ДляСортировкиПоТипуСтроки,
		|	_СтруктураДоговоровКлиента.Договор.Наименование";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Уровень = "Клиент" Тогда
			
			Если ВидСостава = 0 ИЛИ Выборка.СобственноеЗначение Тогда
				СтрокаКлиента = Состав.ПолучитьЭлементы().Добавить();
				
				СтрокаКлиента.Представление			= Выборка.Клиент;
				СтрокаКлиента.Клиент				= Выборка.Клиент;
				СтрокаКлиента.Уровень				= Выборка.Уровень;
				СтрокаКлиента.ДатаНастройки			= Выборка.ДатаНастройки;
				СтрокаКлиента.Формировать			= Выборка.Формировать;
				СтрокаКлиента.СобственноеЗначение	= Выборка.СобственноеЗначение;
				СтрокаКлиента.Примечание			= Выборка.Примечание;
				
				КоллекцияКлиента = СтрокаКлиента.ПолучитьЭлементы();
			Иначе
				СтрокаКлиента		= Неопределено;
				КоллекцияКлиента	= Состав.ПолучитьЭлементы();
			КонецЕсли;
			
		ИначеЕсли Выборка.Уровень = "ВидДоговора" Тогда
			
			Если ВидСостава = 0 ИЛИ Выборка.СобственноеЗначение Тогда
				СтрокаВидаДоговора = КоллекцияКлиента.Добавить();
				
				СтрокаВидаДоговора.Представление		= Выборка.ВидДоговора;
				СтрокаВидаДоговора.Клиент				= Выборка.Клиент;
				СтрокаВидаДоговора.ВидДоговора			= Выборка.ВидДоговора;
				СтрокаВидаДоговора.Уровень				= Выборка.Уровень;
				СтрокаВидаДоговора.СобственноеЗначение	= Выборка.СобственноеЗначение;
				СтрокаВидаДоговора.ДатаНастройки		= Выборка.ДатаНастройки;
				СтрокаВидаДоговора.Примечание			= Выборка.Примечание;
				
				Если СтрокаВидаДоговора.СобственноеЗначение Тогда
					СтрокаВидаДоговора.Формировать = Выборка.Формировать;
				ИначеЕсли СтрокаКлиента <> Неопределено Тогда
					Если ЗначениеЗаполнено(СтрокаКлиента.ДатаНастройки) Тогда
						СтрокаВидаДоговора.Формировать				= СтрокаКлиента.Формировать;
						СтрокаВидаДоговора.УнаследованоОт			= "Клиент";
						СтрокаВидаДоговора.ДатаНаследуемойНастройки	= СтрокаКлиента.ДатаНастройки;
						СтрокаВидаДоговора.Примечание				= СтрокаКлиента.Примечание;
					Иначе
						СтрокаВидаДоговора.Формировать				= Ложь;
						СтрокаВидаДоговора.УнаследованоОт			= "Нет записей для наследования";
					КонецЕсли;
				КонецЕсли;
				
				КоллекцияВидаДоговора	= СтрокаВидаДоговора.ПолучитьЭлементы();
			Иначе
				СтрокаВидаДоговора		= Неопределено;
				КоллекцияВидаДоговора	= КоллекцияКлиента;
			КонецЕсли;
			
		Иначе
			
			Если ВидСостава = 0 ИЛИ Выборка.СобственноеЗначение Тогда
				СтрокаДоговора = КоллекцияВидаДоговора.Добавить();
				
				СтрокаДоговора.Представление		= Выборка.Договор;
				СтрокаДоговора.Клиент				= Выборка.Клиент;
				СтрокаДоговора.ВидДоговора			= Выборка.ВидДоговора;
				СтрокаДоговора.Договор				= Выборка.Договор;
				СтрокаДоговора.Уровень				= Выборка.Уровень;
				СтрокаДоговора.СобственноеЗначение	= Выборка.СобственноеЗначение;
				СтрокаДоговора.ДатаНастройки		= Выборка.ДатаНастройки;
				СтрокаДоговора.Примечание			= Выборка.Примечание;
				
				Если СтрокаДоговора.СобственноеЗначение Тогда
					СтрокаДоговора.Формировать = Выборка.Формировать;
				ИначеЕсли СтрокаВидаДоговора <> Неопределено
					И СтрокаВидаДоговора.СобственноеЗначение Тогда
						
					СтрокаДоговора.Формировать				= СтрокаВидаДоговора.Формировать;
					СтрокаДоговора.Примечание				= ?(ПустаяСтрока(СтрокаДоговора.Примечание), СтрокаВидаДоговора.Примечание, СтрокаДоговора.Примечание);
					СтрокаДоговора.УнаследованоОт			= "Вид договора";
					
					Если ЗначениеЗаполнено(СтрокаВидаДоговора.ДатаНастройки) Тогда
						СтрокаДоговора.ДатаНаследуемойНастройки	= СтрокаВидаДоговора.ДатаНастройки;
					ИначеЕсли СтрокаКлиента <> Неопределено Тогда
						СтрокаДоговора.ДатаНаследуемойНастройки	= СтрокаКлиента.ДатаНастройки;
					КонецЕсли;
					
				ИначеЕсли СтрокаКлиента <> Неопределено Тогда
					Если ЗначениеЗаполнено(СтрокаКлиента.ДатаНастройки) Тогда
						СтрокаДоговора.Формировать				= СтрокаКлиента.Формировать;
						СтрокаДоговора.УнаследованоОт			= "Клиент";
						СтрокаДоговора.ДатаНаследуемойНастройки	= СтрокаКлиента.ДатаНастройки;
						СтрокаДоговора.Примечание				= ?(ПустаяСтрока(СтрокаДоговора.Примечание), СтрокаКлиента.Примечание, СтрокаДоговора.Примечание);
					Иначе
						СтрокаДоговора.Формировать				= Ложь;
						СтрокаДоговора.УнаследованоОт			= "Нет записей для наследования";
					КонецЕсли
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДеревоДоговоровКлиента(ВыбраннаяОрганизация)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			ПоСостояниюНа);
	Запрос.УстановитьПараметр("Организация",	ВыбраннаяОрганизация);
	Запрос.УстановитьПараметр("Клиент",			Клиент);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1, 1, 1));
	
	Договор		= Неопределено;
	ВидДоговора	= Неопределено;
	
	Если ЗначениеЗаполнено(ВидДоговораДоговор) Тогда
		Если ТипЗнч(ВидДоговораДоговор) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			ВидДоговора	= ВидДоговораДоговор;
		Иначе
			Договор		= ВидДоговораДоговор;
			ВидДоговора	= ВидДоговораДоговор.ВидДоговораДоверительногоУправления;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ВидДоговора",	ВидДоговора);
	
	ПоместитьДействующиеДоговорыКлиентаВЗапрос(Запрос);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.ВидДоговора КАК ВидДоговора,
		|	ВложенныйЗапрос.Договор КАК Договор
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДействующиеДоговорыКлиента.Клиент КАК Клиент,
		|		_ДействующиеДоговорыКлиента.ВидДоговора КАК ВидДоговора,
		|		_ДействующиеДоговорыКлиента.Договор КАК Договор
		|	ИЗ
		|		_ДействующиеДоговорыКлиента КАК _ДействующиеДоговорыКлиента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Клиент,
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.),
		|		ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДоговора,
		|	ВложенныйЗапрос.Договор.Наименование
		|ИТОГИ ПО
		|	Клиент,
		|	ВидДоговора";
	#КонецОбласти
	
	ВыборкаКлиент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлиент.Следующий() Цикл
		
		СтрокаКлиент = Состав.ПолучитьЭлементы().Добавить();
		
		СтрокаКлиент.Представление	= ВыборкаКлиент.Клиент;
		СтрокаКлиент.Клиент			= ВыборкаКлиент.Клиент;
		СтрокаКлиент.Уровень		= "Клиент";
		
		ВыборкаВидыДоговоров = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВидыДоговоров.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаВидыДоговоров.ВидДоговора) Тогда 
				Продолжить;
			КонецЕсли;
			
			СтрокаВидДоговора = СтрокаКлиент.ПолучитьЭлементы().Добавить();
			
			СтрокаВидДоговора.Представление	= ВыборкаВидыДоговоров.ВидДоговора;
			СтрокаВидДоговора.Клиент		= ВыборкаВидыДоговоров.Клиент;
			СтрокаВидДоговора.ВидДоговора	= ВыборкаВидыДоговоров.ВидДоговора;
			СтрокаВидДоговора.Уровень		= "ВидДоговора";
			
			Выборка = ВыборкаВидыДоговоров.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = СтрокаВидДоговора.ПолучитьЭлементы().Добавить();
				
				НоваяСтрока.Представление	= Выборка.Договор;
				НоваяСтрока.Клиент			= Выборка.Клиент;
				НоваяСтрока.ВидДоговора		= Выборка.ВидДоговора;
				НоваяСтрока.Договор			= Выборка.Договор;
				НоваяСтрока.Уровень			= "Договор";
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовСостава(Выводить)
	
	Элементы.СоставГруппаФормирование.Видимость	= Выводить;
	Элементы.СоставДатаНастройки.Видимость		= Выводить;
	Элементы.СоставГруппаНаследование.Видимость	= Выводить;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьКлючСтрокиСостава(СтрокаСостава)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Уровень",		СтрокаСостава.Уровень);
	Результат.Вставить("Клиент",		СтрокаСостава.Клиент);
	Результат.Вставить("ВидДоговора",	СтрокаСостава.ВидДоговора);
	Результат.Вставить("Договор",		СтрокаСостава.Договор);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиСтрокуСоставаПоКлючу(Ключ, Коллекция)
	
	Результат = Неопределено;
	
	Для Каждого Элемент Из Коллекция Цикл
		
		Если Ключ[Ключ.Уровень] = Элемент[Ключ.Уровень] Тогда
			Результат = Элемент;
			
			Прервать;
		ИначеЕсли Элемент[Элемент.Уровень] = Ключ[Элемент.Уровень] Тогда
			
			Если Элемент.ПолучитьЭлементы().Количество() = 0 Тогда
				Результат = Элемент;
			Иначе
				РезультатПоискаВПодчиненных = НайтиСтрокуСоставаПоКлючу(Ключ, Элемент.ПолучитьЭлементы());
				
				Если РезультатПоискаВПодчиненных = Неопределено Тогда
					Результат = Элемент;
				Иначе
					Результат = РезультатПоискаВПодчиненных;
				КонецЕсли;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИдентификаторСтрокиСоставаПоКлючу(Ключ)
	
	Если Ключ = Неопределено
		И Состав.ПолучитьЭлементы().Количество() > 0 Тогда
		Возврат Состав.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	Строка = НайтиСтрокуСоставаПоКлючу(Ключ, Состав.ПолучитьЭлементы());
	
	Если Строка <> Неопределено Тогда
		Возврат Строка.ПолучитьИдентификатор();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтрокуСостава(Ключ = Неопределено)
	
	ИдентификаторСтроки = ПолучитьИдентификаторСтрокиСоставаПоКлючу(Ключ);
	
	Если ИдентификаторСтроки <> Неопределено Тогда
		Элементы.Состав.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостав()
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		КлючВыбраннойСтроки = СформироватьКлючСтрокиСостава(ТекущиеДанные);
	Иначе
		КлючВыбраннойСтроки = Неопределено;
	КонецЕсли;
	
	Состав.ПолучитьЭлементы().Очистить();
	
	ТекущиеДанныеПакетов = Элементы.Пакеты.ТекущиеДанные;
	
	Если ТекущиеДанныеПакетов <> Неопределено Тогда
		
		УстановитьВидимостьЭлементовСостава(ТекущиеДанныеПакетов.ВыводитьФормирование);
		
		Если ТекущиеДанныеПакетов.ВыводитьФормирование Тогда
			ЗаполнитьСостав(СформироватьКлючСтрокиПакетов(ТекущиеДанныеПакетов));
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанныеПакетов.Организация) Тогда
			ВывестиДеревоДоговоровКлиента(ТекущиеДанныеПакетов.Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Элемент Из Состав.ПолучитьЭлементы() Цикл
		Элементы.Состав.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
	УстановитьТекущуюСтрокуСостава(КлючВыбраннойСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьСоставаНаСервере(ЗначенияКлючаЗаписи, ТипСубъекта, ВидЗначения, Значение = Неопределено, Замещение = Ложь, Примечание = "")
	
	ЗначенияКлючаЗаписи.Вставить("Настройка", ПланыВидовХарактеристик.НастройкиОтчетов.Формировать);
	
	РегистрыСведений.СоставИНастройкиОтчетов.ДобавитьЗапись(ЗначенияКлючаЗаписи, Перечисления.ВидыЗначенияНастроекОтчетов[ВидЗначения], Значение, Замещение, Примечание);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостав(Событие, Формировать = Неопределено)
	
	ТекущиеДанныеПакетов	= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав		= Элементы.Состав.ТекущиеДанные;
	
	ДатаНастройки			= ?(Событие = "Удаление", ТекущиеДанныеСостав.ДатаНастройки, ПоСостояниюНа);
	
	Если ТекущиеДанныеСостав.Уровень <> "Договор" Тогда
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ДатаНастройки",	ДатаНастройки);
		ПараметрыФормы.Вставить("Организация",		ТекущиеДанныеПакетов.Организация);
		ПараметрыФормы.Вставить("Отчет",			ТекущиеДанныеПакетов.Отчет);
		ПараметрыФормы.Вставить("Периодичность",	ТекущиеДанныеПакетов.Периодичность);
		ПараметрыФормы.Вставить("Клиент", 			Клиент);
		ПараметрыФормы.Вставить("ВидДоговора",		ТекущиеДанныеСостав.ВидДоговора);
		ПараметрыФормы.Вставить("Событие",			Событие);
		
		РезультатПодтверждения = ОткрытьФормуМодально("РегистрСведений.СоставИНастройкиОтчетов.Форма.ФормаПредупрежденияПриИзмененииСостава", ПараметрыФормы, ЭтаФорма);
		
		Если РезультатПодтверждения = Неопределено Тогда
			Возврат;
		Иначе
			ДатаНастройки = РезультатПодтверждения;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияКлючаЗаписи = Новый Структура;
	
	ЗначенияКлючаЗаписи.Вставить("Организация",		ТекущиеДанныеПакетов.Организация);
	ЗначенияКлючаЗаписи.Вставить("Отчет",			ТекущиеДанныеПакетов.Отчет);
	ЗначенияКлючаЗаписи.Вставить("Периодичность",	ТекущиеДанныеПакетов.Периодичность);
	
	Если ТекущиеДанныеСостав.Уровень = "Клиент"
		ИЛИ ТекущиеДанныеСостав.Уровень = "ВидДоговора" Тогда
		ЗначенияКлючаЗаписи.Вставить("Субъект", Клиент);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора", ТекущиеДанныеСостав.ВидДоговора);
	Иначе
		ЗначенияКлючаЗаписи.Вставить("Субъект",		ТекущиеДанныеСостав.Договор);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора",	ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка"));
	КонецЕсли;
	
	ЗначенияКлючаЗаписи.Вставить("Период", ДатаНастройки);
	
	Если Событие = "Удаление" Тогда
		УдалитьЗаписьСостава(ЗначенияКлючаЗаписи);
	Иначе
		
		Если ЕстьЗапись(ЗначенияКлючаЗаписи) Тогда
			Если Вопрос(СтрШаблон("На %1 уже есть запись. Заменить новой записью?", Формат(ЗначенияКлючаЗаписи.Период, "ДФ=dd.MM.yyyy")), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
				Замещение = Истина;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			Замещение = Ложь;
		КонецЕсли;
		
		Если Событие = "Добавление" Тогда
			ДобавитьЗаписьСоставаНаСервере(ЗначенияКлючаЗаписи, ТекущиеДанныеСостав.Уровень, "Собственное", Формировать, Замещение, ТекущиеДанныеСостав.Примечание);
		ИначеЕсли Событие = "Наследование" Тогда
			ДобавитьЗаписьСоставаНаСервере(ЗначенияКлючаЗаписи, ТекущиеДанныеСостав.Уровень, "ПоУмолчанию", , Замещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКомандСостава()
	
	ТекущиеДанныеПакетов	= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав		= Элементы.Состав.ТекущиеДанные;
	
	// Если дерево пакетов пустое или выбрана строка группировки, в контекстном меню выводим только кнопку "Обновить".
	Если ТекущиеДанныеПакетов = Неопределено
		ИЛИ НЕ ТекущиеДанныеПакетов.ВыводитьФормирование
		ИЛИ ТекущиеДанныеСостав = Неопределено Тогда
		Элементы.СоставКонтекстноеМенюФормировать.Видимость				= Ложь;
		Элементы.СоставКонтекстноеМенюНеФормировать.Видимость			= Ложь;
		Элементы.СоставКонтекстноеМенюНаследовать.Видимость				= Ложь;
		Элементы.СоставКонтекстноеМенюИзменитьДатуНастройки.Видимость	= Ложь;
		Элементы.СоставКонтекстноеМенюУдалитьНастройку.Видимость		= Ложь;
	Иначе
		Элементы.СоставКонтекстноеМенюФормировать.Видимость				= НЕ ТекущиеДанныеСостав.Формировать;
		Элементы.СоставКонтекстноеМенюНеФормировать.Видимость			= ТекущиеДанныеСостав.Формировать;
		Элементы.СоставКонтекстноеМенюНаследовать.Видимость				= ТекущиеДанныеСостав.СобственноеЗначение И ТекущиеДанныеСостав.Уровень <> "Клиент";
		Элементы.СоставКонтекстноеМенюИзменитьДатуНастройки.Видимость	= ЗначениеЗаполнено(ТекущиеДанныеСостав.ДатаНастройки);
		Элементы.СоставКонтекстноеМенюУдалитьНастройку.Видимость		= ЗначениеЗаполнено(ТекущиеДанныеСостав.ДатаНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТекущийУровеньНастройки(СтрокаПакета, СтрокаСостава)
	
	УровеньНастройки = 0;
	
	// Настройки договора.
	Если ЗначениеЗаполнено(СтрокаСостава.Договор) Тогда
		УровеньНастройки = 19;
	// Настройки вида договора.
	ИначеЕсли ЗначениеЗаполнено(СтрокаСостава.ВидДоговора) Тогда
		УровеньНастройки = 13;
	// Настройки клиента.
	ИначеЕсли ЗначениеЗаполнено(СтрокаСостава.Клиент) Тогда
		УровеньНастройки = 7;
	// Настройки организации.
	Иначе
		УровеньНастройки = 1;
	КонецЕсли;
	
	// Для отчета.
	Если ЗначениеЗаполнено(СтрокаПакета.Отчет) Тогда
		УровеньНастройки = УровеньНастройки + 4;
	// Для группы отчетов.
	ИначеЕсли ЗначениеЗаполнено(СтрокаПакета.ГруппаОтчетов) Тогда
		УровеньНастройки = УровеньНастройки + 2;
	КонецЕсли;
	
	// С определенной периодичностью.
	Если ЗначениеЗаполнено(СтрокаПакета.Периодичность) Тогда
		УровеньНастройки = УровеньНастройки + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки(ИдентификаторПакета, ИдентификаторСостава)
	
	Если ИдентификаторПакета = Неопределено ИЛИ ИдентификаторСостава = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПакета	= Пакеты.НайтиПоИдентификатору(ИдентификаторПакета);
	СтрокаСостава	= Состав.НайтиПоИдентификатору(ИдентификаторСостава);
	
	ОпределитьТекущийУровеньНастройки(СтрокаПакета, СтрокаСостава);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПоСостояниюНа",		ПоСостояниюНа);
	Запрос.УстановитьПараметр("Организация",		СтрокаПакета.Организация);
	Запрос.УстановитьПараметр("ГруппаОтчетов",		СтрокаПакета.ГруппаОтчетов);
	Запрос.УстановитьПараметр("Периодичность",		СтрокаПакета.Периодичность);
	Запрос.УстановитьПараметр("Отчет",				СтрокаПакета.Отчет);
	Запрос.УстановитьПараметр("Клиент",				СтрокаСостава.Клиент);
	Запрос.УстановитьПараметр("ВидДоговора",		СтрокаСостава.ВидДоговора);
	Запрос.УстановитьПараметр("Договор",			СтрокаСостава.Договор);
	Запрос.УстановитьПараметр("УровеньНастройки",	УровеньНастройки);
	Запрос.УстановитьПараметр("ОбщиеНастройки",		РаботаСОтчетами.ПолучитьОбщиеНастройки());
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиОтчетов.Ссылка КАК Настройка
		|ПОМЕСТИТЬ _СписокНастроек
		|ИЗ
		|	ПланВидовХарактеристик.НастройкиОтчетов КАК НастройкиОтчетов
		|ГДЕ
		|	НастройкиОтчетов.Ссылка В(&ОбщиеНастройки)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НазначенияНастроекОтчетов.Настройка
		|ИЗ
		|	РегистрСведений.НазначенияНастроекОтчетов КАК НазначенияНастроекОтчетов
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &Отчет <> ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|			ТОГДА НазначенияНастроекОтчетов.Отчет = &Отчет
		|		КОГДА &ГруппаОтчетов <> ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|			ТОГДА НазначенияНастроекОтчетов.Отчет В ИЕРАРХИИ (&ГруппаОтчетов)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И НазначенияНастроекОтчетов.Настройка <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Настройка КАК Настройка,
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное) КАК Действующее,
		|	ВЫБОР
		|		КОГДА СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)
		|			ТОГДА СоставИНастройкиОтчетовСрезПоследних.Значение
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Значение,
		|	СоставИНастройкиОтчетовСрезПоследних.Период КАК ДатаНастройки,
		|	СоставИНастройкиОтчетовСрезПоследних.Приоритет КАК Приоритет,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА СоставИНастройкиОтчетовСрезПоследних.Субъект
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Клиент,
		|	СоставИНастройкиОтчетовСрезПоследних.ВидДоговора КАК ВидДоговора,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА СоставИНастройкиОтчетовСрезПоследних.Субъект
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	СоставИНастройкиОтчетовСрезПоследних.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетовСрезПоследних.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ _ВсеЗначенияНастроек
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&ПоСостояниюНа,
		|			Настройка В
		|					(ВЫБРАТЬ
		|						_СписокНастроек.Настройка КАК Настройка
		|					ИЗ
		|						_СписокНастроек КАК _СписокНастроек)
		|				И Организация = &Организация
		|				И (Периодичность = &Периодичность
		|					ИЛИ Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ПустаяСсылка))
		|				И ВЫБОР
		|					КОГДА &Отчет <> ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|						ТОГДА Отчет = &Отчет
		|								ИЛИ Отчет = &ГруппаОтчетов
		|								ИЛИ Отчет = ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|					КОГДА &ГруппаОтчетов <> ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|						ТОГДА Отчет = &ГруппаОтчетов
		|								ИЛИ Отчет = ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|					ИНАЧЕ Отчет = ЗНАЧЕНИЕ(Справочник.Отчеты.ПустаяСсылка)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Договор <> ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка)
		|						ТОГДА Субъект = &Договор
		|								ИЛИ Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ Субъект = НЕОПРЕДЕЛЕНО
		|					КОГДА &ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|						ТОГДА Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ Субъект = НЕОПРЕДЕЛЕНО
		|					КОГДА &Клиент <> НЕОПРЕДЕЛЕНО
		|						ТОГДА Субъект = &Клиент
		|									И ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|								ИЛИ Субъект = НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Субъект = НЕОПРЕДЕЛЕНО
		|				КОНЕЦ) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Приоритет <= &УровеньНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеЗначенияНастроек.Настройка КАК Настройка,
		|	МАКСИМУМ(_ВсеЗначенияНастроек.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ _ПриоритетыИспользуемыхНастроек
		|ИЗ
		|	_ВсеЗначенияНастроек КАК _ВсеЗначенияНастроек
		|ГДЕ
		|	_ВсеЗначенияНастроек.Действующее
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеЗначенияНастроек.Настройка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПриоритетыИспользуемыхНастроек.Настройка КАК Настройка,
		|	_ВсеЗначенияНастроек.Значение КАК Значение,
		|	_ВсеЗначенияНастроек.ДатаНастройки КАК ДатаНастройки,
		|	_ВсеЗначенияНастроек.Приоритет КАК Приоритет,
		|	_ВсеЗначенияНастроек.Клиент КАК Клиент,
		|	_ВсеЗначенияНастроек.ВидДоговора КАК ВидДоговора,
		|	_ВсеЗначенияНастроек.Договор КАК Договор,
		|	_ВсеЗначенияНастроек.Отчет КАК Отчет,
		|	_ВсеЗначенияНастроек.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ _ИспользуемыеНастройки
		|ИЗ
		|	_ПриоритетыИспользуемыхНастроек КАК _ПриоритетыИспользуемыхНастроек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеЗначенияНастроек КАК _ВсеЗначенияНастроек
		|		ПО _ПриоритетыИспользуемыхНастроек.Настройка = _ВсеЗначенияНастроек.Настройка
		|			И _ПриоритетыИспользуемыхНастроек.Приоритет = _ВсеЗначенияНастроек.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СписокНастроек.Настройка КАК Настройка,
		|	ЕСТЬNULL(_ВсеЗначенияНастроек.ДатаНастройки, НЕОПРЕДЕЛЕНО) КАК ДатаНастройки,
		|	ЕСТЬNULL(_ВсеЗначенияНастроек.Действующее, ЛОЖЬ) КАК Действующее
		|ПОМЕСТИТЬ _СостояниеНастройкиТекущегоУровня
		|ИЗ
		|	_СписокНастроек КАК _СписокНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеЗначенияНастроек КАК _ВсеЗначенияНастроек
		|		ПО _СписокНастроек.Настройка = _ВсеЗначенияНастроек.Настройка
		|			И (_ВсеЗначенияНастроек.Приоритет = &УровеньНастройки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СостояниеНастройкиТекущегоУровня.Настройка КАК Настройка,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Значение, НЕОПРЕДЕЛЕНО) КАК Значение,
		|	_СостояниеНастройкиТекущегоУровня.ДатаНастройки КАК ДатаНастройки,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Приоритет, 0) = &УровеньНастройки КАК СобственноеЗначение,
		|	ВЫБОР
		|		КОГДА _ИспользуемыеНастройки.Приоритет ЕСТЬ NULL
		|			ТОГДА ""Нет записей для наследования""
		|		КОГДА _ИспользуемыеНастройки.Приоритет = &УровеньНастройки
		|			ТОГДА """"
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 1 И 2
		|			ТОГДА ""Организация""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 3 И 4
		|			ТОГДА ""Группа отчетов организации""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 5 И 6
		|			ТОГДА ""Отчет организации""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 7 И 8
		|			ТОГДА ""Клиент""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 9 И 10
		|			ТОГДА ""Группа отчетов клиента""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 11 И 12
		|			ТОГДА ""Отчет клиента""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 13 И 14
		|			ТОГДА ""Вид договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 15 И 16
		|			ТОГДА ""Группа отчетов вида договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 17 И 18
		|			ТОГДА ""Отчет вида договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 19 И 20
		|			ТОГДА ""Договор""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 21 И 22
		|			ТОГДА ""Группа отчетов договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет = 23
		|			ТОГДА ""Отчет договора""
		|	КОНЕЦ КАК УнаследованоОт,
		|	МАКСИМУМ(ЕСТЬNULL(_ВсеЗначенияНастроек.ДатаНастройки, НЕОПРЕДЕЛЕНО)) КАК ДатаНаследуемойНастройки,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Клиент, НЕОПРЕДЕЛЕНО) КАК Клиент,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.ВидДоговора, НЕОПРЕДЕЛЕНО) КАК ВидДоговора,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Отчет, НЕОПРЕДЕЛЕНО) КАК Отчет,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Периодичность, НЕОПРЕДЕЛЕНО) КАК Периодичность
		|ИЗ
		|	_СостояниеНастройкиТекущегоУровня КАК _СостояниеНастройкиТекущегоУровня
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИспользуемыеНастройки КАК _ИспользуемыеНастройки
		|		ПО _СостояниеНастройкиТекущегоУровня.Настройка = _ИспользуемыеНастройки.Настройка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеЗначенияНастроек КАК _ВсеЗначенияНастроек
		|		ПО _СостояниеНастройкиТекущегоУровня.Настройка = _ВсеЗначенияНастроек.Настройка
		|			И (_ВсеЗначенияНастроек.Приоритет < &УровеньНастройки)
		|			И (_ВсеЗначенияНастроек.Приоритет >= _ИспользуемыеНастройки.Приоритет)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СостояниеНастройкиТекущегоУровня.Настройка,
		|	_СостояниеНастройкиТекущегоУровня.ДатаНастройки,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Значение, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Периодичность, НЕОПРЕДЕЛЕНО),
		|	ВЫБОР
		|		КОГДА _ИспользуемыеНастройки.Приоритет ЕСТЬ NULL
		|			ТОГДА ""Нет записей для наследования""
		|		КОГДА _ИспользуемыеНастройки.Приоритет = &УровеньНастройки
		|			ТОГДА """"
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 1 И 2
		|			ТОГДА ""Организация""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 3 И 4
		|			ТОГДА ""Группа отчетов организации""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 5 И 6
		|			ТОГДА ""Отчет организации""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 7 И 8
		|			ТОГДА ""Клиент""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 9 И 10
		|			ТОГДА ""Группа отчетов клиента""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 11 И 12
		|			ТОГДА ""Отчет клиента""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 13 И 14
		|			ТОГДА ""Вид договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 15 И 16
		|			ТОГДА ""Группа отчетов вида договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 17 И 18
		|			ТОГДА ""Отчет вида договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 19 И 20
		|			ТОГДА ""Договор""
		|		КОГДА _ИспользуемыеНастройки.Приоритет МЕЖДУ 21 И 22
		|			ТОГДА ""Группа отчетов договора""
		|		КОГДА _ИспользуемыеНастройки.Приоритет = 23
		|			ТОГДА ""Отчет договора""
		|	КОНЕЦ,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Приоритет, 0) = &УровеньНастройки,
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Приоритет, 0),
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Клиент, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(_ИспользуемыеНастройки.ВидДоговора, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Договор, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(_ИспользуемыеНастройки.Отчет, НЕОПРЕДЕЛЕНО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СостояниеНастройкиТекущегоУровня.Настройка.Наименование";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Настройки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "УнаследованоОт");
		
		Если ЗначениеЗаполнено(Выборка.УнаследованоОт) Тогда
			НоваяСтрока.УнаследованоОт = Выборка.УнаследованоОт + ?(ЗначениеЗаполнено(Выборка.Периодичность), " (" + НРег(Строка(Выборка.Периодичность)) + ")", "");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуСоЗначением(Идентификатор)
	
	Строка = Состав.НайтиПоИдентификатору(Идентификатор);
	
	Если Строка.СобственноеЗначение Тогда
		Возврат Строка;
	ИначеЕсли Строка.ПолучитьРодителя() <> Неопределено Тогда
		Возврат ПолучитьСтрокуСоЗначением(Строка.ПолучитьРодителя().ПолучитьИдентификатор());
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ОткрытьФормуСостава(ПараметрыФормы)
	
	Возврат ОткрытьФормуМодально("РегистрСведений.СоставИНастройкиОтчетов.Форма.ФормаНастройкиСостава", ПараметрыФормы, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыФормыНастройкиСостава(Режим)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Режим", Режим);
	
	ТекущиеДанныеПакеты	= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав	= Элементы.Состав.ТекущиеДанные;
	
	НоваяЗаписьДляОтменыФормирования = Режим = "ОтменаФормирования" И НЕ ЗначениеЗаполнено(ТекущиеДанныеСостав.ДатаНастройки);
	
	Если Режим <> "Добавление" И Не НоваяЗаписьДляОтменыФормирования Тогда
				
		Если НЕ ТекущиеДанныеПакеты.ВыводитьФормирование Тогда
			Возврат Неопределено;
		ИначеЕсли Режим = "Редактирование" И НЕ ЗначениеЗаполнено(ТекущиеДанныеСостав.ДатаНастройки) Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранного уровня отсутствует запись регистра!");
			Возврат Неопределено;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ТипСубъекта",		ТекущиеДанныеСостав.Уровень);
		ПараметрыФормы.Вставить("Период",			?(ЗначениеЗаполнено(ТекущиеДанныеСостав.ДатаНастройки), ТекущиеДанныеСостав.ДатаНастройки, ТекущиеДанныеСостав.ДатаНаследуемойНастройки));
		ПараметрыФормы.Вставить("Организация",		ТекущиеДанныеПакеты.Организация);
		ПараметрыФормы.Вставить("Клиент",			Клиент);
		ПараметрыФормы.Вставить("ВидДоговора",		ТекущиеДанныеСостав.ВидДоговора);
		ПараметрыФормы.Вставить("Договор",			ТекущиеДанныеСостав.Договор);
		ПараметрыФормы.Вставить("Отчет",			ТекущиеДанныеПакеты.Отчет);
		ПараметрыФормы.Вставить("Периодичность",	ТекущиеДанныеПакеты.Периодичность);
		ПараметрыФормы.Вставить("Примечание",		ТекущиеДанныеСостав.Примечание);	
	Иначе
		ПараметрыФормы.Вставить("ТипСубъекта",		"Клиент");
		ПараметрыФормы.Вставить("Период",			ПоСостояниюНа);
		ПараметрыФормы.Вставить("Организация",		Организация);
		ПараметрыФормы.Вставить("Клиент",			Клиент);
		
		Если НоваяЗаписьДляОтменыФормирования Тогда
			ПараметрыФормы.Вставить("ТипСубъекта",		ТекущиеДанныеСостав.Уровень);
			ПараметрыФормы.Вставить("ВидДоговора",		ТекущиеДанныеСостав.ВидДоговора);
			ПараметрыФормы.Вставить("Договор",			ТекущиеДанныеСостав.Договор);
			ПараметрыФормы.Вставить("Отчет",			ТекущиеДанныеПакеты.Отчет);
			ПараметрыФормы.Вставить("Периодичность",	ТекущиеДанныеПакеты.Периодичность);			
		КонецЕсли;
			
	КонецЕсли;
	
	ПараметрыФормы.Вставить("НоваяЗаписьДляОтменыФормирования",	НоваяЗаписьДляОтменыФормирования);

	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Процедура УдалитьЗаписьСостава(ЗначенияКлючаЗаписи)
	
	ЗначенияКлючаЗаписи.Вставить("Настройка", ПланыВидовХарактеристик.НастройкиОтчетов.Формировать);
	
	КлючЗаписи = РегистрыСведений.СоставИНастройкиОтчетов.СоздатьКлючЗаписи(ЗначенияКлючаЗаписи);
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи, , ЭтаФорма.УникальныйИдентификатор);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заблокировать запись! Запись уже заблокирована другим сеансом.");
		Возврат;
	КонецПопытки;
	
	Если НЕ РегистрыСведений.СоставИНастройкиОтчетов.ПроверитьНаличиеЗаписей(ЗначенияКлючаЗаписи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить запись! Запись была изменена или удалена.");
		Возврат;
	КонецЕсли;
	
	Если НЕ РегистрыСведений.СоставИНастройкиОтчетов.УдалитьЗапись(ЗначенияКлючаЗаписи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить запись из-за ошибки!");
	КонецЕсли;
	
	РазблокироватьДанныеДляРедактирования(КлючЗаписи, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьНастройкиНаСервере(ЗначенияКлючаЗаписи, ВидЗначения, Замещение = Ложь)
	
	РегистрыСведений.СоставИНастройкиОтчетов.ДобавитьЗапись(ЗначенияКлючаЗаписи, Перечисления.ВидыЗначенияНастроекОтчетов[ВидЗначения], , Замещение);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНастройки(ЗначенияКлючаЗаписи)
	
	КлючЗаписи = РегистрыСведений.СоставИНастройкиОтчетов.СоздатьКлючЗаписи(ЗначенияКлючаЗаписи);
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи, , ЭтаФорма.УникальныйИдентификатор);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заблокировать запись! Запись уже заблокирована другим сеансом.");
		Возврат;
	КонецПопытки;
	
	Если НЕ РегистрыСведений.СоставИНастройкиОтчетов.ПроверитьНаличиеЗаписей(ЗначенияКлючаЗаписи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить запись! Запись была изменена или удалена.");
		Возврат;
	КонецЕсли;
	
	Если НЕ РегистрыСведений.СоставИНастройкиОтчетов.УдалитьЗапись(ЗначенияКлючаЗаписи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить запись из-за ошибки!");
	КонецЕсли;
	
	РазблокироватьДанныеДляРедактирования(КлючЗаписи, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗапись(КлючЗаписи)
	
	НаборЗаписей = РегистрыСведений.СоставИНастройкиОтчетов.СоздатьНаборЗаписей();
	
	Для Каждого Поле Из КлючЗаписи Цикл
		НаборЗаписей.Отбор[Поле.Ключ].Установить(Поле.Значение);
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьНастройку(Событие)
	
	ТекущиеДанныеПакетов	= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав		= Элементы.Состав.ТекущиеДанные;
	ТекущиеДанныеНастройки	= Элементы.Настройки.ТекущиеДанные;
	
	ДатаНастройки			= ?(Событие = "Удаление", ТекущиеДанныеНастройки.ДатаНастройки, ПоСостояниюНа);
	
	Если УровеньНастройки <> 24 Тогда
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Настройка",		ТекущиеДанныеНастройки.Настройка);
		ПараметрыФормы.Вставить("ДатаНастройки",	ДатаНастройки);
		ПараметрыФормы.Вставить("Организация",		ТекущиеДанныеПакетов.Организация);
		ПараметрыФормы.Вставить("Событие",			Событие);
		ПараметрыФормы.Вставить("УровеньНастройки",	УровеньНастройки);
		ПараметрыФормы.Вставить("Клиент", 			ТекущиеДанныеСостав.Клиент);
		ПараметрыФормы.Вставить("ВидДоговора",		ТекущиеДанныеСостав.ВидДоговора);
		ПараметрыФормы.Вставить("Договор",			ТекущиеДанныеСостав.Договор);
		ПараметрыФормы.Вставить("Отчет",			?(ЗначениеЗаполнено(ТекущиеДанныеПакетов.Отчет), ТекущиеДанныеПакетов.Отчет, ТекущиеДанныеПакетов.ГруппаОтчетов));
		ПараметрыФормы.Вставить("Периодичность",	ТекущиеДанныеПакетов.Периодичность);
		
		РезультатПодтверждения = ОткрытьФормуМодально("РегистрСведений.СоставИНастройкиОтчетов.Форма.ФормаПредупрежденияПриИзмененииНастройки", ПараметрыФормы, ЭтаФорма);
		
		Если РезультатПодтверждения = Неопределено Тогда
			Возврат;
		Иначе
			ДатаНастройки = РезультатПодтверждения;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияКлючаЗаписи = Новый Структура;
	
	ЗначенияКлючаЗаписи.Вставить("Организация",		ТекущиеДанныеПакетов.Организация);
	ЗначенияКлючаЗаписи.Вставить("Периодичность",	ТекущиеДанныеПакетов.Периодичность);
	ЗначенияКлючаЗаписи.Вставить("Настройка",		ТекущиеДанныеНастройки.Настройка);
	ЗначенияКлючаЗаписи.Вставить("Отчет",			?(ЗначениеЗаполнено(ТекущиеДанныеПакетов.Отчет), ТекущиеДанныеПакетов.Отчет, ТекущиеДанныеПакетов.ГруппаОтчетов));
	
	Если УровеньНастройки < 7 Тогда
		ЗначенияКлючаЗаписи.Вставить("Субъект",		Неопределено);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора",	ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка"));
	ИначеЕсли УровеньНастройки < 13 Тогда
		ЗначенияКлючаЗаписи.Вставить("Субъект",		ТекущиеДанныеСостав.Клиент);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора",	ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка"));
	ИначеЕсли УровеньНастройки < 19 Тогда
		ЗначенияКлючаЗаписи.Вставить("Субъект",		ТекущиеДанныеСостав.Клиент);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора",	ТекущиеДанныеНастройки.ВидДоговора);
	Иначе
		ЗначенияКлючаЗаписи.Вставить("Субъект",		ТекущиеДанныеСостав.Договор);
		ЗначенияКлючаЗаписи.Вставить("ВидДоговора",	ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка"));
	КонецЕсли;
	
	ЗначенияКлючаЗаписи.Вставить("Период", ДатаНастройки);
	
	Если Событие = "Наследование" Тогда
		
		Если ЕстьЗапись(ЗначенияКлючаЗаписи) Тогда
			Если Вопрос(СтрШаблон("На %1 уже есть запись. Заменить новой записью?", Формат(ЗначенияКлючаЗаписи.Период, "ДФ=dd.MM.yyyy")), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
				Замещение = Истина;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			Замещение = Ложь;
		КонецЕсли;
		
		ДобавитьЗаписьНастройкиНаСервере(ЗначенияКлючаЗаписи, "ПоУмолчанию", Замещение);
		
	Иначе
		УдалитьЗаписьНастройки(ЗначенияКлючаЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройки()
	
	ТекущиеДанныеНастройки = Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанныеНастройки = Неопределено Тогда
		ТекущаяНастройка = Неопределено;
	Иначе
		ТекущаяНастройка = ТекущиеДанныеНастройки.Настройка;
	КонецЕсли;
	
	Настройки.Очистить();
	
	ТекущиеДанныеПакеты	= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав	= Элементы.Состав.ТекущиеДанные;
	
	Если ТекущиеДанныеПакеты <> Неопределено
		И ТекущиеДанныеСостав <> Неопределено Тогда
		ЗаполнитьНастройки(ТекущиеДанныеПакеты.ПолучитьИдентификатор(), ТекущиеДанныеСостав.ПолучитьИдентификатор());
	КонецЕсли;
	
	Если Настройки.Количество() > 0
		И ТекущаяНастройка <> Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Настройка", ТекущаяНастройка);
		
		НайденныеСтроки = Настройки.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.Настройки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуНастройки(ПараметрыФормы)
	
	Возврат ОткрытьФормуМодально("РегистрСведений.СоставИНастройкиОтчетов.Форма.ФормаРедактированияНастройки", ПараметрыФормы, ЭтаФорма);	
	
КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыФормыЗначенияНастройки(Режим)
	
	ТекущиеДанныеПакеты		= Элементы.Пакеты.ТекущиеДанные;
	ТекущиеДанныеСостав		= Элементы.Состав.ТекущиеДанные;
	ТекущиеДанныеНастройки	= Элементы.Настройки.ТекущиеДанные;
		
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Режим", Режим);
	
	Если Режим <> "Добавление" Тогда
		
		Если Режим = "Редактирование" И НЕ ЗначениеЗаполнено(ТекущиеДанныеНастройки.ДатаНастройки) Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранного уровня настройки отсутствует запись регистра!");
			Возврат Неопределено;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Период", ?(ЗначениеЗаполнено(ТекущиеДанныеНастройки.ДатаНастройки), ТекущиеДанныеНастройки.ДатаНастройки, ТекущиеДанныеНастройки.ДатаНаследуемойНастройки));
		
	Иначе
		ПараметрыФормы.Вставить("Период", ПоСостояниюНа);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Настройка",		ТекущиеДанныеНастройки.Настройка);
	ПараметрыФормы.Вставить("Организация",		ТекущиеДанныеПакеты.Организация);
	ПараметрыФормы.Вставить("Клиент",			Клиент);
	ПараметрыФормы.Вставить("ГруппаОтчетов",	ТекущиеДанныеПакеты.ГруппаОтчетов);
	ПараметрыФормы.Вставить("Отчет",			ТекущиеДанныеПакеты.Отчет);
	ПараметрыФормы.Вставить("ТипСубъекта",		ТекущиеДанныеСостав.Уровень);
	ПараметрыФормы.Вставить("ВидДоговора",		ТекущиеДанныеСостав.ВидДоговора);
	ПараметрыФормы.Вставить("Договор",			ТекущиеДанныеСостав.Договор);
	// Периодичность передаем только когда открывается настройка с указанием периодичности (четные приоритеты).
	ПараметрыФормы.Вставить("Периодичность",	?(Цел(УровеньНастройки/2) = УровеньНастройки/2, ТекущиеДанныеПакеты.Периодичность, Неопределено));
	ПараметрыФормы.Вставить("УровеньНастройки",	УровеньНастройки);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура СвернутьВетку(Ветка)
	
	Для Каждого ДочерняяВетка Из Ветка.ПолучитьЭлементы() Цикл
		СвернутьВетку(ДочерняяВетка);
	КонецЦикла;
	
	Элементы.Пакеты.Свернуть(Ветка.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьДействующиеДоговорыКлиентаВЗапрос(Запрос, ОтборПоОрганизацииТолькоПриЗаполненномПараметре = Ложь)
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация КАК Организация,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК Договор
		|ПОМЕСТИТЬ _ДействующиеДоговорыКлиента
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация В (&Организация)
		|				И ВЫБОР
		|					КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|						ТОГДА СчетДоверительногоУправления = &Договор
		|					КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|						ТОГДА СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговора
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация В (&Организация)
		|					И ВЫБОР
		|						КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|							ТОГДА СчетДоверительногоУправления = &Договор
		|						КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|							ТОГДА СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговора
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = УсловияДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|	И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = &ПустаяДата
		|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &Период
		|			ИЛИ УсловияДоговоровДоверительногоУправленияСрезПоследних.АвтоматическаяПролонгация)";
	
	Если ОтборПоОрганизацииТолькоПриЗаполненномПараметре И Не ЗначениеЗаполнено(Запрос.Параметры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация В (&Организация)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключитьФормирование(СтруктураОтбора, Клиент, ВидДоговораДоговор, ПоСостояниюНа, ДатаОтключения)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			ПоСостояниюНа);
	Запрос.УстановитьПараметр("Организация",	СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("Клиент",			Клиент);
	Запрос.УстановитьПараметр("Периодичность",	СтруктураОтбора.Периодичность);
	Запрос.УстановитьПараметр("Отчет",			СтруктураОтбора.Отчет);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ДатаОтключения", ДатаОтключения);
	
	Договор		= Неопределено;
	ВидДоговора	= Неопределено;
	
	Если ЗначениеЗаполнено(ВидДоговораДоговор) Тогда
		Если ТипЗнч(ВидДоговораДоговор) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			ВидДоговора	= ВидДоговораДоговор;
		Иначе
			Договор		= ВидДоговораДоговор;
			ВидДоговора	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДоговораДоговор, "ВидДоговораДоверительногоУправления");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор",		Договор);
	Запрос.УстановитьПараметр("ВидДоговора",	ВидДоговора);
	
	ПоместитьДействующиеДоговорыКлиентаВЗапрос(Запрос);
	
	#Область Текст_запроса
	
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|			ТОГДА &Договор
		|		ИНАЧЕ СоставИНастройкиОтчетовСрезПоследних.Субъект
		|	КОНЕЦ КАК Субъект,
		|	ВЫБОР
		|		КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|			ТОГДА &ВидДоговора
		|		ИНАЧЕ СоставИНастройкиОтчетовСрезПоследних.ВидДоговора
		|	КОНЕЦ КАК ВидДоговора,
		|	&ДатаОтключения КАК Период,
		|	СоставИНастройкиОтчетовСрезПоследних.Организация КАК Организация,
		|	СоставИНастройкиОтчетовСрезПоследних.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетовСрезПоследних.Периодичность КАК Периодичность,
		|	СоставИНастройкиОтчетовСрезПоследних.Приоритет КАК Приоритет,
		|	СоставИНастройкиОтчетовСрезПоследних.Настройка КАК Настройка
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|				И Организация В (&Организация)
		|				И Отчет В (&Отчет)
		|				И Периодичность В (&Периодичность)
		|				И ВЫБОР
		|					КОГДА &Договор <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Договор
		|					КОГДА &ВидДоговора <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ТИПЗНАЧЕНИЯ(Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|									И Субъект = &Клиент
		|									И (ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|										ИЛИ ВидДоговора = &ВидДоговора)
		|								ИЛИ ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|									И ВЫРАЗИТЬ(Субъект КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = &ВидДоговора
		|					ИНАЧЕ Субъект = &Клиент
		|							ИЛИ Субъект В
		|								(ВЫБРАТЬ
		|									_ДействующиеДоговорыКлиента.Договор
		|								ИЗ
		|									_ДействующиеДоговорыКлиента)
		|				КОНЕЦ) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Значение = ИСТИНА";

	#КонецОбласти
	 
	Выборка = Запрос.Выполнить().Выбрать();
	 
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.СоставИНастройкиОтчетов.ДобавитьЗапись(Выборка, Перечисления.ВидыЗначенияНастроекОтчетов.Собственное, Ложь, Ложь);
	КонецЦикла;
	 
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОтбораОтчетов(ДанныеФормыДерево)
	
	МассивОрганизаций 	= Новый Массив;	
	МассивПериодичности = Новый Массив;
	МассивОтчетов		= Новый Массив;
	
	МассивОрганизаций.Добавить(ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	
	СтруктураРезультата = Новый Структура("Организация, Периодичность, Отчет", МассивОрганизаций, МассивПериодичности, МассивОтчетов);	
	
	ЗаполнитьМассивыОтбораОтчетов(ДанныеФормыДерево, СтруктураРезультата);
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМассивыОтбораОтчетов(ДанныеФормыДерево, СтруктураРезультата)
	
	Если ЗначениеЗаполнено(ДанныеФормыДерево.Организация) Тогда
		РаботаСКоллекциями.ДополнитьМассив(СтруктураРезультата.Организация, ДанныеФормыДерево.Организация, Истина);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеФормыДерево.Периодичность) Тогда
		РаботаСКоллекциями.ДополнитьМассив(СтруктураРезультата.Периодичность, ДанныеФормыДерево.Периодичность, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеФормыДерево.Отчет) Тогда
		РаботаСКоллекциями.ДополнитьМассив(СтруктураРезультата.Отчет, ДанныеФормыДерево.Отчет, Истина);
	КонецЕсли;

	Для Каждого СтрокаДерева Из ДанныеФормыДерево.ПолучитьЭлементы() Цикл
		ЗаполнитьМассивыОтбораОтчетов(СтрокаДерева, СтруктураРезультата)	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти