
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Декларация по доходу на прибыль. Лист 06",
		"0.15",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КлючТекущегоВарианта) Тогда 
		ЭтотОбъект.КлючТекущегоВарианта = "Лист06_2019";
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

//Функция ПреобразоватьИмя(вхСтрока)
//	
//	//П02010100
//	//2.1.1
//	
//	Ч1 = СтрЗаменить(Сред(вхСтрока,2,2), "0", "");
//	Ч2 = СтрЗаменить(Сред(вхСтрока,4,2), "0", "");
//	Ч3 = СтрЗаменить(Сред(вхСтрока,6,2), "0", "");
//	Ч4 = СтрЗаменить(Сред(вхСтрока,8,2), "0", "");
//	
//	Ч4 = ?(ПустаяСтрока(Ч4), "", "."+Ч4);
//	Ч3 = ?(ПустаяСтрока(Ч3), "", "."+Ч3);
//	Ч2 = ?(ПустаяСтрока(Ч2), "", "."+Ч2);
//	
//	Возврат Ч1+Ч2+Ч3+Ч4;
//	
//	
//КонецФункции

Функция ПолучитьПараметрыШапки(Период, Организация, СчетДоверительногоУправления)	Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления,
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК ДоверительныйУправляющийПолноеНаименование,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.ПолноеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + РеквизитыФизическихЛицКлиента.Имя + "" "" + РеквизитыФизическихЛицКлиента.Отчество) КАК УчредительУправленияПолноеНаименование,
		|	РеквизитыЮридическихЛицОрганизации.ИНН КАК ИННорганизации,
		|	РеквизитыЮридическихЛицОрганизации.КПП КАК КППорганизации,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.ИНН, РеквизитыФизическихЛицКлиента.ИНН) КАК ИННклиента,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КПП, """") КАК КППклиента
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Период)));
	Запрос.УстановитьПараметр("ЮрФизЛицо", Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант,КлючТекущегоВарианта");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	
	МакетНастройка = ПолучитьМакет("Настройка"+ЭтотОбъект.КлючТекущегоВарианта);
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	Если ТаблицаНастройки.Количество() = 0 Тогда 
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
		Возврат;
		
	КонецЕсли;	
	                                                                                                                           
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "П110", "П21002", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы, Ложь);
	
	//Расшифровка
	МакетРасшифровка = ПолучитьМакет("Расшифровка");
	ОбщиеФункции.ПечатьРасшифровки(МакетРасшифровка, ДокументРасшифровка, ТабРасшифровки);
	
	//вывод формы
	Отчет = ПолучитьМакет("Отчет"+ЭтотОбъект.КлючТекущегоВарианта);
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
		
	//распределение прочих расходов. Сразу внесем в расшифровку
	ОбластьКоммент = МакетРасшифровка.ПолучитьОбласть("Коммент");
	РаспределяемыеРасходы = ОбщиеФункции.ВернутьСохраненноеЗначение("П21002", ОбластиИЗначения);
	//это значение потом затрется
	ПрочиеРасходы = ОбщиеФункции.ВернутьСохраненноеЗначение("П22002", ОбластиИЗначения);
	ОбластьКоммент.Параметры.Комментарий = "Расшифровка распределения прочих расходов. Сумма = " + РаспределяемыеРасходы;
	ДокументРасшифровка.Вывести(ОбластьКоммент);
	
	ПрибыльОбр = Макс(ОбщиеФункции.ВернутьСохраненноеЗначение("П020", ОбластиИЗначения) + 
	             ОбщиеФункции.ВернутьСохраненноеЗначение("П030", ОбластиИЗначения) -
				 ОбщиеФункции.ВернутьСохраненноеЗначение("П20001", ОбластиИЗначения), 0);
				 
	ОбластьКоммент.Параметры.Комментарий = "Прибыль по обращаемым ценным бумагам (020+030-200.1) = " + ПрибыльОбр;
	ДокументРасшифровка.Вывести(ОбластьКоммент);
				 
				 
	ПрибыльНеобр = Макс(ОбщиеФункции.ВернутьСохраненноеЗначение("П040", ОбластиИЗначения) + 
	             ОбщиеФункции.ВернутьСохраненноеЗначение("П050", ОбластиИЗначения) -
				 ОбщиеФункции.ВернутьСохраненноеЗначение("П21001", ОбластиИЗначения), 0);
				 
	ОбластьКоммент.Параметры.Комментарий = "Прибыль по необращаемым ценным бумагам (040+050-210.1) = " + ПрибыльНеобр;
	ДокументРасшифровка.Вывести(ОбластьКоммент);
				 			 
	ПрибыльПрочее = Макс(ОбщиеФункции.ВернутьСохраненноеЗначение("П110", ОбластиИЗначения) - 
				 ОбщиеФункции.ВернутьСохраненноеЗначение("П22001", ОбластиИЗначения), 0);
				 
	ОбластьКоммент.Параметры.Комментарий = "Прибыль по прочим вложениям (110-220.1) = " + ПрибыльПрочее;
	ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 
				 
	ПрибыльВсего = ПрибыльОбр + ПрибыльНеобр + ПрибыльПрочее;
	Если ПрибыльВсего > 0 Тогда 
		ОбластьКоммент.Параметры.Комментарий = "Прибыль Всего = " + ПрибыльВсего;
		ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 
		
		ЗначениеП20002 = Окр(РаспределяемыеРасходы * ПрибыльОбр/ПрибыльВсего, 2);
		ОбластьКоммент.Параметры.Комментарий = "Строка 200.2: " + РаспределяемыеРасходы + " * " + ПрибыльОбр + " / " + ПрибыльВсего + " = " + ЗначениеП20002;
		ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 
		
		ЗначениеП21002 = Окр(РаспределяемыеРасходы * ПрибыльНеобр/ПрибыльВсего, 2);
		ОбластьКоммент.Параметры.Комментарий = "Строка 210.2: " + РаспределяемыеРасходы + " * " +ПрибыльНеобр + " / " + ПрибыльВсего + " = " + ЗначениеП21002;
		ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 
		
		//ЗначениеП22002 = РаспределяемыеРасходы * ПрибыльПрочее/ПрибыльВсего;	
		// не хочу считать погрешность. чаще всего прибыль по необращаемым равна нулю. В расчете участуют только два значения.
		ЗначениеП22002 = ПрочиеРасходы + РаспределяемыеРасходы - ЗначениеП20002 - ЗначениеП21002;
		ОбластьКоммент.Параметры.Комментарий = "Строка 220.2: " + ПрочиеРасходы + " + " + РаспределяемыеРасходы + " * " + ПрибыльПрочее + " / " + ПрибыльВсего + " = " + Окр(ЗначениеП22002,2);
		ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 
		
		ОбластиИЗначения.Вставить("П20002", ЗначениеП20002);
		ОбластиИЗначения.Вставить("П21002", ЗначениеП21002);
		ОбластиИЗначения.Вставить("П22002", ЗначениеП22002);
	Иначе
		ОбластьКоммент.Параметры.Комментарий = "Невозможно распределить прочие расходы!";
		ДокументРасшифровка.Вывести(ОбластьКоммент);				 			 	
	КонецЕсли;
		
	ОбщиеФункции.РасчетИтогов(ТаблицаНастройки, ОбластиИЗначения);
	
	//шапка 
	ПараметрыШапки = ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	//ОбластьОтчет.Параметры.ДатаОтчета				= Формат(ПараметрыШапки.ДатаОтчета, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//ИНН и КПП
	ИННКлиента = "00" + СокрЛП(ПараметрыШапки.ИННклиента);
	КППклиента = СокрЛП(ПараметрыШапки.КППклиента);
	
	Если СтрДлина(ИННКлиента)=12 Тогда 
		Для иии = 1 по 12 Цикл 
			Ячейка = ОбластьОтчет.Области.Найти("ИНН" + Формат(иии,"ЧЦ=2; ЧВН="));
			Ячейка.Значение = Сред(ИННКлиента,иии,1);		
		КонецЦикла;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте ИНН клиента");
	КонецЕсли;
	
	Если СтрДлина(КППклиента) = 9 Тогда 
		Для иии = 1 по 9 Цикл 
			Ячейка = ОбластьОтчет.Области.Найти("КПП" + Формат(иии,"ЧЦ=2; ЧВН="));
			Ячейка.Значение = Сред(КППклиента,иии,1);	
		КонецЦикла;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте КПП клиента");	
	КонецЕсли;	
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	//Подписи	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "Лист06", , ОриентацияСтраницы.Портрет);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	
	
Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка"+ЭтотОбъект.КлючТекущегоВарианта);
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры 	
