
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ");
	Если Не ЗначениеЗаполнено(ЭтаФорма.Брокер) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.РежимСверки = 0; // на дату
	ЭтаФорма.ТипФайлаСверки = 0; // тип файла XLSX
	ЭтаФорма.ДатаСверки  = ТекущаяДата() - 86400;
	
	ЭтаФорма.ФиксироватьРезультатСверки				= Ложь;
	ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях	= Истина;
	
	Элементы.ГруппаПодтвержденныеОперации.Видимость = Ложь;	
	
	// Обработка параметров	
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаСверки") Тогда
		ЭтаФорма.ДатаСверки	 = Параметры.ДатаСверки;
		ЭтаФорма.РежимСверки = 0; // на дату
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКаталогДанных();
		
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяСверки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСверкиПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСверкиПриИзменении(Элемент)
	
	ЭтаФорма.ПериодСверки.ДатаНачала    = ЭтаФорма.ДатаСверки;
	ЭтаФорма.ПериодСверки.ДатаОкончания = ЭтаФорма.ДатаСверки;
	
	ЗаполнитьКаталогДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСверкиПриИзменении(Элемент)
	
	ЭтаФорма.ДатаСверки = ЭтаФорма.ПериодСверки.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.КаталогДанных;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.КаталогДанных = ДиалогВыбораКаталога.Каталог + ?(СтрЗаканчиваетсяНа(ДиалогВыбораКаталога.Каталог, "\"), "", "\");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(Объект.КаталогДанных) Тогда
		ЗапуститьПриложение(Объект.КаталогДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхПриИзменении(Элемент)
	
	КомандаОбновитьСписокФайлов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ФиксироватьРезультатСверкиПриИзменении(Элемент)
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		ЭтаФорма.ВремяСверки = ТекущаяДата();
	КонецЕсли;
	
	ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях = ЭтаФорма.ФиксироватьРезультатСверки;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСверкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ВыбранноеЗначение = ВыбранноеЗначение + (ЭтаФорма.ВремяСверки - НачалоДня(ЭтаФорма.ВремяСверки));		
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ФайлыОтчетов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ФайлыОтчетовСчетДоверительногоУправления" Тогда
		
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
	
	ИначеЕсли Поле.Имя = "ФайлыОтчетовРезультатСверки" Тогда
				
		Если ТекущиеДанные.Отчет = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДокументРезультат = ПолучитьОтчет(ТекущиеДанные.Отчет);
		ДокументРезультат.Показать(ТекущиеДанные.СчетДоверительногоУправления);
		
	ИначеЕсли Поле.Имя = "ФайлыОтчетовИмяФайла" И ЗначениеЗаполнено(ТекущиеДанные.ИмяФайла) Тогда
		
		ПолноеИмяФайла = Объект.КаталогДанных + "\" + ТекущиеДанные.ИмяФайла;
		
		ОбъектФайл = Новый Файл(ПолноеИмяФайла);
	
		Если ОбъектФайл.Существует() Тогда
			
			Попытка
				ЗапуститьПриложение(ПолноеИмяФайла);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл [" + ПолноеИмяФайла + "]." + Символы.ПС + ОписаниеОшибки());	
			КонецПопытки;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден файл [" + ПолноеИмяФайла + "].");
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСверить(Команда)  Экспорт

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		
		#Область Проверка_корректности_параметров_фиксации_сверки
		
		// С момента установки флажка сверки прошло более 30 минут
		
		Если НачалоДня(ТекущаяДата()) = НачалоДня(ЭтаФорма.ВремяСверки)
			И ТекущаяДата() > (ЭтаФорма.ВремяСверки + 30 * 60)
		Тогда
		
			РезультатВопроса = Вопрос("С момента установки времени сверки прошло более 30 минут. Обновить время сверки?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
			
			Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
				ЭтаФорма.ВремяСверки = ТекущаяДата();		
			КонецЕсли;
			
		КонецЕсли;
		
		// Сверяем обычно на следующий рабочий день
		
		НачальнаяДатаСверки = ?(ЭтаФорма.РежимСверки = 0, ЭтаФорма.ДатаСверки, ЭтаФорма.ПериодСверки.ДатаНачала);
		
		Если НачальнаяДатаСверки <> ДобавитьКДатеРабочиеДни(НачалоДня(ЭтаФорма.ВремяСверки) - 1, -1) Тогда
		
			РезультатВопроса = Вопрос("Сверка фиксируется не на следующий рабочий день от сверяемой даты. Все равно продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	ОбработатьОтчетыБрокера(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКомиссиюБрокера(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	//Снимаем флажок фиксации сверки, т.к. сначала нужно убедиться в отсутствии расхождений
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		
		ЭтаФорма.ФиксироватьРезультатСверки = Ложь;
		
		ФиксироватьРезультатСверкиПриИзменении(Неопределено);
		
	КонецЕсли;
	
	ОбработатьОтчетыБрокера(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокФайлов(Команда)	Экспорт
	
	Этаформа.ФайлыОтчетов.Очистить();
	
	// в зависимости от ТипФайлаСверки изменяем маску поиска
	Если ЭтаФорма.ТипФайлаСверки = 0 Тогда
		НайденыеФайлы = НайтиФайлы(Объект.КаталогДанных, "*xlsx");
	Иначе
		НайденыеФайлы = НайтиФайлы(Объект.КаталогДанных, "*txt");
	КонецЕсли;
	
	МассивФайлов = Новый Массив();
	
	Для каждого НайденыйФайл Из НайденыеФайлы Цикл
		
		МассивФайлов.Добавить(Новый Структура("ИмяФайла, КодСчетаДоверительногоУправления", НайденыйФайл.Имя, ПолучитьКодСчетаДоверительногоУправленияИзИмениФайла(НайденыйФайл.ПолноеИмя)));
		
	КонецЦикла;
	
	Если МассивФайлов.Количество() > 0 Тогда
		МассивДанных = ПолучитьСчетаДоверительногоУправленияНаСервере(МассивФайлов, ЭтаФорма.ДатаСверки, Объект.Организация, ЭтаФорма.Брокер);
		
		Для Каждого ЭлементДанных Из МассивДанных Цикл
			НоваяСтрока = ЭтаФорма.ФайлыОтчетов.Добавить();
			НоваяСтрока.Выбран                       = Истина;
			НоваяСтрока.ИмяФайла                     = ЭлементДанных.ИмяФайла;
			НоваяСтрока.СчетДоверительногоУправления = ЭлементДанных.СчетДоверительногоУправления;
		КонецЦикла;
			
	КонецЕсли;
	
	Если Этаформа.ФайлыОтчетов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В указанном каталоге файлы отчетов в указанном формате не найдены.",, "КаталогДанных", "Объект.КаталогДанных", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьВсе(Команда)
	
	Для каждого СтрокаФайлыОтчетов Из ЭтаФорма.ФайлыОтчетов Цикл
		СтрокаФайлыОтчетов.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВыделение(Команда)
	
	Для каждого СтрокаФайлыОтчетов Из ЭтаФорма.ФайлыОтчетов Цикл
		СтрокаФайлыОтчетов.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьОтчетыБрокера(Команда, ДанныеСверкиДляБухгалтерии = Неопределено)
	
	Элементы.ГруппаПодтвержденныеОперации.Видимость = Ложь;
	ЭтаФорма.ОтчетОПодтвержденныхОперациях = Неопределено;
	
	ЕстьРасхожденияПоСверке = Ложь;
	
	КоличествоВыбранныхФайлов = ЭтаФорма.ФайлыОтчетов.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество();
	
	Если КоличествоВыбранныхФайлов = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файлы отчетов для " + ?(Команда = ЭтаФорма.Команды.КомандаСверить, "сверки.", "загрузки комиссии."));
		Возврат;
	КонецЕсли;
	
	СверяемыеСчетаДоверительногоУправления = Новый Массив;
	
	Для Каждого СтрокаФайлыОтчетов Из ЭтаФорма.ФайлыОтчетов Цикл
		СтрокаФайлыОтчетов.РезультатСверки	= Неопределено;
		СтрокаФайлыОтчетов.Отчет			= Неопределено;
		СверяемыеСчетаДоверительногоУправления.Добавить(СтрокаФайлыОтчетов.СчетДоверительногоУправления);
	КонецЦикла;
		
	ОбщиеПараметры = Новый Структура();
	
	ОбщиеПараметры.Вставить("Организация", Объект.Организация);
	ОбщиеПараметры.Вставить("Брокер", ЭтаФорма.Брокер);
	ОбщиеПараметры.Вставить("ДатаСверки", ЭтаФорма.ДатаСверки);
	ОбщиеПараметры.Вставить("ВремяСверки", ЭтаФорма.ВремяСверки);
	ОбщиеПараметры.Вставить("ФиксироватьРезультатСверки", ЭтаФорма.ФиксироватьРезультатСверки);
	ОбщиеПараметры.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ОбщиеПараметры.Вставить("СверяемыеСчетаДоверительногоУправления", СверяемыеСчетаДоверительногоУправления);
	
	Если ЭтаФорма.ТипФайлаСверки = 0 Тогда
		ДанныеОтчетовБрокера = ДесериализоватьДанныеОтчетовБрокераXLSX(КоличествоВыбранныхФайлов);
	Иначе
		ДанныеОтчетовБрокера = ДесериализоватьДанныеОтчетовБрокераTXT(КоличествоВыбранныхФайлов);
	КонецЕсли;

	Если ДанныеОтчетовБрокера.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Команда = ЭтаФорма.Команды.КомандаЗагрузитьКомиссиюБрокера Тогда
		
		ИзмененияНачисленийЗадолженности = Ложь;
		ИзмененияОплат = Ложь;
		
		Состояние("2. Загрузка комиссии.");
		РезультатВыполнения = ИмпортироватьКомиссиюБрокера(ДанныеОтчетовБрокера, ОбщиеПараметры, ИзмененияНачисленийЗадолженности, ИзмененияОплат);
		
		Если ИзмененияНачисленийЗадолженности Тогда 
			ОповеститьОбИзменении(Тип("ДокументСсылка.НачислениеЗадолженности"));
		КонецЕсли;
		
		Если ИзмененияОплат Тогда 
			ОповеститьОбИзменении(Тип("ДокументСсылка.Оплата"));
		КонецЕсли;
		
	ИначеЕсли Команда = ЭтаФорма.Команды.КомандаСверить Тогда
		
		Состояние("2. Сверка данных.");
		РезультатВыполнения = СверитьДанныеОтчетовБрокера(ДанныеОтчетовБрокера, ОбщиеПараметры);
		
	КонецЕсли;
	
	// Счета ДУ с остатками/операциями и без отчета брокера.
	Если ЗначениеЗаполнено(РезультатВыполнения) Тогда
		
		Если РезультатВыполнения.Свойство("ОтчетОтсутствующихФайловБрокера") И РезультатВыполнения.ОтчетОтсутствующихФайловБрокера <> Неопределено Тогда
		
			ЕстьРасхожденияПоСверке = Истина;
			
			ОтчетОтсутствующихФайловБрокера = РезультатВыполнения.ОтчетОтсутствующихФайловБрокера;
				
			ОтчетОтсутствующихФайловБрокера.ОтображатьСетку     = Ложь;
			ОтчетОтсутствующихФайловБрокера.Защита              = Ложь;
			ОтчетОтсутствующихФайловБрокера.ТолькоПросмотр      = Истина;
			ОтчетОтсутствующихФайловБрокера.ОтображатьЗаголовки = Ложь;
			
			ОтчетОтсутствующихФайловБрокера.Показать("Счета ДУ без отчета брокера");
			
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("МассивОтчетовСверки") И ТипЗнч(РезультатВыполнения.МассивОтчетовСверки) = Тип("Массив") Тогда
			
			Для Каждого ЭлементОтчетСверки Из РезультатВыполнения.МассивОтчетовСверки Цикл
				
				СтрокиТаблицыФайлыОтчетов = ЭтаФорма.ФайлыОтчетов.НайтиСтроки(Новый Структура("ИмяФайла, СчетДоверительногоУправления", ЭлементОтчетСверки.ИмяФайла, ЭлементОтчетСверки.СчетДоверительногоУправления));
				
				Для Каждого СтрокаТаблицыФайлыОтчетов Из СтрокиТаблицыФайлыОтчетов Цикл	
					
					СтрокаТаблицыФайлыОтчетов.РезультатСверки = ?(ЭлементОтчетСверки.ЕстьРасхожденияПоНаборамДанных, 2, 1);
					СтрокаТаблицыФайлыОтчетов.Отчет = ЭлементОтчетСверки.Отчет;
					
					Если ЭлементОтчетСверки.ЕстьРасхожденияПоНаборамДанных Тогда
						ЕстьРасхожденияПоСверке = Истина;	
						Если ДанныеСверкиДляБухгалтерии <> Неопределено Тогда 
							ДанныеСверкиДляБухгалтерии.Добавить(СтрокиТаблицыФайлыОтчетов.СчетДоверительногоУправления)
						КонецЕсли;	
					КонецЕсли;
				
				КонецЦикла;
					
			КонецЦикла;
			
			Если ЭтаФорма.ФиксироватьРезультатСверки И РезультатВыполнения.Свойство("РезультатыСверки") Тогда
			
				Отказ = Ложь;
				
				РезультатыСверки = РезультатВыполнения.РезультатыСверки;
			
				Если РезультатыСверки.НепрошедшиеСверку.Количество() > 0
					ИЛИ РезультатыСверки.ИмеющиеРасхождения.Количество() > 0
					ИЛИ РезультатыСверки.ИмеющиеОперацииПозжеВремениСверки.Количество() > 0
				Тогда
				
					#Область Уточняем_у_пользователя_что_следует_зафиксировать_сверку_несмотря_на_расхождения
	
				    ОписаниеРасхождений	= "";
					
					Если РезультатыСверки.НепрошедшиеСверку.Количество() > 0 Тогда
						ОписаниеРасхождений = ?(ПустаяСтрока(ОписаниеРасхождений), "", ОписаниеРасхождений + ", ") + "сверка не пройдена";	
					КонецЕсли;
					
					Если РезультатыСверки.ИмеющиеРасхождения.Количество() > 0 Тогда
						ОписаниеРасхождений = ?(ПустаяСтрока(ОписаниеРасхождений), "", ОписаниеРасхождений + ", ") + "выявлены расхождения";	
					КонецЕсли;
					
					Если РезультатыСверки.ИмеющиеОперацииПозжеВремениСверки.Количество() > 0 Тогда
						
						ОписаниеРасхождений = ?(ПустаяСтрока(ОписаниеРасхождений), "", ОписаниеРасхождений + ", ") + "имеются операции со временем внесения более поздним, чем время сверки";	
						
						// Выведем такие операции и запретим фиксацию сверки
						
						Состояние("Вывод неподтвержденных операций со временем внесения более поздним, чем время сверки");
						
						ЭтаФорма.ОтчетОПодтвержденныхОперациях = ВывестиНеподтвержденныеОперацииПозжеВремениСверки(РезультатыСверки.ТаблицаСверки);
						
						Элементы.ГруппаПодтвержденныеОперации.Видимость	= Истина;
						Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПодтвержденныеОперации;
											
						Отказ = Истина;
						
					КонецЕсли;
					
					ТекстСообщения = "По некоторым счетам д/у " + ОписаниеРасхождений + ".";
					
					Если Отказ Тогда
						Предупреждение(ТекстСообщения + Символы.ПС + "Фиксация сверки отменена!");
					Иначе
						ОтветНаВопрос = Вопрос(ТекстСообщения + Символы.ПС + "Все равно зафиксировать результаты сверки?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
						Отказ		  = (ОтветНаВопрос <> КодВозвратаДиалога.Да);
					КонецЕсли;				
					
					#КонецОбласти
				
				КонецЕсли;
			
				Если Не Отказ Тогда
					
					Состояние("Фиксация результатов сверки и подтверждение операций");
				
					ЗафиксироватьРезультатСверки(РезультатыСверки.ТаблицаСверки);
					
				КонецЕсли;
				
			КонецЕсли
			
		КонецЕсли;
		
		Если Не ЕстьРасхожденияПоСверке Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расхождений не найдено", ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
				
	Состояние("Обработка завершена");
	
КонецПроцедуры

#Область Служебные_и_вспомогательные_функции

&НаСервере
Процедура ЗафиксироватьРезультатСверки(АдресТаблицыСверки)
	
	Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСверки) Тогда
		Возврат;
	КонецЕсли;
		
	ТаблицаСверки = ПолучитьИзВременногоХранилища(АдресТаблицыСверки);
	
	Если ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях Тогда
		ПараметрыОтчета = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Отчет о подтвержденных операциях", , , ЭтаФорма.ОтчетОПодтвержденныхОперациях);
	КонецЕсли;
	
	Для Каждого СтрокаСверки Из ТаблицаСверки Цикл
		
		РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ЗафиксироватьРезультатСверки(
			Объект.Организация,
			СтрокаСверки.СчетДоверительногоУправления,
			ЭтаФорма.ДатаСверки,
			Справочники.ВнешниеСистемы.ОтчетБрокераГПБ,
			СтрокаСверки.СверкаПройденаУспешно,
			Ложь,
			ЭтаФорма.ВремяСверки,
			СтрокаСверки.Примечание);
		
		// Подтверждаем, если не было расхождений
		Если СтрокаСверки.ОтсутствуютРасхождения Тогда 
			
			ПодтвердитьОперацииСБрокером(
				СтрокаСверки.СчетДоверительногоУправления,
				СтрокаСверки.НеподтвержденныеОперации,
				ЭтаФорма.ВремяСверки,
				ПараметрыОтчета);
			
		КонецЕсли;
		
	КонецЦикла;

	// Установим ширину колонок и отобразим отчет
	Если ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях Тогда
		
		РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыОтчета);
		
		Элементы.ГруппаПодтвержденныеОперации.Видимость = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПодтвержденныеОперации;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработатьТабличныйДокументОтчета(АдресФайла)
	Попытка
		ФайлXLSX = ПолучитьИмяВременногоФайла(".xlsx");
    	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
    	ДвоичныеДанныеФайла.Записать(ФайлXLSX);
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(ФайлXLSX);
		Возврат ТабДок;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодЦеннойБумагиПоISIN(ISIN, ДатаСверки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|			&Период,
		|			ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|				И Код = &Код) КАК КодыВТорговыхСистемахСрезПоследних";
	
	Запрос.УстановитьПараметр("Код", ISIN);
	Запрос.УстановитьПараметр("Период", ДатаСверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПустаяСтрока(ВыборкаДетальныеЗаписи.ГосударственныйРегистрационныйНомер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выделить рег. номер из описания ценной бумаги [" + ISIN + "].");
		КонецЕсли;
		Возврат ВыборкаДетальныеЗаписи.ГосударственныйРегистрационныйНомер;
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВывестиНеподтвержденныеОперацииПозжеВремениСверки(АдресТаблицыСверки)
	
	Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСверки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаСверки = ПолучитьИзВременногоХранилища(АдресТаблицыСверки);
	
	ПараметрыОтчета = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Неподтвержденные операции со временем внесения более поздним, чем время сверки");
	
	Для Каждого СтрокаСверки Из ТаблицаСверки Цикл

		Если СтрокаСверки.НеподтвержденныеОперацииПозжеВремениСверки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
			ПараметрыОтчета,
			СтрокаСверки.НеподтвержденныеОперацииПозжеВремениСверки,
			Новый Структура("Операция, ВремяВнесения", "Операция", "Время внесения"),
			Строка(СтрокаСверки.СчетДоверительногоУправления),
			Ложь,
			Истина);					

	КонецЦикла; 

	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыОтчета);

	Возврат ПараметрыОтчета.ДокументРезультат;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПодтвердитьОперацииСБрокером(СчетДоверительногоУправления, Операции, ВремяПодтверждения, ПараметрыОтчета = Неопределено)
	
	// Подтверждаем операции с брокером
	
	ПодтвержденныеОперации = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПодтвердитьОперацииСБрокером(Операции, ВремяПодтверждения);
	
	Если ПараметрыОтчета = Неопределено ИЛИ ПодтвержденныеОперации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	// Выводим подтвержденные операции в отчет	
	
	СтруктураТаблицы = Новый Структура("ПредставлениеОперации, Период, Примечание", "Операция", "Время подтверждения", "Примечание");
	
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
		ПараметрыОтчета,
		Операции,
		СтруктураТаблицы,
		Строка(СчетДоверительногоУправления),
		Ложь,
		Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьКДатеРабочиеДни(Дата, РабочиеДни)
	
	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Дата, РабочиеДни);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтчет(Отчет)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.Вывести(Отчет);
	
	ДокументРезультат.ОтображатьСетку     = Ложь;
	ДокументРезультат.Защита              = Ложь;
	ДокументРезультат.ТолькоПросмотр      = Истина;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	
	Возврат ДокументРезультат;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтчетОтсутствующихФайловБрокера(ПараметрыОтчетаБрокера)
	
	Отчет = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|ГДЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.Организация = &Организация
		|	И ОстаткиЦенныхБумагОстаткиИОбороты.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
		|	И (ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|				И ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.Брокер = &Брокер
		|			ИЛИ ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)
		|				И ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = &БрокерЮрФизЛицо)
		|	И НЕ ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления В (&СверяемыеСчетаДоверительногоУправления)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.Брокер = &Брокер
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
		|	И НЕ ОстаткиДенежныхСредств.СчетДоверительногоУправления В (&СверяемыеСчетаДоверительногоУправления)";
	
	Для Каждого КлючЗнач Из ПараметрыОтчетаБрокера Цикл
		Запрос.УстановитьПараметр(КлючЗнач.Ключ, КлючЗнач.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("БрокерЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчетаБрокера.Брокер, "ЮрФизЛицо"));  
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отчет = Новый ТабличныйДокумент;
		
		// Заполняем отчет
		Макет = ПолучитьОбщийМакет("РасхожденияНаборовДанных");
		
		// заголовок отчета
		Область = Макет.ПолучитьОбласть("ЗаголовокОтчета");
		Область.Параметры.ЗаголовокОтчета = "Сверка с отчетом брокера ГПБ";
	
		Отчет.Вывести(Область);
		
		// параметры отчета
		Область = Макет.ПолучитьОбласть("ПараметрыОтчета");
		
		ИсключаемыеПараметры = Новый Структура;
		ИсключаемыеПараметры.Вставить("СверяемыеСчетаДоверительногоУправления");
		
		Для Каждого КлючЗнач Из ПараметрыОтчетаБрокера Цикл
			Если ИсключаемыеПараметры.Свойство(КлючЗнач.Ключ) Тогда
				Продолжить;	
			КонецЕсли;
			
			Область.Параметры.ИмяПараметра      = КлючЗнач.Ключ;
			Область.Параметры.ЗначениеПараметра = КлючЗнач.Значение;
			Отчет.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		Область.Параметры.ЗаголовокТаблицы = "Счета ДУ, по которым есть операции, но без отчета брокера";
		Отчет.Вывести(Область);
		
		НомПервойСтрокиТаблицы = Отчет.ВысотаТаблицы;
		Отчет.НачатьГруппуСтрок();
				
		// отобразим шапку
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|ПустаяКолонка");
		Отчет.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|Измерение");
		Область.Параметры.Заголовок = "Счет доверительного управления";
		Отчет.Присоединить(Область);

		// Выведем строки
		ОбластьПустаяКолонка	= Макет.ПолучитьОбласть("СтрокаТаблицы|ПустаяКолонка");
		ОбластьИзмерение		= Макет.ПолучитьОбласть("СтрокаТаблицы|Измерение");
	
		ТаблицаРезультата = РезультатЗапроса.Выгрузить();
		Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
			Отчет.Вывести(ОбластьПустаяКолонка);
			
			ОбластьИзмерение.Параметры.Значение = СтрокаРезультата.СчетДоверительногоУправления;
			Отчет.Присоединить(ОбластьИзмерение);
		КонецЦикла;
		
		Отчет.ЗакончитьГруппуСтрок();
		
		// Заполняем настройки печати по умолчанию
		РаботаСОтчетами.ЗаполнитьНастройкиПечати(Отчет, "ОтчетПоСчетамОтсутствующимВОтчетеБрокера");	
	КонецЕсли;		
	
	Возврат Отчет;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКаталогДанных(Знач Организация, Знач ДатаСверки)
	
	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._СверкаСБрокеромГПБ.ШаблонКаталогаОтчетов", Организация, ДатаСверки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСчетаДоверительногоУправленияНаСервере(МассивФайлов, ДатаСверки, Организация, Брокер)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(275)));
	ТаблицаДанных.Колонки.Добавить("КодСчетаДоверительногоУправления", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	Для Каждого ЭлементФайл Из МассивФайлов Цикл
		
		НоваяСтрокаТаблицы = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, ЭлементФайл);	
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.ИмяФайла КАК ИмяФайла,
		|	ТаблицаДанных.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДанных.ИмяФайла КАК ИмяФайла,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаСверки,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|	ПО _ТаблицаДанных.КодСчетаДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код";
		
	Запрос.УстановитьПараметр("ДатаСверки", КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивДанных.Добавить(Новый Структура("ИмяФайла, СчетДоверительногоУправления", Выборка.ИмяФайла, Выборка.СчетДоверительногоУправления));	
	КонецЦикла;
	
	Возврат МассивДанных; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СверитьДанныеОтчетовБрокера(ДанныеОтчетовБрокера, ОбщиеПараметры)
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбщиеПараметры, "Организация, Брокер, ДатаСверки, ВремяСверки, ФиксироватьРезультатСверки");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		"Сверка с брокером ГПБ. (СверитьДанныеОтчетовБрокера)",
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
				
	ПараметрыОтчета = Новый Структура("Организация, Брокер, БрокерЮрФизЛицо, МестоХранения, СчетДоверительногоУправления, НачалоПериодаОтчета, КонецПериодаОтчета, ВалютаРасчетов", ОбщиеПараметры.Организация, ОбщиеПараметры.Брокер, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПараметры.Брокер, "ЮрФизЛицо"));  
	
	ОстаткиДенежныхСредств	= Неопределено;
	ОстаткиЦенныхБумаг		= Неопределено;
	Сделки					= Неопределено;
	ЗадолженностиПоСделкам	= Неопределено;
	
	Для Каждого ЭлементДанныеОтчета Из ДанныеОтчетовБрокера Цикл
		
		Если ЭлементДанныеОтчета.ОстаткиДенежныхСредств <> Неопределено Тогда 
			
			ОстаткиДенежныхСредствОтчета = ПреобразоватьМассивСтруктурВТаблицуЗначений(ПолучитьСтруктуруТаблицы("ОстаткиДенежныхСредств"), ЭлементДанныеОтчета.ОстаткиДенежныхСредств, ЭлементДанныеОтчета.ПараметрыОтчета); 
			
			Если ОстаткиДенежныхСредств = Неопределено Тогда
				ОстаткиДенежныхСредств = ОстаткиДенежныхСредствОтчета; 			
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ОстаткиДенежныхСредствОтчета, ОстаткиДенежныхСредств);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭлементДанныеОтчета.ОстаткиЦенныхБумаг <> Неопределено Тогда  
			
			ОстаткиЦенныхБумагОтчета = ПреобразоватьМассивСтруктурВТаблицуЗначений(ПолучитьСтруктуруТаблицы("ОстаткиЦенныхБумаг"), ЭлементДанныеОтчета.ОстаткиЦенныхБумаг, ЭлементДанныеОтчета.ПараметрыОтчета); 
			
			Если ОстаткиЦенныхБумаг = Неопределено Тогда 
				ОстаткиЦенныхБумаг = ОстаткиЦенныхБумагОтчета; 
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ОстаткиЦенныхБумагОтчета, ОстаткиЦенныхБумаг);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭлементДанныеОтчета.Операции <> Неопределено Тогда 
			
			СделкиОтчета = ПреобразоватьМассивСтруктурВТаблицуЗначений(ПолучитьСтруктуруТаблицы("Сделки"), ЭлементДанныеОтчета.Операции.Сделки, ЭлементДанныеОтчета.ПараметрыОтчета); 
			
			Если Сделки = Неопределено Тогда
				Сделки = СделкиОтчета;
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(СделкиОтчета, Сделки);	
			КонецЕсли;
			
			ЗадолженностиПоСделкамОтчета = ПреобразоватьМассивСтруктурВТаблицуЗначений(ПолучитьСтруктуруТаблицы("ЗадолженностиПоСделкам"), ЭлементДанныеОтчета.Операции.ЗадолженностиПоСделкам, ЭлементДанныеОтчета.ПараметрыОтчета); 
			
			Если ЗадолженностиПоСделкам = Неопределено Тогда
				ЗадолженностиПоСделкам = ЗадолженностиПоСделкамОтчета; 			
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ЗадолженностиПоСделкамОтчета, ЗадолженностиПоСделкам);		
			Конецесли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОстаткиДенежныхСредств = Неопределено Или ОстаткиЦенныхБумаг = Неопределено Или Сделки = Неопределено Или ЗадолженностиПоСделкам = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для сверки.");
		Возврат Неопределено;	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область Текст_запроса_для_сопоставления_данных_отчетов_с_данными_базы
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.ИмяФайла КАК ИмяФайла,
		|	ОстаткиДенежныхСредств.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	ОстаткиДенежныхСредств.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
		|	ОстаткиДенежныхСредств.ИмяМестаХранения КАК ИмяМестаХранения,
		|	ОстаткиДенежныхСредств.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ОстаткиДенежныхСредств.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредствОтчет
		|ИЗ
		|	&ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумаг.ИмяФайла КАК ИмяФайла,
		|	ОстаткиЦенныхБумаг.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	ОстаткиЦенныхБумаг.НомерТорговогоРаздела КАК НомерТорговогоРаздела,
		|	ОстаткиЦенныхБумаг.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	ОстаткиЦенныхБумаг.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	ОстаткиЦенныхБумаг.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагОтчет
		|ИЗ
		|	&ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.ИмяФайла КАК ИмяФайла,
		|	Сделки.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	Сделки.ИмяЗаписи КАК ИмяЗаписи,
		|	Сделки.НомерСделки КАК НомерСделки,
		|	Сделки.ДатаСделки КАК ДатаСделки,
		|	Сделки.ВидСделки КАК ВидСделки,
		|	Сделки.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Сделки.СуммаСделки КАК СуммаСделки,
		|	Сделки.Купон КАК Купон,
		|	Сделки.БумагиКоличество КАК БумагиКоличество,
		|	Сделки.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	Сделки.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	Сделки.ДатаИсполнения КАК ДатаИсполнения,
		|	Сделки.КомиссияБрокера КАК КомиссияБрокера,
		|	Сделки.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	Сделки.СтавкаРЕПО КАК СтавкаРЕПО
		|ПОМЕСТИТЬ _ВсеСделкиОтчет
		|ИЗ
		|	&Сделки КАК Сделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоСделкам.ИмяФайла КАК ИмяФайла,
		|	ЗадолженностиПоСделкам.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	ЗадолженностиПоСделкам.ИмяЗаписи КАК ИмяЗаписи,
		|	ЗадолженностиПоСделкам.НомерСделки КАК НомерСделки,
		|	ЗадолженностиПоСделкам.ДатаСделки КАК ДатаСделки,
		|	ЗадолженностиПоСделкам.ВидСделки КАК ВидСделки,
		|	ЗадолженностиПоСделкам.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	ЗадолженностиПоСделкам.СуммаЗадолженностиПоСделке КАК СуммаЗадолженностиПоСделке,
		|	ЗадолженностиПоСделкам.СуммаЗадолженностиПоКупону КАК СуммаЗадолженностиПоКупону,
		|	ЗадолженностиПоСделкам.СуммаЗадолженностиПоТорговойКомиссии КАК СуммаЗадолженностиПоТорговойКомиссии,
		|	ЗадолженностиПоСделкам.СуммаЗадолженностиПоБрокерскойКомиссии КАК СуммаЗадолженностиПоБрокерскойКомиссии,
		|	ЗадолженностиПоСделкам.КоличествоЗадолженностиПоБумагам КАК КоличествоЗадолженностиПоБумагам
		|ПОМЕСТИТЬ _ЗадолженностиПоСделкамОтчет
		|ИЗ
		|	&ЗадолженностиПоСделкам КАК ЗадолженностиПоСделкам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиЦенныхБумагОтчет.КодЦеннойБумаги КАК Код,
		|	_ОстаткиЦенныхБумагОтчет.ИмяФайла КАК ИмяФайла
		|ПОМЕСТИТЬ _КодыЦенныхБумаг
		|ИЗ
		|	_ОстаткиЦенныхБумагОтчет КАК _ОстаткиЦенныхБумагОтчет
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ВсеСделкиОтчет.КодЦеннойБумаги,
		|	_ВсеСделкиОтчет.ИмяФайла
		|ИЗ
		|	_ВсеСделкиОтчет КАК _ВсеСделкиОтчет
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоСделкамОтчет.КодЦеннойБумаги,
		|	_ЗадолженностиПоСделкамОтчет.ИмяФайла
		|ИЗ
		|	_ЗадолженностиПоСделкамОтчет КАК _ЗадолженностиПоСделкамОтчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КодыЦенныхБумаг.Код КАК Код,
		|	_КодыЦенныхБумаг.ИмяФайла КАК ИмяФайла,
		|	ВложенныйЗапрос.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_КодыЦенныхБумаг КАК _КодыЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Акции.Ссылка КАК Ссылка,
		|			Акции.ГосударственныйРегистрационныйНомер КАК Код
		|		ИЗ
		|			Справочник.Акции КАК Акции
		|		ГДЕ
		|			Акции.ГосударственныйРегистрационныйНомер В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_КодыЦенныхБумаг.Код
		|					ИЗ
		|						_КодыЦенныхБумаг КАК _КодыЦенныхБумаг)
		|			И Акции.ПометкаУдаления = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			Облигации.Ссылка,
		|			Облигации.ГосударственныйРегистрационныйНомер
		|		ИЗ
		|			Справочник.Облигации КАК Облигации
		|		ГДЕ
		|			Облигации.ГосударственныйРегистрационныйНомер В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_КодыЦенныхБумаг.Код
		|					ИЗ
		|						_КодыЦенныхБумаг КАК _КодыЦенныхБумаг)
		|			И Облигации.ПометкаУдаления = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			Паи.Ссылка,
		|			Паи.ГосударственныйРегистрационныйНомер
		|		ИЗ
		|			Справочник.Паи КАК Паи
		|		ГДЕ
		|			Паи.ГосударственныйРегистрационныйНомер В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_КодыЦенныхБумаг.Код
		|					ИЗ
		|						_КодыЦенныхБумаг КАК _КодыЦенныхБумаг)
		|			И Паи.ПометкаУдаления = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ИпотечныеСертификатыУчастия.Ссылка,
		|			ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер
		|		ИЗ
		|			Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ГДЕ
		|			ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_КодыЦенныхБумаг.Код
		|					ИЗ
		|						_КодыЦенныхБумаг КАК _КодыЦенныхБумаг)
		|			И ИпотечныеСертификатыУчастия.ПометкаУдаления = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			КодыВТорговыхСистемахСрезПоследних.Объект,
		|			КодыВТорговыхСистемахСрезПоследних.Код
		|		ИЗ
		|			РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|					&ДатаСверки,
		|					ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|						И Код В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								_КодыЦенныхБумаг.Код
		|							ИЗ
		|								_КодыЦенныхБумаг КАК _КодыЦенныхБумаг)) КАК КодыВТорговыхСистемахСрезПоследних) КАК ВложенныйЗапрос
		|		ПО _КодыЦенныхБумаг.Код = ВложенныйЗапрос.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КодСчетаДоверительногоУправления КАК КодСчета,
		|	ВложенныйЗапрос.ИмяФайла КАК ИмяФайла,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ОстаткиЦенныхБумагОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|		_ОстаткиЦенныхБумагОтчет.ИмяФайла КАК ИмяФайла
		|	ИЗ
		|		_ОстаткиЦенныхБумагОтчет КАК _ОстаткиЦенныхБумагОтчет
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ОстаткиДенежныхСредствОтчет.КодСчетаДоверительногоУправления,
		|		_ОстаткиДенежныхСредствОтчет.ИмяФайла
		|	ИЗ
		|		_ОстаткиДенежныхСредствОтчет КАК _ОстаткиДенежныхСредствОтчет
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ВсеСделкиОтчет.КодСчетаДоверительногоУправления,
		|		_ВсеСделкиОтчет.ИмяФайла
		|	ИЗ
		|		_ВсеСделкиОтчет КАК _ВсеСделкиОтчет
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностиПоСделкамОтчет.КодСчетаДоверительногоУправления,
		|		_ЗадолженностиПоСделкамОтчет.ИмяФайла
		|	ИЗ
		|		_ЗадолженностиПоСделкамОтчет КАК _ЗадолженностиПоСделкамОтчет) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&ДатаСверки,
		|				Организация = &Организация
		|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО ВложенныйЗапрос.КодСчетаДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумаги.Код КАК Код,
		|	_ЦенныеБумаги.ИмяФайла КАК ИмяФайла,
		|	""Не удалось определить ценную бумагу по коду [%1]. Файл [%2]."" КАК ТекстОшибки
		|ПОМЕСТИТЬ _ОшибкиЦенныхБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	_ЦенныеБумаги.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЦенныеБумаги.Код,
		|	_ЦенныеБумаги.ИмяФайла,
		|	""Не удалось определить ценную бумагу. По коду [%1] найдено несколько значений. Файл [%2].""
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|ГДЕ
		|	НЕ _ЦенныеБумаги.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЦенныеБумаги.Код,
		|	_ЦенныеБумаги.ИмяФайла
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЦенныеБумаги.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	_СчетаДоверительногоУправления.ИмяФайла КАК ИмяФайла,
		|	""Не удалось определить счет доверительного управления по коду у брокера [%1]. Файл [%2]."" КАК ТекстОшибки
		|ПОМЕСТИТЬ _ОшибкиСчетовДоверительногоУправления
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|ГДЕ
		|	_СчетаДоверительногоУправления.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаДоверительногоУправления.КодСчета,
		|	_СчетаДоверительногоУправления.ИмяФайла,
		|	""Не удалось определить счет доверительного управления. По коду у брокера [%1] найдено несколько значений. Файл [%2].""
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|ГДЕ
		|	НЕ _СчетаДоверительногоУправления.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.КодСчета,
		|	_СчетаДоверительногоУправления.ИмяФайла
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СчетаДоверительногоУправления.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиДенежныхСредствОтчет.ИмяФайла КАК ИмяФайла,
		|	_ОстаткиДенежныхСредствОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ОстаткиДенежныхСредствОтчет.ИмяМестаХранения КАК ИмяМестаХранения,
		|	ИменованныеОбъекты.Объект КАК МестоХранения,
		|	_ОстаткиДенежныхСредствОтчет.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
		|	Валюты.Ссылка КАК Валюта,
		|	_ОстаткиДенежныхСредствОтчет.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	_ОстаткиДенежныхСредствОтчет.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ _ОбщиеДанные_ОстаткиДенежныхСредств
		|ИЗ
		|	_ОстаткиДенежныхСредствОтчет КАК _ОстаткиДенежныхСредствОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
		|		ПО _ОстаткиДенежныхСредствОтчет.ИмяМестаХранения = ИменованныеОбъекты.Имя
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ОстаткиДенежныхСредствОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ОстаткиДенежныхСредствОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО _ОстаткиДенежныхСредствОтчет.ИмяВалютыРасчетов = Валюты.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяФайла КАК ИмяФайла,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.Валюта КАК ВалютаРасчетов
		|ПОМЕСТИТЬ _ПараметрыОтчета
		|ИЗ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств КАК _ОбщиеДанные_ОстаткиДенежныхСредств
		|ГДЕ
		|	НЕ (_ОбщиеДанные_ОстаткиДенежныхСредств.МестоХранения ЕСТЬ NULL И _ОбщиеДанные_ОстаткиДенежныхСредств.Валюта ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяМестаХранения КАК ИмяМестаХранения,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяФайла КАК ИмяФайла,
		|	""Не удалось определить место хранения по имени именованного объекта [%1]. Файл [%2]."" КАК ТекстОшибки
		|ПОМЕСТИТЬ _ОшибкиМестаХранения
		|ИЗ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств КАК _ОбщиеДанные_ОстаткиДенежныхСредств
		|ГДЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.МестоХранения ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяФайла КАК ИмяФайла,
		|	""Не удалось определить валюту по наименованию [%1]. Файл [%2]."" КАК ТекстОшибки
		|ПОМЕСТИТЬ _ОшибкиВалюты
		|ИЗ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств КАК _ОбщиеДанные_ОстаткиДенежныхСредств
		|ГДЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.Валюта ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.ИмяФайла КАК ИмяФайла,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	_ОбщиеДанные_ОстаткиДенежныхСредств.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ _ДанныеДляСверки_ОстаткиДенежныхСредств
		|ИЗ
		|	_ОбщиеДанные_ОстаткиДенежныхСредств КАК _ОбщиеДанные_ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ОбщиеДанные_ОстаткиДенежныхСредств.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ОбщиеДанные_ОстаткиДенежныхСредств.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|ГДЕ
		|	_ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И НЕ(_ОбщиеДанные_ОстаткиДенежныхСредств.МестоХранения ЕСТЬ NULL
		|				И _ОбщиеДанные_ОстаткиДенежныхСредств.Валюта ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагОтчет.ИмяФайла КАК ИмяФайла,
		|	_ОстаткиЦенныхБумагОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагОтчет.НомерТорговогоРаздела КАК НомерТорговогоРаздела,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагОтчет.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	_ОстаткиЦенныхБумагОтчет.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		|ПОМЕСТИТЬ _ДанныеДляСверки_ОстаткиЦенныхБумаг
		|ИЗ
		|	_ОстаткиЦенныхБумагОтчет КАК _ОстаткиЦенныхБумагОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ОстаткиЦенныхБумагОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ОстаткиЦенныхБумагОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _ОстаткиЦенныхБумагОтчет.КодЦеннойБумаги = _ЦенныеБумаги.Код
		|			И _ОстаткиЦенныхБумагОтчет.ИмяФайла = _ЦенныеБумаги.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ОстаткиЦенныхБумагОтчет.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ОстаткиЦенныхБумагОтчет.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЦенныхБумаг КАК _ОшибкиЦенныхБумаг
		|		ПО _ОстаткиЦенныхБумагОтчет.КодЦеннойБумаги = _ОшибкиЦенныхБумаг.Код
		|			И _ОстаткиЦенныхБумагОтчет.ИмяФайла = _ОшибкиЦенныхБумаг.ИмяФайла
		|ГДЕ
		|	_ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И _ОшибкиЦенныхБумаг.Код ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеСделкиОтчет.ИмяФайла КАК ИмяФайла,
		|	_ВсеСделкиОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ВсеСделкиОтчет.НомерСделки КАК НомерСделки,
		|	_ВсеСделкиОтчет.ДатаСделки КАК ДатаСделки,
		|	_ВсеСделкиОтчет.ВидСделки КАК ВидСделки,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ВсеСделкиОтчет.СуммаСделки КАК СуммаСделки,
		|	_ВсеСделкиОтчет.Купон КАК Купон,
		|	_ВсеСделкиОтчет.БумагиКоличество КАК БумагиКоличество,
		|	_ВсеСделкиОтчет.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_ВсеСделкиОтчет.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	_ВсеСделкиОтчет.ДатаИсполнения КАК ДатаИсполнения,
		|	_ВсеСделкиОтчет.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ _ДанныеДляСверки_Сделки
		|ИЗ
		|	_ВсеСделкиОтчет КАК _ВсеСделкиОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ЦенныеБумаги.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ЦенныеБумаги.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЦенныхБумаг КАК _ОшибкиЦенныхБумаг
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ОшибкиЦенныхБумаг.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиЦенныхБумаг.ИмяФайла
		|ГДЕ
		|	_ВсеСделкиОтчет.ИмяЗаписи = ""Сделка""
		|	И _ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И _ОшибкиЦенныхБумаг.Код ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеСделкиОтчет.ИмяФайла КАК ИмяФайла,
		|	_ВсеСделкиОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ВсеСделкиОтчет.НомерСделки КАК НомерСделкиСЦК,
		|	_ВсеСделкиОтчет.ДатаСделки КАК ДатаСделки,
		|	_ВсеСделкиОтчет.ВидСделки КАК ВидСделки,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ВсеСделкиОтчет.СуммаСделки КАК СуммаСделки,
		|	_ВсеСделкиОтчет.Купон КАК Купон,
		|	_ВсеСделкиОтчет.БумагиКоличество КАК БумагиКоличество,
		|	_ВсеСделкиОтчет.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_ВсеСделкиОтчет.КомиссияБрокера КАК КомиссияБрокера,
		|	_ВсеСделкиОтчет.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_ВсеСделкиОтчет.СтавкаРЕПО КАК СтавкаРЕПО
		|ПОМЕСТИТЬ _ДанныеДляСверки_СделкиРЕПО
		|ИЗ
		|	_ВсеСделкиОтчет КАК _ВсеСделкиОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ЦенныеБумаги.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ЦенныеБумаги.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЦенныхБумаг КАК _ОшибкиЦенныхБумаг
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ОшибкиЦенныхБумаг.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиЦенныхБумаг.ИмяФайла
		|ГДЕ
		|	_ВсеСделкиОтчет.ИмяЗаписи = ""СделкаРЕПО""
		|	И _ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И _ОшибкиЦенныхБумаг.Код ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеСделкиОтчет.ИмяФайла КАК ИмяФайла,
		|	_ВсеСделкиОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ВсеСделкиОтчет.НомерСделки КАК НомерСделки,
		|	_ВсеСделкиОтчет.ДатаСделки КАК ДатаСделки,
		|	_ВсеСделкиОтчет.ВидСделки КАК ВидСделки,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ВсеСделкиОтчет.СуммаСделки КАК СуммаСделки,
		|	_ВсеСделкиОтчет.Купон КАК Купон,
		|	_ВсеСделкиОтчет.БумагиКоличество КАК БумагиКоличество,
		|	_ВсеСделкиОтчет.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_ВсеСделкиОтчет.ДатаИсполнения КАК ДатаИсполнения,
		|	_ВсеСделкиОтчет.КомиссияБрокера КАК КомиссияБрокера
		|ПОМЕСТИТЬ _ДанныеДляСверки_ИсполненияСделок
		|ИЗ
		|	_ВсеСделкиОтчет КАК _ВсеСделкиОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ЦенныеБумаги.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ЦенныеБумаги.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ВсеСделкиОтчет.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЦенныхБумаг КАК _ОшибкиЦенныхБумаг
		|		ПО _ВсеСделкиОтчет.КодЦеннойБумаги = _ОшибкиЦенныхБумаг.Код
		|			И _ВсеСделкиОтчет.ИмяФайла = _ОшибкиЦенныхБумаг.ИмяФайла
		|ГДЕ
		|	_ВсеСделкиОтчет.ИмяЗаписи = ""ИсполнениеОбязательствПоСделке""
		|	И _ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И _ОшибкиЦенныхБумаг.Код ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоСделкамОтчет.ИмяФайла КАК ИмяФайла,
		|	_ЗадолженностиПоСделкамОтчет.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_ЗадолженностиПоСделкамОтчет.НомерСделки КАК НомерСделки,
		|	_ЗадолженностиПоСделкамОтчет.ДатаСделки КАК ДатаСделки,
		|	_ЗадолженностиПоСделкамОтчет.ВидСделки КАК ВидСделки,
		|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
		|	_ЗадолженностиПоСделкамОтчет.СуммаЗадолженностиПоСделке КАК СуммаЗадолженностиПоСделке,
		|	_ЗадолженностиПоСделкамОтчет.СуммаЗадолженностиПоКупону КАК СуммаЗадолженностиПоКупону,
		|	_ЗадолженностиПоСделкамОтчет.СуммаЗадолженностиПоТорговойКомиссии КАК СуммаЗадолженностиПоТорговойКомиссии,
		|	_ЗадолженностиПоСделкамОтчет.СуммаЗадолженностиПоБрокерскойКомиссии КАК СуммаЗадолженностиПоБрокерскойКомиссии,
		|	_ЗадолженностиПоСделкамОтчет.КоличествоЗадолженностиПоБумагам КАК КоличествоЗадолженностиПоБумагам
		|ПОМЕСТИТЬ _ДанныеДляСверки_ЗадолженностиПоСделкам
		|ИЗ
		|	_ЗадолженностиПоСделкамОтчет КАК _ЗадолженностиПоСделкамОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО _ЗадолженностиПоСделкамОтчет.КодСчетаДоверительногоУправления = _СчетаДоверительногоУправления.КодСчета
		|			И _ЗадолженностиПоСделкамОтчет.ИмяФайла = _СчетаДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
		|		ПО _ЗадолженностиПоСделкамОтчет.КодЦеннойБумаги = _ЦенныеБумаги.Код
		|			И _ЗадолженностиПоСделкамОтчет.ИмяФайла = _ЦенныеБумаги.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСчетовДоверительногоУправления КАК _ОшибкиСчетовДоверительногоУправления
		|		ПО _ЗадолженностиПоСделкамОтчет.КодСчетаДоверительногоУправления = _ОшибкиСчетовДоверительногоУправления.КодСчета
		|			И _ЗадолженностиПоСделкамОтчет.ИмяФайла = _ОшибкиСчетовДоверительногоУправления.ИмяФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЦенныхБумаг КАК _ОшибкиЦенныхБумаг
		|		ПО _ЗадолженностиПоСделкамОтчет.КодЦеннойБумаги = _ОшибкиЦенныхБумаг.Код
		|			И _ЗадолженностиПоСделкамОтчет.ИмяФайла = _ОшибкиЦенныхБумаг.ИмяФайла
		|ГДЕ
		|	_ОшибкиСчетовДоверительногоУправления.КодСчета ЕСТЬ NULL
		|	И _ОшибкиЦенныхБумаг.Код ЕСТЬ NULL";
	
	#КонецОбласти

	Запрос.УстановитьПараметр("ДатаСверки",				ОбщиеПараметры.ДатаСверки);
	Запрос.УстановитьПараметр("Организация",			ОбщиеПараметры.Организация);
	Запрос.УстановитьПараметр("Брокер",					ОбщиеПараметры.Брокер);
	Запрос.УстановитьПараметр("ОстаткиДенежныхСредств",	ОстаткиДенежныхСредств);
	Запрос.УстановитьПараметр("ОстаткиЦенныхБумаг",		ОстаткиЦенныхБумаг);
	Запрос.УстановитьПараметр("Сделки",					Сделки);
	Запрос.УстановитьПараметр("ЗадолженностиПоСделкам",	ЗадолженностиПоСделкам);

	Запрос.Выполнить();
	
	#Область Обработка_ошибок_сопоставления_данных
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиЦенныхБумаг"].ПолучитьДанные().Выбрать();
	Пока ВыборкаОшибок.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибок.ТекстОшибки, ВыборкаОшибок.Код, ВыборкаОшибок.ИмяФайла));	
	КонецЦикла;
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиСчетовДоверительногоУправления"].ПолучитьДанные().Выбрать();
	Пока ВыборкаОшибок.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибок.ТекстОшибки, ВыборкаОшибок.КодСчета, ВыборкаОшибок.ИмяФайла));		
	КонецЦикла;
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиМестаХранения"].ПолучитьДанные().Выбрать();
	Пока ВыборкаОшибок.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибок.ТекстОшибки, ВыборкаОшибок.ИмяМестаХранения, ВыборкаОшибок.ИмяФайла));		
	КонецЦикла;
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиВалюты"].ПолучитьДанные().Выбрать();
	Пока ВыборкаОшибок.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибок.ТекстОшибки, ВыборкаОшибок.ИмяВалютыРасчетов, ВыборкаОшибок.ИмяФайла));	
	КонецЦикла;

	#КонецОбласти
	
	ОстаткиДенежныхСредств			= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_ОстаткиДенежныхСредств"].ПолучитьДанные().Выгрузить();
	ОстаткиЦенныхБумаг				= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_ОстаткиЦенныхБумаг"].ПолучитьДанные().Выгрузить();
	Сделки							= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_Сделки"].ПолучитьДанные().Выгрузить();
	СделкиРепо						= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_СделкиРепо"].ПолучитьДанные().Выгрузить();
	ИсполненияОбязательствПоСделкам	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_ИсполненияСделок"].ПолучитьДанные().Выгрузить();
	ЗадолженностиПоСделкам			= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеДляСверки_ЗадолженностиПоСделкам"].ПолучитьДанные().Выгрузить();
	
	СчетаДоверительногоУправления	= Запрос.МенеджерВременныхТаблиц.Таблицы["_СчетаДоверительногоУправления"].ПолучитьДанные().Выгрузить();
	ТаблицаПараметров				= Запрос.МенеджерВременныхТаблиц.Таблицы["_ПараметрыОтчета"].ПолучитьДанные().Выгрузить();
 
	РезультатВыполнения	= Новый Структура;
	
	#Область СВЕРКА

	МассивОтчетовСверки	= Новый Массив;
	ТаблицаСверки		= Неопределено;
	ВалютаРубли			= Неопределено;
	
	Для Каждого ЭлементДанныеОтчета Из ДанныеОтчетовБрокера Цикл
	
		ПараметрыОтчета.НачалоПериодаОтчета = ЭлементДанныеОтчета.ПараметрыОтчета.НачалоПериодаОтчета;
		ПараметрыОтчета.КонецПериодаОтчета = ЭлементДанныеОтчета.ПараметрыОтчета.КонецПериодаОтчета;
		СтрокаТаблицыСчетаДоверительногоУправления = СчетаДоверительногоУправления.Найти(ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла, "ИмяФайла");
		
		Если ЗначениеЗаполнено(СтрокаТаблицыСчетаДоверительногоУправления) И ЗначениеЗаполнено(СтрокаТаблицыСчетаДоверительногоУправления.Ссылка) Тогда 
			ПараметрыОтчета.СчетДоверительногоУправления = СтрокаТаблицыСчетаДоверительногоУправления.Ссылка 
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыПараметров = ТаблицаПараметров.Найти(ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла, "ИмяФайла");
		
		Если ЗначениеЗаполнено(СтрокаТаблицыПараметров) И ЗначениеЗаполнено(СтрокаТаблицыПараметров.МестоХранения) И ЗначениеЗаполнено(СтрокаТаблицыПараметров.ВалютаРасчетов) Тогда 
			ПараметрыОтчета.МестоХранения = СтрокаТаблицыПараметров.МестоХранения;
			ПараметрыОтчета.ВалютаРасчетов = СтрокаТаблицыПараметров.ВалютаРасчетов;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НаборОстаткиДенежныхСредств = Новый Структура;
		НаборОстаткиДенежныхСредств.Вставить("Заголовок", "Остатки денежных средств");
		НаборОстаткиДенежныхСредств.Вставить("КлючевыеПоля", "МестоХранения, Валюта");
		НаборОстаткиДенежныхСредств.Вставить("Ресурсы", "СуммаНачальныйОстаток, СуммаКонечныйОстаток");
		НаборОстаткиДенежныхСредств.Вставить("ДанныеВнешнейСистемы", ОстаткиДенежныхСредств.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла)));
		НаборОстаткиДенежныхСредств.Вставить("ДанныеУчетнойСистемы", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток,
			|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
			|			&НачалоПериодаОтчета,
			|			&КонецПериодаОтчета,
			|			Период,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Брокер = &Брокер
			|				И МестоХранения = &МестоХранения
			|				И Валюта = &ВалютаРасчетов) КАК ОстаткиДенежныхСредствОстаткиИОбороты");
			
		НаборОстаткиЦенныхБумаг = Новый Структура;
		НаборОстаткиЦенныхБумаг.Вставить("Заголовок", "Остатки ценных бумаг");
		НаборОстаткиЦенныхБумаг.Вставить("КлючевыеПоля", "ЦеннаяБумага, НомерТорговогоРаздела");
		НаборОстаткиЦенныхБумаг.Вставить("Ресурсы", "КоличествоНачальныйОстаток, КоличествоКонечныйОстаток");
		НаборОстаткиЦенныхБумаг.Вставить("ДанныеВнешнейСистемы", ОстаткиЦенныхБумаг.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла)));
		НаборОстаткиЦенныхБумаг.Вставить("ДанныеУчетнойСистемы",
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
			|			ТОГДА ПОДСТРОКА(ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.НомерСчета, 1, 2)
			|		ИНАЧЕ ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет
			|	КОНЕЦ КАК НомерТорговогоРаздела,
			|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
			|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
			|			&НачалоПериодаОтчета,
			|			&КонецПериодаОтчета,
			|			Период,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И (ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)
			|						И ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = &БрокерЮрФизЛицо
			|					ИЛИ ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
			|						И ДепозитарныйСчет.Брокер = &Брокер)) КАК ОстаткиЦенныхБумагОстаткиИОбороты");
		
		НаборСделки = Новый Структура;
		НаборСделки.Вставить("Заголовок", "Сделки");
		НаборСделки.Вставить("КлючевыеПоля", "ЦеннаяБумага, НомерСделки, ДатаСделки, ВидСделки, ОтложенноеИсполнение, ДатаИсполнения");
		НаборСделки.Вставить("Ресурсы", "БумагиКоличество, СуммаСделки, Купон, КомиссияБрокера, ТорговаяКомиссия");
		НаборСделки.Вставить("ДанныеВнешнейСистемы", Сделки.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла))); 
		НаборСделки.Вставить("ДанныеУчетнойСистемы",
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сделка.НомерСделки КАК НомерСделки,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ), СЕКУНДА, ЧАС(Сделка.ВремяСделки) * 60 * 60 + МИНУТА(Сделка.ВремяСделки) * 60 + СЕКУНДА(Сделка.ВремяСделки)) КАК ДатаСделки,
			|	Сделка.ВидСделки КАК ВидСделки,
			|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаЦенныеБумаги.Сумма КАК СуммаСделки,
			|	СделкаЦенныеБумаги.СуммаКупона КАК Купон,
			|	СделкаЦенныеБумаги.Количество КАК БумагиКоличество,
			|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	Сделка.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	Сделка.ДатаИсполнения КАК ДатаИсполнения,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0) КАК КомиссияБрокера
			|ИЗ
			|	Документ.Сделка КАК Сделка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ПО (СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|		ПО Сделка.Ссылка = ЗадолженностиПоДенежнымСредствам.Основание
			|			И (ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета)
			|			И (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
			|			И (ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
			|ГДЕ
			|	Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И Сделка.Дата МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
			|	И Сделка.Брокер = &Брокер
			|	И Сделка.Организация = &Организация
			|	И Сделка.ВалютаСделки = &ВалютаРасчетов
			|	И Сделка.Проведен = ИСТИНА");
		
		НаборСделкиРепо = Новый Структура;
		НаборСделкиРепо.Вставить("Заголовок", "Сделки Репо");
		НаборСделкиРепо.Вставить("КлючевыеПоля", " ЦеннаяБумага, НомерСделкиСЦК, ДатаСделки, ВидСделки, ЧастьСделкиРепо");
		НаборСделкиРепо.Вставить("Ресурсы", "СтавкаРепо, БумагиКоличество, СуммаСделки, Купон, КомиссияБрокера, ТорговаяКомиссия");
		НаборСделкиРепо.Вставить("ДанныеВнешнейСистемы", СделкиРепо.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла))); 
		НаборСделкиРепо.Вставить("ДанныеУчетнойСистемы",
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом КАК НомерСделкиСЦК,
			|	СделкаРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	СделкаРЕПО.ВидСделки КАК ВидСделки,
			|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СделкаРЕПОЦенныеБумаги.Сумма КАК СуммаСделки,
			|	СделкаРЕПОЦенныеБумаги.СуммаКупона КАК Купон,
			|	ВЫБОР
			|		КОГДА СделкаРЕПО.ЧастьСделкиРЕПО = 2
			|			ТОГДА СделкаРЕПО.ПерваяЧастьРЕПО.СтавкаРЕПО
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СтавкаРЕПО,
			|	СделкаРЕПОЦенныеБумаги.Количество КАК БумагиКоличество,
			|	ВЫБОР
			|		КОГДА СделкаРЕПО.ЧастьСделкиРЕПО = 1
			|			ТОГДА СделкаРЕПО.Дата
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ)
			|	КОНЕЦ КАК ДатаСделки,
			|	СделкаРЕПОЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0) КАК КомиссияБрокера
			|ИЗ
			|	Документ.СделкаРЕПО КАК СделкаРЕПО
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
			|		ПО (СделкаРЕПОЦенныеБумаги.Ссылка = СделкаРЕПО.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|		ПО СделкаРЕПО.Ссылка = ЗадолженностиПоДенежнымСредствам.Основание
			|			И (ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета)
			|			И (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
			|			И (ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
			|ГДЕ
			|	СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И (СделкаРЕПО.Дата МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
			|			ИЛИ СделкаРЕПО.ПерваяЧастьРЕПО.Дата МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
			|			ИЛИ СделкаРЕПО.ПерваяЧастьРЕПО.Дата < &НачалоПериодаОтчета
			|				И СделкаРЕПО.Дата > &КонецПериодаОтчета
			|				И СделкаРЕПО.ЧастьСделкиРЕПО = 2)
			|	И СделкаРЕПО.Брокер = &Брокер
			|	И СделкаРЕПО.Организация = &Организация
			|	И СделкаРЕПО.ВалютаСделки = &ВалютаРасчетов
			|	И ВЫБОР
			|			КОГДА СделкаРЕПО.Дата > &КонецПериодаОтчета
			|				ТОГДА СделкаРЕПО.ПометкаУдаления = ЛОЖЬ
			|			ИНАЧЕ СделкаРЕПО.Проведен = ИСТИНА
			|		КОНЕЦ");
		
		НаборИсполненияОбязательствПоСделкам = Новый Структура;
		НаборИсполненияОбязательствПоСделкам.Вставить("Заголовок", "Исполнения обязательств по сделкам");
		НаборИсполненияОбязательствПоСделкам.Вставить("КлючевыеПоля", "ЦеннаяБумага, НомерСделки, ДатаСделки, ВидСделки, ДатаИсполнения");
		НаборИсполненияОбязательствПоСделкам.Вставить("Ресурсы", "БумагиКоличество, СуммаСделки, Купон, КомиссияБрокера, ТорговаяКомиссия");
		НаборИсполненияОбязательствПоСделкам.Вставить("ДанныеВнешнейСистемы", ИсполненияОбязательствПоСделкам.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла)));
		НаборИсполненияОбязательствПоСделкам.Вставить("ДанныеУчетнойСистемы",
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Основание.Дата, ДЕНЬ), СЕКУНДА, ЧАС(ИсполнениеОбязательствПоСделке.Основание.ВремяСделки) * 60 * 60 + МИНУТА(ИсполнениеОбязательствПоСделке.Основание.ВремяСделки) * 60 + СЕКУНДА(ИсполнениеОбязательствПоСделке.Основание.ВремяСделки)) КАК ДатаСделки,
			|	ИсполнениеОбязательствПоСделке.Основание.НомерСделки КАК НомерСделки,
			|	ИсполнениеОбязательствПоСделке.ВидСделки КАК ВидСделки,
			|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма КАК СуммаСделки,
			|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона КАК Купон,
			|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество КАК БумагиКоличество,
			|	ЗадолженностиПоБрокерскойКомиссии.Сумма КАК КомиссияБрокера,
			|	ЗадолженностиПоТорговойКомиссии.Сумма КАК ТорговаяКомиссия,
			|	ИсполнениеОбязательствПоСделке.Основание.ДатаИсполнения КАК ДатаИсполнения
			|ИЗ
			|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
			|		ПО (ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка = ИсполнениеОбязательствПоСделке.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоБрокерскойКомиссии
			|		ПО ИсполнениеОбязательствПоСделке.Основание.Ссылка = ЗадолженностиПоБрокерскойКомиссии.Основание
			|			И (ЗадолженностиПоБрокерскойКомиссии.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета)
			|			И (ЗадолженностиПоБрокерскойКомиссии.Организация = &Организация)
			|			И (ЗадолженностиПоБрокерскойКомиссии.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (ЗадолженностиПоБрокерскойКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
			|			И (ЗадолженностиПоБрокерскойКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоТорговойКомиссии
			|		ПО ИсполнениеОбязательствПоСделке.Основание.Ссылка = ЗадолженностиПоТорговойКомиссии.Основание
			|			И (ЗадолженностиПоТорговойКомиссии.Период МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета)
			|			И (ЗадолженностиПоТорговойКомиссии.Организация = &Организация)
			|			И (ЗадолженностиПоТорговойКомиссии.СчетДоверительногоУправления = &СчетДоверительногоУправления)
			|			И (ЗадолженностиПоТорговойКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
			|			И (ЗадолженностиПоТорговойКомиссии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
			|ГДЕ
			|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ИсполнениеОбязательствПоСделке.Дата МЕЖДУ &НачалоПериодаОтчета И &КонецПериодаОтчета
			|	И ИсполнениеОбязательствПоСделке.Брокер = &Брокер
			|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
			|	И ИсполнениеОбязательствПоСделке.ВалютаСделки = &ВалютаРасчетов
			|	И ИсполнениеОбязательствПоСделке.Проведен = ИСТИНА");
		
		НаборЗадолженности = Новый Структура;
		НаборЗадолженности.Вставить("Заголовок", "Задолженности по денежным средствам/ценным бумагам");
		НаборЗадолженности.Вставить("КлючевыеПоля", "ЦеннаяБумага, НомерСделки, ДатаСделки, ВидСделки");
		НаборЗадолженности.Вставить("Ресурсы", "СуммаЗадолженностиПоСделке, СуммаЗадолженностиПоКупону, СуммаЗадолженностиПоТорговойКомиссии, СуммаЗадолженностиПоБрокерскойКомиссии, КоличествоЗадолженностиПоБумагам");
		НаборЗадолженности.Вставить("ДанныеВнешнейСистемы", ЗадолженностиПоСделкам.Скопировать(Новый Структура("СчетДоверительногоУправления, ИмяФайла", ПараметрыОтчета.СчетДоверительногоУправления, ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла)));
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.НомерСделки КАК НомерСделки,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ), СЕКУНДА, ЧАС(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки) * 60 * 60 + МИНУТА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки) * 60 + СЕКУНДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки)) КАК ДатаСделки,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВидСделки КАК ВидСделки,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|							ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|						ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаЗадолженностиПоСделке,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|							ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
			|						ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаЗадолженностиПоКупону,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|							ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|						ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаЗадолженностиПоТорговойКомиссии,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|							ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|						ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаЗадолженностиПоБрокерскойКомиссии,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|	КОНЕЦ КАК КоличествоЗадолженностиПоБумагам,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&КонецПериодаОтчета,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Валюта = &ВалютаРасчетов
			|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|				&КонецПериодаОтчета,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = ЗадолженностиПоЦеннымБумагамОстатки.Основание
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.Брокер = &Брокер
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.НомерСделки,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.Дата, ДЕНЬ), СЕКУНДА, ЧАС(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки) * 60 * 60 + МИНУТА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки) * 60 + СЕКУНДА(ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВремяСделки)),
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.ВидСделки,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
			|	КОНЕЦ,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.Дата, ДЕНЬ), СЕКУНДА, ЧАС(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки) * 60 * 60 + МИНУТА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки) * 60 + СЕКУНДА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки)),
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.СуммаОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.СуммаОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.СуммаКупонаОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.СуммаКупонаОстаток
			|	КОНЕЦ,
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
			|							ТОГДА ВЫБОР
			|									КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|										ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаРасход
			|									ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаРасход
			|								КОНЕЦ
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|				ТОГДА ВЫБОР
			|						КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|							ТОГДА ВЫБОР
			|									КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|										ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаРасход
			|									ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаРасход
			|								КОНЕЦ
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток
			|	КОНЕЦ,
			|	ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
			|			&КонецПериодаОтчета,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Валюта = &ВалютаРасчетов) КАК ЗадолженностиПоВторойЧастиРЕПО
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
			|				&НачалоПериодаОтчета,
			|				&КонецПериодаОтчета,
			|				,
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Валюта = &ВалютаРасчетов
			|					И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ПО (ЗадолженностиПоДенежнымСредствамОстатки.Основание = ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО)
			|ГДЕ
			|	ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.Брокер = &Брокер
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом,
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.Дата, ДЕНЬ), СЕКУНДА, ЧАС(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки) * 60 * 60 + МИНУТА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки) * 60 + СЕКУНДА(ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВремяСделки)),
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.СуммаОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.СуммаОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.СуммаКупонаОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.СуммаКупонаОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток
			|		ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПО.КоличествоОстаток
			|	КОНЕЦ,
			|	ЗадолженностиПоВторойЧастиРЕПО.ЦеннаяБумага");
			
		Запрос.УстановитьПараметр("КонецПериодаОтчета", ПараметрыОтчета.КонецПериодаОтчета);
		Запрос.УстановитьПараметр("НачалоПериодаОтчета", ПараметрыОтчета.НачалоПериодаОтчета);
		Запрос.УстановитьПараметр("Организация", ОбщиеПараметры.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ПараметрыОтчета.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ВалютаРасчетов", ПараметрыОтчета.ВалютаРасчетов);
		Запрос.УстановитьПараметр("Брокер", ОбщиеПараметры.Брокер);
			
		НаборЗадолженности.Вставить("ДанныеУчетнойСистемы", Запрос.Выполнить().Выгрузить());
					
		НаборыДанных = Новый Массив;
		НаборыДанных.Добавить(НаборОстаткиДенежныхСредств);
		НаборыДанных.Добавить(НаборОстаткиЦенныхБумаг);
		НаборыДанных.Добавить(НаборСделки);
		НаборыДанных.Добавить(НаборСделкиРепо);
		НаборыДанных.Добавить(НаборИсполненияОбязательствПоСделкам);
		НаборыДанных.Добавить(НаборЗадолженности);
		
		Заголовки = Новый Структура;
		Заголовки.Вставить("ФайлОтчета", "Файл отчета");
		Заголовки.Вставить("ДатаОтчета", "Дата отчета");
		Заголовки.Вставить("СчетДоверительногоУправления", "Счет доверит. упр.");
		Заголовки.Вставить("ВалютаРасчетов", "Вал. расчетов");
		Заголовки.Вставить("НачалоПериодаОтчета", "Нач. периода");
		Заголовки.Вставить("КонецПериодаОтчета", "Кон. периода");
		Заголовки.Вставить("СуммаНачальныйОстаток", "Сумма, нач. остаток");
		Заголовки.Вставить("СуммаКонечныйОстаток", "Сумма, кон. остаток");
		Заголовки.Вставить("НомерТорговогоРаздела", "№ торг. раздела");
		Заголовки.Вставить("ЦеннаяБумага", "Ценная бумага");
		Заголовки.Вставить("КоличествоНачальныйОстаток", "Количество, нач. остаток");
		Заголовки.Вставить("КоличествоКонечныйОстаток", "Количество, кон. остаток");
		Заголовки.Вставить("ДатаСделки", "Дата сделки");
		Заголовки.Вставить("НомерСделки", "Номер сделки");
		Заголовки.Вставить("НомерСделкиСЦК", "Номер сделки с ЦК"); 
		Заголовки.Вставить("ВидСделки", "Вид сделки");
		Заголовки.Вставить("СуммаСделки", "Сумма сделки");
		Заголовки.Вставить("СтавкаРепо", "Ставка репо");
		Заголовки.Вставить("БумагиКоличество", "Бумаги (количество)");
		Заголовки.Вставить("ЧастьСделкиРепо", "Часть сделки");
		Заголовки.Вставить("ТорговаяКомиссия", "Торговая комиссия");
		Заголовки.Вставить("КомиссияБрокера", "Брокерская комиссия");
		Заголовки.Вставить("ДатаИсполнения", "Дата исполнения");
		Заголовки.Вставить("ОтложенноеИсполнение", "Отложенное исполнение");
		
		Заголовки.Вставить("СуммаЗадолженностиПоСделке", "По сделке");
		Заголовки.Вставить("СуммаЗадолженностиПоКупону", "Купон");
		Заголовки.Вставить("КоличествоЗадолженностиПоБумагам", "Бумаги (количество)");
		Заголовки.Вставить("СуммаЗадолженностиПоТорговойКомиссии", "По торговой комиссии");
		Заголовки.Вставить("СуммаЗадолженностиПоБрокерскойКомиссии", "По брокерской комиссии");

		ДанныеДляСверки = Новый Структура;
		ДанныеДляСверки.Вставить("ЗаголовокОтчета", "Сверка с отчетом брокера ГПБ");
		ДанныеДляСверки.Вставить("ПараметрыОтчета", ПараметрыОтчета);
		ДанныеДляСверки.Вставить("НаборыДанных", НаборыДанных);
		ДанныеДляСверки.Вставить("Заголовки", Заголовки);
		
		Отчет = Новый ТабличныйДокумент;
		
		ЕстьРасхожденияПоНаборамДанных = Неопределено;
		Расхождения = РаботаСОтчетами.ЗаполнитьОтчетОРасхожденияхНаборовДанных(ДанныеДляСверки, Отчет, ЕстьРасхожденияПоНаборамДанных, Истина);
		
		МассивОтчетовСверки.Добавить(Новый Структура("ИмяФайла, СчетДоверительногоУправления, ЕстьРасхожденияПоНаборамДанных, Отчет", ЭлементДанныеОтчета.ПараметрыОтчета.ИмяФайла, ПараметрыОтчета.СчетДоверительногоУправления, ЕстьРасхожденияПоНаборамДанных, Отчет));
		
		Если ОбщиеПараметры.ФиксироватьРезультатСверки Тогда
			
			#Область Добавление_результата_сверки_с_файлом
			
			// сверка успешна, если нет расхождений по д/с

			ОтсутствуютРасхождения	= Не ЕстьРасхожденияПоНаборамДанных;
			СверкаПройденаУспешно	= ОтсутствуютРасхождения;
			Примечание				= "";

			Если ЗначениеЗаполнено(Расхождения) Тогда
				
				НаборыДанных = Новый Соответствие;
				
				// Получим уникальную структуру расхождений по "Набор данных + Поле"
				
				Для Каждого СтрокаРасхождения Из Расхождения Цикл
					ЗаголовокНабораДанных = СтрокаРасхождения.НаборДанных.Заголовок;
					
					НаборДанных = НаборыДанных.Получить(ЗаголовокНабораДанных);
					Если НаборДанных = Неопределено Тогда
						НаборыДанных.Вставить(ЗаголовокНабораДанных, Новый Соответствие);
						НаборДанных = НаборыДанных.Получить(ЗаголовокНабораДанных);
					КонецЕсли;
					
					ПолеРасхождения = НаборДанных.Получить(СтрокаРасхождения.ЗаголовокПоля);
					Если ПолеРасхождения = Неопределено Тогда
						НаборДанных.Вставить(СтрокаРасхождения.ЗаголовокПоля, СтрокаРасхождения.ЗаголовокПоля);
					КонецЕсли;
				КонецЦикла;
				
				СверкаПройденаУспешно = (НаборыДанных.Получить("Остатки денежных средств") = Неопределено);
				
				Если Не СверкаПройденаУспешно Тогда
					
					НаборДанных = НаборыДанных.Получить("Остатки денежных средств");
					
					Если ВалютаРубли = Неопределено Тогда
						ВалютаРубли = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
					КонецЕсли;
					
					Примечание = СтрШаблон("Расхождения по остаткам денежных средств %1(", ?(ПараметрыОтчета.ВалютаРасчетов = ВалютаРубли, "", Строка(ПараметрыОтчета.ВалютаРасчетов) + " "));
					Для Каждого ПолеРасхождения Из НаборДанных Цикл
						Примечание = Примечание + ПолеРасхождения.Ключ + ", ";
					КонецЦикла;
					Примечание = Лев(Примечание, СтрДлина(Примечание) - 2) + ")";
					
				КонецЕсли;
				
			КонецЕсли;	

			// Запоминаем результаты сверки
		
			Если ТаблицаСверки = Неопределено Тогда	
				
				ТаблицаСверки = Новый ТаблицаЗначений;
				ТаблицаСверки.Колонки.Добавить("СчетДоверительногоУправления",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
				ТаблицаСверки.Колонки.Добавить("СверкаПройденаУспешно",			Новый ОписаниеТипов("Булево"));
				ТаблицаСверки.Колонки.Добавить("ОтсутствуютРасхождения",		Новый ОписаниеТипов("Булево"));
				ТаблицаСверки.Колонки.Добавить("Примечание",					Новый ОписаниеТипов("Строка"));
				
			КонецЕсли;
			
			СтрокаСверки = ТаблицаСверки.Добавить();
			СтрокаСверки.СчетДоверительногоУправления	= ПараметрыОтчета.СчетДоверительногоУправления;
			СтрокаСверки.СверкаПройденаУспешно			= СверкаПройденаУспешно;
			СтрокаСверки.ОтсутствуютРасхождения			= ОтсутствуютРасхождения;
			СтрокаСверки.Примечание						= Примечание;

			#КонецОбласти
			
		КонецЕсли;

	КонецЦикла;
	
	РезультатВыполнения.Вставить("МассивОтчетовСверки", МассивОтчетовСверки);
	
	Если ОбщиеПараметры.ФиксироватьРезультатСверки И ТаблицаСверки <> Неопределено Тогда

		// Соберем всю информацию по результатам сверки.
		// Если есть расхождения или время сверки раньше времени внесения,
		// сначала спросим у пользователя перед фиксацией
		
		РезультатыСверки = Новый Структура("НепрошедшиеСверку, ИмеющиеРасхождения, ИмеющиеОперацииПозжеВремениСверки", Новый Массив, Новый Массив, Новый Массив);
	
		#Область Итог_сверки_по_счетам_внутреннего_учета
		
		ИтоговаяТаблицаСверки = ТаблицаСверки.СкопироватьКолонки();
		ИтоговаяТаблицаСверки.Колонки.Добавить("НеподтвержденныеОперации",						Новый ОписаниеТипов("ТаблицаЗначений"));
		ИтоговаяТаблицаСверки.Колонки.Добавить("НеподтвержденныеОперацииПозжеВремениСверки",	Новый ОписаниеТипов("ТаблицаЗначений"));
		
		МВТ = Новый МенеджерВременныхТаблиц;
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСверки, "_ТаблицаСверки", МВТ);
		
		ВыборкаПоТаблицеСверки = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(МВТ, "_ТаблицаСверки", , , , , "СчетДоверительногоУправления", "МИНИМУМ(СверкаПройденаУспешно), МИНИМУМ(ОтсутствуютРасхождения)").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоТаблицеСверки.Следующий() Цикл
			
			СтрокаСверки = ИтоговаяТаблицаСверки.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаСверки, ВыборкаПоТаблицеСверки, , "Примечание");
				
			// При отсутствии расхождений с файлами получаем неподтвержденные операции,
			// а при наличии - отображаем их в примечании
			
			Если СтрокаСверки.ОтсутствуютРасхождения Тогда 
				
				СтрокаСверки.НеподтвержденныеОперации					= РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьНеподтвержденныеОперацииСБрокером(ОбщиеПараметры.Организация, СтрокаСверки.СчетДоверительногоУправления, ОбщиеПараметры.Брокер, ОбщиеПараметры.ДатаСверки, КонецДня(ОбщиеПараметры.ДатаСверки), Истина);
				СтрокаСверки.НеподтвержденныеОперацииПозжеВремениСверки	= РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ОперацииВнесенныеПозднее(СтрокаСверки.НеподтвержденныеОперации, ОбщиеПараметры.ВремяСверки); 
				
			Иначе
				
				Примечания = Новый Массив;
				
				ВыборкаПоПримечанию = ВыборкаПоТаблицеСверки.Выбрать();
				Пока ВыборкаПоПримечанию.Следующий() И Не ПустаяСтрока(ВыборкаПоПримечанию.Примечание) Цикл
					Примечания.Добавить(ВыборкаПоПримечанию.Примечание); 	
				КонецЦикла;

				СтрокаСверки.Примечание = СтрСоединить(Примечания, "; ");
				
			КонецЕсли;	
			
			Если Не СтрокаСверки.СверкаПройденаУспешно Тогда
				РезультатыСверки.НепрошедшиеСверку.Добавить(СтрокаСверки.СчетДоверительногоУправления);
			КонецЕсли;

			Если Не СтрокаСверки.ОтсутствуютРасхождения Тогда
				РезультатыСверки.ИмеющиеРасхождения.Добавить(СтрокаСверки.СчетДоверительногоУправления);
			КонецЕсли;

			Если СтрокаСверки.НеподтвержденныеОперацииПозжеВремениСверки.Количество() > 0 Тогда
				РезультатыСверки.ИмеющиеОперацииПозжеВремениСверки.Добавить(СтрокаСверки.СчетДоверительногоУправления);
			КонецЕсли;
		
		КонецЦикла;
		
		РезультатыСверки.Вставить("ТаблицаСверки", ПоместитьВоВременноеХранилище(ИтоговаяТаблицаСверки, ОбщиеПараметры.УникальныйИдентификаторФормы));		
		
		#КонецОбласти
		
		РезультатВыполнения.Вставить("РезультатыСверки", РезультатыСверки);
	
	КонецЕсли;
	
	#КонецОбласти

	#Область Счета_ДУ_без_отчета_брокера

	ПараметрыОтчетаОтсутствующихФайловБрокера = Новый Структура("Организация, Брокер, СверяемыеСчетаДоверительногоУправления, НачалоПериодаОтчета, КонецПериодаОтчета", ОбщиеПараметры.Организация, ОбщиеПараметры.Брокер, ОбщиеПараметры.СверяемыеСчетаДоверительногоУправления, НачалоДня(ОбщиеПараметры.ДатаСверки), КонецДня(ОбщиеПараметры.ДатаСверки));
	
	ОтчетОтсутствующихФайловБрокера = ПолучитьОтчетОтсутствующихФайловБрокера(ПараметрыОтчетаОтсутствующихФайловБрокера);

	РезультатВыполнения.Вставить("ОтчетОтсутствующихФайловБрокера", ОтчетОтсутствующихФайловБрокера);
	
	#КонецОбласти

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии("Сверка с брокером ГПБ. (СверитьДанныеОтчетовБрокера)", Сессия);

	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмпортироватьКомиссиюБрокера(ДанныеОтчетовБрокера, ОбщиеПараметры, ИзмененияНачисленийЗадолженности, ИзмененияОплат)
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбщиеПараметры, "Организация, Брокер, ДатаСверки, ВремяСверки, ФиксироватьРезультатСверки");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		"Сверка с брокером ГПБ. (ИмпортироватьКомиссиюБрокера)",
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	СтруктураТаблицыКомиссииБрокера = ПолучитьСтруктуруТаблицы("КомиссияБрокера");
	ТаблицаДанных = Неопределено;
		
	Для Каждого ЭлементДанныеОтчета Из ДанныеОтчетовБрокера Цикл
		
		Если ЭлементДанныеОтчета.Операции <> Неопределено И ЭлементДанныеОтчета.Операции.Свойство("Сделки") Тогда  
		
			ДанныеОтчета = ПреобразоватьМассивСтруктурВТаблицуЗначений(СтруктураТаблицыКомиссииБрокера, ЭлементДанныеОтчета.Операции.Сделки, ЭлементДанныеОтчета.ПараметрыОтчета); 
			
			Если ТаблицаДанных = Неопределено Тогда
				ТаблицаДанных = ДанныеОтчета;  	
		    Иначе 
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДанныеОтчета, ТаблицаДанных);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаДанных <> Неопределено И ТаблицаДанных.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	#Область ТЕКСТ_ЗАПРОСА
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДанных.ИмяФайла КАК ИмяФайла,
			|	ТаблицаДанных.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
			|	ТаблицаДанных.ИмяЗаписи КАК ИмяЗаписи,
			|	ТаблицаДанных.ДатаСделки КАК ДатаСделки,
			|	ТаблицаДанных.НомерСделки КАК НомерСделки,
			|	ТаблицаДанных.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	ТаблицаДанных.ВидСделки КАК ВидСделки,
			|	ТаблицаДанных.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	ТаблицаДанных.КодЦеннойБумаги КАК КодЦеннойБумаги,
			|	ТаблицаДанных.ИмяМестаХранения КАК ИмяМестаХранения,
			|	ТаблицаДанных.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
			|	ТаблицаДанных.КомиссияБрокера КАК Сумма,
			|	ТаблицаДанных.ДатаОплатыКомиссии КАК ДатаОплаты
			|ПОМЕСТИТЬ _ТаблицаДанных
			|ИЗ
			|	&ТаблицаДанных КАК ТаблицаДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДанных.ИмяФайла КАК ИмяФайла,
			|	_ТаблицаДанных.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
			|	_ТаблицаДанных.ИмяЗаписи КАК ИмяЗаписи,
			|	_ТаблицаДанных.ДатаСделки КАК ДатаСделки,
			|	_ТаблицаДанных.НомерСделки КАК НомерСделки,
			|	_ТаблицаДанных.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	_ТаблицаДанных.ВидСделки КАК ВидСделки,
			|	_ТаблицаДанных.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	_ТаблицаДанных.КодЦеннойБумаги КАК КодЦеннойБумаги,
			|	_ТаблицаДанных.ИмяМестаХранения КАК ИмяМестаХранения,
			|	_ТаблицаДанных.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
			|	_ТаблицаДанных.Сумма КАК Сумма,
			|	_ТаблицаДанных.ДатаОплаты КАК ДатаОплаты
			|ПОМЕСТИТЬ _ДанныеФайлов
			|ИЗ
			|	_ТаблицаДанных КАК _ТаблицаДанных
			|ГДЕ
			|	_ТаблицаДанных.ЧастьСделкиРЕПО В (0, 1)
			|	И _ТаблицаДанных.Сумма > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Акции.Ссылка КАК Ссылка,
			|	Акции.ГосударственныйРегистрационныйНомер КАК ГосРегНомер
			|ПОМЕСТИТЬ _ЦенныеБумаги
			|ИЗ
			|	Справочник.Акции КАК Акции
			|ГДЕ
			|	Акции.ГосударственныйРегистрационныйНомер В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Данные.КодЦеннойБумаги
			|			ИЗ
			|				_ДанныеФайлов КАК _Данные)
			|	И Акции.ПометкаУдаления = ЛОЖЬ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Облигации.Ссылка,
			|	Облигации.ГосударственныйРегистрационныйНомер
			|ИЗ
			|	Справочник.Облигации КАК Облигации
			|ГДЕ
			|	Облигации.ГосударственныйРегистрационныйНомер В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Данные.КодЦеннойБумаги
			|			ИЗ
			|				_ДанныеФайлов КАК _Данные)
			|	И Облигации.ПометкаУдаления = ЛОЖЬ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Паи.Ссылка,
			|	Паи.ГосударственныйРегистрационныйНомер
			|ИЗ
			|	Справочник.Паи КАК Паи
			|ГДЕ
			|	Паи.ГосударственныйРегистрационныйНомер В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Данные.КодЦеннойБумаги
			|			ИЗ
			|				_ДанныеФайлов КАК _Данные)
			|	И Паи.ПометкаУдаления = ЛОЖЬ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИпотечныеСертификатыУчастия.Ссылка,
			|	ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер
			|ИЗ
			|	Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
			|ГДЕ
			|	ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_Данные.КодЦеннойБумаги
			|			ИЗ
			|				_ДанныеФайлов КАК _Данные)
			|	И ИпотечныеСертификатыУчастия.ПометкаУдаления = ЛОЖЬ
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	КодыВТорговыхСистемахСрезПоследних.Объект,
			|	КодыВТорговыхСистемахСрезПоследних.Код
			|ИЗ
			|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
			|			&ДатаСверки,
			|			ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
			|ГДЕ
			|	КодыВТорговыхСистемахСрезПоследних.Код В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_Данные.КодЦеннойБумаги
			|					ИЗ
			|						_ДанныеФайлов КАК _Данные)	
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДанныеФайлов.ИмяФайла КАК ИмяФайла,
			|	_ДанныеФайлов.ИмяЗаписи КАК ИмяЗаписи,
			|	_ДанныеФайлов.ДатаСделки КАК ДатаСделки,
			|	_ДанныеФайлов.НомерСделки КАК НомерСделки,
			|	ВЫБОР
			|		КОГДА _ДанныеФайлов.ИмяЗаписи В (""Сделка"", ""ИсполнениеОбязательствПоСделке"")
			|			ТОГДА Сделка.Ссылка
			|		КОГДА _ДанныеФайлов.ИмяЗаписи = ""СделкаРЕПО""
			|			ТОГДА СделкаРЕПО.Ссылка
			|	КОНЕЦ КАК Основание,
			|	_ДанныеФайлов.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	_ДанныеФайлов.ВидСделки КАК ВидСделки,
			|	_ДанныеФайлов.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	_ДанныеФайлов.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДанныеФайлов.КодЦеннойБумаги КАК КодЦеннойБумаги,
			|	_ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
			|	_ДанныеФайлов.ИмяМестаХранения КАК ИмяМестаХранения,
			|	ИменованныеОбъекты.Объект КАК МестоХранения,
			|	_ДанныеФайлов.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
			|	Валюты.Ссылка КАК Валюта,
			|	_ДанныеФайлов.Сумма КАК Сумма,
			|	_ДанныеФайлов.ДатаОплаты КАК ДатаОплаты
			|ПОМЕСТИТЬ _ОбщиеДанные
			|ИЗ
			|	_ДанныеФайлов КАК _ДанныеФайлов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
			|		ПО (РАЗНОСТЬДАТ(_ДанныеФайлов.ДатаСделки, Сделка.Дата, ДЕНЬ) = 0)
			|			И _ДанныеФайлов.ВидСделки = Сделка.ВидСделки
			|			И _ДанныеФайлов.НомерСделки = Сделка.НомерСделки
			|			И (_ДанныеФайлов.ИмяЗаписи В (""Сделка"", ""ИсполнениеОбязательствПоСделке""))
			|			И (Сделка.Организация = &Организация)
			|			И (Сделка.Брокер = &Брокер)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
			|		ПО (РАЗНОСТЬДАТ(_ДанныеФайлов.ДатаСделки, СделкаРЕПО.Дата, ДЕНЬ) = 0)
			|			И _ДанныеФайлов.ВидСделки = СделкаРЕПО.ВидСделки
			|			И _ДанныеФайлов.НомерСделки = СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
			|			И _ДанныеФайлов.ЧастьСделкиРЕПО = СделкаРЕПО.ЧастьСделкиРЕПО
			|			И (_ДанныеФайлов.ИмяЗаписи = ""СделкаРЕПО"")
			|			И (СделкаРЕПО.Организация = &Организация)
			|			И (СделкаРЕПО.Брокер = &Брокер)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
			|		ПО _ДанныеФайлов.ИмяМестаХранения = ИменованныеОбъекты.Имя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|				&ДатаСверки,
			|				Организация = &Организация
			|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|		ПО _ДанныеФайлов.КодСчетаДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
			|		ПО _ДанныеФайлов.ИмяВалютыРасчетов = Валюты.Наименование
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумаги КАК _ЦенныеБумаги
			|		ПО _ДанныеФайлов.КодЦеннойБумаги = _ЦенныеБумаги.ГосРегНомер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбщиеДанные.ИмяФайла КАК ИмяФайла,
			|	_ОбщиеДанные.НомерСделки КАК ПараметрОшибки,
			|	ВЫБОР
			|		КОГДА _ОбщиеДанные.ИмяЗаписи = ""СделкаРЕПО""
			|			ТОГДА ""Не удалось найти сделку Репо (1 ч.) по номеру сделки с центральным контрагентом ""
			|		ИНАЧЕ ""Не удалось найти сделку по номеру ""
			|	КОНЕЦ + "" [%1]. Файл [%2]"" КАК ТекстОшибки
			|ПОМЕСТИТЬ _ОшибкиДанных
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|ГДЕ
			|	_ОбщиеДанные.Основание ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.КодСчетаДоверительногоУправления,
			|	""Не удалось определить счет доверительного управления по коду у брокера [%1]. Файл [%2]""
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|ГДЕ
			|	_ОбщиеДанные.КодСчетаДоверительногоУправления ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.КодЦеннойБумаги,
			|	""Не удалось определить ценную бумагу по коду [%1]. Файл [%2]""
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|ГДЕ
			|	_ОбщиеДанные.ЦеннаяБумага ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.ИмяМестаХранения,
			|	""Не удалось определить место хранения по имени именованного объекта [%1]. Файл [%2]""
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|ГДЕ
			|	_ОбщиеДанные.МестоХранения ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.ИмяВалютыРасчетов,
			|	""Не удалось определить валюту по наименованию [%1]. Файл [%2]""
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|ГДЕ
			|	_ОбщиеДанные.Валюта ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.КодЦеннойБумаги,
			|	""По коду [%1] найдено несколько ценных бумаг. Файл [%2]""
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_ЦенныеБумаги.ГосРегНомер КАК ГосРегНомер,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЦенныеБумаги.Ссылка) КАК Количество
			|		ИЗ
			|			_ЦенныеБумаги КАК _ЦенныеБумаги
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ЦенныеБумаги.ГосРегНомер
			|		
			|		ИМЕЮЩИЕ
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЦенныеБумаги.Ссылка) > 1) КАК ВложенныйЗапрос
			|		ПО _ОбщиеДанные.КодЦеннойБумаги = ВложенныйЗапрос.ГосРегНомер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ОбщиеДанные.ИмяФайла КАК ИмяФайла,
			|	&ДатаСверки КАК Дата,
			|	_ОбщиеДанные.ИмяЗаписи КАК ИмяЗаписи,
			|	_ОбщиеДанные.ДатаСделки КАК ДатаСделки,
			|	_ОбщиеДанные.НомерСделки КАК НомерСделки,
			|	_ОбщиеДанные.Основание КАК Основание,
			|	_ОбщиеДанные.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	_ОбщиеДанные.ВидСделки КАК ВидСделки,
			|	_ОбщиеДанные.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	_ОбщиеДанные.КодСчетаДоверительногоУправления КАК КодСчетаДоверительногоУправления,
			|	_ОбщиеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ОбщиеДанные.КодЦеннойБумаги КАК КодЦеннойБумаги,
			|	_ОбщиеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ОбщиеДанные.ИмяМестаХранения КАК ИмяМестаХранения,
			|	_ОбщиеДанные.МестоХранения КАК МестоХранения,
			|	_ОбщиеДанные.ИмяВалютыРасчетов КАК ИмяВалютыРасчетов,
			|	_ОбщиеДанные.Валюта КАК Валюта,
			|	СУММА(_ОбщиеДанные.Сумма) КАК Сумма,
			|	_ОбщиеДанные.ДатаОплаты КАК ДатаОплаты,
			|	ВЫРАЗИТЬ(&Брокер КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеДляФормированияДокументов
			|ИЗ
			|	_ОбщиеДанные КАК _ОбщиеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиДанных КАК _ОшибкиДанных
			|		ПО _ОбщиеДанные.ИмяФайла = _ОшибкиДанных.ИмяФайла
			|ГДЕ
			|	_ОшибкиДанных.ИмяФайла ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	_ОбщиеДанные.КодСчетаДоверительногоУправления,
			|	_ОбщиеДанные.ИмяЗаписи,
			|	_ОбщиеДанные.ОтложенноеИсполнение,
			|	_ОбщиеДанные.ДатаСделки,
			|	_ОбщиеДанные.Основание,
			|	_ОбщиеДанные.ЧастьСделкиРЕПО,
			|	_ОбщиеДанные.СчетДоверительногоУправления,
			|	_ОбщиеДанные.КодЦеннойБумаги,
			|	_ОбщиеДанные.ВидСделки,
			|	_ОбщиеДанные.ЦеннаяБумага,
			|	_ОбщиеДанные.Валюта,
			|	_ОбщиеДанные.ИмяМестаХранения,
			|	_ОбщиеДанные.ИмяФайла,
			|	_ОбщиеДанные.ИмяВалютыРасчетов,
			|	_ОбщиеДанные.НомерСделки,
			|	_ОбщиеДанные.МестоХранения,
			|	_ОбщиеДанные.ДатаОплаты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДОБАВИТЬКДАТЕ(_ДанныеДляФормированияДокументов.Дата, СЕКУНДА, 68399) КАК Дата,
			|	_ДанныеДляФормированияДокументов.Основание КАК Основание,
			|	_ДанныеДляФормированияДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДанныеДляФормированияДокументов.МестоХранения КАК МестоХранения,
			|	НАЧАЛОПЕРИОДА(_ДанныеДляФормированияДокументов.ДатаОплаты, ДЕНЬ) КАК ДатаОплаты,
			|	_ДанныеДляФормированияДокументов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ДанныеДляФормированияДокументов.Валюта КАК Валюта,
			|	_ДанныеДляФормированияДокументов.Сумма КАК Сумма,
			|	_ДанныеДляФормированияДокументов.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ _НачисленияЗадолженности
			|ИЗ
			|	_ДанныеДляФормированияДокументов КАК _ДанныеДляФормированияДокументов
			|ГДЕ
			|	_ДанныеДляФормированияДокументов.ИмяЗаписи В (""Сделка"", ""СделкаРЕПО"")
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДОБАВИТЬКДАТЕ(_ДанныеДляФормированияДокументов.Дата, СЕКУНДА, 68400) КАК Дата,
			|	_ДанныеДляФормированияДокументов.Основание КАК Основание,
			|	_ДанныеДляФормированияДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДанныеДляФормированияДокументов.МестоХранения КАК МестоХранения,
			|	_ДанныеДляФормированияДокументов.ДатаОплаты КАК ДатаОплаты,
			|	_ДанныеДляФормированияДокументов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ДанныеДляФормированияДокументов.Валюта КАК Валюта,
			|	_ДанныеДляФормированияДокументов.Валюта КАК ВалютаОплаты,
			|	_ДанныеДляФормированияДокументов.Сумма КАК Сумма,
			|	_ДанныеДляФормированияДокументов.Сумма КАК СуммаОплаты,
			|	_ДанныеДляФормированияДокументов.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ _Оплаты
			|ИЗ
			|	_ДанныеДляФормированияДокументов КАК _ДанныеДляФормированияДокументов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаБэкОфиса.СрезПоследних(
			|				&ДатаСверки,
			|				Брокер = &Брокер
			|					И Организация = &Организация) КАК НастройкиУчетаБэкОфисаСрезПоследних
			|		ПО (ИСТИНА)
			|ГДЕ
			|	(_ДанныеДляФормированияДокументов.ИмяЗаписи В (""Сделка"", ""СделкаРЕПО"")
			|				И НЕ _ДанныеДляФормированияДокументов.ОтложенноеИсполнение
			|			ИЛИ _ДанныеДляФормированияДокументов.ИмяЗаписи В (""Сделка"", ""СделкаРЕПО"")
			|				И _ДанныеДляФормированияДокументов.ОтложенноеИсполнение
			|				И НЕ ЕСТЬNULL(НастройкиУчетаБэкОфисаСрезПоследних.СписаниеКомиссииБрокераПриИсполненииОтложеннойСделки, ЛОЖЬ)
			|			ИЛИ _ДанныеДляФормированияДокументов.ИмяЗаписи = ""ИсполнениеОбязательствПоСделке""
			|				И ЕСТЬNULL(НастройкиУчетаБэкОфисаСрезПоследних.СписаниеКомиссииБрокераПриИсполненииОтложеннойСделки, ЛОЖЬ))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеЗадолженности.Ссылка КАК Ссылка,
			|	НачислениеЗадолженности.Проведен КАК Проведен,
			|	НачислениеЗадолженности.Дата КАК Дата,
			|	НачислениеЗадолженности.Организация КАК Организация,
			|	НачислениеЗадолженности.МестоХранения КАК МестоХранения,
			|	НачислениеЗадолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НачислениеЗадолженности.Брокер КАК Брокер,
			|	НачислениеЗадолженностиОснования.НомерСтроки КАК НомерСтроки,
			|	НачислениеЗадолженностиОснования.Основание КАК Основание,
			|	НачислениеЗадолженностиОснования.ДатаОплаты КАК ДатаОплаты,
			|	НачислениеЗадолженностиОснования.ЦеннаяБумага КАК ЦеннаяБумага,
			|	НачислениеЗадолженностиОснования.Сумма КАК Сумма
			|ПОМЕСТИТЬ _НачисленияЗадолженностиТекущие
			|ИЗ
			|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
			|		ПО НачислениеЗадолженности.Ссылка = НачислениеЗадолженностиОснования.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ДанныеДляФормированияДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|		ИЗ
			|			_ДанныеДляФормированияДокументов КАК _ДанныеДляФормированияДокументов) КАК ВложенныйЗапрос
			|		ПО НачислениеЗадолженности.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(НачислениеЗадолженности.Дата, ДЕНЬ) = &ДатаСверки
			|	И НачислениеЗадолженности.Организация = &Организация
			|	И НачислениеЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|	И НачислениеЗадолженности.Брокер = &Брокер
			|	И НЕ НачислениеЗадолженности.ПометкаУдаления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Оплата.Ссылка КАК Ссылка,
			|	Оплата.Проведен КАК Проведен,
			|	Оплата.Дата КАК Дата,
			|	Оплата.Организация КАК Организация,
			|	Оплата.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	Оплата.Брокер КАК Брокер,
			|	Оплата.МестоХранения КАК МестоХранения,
			|	ОплатаОснования.НомерСтроки КАК НомерСтроки,
			|	ОплатаОснования.Основание КАК Основание,
			|	ОплатаОснования.Сумма КАК Сумма,
			|	ОплатаОснования.СуммаОплаты КАК СуммаОплаты
			|ПОМЕСТИТЬ _ОплатыТекущие
			|ИЗ
			|	Документ.Оплата КАК Оплата
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
			|		ПО Оплата.Ссылка = ОплатаОснования.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ДанныеДляФормированияДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|		ИЗ
			|			_ДанныеДляФормированияДокументов КАК _ДанныеДляФормированияДокументов) КАК ВложенныйЗапрос
			|		ПО Оплата.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(Оплата.Дата, ДЕНЬ) = &ДатаСверки
			|	И Оплата.Организация = &Организация
			|	И Оплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
			|	И Оплата.Брокер = &Брокер
			|	И НЕ Оплата.ПометкаУдаления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Ссылка КАК Ссылка,
			|	&Организация КАК Организация,
			|	_НачисленияЗадолженности.Дата КАК Дата,
			|	_НачисленияЗадолженности.Основание КАК Основание,
			|	_НачисленияЗадолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_НачисленияЗадолженности.МестоХранения КАК МестоХранения,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии) КАК ВидЗадолженности,
			|	&Брокер КАК Брокер,
			|	_НачисленияЗадолженности.ДатаОплаты КАК ДатаОплаты,
			|	_НачисленияЗадолженности.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_НачисленияЗадолженности.Валюта КАК Валюта,
			|	_НачисленияЗадолженности.Сумма КАК Сумма,
			|	_НачисленияЗадолженности.Контрагент КАК Контрагент,
			|	_НачисленияЗадолженности.Дата КАК ДатаПолученияДокумента,
			|	ЕСТЬNULL(_НачисленияЗадолженностиОснованияТекущие.НомерСтроки, """") КАК НомерСтроки
			|ПОМЕСТИТЬ _НовыеИзмененныеНачисленияЗадолженности
			|ИЗ
			|	_НачисленияЗадолженности КАК _НачисленияЗадолженности
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_НачисленияЗадолженностиТекущие.Ссылка КАК Ссылка,
			|			_НачисленияЗадолженностиТекущие.Проведен КАК ДокументПроведен,
			|			_НачисленияЗадолженностиТекущие.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_НачисленияЗадолженностиТекущие.МестоХранения КАК МестоХранения
			|		ИЗ
			|			_НачисленияЗадолженностиТекущие КАК _НачисленияЗадолженностиТекущие) КАК ВложенныйЗапрос
			|		ПО _НачисленияЗадолженности.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
			|			И _НачисленияЗадолженности.МестоХранения = ВложенныйЗапрос.МестоХранения
			|		ЛЕВОЕ СОЕДИНЕНИЕ _НачисленияЗадолженностиТекущие КАК _НачисленияЗадолженностиОснованияТекущие
			|		ПО _НачисленияЗадолженности.СчетДоверительногоУправления = _НачисленияЗадолженностиОснованияТекущие.СчетДоверительногоУправления
			|			И _НачисленияЗадолженности.МестоХранения = _НачисленияЗадолженностиОснованияТекущие.МестоХранения
			|			И _НачисленияЗадолженности.Основание = _НачисленияЗадолженностиОснованияТекущие.Основание
			|			И _НачисленияЗадолженности.ЦеннаяБумага = _НачисленияЗадолженностиОснованияТекущие.ЦеннаяБумага
			|ГДЕ
			|	(ВложенныйЗапрос.Ссылка ЕСТЬ NULL
			|			ИЛИ НЕ ВложенныйЗапрос.ДокументПроведен
			|			ИЛИ _НачисленияЗадолженности.Сумма <> ЕСТЬNULL(_НачисленияЗадолженностиОснованияТекущие.Сумма, 0)
			|			ИЛИ _НачисленияЗадолженности.ДатаОплаты <> ЕСТЬNULL(_НачисленияЗадолженностиОснованияТекущие.ДатаОплаты, 0))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_НачисленияЗадолженностиТекущие.Ссылка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_НачисленияЗадолженностиТекущие.СчетДоверительногоУправления,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_НачисленияЗадолженностиТекущие.НомерСтроки
			|ИЗ
			|	_НачисленияЗадолженностиТекущие КАК _НачисленияЗадолженностиТекущие
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_НачисленияЗадолженностиТекущие.Ссылка КАК Ссылка,
			|			_НачисленияЗадолженностиТекущие.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_НачисленияЗадолженностиТекущие.Основание КАК Основание,
			|			_НачисленияЗадолженностиТекущие.ЦеннаяБумага КАК ЦеннаяБумага,
			|			МИНИМУМ(_НачисленияЗадолженностиТекущие.НомерСтроки) КАК МинНомерСтрокиДублейОснований,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _НачисленияЗадолженностиТекущие.НомерСтроки) КАК КоличествоОснований
			|		ИЗ
			|			_НачисленияЗадолженностиТекущие КАК _НачисленияЗадолженностиТекущие
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_НачисленияЗадолженностиТекущие.Ссылка,
			|			_НачисленияЗадолженностиТекущие.СчетДоверительногоУправления,
			|			_НачисленияЗадолженностиТекущие.Основание,
			|			_НачисленияЗадолженностиТекущие.ЦеннаяБумага) КАК _НачисленияЗадолженностиОснованияТекущие
			|		ПО _НачисленияЗадолженностиТекущие.Ссылка = _НачисленияЗадолженностиОснованияТекущие.Ссылка
			|			И _НачисленияЗадолженностиТекущие.СчетДоверительногоУправления = _НачисленияЗадолженностиОснованияТекущие.СчетДоверительногоУправления
			|			И _НачисленияЗадолженностиТекущие.Основание = _НачисленияЗадолженностиОснованияТекущие.Основание
			|			И _НачисленияЗадолженностиТекущие.ЦеннаяБумага = _НачисленияЗадолженностиОснованияТекущие.ЦеннаяБумага
			|			И _НачисленияЗадолженностиТекущие.НомерСтроки > _НачисленияЗадолженностиОснованияТекущие.МинНомерСтрокиДублейОснований
			|		ЛЕВОЕ СОЕДИНЕНИЕ _НачисленияЗадолженности КАК _НачисленияЗадолженности
			|		ПО _НачисленияЗадолженностиТекущие.СчетДоверительногоУправления = _НачисленияЗадолженности.СчетДоверительногоУправления
			|			И _НачисленияЗадолженностиТекущие.МестоХранения = _НачисленияЗадолженности.МестоХранения
			|			И _НачисленияЗадолженностиТекущие.Основание = _НачисленияЗадолженности.Основание
			|			И _НачисленияЗадолженностиТекущие.ЦеннаяБумага = _НачисленияЗадолженности.ЦеннаяБумага
			|ГДЕ
			|	(_НачисленияЗадолженности.ЦеннаяБумага ЕСТЬ NULL
			|			ИЛИ _НачисленияЗадолженностиОснованияТекущие.КоличествоОснований > 1)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(_ОcнованияТекущие.НомерСтроки, """") КАК НомерСтроки,
			|	_Оплаты.Дата КАК Дата,
			|	&Организация КАК Организация,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход) КАК ВидДвижения,
			|	_Оплаты.Основание КАК Основание,
			|	_Оплаты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_Оплаты.МестоХранения КАК МестоХранения,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии) КАК ВидЗадолженности,
			|	&Брокер КАК Брокер,
			|	_Оплаты.ДатаОплаты КАК ДатаОплаты,
			|	_Оплаты.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Оплаты.Валюта КАК Валюта,
			|	_Оплаты.ВалютаОплаты КАК ВалютаОплаты,
			|	_Оплаты.Сумма КАК Сумма,
			|	_Оплаты.СуммаОплаты КАК СуммаОплаты,
			|	_Оплаты.Контрагент КАК Контрагент
			|ПОМЕСТИТЬ _НовыеИзмененныеОплаты
			|ИЗ
			|	_Оплаты КАК _Оплаты
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ОплатыТекущие.Ссылка КАК Ссылка,
			|			_ОплатыТекущие.Проведен КАК ДокументПроведен,
			|			_ОплатыТекущие.МестоХранения КАК МестоХранения,
			|			_ОплатыТекущие.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|		ИЗ
			|			_ОплатыТекущие КАК _ОплатыТекущие) КАК ВложенныйЗапрос
			|		ПО _Оплаты.МестоХранения = ВложенныйЗапрос.МестоХранения
			|			И _Оплаты.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыТекущие КАК _ОcнованияТекущие
			|		ПО _Оплаты.МестоХранения = _ОcнованияТекущие.МестоХранения
			|			И _Оплаты.СчетДоверительногоУправления = _ОcнованияТекущие.СчетДоверительногоУправления
			|			И _Оплаты.Основание = _ОcнованияТекущие.Основание
			|ГДЕ
			|	(ВложенныйЗапрос.Ссылка ЕСТЬ NULL
			|			ИЛИ НЕ ВложенныйЗапрос.ДокументПроведен
			|			ИЛИ _Оплаты.Сумма <> ЕСТЬNULL(_ОcнованияТекущие.Сумма, 0)
			|			ИЛИ _Оплаты.СуммаОплаты <> ЕСТЬNULL(_ОcнованияТекущие.СуммаОплаты, 0))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_ОплатыТекущие.Ссылка,
			|	_ОплатыТекущие.НомерСтроки,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	_Оплаты.СчетДоверительногоУправления,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL
			|ИЗ
			|	_ОплатыТекущие КАК _ОплатыТекущие
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ОплатыТекущие.Ссылка КАК Ссылка,
			|			_ОплатыТекущие.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_ОплатыТекущие.Основание КАК Основание,
			|			МИНИМУМ(_ОплатыТекущие.НомерСтроки) КАК МинНомерСтрокиДублейОснований,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ОплатыТекущие.НомерСтроки) КАК КоличествоОснований
			|		ИЗ
			|			_ОплатыТекущие КАК _ОплатыТекущие
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ОплатыТекущие.Ссылка,
			|			_ОплатыТекущие.СчетДоверительногоУправления,
			|			_ОплатыТекущие.Основание) КАК _ОcнованияТекущие
			|		ПО _ОплатыТекущие.Ссылка = _ОcнованияТекущие.Ссылка
			|			И _ОплатыТекущие.СчетДоверительногоУправления = _ОcнованияТекущие.СчетДоверительногоУправления
			|			И _ОплатыТекущие.Основание = _ОcнованияТекущие.Основание
			|			И _ОплатыТекущие.НомерСтроки > _ОcнованияТекущие.МинНомерСтрокиДублейОснований
			|		ЛЕВОЕ СОЕДИНЕНИЕ _Оплаты КАК _Оплаты
			|		ПО _ОплатыТекущие.МестоХранения = _Оплаты.МестоХранения
			|			И _ОплатыТекущие.СчетДоверительногоУправления = _Оплаты.СчетДоверительногоУправления
			|			И _ОплатыТекущие.Основание = _Оплаты.Основание
			|ГДЕ
			|	(_Оплаты.Основание ЕСТЬ NULL
			|			ИЛИ _ОcнованияТекущие.КоличествоОснований > 1)";		
#КонецОбласти

		Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
		Запрос.УстановитьПараметр("ДатаСверки", ОбщиеПараметры.ДатаСверки);
		Запрос.УстановитьПараметр("Организация", ОбщиеПараметры.Организация);
		Запрос.УстановитьПараметр("Брокер", ОбщиеПараметры.Брокер);
		
		Запрос.Выполнить();
		
		ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиДанных"].ПолучитьДанные().Выбрать();
		
		Пока ВыборкаОшибок.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибок.ТекстОшибки, ВыборкаОшибок.ПараметрОшибки, ВыборкаОшибок.ИмяФайла));
		КонецЦикла;
		
		НачисленияЗадолженности = Запрос.МенеджерВременныхТаблиц.Таблицы["_НовыеИзмененныеНачисленияЗадолженности"].ПолучитьДанные().Выгрузить();
		
		СчетаДоверительногоУправленияИзНачислений = НачисленияЗадолженности.Скопировать(,"СчетДоверительногоУправления");
		СчетаДоверительногоУправленияИзНачислений.Свернуть("СчетДоверительногоУправления");
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для Каждого СтрокаСчетаДоверительногоУправленияИзНачислений Из СчетаДоверительногоУправленияИзНачислений Цикл
			
			ТаблицаСтрокНачисленияЗадолженности = НачисленияЗадолженности.Скопировать(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления));
			
			ТаблицаСтрокНачисленияЗадолженности.Сортировать("НомерСтроки УБЫВ");
			
			ДокНачислениеЗадолженности = Неопределено;
			
			Для Каждого СтрокаНачисленияЗадолженности Из ТаблицаСтрокНачисленияЗадолженности Цикл
				
				Если ЗначениеЗаполнено(СтрокаНачисленияЗадолженности.Ссылка) Тогда
					
					Если ДокНачислениеЗадолженности = Неопределено Тогда
						ДокНачислениеЗадолженности = СтрокаНачисленияЗадолженности.Ссылка.ПолучитьОбъект();
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаНачисленияЗадолженности.НомерСтроки) Тогда
						
						Если ЗначениеЗаполнено(СтрокаНачисленияЗадолженности.Сумма) Тогда
							ДокНачислениеЗадолженности.Основания[СтрокаНачисленияЗадолженности.НомерСтроки - 1].Сумма = СтрокаНачисленияЗадолженности.Сумма;
							ДокНачислениеЗадолженности.Основания[СтрокаНачисленияЗадолженности.НомерСтроки - 1].ДатаОплаты = СтрокаНачисленияЗадолженности.ДатаОплаты;
						Иначе
							ДокНачислениеЗадолженности.Основания.Удалить(СтрокаНачисленияЗадолженности.НомерСтроки - 1);
						КонецЕсли;
							
					Иначе
						ЗаполнитьЗначенияСвойств(ДокНачислениеЗадолженности.Основания.Добавить(), СтрокаНачисленияЗадолженности); 
					КонецЕсли;
					
				Иначе
					
					Если ДокНачислениеЗадолженности = Неопределено Тогда
						
						ДокНачислениеЗадолженности = Документы.НачислениеЗадолженности.СоздатьДокумент();
					
						ЗаполнитьЗначенияСвойств(ДокНачислениеЗадолженности, СтрокаНачисленияЗадолженности);
						ДокНачислениеЗадолженности.Ответственный = РаботаСПользователями.ТекущийПользователь();
						ДокНачислениеЗадолженности.Комментарий = "Создан аппаратно-техническими средствами " + ТекущаяДата();
						
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ДокНачислениеЗадолженности.Основания.Добавить(), СтрокаНачисленияЗадолженности);
		
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДокНачислениеЗадолженности <> Неопределено Тогда
			
				Если РаботаСДокументами.ЗапретРедактированияДокумента(ДокНачислениеЗадолженности, ДокНачислениеЗадолженности, Ложь, Ложь) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон("Не удалось загрузить начисление задолженности по брокерской комиссии. У счета доверительного управления [%1] установлена дата запрета редактирования!", СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления));
				Иначе
							
					Если ДокНачислениеЗадолженности.Основания.Количество() = 0 Тогда
						
						Попытка
							
							ДокНачислениеЗадолженности = ДокНачислениеЗадолженности.Ссылка.ПолучитьОбъект();
							ДокНачислениеЗадолженности.УстановитьПометкуУдаления(Истина);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("[" + ДокНачислениеЗадолженности + "] помечен на удаление. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления + "].", ДокНачислениеЗадолженности);
							ИзмененияНачисленийЗадолженности = Истина;
							
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление [" + ДокНачислениеЗадолженности + "]. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления + "]. Система сообщает: " + ОписаниеОшибки());	
						КонецПопытки;
						
					Иначе
						
						НовыйДокументНачисление = ДокНачислениеЗадолженности.ЭтоНовый();
						
						Попытка
							
							ДокНачислениеЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(НовыйДокументНачисление, "Создан", "Изменен") +  " документ [" + ДокНачислениеЗадолженности + "]. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления + "].", ДокНачислениеЗадолженности);	
							ИзмененияНачисленийЗадолженности = Истина;
							
						Исключение
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось " + ?(НовыйДокументНачисление, "провести начисление задолженности по брокерской комиссии", "изменить документ [" + ДокНачислениеЗадолженности + "]") + "Счет [" + СтрокаСчетаДоверительногоУправленияИзНачислений.СчетДоверительногоУправления + "]. Система сообщает: " + ОписаниеОшибки());
							
							Если НовыйДокументНачисление Тогда 
								ДокНачислениеЗадолженности.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли;
							
						КонецПопытки;
						
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
			
		Оплаты = Запрос.МенеджерВременныхТаблиц.Таблицы["_НовыеИзмененныеОплаты"].ПолучитьДанные().Выгрузить();
		
		СчетаДоверительногоУправленияИзОплат = Оплаты.Скопировать(,"СчетДоверительногоУправления");
		СчетаДоверительногоУправленияИзОплат.Свернуть("СчетДоверительногоУправления");
			
		Для Каждого СтрокаСчетаДоверительногоУправленияИзОплат Из СчетаДоверительногоУправленияИзОплат Цикл
			
			ТаблицаСтрокОплатБрокерскойКомисссии = Оплаты.Скопировать(Новый Структура("СчетДоверительногоУправления", СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления));
			
			ТаблицаСтрокОплатБрокерскойКомисссии.Сортировать("НомерСтроки УБЫВ");

			ДокОплата = Неопределено;
			
			Для Каждого СтрокаОплатыБрокерскойКомиссии Из ТаблицаСтрокОплатБрокерскойКомисссии Цикл
				
				Если ЗначениеЗаполнено(СтрокаОплатыБрокерскойКомиссии.Ссылка) Тогда
					
					Если ДокОплата = Неопределено Тогда
						ДокОплата = СтрокаОплатыБрокерскойКомиссии.Ссылка.ПолучитьОбъект();
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаОплатыБрокерскойКомиссии.НомерСтроки) Тогда
						
						Если ЗначениеЗаполнено(СтрокаОплатыБрокерскойКомиссии.Сумма) Или ЗначениеЗаполнено(СтрокаОплатыБрокерскойКомиссии.СуммаОплаты) Тогда
						
							ДокОплата.Основания[СтрокаОплатыБрокерскойКомиссии.НомерСтроки - 1].Сумма = СтрокаОплатыБрокерскойКомиссии.Сумма;
							ДокОплата.Основания[СтрокаОплатыБрокерскойКомиссии.НомерСтроки - 1].СуммаОплаты = СтрокаОплатыБрокерскойКомиссии.СуммаОплаты;
							
						Иначе
							ДокОплата.Основания.Удалить(СтрокаОплатыБрокерскойКомиссии.НомерСтроки - 1);		
						КонецЕсли;
						
					Иначе
						ЗаполнитьЗначенияСвойств(ДокОплата.Основания.Добавить(), СтрокаОплатыБрокерскойКомиссии); 
					КонецЕсли;
					
				Иначе
					
					Если ДокОплата = Неопределено Тогда
						
						ДокОплата = Документы.Оплата.СоздатьДокумент();
					
						ЗаполнитьЗначенияСвойств(ДокОплата, СтрокаОплатыБрокерскойКомиссии);
						ДокОплата.Ответственный = РаботаСПользователями.ТекущийПользователь();
						ДокОплата.Комментарий = "Создан аппаратно-техническими средствами " + ТекущаяДата();
						
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ДокОплата.Основания.Добавить(), СтрокаОплатыБрокерскойКомиссии);
		
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДокОплата <> Неопределено Тогда
			
				Если РаботаСДокументами.ЗапретРедактированияДокумента(ДокОплата, ДокОплата, Ложь, Ложь) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон("Не удалось загрузить оплату комиссии брокера. У счета доверительного управления [%1] установлена дата запрета редактирования!", СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления ));
				Иначе
					
					Если ДокОплата.Основания.Количество() = 0 Тогда
						
						Попытка
							
							ДокОплата = ДокОплата.Ссылка.ПолучитьОбъект();
							ДокОплата.УстановитьПометкуУдаления(Истина);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("[" + ДокОплата + "] помечен на удаление. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления + "].", ДокОплата);
							ИзмененияОплат = Истина;
							
						Исключение
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление [" + ДокОплата + "]. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления + "]. Система сообщает: " + ОписаниеОшибки());	
												
						КонецПопытки;

					Иначе
						
						НовыйДокументОплата = ДокОплата.ЭтоНовый();
						
						Попытка
							
							ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(НовыйДокументОплата, "Создан", "Изменен") + " документ [" + ДокОплата + "]. Счет доверительного управления [" + СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления + "].", ДокОплата);
							ИзмененияОплат = Истина;
							
						Исключение
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось " + ?(НовыйДокументОплата, "провести оплату по брокерской комиссии", "изменить документ [" + ДокОплата + "]") + ". Счет [" + СтрокаСчетаДоверительногоУправленияИзОплат.СчетДоверительногоУправления + "]. Система сообщает: " + ОписаниеОшибки());
							
							Если НовыйДокументОплата Тогда 
								ДокОплата.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли;
							
						КонецПопытки;
						
					КонецЕсли;
			
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
				
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии("Сверка с брокером ГПБ. (ИмпортироватьКомиссиюБрокера)", Сессия);

	Возврат СверитьДанныеОтчетовБрокера(ДанныеОтчетовБрокера, ОбщиеПараметры);
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПреобразоватьМассивСтруктурВТаблицуЗначений(КолонкиТаблицы, СодержимоеТаблицы, Параметры = Неопределено)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Для каждого КлючЗнач Из КолонкиТаблицы Цикл
		ТаблицаЗначений.Колонки.Добавить(КлючЗнач.Ключ, КлючЗнач.Значение);
	КонецЦикла;
	
	Для каждого ЭлементСодержимоеТаблицы Из СодержимоеТаблицы Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементСодержимоеТаблицы);
		
		Если Параметры <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
		КонецЕсли;

	КонецЦикла;
		
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруТаблицы(ИмяТаблицы)
	
	СтруктураТаблицы = Новый Структура();
	
	СтруктураТаблицы.Вставить("ИмяФайла", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(275)));
	СтруктураТаблицы.Вставить("ИмяМестаХранения", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	СтруктураТаблицы.Вставить("КодСчетаДоверительногоУправления", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	СтруктураТаблицы.Вставить("ИмяВалютыРасчетов", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	СтруктураТаблицы.Вставить("ИмяЗаписи", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));

	Если ИмяТаблицы = "Сделки" Тогда
	
		СделкаМД = Метаданные.Документы.Сделка;
		
		СтруктураТаблицы.Вставить("НомерСделки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(16)));
		СтруктураТаблицы.Вставить("ДатаСделки", Новый ОписаниеТипов("Дата"));
		СтруктураТаблицы.Вставить("КодЦеннойБумаги", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		СтруктураТаблицы.Вставить("ВидСделки", СделкаМД.Реквизиты.ВидСделки.Тип);
		СтруктураТаблицы.Вставить("БумагиКоличество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		
		СтруктураТаблицы.Вставить("СуммаСделки", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		СтруктураТаблицы.Вставить("Купон", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		СтруктураТаблицы.Вставить("КомиссияБрокера", Метаданные.ОпределяемыеТипы.СуммаКомиссии.Тип);
		СтруктураТаблицы.Вставить("ТорговаяКомиссия", Метаданные.ОпределяемыеТипы.СуммаКомиссии.Тип);
		СтруктураТаблицы.Вставить("ЧастьСделкиРЕПО", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1)));
		
		СтруктураТаблицы.Вставить("СтавкаРЕПО", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 4)));
		СтруктураТаблицы.Вставить("ОтложенноеИсполнение", Новый ОписаниеТипов("Булево"));
		СтруктураТаблицы.Вставить("ДатаИсполнения", Новый ОписаниеТипов("Дата"));
			
	ИначеЕсли ИмяТаблицы = "ЗадолженностиПоСделкам" Тогда
		
		СделкаМД = Метаданные.Документы.Сделка;
	
		СтруктураТаблицы.Вставить("НомерСделки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(16)));
		СтруктураТаблицы.Вставить("ДатаСделки", Новый ОписаниеТипов("Дата"));
		СтруктураТаблицы.Вставить("КодЦеннойБумаги", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		СтруктураТаблицы.Вставить("ВидСделки", СделкаМД.Реквизиты.ВидСделки.Тип);
		СтруктураТаблицы.Вставить("СуммаЗадолженностиПоСделке", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		
		СтруктураТаблицы.Вставить("СуммаЗадолженностиПоКупону", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СтруктураТаблицы.Вставить("КоличествоЗадолженностиПоБумагам", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		СтруктураТаблицы.Вставить("СуммаЗадолженностиПоТорговойКомиссии", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СтруктураТаблицы.Вставить("СуммаЗадолженностиПоБрокерскойКомиссии", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		
	ИначеЕсли ИмяТаблицы = "КомиссияБрокера" Тогда
		
		СделкаМД = Метаданные.Документы.Сделка;
		 
		СтруктураТаблицы.Вставить("ДатаСделки", Новый ОписаниеТипов("Дата"));
		СтруктураТаблицы.Вставить("НомерСделки", СделкаМД.Реквизиты.НомерСделки.Тип);
		СтруктураТаблицы.Вставить("ЧастьСделкиРЕПО", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)));
		СтруктураТаблицы.Вставить("ВидСделки", СделкаМД.Реквизиты.ВидСделки.Тип);
		
		СтруктураТаблицы.Вставить("ОтложенноеИсполнение", Новый ОписаниеТипов("Булево"));
		СтруктураТаблицы.Вставить("КодЦеннойБумаги", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		СтруктураТаблицы.Вставить("КомиссияБрокера", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		СтруктураТаблицы.Вставить("ДатаОплатыКомиссии", Новый ОписаниеТипов("Дата"));
			
	ИначеЕсли ИмяТаблицы = "ОстаткиДенежныхСредств" Тогда
	
		РегистрМД = Метаданные.РегистрыНакопления.ОстаткиДенежныхСредств;
		
		СтруктураТаблицы.Вставить("СуммаНачальныйОстаток", РегистрМД.Ресурсы.Сумма.Тип);
		СтруктураТаблицы.Вставить("СуммаКонечныйОстаток", РегистрМД.Ресурсы.Сумма.Тип);
		
	ИначеЕсли ИмяТаблицы = "ОстаткиЦенныхБумаг" Тогда
		
		РегистрМД = Метаданные.РегистрыНакопления.ОстаткиЦенныхБумаг;
	
		СтруктураТаблицы.Вставить("НомерТорговогоРаздела", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)));
		СтруктураТаблицы.Вставить("КодЦеннойБумаги", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		СтруктураТаблицы.Вставить("КоличествоНачальныйОстаток", РегистрМД.Ресурсы.Количество.Тип);
		СтруктураТаблицы.Вставить("КоличествоКонечныйОстаток", РегистрМД.Ресурсы.Количество.Тип);
		
	КонецЕсли;
	
	Возврат СтруктураТаблицы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
		
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаСверкаНаДату.Видимость   = (Форма.РежимСверки = 0);
	Элементы.ГруппаСверкаЗаПериод.Видимость = (Форма.РежимСверки = 1);	
	
	Элементы.ВремяСверки.Доступность                           = Форма.ФиксироватьРезультатСверки;
	Элементы.ВыводитьОтчетОПодтвержденныхОперациях.Доступность = Форма.ФиксироватьРезультатСверки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКаталогДанных()
	
	Если ЗначениеЗаполнено(ЭтаФорма.ДатаСверки) Тогда
		ПутьНорм = ПолучитьКаталогДанных(Объект.Организация, ЭтаФорма.ДатаСверки);
		Объект.КаталогДанных = ПутьНорм + ?(СтрЗаканчиваетсяНа(ПутьНорм, "\"), "", "\");
		КомандаОбновитьСписокФайлов(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКодЦеннойБумаги(Знач ЦеннаяБумагаТекст)
	
	// рег. номер ц/б содержится справа от последней запятой
	// например, "Обл. АИЖК А18, 4-18-00739-A"
	
	КодБумаги = СокрЛ(Сред(ЦеннаяБумагаТекст, СтрНайти(ЦеннаяБумагаТекст, ",", НаправлениеПоиска.СКонца) + 1));
	Если ПустаяСтрока(КодБумаги) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выделить рег. номер из описания ценной бумаги [" + ЦеннаяБумагаТекст + "].");
	КонецЕсли;
	
	// у этих редисок русские буквы в рег. номерах
	КодБумаги = СтрЗаменить(КодБумаги, "А", "A");
	КодБумаги = СтрЗаменить(КодБумаги, "В", "B");
	КодБумаги = СтрЗаменить(КодБумаги, "С", "C");
	КодБумаги = СтрЗаменить(КодБумаги, "Е", "E");
	КодБумаги = СтрЗаменить(КодБумаги, "К", "");
	КодБумаги = СтрЗаменить(КодБумаги, "Н", "H");
	КодБумаги = СтрЗаменить(КодБумаги, "М", "M");
	КодБумаги = СтрЗаменить(КодБумаги, "О", "O");
	КодБумаги = СтрЗаменить(КодБумаги, "Р", "P");
	КодБумаги = СтрЗаменить(КодБумаги, "Т", "T");
	КодБумаги = СтрЗаменить(КодБумаги, "Х", "X");
	
	Возврат КодБумаги;
		
КонецФункции

&НаКлиенте
Функция ПолучитьНомерСделки(НомерСделки)
	
	Если Найти(НомерСделки, "В") > 0 Тогда // т.к. иногда пишется "Сделка № 000 в режиме торгов (T0)"
		НомерСделки = СокрП(Лев(НомерСделки, Найти(НомерСделки, "В") - 1)); 
	КонецЕсли;
	
	Возврат НомерСделки;
	
КонецФункции

&НаКлиенте
Функция Подстрока(Знач СтрокаТекст, Знач ПозицияС = 1, Знач ПозицияПо = 0)
	
	Если ПозицияПо = 0 Тогда
		ПозицияПо = СтрДлина(СтрокаТекст);
	КонецЕсли;
	
	Возврат Сред(СтрокаТекст, ПозицияС, ПозицияПо - ПозицияС + 1);
	
КонецФункции

&НаКлиенте
Функция ПреобразоватьВЧисло(Знач СтрокаЧисло, ОтрицательноеЗначение = 1, ЗаменятьЗапятые = Истина)
	
	Если ТипЗнч(СтрокаЧисло) = Тип("Число") Тогда	
		Возврат ОтрицательноеЗначение * СтрокаЧисло;	
	КонецЕсли;
	
	Если ЗаменятьЗапятые Тогда	
		Значение = СтрЗаменить(СтрокаЧисло, ",", "");
	Иначе
		Значение = СокрЛП(СтрокаЧисло);
	КонецЕсли;
	
	Значение = РаботаСоСтрокамиКлиентСервер.СтрокаВЧисло(Значение); 
	
	Если Значение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось преобразовать в число значение [" + СтрокаЧисло + "].");
		Возврат Значение;
	Иначе
		Возврат ОтрицательноеЗначение * Значение;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЗначениеБольшеНуля(Значение)
	
	ЧисловоеЗначение = ПреобразоватьВЧисло(Значение);
		
	Если ЧисловоеЗначение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операции сравнения больше-меньше недопустимы для значения [" + Значение + "].");
		Возврат Ложь;	
	Иначе	
		Возврат (ЧисловоеЗначение > 0);
	КонецЕсли;
		
КонецФункции 

&НаКлиенте
Функция НайтиПозицииРазделовОтчета(ТекстОтчета, ИмяФайла)
	
	КлючРазделаДенежныхСредств = ВРег("2. Информация по денежным средствам:");
	КлючРазделаЦенныхБумаг     = ВРег("3. Информация по ценным бумагам [2]:");
	КлючРазделаСделок          = ВРег("1. Cделки");
	
	ПозицияРазделаДенежныхСредств = 0;
	ПозицияРазделаЦенныхБумаг = 0;
	ПозицияРазделаСделок = 0;
	
	Для НомСтр = 1 По ТекстОтчета.КоличествоСтрок() Цикл
		ТекСтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомСтр);
		
		Если Найти(ТекСтрокаОтчета, КлючРазделаДенежныхСредств) = 1 Тогда
			
			Если ПозицияРазделаДенежныхСредств = 0 Тогда
				ПозицияРазделаДенежныхСредств = НомСтр;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: найдено более одной таблицы информации по денежным средствам.");
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли Найти(ТекСтрокаОтчета, КлючРазделаЦенныхБумаг) = 1 Тогда
			
			Если ПозицияРазделаЦенныхБумаг = 0 Тогда
				ПозицияРазделаЦенныхБумаг = НомСтр;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: найдено более одной таблицы информации по ценным бумагам.");
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли Найти(ТекСтрокаОтчета, КлючРазделаСделок) = 1 Тогда
			
			Если ПозицияРазделаСделок = 0 Тогда
				ПозицияРазделаСделок = НомСтр;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: найдено более одной таблицы сделок.");
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПозицияРазделаДенежныхСредств = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: не удалось найти таблицу информации по денежным средствам.");
		Возврат Неопределено;
	ИначеЕсли ПозицияРазделаЦенныхБумаг = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: не удалось найти таблицу информации по ценным бумагам.");
		Возврат Неопределено;
	ИначеЕсли ПозицияРазделаСделок = 0 Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла [" + ИмяФайла + "]: не удалось найти таблицу информации по сделкам.");
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Сделки, ДенежныеСредства, ЦенныеБумаги", ПозицияРазделаСделок, ПозицияРазделаДенежныхСредств, ПозицияРазделаЦенныхБумаг);
	
КонецФункции

&НаКлиенте
Функция ПолучитьМаксЗначениеСчетчика(НомСтр, ПозицииРазделовОтчета, КоличествоСтрокОтчета)
	
	МаксЗначение = КоличествоСтрокОтчета;
	
	Для Каждого ПозицияРаздела Из ПозицииРазделовОтчета Цикл
		
		Если ПозицияРаздела.Значение > НомСтр И ПозицияРаздела.Значение < МаксЗначение Тогда
			МаксЗначение = ПозицияРаздела.Значение;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МаксЗначение;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьТаблицуОтчета(ТекстОтчета, МаксЗначениеСчетчика, ПозицияПервойСтрокиТаблицы)
	
	ЗначПолейТаблицы = Новый Массив;
	
	// Таблицы представлены в следующем виде:
	//		+—————————————————————————+—————————————————————————+—————————————————————————+—————————————————————————+
	//		|   Фактический остаток   |    Свободный остаток    |    Сумма требований     |   Сумма обязательств*   |
	//		+—————————————————————————+—————————————————————————+—————————————————————————+—————————————————————————+
	//		|            1            |            2            |            3            |            4            |
	//		+—————————————————————————+—————————————————————————+—————————————————————————+—————————————————————————+
	//		|            508,515.85   |              4,867.80   |                  0.00   |            503,648.05   |
	//		+—————————————————————————+—————————————————————————+—————————————————————————+—————————————————————————+
	
	ГраницыКолонок   = Новый Массив;
	ЗначПолейСтрокиТаблицы = Неопределено;
	
	НомСтр = ПозицияПервойСтрокиТаблицы;
	
	Пока НомСтр <= МаксЗначениеСчетчика Цикл
		СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомСтр);
		
		Если Лев(СтрокаОтчета, 1) <> "+" И Лев(СтрокаОтчета, 1) <> "|" Тогда
			НомСтр = НомСтр - 1; //сразу может начинаться следующий раздел
			Прервать;
		КонецЕсли;
		
		// по 1-й строке определим границы колонок таблицы
		Если НомСтр = ПозицияПервойСтрокиТаблицы Тогда
			Для ПозСимв = 1 По СтрДлина(СтрокаОтчета) Цикл
				Если Сред(СтрокаОтчета, ПозСимв, 1) = "+" Тогда
					ГраницыКолонок.Добавить(ПозСимв);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Лев(СтрокаОтчета, 1) = "+" Тогда // началась новая строка таблицы
			Если ЗначПолейСтрокиТаблицы <> Неопределено Тогда
				ЗначПолейТаблицы.Добавить(ЗначПолейСтрокиТаблицы);
			КонецЕсли;
			
			ЗначПолейСтрокиТаблицы = Новый Массив;
			Для Инд = 1 По ГраницыКолонок.Количество() - 1 Цикл
				ЗначПолейСтрокиТаблицы.Добавить("");
			КонецЦикла;
			
		ИначеЕсли Лев(СтрокаОтчета, 1) = "|" Тогда
			Для Инд = 0 По ГраницыКолонок.Количество() - 2 Цикл
				ЗначПолейСтрокиТаблицы[Инд] = ЗначПолейСтрокиТаблицы[Инд] + СокрЛП(Подстрока(СтрокаОтчета, ГраницыКолонок[Инд] + 1, ГраницыКолонок[Инд + 1] - 1));
			КонецЦикла;
			
		КонецЕсли;	
		
		НомСтр = НомСтр + 1;
		
	КонецЦикла;
	
	ПозицияПервойСтрокиТаблицы = НомСтр; 
			
	Возврат ЗначПолейТаблицы;
	
КонецФункции
		
&НаКлиенте
Функция ДесериализоватьПараметрыОтчетаБрокераXLSX(ТабличныйДокументОтчета, ИмяФайла)
		
	СтруктураПараметров = Новый Структура("ИмяФайла, КодСчетаДоверительногоУправления, ИмяМестаХранения, ИмяВалютыРасчетов, ДатаОтчета, НачалоПериодаОтчета, КонецПериодаОтчета");
	
	НайденаДатаОтчета = Ложь;
	НайденаТорговаяПлощадка = Ложь;
	НайденКлиент = Ложь;
	НайденДоговор = Ложь;
	
	КоличествоСтрок = ТабличныйДокументОтчета.ВысотаТаблицы;
	
	Для ТекСтрока = 0 По КоличествоСтрок - 1 Цикл
		
		Для ТекКолонка = 0 По 10 Цикл
			Попытка
				ЗначениеЯчейки = СокрЛП(ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка).Текст);
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если ЗначениеЯчейки = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не НайденаДатаОтчета И СтрНачинаетсяС(ЗначениеЯчейки, "за") Тогда
				СтрокаДаты = ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка + 1).Текст;
				СтруктураПараметров.НачалоПериодаОтчета = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(СтрокаДаты);
				СтруктураПараметров.КонецПериодаОтчета = КонецДня(СтруктураПараметров.НачалоПериодаОтчета);
				НайденаДатаОтчета = Истина;
			КонецЕсли;
			
			Если СтрНачинаетсяС(ЗначениеЯчейки, "Дата составления отчёта:") Тогда
				Попытка
					ЗначениеДаты = СокрЛП(ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка + 2).Текст);
					СтруктураПараметров.ДатаОтчета = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗначениеДаты);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Если Не НайденаТорговаяПлощадка И СтрНачинаетсяС(ЗначениеЯчейки, "Торговая площадка:") Тогда
				Попытка
					ЗначениеПлощадки = СокрЛП(ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка + 1).Текст);
					Если ЗначениеПлощадки = "ПАО Московская Биржа" Тогда
						СтруктураПараметров.ИмяМестаХранения = "ММВБ-РТС";
					КонецЕсли;
					НайденаТорговаяПлощадка = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Если Не НайденКлиент И СтрНачинаетсяС(ЗначениеЯчейки, "Клиент:") Тогда
				Для Смещение = 1 По 3 Цикл
					Попытка
						ЗначениеКлиента = СокрЛП(ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка + Смещение).Текст);
						Если ЗначениеКлиента <> "" Тогда
							СтруктураПараметров.КодСчетаДоверительногоУправления = ЗначениеКлиента;
							НайденКлиент = Истина;
							Прервать;
						КонецЕсли;
					Исключение
						Продолжить;
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
			
			Если Не НайденДоговор И СтрНачинаетсяС(ЗначениеЯчейки, "Договор от") Тогда
				Для Смещение = 1 По 3 Цикл
					Попытка
						ЗначениеДоговора = СокрЛП(ТабличныйДокументОтчета.Область(ТекСтрока, ТекКолонка + Смещение).Текст);
						Если ЗначениеДоговора <> "" Тогда
							НайденДоговор = Истина;
							Прервать;
						КонецЕсли;
					Исключение
						Продолжить;
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
			
			Если ЗначениеЯчейки = "RUR" Тогда
				СтруктураПараметров.ИмяВалютыРасчетов = "RUB";
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// Проверка обязательных параметров
	Если Не ЗначениеЗаполнено(СтруктураПараметров.НачалоПериодаОтчета) Или Не ЗначениеЗаполнено(СтруктураПараметров.КонецПериодаОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: не удалось определить период отчета [" + ИмяФайла + "].");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ДатаОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: не удалось определить дату отчета [" + ИмяФайла + "].");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.КодСчетаДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: не удалось определить код счета ДУ [" + ИмяФайла + "].");
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка соответствия даты отчета дате сверки
	Если СтруктураПараметров.НачалоПериодаОтчета <> ЭтаФорма.ДатаСверки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата отчета [" + Формат(СтруктураПараметров.НачалоПериодаОтчета, "ДФ=dd.MM.yyyy") + "] не соответствует дате сверки [" + Формат(ЭтаФорма.ДатаСверки, "ДФ=dd.MM.yyyy") + "]. Файл [" + ИмяФайла + "].");
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров.ИмяФайла = ИмяФайла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьПараметрыОтчетаБрокераTXT(ТекстОтчета, ИмяФайла)
		
#Область Примеры_Шапки_Файлов
	// Шапка отчета полученного по ЭЛ.ПОЧТЕ выглядит следующим образом:
	//		LANDSCAPE,0,30,0,0,LUCIDA CONSOLE,6, ,CYRILLIC,A4
	//		ОТЧЕТ ПО СДЕЛКАМ И ОПЕРАЦИЯМ С ЦЕННЫМИ БУМАГАМИ, СОВЕРШЕННЫМ В ИНТЕРЕСАХ КЛИЕНТА В ТЕЧЕНИЕ ДНЯ
	//		ЗА 18/04/2017
	//		ДАТА СОСТАВЛЕНИЯ ОТЧЕТА 19/04/2017
	//		МЕСТО ЗАКЛЮЧЕНИЯ СДЕЛКИ: ЗАО «ФОНДОВАЯ БИРЖА ММВБ» (ОСНОВНОЙ РЫНОК)
	//		ИНВЕСТОР: 12693 Y47-00000B11 АКЦИОНЕРНОЕ ОБЩЕСТВО "РЕГИОН ЭССЕТ МЕНЕДЖМЕНТ" ДУ ПЕНСИОННЫМИ РЕЗЕРВАМИ АО ''НПФ "ВНИИЭФ-ГАРАНТ"
	//		ДОГОВОР № Г000-Б-12693 ОТ 29/09/2008
	//		ВАЛЮТА РАСЧЕТОВ RUR
	
	// Шапка отчета полученного по ЭДО выглядит следующим образом:
	//		LANDSCAPE,0,30,0,0,Lucida Console,6, ,CYRILLIC,A4
	//		«Газпромбанк» (Акционерное общество)
	//		Банк ГПБ (АО)

	//		ОКПО 09807684
	//		БИК 044525823
	//		ИНН/КПП 7744001497/997950001

	//		117420, г. Москва, ул. Наметкина, д. 16, корпус 1.
	//		Телефон: +7 (495) 719-17-63
	//		Факс: +7 (495) 913-73-19
	//		SWIFT: GAZPRUMM
	//		Телекс: 412027 GAZ RU
	//		www.gazprombank.ru
	//		ОТЧЕТ ПО СДЕЛКАМ И ОПЕРАЦИЯМ С ЦЕННЫМИ БУМАГАМИ, СОВЕРШЕННЫМ В ИНТЕРЕСАХ КЛИЕНТА В ТЕЧЕНИЕ ДНЯ
	//		за 26/07/2023
	//		Дата составления отчета 27/07/2023
	//		МЕСТО ЗАКЛЮЧЕНИЯ сделки: ПАО Московская Биржа (основной рынок)
	//		ИНВЕСТОР: 32727 Y6T+00000B98 АО "РЕГИОН ЭсМ" Д.У. средствами пенсионных резервов АО "Национальный НПФ"                                                                                                            
	//		ДОГОВОР № Г000-Б-32727 ОТ 04/04/2017
	//		Валюта расчетов RUR		
#КонецОбласти

	СтруктураПараметров = Новый Структура("ИмяФайла, КодСчетаДоверительногоУправления, ИмяМестаХранения, ИмяВалютыРасчетов, ДатаОтчета, НачалоПериодаОтчета, КонецПериодаОтчета");
	НомерСтрокиНаименованияОтчета = 0;	
		
	Для Инд = 2 По 100 Цикл
		
		Если ТекстОтчета.ПолучитьСтроку(Инд) = "ОТЧЕТ ПО СДЕЛКАМ И ОПЕРАЦИЯМ С ЦЕННЫМИ БУМАГАМИ, СОВЕРШЕННЫМ В ИНТЕРЕСАХ КЛИЕНТА В ТЕЧЕНИЕ ДНЯ" Тогда
			НомерСтрокиНаименованияОтчета = Инд;
			Прервать;
		КонецЕсли;	
			
	КонецЦикла;
	
	Если НомерСтрокиНаименованияОтчета = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: файл не является отчетом брокера [" + ИмяФайла + "].");
		Возврат Неопределено;
	КонецЕсли;
			
	// дата отчета
	КлючСтроки   = "ЗА";
	СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомерСтрокиНаименованияОтчета + 1);

	Если СтрНачинаетсяС(СтрокаОтчета, КлючСтроки) Тогда
		
		СтрокаОтчета = СтрЗаменить(СокрЛП(Сред(СтрокаОтчета, СтрДлина(КлючСтроки) + 1)), "/", ".");
		
		СтруктураПараметров.НачалоПериодаОтчета = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(СтрокаОтчета);
		СтруктураПараметров.КонецПериодаОтчета  = КонецДня(СтруктураПараметров.НачалоПериодаОтчета);
		
		Если Не (ЗначениеЗаполнено(СтруктураПараметров.НачалоПериодаОтчета) И ЗначениеЗаполнено(СтруктураПараметров.КонецПериодаОтчета)) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: не удалось определить период отчета [" + ИмяФайла + "].");
			Возврат Неопределено;
			
		ИначеЕсли СтруктураПараметров.НачалоПериодаОтчета <> ЭтаФорма.ДатаСверки Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата отчета [" + Формат(СтруктураПараметров.НачалоПериодаОтчета, "ДФ=dd.MM.yyyy") + "] не соответствует дате сверки [" + Формат(ЭтаФорма.ДатаСверки, "ДФ=dd.MM.yyyy") + "]. Файл [" + ИмяФайла + "].");
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;

	// период отчета
	КлючСтроки   = "ДАТА СОСТАВЛЕНИЯ ОТЧЕТА";
	СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомерСтрокиНаименованияОтчета + 2);
		
	Если СтрНачинаетсяС(СтрокаОтчета, КлючСтроки) Тогда
		
		СтрокаОтчета = СтрЗаменить(СокрЛП(Сред(СтрокаОтчета, СтрДлина(КлючСтроки) + 1)), "/", ".");
		СтруктураПараметров.ДатаОтчета = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(СтрокаОтчета);
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ДатаОтчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: не удалось определить дату отчета [" + ИмяФайла + "].");
			Возврат Неопределено;
		КонецЕсли;

	КонецЕсли;

	// место хранения
	КлючСтроки   = "МЕСТО ЗАКЛЮЧЕНИЯ СДЕЛКИ:";
	СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомерСтрокиНаименованияОтчета + 3);
	
	Если СтрНачинаетсяС(СтрокаОтчета, КлючСтроки) Тогда
		
		СтрокаОтчета = СокрЛП(Сред(СтрокаОтчета, СтрДлина(КлючСтроки) + 1));
		Если СтрокаОтчета = "ПАО МОСКОВСКАЯ БИРЖА (ОСНОВНОЙ РЫНОК)" Тогда
			СтруктураПараметров.ИмяМестаХранения = "ММВБ-РТС";
		КонецЕсли;
		
	КонецЕсли;

	// счет д/у
	КлючСтроки   = "ИНВЕСТОР:";
	СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомерСтрокиНаименованияОтчета + 4);
	
	Если СтрНачинаетсяС(СтрокаОтчета, КлючСтроки) Тогда
		
		СтрокаОтчета = СокрЛП(Сред(СтрокаОтчета, СтрДлина(КлючСтроки) + 1));
		СтрокаОтчета = Лев(СтрокаОтчета, Найти(СтрокаОтчета, " ") - 1);
		
		СтруктураПараметров.КодСчетаДоверительногоУправления = СтрокаОтчета;
		
	КонецЕсли;	
	
	// валюта расчетов
	КлючСтроки   = "ВАЛЮТА РАСЧЕТОВ";
	СтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомерСтрокиНаименованияОтчета + 6);
		
	Если СтрНачинаетсяС(СтрокаОтчета, КлючСтроки) Тогда
		
		СтрокаОтчета = СокрЛП(Сред(СтрокаОтчета, СтрДлина(КлючСтроки) + 1));
		
		Если СтрокаОтчета = "RUR" Тогда
			СтруктураПараметров.ИмяВалютыРасчетов = "RUB";
		Иначе
			СтруктураПараметров.ИмяВалютыРасчетов = СтрокаОтчета;	
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметров.ИмяФайла = ИмяФайла;
	
	Возврат СтруктураПараметров;
					
КонецФункции

&НаКлиенте
Функция ДесериализоватьДанныеОтчетовБрокераXLSX(КоличествоВыбранныхФайлов)
		
	МассивДанныхОтчетовБрокера = Новый Массив();
	Сверено = 0;
	
	Для Каждого СтрокаФайлыОтчетов Из ЭтаФорма.ФайлыОтчетов Цикл
		
		Если Не СтрокаФайлыОтчетов.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		Состояние("1. Чтение файлов.", ?(КоличествоВыбранныхФайлов = 0, 0, Сверено * 100 / КоличествоВыбранныхФайлов));
		Сверено = Сверено + 1;
		
		Попытка
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Объект.КаталогДанных + "\" + СтрокаФайлыОтчетов.ИмяФайла);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла: " + ОписаниеОшибки());
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецПопытки;
		
		АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
		ТабличныйДокументОтчета = ОбработатьТабличныйДокументОтчета(АдресФайла);
		
		Если ТабличныйДокументОтчета = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхОтчетаБрокера = Новый Структура("ПараметрыОтчета, ОстаткиДенежныхСредств, ОстаткиЦенныхБумаг, Операции");
		СтруктураДанныхОтчетаБрокера.ПараметрыОтчета = ДесериализоватьПараметрыОтчетаБрокераXLSX(ТабличныйДокументОтчета, СтрокаФайлыОтчетов.ИмяФайла);
		
		Если СтруктураДанныхОтчетаБрокера.ПараметрыОтчета = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;	
		КонецЕсли;
		
		СтруктураДанныхОтчетаБрокера.ОстаткиДенежныхСредств = ДесериализоватьОстаткиДенежныхСредствXLSX(ТабличныйДокументОтчета); 
		СтруктураДанныхОтчетаБрокера.ОстаткиЦенныхБумаг = ДесериализоватьОстаткиЦенныхБумагXLSX(ТабличныйДокументОтчета);
		СтруктураДанныхОтчетаБрокера.Операции = ДесериализоватьСделкиИЗадолженностиПоСделкамXLSX(ТабличныйДокументОтчета);
		
		Если СтруктураДанныхОтчетаБрокера.ОстаткиДенежныхСредств = Неопределено Или СтруктураДанныхОтчетаБрокера.ОстаткиЦенныхБумаг = Неопределено Или СтруктураДанныхОтчетаБрокера.Операции = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецЕсли;
		
		МассивДанныхОтчетовБрокера.Добавить(СтруктураДанныхОтчетаБрокера);
		
	КонецЦикла;
	
	Возврат МассивДанныхОтчетовБрокера;
		
КонецФункции

&НаКлиенте
Функция ДесериализоватьДанныеОтчетовБрокераTXT(КоличествоВыбранныхФайлов)
		
	МассивДанныхОтчетовБрокера = Новый Массив();
	Сверено = 0;
	
	Для Каждого СтрокаФайлыОтчетов Из ЭтаФорма.ФайлыОтчетов Цикл
		
		Если Не СтрокаФайлыОтчетов.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		Состояние("1. Чтение файлов.", ?(КоличествоВыбранныхФайлов = 0, 0, Сверено * 100 / КоличествоВыбранныхФайлов));
		Сверено = Сверено + 1;
		
		ТекстОтчета = ОбработатьТекстОтчета(СтрокаФайлыОтчетов.ИмяФайла);
				
		Если ТекстОтчета = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхОтчетаБрокера = Новый Структура("ПараметрыОтчета, ОстаткиДенежныхСредств, ОстаткиЦенныхБумаг, Операции");
		СтруктураДанныхОтчетаБрокера.ПараметрыОтчета = ДесериализоватьПараметрыОтчетаБрокераTXT(ТекстОтчета, СтрокаФайлыОтчетов.ИмяФайла);
		
		Если СтруктураДанныхОтчетаБрокера.ПараметрыОтчета = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;	
		КонецЕсли;
		
		ПозицииРазделовОтчета = НайтиПозицииРазделовОтчета(ТекстОтчета, СтрокаФайлыОтчетов.ИмяФайла);
		
		Если ПозицииРазделовОтчета = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецЕсли;
			
		СтруктураДанныхОтчетаБрокера.ОстаткиДенежныхСредств = ДесериализоватьОстаткиДенежныхСредствTXT(ТекстОтчета, ПозицииРазделовОтчета); 
		СтруктураДанныхОтчетаБрокера.ОстаткиЦенныхБумаг = ДесериализоватьОстаткиЦенныхБумагTXT(ТекстОтчета, ПозицииРазделовОтчета);
		СтруктураДанныхОтчетаБрокера.Операции = ДесериализоватьСделкиИЗадолженностиПоСделкамTXT(ТекстОтчета, ПозицииРазделовОтчета);	
		
		Если СтруктураДанныхОтчетаБрокера.ОстаткиДенежныхСредств = Неопределено Или СтруктураДанныхОтчетаБрокера.ОстаткиЦенныхБумаг = Неопределено Или СтруктураДанныхОтчетаБрокера.Операции = Неопределено Тогда
			СтрокаФайлыОтчетов.РезультатСверки = 3;
			Продолжить;
		КонецЕсли;
		
		МассивДанныхОтчетовБрокера.Добавить(СтруктураДанныхОтчетаБрокера);
		
	КонецЦикла;
	
	Возврат МассивДанныхОтчетовБрокера;
		
КонецФункции

&НаКлиенте
Функция ДесериализоватьОстаткиДенежныхСредствXLSX(ТабДок)
	
	ОстаткиДенежныхСредств = Новый Массив;
		
	СтрокаОстаткиДенежныхСредств = Новый Структура("СуммаНачальныйОстаток, СуммаКонечныйОстаток", 
		ПолучитьВходящиеОстатки(ТабДок), ПолучитьИсходящиеОстатки(ТабДок));
	
	ОстаткиДенежныхСредств.Добавить(СтрокаОстаткиДенежныхСредств);
	
	Если СтрокаОстаткиДенежныхСредств.СуммаНачальныйОстаток = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: отсутствует таблица Входящие остатки");
		Возврат Неопределено;
	ИначеЕсли СтрокаОстаткиДенежныхСредств.СуммаКонечныйОстаток = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: отсутствует таблица Исходящие остатки");
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат ОстаткиДенежныхСредств;

КонецФункции

&НаКлиенте
Функция ПолучитьВходящиеОстатки(ТабличныйДокументОтчета)
    
    // Ищем блок "Входящие остатки"
    ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст("Входящие остатки*");

	Если ОбластьЗаголовка <> Неопределено Тогда
		ТекСтрока = ОбластьЗаголовка.Низ + 3; // Пропускаем заголовки
		Пока Истина Цикл
			Попытка
				Если ТабличныйДокументОтчета.Область(ТекСтрока, 0).Текст = "RUR" Тогда 
					Возврат ПреобразоватьВЧисло(ТабличныйДокументОтчета.Область(ТекСтрока, 2).Текст,,Ложь); // B - ФактическийОстаток
				КонецЕсли;
			Исключение
				Возврат 0;
			КонецПопытки;
			
			Если СтрНачинаетсяС(ТабличныйДокументОтчета.Область(ТекСтрока, 0).Текст, "* Для сделок, курс валюты расчётов по которым не определён") Тогда
				Прервать;
			КонецЕсли;
			
			ТекСтрока = ТекСтрока + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат 0;
    
КонецФункции 

&НаКлиенте
Функция ПолучитьИсходящиеОстатки(ТабличныйДокументОтчета)
	
	// Ищем блок "Исходящие остатки"
	ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст("Исходящие остатки*");
	
	Если ОбластьЗаголовка <> Неопределено Тогда
		ТекСтрока = ОбластьЗаголовка.Низ + 3; // Пропускаем заголовки
		Пока Истина Цикл
			Попытка
				Если ТабличныйДокументОтчета.Область(ТекСтрока, 0).Текст = "RUR" Тогда 
					Возврат ПреобразоватьВЧисло(ТабличныйДокументОтчета.Область(ТекСтрока, 2).Текст,,Ложь); // B - ФактическийОстаток
				КонецЕсли;
			Исключение
				Возврат 0;
			КонецПопытки;
			
			Если СтрНачинаетсяС(ТабличныйДокументОтчета.Область(ТекСтрока, 0).Текст, "* Для сделок, курс валюты расчётов по которым не определён") Тогда
				Прервать;
			КонецЕсли;
			
			ТекСтрока = ТекСтрока + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьОстаткиДенежныхСредствTXT(ТекстОтчета, ПозицииРазделовОтчета)
	
	СтрокаОстаткиДенежныхСредствШаблон = Новый ФиксированнаяСтруктура("СуммаНачальныйОстаток, СуммаКонечныйОстаток");
	ОстаткиДенежныхСредств = Новый Массив;
	
	КлючВходящийОстаток  = "ВХОДЯЩИЕ ОСТАТКИ";
	КлючИсходящийОстаток = "ИСХОДЯЩИЕ ОСТАТКИ";
	
	// в таблицах входящих и исходящих остатков содержится только одна строка
	СтрокаОстаткиДенежныхСредств = Новый Структура(СтрокаОстаткиДенежныхСредствШаблон);
	
	ОстаткиДенежныхСредств.Добавить(СтрокаОстаткиДенежныхСредств);
	
	НомСтр = ПозицииРазделовОтчета.ДенежныеСредства + 1;
	
	МаксЗначениеСчетчика = ПолучитьМаксЗначениеСчетчика(НомСтр, ПозицииРазделовОтчета, ТекстОтчета.КоличествоСтрок());
	
	Пока НомСтр <= МаксЗначениеСчетчика Цикл
		
		ТекСтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомСтр);
		
		Если СтрНачинаетсяС(ТекСтрокаОтчета, КлючВходящийОстаток) Тогда
			ТипСуммы = "СуммаНачальныйОстаток";
		ИначеЕсли СтрНачинаетсяС(ТекСтрокаОтчета, КлючИсходящийОстаток) Тогда
			ТипСуммы = "СуммаКонечныйОстаток";
		Иначе
			ТипСуммы = Неопределено;
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
		
		Если ЗначениеЗаполнено(ТипСуммы) Тогда
			
			ЗначПолейТаблицы = ПрочитатьТаблицуОтчета(ТекстОтчета, МаксЗначениеСчетчика, НомСтр);
			
			Если ЗначПолейТаблицы.Количество() <> 3 Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: таблица [" + КлючВходящийОстаток + "] содержит менее 3-х строк, вкл. имена и номера колонок");
				Возврат Неопределено;
				
			КонецЕсли;
			
			СтрокаОстаткиДенежныхСредств[ТипСуммы] = ПреобразоватьВЧисло(ЗначПолейТаблицы[2][0]);
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если СтрокаОстаткиДенежныхСредств.СуммаНачальныйОстаток = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: отсутствует таблица [" + КлючВходящийОстаток + "]");
		Возврат Неопределено;
	ИначеЕсли СтрокаОстаткиДенежныхСредств.СуммаКонечныйОстаток = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла: отсутствует таблица [" + КлючИсходящийОстаток + "]");
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат ОстаткиДенежныхСредств;
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьОстаткиЦенныхБумагTXT(ТекстОтчета, ПозицииРазделовОтчета)
	
	СтрокаОстаткиЦенныхБумагШаблон = Новый ФиксированнаяСтруктура("НомерТорговогоРаздела, КодЦеннойБумаги, КоличествоНачальныйОстаток, КоличествоКонечныйОстаток");
	ОстаткиЦенныхБумаг = Новый Массив;
	ИмяТаблицы = "";
	
	НомСтр = ПозицииРазделовОтчета.ЦенныеБумаги + 1;
	
	МаксЗначениеСчетчика = ПолучитьМаксЗначениеСчетчика(НомСтр, ПозицииРазделовОтчета, ТекстОтчета.КоличествоСтрок());
	
	Пока НомСтр <= МаксЗначениеСчетчика Цикл
		
		ТекСтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомСтр);
		
		Если ОстаткиЦенныхБумаг.Количество() = 0 И СтрНайти(ТекСтрокаОтчета, "ОПИСАНИЕ ЦЕННОЙ БУМАГИ") > 0  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не соответствует формату. В файле присутствует информация о ценных бумагах без указания раздела.");
			Возврат Неопределено;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ТекСтрокаОтчета, "ДВИЖЕНИЕ ПО СЧЕТУ УЧЕТА ЦЕННЫХ БУМАГ") Или СтрНачинаетсяС(ТекСтрокаОтчета, "ПО РАЗДЕЛУ В") Тогда
			ИмяТаблицы = ТекСтрокаОтчета;
			НомСтр = НомСтр + 1;
			Продолжить;
		КонецЕсли;
					
		Если ИмяТаблицы <> "" Тогда
									
			ЗначПолейТаблицы = ПрочитатьТаблицуОтчета(ТекстОтчета, МаксЗначениеСчетчика, НомСтр);
			
			Если ЗначПолейТаблицы.Количество() = 0 Тогда
				ИмяТаблицы = ""; //если таблица пустая, продолжаем поиск следующей таблицы
				НомСтр = НомСтр + 1;
				Продолжить;
			КонецЕсли;
						
			Если СтрНачинаетсяС(ИмяТаблицы, "ДВИЖЕНИЕ ПО СЧЕТУ УЧЕТА ЦЕННЫХ БУМАГ") Или СтрНачинаетсяС(ИмяТаблицы, "ПО РАЗДЕЛУ В НРД «БЛОКИРОВАНО ДЛЯ КЛИРИНГА НКЦ. ОБЕСПЕЧЕНИЕ.»") Тогда  
				ТекНомерТорговогоРаздела = "36";
			ИначеЕсли СтрНачинаетсяС(ИмяТаблицы, "ПО РАЗДЕЛУ В НРД «БЛОКИРОВАНО ДЛЯ КЛИРИНГА НКЦ. СДЕЛКИ В ВАЛЮТЕ РФ.»") Тогда
				//ТекНомерТорговогоРаздела = "31";
				Продолжить;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось опредилить номер торгового раздела из текста [" + ТекНомерТорговогоРаздела + "]");
				Возврат Неопределено;
			КонецЕсли;
			
			ИндексПоляЦБ = Неопределено;
			ИндексПоляНачОстатка = Неопределено;
			ИндексПоляКонОстатка = Неопределено;
			
			Для Инд = 0 По ЗначПолейТаблицы[0].Количество() - 1 Цикл
				
				Если СтрЗаменить(ЗначПолейТаблицы[0][Инд], " ", "") = "ОПИСАНИЕЦЕННОЙБУМАГИ" Тогда	
					ИндексПоляЦБ = Инд;	
				ИначеЕсли СтрЗаменить(ЗначПолейТаблицы[0][Инд], " ", "") = "ВХОДЯЩИЙОСТАТОК" Тогда
					ИндексПоляНачОстатка = Инд;	
				ИначеЕсли СтрЗаменить(ЗначПолейТаблицы[0][Инд], " ", "") = "ИСХОДЯЩИЙОСТАТОК" Тогда
					ИндексПоляКонОстатка = Инд;	
				КонецЕсли;
				
			КонецЦикла;
			
			Если ИндексПоляЦБ = Неопределено И ИндексПоляНачОстатка = Неопределено И ИндексПоляКонОстатка = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл не соответствует формату. Не удалось определить остатки ценных бумаг.");
				Возврат Неопределено;
			КонецЕсли;
			
			Для Инд = 2 По ЗначПолейТаблицы.Количество() - 1 Цикл
				
				СтрокаОстаткиЦенныхБумаг = Новый Структура(СтрокаОстаткиЦенныхБумагШаблон);
				СтрокаОстаткиЦенныхБумаг.НомерТорговогоРаздела      = ТекНомерТорговогоРаздела;
				СтрокаОстаткиЦенныхБумаг.КодЦеннойБумаги            = ПолучитьКодЦеннойБумаги(ЗначПолейТаблицы[Инд][ИндексПоляЦБ]); 
				СтрокаОстаткиЦенныхБумаг.КоличествоНачальныйОстаток = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][ИндексПоляНачОстатка]);
				СтрокаОстаткиЦенныхБумаг.КоличествоКонечныйОстаток  = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][ИндексПоляКонОстатка]);				
				ОстаткиЦенныхБумаг.Добавить(СтрокаОстаткиЦенныхБумаг);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ИмяТаблицы = "";
		НомСтр = НомСтр + 1;
		
	КонецЦикла;
		
	Возврат ОстаткиЦенныхБумаг;	
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьОстаткиЦенныхБумагXLSX(ТабличныйДокументОтчета)
	
	СтрокаОстаткиЦенныхБумагШаблон = Новый ФиксированнаяСтруктура("НомерТорговогоРаздела, КодЦеннойБумаги, КоличествоНачальныйОстаток, КоличествоКонечныйОстаток");
	ОстаткиЦенныхБумаг = Новый Массив;
	
	// Получаем данные с листа "Движение ЦБ"
	ДанныеЦенныхБумаг = ПрочитатьТаблицуЦенныхБумагXLSX(ТабличныйДокументОтчета);
	
	Если ДанныеЦенныхБумаг.Количество() = 0 Тогда
		Возврат ОстаткиЦенныхБумаг;
	КонецЕсли;
	
	// Определяем индексы колонок
	ИндексПоляЦБ = НайтиИндексКолонкиXLSX(ДанныеЦенныхБумаг, "Наименование ценной бумаги");
	ИндексПоляИдентификатор = НайтиИндексКолонкиXLSX(ДанныеЦенныхБумаг, "Идентификатор ценной бумаги");
	ИндексПоляНачОстатка = НайтиИндексКолонкиXLSX(ДанныеЦенныхБумаг, "Входящий остаток");
	ИндексПоляКонОстатка = НайтиИндексКолонкиXLSX(ДанныеЦенныхБумаг, "Исходящий остаток");
	
	Если ИндексПоляЦБ = Неопределено ИЛИ ИндексПоляНачОстатка = Неопределено ИЛИ ИндексПоляКонОстатка = Неопределено Тогда
		Возврат ОстаткиЦенныхБумаг;
	КонецЕсли;
	
	// Обрабатываем строки с данными (пропускаем заголовки)
	Для Инд = 2 По ДанныеЦенныхБумаг.Количество() - 1 Цикл
		
		СтрокаДанных = ДанныеЦенныхБумаг[Инд];
		Если СтрокаДанных.Количество() <= Макс(ИндексПоляИдентификатор, ИндексПоляНачОстатка, ИндексПоляКонОстатка) Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторЦБ = СтрокаДанных[ИндексПоляИдентификатор];
		ВходящийОстаток = СтрокаДанных[ИндексПоляНачОстатка];
		ИсходящийОстаток = СтрокаДанных[ИндексПоляКонОстатка];
		
		СтрокаОстаткиЦенныхБумаг = Новый Структура(СтрокаОстаткиЦенныхБумагШаблон);
		СтрокаОстаткиЦенныхБумаг.НомерТорговогоРаздела      = НомерТорговогоРаздела(ТабличныйДокументОтчета);
		СтрокаОстаткиЦенныхБумаг.КодЦеннойБумаги            = ПолучитьКодЦеннойБумагиПоISIN(ИдентификаторЦБ, ЭтаФорма.ДатаСверки); 
		СтрокаОстаткиЦенныхБумаг.КоличествоНачальныйОстаток = ПреобразоватьВЧисло(ВходящийОстаток,,Ложь);
		СтрокаОстаткиЦенныхБумаг.КоличествоКонечныйОстаток  = ПреобразоватьВЧисло(ИсходящийОстаток,,Ложь);
		
		ОстаткиЦенныхБумаг.Добавить(СтрокаОстаткиЦенныхБумаг);
		
	КонецЦикла;
		
	Возврат ОстаткиЦенныхБумаг;	
	
КонецФункции

&НаКлиенте
Функция НомерТорговогоРаздела(ТабличныйДокументОтчета)
	
	// Поиск заголовков
	КлючевыеСлова = Новый Массив;
	КлючевыеСлова.Добавить("Движение по счёту учёта ценных бумаг");
	КлючевыеСлова.Добавить("По разделу в НРД");
	
	Для Каждого КлючевоеСлово Из КлючевыеСлова Цикл
		ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст(КлючевоеСлово);
		Если ОбластьЗаголовка <> Неопределено Тогда
			Заголовок = ВРег(ОбластьЗаголовка.Текст);
			Если СтрНачинаетсяС(Заголовок, "ДВИЖЕНИЕ ПО СЧЁТУ УЧЁТА ЦЕННЫХ БУМАГ") 
				Или СтрНайти(Заголовок, "БЛОКИРОВАНО ДЛЯ КЛИРИНГА НКЦ. ОБЕСПЕЧЕНИЕ.") > 0 Тогда
				Возврат "36";
			ИначеЕсли СтрНайти(Заголовок, "БЛОКИРОВАНО ДЛЯ КЛИРИНГА НКЦ. СДЕЛКИ В ВАЛЮТЕ РФ.") > 0 Тогда
				Возврат "31";
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номер торгового раздела из текста [" + Заголовок + "]");
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьТаблицуЦенныхБумагXLSX(ТабличныйДокументОтчета)
	
	ДанныеЦенныхБумаг = Новый Массив;
	
	// Ищем начало таблицы на листе "Движение ЦБ"
	// Заголовок первой колонки начинается со строки "Движение по счёту учёта ценных бумаг"
	ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст("Движение по счёту учёта ценных бумаг");
	Если ОбластьЗаголовка = Неопределено Тогда
		Возврат ДанныеЦенныхБумаг;
	КонецЕсли;
	
	НачальнаяСтрока = ОбластьЗаголовка.Низ + 1;
	МаксСтрок = ТабличныйДокументОтчета.ВысотаТаблицы; // Ограничение на чтение строк
	
	// Читаем заголовки
	СтрокаЗаголовков = Новый Массив;
	Для Колонка = 1 По 14 Цикл // Предполагаем максимум 14 колонок
		Значение = ТабличныйДокументОтчета.Область(НачальнаяСтрока, Колонка).Текст;
		СтрокаЗаголовков.Добавить(СокрЛП(Значение));
	КонецЦикла;
	ДанныеЦенныхБумаг.Добавить(СтрокаЗаголовков);
	
	// Читаем данные
	Для Счетчик = 1 По МаксСтрок - 1 Цикл
		ТекСтрока = НачальнаяСтрока + Счетчик;
		
		// Проверяем, есть ли данные в первой колонке
		ТекстПервойКолонки = ТабличныйДокументОтчета.Область(ТекСтрока, 1).Текст;
		Если ТекстПервойКолонки = "" ИЛИ СтрНачинаетсяС(ТекстПервойКолонки, "Внимание!") Тогда
			// Конец таблицы
			Прервать;
		КонецЕсли;
		
		// Читаем всю строку
		СтрокаДанных = Новый Массив;
		Для Колонка = 1 По 14 Цикл
			Значение = ТабличныйДокументОтчета.Область(ТекСтрока, Колонка).Текст;
			СтрокаДанных.Добавить(СокрЛП(Значение));
		КонецЦикла;
		
		ДанныеЦенныхБумаг.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Возврат ДанныеЦенныхБумаг;
	
КонецФункции

&НаКлиенте
Функция НайтиИндексКолонкиXLSX(ДанныеТаблицы, ИмяКолонки)
	
	Если ДанныеТаблицы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Заголовки = ДанныеТаблицы[0]; // Первая строка - заголовки
	
	Для Инд = 0 По Заголовки.Количество() - 1 Цикл
		Если СтрЗаменить(Заголовки[Инд], " ", "") = СтрЗаменить(ИмяКолонки, " ", "") Тогда
			Возврат Инд;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ДесериализоватьСделкиИЗадолженностиПоСделкамTXT(ТекстОтчета, ПозицииРазделовОтчета)
	
	Операции = Новый Структура("Сделки, ЗадолженностиПоСделкам");
	
	СтрокаСделкиШаблон = Новый ФиксированнаяСтруктура("ИмяЗаписи, НомерСделки, ДатаСделки, КодЦеннойБумаги, ВидСделки, БумагиКоличество, СтавкаРЕПО, СуммаСделки, Купон, КомиссияБрокера, ТорговаяКомиссия, ЧастьСделкиРЕПО, ОтложенноеИсполнение, ДатаИсполнения, ДатаОплатыКомиссии");
	СтрокаЗадолженностиПоСделкеШаблон = Новый ФиксированнаяСтруктура("ИмяЗаписи, НомерСделки, ДатаСделки, КодЦеннойБумаги, ВидСделки, СуммаЗадолженностиПоСделке, СуммаЗадолженностиПоКупону, СуммаЗадолженностиПоТорговойКомиссии, СуммаЗадолженностиПоБрокерскойКомиссии, КоличествоЗадолженностиПоБумагам");
	 	
	Сделки = Новый Массив;
	ЗадолженностиПоСделкам = Новый Массив;
	
	КлючЗаключенныеСделки      = "ЗАКЛЮЧЕННЫЕ СДЕЛКИ:";
	КлючРанееЗаключенныеСделки = "РАНЕЕ ЗАКЛЮЧЕННЫЕ СДЕЛКИ, ПО КОТОРЫМ ПРОВЕДЕНЫ РАСЧЕТЫ";
	КлючСделкиРЕПО             = "CДЕЛКИ РЕПО";
	КлючЗадолженностиПоСделкам = "РАНЕЕ ЗАКЛЮЧЕННЫЕ СДЕЛКИ, НО НЕ ИСПОЛНЕННЫЕ";
		
	НомСтр = ПозицииРазделовОтчета.Сделки + 1;
		
	МаксЗначениеСчетчика = ПолучитьМаксЗначениеСчетчика(НомСтр, ПозицииРазделовОтчета, ТекстОтчета.КоличествоСтрок());
	
	Пока НомСтр <= МаксЗначениеСчетчика Цикл
		
		ТекСтрокаОтчета = ТекстОтчета.ПолучитьСтроку(НомСтр);
		
		Если СтрНачинаетсяС(ТекСтрокаОтчета, КлючЗаключенныеСделки) Тогда
			Операция = "Сделка";
		ИначеЕсли СтрНачинаетсяС(ТекСтрокаОтчета, КлючРанееЗаключенныеСделки) Тогда
			Операция = "ИсполнениеОбязательствПоСделке";
		ИначеЕсли СтрНачинаетсяС(ТекСтрокаОтчета, КлючСделкиРЕПО) Тогда
			Операция = "СделкаРЕПО";
		ИначеЕсли СтрНачинаетсяС(ТекСтрокаОтчета, КлючЗадолженностиПоСделкам) Тогда
			Операция = "ЗадолженностьПоСделке";
		Иначе
			Операция = Неопределено;
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
		
		Если ЗначениеЗаполнено(Операция) Тогда
			
			ЗначПолейТаблицы = ПрочитатьТаблицуОтчета(ТекстОтчета, МаксЗначениеСчетчика, НомСтр);
			
			Для Инд = 2 По ЗначПолейТаблицы.Количество() - 1 Цикл
				Если СтрНачинаетсяС(ЗначПолейТаблицы[Инд][0], "ИТОГО ") Тогда
					Прервать;
				КонецЕсли;
							
				Если Операция = "СделкаРЕПО" Тогда
					
					СтрокаСделкиРепо = Новый Структура(СтрокаСделкиШаблон);
					СтрокаСделкиРепо.ИмяЗаписи = Операция;
										
					ЧастьСделкиРЕПО = НРег(СокрЛП(ЗначПолейТаблицы[Инд][12]));
					
					ДатаСделки = СокрЛП(ЗначПолейТаблицы[Инд][1]);
					ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаСделки, 8), Прав(ДатаСделки, 8));
					
					ДатаРасчетов = СокрЛП(ЗначПолейТаблицы[Инд][13]);
					ДатаРасчетов = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаРасчетов, 8));
					
					СтатусИсполнения = СокрЛП(ЗначПолейТаблицы[Инд][14]);
					ДатаРасчетовФакт = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаРасчетов, 8));
					
					Если ЧастьСделкиРЕПО = "1 ч." Тогда
						
						СтрокаСделкиРепо.ЧастьСделкиРепо = 1;
						СтавкаРепо = 0;
						СтрокаСделкиРепо.ДатаОплатыКомиссии = ДатаСделки;
						СтрокаСделкиРепо.ДатаСделки = ДатаСделки;
						
						Если СтрокаСделкиРепо.ДатаСделки = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату 1-ой ч. сделки Репо [" + НРег(СокрЛП(ЗначПолейТаблицы[Инд][11])) + "]");
							Возврат Неопределено;
						КонецЕсли;
						
					ИначеЕсли ЧастьСделкиРЕПО = "2 ч." Тогда
						
						СтрокаСделкиРепо.ЧастьСделкиРепо = 2;
						СтавкаРепо = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][5]);
						СтрокаСделкиРепо.ДатаОплатыКомиссии = ДатаРасчетов;
						СтрокаСделкиРепо.ДатаСделки = ДатаРасчетов;
						
						Если СтрокаСделкиРепо.ДатаСделки = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату 2-ой ч. сделки Репо [" + НРег(СокрЛП(ЗначПолейТаблицы[Инд][11])) + "]");
							Возврат Неопределено;
						КонецЕсли;
						
					КонецЕсли;
										
					Если ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][2]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][2]);
						
					ИначеЕсли ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][3]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][3]);
						
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить вид сделки Репо [" + НРег(СокрЛП(ЗначПолейТаблицы[Инд][11])) + "] по значению полей: покупка [" + СокрЛП(ЗначПолейТаблицы[Инд][2]) + "], продажа [" + СокрЛП(ЗначПолейТаблицы[Инд][3]) + "]");
						Возврат Неопределено;	
					КонецЕсли;
					
					СтрокаСделкиРепо.НомерСделки        = НРег(СокрЛП(ЗначПолейТаблицы[Инд][11]));
					СтрокаСделкиРепо.КодЦеннойБумаги    = ПолучитьКодЦеннойБумаги(ЗначПолейТаблицы[Инд][0]);
					СтрокаСделкиРепо.ВидСделки          = ВидСделки;
					СтрокаСделкиРепо.БумагиКоличество   = Количество;
					СтрокаСделкиРепо.СтавкаРепо         = СтавкаРепо;
					СтрокаСделкиРепо.СуммаСделки        = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][6]);
					СтрокаСделкиРепо.Купон              = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][7]);
					СтрокаСделкиРепо.КомиссияБрокера    = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9]);
					СтрокаСделкиРепо.ТорговаяКомиссия   = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10]);
					
					Если ДатаРасчетов > НачалоДня(ДатаСделки) И ЧастьСделкиРЕПО = "2 ч." И СтатусИсполнения = "НЕЗАВЕРШЕНА" Тогда
					
						СтрокаСделкиРепо.ОтложенноеИсполнение = Истина;
						СтрокаСделкиРепо.ДатаИсполнения       = ДатаРасчетов;
						
						СтрокаЗадолженностиПоСделке = Новый Структура(СтрокаЗадолженностиПоСделкеШаблон);
						
						СтрокаЗадолженностиПоСделке.ДатаСделки      = ДатаСделки;
						СтрокаЗадолженностиПоСделке.НомерСделки     = СтрокаСделкиРепо.НомерСделки;
						СтрокаЗадолженностиПоСделке.ВидСделки       = СтрокаСделкиРепо.ВидСделки;
						СтрокаЗадолженностиПоСделке.КодЦеннойБумаги = СтрокаСделкиРепо.КодЦеннойБумаги;
						
						Если СтрокаСделкиРепо.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
							
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = СтрокаСделкиРепо.СуммаСделки;
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = СтрокаСделкиРепо.Купон; 
							СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = СтрокаСделкиРепо.БумагиКоличество;
							
						Иначе
							
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = ПреобразоватьВЧисло(СтрокаСделкиРепо.СуммаСделки, -1);
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = ПреобразоватьВЧисло(СтрокаСделкиРепо.Купон, -1); 
							СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = СтрокаСделкиРепо.БумагиКоличество;
							
						КонецЕсли;
						
						СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоБрокерскойКомиссии = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9], -1);
						СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоТорговойКомиссии   = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10], -1);
						
						ЗадолженностиПоСделкам.Добавить(СтрокаЗадолженностиПоСделке);
						
					Иначе
						
						СтрокаСделкиРепо.ОтложенноеИсполнение = Ложь;
						
					КонецЕсли;
					
					Сделки.Добавить(СтрокаСделкиРепо);
					
				ИначеЕсли Операция = "Сделка" Тогда
										
					СтрокаСделки = Новый Структура(СтрокаСделкиШаблон);
					СтрокаСделки.ИмяЗаписи = Операция;

					ДатаСделки = СокрЛП(ЗначПолейТаблицы[Инд][1]);
					ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаСделки, 8), Прав(ДатаСделки, 8));
					
					Если ДатаСделки = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату сделки [" + СокрЛП(ЗначПолейТаблицы[Инд][2]) + "]");
						Возврат Неопределено;
					КонецЕсли;
					
					Если ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][3]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][3]);
						
					ИначеЕсли ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][4]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][4]);
						
					Иначе
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить вид сделки [" + СокрЛП(ЗначПолейТаблицы[Инд][2]) + "] по значению полей полей: покупка [" + СокрЛП(ЗначПолейТаблицы[Инд][3]) + "], продажа [" + СокрЛП(ЗначПолейТаблицы[Инд][4]) + "]");
						Возврат Неопределено;	
						
					КонецЕсли;
					
					СтрокаСделки.ДатаСделки       = ДатаСделки;
					СтрокаСделки.НомерСделки      = СокрЛП(ЗначПолейТаблицы[Инд][2]);
					СтрокаСделки.КодЦеннойБумаги  = ПолучитьКодЦеннойБумаги(ЗначПолейТаблицы[Инд][0]);
					СтрокаСделки.ВидСделки        = ВидСделки;
					СтрокаСделки.БумагиКоличество = Количество;
					СтрокаСделки.СуммаСделки      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][6]);
					СтрокаСделки.Купон            = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][7]);
					СтрокаСделки.КомиссияБрокера  = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9]);
					СтрокаСделки.ТорговаяКомиссия = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10]);
										
					ДатаРасчетов = СокрЛП(ЗначПолейТаблицы[Инд][12]);
					ДатаРасчетов = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаРасчетов, 8), "00:00:00");
					
					СтрокаСделки.ДатаОплатыКомиссии = ДатаРасчетов;

					Если ДатаРасчетов = Неопределено Тогда 
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату расчетов по сделке [" + СтрокаСделки.НомерСделки + "]");
						Возврат Неопределено;
						
					ИначеЕсли ДатаРасчетов > НачалоДня(ДатаСделки) Тогда
						
						СтрокаСделки.ОтложенноеИсполнение = Истина;
						СтрокаСделки.ДатаИсполнения       = ДатаРасчетов;
						
						//Если сделка с отложенным исполнением записывает строку данных в задолженности
						СтрокаЗадолженностиПоСделке = Новый Структура(СтрокаЗадолженностиПоСделкеШаблон);
						
						СтрокаЗадолженностиПоСделке.ДатаСделки      = СтрокаСделки.ДатаСделки;
						СтрокаЗадолженностиПоСделке.НомерСделки     = СтрокаСделки.НомерСделки;
						СтрокаЗадолженностиПоСделке.ВидСделки       = СтрокаСделки.ВидСделки;
						СтрокаЗадолженностиПоСделке.КодЦеннойБумаги = СтрокаСделки.КодЦеннойБумаги;
							
						Если СтрокаСделки.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
							
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = СтрокаСделки.СуммаСделки;
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = СтрокаСделки.Купон; 
							СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = ПреобразоватьВЧисло(СтрокаСделки.БумагиКоличество, -1);
							
						Иначе
							
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = ПреобразоватьВЧисло(СтрокаСделки.СуммаСделки, -1);
							СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = ПреобразоватьВЧисло(СтрокаСделки.Купон, -1); 
							СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = СтрокаСделки.БумагиКоличество;
							
						КонецЕсли;
							
				    	СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоБрокерскойКомиссии = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9], -1);
						СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоТорговойКомиссии   = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10], -1);
						
						ЗадолженностиПоСделкам.Добавить(СтрокаЗадолженностиПоСделке);

					Иначе
						
						СтрокаСделки.ОтложенноеИсполнение = Ложь;
											
					КонецЕсли;
					
					Сделки.Добавить(СтрокаСделки);
					
				ИначеЕсли Операция = "ЗадолженностьПоСделке" Тогда
									
					СтрокаЗадолженностиПоСделке = Новый Структура(СтрокаЗадолженностиПоСделкеШаблон);
					СтрокаЗадолженностиПоСделке.ИмяЗаписи = Операция;

					ДатаСделки = СокрЛП(ЗначПолейТаблицы[Инд][1]);
					ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаСделки, 8), Прав(ДатаСделки, 8));
					
					Если ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][3]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][3]);
						Сумма      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][6], -1);
						Купон      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][7], -1);
						
					ИначеЕсли ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][4]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][4], -1);
						Сумма      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][6]);
						Купон      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][7]);
						
					Иначе
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. В таблице [Ранее заключенные сделки, но не исполненные] не удалось определить количество ценных бумаг для сделки [" + СокрЛП(ЗначПолейТаблицы[Инд][2]) + "]");
						Возврат Неопределено;
						
					КонецЕсли;
					
					СтрокаЗадолженностиПоСделке.ДатаСделки                             = ДатаСделки;
					СтрокаЗадолженностиПоСделке.НомерСделки                            = СокрЛП(ЗначПолейТаблицы[Инд][2]);
					СтрокаЗадолженностиПоСделке.КодЦеннойБумаги                        = ПолучитьКодЦеннойБумаги(ЗначПолейТаблицы[Инд][0]);
					СтрокаЗадолженностиПоСделке.ВидСделки                              = ВидСделки;
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке             = Сумма;
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону             = Купон;
					СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам       = Количество;
				    СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоБрокерскойКомиссии = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9], -1);
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоТорговойКомиссии   = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10], -1);
				
					ЗадолженностиПоСделкам.Добавить(СтрокаЗадолженностиПоСделке);
		   
				ИначеЕсли Операция = "ИсполнениеОбязательствПоСделке" Тогда
										
					СтрокаИсполненияПоСделке = Новый Структура(СтрокаСделкиШаблон);
					СтрокаИсполненияПоСделке.ИмяЗаписи = Операция;
					
					ДатаСделки = СокрЛП(ЗначПолейТаблицы[Инд][1]);
					ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаСделки, 8), Прав(ДатаСделки, 8));
									
					Если ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][3]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][3]);
						
					ИначеЕсли ЗначениеБольшеНуля(ЗначПолейТаблицы[Инд][4]) Тогда
						
						ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
						Количество = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][4]);
						
					Иначе
					
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. В таблице [Ранее заключенные сделки, по которым проведены расчеты] не удалось определить количество ценных бумаг для сделки [" + СокрЛП(ЗначПолейТаблицы[Инд][2]) + "]");
						Возврат Неопределено;
						
					КонецЕсли;
					
					СтрокаИсполненияПоСделке.ДатаСделки       = ДатаСделки;
					СтрокаИсполненияПоСделке.НомерСделки      = СокрЛП(ЗначПолейТаблицы[Инд][2]);
					СтрокаИсполненияПоСделке.КодЦеннойБумаги  = ПолучитьКодЦеннойБумаги(ЗначПолейТаблицы[Инд][0]);
					СтрокаИсполненияПоСделке.ВидСделки        = ВидСделки;
					СтрокаИсполненияПоСделке.БумагиКоличество = Количество;
					СтрокаИсполненияПоСделке.СуммаСделки      = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][6]);
					СтрокаИсполненияПоСделке.Купон            = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][7]);
					СтрокаИсполненияПоСделке.КомиссияБрокера  = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][9]);
					СтрокаИсполненияПоСделке.ТорговаяКомиссия = ПреобразоватьВЧисло(ЗначПолейТаблицы[Инд][10]);
					
					ДатаИсполнения = СокрЛП(ЗначПолейТаблицы[Инд][12]);
					ДатаИсполнения = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(ДатаИсполнения, 8));
					
					Если ДатаИсполнения = Неопределено Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату исполнения сделки [" + СтрокаИсполненияПоСделке.НомерСделки + "]");
						Возврат Неопределено;
						
					КонецЕсли;
					
					СтрокаИсполненияПоСделке.ДатаИсполнения = ДатаИсполнения;
					
					Сделки.Добавить(СтрокаИсполненияПоСделке);
															
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Операции.Сделки = Сделки;
	Операции.ЗадолженностиПоСделкам = ЗадолженностиПоСделкам;
			
	Возврат Операции;
		
КонецФункции

&НаКлиенте
Функция ДесериализоватьСделкиИЗадолженностиПоСделкамXLSX(ТабличныйДокументОтчета)
	
	Операции = Новый Структура("Сделки, ЗадолженностиПоСделкам");
	
	СтрокаСделкиШаблон = Новый ФиксированнаяСтруктура("ИмяЗаписи, НомерСделки, ДатаСделки, КодЦеннойБумаги, ВидСделки, БумагиКоличество, СтавкаРЕПО, СуммаСделки, Купон, КомиссияБрокера, ТорговаяКомиссия, ЧастьСделкиРЕПО, ОтложенноеИсполнение, ДатаИсполнения, ДатаОплатыКомиссии");
	СтрокаЗадолженностиПоСделкеШаблон = Новый ФиксированнаяСтруктура("ИмяЗаписи, НомерСделки, ДатаСделки, КодЦеннойБумаги, ВидСделки, СуммаЗадолженностиПоСделке, СуммаЗадолженностиПоКупону, СуммаЗадолженностиПоТорговойКомиссии, СуммаЗадолженностиПоБрокерскойКомиссии, КоличествоЗадолженностиПоБумагам");
	
	Сделки = Новый Массив;
	ЗадолженностиПоСделкам = Новый Массив;
	
	ЗаключенныеСделки = ПрочитатьТаблицуСделокXLSX(ТабличныйДокументОтчета);
	ЗаключенныеСделкиРЕПО = ПрочитатьТаблицуСделокРЕПОXLSX(ТабличныйДокументОтчета);
	
	Если ЗаключенныеСделкиРЕПО.Количество() > 0 Тогда
		Для Инд = 2 По ЗаключенныеСделкиРЕПО.Количество() - 1 Цикл
			Если СтрНачинаетсяС(ЗаключенныеСделкиРЕПО[Инд][0], "Итого") Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаСделкиРепо = Новый Структура(СтрокаСделкиШаблон);
			СтрокаСделкиРепо.ИмяЗаписи = "СделкаРЕПО";
			
			ЧастьСделкиРЕПО = ЗаключенныеСделкиРЕПО[Инд][22];
			
			ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделкиРЕПО[Инд][2], ЗаключенныеСделкиРЕПО[Инд][3]);
			ДатаРасчетовПлан = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделкиРЕПО[Инд][18]);
			ДатаРасчетовФакт = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделкиРЕПО[Инд][19]);
			
			Если ЧастьСделкиРЕПО = "1" Тогда
				
				СтрокаСделкиРепо.ЧастьСделкиРепо = 1;
				СтавкаРепо = 0;
				СтрокаСделкиРепо.ДатаСделки = ДатаСделки;
				СтрокаСделкиРепо.ДатаОплатыКомиссии = ДатаСделки;
				
				Если СтрокаСделкиРепо.ДатаСделки = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату 1-ой ч. сделки Репо [" + НРег(СокрЛП(ЗаключенныеСделкиРЕПО[Инд][4])) + "]");
					Возврат Неопределено;
				КонецЕсли;
				
			ИначеЕсли ЧастьСделкиРЕПО = "2" Тогда
				
				СтрокаСделкиРепо.ЧастьСделкиРепо = 2;
				СтавкаРепо = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][14],,Ложь);
				СтрокаСделкиРепо.ДатаСделки = ДатаРасчетовПлан;
				СтрокаСделкиРепо.ДатаОплатыКомиссии = ДатаРасчетовПлан;
				
				Если СтрокаСделкиРепо.ДатаСделки = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату 2-ой ч. сделки Репо [" + НРег(СокрЛП(ЗаключенныеСделкиРЕПО[Инд][4])) + "]");
					Возврат Неопределено;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗаключенныеСделкиРЕПО[Инд][6] = "Покупка" Тогда
				ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
				Количество = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][7],,Ложь);
			ИначеЕсли ЗаключенныеСделкиРЕПО[Инд][6] = "Продажа" Тогда
				ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
				Количество = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][7], -1, Ложь);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить вид сделки Репо [" + НРег(СокрЛП(ЗаключенныеСделкиРЕПО[Инд][4])) + "] по значению полей: покупка [" + СокрЛП(ЗаключенныеСделкиРЕПО[Инд][7]) + "], продажа [" + СокрЛП(ЗаключенныеСделкиРЕПО[Инд][7]) + "]");
				Возврат Неопределено;	
			КонецЕсли;
			
			СтрокаСделкиРепо.НомерСделки        = НРег(СокрЛП(ЗаключенныеСделкиРЕПО[Инд][4]));
			СтрокаСделкиРепо.КодЦеннойБумаги    = ПолучитьКодЦеннойБумагиПоISIN(ЗаключенныеСделкиРЕПО[Инд][1], ЭтаФорма.ДатаСверки);
			СтрокаСделкиРепо.ВидСделки          = ВидСделки;
			СтрокаСделкиРепо.БумагиКоличество   = Количество;
			СтрокаСделкиРепо.СтавкаРепо         = СтавкаРепо;
			
			Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда 
				СтрокаСделкиРепо.СуммаСделки    = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][9], -1, Ложь);
			ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда 
				СтрокаСделкиРепо.СуммаСделки    = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][9],,Ложь);
			КонецЕсли;
			
			Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
				СтрокаСделкиРепо.Купон          = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][10], -1, Ложь);
			ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
				СтрокаСделкиРепо.Купон          = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][10],,Ложь);
			КонецЕсли;
			
			СтрокаСделкиРепо.КомиссияБрокера    = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][15], -1, Ложь);
			СтрокаСделкиРепо.ТорговаяКомиссия   = ПреобразоватьВЧисло(ЗаключенныеСделкиРЕПО[Инд][17], -1, Ложь);
				
			Если ДатаРасчетовПлан > НачалоДня(ДатаСделки) И ЧастьСделкиРЕПО = "2" И НЕ ЗначениеЗаполнено(ДатаРасчетовФакт) Тогда
				
				СтрокаСделкиРепо.ОтложенноеИсполнение = Истина;
				СтрокаСделкиРепо.ДатаИсполнения       = ДатаРасчетовПлан;
				
				СтрокаЗадолженностиПоСделкеРепо = Новый Структура(СтрокаЗадолженностиПоСделкеШаблон);
				
				СтрокаЗадолженностиПоСделкеРепо.ДатаСделки      = ДатаСделки;
				СтрокаЗадолженностиПоСделкеРепо.НомерСделки     = СтрокаСделкиРепо.НомерСделки;
				СтрокаЗадолженностиПоСделкеРепо.ВидСделки       = СтрокаСделкиРепо.ВидСделки;
				СтрокаЗадолженностиПоСделкеРепо.КодЦеннойБумаги = СтрокаСделкиРепо.КодЦеннойБумаги;
				
				СтрокаЗадолженностиПоСделкеРепо.СуммаЗадолженностиПоСделке       = СтрокаСделкиРепо.СуммаСделки;
				СтрокаЗадолженностиПоСделкеРепо.СуммаЗадолженностиПоКупону       = СтрокаСделкиРепо.Купон; 
				СтрокаЗадолженностиПоСделкеРепо.КоличествоЗадолженностиПоБумагам = СтрокаСделкиРепо.БумагиКоличество;
				
				СтрокаЗадолженностиПоСделкеРепо.СуммаЗадолженностиПоБрокерскойКомиссии = СтрокаСделкиРепо.КомиссияБрокера;
				СтрокаЗадолженностиПоСделкеРепо.СуммаЗадолженностиПоТорговойКомиссии   = СтрокаСделкиРепо.ТорговаяКомиссия;
				
				ЗадолженностиПоСделкам.Добавить(СтрокаЗадолженностиПоСделкеРепо);
				
			Иначе
				СтрокаСделкиРепо.ОтложенноеИсполнение = Ложь;
			КонецЕсли;
			
			Сделки.Добавить(СтрокаСделкиРепо);
		КонецЦикла;
	КонецЕсли;
	Если ЗаключенныеСделки.Количество() > 0 Тогда
		
		Для Инд = 2 По ЗаключенныеСделки.Количество() - 1 Цикл
			
			Если СтрНачинаетсяС(ЗаключенныеСделки[Инд][0], "Итого") ИЛИ ЗаключенныеСделки[Инд][0] = "" Тогда
				Прервать;
			КонецЕсли;

			ДатаСделки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделки[Инд][2], ЗаключенныеСделки[Инд][3]);
			
			Если ДатаСделки = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить дату сделки [" + СокрЛП(ЗаключенныеСделки[Инд][4]) + "]");
				Возврат Неопределено;
			КонецЕсли;
			
			Если ЗаключенныеСделки[Инд][6] = "Покупка" Тогда
				ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
				Количество = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][7],,Ложь);
			ИначеЕсли ЗаключенныеСделки[Инд][6] = "Продажа" Тогда
				ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
				Количество = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][7], -1, Ложь);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить вид сделки [" + НРег(СокрЛП(ЗаключенныеСделки[Инд][4])) + "] по значению полей: покупка [" + СокрЛП(ЗаключенныеСделки[Инд][7]) + "], продажа [" + СокрЛП(ЗаключенныеСделки[Инд][7]) + "]");
				Возврат Неопределено;	
			КонецЕсли;
			
			ДатаРасчетовПлан = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделки[Инд][17], "00:00:00");
			ДатаРасчетовФакт = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЗаключенныеСделки[Инд][18], "00:00:00");
			
			Если ЗначениеЗаполнено(ДатаРасчетовФакт) 
				И ДатаРасчетовФакт > НачалоДня(ДатаСделки) 
				И ДатаРасчетовПлан > НачалоДня(ЭтаФорма.ДатаСверки) Тогда
				
				ТекстСообщения = СтрШаблон("Сделка № %1 исполнена досрочно. 
					|Плановая дата расчетов (%2) больше даты сверки, но факт расчетов уже прошел (%3). 
					|Текущий алгоритм не рассчитан на этот сценарий.",
					СокрЛП(ЗаключенныеСделки[Инд][4]),
					Формат(ДатаРасчетовПлан, "ДФ=dd.MM.yyyy"),
					Формат(ДатаРасчетовФакт, "ДФ=dd.MM.yyyy"));
				
				ВызватьИсключение ТекстСообщения;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаРасчетовФакт) И ДатаРасчетовФакт > НачалоДня(ДатаСделки) Тогда
				
				СтрокаИсполненияПоСделке = Новый Структура(СтрокаСделкиШаблон);
				СтрокаИсполненияПоСделке.ИмяЗаписи = "ИсполнениеОбязательствПоСделке";
				
				Если ЗаключенныеСделки[Инд][6] = "Покупка" Тогда
					ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка");
					Количество = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][7],,Ложь);
				ИначеЕсли ЗаключенныеСделки[Инд][6] = "Продажа" Тогда
					ВидСделки  = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа");
					Количество = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][7], -1, Ложь);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Не удалось определить вид сделки [" + НРег(СокрЛП(ЗаключенныеСделки[Инд][4])) + "] по значению полей: покупка [" + СокрЛП(ЗаключенныеСделки[Инд][7]) + "], продажа [" + СокрЛП(ЗаключенныеСделки[Инд][7]) + "]");
					Возврат Неопределено;	
				КонецЕсли;
				
				СтрокаИсполненияПоСделке.ДатаСделки       = ДатаСделки;
				СтрокаИсполненияПоСделке.НомерСделки      = СокрЛП(ЗаключенныеСделки[Инд][4]);
				СтрокаИсполненияПоСделке.КодЦеннойБумаги  = ПолучитьКодЦеннойБумагиПоISIN(ЗаключенныеСделки[Инд][1], ЭтаФорма.ДатаСверки);
				СтрокаИсполненияПоСделке.ВидСделки        = ВидСделки;
				СтрокаИсполненияПоСделке.БумагиКоличество = Количество;
				
				Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда 
					СтрокаИсполненияПоСделке.СуммаСделки  = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][9], -1, Ложь);
				ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда 
					СтрокаИсполненияПоСделке.СуммаСделки  = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][9],,Ложь);
				КонецЕсли;
				
				Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
					СтрокаИсполненияПоСделке.Купон        = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][10], -1, Ложь);
				ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
					СтрокаИсполненияПоСделке.Купон        = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][10],,Ложь);
				КонецЕсли;
			
				СтрокаИсполненияПоСделке.КомиссияБрокера  = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][14], -1, Ложь);
				СтрокаИсполненияПоСделке.ТорговаяКомиссия = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][16], -1, Ложь);
				
				СтрокаИсполненияПоСделке.ДатаИсполнения = ДатаРасчетовФакт;
				
				Сделки.Добавить(СтрокаИсполненияПоСделке);
				
			Иначе
				
				СтрокаСделки = Новый Структура(СтрокаСделкиШаблон);
				
				СтрокаСделки.ИмяЗаписи = "Сделка";
				СтрокаСделки.ДатаСделки       = ДатаСделки;
				СтрокаСделки.НомерСделки      = СокрЛП(ЗаключенныеСделки[Инд][4]);
				СтрокаСделки.КодЦеннойБумаги  = ПолучитьКодЦеннойБумагиПоISIN(ЗаключенныеСделки[Инд][1], ЭтаФорма.ДатаСверки);
				СтрокаСделки.ВидСделки        = ВидСделки;
				СтрокаСделки.БумагиКоличество = Количество;
				
				Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда 
					СтрокаСделки.СуммаСделки    = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][9], -1, Ложь);
				ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда 
					СтрокаСделки.СуммаСделки    = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][9],,Ложь);
				КонецЕсли;
				
				Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
					СтрокаСделки.Купон          = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][10], -1, Ложь);
				ИначеЕсли ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
					СтрокаСделки.Купон          = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][10],,Ложь);
				КонецЕсли;
				
				СтрокаСделки.КомиссияБрокера    = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][14], -1, Ложь);
				СтрокаСделки.ТорговаяКомиссия   = ПреобразоватьВЧисло(ЗаключенныеСделки[Инд][16], -1, Ложь);

				СтрокаСделки.ДатаОплатыКомиссии   = ДатаРасчетовПлан;
				СтрокаСделки.ОтложенноеИсполнение = (ДатаРасчетовПлан > НачалоДня(ДатаСделки));
				
				Сделки.Добавить(СтрокаСделки);
				
			КонецЕсли;
			
			Если ДатаРасчетовПлан > НачалоДня(ДатаСверки) Тогда
				
				СтрокаСделки.ОтложенноеИсполнение = Истина;
				СтрокаСделки.ДатаИсполнения       = ДатаРасчетовПлан;
				
				СтрокаЗадолженностиПоСделке = Новый Структура(СтрокаЗадолженностиПоСделкеШаблон);
				
				СтрокаЗадолженностиПоСделке.ДатаСделки      = СтрокаСделки.ДатаСделки;
				СтрокаЗадолженностиПоСделке.НомерСделки     = СтрокаСделки.НомерСделки;
				СтрокаЗадолженностиПоСделке.ВидСделки       = СтрокаСделки.ВидСделки;
				СтрокаЗадолженностиПоСделке.КодЦеннойБумаги = СтрокаСделки.КодЦеннойБумаги;
				
				Если СтрокаСделки.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа") Тогда
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = СтрокаСделки.СуммаСделки;
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = СтрокаСделки.Купон; 
					СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = ПреобразоватьВЧисло(СтрокаСделки.БумагиКоличество, -1, Ложь);
				Иначе
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоСделке       = ПреобразоватьВЧисло(СтрокаСделки.СуммаСделки, -1, Ложь);
					СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоКупону       = ПреобразоватьВЧисло(СтрокаСделки.Купон, -1, Ложь); 
					СтрокаЗадолженностиПоСделке.КоличествоЗадолженностиПоБумагам = СтрокаСделки.БумагиКоличество;
				КонецЕсли;
				
				СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоБрокерскойКомиссии = ПреобразоватьВЧисло(СтрокаСделки.КомиссияБрокера, -1, Ложь);
				СтрокаЗадолженностиПоСделке.СуммаЗадолженностиПоТорговойКомиссии   = ПреобразоватьВЧисло(СтрокаСделки.ТорговаяКомиссия, -1, Ложь);
				
				ЗадолженностиПоСделкам.Добавить(СтрокаЗадолженностиПоСделке);
				
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	
	Операции.Сделки = Сделки;
	Операции.ЗадолженностиПоСделкам = ЗадолженностиПоСделкам;
	
	Возврат Операции;
		
КонецФункции

&НаКлиенте
Функция ПрочитатьТаблицуСделокXLSX(ТабличныйДокументОтчета)
	
	Сделки = Новый Массив;
	
	// Ищем начало таблицы
	ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст("Сделки купли/продажи, заключённые в отчётном периоде, а также ранее заключённые сделки, подлежащие исполнению");
	Если ОбластьЗаголовка = Неопределено Тогда
		Возврат Сделки;
	КонецЕсли;
	
	НачальнаяСтрока = ОбластьЗаголовка.Низ + 2;
	МаксСтрок = ТабличныйДокументОтчета.ВысотаТаблицы;
	
	// Читаем заголовки
	СтрокаЗаголовков = Новый Массив;
	Для Колонка = 1 По 21 Цикл // Предполагаем максимум 21 колонка
		Значение = ТабличныйДокументОтчета.Область(НачальнаяСтрока, Колонка).Текст;
		СтрокаЗаголовков.Добавить(СокрЛП(Значение));
	КонецЦикла;
	Сделки.Добавить(СтрокаЗаголовков);
	
	// Читаем данные
	Для Счетчик = 1 По МаксСтрок - 1 Цикл
		ТекСтрока = НачальнаяСтрока + Счетчик;
		
		// Проверяем, есть ли данные в первой колонке
		ТекстПервойКолонки = ТабличныйДокументОтчета.Область(ТекСтрока, 1).Текст;
		Если ТекстПервойКолонки = "" ИЛИ СтрНачинаетсяС(ТекстПервойКолонки, "Итого") Тогда
			// Конец таблицы
			Прервать;
		КонецЕсли;
		
		// Читаем всю строку
		СтрокаДанных = Новый Массив;
		Для Колонка = 1 По 21 Цикл
			Значение = ТабличныйДокументОтчета.Область(ТекСтрока, Колонка).Текст;
			СтрокаДанных.Добавить(СокрЛП(Значение));
		КонецЦикла;
		
		Сделки.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Возврат Сделки;
	
КонецФункции

&НаКлиенте
Функция ПрочитатьТаблицуСделокРЕПОXLSX(ТабличныйДокументОтчета)
	
	СделкиРЕПО = Новый Массив;
	
	// Ищем начало таблицы
	ОбластьЗаголовка = ТабличныйДокументОтчета.НайтиТекст("Сделки репо");
	Если ОбластьЗаголовка = Неопределено Тогда
		Возврат СделкиРЕПО;
	КонецЕсли;
	
	НачальнаяСтрока = ОбластьЗаголовка.Низ + 2;
	МаксСтрок = ТабличныйДокументОтчета.ВысотаТаблицы; // Ограничение на чтение строк
	
	// Читаем заголовки
	СтрокаЗаголовков = Новый Массив;
	Для Колонка = 1 По 23 Цикл // Предполагаем максимум 23 колонки
		Значение = ТабличныйДокументОтчета.Область(НачальнаяСтрока, Колонка).Текст;
		СтрокаЗаголовков.Добавить(СокрЛП(Значение));
	КонецЦикла;
	СделкиРЕПО.Добавить(СтрокаЗаголовков);
	
	// Читаем данные
	Для Счетчик = 1 По МаксСтрок - 1 Цикл
		ТекСтрока = НачальнаяСтрока + Счетчик;
		
		// Проверяем, есть ли данные в первой колонке
		ТекстПервойКолонки = ТабличныйДокументОтчета.Область(ТекСтрока, 1).Текст;
		Если ТекстПервойКолонки = "" ИЛИ СтрНачинаетсяС(ТекстПервойКолонки, "Итого") Тогда
			// Конец таблицы
			Прервать;
		КонецЕсли;
		
		// Читаем всю строку
		СтрокаДанных = Новый Массив;
		Для Колонка = 1 По 23 Цикл
			Значение = ТабличныйДокументОтчета.Область(ТекСтрока, Колонка).Текст;
			СтрокаДанных.Добавить(СокрЛП(Значение));
		КонецЦикла;
		
		СделкиРЕПО.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Возврат СделкиРЕПО;
	
КонецФункции

&НаКлиенте
Функция ОбработатьТекстОтчета(ИмяФайлОтчета)
	
	ПолноеИмяФайла = Объект.КаталогДанных + "\" + ИмяФайлОтчета;
		
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Не Файл.Существует() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл [" + ИмяФайлОтчета + "] не найден. Возможно он был удален или перемещен", "ФайлОтчетаБрокера");
		Возврат Неопределено;                                        
		
	КонецЕсли;
	
	ТекстОтчета = Новый ТекстовыйДокумент;
	ТекстОтчета.ТолькоПросмотр       = Истина;
	ТекстОтчета.ИспользуемоеИмяФайла = ПолноеИмяФайла;
	ТекстОтчета.Прочитать(ПолноеИмяФайла);
		
	// первичная обработка текста отчета:
	//	- удалим пустые строки
	//	- удалим строки по шаблону " СТРАНИЦА [Х] ИЗ [Y]"
	//	- в оставшихся строках удалим краевые пробелы и преобразуем к верхнему регистру
	
	Для Инд = -ТекстОтчета.КоличествоСтрок() По -1 Цикл
		ТекСтрокаОтчета = ТекстОтчета.ПолучитьСтроку(-Инд);
		ТекСтрокаОтчета = СокрЛП(ВРег(ТекСтрокаОтчета));
		
		Если ПустаяСтрока(ТекСтрокаОтчета) Или (Найти(ТекСтрокаОтчета, "СТРАНИЦА") > 0 И Найти(ТекСтрокаОтчета, "ИЗ") > 0) Тогда
			ТекстОтчета.УдалитьСтроку(-Инд);
		Иначе
			ТекстОтчета.ЗаменитьСтроку(-Инд, ТекСтрокаОтчета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстОтчета;
	
КонецФункции

&НаКлиенте
Функция ПолучитьКодСчетаДоверительногоУправленияИзИмениФайла(Знач ИмяФайла)
	
	// Примеры файлов, которые мы обрабатываем:
	//		i02_28218_k_d_170418.txt
	//		i02_28218_k_d_170418_EUR.txt
	//		i02_28218_k_d_170418_USD.txt
	
	ИмяФайла = ВРег(ИмяФайла);
	Ключ1    = ВРег("i02_");
	Ключ2    = ВРег("_k_d");
	
	КодКлиента = Подстрока(ИмяФайла, Найти(ИмяФайла, Ключ1) + СтрДлина(Ключ1), Найти(ИмяФайла, Ключ2) - 1);
	
	Возврат КодКлиента;
		
КонецФункции

&НаКлиенте
Функция Проверить(ПараметрыПроверки) Экспорт
	
	ДатаСверки = ПараметрыПроверки.ДатаСверки;
	Объект.Организация = ПараметрыПроверки.Организация;
	СчетаДУ = ПараметрыПроверки.СчетаДоверительногоУправления;
	
	ЗаполнитьКаталогДанных();
	
	ДанныеСверкиДляБухгалтерии = Новый Массив;
	
	КомандаОбновитьСписокФайлов(Неопределено);
	
	Для Каждого СтрокаТаблицыФайлыОтчетов из ФайлыОтчетов Цикл 
		Если СчетаДУ.Найти(СтрокаТаблицыФайлыОтчетов.СчетДоверительногоУправления) = Неопределено Тогда 
			СтрокаТаблицыФайлыОтчетов.Выбран = Ложь;
		КонецЕсли;					
	КонецЦикла;	
	
	ОбработатьОтчетыБрокера(Неопределено, ДанныеСверкиДляБухгалтерии);
	
	Возврат Новый Структура("СверкаСОтчетомБрокера", ДанныеСверкиДляБухгалтерии);	
	
	
КонецФункции	

&НаКлиенте
Процедура ТипФайлаСверкиПриИзменении(Элемент)
	КомандаОбновитьСписокФайлов(Неопределено);
КонецПроцедуры

#КонецОбласти
