 Функция ПолучитьСчетОткудаДляКопированияНастроек(Период, Организация, СчетДоверительногоУправленияКуда) Экспорт
	
	ВидДоговора = СчетДоверительногоУправленияКуда.ВидДоговораДоверительногоУправления;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 1
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 2
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 3
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 2
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 2
	|		КОГДА (&ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				ИЛИ &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов))
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
	|			ТОГДА 3
	|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 4
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 5
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 6
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 5
	|		КОГДА &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 5
	|		КОГДА (&ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
	|				ИЛИ &ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов))
	|				И КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
	|				И КлиентыДоверительногоУправленияСрезПоследних.Клиент <> &Клиент
	|			ТОГДА 6
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК ПорядокПредпочтения,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет
	|		ИЛИ НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ЕстьНастройкиБУ,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет КАК ЕстьНастройкиНУ
	|ПОМЕСТИТЬ _СчетаДляВыбора
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&МассивВидовДоговоров)
	|				И СчетДоверительногоУправления <> &СчетДоверительногоУправленияКуда
	|				И (СчетДоверительногоУправления.ДатаРасторжения > &Период
	|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения ЕСТЬ NULL)) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних
	|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	_СчетаДляВыбора.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_СчетаДляВыбора КАК _СчетаДляВыбора
	|ГДЕ
	|	_СчетаДляВыбора.ПорядокПредпочтения <> 100
	|	И ВЫБОР
	|			КОГДА (&ВестиБухгалтерскийУчет
	|						И _СчетаДляВыбора.ЕстьНастройкиБУ
	|					ИЛИ НЕ &ВестиБухгалтерскийУчет)
	|					И (&ВестиНалоговыйУчет
	|							И _СчетаДляВыбора.ЕстьНастройкиНУ
	|						ИЛИ НЕ &ВестиНалоговыйУчет)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	_СчетаДляВыбора.ПорядокПредпочтения";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияКуда", СчетДоверительногоУправленияКуда);
	
	Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда
		Запрос.УстановитьПараметр("ВестиБухгалтерскийУчет", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВестиБухгалтерскийУчет", Истина);
	КонецЕсли;

	
	Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов Тогда
		Запрос.УстановитьПараметр("ВестиНалоговыйУчет", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВестиНалоговыйУчет", Истина);
	КонецЕсли;
	
	
	МассивВидовДоговоров = Новый Массив;
	Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями 
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов Тогда
		
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
		МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов); 
	Иначе
		МассивВидовДоговоров.Добавить(ВидДоговора);
	КонецЕсли;

	Запрос.УстановитьПараметр("МассивВидовДоговоров", МассивВидовДоговоров);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", ВидДоговора);
	Запрос.УстановитьПараметр("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправленияКуда, Период)); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.СчетДоверительногоУправления;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура АвтоматическийПереносНастроекБухгалтерии(Организация, СчетКуда, ДатаУстановки) Экспорт
	
	Отказ = Ложь;
	
	КопированиеНастроек = Обработки.КопированиеНастроекСчетаДоверительногоУправления.Создать();  
	
	КопированиеНастроек.Организация = Организация;
	КопированиеНастроек.СчетДоверительногоУправленияКуда = СчетКуда;
	КопированиеНастроек.ДатаУстановки = ДатаУстановки;
	КопированиеНастроек.СчетДоверительногоУправленияОткуда = Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолучитьСчетОткудаДляКопированияНастроек(ДатаУстановки, Организация, СчетКуда);
	КопированиеНастроек.ДатаВзятия = ТекущаяДатаСеанса();
	
	ТекстОшибки = ""; 

	НастройкиПереноса = КопированиеНастроек.ПолучитьПараметрыПереносаНастроекБухПоУмолчанию();  
	НастройкиДляСтатистики = ПолучитьСписокНастроекДляСтатистики(КопированиеНастроек, НастройкиПереноса);

	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(НастройкиДляСтатистики);
	Механизм = Метаданные.Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если ЗначениеЗаполнено(КопированиеНастроек.СчетДоверительногоУправленияОткуда) Тогда 
		
		НастройкиПереноса.Вставить("ПодтверждениеПереноса", Истина);
		ОтчетОПереносе = Новый ТабличныйДокумент;
		КопированиеНастроек.ПереносНастроекБух(ОтчетОПереносе, НастройкиПереноса, Отказ, Истина, ТекстОшибки);
			
	Иначе 
		ТекстОшибки = "Не удалось определить счет источник настроек. Перенос настроек не выполнен.";
	КонецЕсли;
	
	КопированиеНастроек.ОтправитьОповещение(ОтчетОПереносе, НастройкиПереноса, Истина, ТекстОшибки);

	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
	
	
КонецПроцедуры 


Функция ПолучитьСписокНастроекДляСтатистики(ОбработкаОбъект, НастройкиПереноса) Экспорт

	НастройкиСтатистки = Новый Структура;     
	
	НастройкиСтатистки.Вставить("Организация", ОбработкаОбъект.Организация);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияКуда", ОбработкаОбъект.СчетДоверительногоУправленияКуда);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияОткуда", ОбработкаОбъект.СчетДоверительногоУправленияОткуда);
	НастройкиСтатистки.Вставить("ДатаВзятия", ОбработкаОбъект.ДатаВзятия);
	НастройкиСтатистки.Вставить("ДатаУстановки", ОбработкаОбъект.ДатаУстановки);
	НастройкиСтатистки.Вставить("ДаваВремяПереноса", ТекущаяДата());
	
	НастройкиСтатистки.Вставить("Общие", НастройкиПереноса.Общие);
	НастройкиСтатистки.Вставить("ПоВидуБУ", НастройкиПереноса.ПоВидуБУ);
	НастройкиСтатистки.Вставить("ПоВидуЕПС", НастройкиПереноса.ПоВидуЕПС);
	НастройкиСтатистки.Вставить("ПоВидуНУ", НастройкиПереноса.ПоВидуНУ);
	НастройкиСтатистки.Вставить("Активы", НастройкиПереноса.Активы);
	НастройкиСтатистки.Вставить("АктивыПоСрочности", НастройкиПереноса.АктивыПоСрочности);
	НастройкиСтатистки.Вставить("ПереопределениеКлассификации", НастройкиПереноса.ПереопределениеКлассификации);
	НастройкиСтатистки.Вставить("ЗакрытияСчетов", НастройкиПереноса.ЗакрытияСчетов);
	НастройкиСтатистки.Вставить("Комиссия", НастройкиПереноса.Комиссия);
	
	
	Возврат НастройкиСтатистки;
		
КонецФункции
