
Процедура ВыполнитьМетод(Команда, ПараметрыКоманды) Экспорт
	
	ПараметрыФормированияБухгалтерскогоУчета = Обработки.МенеджерОтложенныхЗаданий.ПолучитьПараметрыФормированияБухгалтерскогоУчета();

	Если Команда = ПараметрыФормированияБухгалтерскогоУчета.КомандаФормированияБухгалтерскогоУчета Тогда 
		
		// для формирования бухучета прилетает всегда одно задание
		Параметр = ПараметрыКоманды[0];
		
		Попытка
			Результат = Обработки.ФормированиеБухгалтерскогоУчета.ОбработатьСчетДУФоново(Параметр.Параметры);
		Исключение
			Результат = Ложь;
		КонецПопытки;
		
		Если НЕ Результат Тогда
			ВызватьИсключение "Ошибка формирования учета";	
		КонецЕсли;
		
		// проверка наличия МФ
		Обработки.МенеджерОтложенныхЗаданий.ЗапуститьМастерЗаданийФормированияБухгалтерскогоУчета(Параметр.Параметры.Организация, Параметр.Параметры.Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры
