
&НаСервере
Процедура СкомпоноватьРезультатНаСервере()
	
	Если ЗначениеЗаполнено(Отчет.ДепозитныйВклад) Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры // СкомпоноватьРезультатНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("ДепозитныйВклад") Тогда
		Отчет.ДепозитныйВклад = ЭтаФорма.Параметры.ДепозитныйВклад;
		Элементы.ДепозитныйВклад.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкомпоноватьРезультатНаСервере();
	
КонецПроцедуры
