&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	
	// Список выбора "Функция"
	Элементы.ИспользуемаяФункция.СписокВыбора.Добавить("", "<Без формулы>");
	Элементы.ИспользуемаяФункция.СписокВыбора.Добавить("GCurve_Index_VaR", "G-Curve Index VaR");
	Элементы.ИспользуемаяФункция.СписокВыбора.Добавить("Bond_Index_VaR", "Bond Index VaR");
	Элементы.ИспользуемаяФункция.СписокВыбора.Добавить("Stock_Index_VaR", "Stock Index VaR");
	// Список выбора "Процент VaR"
	Элементы.ПроцентVaR.СписокВыбора.Добавить("80", "80%");
	Элементы.ПроцентVaR.СписокВыбора.Добавить("90", "90%");
	Элементы.ПроцентVaR.СписокВыбора.Добавить("95", "95%");
	Элементы.ПроцентVaR.СписокВыбора.Добавить("99", "99%");
	// Список выбора "Биржевой индекс"
	Элементы.БиржевойИндекс.СписокВыбора.Добавить(171, "IMOEX (Индекс МосБиржи)");
	Элементы.БиржевойИндекс.СписокВыбора.Добавить(475, "RUCBTR3A3YNS (1 группа ликвидности)");
	Элементы.БиржевойИндекс.СписокВыбора.Добавить(481, "RUCBTRAA3YNS (2 группа ликвидности)");
	Элементы.БиржевойИндекс.СписокВыбора.Добавить(479, "RUCBTRA3YNS (3 группа ликвидности)");
	
	// Значения по умолчанию
	ИспользуемаяДата = "ДатаРасчета";
	ИспользуемыйПроцентVaR = "ПроцентVaRСценария";
	ИспользуемыйГоризонтТорговыхДней = "ТорговыхДнейСНачала";
	Дюрация = 1;
	Если Элементы.БиржевойИндекс.СписокВыбора.Количество() > 0 Тогда
		БиржевойИндекс = Элементы.БиржевойИндекс.СписокВыбора[0].Значение;
	КонецЕсли;
	ИсторическийПериод = 3;
	МножительРезультата = 1;
	
	// Параметр "Формула"
	Попытка
		Если Параметры.Свойство("Формула") Тогда
			ПараметрыФормулы = СтрРазделить(Параметры.Формула, " ", Ложь);
			Если ПараметрыФормулы.Количество() > 0 Тогда
				ИмяФормулы = ПараметрыФормулы[0];
				ПараметрыФормулы.Удалить(0);
				// G-Curve Index VaR
				Если ИмяФормулы = "GCurve_Index_VaR" И (ПараметрыФормулы.Количество() = 5 Или ПараметрыФормулы.Количество() = 6) Тогда
					#Область GCurve_Index_VaR
					// Имя формулы
					ИспользуемаяФункция = ИмяФормулы;
					// Используемая дата
					Если ПараметрыФормулы[0] <> "<ДатаРасчета>" Тогда
						ИспользуемаяДата = "Другое";
						ПользовательскаяДата = Дата(
							Число(Сред(ПараметрыФормулы[0], 1, 4)),
							Число(Сред(ПараметрыФормулы[0], 6, 2)),
							Число(Сред(ПараметрыФормулы[0], 9, 2)));
					КонецЕсли;
					// Используемый процент VaR
					Если ПараметрыФормулы[1] <> "<ПроцентVaRСценария>" Тогда
						ИспользуемыйПроцентVaR = "Другое";
						ПроцентVaR = Число(ПараметрыФормулы[1]);
					КонецЕсли;
					// Используемый горизонт торговых дней
					Если ПараметрыФормулы[2] <> "<ТорговыхДнейСНачала>" Тогда
						ИспользуемыйГоризонтТорговыхДней = "Другое";
						ГоризонтТорговыхДней = Число(ПараметрыФормулы[2]);
					КонецЕсли;
					// Дюрация
					Если ПараметрыФормулы[3] <> "DEF" Тогда
						ИспользоватьДюрация = Истина;
						Дюрация = Число(ПараметрыФормулы[3]);
					КонецЕсли;
					// Исторический период
					ИсторическийПериод = Число(ПараметрыФормулы[4]);
					// Множитель результата (необязательный параметр)
					Если ПараметрыФормулы.Количество() = 6 Тогда
						ИспользоватьМножительРезультата = Истина;
						МножительРезультата = Число(СтрЗаменить(ПараметрыФормулы[5], "*", ""));
					КонецЕсли;
					#КонецОбласти
				// Bond Index VaR / Stock Index VaR
				ИначеЕсли (ИмяФормулы = "Bond_Index_VaR" Или ИмяФормулы = "Stock_Index_VaR")
					И (ПараметрыФормулы.Количество() = 5 Или ПараметрыФормулы.Количество() = 6)
				Тогда
					#Область Bond_Index_VaR_Или_Stock_Index_VaR
					// Имя формулы
					ИспользуемаяФункция = ИмяФормулы;
					// Используемая дата
					Если ПараметрыФормулы[0] <> "<ДатаРасчета>" Тогда
						ИспользуемаяДата = "Другое";
						ПользовательскаяДата = Дата(
							Число(Сред(ПараметрыФормулы[0], 1, 4)),
							Число(Сред(ПараметрыФормулы[0], 6, 2)),
							Число(Сред(ПараметрыФормулы[0], 9, 2)));
					КонецЕсли;
					// Используемый процент VaR
					Если ПараметрыФормулы[1] <> "<ПроцентVaRСценария>" Тогда
						ИспользуемыйПроцентVaR = "Другое";
						ПроцентVaR = Число(ПараметрыФормулы[1]);
					КонецЕсли;
					// Используемый горизонт торговых дней
					Если ПараметрыФормулы[2] <> "<ТорговыхДнейСНачала>" Тогда
						ИспользуемыйГоризонтТорговыхДней = "Другое";
						ГоризонтТорговыхДней = Число(ПараметрыФормулы[2]);
					КонецЕсли;
					// Биржевой индекс
					БиржевойИндекс = Число(ПараметрыФормулы[3]);
					// Исторический период
					ИсторическийПериод = Число(ПараметрыФормулы[4]);
					// Множитель результата (необязательный параметр)
					Если ПараметрыФормулы.Количество() = 6 Тогда
						ИспользоватьМножительРезультата = Истина;
						МножительРезультата = Число(СтрЗаменить(ПараметрыФормулы[5], "*", ""));
					КонецЕсли;
					#КонецОбласти
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить("Не удалось разобрать переданную формулу: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// События после инициализации
	ИспользуемаяФункцияПриИзменении();
	ИспользуемаяДатаПриИзменении();
	ИспользуемыйПроцентVaRПриИзменении();
	ИспользуемыйГоризонтТорговыхДнейПриИзменении();
	ИспользоватьДюрацияПриИзменении();
	ИспользоватьМножительРезультатаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемаяФункцияПриИзменении(Элемент = Неопределено)
	// Главные элементы
	Элементы.ГруппаПараметры.Видимость = Истина;
	Элементы.НадписьОписаниеИспользуемойФункции.Видимость = Истина;
	Элементы.НадписьОписаниеИспользуемойФункции.Заголовок = "Описание: ";
	// Параметры
	Элементы.ГруппаДата.Видимость = Ложь;
	Элементы.ГруппаПроцентVaR.Видимость = Ложь;
	Элементы.ГруппаГоризонтТорговыхДней.Видимость = Ложь;
	Элементы.ГруппаДюрация.Видимость = Ложь;
	Элементы.БиржевойИндекс.Видимость = Ложь;
	Элементы.ИсторическийПериод.Видимость = Ложь;
	Элементы.ГруппаМножительРезультата.Видимость = Ложь;
	// Включение видимости параметров в зависимости от используемой функции
	Если ИспользуемаяФункция = "GCurve_Index_VaR" Тогда
		Элементы.НадписьОписаниеИспользуемойФункции.Заголовок =
			Элементы.НадписьОписаниеИспользуемойФункции.Заголовок + "VaR значений кривой бескупонной доходности";
		Элементы.ГруппаДата.Видимость = Истина;
		Элементы.ГруппаПроцентVaR.Видимость = Истина;
		Элементы.ГруппаГоризонтТорговыхДней.Видимость = Истина;
		Элементы.ГруппаДюрация.Видимость = Истина;
		Элементы.ИсторическийПериод.Видимость = Истина;
		Элементы.ГруппаМножительРезультата.Видимость = Истина;
	ИначеЕсли ИспользуемаяФункция = "Bond_Index_VaR" Или ИспользуемаяФункция = "Stock_Index_VaR" Тогда
		Если ИспользуемаяФункция = "Bond_Index_VaR" Тогда
			Элементы.НадписьОписаниеИспользуемойФункции.Заголовок =
				Элементы.НадписьОписаниеИспользуемойФункции.Заголовок + "VaR доходности биржевого индекса";
		ИначеЕсли ИспользуемаяФункция = "Stock_Index_VaR" Тогда
			Элементы.НадписьОписаниеИспользуемойФункции.Заголовок =
				Элементы.НадписьОписаниеИспользуемойФункции.Заголовок + "VaR цены закрытия биржевого индекса";
		КонецЕсли;
		Элементы.ГруппаДата.Видимость = Истина;
		Элементы.ГруппаПроцентVaR.Видимость = Истина;
		Элементы.ГруппаГоризонтТорговыхДней.Видимость = Истина;
		Элементы.БиржевойИндекс.Видимость = Истина;
		Элементы.ИсторическийПериод.Видимость = Истина;
		Элементы.ГруппаМножительРезультата.Видимость = Истина;
	Иначе
		Элементы.ГруппаПараметры.Видимость = Ложь;
		Элементы.НадписьОписаниеИспользуемойФункции.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемаяДатаПриИзменении(Элемент = Неопределено)
	Элементы.ПользовательскаяДата.Видимость = (ИспользуемаяДата = "Другое");
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыйПроцентVaRПриИзменении(Элемент = Неопределено)
	Элементы.ПроцентVaR.Видимость = (ИспользуемыйПроцентVaR = "Другое");
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыйГоризонтТорговыхДнейПриИзменении(Элемент = Неопределено)
	Элементы.ГоризонтТорговыхДней.Видимость = (ИспользуемыйГоризонтТорговыхДней = "Другое");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДюрацияПриИзменении(Элемент = Неопределено)
	Если ИспользоватьДюрация Тогда
		Элементы.ИспользоватьДюрация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.Дюрация.Видимость = Истина;
	Иначе
		Элементы.ИспользоватьДюрация.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элементы.Дюрация.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМножительРезультатаПриИзменении(Элемент = Неопределено)
	Если ИспользоватьМножительРезультата Тогда
		Элементы.ИспользоватьМножительРезультата.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.МножительРезультата.Видимость = Истина;
	Иначе
		Элементы.ИспользоватьМножительРезультата.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элементы.МножительРезультата.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПрименить");
	Попытка
		ВыполнитьКомандаПрименить(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПрименить(ПараметрыСессии)
	Результат = ИспользуемаяФункция;
	// G-Curve Index VaR
	Если ИспользуемаяФункция = "GCurve_Index_VaR" Тогда
		Если ИспользуемыйГоризонтТорговыхДней = "Другое" И ГоризонтТорговыхДней = 0 Тогда
			ТекстОшибки = "Горизонт торговых дней должен быть заполнен.";
			Сообщить(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		ИначеЕсли ИсторическийПериод = 0 Тогда
			ТекстОшибки = "Исторический период должен быть заполнен.";
			Сообщить(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		КонецЕсли;
		Результат = Результат
			+ " " + ?(ИспользуемаяДата = "ДатаРасчета", "<ДатаРасчета>", Формат(ПользовательскаяДата, "ДФ=yyyy-MM-dd; ДП=")) // @AssetDate DATE
			+ " " + ?(ИспользуемыйПроцентVaR = "ПроцентVaRСценария", "<ПроцентVaRСценария>", Формат(ПроцентVaR, "ЧРД=.; ЧН=; ЧГ=")) // @VaRPercent DECIMAL(5, 2)
			+ " " + Формат(?(ИспользуемыйГоризонтТорговыхДней = "ТорговыхДнейСНачала", "<ТорговыхДнейСНачала>", Формат(ГоризонтТорговыхДней, "ЧГ="))) // @HorizonTradeDays INT (!=0)
			+ " " + ?(ИспользоватьДюрация, Формат(Дюрация, "ЧРД=.; ЧН=; ЧГ="), "DEF") // @DurationYears DECIMAL(8, 2) = 1.
			+ " " + Формат(ИсторическийПериод, "ЧГ=") // @HistoricalPeriodYears INT (!=0)
			+ ?(ИспользоватьМножительРезультата, " *" + Формат(МножительРезультата, "ЧРД=.; ЧН=; ЧГ="), ""); // Множитель результата
	// Bond Index VaR / Stock Index VaR
	ИначеЕсли ИспользуемаяФункция = "Bond_Index_VaR" Или ИспользуемаяФункция = "Stock_Index_VaR" Тогда
		Если ИспользуемыйГоризонтТорговыхДней = "Другое" И ГоризонтТорговыхДней = 0 Тогда
			ТекстОшибки = "Горизонт торговых дней должен быть заполнен.";
			Сообщить(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		ИначеЕсли БиржевойИндекс = 0 Тогда
			ТекстОшибки = "Биржевой индекс должен быть заполнен.";
			Сообщить(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		ИначеЕсли ИсторическийПериод = 0 Тогда
			ТекстОшибки = "Исторический период должен быть заполнен.";
			Сообщить(ТекстОшибки);
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
			Возврат;
		КонецЕсли;
		Результат = Результат
			+ " " + ?(ИспользуемаяДата = "ДатаРасчета", "<ДатаРасчета>", Формат(ПользовательскаяДата, "ДФ=yyyy-MM-dd; ДП=")) // @AssetDate DATE
			+ " " + ?(ИспользуемыйПроцентVaR = "ПроцентVaRСценария", "<ПроцентVaRСценария>", Формат(ПроцентVaR, "ЧРД=.; ЧН=; ЧГ=")) // @VaRPercent DECIMAL(5, 2)
			+ " " + Формат(?(ИспользуемыйГоризонтТорговыхДней = "ТорговыхДнейСНачала", "<ТорговыхДнейСНачала>", Формат(ГоризонтТорговыхДней, "ЧГ="))) // @HorizonTradeDays INT (!=0)
			+ " " + Формат(БиржевойИндекс, "ЧГ=") // @MOEXIndexID INT (!=0)
			+ " " + Формат(ИсторическийПериод, "ЧГ=") // @HistoricalPeriodYears INT (!=0)
			+ ?(ИспользоватьМножительРезультата, " *" + Формат(МножительРезультата, "ЧРД=.; ЧН=; ЧГ="), ""); // Множитель результата
	ИначеЕсли Не ПустаяСтрока(ИспользуемаяФункция) Тогда
		ТекстОшибки = "Выбрана неизвестная функция";
		Предупреждение(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
