
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ИспользоватьДляПолучения") = Истина Тогда

		ПараметрыФормы = Новый Структура("УчетнаяЗаписьЭлектроннойПочты", ПараметрКоманды);
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.ВходящиеПисьма", 
						ПараметрыФормы, 
						ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно, 
						ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	Иначе
						
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Учётная запись %1 не используется для получения почты.", ПараметрКоманды));
						
	КонецЕсли;
	
КонецПроцедуры
