
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РеквизитыАнкеты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрКоманды, "Организация, ЮрФизЛицо, Дата");
	ПараметрыФормы = Новый Структура("Организация, ЮрФизЛицо, Период", РеквизитыАнкеты.Организация, РеквизитыАнкеты.ЮрФизЛицо, НачалоДня(РеквизитыАнкеты.Дата));
	
	ОткрытьФорму("Обработка.ПечатьАнкетныхДанных.Форма.ЗаявлениеОПрисоединении", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
