
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбработкаОтменена Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОтмены");
		ПроверяемыеРеквизиты.Добавить("ОтменившийПользователь");
	Иначе
		
		Если ЗначениеЗаполнено(ДатаОтмены) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Дата отмены' заполняется только для пакетов данных, обработка которых отменена!", ЭтотОбъект, "ДатаОтмены",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтменившийПользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Отменивший пользователь' заполняется только для пакетов данных, обработка которых отменена!", ЭтотОбъект, "ОтменившийПользователь",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла Тогда
		
		ПроверяемыеРеквизиты.Добавить("Путь");
		
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Учетная запись' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УчетнаяЗапись",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресОтправителя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Адрес отправителя' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "АдресОтправителя",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяОтправителя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Имя отправителя' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ИмяОтправителя",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тема) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Тема' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Тема",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Текст) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Текст' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Текст",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипТекста) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Тип текста' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ТипТекста",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Важность) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Важность' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Важность",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Кодировка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Кодировка' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Кодировка",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбрабатыватьТексты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Обрабатывать тексты' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ОбрабатыватьТексты",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УведомитьОДоставке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Уведомить о доставке' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УведомитьОДоставке",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УведомитьОПрочтении) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Уведомить о прочтении' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УведомитьОПрочтении",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Идентификаторы оснований' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ИдентификаторыОснований",, Отказ);
		КонецЕсли;
		
		Если Получатели.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Получатели",, Отказ);
		КонецЕсли;
		
		Если ПолучателиКопий.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели копий' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиКопий",, Отказ);
		КонецЕсли;
		
		Если ПолучателиСлепыхКопий.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели слепых копий' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиСлепыхКопий",, Отказ);
		КонецЕсли;
		
		Если ПолучателиУведомленияОДоставке.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели уведомлений о доставке' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиУведомленияОДоставке",, Отказ);
		КонецЕсли;
		
		Если ПолучателиУведомленияОПрочтении.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели уведомлений о прочтении' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиУведомленияОПрочтении",, Отказ);
		КонецЕсли;
		
		Если ОбратныеАдреса.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Обратные адреса' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ОбратныеАдреса",, Отказ);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Путь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Путь' заполняется только для пакетов данных с видом 'Выгрузка файла', обработка которых отменена!", ЭтотОбъект, "Путь",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НеЗаменятьФайлыВКаталоге) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Не заменять файлы в каталоге' заполняется только для пакетов данных с видом 'Выгрузка файла', обработка которых отменена!", ЭтотОбъект, "НеЗаменятьФайлыВКаталоге",, Отказ);
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить("АдресОтправителя");
		ПроверяемыеРеквизиты.Добавить("Получатели");
		
		Если УведомитьОДоставке Тогда
			ПроверяемыеРеквизиты.Добавить("ПолучателиУведомленияОДоставке");
		КонецЕсли;
		
		Если УведомитьОПрочтении Тогда
			ПроверяемыеРеквизиты.Добавить("ПолучателиУведомленияОПрочтении");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый()
		И ЭтотОбъект.ПометкаУдаления
		И НЕ ЭтотОбъект.Ссылка.ПометкаУдаления
		И НЕ ЭтотОбъект.Ссылка.ОбработкаОтменена Тогда
		
		Если НЕ ЭтотОбъект.ОбработкаОтменена Тогда
			ЭтотОбъект.ОбработкаОтменена = Истина;
		КонецЕсли;
		
		РаботаСОтчетами.ЗафиксироватьОтменуОтправкиИлиВыгрузкиОтчета(ЭтотОбъект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
