
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	ЭтотОбъект.Период = ТекущаяДатаСеанса();
		
 КонецПроцедуры 

&НаСервере
Процедура ОбновитьНаСервере() 
	
	ЭтотОбъект.Клиенты.Очистить();

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыФормирования = Новый Структура;
	
	Если ЭтаФорма.ЭкспортВсехОпераций Тогда
		ПараметрыФормирования.Вставить("НачалоПериода", Дата(1, 1, 1));	
	Иначе
		ПараметрыФормирования.Вставить("НачалоПериода", ЭтотОбъект.Период - 24 * 60 * 60);
    КонецЕсли;

	ПараметрыФормирования.Вставить("КонецПериода", ЭтотОбъект.Период);
	ПараметрыФормирования.Вставить("Организация", ЭтотОбъект.Организация);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Пиф) Тогда	
		ПараметрыФормирования.Вставить("Пиф", ЭтотОбъект.Пиф);
	КонецЕсли;
	
	Если ЭтотОбъект.ВключаяИИС Тогда
		ПараметрыФормирования.Вставить("ВключаяИИС");
	КонецЕсли;
	
	ДанныеДляЭкспорта = ОбработкаОбъект.СформироватьДанныеДляЭкспорта(ПараметрыФормирования);
	
	Если ДанныеДляЭкспорта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеДляЭкспорта.ТаблицаКлиентов Цикл
		
		НоваяСтрока = ЭтотОбъект.Клиенты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				
		Для Каждого СтрокаКонтактов Из СтрокаДанных.Контакты Цикл
			
			НоваяСтрокаКонтактов = НоваяСтрока.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаКонтактов, СтрокаКонтактов);
			
		КонецЦикла;
		
		БанковскиеРеквизитыКлиента = ДанныеДляЭкспорта.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("УидФизЛица", СтрокаДанных.УидФизЛица));
		
		Для Каждого СтрокаРеквизитов Из БанковскиеРеквизитыКлиента Цикл
			
			НоваяСтрокаРеквизитов = НоваяСтрока.БанковскиеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРеквизитов, СтрокаРеквизитов);
			
		КонецЦикла; 
		
		ПродуктыКлиента = ДанныеДляЭкспорта.Продукты.НайтиСтроки(Новый Структура("УидФизЛица", СтрокаДанных.УидФизЛица));
		
		Для Каждого СтрокаПродуктов Из ПродуктыКлиента Цикл
			
			НоваяСтрокаПродуктов = НоваяСтрока.Продукты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПродуктов, СтрокаПродуктов);
			
		КонецЦикла;
		
		ОперацииКлиента = ДанныеДляЭкспорта.Операции.НайтиСтроки(Новый Структура("УидФизЛица", СтрокаДанных.УидФизЛица));
		
		Для Каждого СтрокаОпераций Из ОперацииКлиента Цикл
			
			НоваяСтрокаОпераций = НоваяСтрока.Операции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОпераций, СтрокаОпераций);
			
		КонецЦикла; 
	
		ЗавкиКлиента = ДанныеДляЭкспорта.Заявки.НайтиСтроки(Новый Структура("УидФизЛица", СтрокаДанных.УидФизЛица));
		
		Для Каждого СтрокаЗаявок Из ЗавкиКлиента Цикл
			
			НоваяСтрокаЗаявок = НоваяСтрока.Заявки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаявок, СтрокаЗаявок);
			
		КонецЦикла;
		
		ПортфельКлиента = ДанныеДляЭкспорта.Портфель.НайтиСтроки(Новый Структура("УидФизЛица", СтрокаДанных.УидФизЛица));
		
		Для Каждого СтрокаПортфеля Из ПортфельКлиента Цикл
			
			НоваяСтрокаПортфеля = НоваяСтрока.Портфель.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПортфеля, СтрокаПортфеля);
			
		КонецЦикла;
				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЭкспортироватьНаСервере()
	
	СтрокаСвойств = "ТаблицаКлиентов,БанковскиеРеквизиты"; //по умолчанию обновляем анкетные данные 
	
	//Если Этаформа.АнкетныеДанные Тогда
	//	СтрокаСвойств = СтрокаСвойств + "ТаблицаКлиентов";	
	//КонецЕсли;
	//
	//Если Этаформа.БанковскиеРеквизиты Тогда
	//	СтрокаСвойств = СтрокаСвойств + ?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "БанковскиеРеквизиты";	
	//КонецЕсли;

	//из настроек на форме	
	Если Этаформа.Операции Тогда
		СтрокаСвойств = СтрокаСвойств + ?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Операции";	
	КонецЕсли;
	
	Если Этаформа.Продукты Тогда
		СтрокаСвойств = СтрокаСвойств + ?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Продукты";	
	КонецЕсли;
	
	Если Этаформа.Портфель Тогда
		СтрокаСвойств = СтрокаСвойств +?(ЗначениеЗаполнено(СтрокаСвойств), ",", "") + "Портфель";	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаСвойств) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках укажите данные для экспорта.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеДляЭкспорта = ОбработкаОбъект.СформироватьСтруктуруДанных(СтрокаСвойств);
	
	Для Каждого ТекКлиент Из Клиенты Цикл
		
		Если Не ТекКлиент.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("ТаблицаКлиентов") Тогда
							
			СтрокаПриемник = ДанныеДляЭкспорта.ТаблицаКлиентов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриемник, ТекКлиент);
			
			Для Каждого ТекКонтактнаяИнформация Из ТекКлиент.КонтактнаяИнформация Цикл 
				
				СтрокаПриемник.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", ТекКонтактнаяИнформация.ТипСвязи, ТекКонтактнаяИнформация.АдресНомер));
				//СтрокаКонтактовПриемник = ДанныеДляЭкспорта.КонтактнаяИнформация.Добавить();
				//ЗаполнитьЗначенияСвойств(СтрокаКонтактовПриемник, ТекКонтактнаяИнформация);
				//СтрокаКонтактовПриемник.УидФизЛица = ТекКлиент.УидФизЛица; 
			КонецЦикла;
				
		КонецЕсли; 
		
		Если ДанныеДляЭкспорта.Свойство("БанковскиеРеквизиты") Тогда 
			
			Для Каждого ТекБанковскиеРеквизиты Из ТекКлиент.БанковскиеРеквизиты Цикл 	
				СтрокаРеквизитовПриемник = ДанныеДляЭкспорта.БанковскиеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРеквизитовПриемник, ТекБанковскиеРеквизиты);
				СтрокаРеквизитовПриемник.УидФизЛица = ТекКлиент.УидФизЛица; 
			КонецЦикла;
	
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("Продукты") Тогда

			Для Каждого ТекПродукты Из ТекКлиент.Продукты Цикл 	
				СтрокаПродуктовПриемник = ДанныеДляЭкспорта.Продукты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПродуктовПриемник, ТекПродукты);
				СтрокаПродуктовПриемник.УидФизЛица = ТекКлиент.УидФизЛица;
			КонецЦикла;
			
		КонецЕсли; 
		
		Если ДанныеДляЭкспорта.Свойство("Заявки") Тогда

			Для Каждого ТекЗаявка Из ТекКлиент.Заявки Цикл 	
				СтрокаЗаявокПриемник = ДанныеДляЭкспорта.Заявки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗаявокПриемник, ТекЗаявка);
				СтрокаЗаявокПриемник.УидФизЛица = ТекКлиент.УидФизЛица;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("Операции") Тогда
		
			Для Каждого ТекОперации Из ТекКлиент.Операции Цикл 	
				СтрокаОперацийПриемник = ДанныеДляЭкспорта.Операции.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОперацийПриемник, ТекОперации);
				СтрокаОперацийПриемник.УидФизЛица = ТекКлиент.УидФизЛица;
			КонецЦикла; 
			
		КонецЕсли;
		
		Если ДанныеДляЭкспорта.Свойство("Портфель") Тогда
		
			Для Каждого ТекПродукт Из ТекКлиент.Портфель Цикл 	
				СтрокаПортфеляПриемник = ДанныеДляЭкспорта.Портфель.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПортфеляПриемник, ТекПродукт);
				СтрокаПортфеляПриемник.УидФизЛица = ТекКлиент.УидФизЛица;
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Для Каждого ТаблицаДанныхДляЭкспорта Из ДанныеДляЭкспорта Цикл
		
		Если ТаблицаДанныхДляЭкспорта.Значение.Количество() > 0 Тогда	
			
			ОбработкаОбъект.Экспортировать(ДанныеДляЭкспорта);
			ОбновитьНаСервере();
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура Экспортировать(Команда)
	
	ЭкспортироватьНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ЭкспортироватьСтоимостьАктивовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭкспортироватьСтоимостьАктивов(ЭтаФорма.Организация);

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортироватьСтоимостьАктивов(Команда) 
	
	ЭкспортироватьСтоимостьАктивовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры 

&НаКлиенте
Процедура СнятьФлажки(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КлиентыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьОсновныеАнкетныеДанныеКлиента", 0.1, Истина); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьОсновныеАнкетныеДанныеКлиента()
	
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов = "Фамилия,Имя,Отчество,Пол,ДатаРождения,СерияДокумента,НомерДокумента,ОрганВыдавшийДокумент,"
						+ "КодПодразделения,ДатаВыдачиДокумента,ДатаОкончанияДействияДокумента,ИНН,СНИЛС";
	
	МассивРеквизитов = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитов);
	
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл	
		ЭтаФорма[ИмяРеквизита] = ТекущиеДанные[ИмяРеквизита];	
	КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаПользователь.Заголовок = 
			ТекущиеДанные.Фамилия + " " + 
			ТекущиеДанные.Имя + 
			?(ЗначениеЗаполнено(ТекущиеДанные.Отчество), " " + ТекущиеДанные.Отчество, "") +
			?(ЗначениеЗаполнено(ТекущиеДанные.Код1Ф), " (id " + ТекущиеДанные.Код1Ф + ")", "");
		
КонецПроцедуры 

