&НаСервере
Функция ПолучитьСписокВыводовЦенныхБумаг(ДокументВывода)
	
	Результат = Новый Массив();
	
	// временно по просьбе Нади
	Результат.Добавить(ДокументВывода);
	Возврат Результат; 
	// временно по просьбе Нади
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыводЦенныхБумаг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
	|ГДЕ
	|	ВыводЦенныхБумаг.Организация = &Организация
	|	И ВыводЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И ВыводЦенныхБумаг.Проведен = ИСТИНА
	|	И ВыводЦенныхБумаг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец";
	
	Запрос.УстановитьПараметр("Организация", ДокументВывода.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументВывода.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(ДокументВывода.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", КонецДня(ДокументВывода.Дата));
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;	
	
	Возврат Результат; 
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыводыЦенныхБумаг = ПолучитьСписокВыводовЦенныхБумаг(ПараметрКоманды);	
	
	ТабличныйДокумент = СформироватьАктСводныйНаСервере(ВыводыЦенныхБумаг, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Дата"));
	Если ТабличныйДокумент <> Неопределено Тогда
		Если ВыводыЦенныхБумаг.Количество()=1 Тогда 
			СтрокаЗаголовка = Строка(ПараметрКоманды) + " (Приложение к акту)";
		Иначе	
			СтрокаЗаголовка = "Выводы: ";
			Для Каждого ЭлементМассива из ВыводыЦенныхБумаг Цикл
				СтрокаЗаголовка = СтрокаЗаголовка + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементМассива, "Номер") + ", ";
			КонецЦикла;	
			СтрокаЗаголовка = Лев(СтрокаЗаголовка, СтрДлина(СтрокаЗаголовка)-2);
			СтрокаЗаголовка = СтрокаЗаголовка + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Дата"),"ДФ=dd.MM.yyyy") + " (Приложение к акту)";
		КонецЕсли;
		
		ТабличныйДокумент.Показать(СтрокаЗаголовка);	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция СформироватьАктСводныйНаСервере(ВыводыЦенныхБумаг, Дата)
	
	Возврат Документы.ВыводЦенныхБумаг.СформироватьПриложениеКАктуСводное(ВыводыЦенныхБумаг, Дата);
КонецФункции