
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.ЗначениеРейтинга) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись.УровеньРейтинга = РегистрыСведений.Рейтинги.ПолучитьУровеньРейтинга(Запись.РейтинговоеАгентство, Запись.Рейтинг);
		
		Если Запись.УровеньРейтинга = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить уровень рейтинга '" + Запись.Рейтинг + "' агентства '" + Запись.РейтинговоеАгентство + "' за период '" + Запись.Период + "'",,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
