
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ПрошлыйКвартал;
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	РеквизитОтчет = РеквизитФормыВЗначение("Отчет");
	РеквизитОтчет.СформироватьОтчет(ЭтаФорма.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьОтчет(Команда)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	Механизм = ЭтаФорма.ИмяФормы + ".КомандаВыгрузитьОтчет()";
	Сессия = Неопределено;
	ОткрытьСессиюСбораСтатистикиНаСервере(Механизм, Сессия);
	
	Данные = ПолучитьДанныеНаСервере();
	
	Шаблон = ПолучитьШаблонИзМакета();
	ИмяФайла = КаталогВременныхФайлов() + "АнкетаНРА.xlsx";
	Шаблон.Записать(ИмяФайла);
	
	Excel = Новый COMОбъект("Excel.Application");
	Excel.WorkBooks.Add(ИмяФайла);
	
	УдалитьФайлы(ИмяФайла);
	
	Для каждого Показатель Из Данные Цикл
		Попытка
			Excel.Cells(Показатель.НомерСтроки, Показатель.НомерКолонки).Value = Показатель.Значение;
		Исключение
		КонецПопытки; 
	КонецЦикла; 
	
	Excel.Visible = 1;
	
	ЗакрытьСессиюСбораСтатистики(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьСессиюСбораСтатистикиНаСервере(Механизм, Сессия)

	ОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	ПараметрыВыполненияДляСбораСтатистики = ОбъектНаСервере.ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ЗакрытьСессиюСбораСтатистики(Механизм, Сессия)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонИзМакета()

	Возврат РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ШаблонExcel");

КонецФункции

&НаСервере
Функция ПолучитьДанныеНаСервере()

	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	
	НачалоПериода = Формат(НачалоДня(Отчет.Период.ДатаНачала), "ДФ=dd.MM.yyyy");
	ОкончаниеПериода = Формат(НачалоДня(Отчет.Период.ДатаОкончания), "ДФ=dd.MM.yyyy");
	
	ДанныеОтчета = ОтчетНаСервере.ПолучитьДанныеОтчета();
	
	ДанныеДляВыгрузки = Новый Массив;
	
	ДобавитьПоказатель(ДанныеДляВыгрузки, 9,  4, ДанныеОтчета.ДанныеОКомпании.ДатаЗаполнения);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 11, 3, ДанныеОтчета.ДанныеОКомпании.ОтветственноеЛицо);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 15, 3, ДанныеОтчета.ДанныеОКомпании.ПолноеНаименование);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 16, 3, ДанныеОтчета.ДанныеОКомпании.ИНН);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 17, 3, ДанныеОтчета.ДанныеОКомпании.ДатаОснования);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 18, 3, ДанныеОтчета.ДанныеОКомпании.Сайт);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 19, 3, "");
	
	#Область Суммы_активов
	
	ДобавитьПоказатель(ДанныеДляВыгрузки, 23, 4, "Сумма (млн. рублей) на " + НачалоПериода);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 23, 5, "Сумма (млн. рублей) на " + ОкончаниеПериода);
	
	ВыборкаИтог = ДанныеОтчета.СуммыАктивов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтог.Следующий() Цикл
	
		ВыборкаСтрока = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаСтрока.Следующий() Цикл
			
			Префикс = ?(ВыборкаСтрока.НомерСтроки = 16, "СЧАКвал", "СЧА");
			Коллекция = ?(ВыборкаСтрока.НомерСтроки >= 15, ВыборкаИтог, ВыборкаСтрока);
			
			ЗначениеНачалоПериода 		= Коллекция[Префикс + "_НачалоПериода"] / 1000000;
			ЗначениеОкончаниеПериода 	= Коллекция[Префикс + "_ОкончаниеПериода"] / 1000000;
			
			ДобавитьПоказатель(ДанныеДляВыгрузки, 23 + ВыборкаСтрока.НомерСтроки, 4, Формат(ЗначениеНачалоПериода, "ЧДЦ=0; ЧН=0; ЧГ=0"));
			ДобавитьПоказатель(ДанныеДляВыгрузки, 23 + ВыборкаСтрока.НомерСтроки, 5, Формат(ЗначениеОкончаниеПериода, "ЧДЦ=0; ЧН=0; ЧГ=0"));
									
		КонецЦикла;
		
	КонецЦикла;
	
	#КонецОбласти 
	
	#Область Количество_клиентов
	
	ДобавитьПоказатель(ДанныеДляВыгрузки, 43, 4, "Количество на " + НачалоПериода);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 43, 5, "Количество на " + ОкончаниеПериода);
	
	ВыборкаСтрока = ДанныеОтчета.КоличествоКлиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтрока.Следующий() Цикл
		
		ЗначениеНачалоПериода 		= Формат(ВыборкаСтрока.КлиентНачалоПериода, "ЧДЦ=0; ЧН=0; ЧГ=3,0");
		ЗначениеОкончаниеПериода 	= Формат(ВыборкаСтрока.КлиентОкончаниеПериода, "ЧДЦ=0; ЧН=0; ЧГ=3,0");
			
		ДобавитьПоказатель(ДанныеДляВыгрузки, 43 + ВыборкаСтрока.НомерСтроки, 4, Формат(ЗначениеНачалоПериода, "ЧДЦ=0; ЧН=0; ЧГ=0"));
		ДобавитьПоказатель(ДанныеДляВыгрузки, 43 + ВыборкаСтрока.НомерСтроки, 5, Формат(ЗначениеОкончаниеПериода, "ЧДЦ=0; ЧН=0; ЧГ=0"));
		
	КонецЦикла;
		
	#КонецОбласти 
	
	#Область Собственные_средства
	ДобавитьПоказатель(ДанныеДляВыгрузки, 59, 4, "на " + ОкончаниеПериода);
	ДобавитьПоказатель(ДанныеДляВыгрузки, 60, 4, ?(ЗначениеЗаполнено(ДанныеОтчета.СобственныеСредства), ДанныеОтчета.СобственныеСредства / 1000000, 0));
	#КонецОбласти 
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьПоказатель(Данные, НомерСтроки, НомерКолонки, Значение) 

	Данные.Добавить(Новый Структура("НомерСтроки, НомерКолонки, Значение", НомерСтроки, НомерКолонки, Значение));

КонецФункции
 
