
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры
	
#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Ключ КАК Ключ,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка)
		|			И (ЗначенияДополнительныхСведений.Объект = &Объект)
		|ГДЕ
		|	ДополнительныеСведения.Ключ В (&Ключ)";
	
	КлючиСвойств = Новый Массив;
	КлючиСвойств.Добавить("Документ.СведенияПредоставляемыеЮрФизЛицами.ФорматФайловОтчетаБрокера");
	КлючиСвойств.Добавить("Документ.СведенияПредоставляемыеЮрФизЛицами.ШаблонПутиКФайламОтчетовБрокера");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Ключ", КлючиСвойств);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.Ключ = "Документ.СведенияПредоставляемыеЮрФизЛицами.ФорматФайловОтчетаБрокера" Тогда
			
			ЭтаФорма.СвойствоФорматФайловОтчетаБрокера = Выборка.Свойство;
			ЭтаФорма.ФорматФайловОтчетаБрокера = Выборка.Значение;
			
		ИначеЕсли Выборка.Ключ = "Документ.СведенияПредоставляемыеЮрФизЛицами.ШаблонПутиКФайламОтчетовБрокера" Тогда
			
			ЭтаФорма.ШаблонПутиКФайламОтчетовБрокера = Выборка.Значение;
			
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Объект КАК Объект,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	&ФорматФайловОтчетаБрокера КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ФорматФайловОтчетаБрокера""
		|ОБЪЕДИНИТЬ ВСЕ 
		|ВЫБРАТЬ
		|	&Объект КАК Объект,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	&ШаблонПутиКФайламОтчетовБрокера КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ШаблонПутиКФайламОтчетовБрокера""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ФорматФайловОтчетаБрокера", ЭтаФорма.ФорматФайловОтчетаБрокера);
	Запрос.УстановитьПараметр("ШаблонПутиКФайламОтчетовБрокера", ЭтаФорма.ШаблонПутиКФайламОтчетовБрокера);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

