#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период        = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
	
	ШаблонЗапросаНаПодтверждениеМНО = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ШаблонПодтвержденияМНО");
	ЭтаФорма.ЮрЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо");
	
	УстановитьКаталогНаСервере();
		
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("ФормаРСА", 	"Сверка СЧА и РСА");
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("МНО", 		"МНО");
	
	// создадим реквизиты формы
	НовыеРеквизитыФормы = Новый Массив;
	
	Для каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		Если ФормаПервичныхДокументовСЭД.Значение = "ФормаРСА" Тогда 
			НаименованиеРеквизита = "СЧА и РСА";
		Иначе
			НаименованиеРеквизита = ФормаПервичныхДокументовСЭД.Значение;
		КонецЕсли;
		НовыеРеквизитыФормы.Добавить(
			Новый РеквизитФормы(ФормаПервичныхДокументовСЭД.Значение, Новый ОписаниеТипов("Булево")));
		НовыеРеквизитыФормы.Добавить(
			Новый РеквизитФормы(ФормаПервичныхДокументовСЭД.Значение, Новый ОписаниеТипов("Булево"), "АктивныеСчетаДоверительногоУправления", НаименованиеРеквизита));
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизитыФормы, Новый Массив);
	
	// создадим элементы управления, соотв. новым реквизитам формы
	Для каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		
		Если ФормаПервичныхДокументовСЭД.Значение = "ФормаРСА" Тогда 
			НаименованиеРеквизита = "СЧА и РСА";
		Иначе
			НаименованиеРеквизита = ФормаПервичныхДокументовСЭД.Значение;
		КонецЕсли;

		ПолеФлажкаФормы = Элементы.Добавить(ФормаПервичныхДокументовСЭД.Значение, Тип("ПолеФормы"), Элементы.ГруппаФормы);
		ПолеФлажкаФормы.Вид                = ВидПоляФормы.ПолеФлажка;
		ПолеФлажкаФормы.ПутьКДанным        = ФормаПервичныхДокументовСЭД.Значение;
		ПолеФлажкаФормы.Заголовок          = ФормаПервичныхДокументовСЭД.Представление;
		ПолеФлажкаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		
		ПолеФлажкаФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ФлажкиФормПриИзменении");
		
		ПолеФлажкаТаблицы = Элементы.Вставить("АктивныеСчетаДоверительногоУправления" + ФормаПервичныхДокументовСЭД.Значение, Тип("ПолеФормы"), Элементы.АктивныеСчетаДоверительногоУправления, Элементы.АктивныеСчетаДоверительногоУправленияФлажок);
		ПолеФлажкаТаблицы.Вид                = ВидПоляФормы.ПолеФлажка;
		ПолеФлажкаТаблицы.ПутьКДанным        = "АктивныеСчетаДоверительногоУправления." + ФормаПервичныхДокументовСЭД.Значение;
		ПолеФлажкаТаблицы.Заголовок          = НаименованиеРеквизита;
		ПолеФлажкаТаблицы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажкаТаблицы.ТолькоПросмотр     = Истина;
		
		ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение] = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьАктивныеСчетаДоверительногоУправления();
	УстановитьКаталогНаСервере(); 
	 
КонецПроцедуры

&НаКлиенте
Процедура АктивныеСчетаДоверительногоУправленияПередНачаломИзменения(Элемент, Отказ)

	ТекущиеДанные = Элементы.АктивныеСчетаДоверительногоУправления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.АктивныеСчетаДоверительногоУправления.ТекущийЭлемент = Элементы.АктивныеСчетаДоверительногоУправленияСчетДоверительногоУправления Тогда
		Отказ = Истина;
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура КаталогФайловОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(Объект.КаталогФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.КаталогФайлов;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.КаталогФайлов = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ПодписантДолжность = СтруктураДанныхКонтактногоЛица.Должность;
	ВыбранноеЗначение  = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ФлажкиФормПриИзменении(Элемент)
	
	Элементы["АктивныеСчетаДоверительногоУправления" + Элемент.Имя].Видимость = ЭтаФорма[Элемент.Имя];
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры // Подключаемый_ФлажкиФормПриИзменении

#КонецОбласти

#Область Команды_Формы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	Попытка
		ОбновитьАктивныеСчетаДоверительногоУправления();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЭкспортировать");
	Попытка
		ВыполнитьЭкспорт(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЭкспорт(ПараметрыСессии)
	
	// Проверяем каталог верхнего уровня
	Отказ = Ложь;
	РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(Объект.КаталогФайлов, Отказ);
	
	Если Отказ Тогда
		Сообщить("Экспорт данных прерван");
		ДобавитьТекстОшибки(ПараметрыСессии, "Не удалось создать каталог файлов");
		Возврат;	
	КонецЕсли;

	МассивСчетовДУ = Новый Массив;
	Для каждого Элемент Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		
		МассивСчетовДУ.Очистить();
		Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
			
			Если Не СтрокаАктивныеСчетаДоверительногоУправления.Флажок Тогда
				Продолжить;
			КонецЕсли;            			
		
			Если СтрокаАктивныеСчетаДоверительногоУправления[Элемент.Значение] Тогда
				МассивСчетовДУ.Добавить(СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления);	
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСчетовДУ.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не Элемент.Значение = "МНО" Тогда
			
			КаталогДаты = "\" + Формат(Объект.Период, "ДФ=yyyy.MM") + "\" + Формат(Объект.Период, "ДФ=yyyy.MM.dd") + "\"; 
			ТекКаталогФайлов = Объект.КаталогФайлов + "\" + "СЧА_РСА" + КаталогДаты;
					
			Отказ = Ложь;
			РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(ТекКаталогФайлов, Отказ);
			
			Если Отказ Тогда
				Сообщить("Экспорт данных прерван");
				ДобавитьТекстОшибки(ПараметрыСессии, "Не удалось создать каталог СЧА_РСА");
				Возврат;	
			КонецЕсли;
			
			ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВОСД.Форма." + Элемент.Значение)
						.СфомироватьДокументыСЭД(Объект.Организация, МассивСчетовДУ, Объект.Период, ТекКаталогФайлов, Подписант);
		Иначе
			ПечатьЗапросовНаПодтверждениеМНО(МассивСчетовДУ, ПараметрыСессии);			
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Экспорт данных завершен");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьФлажки");
	Попытка
		ВыполнитьУстановкуФлажков();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУстановкуФлажков()
	
	Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
		СтрокаАктивныеСчетаДоверительногоУправления.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьФлажки");
	Попытка
		ВыполнитьСнятиеФлажков();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСнятиеФлажков()
	
	Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
		СтрокаАктивныеСчетаДоверительногоУправления.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Печать_МНО

&НаКлиенте
Процедура ПечатьЗапросовНаПодтверждениеМНО(МассивСчетовДУ, ПараметрыСессии)
			
	ОбщиеДанные = ПолучитьОбщиеРеквизитыДляПечати(МассивСчетовДУ, Подписант);
	МассивДокументов = ПолучитьСтруктуруДанных(МассивСчетовДУ);
	
	Если МассивДокументов.Количество() = 0 Тогда
		ТекстОшибки = "Не выбраны данные для печати";
		Сообщить(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	КаталогДаты = "\" + Формат(Объект.Период, "ДФ=yyyy.MM") + "\" + Формат(Объект.Период, "ДФ=yyyy.MM.dd") + "\"; 
	ТекКаталогФайлов = Объект.КаталогФайлов + "\" + "МНО" + КаталогДаты;
		
	Отказ = Ложь;
	РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(ТекКаталогФайлов, Отказ);
	
	Если Отказ Тогда
		ТекстОшибки = "Экспорт МНО прерван";
		Сообщить(ТекстОшибки);
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
		Возврат;	
	КонецЕсли;
	
	ИмяФайлаШаблона = ПолучитьИмяВременногоФайла("docx");
	ШаблонЗапросаНаПодтверждениеМНО.Записать(ИмяФайлаШаблона);
		
	Отказ = Ложь;
	Попытка
		
		WordApp = Новый COMОбъект("Word.Application");
		WordApp.Application.Visible = Ложь;
						
		Для каждого СтруктураРеквизитов из МассивДокументов Цикл
						
			NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблона, False, , Ложь);
			
			WordVars = NewDoc.Variables;
			
			Для Каждого Реквизит Из ОбщиеДанные Цикл
				Если Реквизит.Ключ = "Стратегия" И Реквизит.Значение = "Заменить" Тогда
					WordVars.Item(Реквизит.Ключ).Value = СтруктураРеквизитов.НаименованиеСчетаДУБезСкобок;
				Иначе	                                 
					WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Реквизит Из СтруктураРеквизитов Цикл
				WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
			КонецЦикла;
			
			NewDoc.Fields.Update();
							
			NewDoc.SaveAs(ТекКаталогФайлов + СтруктураРеквизитов.ИмяФайла + ".docx");
			NewDoc.Close();
							
			ОбработкаПрерыванияПользователя();
						
		КонецЦикла;
				
		WordApp.Application.Quit();
				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
	КонецПопытки;
	
	// удалим файлы шаблона
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблона);
	Исключение
	КонецПопытки;
	
	Если Отказ Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Формирование документов завершилось с ошибкой");
		ПоказатьПредупреждение(,"Формирование документов завершилось с ошибкой!");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаСервере
Процедура УпорядочитьАктивныеСчетаДоверительногоУправленияНаСервере()
	
	ЭтаФорма.АктивныеСчетаДоверительногоУправления.Сортировать("СчетДоверительногоУправления");
	
КонецПроцедуры // УпорядочитьАктивныеСчетаДоверительногоУправленияНаСервере

&НаКлиенте
Процедура ОбновитьАктивныеСчетаДоверительногоУправления()
	
	ЭтаФорма.АктивныеСчетаДоверительногоУправления.Очистить();
	
	// соберем данные по активым клиентам выбранных форм
	Для каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		Если Не ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение] Тогда
			Продолжить;
		КонецЕсли;
		
		АктивныеСчетаДоверительногоУправленияФормы = ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВОСД.Форма." + ФормаПервичныхДокументовСЭД.Значение)
			.ПолучитьСписокАктивныхСчетовДоверительногоУправления(Объект.Организация, Объект.Период);
			
		Для каждого АктивныйСчетДоверительногоУправленияФормы Из АктивныеСчетаДоверительногоУправленияФормы Цикл
			СчетДоверительногоУправленияНайден = Ложь;
			
			Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
				Если СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления = АктивныйСчетДоверительногоУправленияФормы Тогда
					СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления          = АктивныйСчетДоверительногоУправленияФормы;
					СтрокаАктивныеСчетаДоверительногоУправления.Флажок                                = Истина;
					СтрокаАктивныеСчетаДоверительногоУправления[ФормаПервичныхДокументовСЭД.Значение] = Истина;
					
					СчетДоверительногоУправленияНайден = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Не СчетДоверительногоУправленияНайден Тогда
				НоваяСтрокаАктивныеСчетаДоверительногоУправления = ЭтаФорма.АктивныеСчетаДоверительногоУправления.Добавить();
				НоваяСтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления          = АктивныйСчетДоверительногоУправленияФормы;
				НоваяСтрокаАктивныеСчетаДоверительногоУправления.Флажок                                = Истина;
				НоваяСтрокаАктивныеСчетаДоверительногоУправления[ФормаПервичныхДокументовСЭД.Значение] = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УпорядочитьАктивныеСчетаДоверительногоУправленияНаСервере();
	
КонецПроцедуры // ОбновитьАктивныеСчетаДоверительногоУправления

&НаСервере
Процедура УстановитьКаталогНаСервере()
	    	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		ТекКаталогФайлов = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._ЭкспортДанныхВОСД.ШаблонКаталогаФайлов", Объект.Организация, Объект.Период, Объект.КаталогФайлов);
	Иначе
		ТекКаталогФайлов = "\\ap69\Developers\Саня\xml";
	КонецЕсли;
	
	Объект.КаталогФайлов = ТекКаталогФайлов;
	
КонецПроцедуры // УстановитьКаталогНаСервере()	

&НаСервере
Функция ПолучитьСтруктуруДанных(МассивСчетовДУ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументМНО.Дата КАК Дата,
	|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Договор.НаименованиеВладельцаДляДокументов КАК НаименованиеПортфеля,
	|	ВЫБОР
	|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
	|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
	|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
	|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
	|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
	|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
	|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
	|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
	|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
	|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
	|		ИНАЧЕ НомераОбъектов.Номер
	|	КОНЕЦ КАК НомерДопСоглашения,
	|	ЕСТЬNULL(ДокументМНО.ДоговорМНОНомерДоговора, """") КАК НомерДоговораМНО,
	|	ЕСТЬNULL(ДокументМНО.ДоговорМНОДатаЗаключения, """") КАК ДатаДоговораМНО,
	|	ДокументМНО.Сумма КАК Сумма,
	|	РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу + "" "" + ДокументМНО.ГородБанка КАК НаименованиеБанка,
	|	РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеБанка,
	|	РеквизитыЮридическихЛиц.ОГРН КАК ОГРНБанка,
	|	РеквизитыЮридическихЛиц.ИНН КАК ИННБанка,
	|	КонтактнаяИнформация.Представление КАК МестонахождениеБанка,
	|	ДокументМНО.Дата КАК DopDogDateStart,
	|	ДокументМНО.ДатаВозврата КАК СрокРазмещения,
	|	ДокументМНО.Процент КАК Ставка,
	|	ДокументМНО.РасчетныйСчетВалютаПараметрыПрописиНаРусском КАК ПараметрыПрописиВалютыНаРусском,
	|	ДокументМНО.Дата КАК ИмяФайла,
	|	ДокументМНО.СчетДоверительногоУправленияНаименование КАК СчетДУ,
	|	ДокументМНО.СчетДоверительногоУправленияНомерДоговора КАК НомерДоговораДУ,
	|	ДокументМНО.СчетДоверительногоУправленияДатаЗаключения КАК ДатаДоговораДУ,
	|	ДокументМНО.НомерСчета КАК НомерСчета,
	|	РеквизитыКлиента.КраткоеНаименованиеПоУставу КАК НаименованиеКлиента,
	|	ДокументМНО.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряжениеНаМНО.Ссылка КАК Ссылка,
	|		РаспоряжениеНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|		РаспоряжениеНаМНО.Организация КАК Организация,
	|		РаспоряжениеНаМНО.РасчетныйСчет.Банк.ЮрФизЛицо КАК РасчетныйСчетБанкЮрФизЛицо,
	|		РаспоряжениеНаМНО.РасчетныйСчет.Банк.Город КАК ГородБанка,
	|		РаспоряжениеНаМНО.РасчетныйСчет КАК РасчетныйСчет,
	|		РаспоряжениеНаМНО.РасчетныйСчет.НомерСчета КАК НомерСчета,
	|		РаспоряжениеНаМНО.Валюта КАК РасчетныйСчетВалюта,
	|		РаспоряжениеНаМНО.Валюта.ПараметрыПрописиНаРусском КАК РасчетныйСчетВалютаПараметрыПрописиНаРусском,
	|		РаспоряжениеНаМНО.СчетДоверительногоУправления.Наименование КАК СчетДоверительногоУправленияНаименование,
	|		РаспоряжениеНаМНО.Дата КАК Дата,
	|		РаспоряжениеНаМНО.СчетДоверительногоУправления.НомерДоговора КАК СчетДоверительногоУправленияНомерДоговора,
	|		РаспоряжениеНаМНО.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДоверительногоУправленияДатаЗаключения,
	|		РаспоряжениеНаМНО.ДатаВозврата КАК ДатаВозврата,
	|		РаспоряжениеНаМНО.Сумма КАК Сумма,
	|		РаспоряжениеНаМНО.Процент КАК Процент,
	|		РаспоряжениеНаМНО.РасчетныйСчет.ДоговорМНО.НомерДоговора КАК ДоговорМНОНомерДоговора,
	|		РаспоряжениеНаМНО.РасчетныйСчет.ДоговорМНО.ДатаЗаключения КАК ДоговорМНОДатаЗаключения
	|	ИЗ
	|		Документ.Распоряжение КАК РаспоряжениеНаМНО
	|	ГДЕ
	|		РаспоряжениеНаМНО.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|		И РаспоряжениеНаМНО.Организация = &Организация
	|		И РаспоряжениеНаМНО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
	|		И РаспоряжениеНаМНО.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
	|		И НЕ РаспоряжениеНаМНО.ПометкаУдаления) КАК ДокументМНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
	|		ПО ДокументМНО.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиента
	|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыКлиента.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
	|		ПО ДокументМНО.Организация = НомераОбъектов.Организация
	|			И ДокументМНО.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
	|			И ДокументМНО.Ссылка = НомераОбъектов.Объект
	|			И (ГОД(ДокументМНО.Дата) = НомераОбъектов.Год)
	|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&Период,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛиц
	|		ПО ДокументМНО.РасчетныйСчетБанкЮрФизЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|				&Период,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК КонтактнаяИнформация
	|		ПО ДокументМНО.РасчетныйСчетБанкЮрФизЛицо = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
	|		ПО ДокументМНО.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
	|			И ДокументМНО.РасчетныйСчет = ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДопСоглашения";
	
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления",	МассивСчетовДУ);
	Запрос.УстановитьПараметр("Период", 	 			  		Объект.Период);
	Запрос.УстановитьПараметр("Организация", 	 				Объект.Организация);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеДляПечати = Новый Массив();
		
	НомерИсходящегоДокумента = 1;
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = Новый Структура();
		
		СтрокаДанных.Вставить("НомерИсходящегоДокумента", НомерИсходящегоДокумента);
		
		Если Выборка.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
			НадписьДоговораДУ = "Договор доверительного управления средствами пенсионных накоплений между негосударственным пенсионным фондом, осуществляющим деятельность в качестве страховщика по обязательному пенсионному страхованию, и управляющей компанией";
		ИначеЕсли Выборка.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда	
			НадписьДоговораДУ = "Договор доверительного управления средствами пенсионных резервов негосударственного пенсионного фонда";
		Иначе
			НадписьДоговораДУ = "Номер и дата договора доверительного управления:";
		КонецЕсли;
		
		СтрокаДанных.Вставить("НадписьДоговораДУ", НадписьДоговораДУ);
		
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтрокаДанных.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
						
		СтрокаДанных.Вставить("ДатаВозврата", Формат(Выборка.СрокРазмещения, "ДЛФ=DD"));
				
		Сумма = Формат(Выборка.Сумма, "ЧДЦ=2");
		Сумма = Сумма + " (" + ЧислоПрописью(Выборка.Сумма, "Л = ru_RU;", Выборка.ПараметрыПрописиВалютыНаРусском) + ")";
		СтрокаДанных.Вставить("Сумма", Сумма);
		
		Банк = "Банк - " + Выборка.ПолноеНаименованиеБанка + " ИНН " + Выборка.ИННБанка + ", ОГРН " + Выборка.ОГРНБанка + ", Местонахождение: " + Выборка.МестонахождениеБанка;
		СтрокаДанных.Вставить("Банк", Банк);
				
		СтрокаДанных.Вставить("ДатаДоговораМНО", Формат(Выборка.ДатаДоговораМНО, "ДФ=dd.MM.yyyy"));
		СтрокаДанных.Вставить("НомерДатаГенСоглашения", Выборка.НомерДоговораМНО + " от " + Формат(Выборка.ДатаДоговораМНО, "ДФ=dd.MM.yyyy"));
		
		СтрокаДанных.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD"));
		СтрокаДанных.Вставить("НомерПодтверждения", Выборка.НомерДопСоглашения);
		СтрокаДанных.Вставить("ДатаПодтверждения", Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
		
		СтрокаДанных.Вставить("ИмяФайла", СокрЛП(СтрокаДанных.СчетДУ) + "_" + Выборка.НомерДопСоглашения + "_" + Формат(СтрокаДанных.ИмяФайла, "ДФ=dd.MM.yyyy"));
				
		ДанныеДляПечати.Добавить(СтрокаДанных);
		
		НомерИсходящегоДокумента = НомерИсходящегоДокумента + 1;
		
	КонецЦикла;
		
	Возврат ДанныеДляПечати;  
	
КонецФункции

&НаСервере
Функция ПолучитьОбщиеРеквизитыДляПечати(МассивСчетовДУ, Подписант)
	
	РеквизитыОрганизации = Новый Структура("НаименованиеУК, ИННОрганизации, КППОрганизации, АдресОрганизации, ИмяФайла, Подписант, Основание, ПодписантДолжность");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеУК,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННОрганизации,
		|	РеквизитыЮридическихЛицСрезПоследних.КПП КАК КППОрганизации,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК АдресОрганизации,
		|	КонтактныеЛица.КонтактноеЛицо.Представление КАК Подписант,
		|	КонтактныеЛица.ОснованиеПолномочий КАК Основание,
		|	ЕСТЬNULL(КонтактныеЛица.Должность, """") КАК ПодписантДолжность
		|ИЗ
		|	Справочник.ЮрФизЛица КАК ЮрФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				ЮрФизЛицо = &ЮрЛицо
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Объект = &ЮрЛицо
		|					И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО ЮрФизЛица.Ссылка = КонтактнаяИнформацияСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО ЮрФизЛица.Ссылка = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.КонтактноеЛицо = &Подписант)
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|ГДЕ
		|	ЮрФизЛица.Ссылка = &ЮрЛицо";
	                       
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("ЮрЛицо", ЮрЛицоОрганизации);
	Запрос.УстановитьПараметр("Подписант", Подписант);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОрганизации, Выборка);
	КонецЕсли;
	
	Возврат РеквизитыОрганизации;
	
КонецФункции // ПолучитьОбщиеРеквизитыДляПечати

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",      Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
