
&НаСервере
Процедура ИмпортироватьДивидендыПоАкциямНаСервере()
	
	РеквизитФормыВЗначение("Объект").ИмпортироватьДивидендыПоАкциям();
	
КонецПроцедуры // ИмпортироватьДивидендыПоАкциямНаСервере

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ИмпортироватьДивидендыПоАкциямНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
