
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Чек лист по отчетности ЦБ",
		"0.36",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповеститьОНаступленииКрайнегоСрокаСдачиОтчетности", "Оповестить о наступлении крайнего срока сдачи отчетности", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	
#Область НачалоСбораСтатистики
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
#КонецОбласти	
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "ОповеститьОНаступленииКрайнегоСрокаСдачиОтчетности") Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата()) Тогда
		
			ОтчетнаяДата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецДня(ТекущаяДата()), ПараметрыКоманды.КоличествоДнейДоСдачи);
			ЭтотОбъект.Период = Новый СтандартныйПериод(НачалоДня(ОтчетнаяДата), КонецДня(ОтчетнаяДата));
			
			Результат		= Новый ТабличныйДокумент;
			ОтправитьОтчет	= Ложь;
			
			ЗаполнитьОтчет(Результат, ОтправитьОтчет, Ложь);
			
			Если ОтправитьОтчет Тогда
				
				ПараметрыПисьма = Новый Структура;
				ПараметрыПисьма.Вставить("Кому", 		ПараметрыКоманды.ПолучателиОтчета);
				ПараметрыПисьма.Вставить("Тема", 		СтрШаблон("Срок сдачи отчётов ЦБ истекает через %1 дня", ПараметрыКоманды.КоличествоДнейДоСдачи));
				ПараметрыПисьма.Вставить("Тело", 		РаботаСОтчетами.ТабличныйДокументВHTML(Результат));
				ПараметрыПисьма.Вставить("ТипТекста", 	ТипТекстаПочтовогоСообщения.HTML);
				
				РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма,, Истина);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

КонецПроцедуры

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
#Область НачалоСбораСтатистики
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
#КонецОбласти	
	
 	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	
	ЗаполнитьОтчет(ДокументРезультат,, Отказ);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Процедура ЗаполнитьОтчет(ДокументРезультат, ЕстьДанные = Ложь, Отказ)
	
	ДокументРезультат.ФиксацияСверху = 5;
	
	УчетДолжностныхЛиц = ВедетсяУчетДолжностныхЛиц(ЭтотОбъект.Организация);
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") ИЛИ СистемныеФункции.ЭтоФоновоеЗадание() Тогда 
		ОтчетностьЦБ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетностьЦБ");
	Иначе
		ОтчетностьЦБ = ВнешниеОтчеты.Создать("\\ap69\Developers\Дима\Epf\_ОтчетностьЦБ.erf");  // ВАЖНО !!! При использовании на копии обработка берется из каталога!
	КонецЕсли;
	
	ОтчетностьЦБ.Организация = ЭтотОбъект.Организация;
	ОтчетностьЦБ.Период		 = ЭтотОбъект.Период;
	
	ТочкиВходаСрокиСдачи = ОтчетностьЦБ.ПолучитьТаблицуИзМакета("ТочкиВходаСрокиСдачи", , , , , Ложь);
	
	МаксимальноеКоличествоДней = 0;
	МаксимальноеКоличествоРабочихДней = 0;
	
	Для Каждого СтрокаТочкиВходаСрокиСдачи Из ТочкиВходаСрокиСдачи Цикл
		Если СтрокаТочкиВходаСрокиСдачи.ВРабочихДнях Тогда
			МаксимальноеКоличествоРабочихДней = Макс(МаксимальноеКоличествоРабочихДней, СтрокаТочкиВходаСрокиСдачи.Срок);
		Иначе
			МаксимальноеКоличествоДней = Макс(МаксимальноеКоличествоДней, СтрокаТочкиВходаСрокиСдачи.Срок);
		КонецЕсли;
	КонецЦикла;
	
	ПерваяОтчетнаяДата = Мин(Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаНачала, - МаксимальноеКоличествоРабочихДней - 1), ЭтотОбъект.Период.ДатаНачала - МаксимальноеКоличествоДней * 86400); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаНачала", 		ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",		ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПерваяОтчетнаяДата",	ПерваяОтчетнаяДата);
	Запрос.УстановитьПараметр("ПредыдущийРабочийДеньОтДатыНачала", Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаНачала - 1, - 1));
	
	ВерсииТаксономии = Новый Массив;
	ТочкиВхода = ОтчетностьЦБ.ПолучитьТочкиВхода();
	ТочкиВхода.Колонки.Добавить("ФормируетсяНаПоследнийРабочийДень", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТочкаВхода Из ТочкиВхода Цикл
		Если ВерсииТаксономии.Найти(СтрокаТочкаВхода.ВерсияТаксономии) = Неопределено Тогда
			ВерсииТаксономии.Добавить(СтрокаТочкаВхода.ВерсияТаксономии);
		КонецЕсли;
		СтрокаТочкаВхода.ФормируетсяНаПоследнийРабочийДень = ОтчетностьЦБ.ОтчетФормируетсяНаПоследнийРабочийДень(СтрокаТочкаВхода.ИмяПакета);
	КонецЦикла;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТочкиВходаСрокиСдачи, "_ТочкиВходаСрокиСдачи", Запрос);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТочкиВхода, "_ТочкиВхода", Запрос);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ОтчетностьЦБ.ПолучитьТаблицуИзМакета("ОтборПоВидамДоговоровДУ"), 	"_ОтборПоВидамДоговоровДУ", Запрос);
	
	РазделыXBRL = ПодготовитьРазделыXBRL(ОтчетностьЦБ, ВерсииТаксономии);
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(РазделыXBRL, 	"_РазделыXBRL", Запрос);
	
#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) КАК Дата,
		|	ЛОЖЬ КАК Нерегулярная,
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) <> КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|		И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) <> КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ГОД) КАК Месяц,
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
		|		И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) <> КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ГОД) КАК Квартал,
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ГОД) КАК Год
		|ПОМЕСТИТЬ _ОтчетныеДаты
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата МЕЖДУ &ПерваяОтчетнаяДата И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ),
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &ПерваяОтчетнаяДата И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(_ОтчетныеДаты.Дата, ДЕНЬ) КАК Дата,
		|	МАКСИМУМ(РабочиеДниПередОтчетнойДатой.Дата) КАК РабочаяДата,
		|	ДатыСдачи.Дата КАК ДатаСдачи,
		|	_ОтчетныеДаты.Нерегулярная КАК Нерегулярная,
		|	_ОтчетныеДаты.Месяц КАК Месяц,
		|	_ОтчетныеДаты.Квартал КАК Квартал,
		|	_ОтчетныеДаты.Год КАК Год,
		|	ИСТИНА КАК ВРабочихДнях,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК Срок
		|ПОМЕСТИТЬ _ОтчетныеДатыСоСрокамиСдачи
		|ИЗ
		|	_ОтчетныеДаты КАК _ОтчетныеДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДатыСдачи
		|		ПО (ДатыСдачи.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДатыСдачи.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДатыСдачи.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.Дата МЕЖДУ _ОтчетныеДаты.Дата И ДатыСдачи.Дата)
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК РабочиеДниПередОтчетнойДатой
		|		ПО _ОтчетныеДаты.Дата >= РабочиеДниПередОтчетнойДатой.Дата
		|			И (РабочиеДниПередОтчетнойДатой.Дата МЕЖДУ &ПерваяОтчетнаяДата И &ДатаОкончания)
		|			И (РабочиеДниПередОтчетнойДатой.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (РабочиеДниПередОтчетнойДатой.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(_ОтчетныеДаты.Дата, ДЕНЬ),
		|	ДатыСдачи.Дата,
		|	_ОтчетныеДаты.Нерегулярная,
		|	_ОтчетныеДаты.Месяц,
		|	_ОтчетныеДаты.Квартал,
		|	_ОтчетныеДаты.Год
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(_ОтчетныеДаты.Дата, ДЕНЬ),
		|	МАКСИМУМ(РабочиеДниПередОтчетнойДатой.Дата),
		|	МИНИМУМ(ДатыСдачи.Дата),
		|	_ОтчетныеДаты.Нерегулярная,
		|	_ОтчетныеДаты.Месяц,
		|	_ОтчетныеДаты.Квартал,
		|	_ОтчетныеДаты.Год,
		|	ЛОЖЬ,
		|	РАЗНОСТЬДАТ(_ОтчетныеДаты.Дата, ДанныеКалендаря.Дата, ДЕНЬ)
		|ИЗ
		|	_ОтчетныеДаты КАК _ОтчетныеДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.Дата МЕЖДУ &ПредыдущийРабочийДеньОтДатыНачала И &ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДатыСдачи
		|		ПО (ДатыСдачи.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДатыСдачи.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДатыСдачи.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (ДанныеКалендаря.Дата <= ДатыСдачи.Дата)
		|			И (НЕ ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|				ИЛИ ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|					И (ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК РабочиеДниПередОтчетнойДатой
		|		ПО _ОтчетныеДаты.Дата >= РабочиеДниПередОтчетнойДатой.Дата
		|			И (РабочиеДниПередОтчетнойДатой.Дата МЕЖДУ &ПредыдущийРабочийДеньОтДатыНачала И &ДатаОкончания)
		|			И (РабочиеДниПередОтчетнойДатой.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (РабочиеДниПередОтчетнойДатой.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(_ОтчетныеДаты.Дата, ДЕНЬ),
		|	_ОтчетныеДаты.Нерегулярная,
		|	_ОтчетныеДаты.Месяц,
		|	_ОтчетныеДаты.Квартал,
		|	_ОтчетныеДаты.Год,
		|	РАЗНОСТЬДАТ(_ОтчетныеДаты.Дата, ДанныеКалендаря.Дата, ДЕНЬ)
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ДатыСдачи.Дата) ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТочкиВходаСрокиСдачи.ВерсияТаксономии КАК ВерсияТаксономии,
		|	_ТочкиВходаСрокиСдачи.ТочкаВхода КАК ТочкаВхода,
		|	_ТочкиВходаСрокиСдачи.ПустыеФормыОбязательны КАК ПустыеФормыОбязательны,
		|	_ТочкиВходаСрокиСдачи.МалоеПредприятие КАК МалоеПредприятие,
		|	_ТочкиВходаСрокиСдачи.ДатаНачала КАК ДатаНачала,
		|	_ТочкиВходаСрокиСдачи.ДатаОкончания КАК ДатаОкончания,
		|	_ТочкиВходаСрокиСдачи.Нерегулярная КАК Нерегулярная,
		|	_ТочкиВходаСрокиСдачи.Месяц КАК Месяц,
		|	_ТочкиВходаСрокиСдачи.Квартал КАК Квартал,
		|	_ТочкиВходаСрокиСдачи.Год КАК Год,
		|	_ТочкиВходаСрокиСдачи.Срок КАК Срок,
		|	_ТочкиВходаСрокиСдачи.ВРабочихДнях КАК ВРабочихДнях,
		|	_ОтчетныеДатыСоСрокамиСдачи.Дата КАК ОтчетнаяДата,
		|	_ОтчетныеДатыСоСрокамиСдачи.РабочаяДата КАК ОтчетнаяДатаРабочийДень,
		|	_ОтчетныеДатыСоСрокамиСдачи.ДатаСдачи КАК ДатаСдачи,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 12) = ""ep_nso_purcb""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|		КОГДА ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 9) = ""ep_nso_uk""
		|				ИЛИ ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 13) = ""ep_nso_aif_uk""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.)
		|	КОНЕЦ КАК ВидДеятельности,
		|	МАКСИМУМ(ПоказателиДеятельности.Период) КАК ПериодДляРазмераПредприятия,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, ГОД)
		|				И _ТочкиВходаСрокиСдачи.ГодоваяПериодичность
		|			ТОГДА ""Годовая""
		|		КОГДА КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, ГОД)
		|			ТОГДА ""Год""
		|		КОГДА КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(_ОтчетныеДатыСоСрокамиСдачи.Дата, КВАРТАЛ)
		|			ТОГДА ""Квартал""
		|		ИНАЧЕ ""Месяц""
		|	КОНЕЦ КАК КонецПериода
		|ПОМЕСТИТЬ _ТочкиВходаСОтчетнымиДатамиПредварительная
		|ИЗ
		|	_ТочкиВходаСрокиСдачи КАК _ТочкиВходаСрокиСдачи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОтчетныеДатыСоСрокамиСдачи КАК _ОтчетныеДатыСоСрокамиСдачи
		|		ПО _ТочкиВходаСрокиСдачи.ВРабочихДнях = _ОтчетныеДатыСоСрокамиСдачи.ВРабочихДнях
		|			И _ТочкиВходаСрокиСдачи.Срок = _ОтчетныеДатыСоСрокамиСдачи.Срок
		|			И (_ТочкиВходаСрокиСдачи.Нерегулярная
		|					И _ОтчетныеДатыСоСрокамиСдачи.Нерегулярная
		|				ИЛИ _ТочкиВходаСрокиСдачи.Месяц
		|					И _ОтчетныеДатыСоСрокамиСдачи.Месяц
		|				ИЛИ _ТочкиВходаСрокиСдачи.Квартал
		|					И _ОтчетныеДатыСоСрокамиСдачи.Квартал
		|				ИЛИ _ТочкиВходаСрокиСдачи.Год
		|					И _ОтчетныеДатыСоСрокамиСдачи.Год)
		|			И (_ОтчетныеДатыСоСрокамиСдачи.Дата МЕЖДУ _ТочкиВходаСрокиСдачи.ДатаНачала И _ТочкиВходаСрокиСдачи.ДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказателиДеятельности КАК ПоказателиДеятельности
		|		ПО (ПоказателиДеятельности.Период <= _ОтчетныеДатыСоСрокамиСдачи.Дата)
		|			И (ПоказателиДеятельности.Активность)
		|			И (ПоказателиДеятельности.Организация = &Организация)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТочкиВходаСрокиСдачи.ВерсияТаксономии,
		|	_ТочкиВходаСрокиСдачи.ТочкаВхода,
		|	_ТочкиВходаСрокиСдачи.ПустыеФормыОбязательны,
		|	_ТочкиВходаСрокиСдачи.МалоеПредприятие,
		|	_ТочкиВходаСрокиСдачи.ДатаНачала,
		|	_ТочкиВходаСрокиСдачи.ДатаОкончания,
		|	_ТочкиВходаСрокиСдачи.Нерегулярная,
		|	_ТочкиВходаСрокиСдачи.Месяц,
		|	_ТочкиВходаСрокиСдачи.Квартал,
		|	_ТочкиВходаСрокиСдачи.Год,
		|	_ТочкиВходаСрокиСдачи.Срок,
		|	_ТочкиВходаСрокиСдачи.ВРабочихДнях,
		|	_ОтчетныеДатыСоСрокамиСдачи.Дата,
		|	_ОтчетныеДатыСоСрокамиСдачи.РабочаяДата,
		|	_ОтчетныеДатыСоСрокамиСдачи.ДатаСдачи,
		|	_ТочкиВходаСрокиСдачи.ГодоваяПериодичность,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 12) = ""ep_nso_purcb""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|		КОГДА ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 9) = ""ep_nso_uk""
		|				ИЛИ ПОДСТРОКА(_ТочкиВходаСрокиСдачи.ТочкаВхода, 1, 13) = ""ep_nso_aif_uk""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ВерсияТаксономии КАК ВерсияТаксономии,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ТочкаВхода КАК ТочкаВхода,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ПустыеФормыОбязательны КАК ПустыеФормыОбязательны,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.МалоеПредприятие КАК МалоеПредприятие,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ДатаНачала КАК ДатаНачала,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ДатаОкончания КАК ДатаОкончания,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.Нерегулярная КАК Нерегулярная,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.Месяц КАК Месяц,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.Квартал КАК Квартал,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.Год КАК Год,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.Срок КАК Срок,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ВРабочихДнях КАК ВРабочихДнях,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ОтчетнаяДата КАК ОтчетнаяДата,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ОтчетнаяДатаРабочийДень КАК ОтчетнаяДатаРабочийДень,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ДатаСдачи КАК ДатаСдачи,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.ВидДеятельности КАК ВидДеятельности,
		|	ПоказателиДеятельности.КатегорияПрофУчастника КАК КатегорияПрофУчастника,
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная.КонецПериода КАК КонецПериода
		|ПОМЕСТИТЬ _ТочкиВходаСОтчетнымиДатами
		|ИЗ
		|	_ТочкиВходаСОтчетнымиДатамиПредварительная КАК _ТочкиВходаСОтчетнымиДатамиПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказателиДеятельности КАК ПоказателиДеятельности
		|		ПО (ПоказателиДеятельности.Период = _ТочкиВходаСОтчетнымиДатамиПредварительная.ПериодДляРазмераПредприятия)
		|			И (ПоказателиДеятельности.Активность)
		|			И (ПоказателиДеятельности.Организация = &Организация)
		|ГДЕ
		|	(_ТочкиВходаСОтчетнымиДатамиПредварительная.МалоеПредприятие > """"
		|				И _ТочкиВходаСОтчетнымиДатамиПредварительная.МалоеПредприятие = ""ДА"" = (ПоказателиДеятельности.КатегорияПрофУчастника = ЗНАЧЕНИЕ(Перечисление.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг.Малый))
		|			ИЛИ _ТочкиВходаСОтчетнымиДатамиПредварительная.МалоеПредприятие = """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лицензии.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ЛицензииОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лицензии КАК Лицензии
		|		ПО Организации.ЮрФизЛицо = Лицензии.ЮрФизЛицо
		|			И (НЕ Лицензии.ПометкаУдаления)
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыЛицензийСрезПоследних.Лицензия.ВидДеятельности КАК ВидДеятельности
		|ПОМЕСТИТЬ _ВидыДействующихЛицензий
		|ИЗ
		|	РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|			&ДатаОкончания,
		|			Лицензия В
		|				(ВЫБРАТЬ
		|					_ЛицензииОрганизации.Ссылка
		|				ИЗ
		|					_ЛицензииОрганизации КАК _ЛицензииОрганизации)) КАК СтатусыЛицензийСрезПоследних
		|ГДЕ
		|	СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыОперацийГруппы.ВидОперации КАК ИмяПакета,
		|	ЕСТЬNULL(ЗамещающиеСотрудникиСрезПоследних.Замещающий, ОтветственныеЗаОперацииСрезПоследних.Сотрудник) КАК Ответственный
		|ПОМЕСТИТЬ _ОтветственныеЗаОтчетность
		|ИЗ
		|	РегистрСведений.ОтветственныеЗаОперации.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И ГруппаВидовОпераций.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)) КАК ОтветственныеЗаОперацииСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ВидыОперацийГруппы
		|		ПО ОтветственныеЗаОперацииСрезПоследних.ГруппаВидовОпераций = ВидыОперацийГруппы.Ссылка
		|			И (ВидыОперацийГруппы.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗамещающиеСотрудники.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ГруппаВидовОпераций.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппыВидовОпераций.ОтчетностьЦБ)) КАК ЗамещающиеСотрудникиСрезПоследних
		|		ПО ОтветственныеЗаОперацииСрезПоследних.ГруппаВидовОпераций = ЗамещающиеСотрудникиСрезПоследних.ГруппаВидовОпераций
		|			И ОтветственныеЗаОперацииСрезПоследних.Сотрудник = ЗамещающиеСотрудникиСрезПоследних.Сотрудник
		|			И (ЗамещающиеСотрудникиСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КОНЕЦПЕРИОДА(ЗамещающиеСотрудникиСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ДатаОкончания)
		|ГДЕ
		|	(ОтветственныеЗаОперацииСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ОтветственныеЗаОперацииСрезПоследних.ДатаОкончания >= &ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТочкиВхода.ИмяПакета КАК ИмяПакета,
		|	_ТочкиВходаСОтчетнымиДатами.ПустыеФормыОбязательны КАК ПустыеФормыОбязательны,
		|	_ТочкиВходаСОтчетнымиДатами.ВерсияТаксономии КАК ВерсияТаксономии,
		|	_ТочкиВходаСОтчетнымиДатами.ТочкаВхода КАК ТочкаВхода,
		|	ВЫБОР
		|		КОГДА _ТочкиВхода.ФормируетсяНаПоследнийРабочийДень
		|			ТОГДА _ТочкиВходаСОтчетнымиДатами.ОтчетнаяДатаРабочийДень
		|		ИНАЧЕ _ТочкиВходаСОтчетнымиДатами.ОтчетнаяДата
		|	КОНЕЦ КАК ОтчетнаяДата,
		|	_ТочкиВходаСОтчетнымиДатами.ДатаСдачи КАК ДатаСдачи,
		|	_ТочкиВходаСОтчетнымиДатами.Нерегулярная КАК Нерегулярная,
		|	НЕ _ТочкиВходаСОтчетнымиДатами.Нерегулярная КАК Вывести,
		|	ВЫБОР
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|			ТОГДА СчетаДоверительногоУправления.Ссылка
		|	КОНЕЦ КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоКлиенту
		|			ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|	КОНЕЦ КАК Клиент,
		|	ВЫБОР
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|			ТОГДА СчетаДоверительногоУправления.Ссылка
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоКлиенту
		|			ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|	КОНЕЦ КАК СубъектАналитики,
		|	_ОтветственныеЗаОтчетность.Ответственный КАК Ответственный,
		|	ЛОЖЬ КАК Контроль,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РазделыXBRL.ИсточникДанных, """") = """"
		|			ТОГДА ""УФО""
		|		ИНАЧЕ _РазделыXBRL.ИсточникДанных
		|	КОНЕЦ КАК ИсточникДанных,
		|	ВЫБОР
		|		КОГДА _РазделыXBRL.РазделыXBRL ЕСТЬ NULL
		|			ТОГДА ""SR_"" + ПОДСТРОКА(_ТочкиВхода.ИмяПакета, 5, 7) + "",OKUD"" + ПОДСТРОКА(_ТочкиВхода.ИмяПакета, 5, 7) + ""Member""
		|		ИНАЧЕ _РазделыXBRL.РазделыXBRL
		|	КОНЕЦ КАК РазделыXBRL,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОГРН КАК ОГРН,
		|	ВЫБОР
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|				И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|			ТОГДА СчетаДоверительногоУправления.Ссылка
		|		КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоКлиенту
		|			ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|	КОНЕЦ КАК ЗначениеОсиДляОтбора,
		|	_ТочкиВходаСОтчетнымиДатами.МалоеПредприятие КАК МалоеПредприятие
		|ПОМЕСТИТЬ _ТаблицаОтчетыПредварительная
		|ИЗ
		|	_ТочкиВходаСОтчетнымиДатами КАК _ТочкиВходаСОтчетнымиДатами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТочкиВхода КАК _ТочкиВхода
		|		ПО _ТочкиВходаСОтчетнымиДатами.ВерсияТаксономии = _ТочкиВхода.ВерсияТаксономии
		|			И (_ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Нерегулярная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Месячная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Квартальная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.КонецГода
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Годовая)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыДействующихЛицензий КАК _ВидыДействующихЛицензий
		|		ПО _ТочкиВходаСОтчетнымиДатами.ВидДеятельности = _ВидыДействующихЛицензий.ВидДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОтветственныеЗаОтчетность КАК _ОтветственныеЗаОтчетность
		|		ПО (_ТочкиВхода.ИмяПакета = _ОтветственныеЗаОтчетность.ИмяПакета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОтборПоВидамДоговоровДУ КАК _ОтборПоВидамДоговоровДУ
		|		ПО (_ТочкиВхода.ИмяПакета = _ОтборПоВидамДоговоровДУ.ИмяПакета)
		|			И (_ТочкиВходаСОтчетнымиДатами.Нерегулярная = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&ДатаОкончания, ) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|			ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ПО (_ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|				ИЛИ _ОтборПоВидамДоговоровДУ.ОтчетПоКлиенту)
		|			И (_ОтборПоВидамДоговоровДУ.ВидДоговораДоверительногоУправления = СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления)
		|			И (СчетаДоверительногоУправления.Организация = &Организация)
		|			И (НЕ СчетаДоверительногоУправления.ПометкаУдаления)
		|			И (СчетаДоверительногоУправления.ДатаЗаключения <= _ТочкиВходаСОтчетнымиДатами.ОтчетнаяДата)
		|			И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= _ТочкиВходаСОтчетнымиДатами.ОтчетнаяДата)
		|			И (НЕ(_ОтборПоВидамДоговоровДУ.ИмяПакета = ""ОКУД0420502""
		|					И УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПредназначенДляКвалИнвесторов ЕСТЬ НЕ NULL 
		|					И УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПредназначенДляКвалИнвесторов = ИСТИНА
		|					И _ТочкиВходаСОтчетнымиДатами.Месяц = ИСТИНА))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РазделыXBRL КАК _РазделыXBRL
		|		ПО (_ТочкиВхода.ИмяПакета = _РазделыXBRL.ИмяПакета)
		|			И _ТочкиВходаСОтчетнымиДатами.ВерсияТаксономии = _РазделыXBRL.ВерсияТаксономии
		|			И _ТочкиВходаСОтчетнымиДатами.МалоеПредприятие = _РазделыXBRL.МалоеПредприятие
		|			И _ТочкиВходаСОтчетнымиДатами.КонецПериода = _РазделыXBRL.КонецПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							Организации.ЮрФизЛицо
		|						ИЗ
		|							Справочник.Организации КАК Организации
		|						ГДЕ
		|							Организации.Ссылка = &Организация)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	(_ВидыДействующихЛицензий.ВидДеятельности ЕСТЬ НЕ NULL 
		|			ИЛИ _ТочкиВходаСОтчетнымиДатами.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.))
		|	И ВЫБОР
		|			КОГДА _ОтборПоВидамДоговоровДУ.ОтчетПоСчетуДУ
		|				ТОГДА СчетаДоверительногоУправления.Ссылка ЕСТЬ НЕ NULL 
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТочкиВходаСОтчетнымиДатами.ДатаСдачи КАК ДатаСдачи
		|ПОМЕСТИТЬ _ДатаСдачиОтчетности
		|ИЗ
		|	_ТочкиВходаСОтчетнымиДатами КАК _ТочкиВходаСОтчетнымиДатами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТочкиВхода КАК _ТочкиВхода
		|		ПО _ТочкиВходаСОтчетнымиДатами.ВерсияТаксономии = _ТочкиВхода.ВерсияТаксономии
		|			И (_ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Нерегулярная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Месячная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Квартальная
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.КонецГода
		|				ИЛИ _ТочкиВходаСОтчетнымиДатами.ТочкаВхода = _ТочкиВхода.Годовая)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДатаСдачиОтчетности.ДатаСдачи КАК ДатаСдачи,
		|	ДолжностныеЛицаОрганизацийИО.Сотрудник ЕСТЬ НЕ NULL 
		|		И (ДолжностныеЛицаОрганизацийИО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДолжностныеЛицаОрганизацийИО.ДатаОкончания >= _ДатаСдачиОтчетности.ДатаСдачи) КАК НазначениеИО
		|ПОМЕСТИТЬ _НазначениеИОПоДатам
		|ИЗ
		|	_ДатаСдачиОтчетности КАК _ДатаСдачиОтчетности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеЛицаОрганизаций КАК ДолжностныеЛицаОрганизацийИО
		|		ПО (ДолжностныеЛицаОрганизацийИО.Активность)
		|			И (ДолжностныеЛицаОрганизацийИО.Организация = &Организация)
		|			И (ДолжностныеЛицаОрганизацийИО.ВидДолжностногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Руководитель))
		|			И (ДолжностныеЛицаОрганизацийИО.ИсполняющийОбязанности)
		|			И _ДатаСдачиОтчетности.ДатаСдачи >= ДолжностныеЛицаОрганизацийИО.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеЛицаОрганизаций КАК ДолжностныеЛицаОрганизацийИО2
		|		ПО (ДолжностныеЛицаОрганизацийИО2.Активность)
		|			И (ДолжностныеЛицаОрганизацийИО.Организация = ДолжностныеЛицаОрганизацийИО2.Организация)
		|			И (ДолжностныеЛицаОрганизацийИО.ВидДолжностногоЛица = ДолжностныеЛицаОрганизацийИО2.ВидДолжностногоЛица)
		|			И (ДолжностныеЛицаОрганизацийИО.ИсполняющийОбязанности = ДолжностныеЛицаОрганизацийИО2.ИсполняющийОбязанности)
		|			И _ДатаСдачиОтчетности.ДатаСдачи >= ДолжностныеЛицаОрганизацийИО2.Период
		|			И (ДолжностныеЛицаОрганизацийИО2.Период > ДолжностныеЛицаОрганизацийИО.Период)
		|ГДЕ
		|	ДолжностныеЛицаОрганизацийИО2.Период ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаОтчетыПредварительная.ИмяПакета КАК ИмяПакета,
		|	_ТаблицаОтчетыПредварительная.ПустыеФормыОбязательны КАК ПустыеФормыОбязательны,
		|	_ТаблицаОтчетыПредварительная.ВерсияТаксономии КАК ВерсияТаксономии,
		|	_ТаблицаОтчетыПредварительная.ТочкаВхода КАК ТочкаВхода,
		|	_ТаблицаОтчетыПредварительная.ОтчетнаяДата КАК ОтчетнаяДата,
		|	_ТаблицаОтчетыПредварительная.ДатаСдачи КАК ДатаСдачи,
		|	_ТаблицаОтчетыПредварительная.Нерегулярная КАК Нерегулярная,
		|	_ТаблицаОтчетыПредварительная.Вывести КАК Вывести,
		|	_ТаблицаОтчетыПредварительная.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТаблицаОтчетыПредварительная.Клиент КАК Клиент,
		|	_ТаблицаОтчетыПредварительная.СубъектАналитики КАК СубъектАналитики,
		|	_ТаблицаОтчетыПредварительная.Ответственный КАК Ответственный,
		|	_ТаблицаОтчетыПредварительная.Контроль КАК Контроль,
		|	_ТаблицаОтчетыПредварительная.ИсточникДанных КАК ИсточникДанных,
		|	_ТаблицаОтчетыПредварительная.РазделыXBRL КАК РазделыXBRL,
		|	_ТаблицаОтчетыПредварительная.ОГРН КАК ОГРН,
		|	_ТаблицаОтчетыПредварительная.ЗначениеОсиДляОтбора КАК ЗначениеОсиДляОтбора,
		|	ЕСТЬNULL(_НазначениеИОПоДатам.НазначениеИО, ЛОЖЬ) КАК НазначениеИО
		|ИЗ
		|	_ТаблицаОтчетыПредварительная КАК _ТаблицаОтчетыПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НазначениеИОПоДатам КАК _НазначениеИОПоДатам
		|		ПО _ТаблицаОтчетыПредварительная.ДатаСдачи = _НазначениеИОПоДатам.ДатаСдачи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСдачи,
		|	ТочкаВхода,
		|	ИмяПакета,
		|	ОтчетнаяДата,
		|	СчетДоверительногоУправления,
		|	Клиент
		|ИТОГИ
		|	МАКСИМУМ(НазначениеИО)
		|ПО
		|	ДатаСдачи,
		|	ТочкаВхода
		|АВТОУПОРЯДОЧИВАНИЕ";
#КонецОбласти	
	
	Макет = ПолучитьМакет("ЧекЛистПоОтчетностиЦБ");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ЭтотОбъект);
	ДокументРезультат.Вывести(ОбластьШапка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОтчеты = РезультатЗапроса.Выгрузить().СкопироватьКолонки();
	
	ВыборкаДатыСдачи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДатыСдачи.Следующий() Цикл
		ВыборкаТочкиВхода = ВыборкаДатыСдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТочкиВхода.Следующий() Цикл
			ВыборкаДетали = ВыборкаТочкиВхода.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаОтчеты.Добавить(), ВыборкаДетали);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
	ЗаполнитьУсловияОтбора(ОтчетностьЦБ, ТаблицаОтчеты, Отказ);
	
	Для Каждого СтрокаОтчета Из ТаблицаОтчеты Цикл
		
		Если СтрокаОтчета.Нерегулярная И НЕ СтрокаОтчета.Вывести Тогда
			ЗаполнитьЗначенияСвойств(ОтчетностьЦБ, СтрокаОтчета, "ИмяПакета,ВерсияТаксономии");
			ОтчетностьЦБ.Период = Новый СтандартныйПериод(СтрокаОтчета.ОтчетнаяДата, СтрокаОтчета.ОтчетнаяДата);
			СтрокаОтчета.Вывести = ОтчетностьЦБ.НеобходимоСформироватьНерегулярнуюФорму();
			
			Если СтрокаОтчета.Вывести И СтрокаОтчета.ПустыеФормыОбязательны Тогда
				
				ПараметрыПоиска = Новый Структура("ТочкаВхода,ОтчетнаяДата", СтрокаОтчета.ТочкаВхода, СтрокаОтчета.ОтчетнаяДата);
				НайденныеСтроки = ТаблицаОтчеты.НайтиСтроки(ПараметрыПоиска);
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.Вывести = Истина;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОтчеты.Сортировать("ИмяПакета, ИсточникДанных,");
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(РаботаСВнешнимиСистемами.СтрокаСоединенияСXE());
	
	ВыборкаДатыСдачи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДатыСдачи.Следующий() Цикл
		ВыборкаТочкиВхода = ВыборкаДатыСдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТочкиВхода.Следующий() Цикл
			
			Отбор = Новый Структура("ДатаСдачи, ТочкаВхода, Вывести", ВыборкаТочкиВхода.ДатаСдачи, ВыборкаТочкиВхода.ТочкаВхода, Истина);

			НазначенИО = ВыборкаТочкиВхода.НазначениеИО И УчетДолжностныхЛиц;
			
			// Получение отчетов точки входа
			ОтчетыТочкиВхода = СоздатьТаблицуОтчетовТочкиВхода(ТаблицаОтчеты, Отбор, НазначенИО);

			Если ОтчетыТочкиВхода.Количество() Тогда
				
				// Получение файлов точки входа
				ФайлыОтчетовТочкиВхода = СоздатьТаблицуФайловТочкиВхода(Соединение, ОтчетыТочкиВхода);
				
				// Вывод строк отчета
				ВывестиСтрокиОтчета(Новый Структура("ДатаСдачи, ТочкаВхода", ВыборкаТочкиВхода.ДатаСдачи, ВыборкаТочкиВхода.ТочкаВхода), 
									ОтчетыТочкиВхода, ФайлыОтчетовТочкиВхода, Макет, ДокументРезультат);
									
				ЕстьДанные = Истина;
				
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;	
	
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение);
	
КонецПроцедуры

Функция ПолучитьТаблицуФайловИзXE(Соединение, ВерсияТаксономии = "", ТочкаВхода = "", ОГРН = "", Дата = Неопределено, СписокРазделов = "", УсловиеОтбора = "", ВключатьСодержимоеФайла = Ложь) Экспорт
	
	ТекстЗапроса = 
		"SELECT 
		|	ID AS ИдентификаторОтчета,
		|	Taxonomy_Version AS ВерсияТаксономии,
		|	Entry_Point_Code AS ТочкаВхода,
		|	Firm_Code AS ОГРН,
		|	Date_From AS ДатаНачала,
		|   Date_To AS ДатаОкончания,
		|	[File_Name] AS ИмяФайла,
		|	--[File_Data] AS ДанныеXML,
		|	CAST(Load_Date AS datetime)  AS ДатаЗагрузки,
		|	[Description] AS Примечание,
		|	Forms AS РазделыОтчета,
		|   Is_XBRL AS Is_XBRL,
		|   Items AS Items
		|FROM 
		|	API_AM.udf_Get_Instances(&ВерсияТаксономии, &ТочкаВхода, &ОГРН, &Дата, &СписокРазделов)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВерсияТаксономии",	?(ПустаяСтрока(ВерсияТаксономии),	"null", "'" + СтрЗаменить(ВерсияТаксономии, "_", ".") + "'"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТочкаВхода",			?(ПустаяСтрока(ТочкаВхода), 		"null", "'" + ТочкаВхода + "'"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОГРН",				?(ПустаяСтрока(ОГРН), 				"null", "'" + ОГРН + "'"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Дата",				?(ПустаяСтрока(Дата), 				"null", "'" + Формат(Дата, "ДФ=yyyyMMdd") + "'"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СписокРазделов",		?(ПустаяСтрока(СписокРазделов), 	"null", "'" + СписокРазделов + "'"));
	
	Если  ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|WHERE
			|	" + УсловиеОтбора;
	КонецЕсли;
	
	Если ВключатьСодержимоеФайла Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "--[File_Data]", "[File_Data]");
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("ИдентификаторОтчета", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("ВерсияТаксономии", 	Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ТочкаВхода", 			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ОГРН", 				Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТипыКолонок.Вставить("ДатаОкончания",		Новый ОписаниеТипов("Дата"));
	ТипыКолонок.Вставить("ИмяФайла", 			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ДатаЗагрузки", 		Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТипыКолонок.Вставить("ДанныеXML", 			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Примечание", 			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("РазделыОтчета", 		Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Is_XBRL", 			Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("Items", 			    Новый ОписаниеТипов("Строка"));
	ДополнительныеПараметры = Новый Структура("ВозвращатьПустуюТаблицу", Истина);
	
	Возврат РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса, ДополнительныеПараметры), ТипыКолонок, ДополнительныеПараметры);
	
КонецФункции

Функция ПолучитьТаблицуФайлов(Соединение, СтрокаОтчета)
	
	КэшДанныхXML = Новый Соответствие;
	
	ТаблицаФайловXE = ПолучитьТаблицуФайловИзXE(Соединение, 
												СтрокаОтчета.ВерсияТаксономии, 
												СтрокаОтчета.ТочкаВхода, 
												СтрокаОтчета.ОГРН, 
												СтрокаОтчета.ОтчетнаяДата, 
												?(СтрНайти("ОКУД0420431", СтрокаОтчета.ИмяПакета) > 0, "", СтрокаОтчета.РазделыXBRL), 
												СтрокаОтчета.УсловиеОтбора,
												Истина); 
												
	ТаблицаФайловXE.Сортировать("ИдентификаторОтчета, ДатаЗагрузки");
	
	Ном = ТаблицаФайловXE.Количество() - 1;
	Пока Ном >= 0 Цикл
		
		КонтрольныйНомерОтчета = ВРег(Сред(СтрокаОтчета.ИмяПакета, 5, 7));
		СтрокаФайловXE = ТаблицаФайловXE[Ном];
		Если (СтрНайти(ВРег(СтрокаФайловXE.ИмяФайла), КонтрольныйНомерОтчета) = 0 
			И СтрНачинаетсяС(ВРег(СтрокаОтчета.ИмяПакета), "ОКУД") 
			И СтрокаОтчета.ИсточникДанных <> "СД" 
			И ВРег(СтрокаОтчета.ИмяПакета) <> "ОКУД0420459"
			И ВРег(СтрокаОтчета.ИмяПакета) <> "ОКУД0420437")
			Или ВРег(СтрокаОтчета.ИмяПакета = "SR_INFO") И Не СтрНачинаетсяС(ВРег(СтрокаФайловXE.ИмяФайла), "SR_INFO")
			Или ВРег(СтрокаОтчета.ИмяПакета = "SR_SVED") И Не СтрНачинаетсяС(ВРег(СтрокаФайловXE.ИмяФайла), "SR_SVED")
			Или СтрНайти(ВРег(СтрокаФайловXE.Примечание), "ТЕСТ") > 0 
			Или СтрНайти(ВРег(СтрокаФайловXE.Примечание), "TEST") > 0 
			Или КэшДанныхXML.Получить(СтрШаблон("%1#%2", 
				СтрокаФайловXE.ИдентификаторОтчета, СтрокаОтчета.ИмяПакета)) <> Неопределено Тогда
			
			ТаблицаФайловXE.Удалить(СтрокаФайловXE); 
			// Чтобы не задваивать строки с файлами, когда при поиске по разделу, 
			// который есть в разных отчетах, возвращаются несколько файлов с другими отчетами 
			// Второе - избавляемся от полных дублей с одинаковым именем пакета, именем файла и содержимым данных XML
		Иначе	
			
			КэшДанныхXML.Вставить(СтрШаблон("%1#%2", СтрокаФайловXE.ИдентификаторОтчета,СтрокаОтчета.ИмяПакета), 0);
			
		КонецЕсли;	
		Ном = Ном - 1;
		
	КонецЦикла;	
 		
	Возврат ТаблицаФайловXE;
	
КонецФункции	

Функция СоздатьТаблицуОтчетовТочкиВхода(ТаблицаОтчеты, Отбор, НазначенИО)
	
	ОтчетыТочкиВхода = ТаблицаОтчеты.Скопировать(Отбор);
	ОтчетыТочкиВхода.Колонки.Добавить("ID_Строки", Новый ОписаниеТипов("Число"));
	Ном = 0;
	Для Каждого СтрокаТЗ Из ОтчетыТочкиВхода Цикл
		Ном = Ном + 1;
		СтрокаТЗ.ID_Строки = Ном;
	КонецЦикла;	
	
	Если ОтчетыТочкиВхода.Количество() Тогда
		
		ОтчетПакета = ОтчетыТочкиВхода[0].ИмяПакета;
		Если СтрНачинаетсяС(ОтчетПакета, "ОКУД04204") Тогда
			
			НоваяСтрока = ОтчетыТочкиВхода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОтчетыТочкиВхода[0], , "Ответственный");
			НоваяСтрока.ID_Строки      = ОтчетыТочкиВхода.Количество();
			НоваяСтрока.ИмяПакета      = "SR_INFO";
			НоваяСтрока.РазделыXBRL    = "SR_INFO";
			НоваяСтрока.ИсточникДанных = "УФО";
			
		ИначеЕсли СтрНачинаетсяС(ОтчетПакета, "ОКУД04205") И Не (ОтчетПакета = "ОКУД0420504" 
			И ОтчетыТочкиВхода[0].ИсточникДанных = "СД") Или ОтчетПакета = "ВладельцыИИСвПИФ" Тогда
			
			НоваяСтрока = ОтчетыТочкиВхода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОтчетыТочкиВхода[0], , "Ответственный, СубъектАналитики, УсловиеОтбора");
			НоваяСтрока.ID_Строки      = ОтчетыТочкиВхода.Количество();
			НоваяСтрока.ИмяПакета      = "SR_SVED"; 
			НоваяСтрока.РазделыXBRL    = "sr_sved_otch_org_podpisant,sr_sved_otch_org_uk";
			НоваяСтрока.ИсточникДанных = "УФО";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Расширение отчетов точки входа приказом и доверенностью
	Если НазначенИО И ОтчетыТочкиВхода.Количество() Тогда
		
		НоваяСтрока = ОтчетыТочкиВхода.Добавить();
		НоваяСтрока.ID_Строки = ОтчетыТочкиВхода.Количество();
		НоваяСтрока.ИмяПакета = "ORDER";
		
		// Отключаем контроль доверенности по задаче #557248
		Если Отбор.ДатаСдачи < Дата(2024, 9, 1) Тогда
			НоваяСтрока = ОтчетыТочкиВхода.Добавить();
			НоваяСтрока.ID_Строки = ОтчетыТочкиВхода.Количество();
			НоваяСтрока.ИмяПакета = "ORDER_dov";
		КонецЕсли;
	
	КонецЕсли;	
	
	Возврат ОтчетыТочкиВхода;
	
КонецФункции	

Функция ПустаяТаблицаФайловТочкиВхода()
	
	ФайлыТочкиВхода = Новый ТаблицаЗначений;
	ФайлыТочкиВхода.Колонки.Добавить("ИмяПакета",              Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("ИдентификаторОтчета",    Новый ОписаниеТипов("Число"));
	ФайлыТочкиВхода.Колонки.Добавить("ИмяФайла", 			   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("ДатаЗагрузки", 		   Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ФайлыТочкиВхода.Колонки.Добавить("Примечание", 			   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("ID_Строки", 			   Новый ОписаниеТипов("Число"));
	ФайлыТочкиВхода.Колонки.Добавить("ДанныеXML", 			   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("РазделыОтчета",		   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("СубъектАналитики",	   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("КонтрольНулевого", 	   Новый ОписаниеТипов("Строка"));
	ФайлыТочкиВхода.Колонки.Добавить("КонтрольОтветственного", Новый ОписаниеТипов("Булево"));
	ФайлыТочкиВхода.Колонки.Добавить("ПараметрыСкачивания");
	Возврат ФайлыТочкиВхода;
	 
КонецФункции	

Функция СоздатьТаблицуФайловТочкиВхода(Соединение, ОтчетыТочкиВхода)

	ФайлыТочкиВхода = ПустаяТаблицаФайловТочкиВхода();
	
	Для Каждого СтрокаОтчета Из ОтчетыТочкиВхода Цикл
		
		Если СтрНачинаетсяС(ВРег(СтрокаОтчета.ИмяПакета), "ORDER") Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		ТаблицаФайловXE = ПолучитьТаблицуФайлов(Соединение, СтрокаОтчета);
		Для Каждого СтрокаФайловXE Из ТаблицаФайловXE Цикл
			
			Если ПроверитьПоПериоду(СтрокаОтчета, СтрокаФайловXE) Тогда

				ПараметрыПроверки = Новый Структура("ДанныеXML, РазделыОтчета, ИмяОтчета, ИсточникДанных", 
													СтрокаФайловXE.ДанныеXML, 
													СтрокаФайловXE.РазделыОтчета, 
													СтрокаОтчета.ИмяПакета,
													СтрокаОтчета.ИсточникДанных);
				РезультатПроверкиНулевогоОтчета = КонтрольНулевогоОтчета(ПараметрыПроверки);
				
				НоваяСтрока = ФайлыТочкиВхода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаФайловXE); 
				НоваяСтрока.ID_Строки              = СтрокаОтчета.ID_Строки;				
				НоваяСтрока.ИмяПакета              = СтрокаОтчета.ИмяПакета;
				НоваяСтрока.СубъектАналитики       = СтрокаОтчета.СубъектАналитики;
				НоваяСтрока.КонтрольНулевого       = РезультатПроверкиНулевогоОтчета;
				НоваяСтрока.КонтрольОтветственного = КонтрольОтветственногоОтчета(ПараметрыПроверки);
				
				Если Истина Или РаботаСПользователями.РолиДоступны("ПолныеПрава") Тогда

					НоваяСтрока.ПараметрыСкачивания = Новый Структура("ВерсияТаксономии, 
						|ТочкаВхода, 
						|ОГРН, 
						|ОтчетнаяДата, 
						|РазделыXBRL, 
						|УсловиеОтбора, 
						|ИдентификаторОтчета, 
						|ДатаЗагрузки, 
						|Примечание, 
						|ИмяФайла", 
						СтрокаОтчета.ВерсияТаксономии, 
						СтрокаОтчета.ТочкаВхода, 
						СтрокаОтчета.ОГРН, 
						СтрокаОтчета.ОтчетнаяДата, 
						СтрокаОтчета.РазделыXBRL, 
						СтрокаОтчета.УсловиеОтбора, 
						СтрокаФайловXE.ИдентификаторОтчета, 
						СтрокаФайловXE.ДатаЗагрузки, 
						СтрокаФайловXE.Примечание, 
						СтрокаФайловXE.ИмяФайла); 
																		
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;	
		
	КонецЦикла;
	
	СтрокаОтборПоИдентификаторам = СтрЗаменить(СтрСоединить(ФайлыТочкиВхода.Скопировать(, "ИдентификаторОтчета").ВыгрузитьКолонку("ИдентификаторОтчета"), ","), Символы.НПП, "");
	ВложенияПакетов              = РаботаСВнешнимиСистемами.ТаблицаВложенийИзXE(Соединение, СтрокаОтборПоИдентификаторам); 
	Вложения                     = ВложенияПриказовИДоверенностей(ВложенияПакетов);
	
	Для Каждого Вложение Из Вложения Цикл
		ЗаполнитьЗначенияСвойств(ФайлыТочкиВхода.Добавить(), Вложение);
	КонецЦикла;	
	
	ФайлыТочкиВхода.Сортировать("ИмяПакета, ИдентификаторОтчета, ИмяФайла");
	
	Возврат ФайлыТочкиВхода;
	
КонецФункции

Функция КонтрольНулевогоОтчета(ДанныеОтчета)
	
	Если СтрНайти(ДанныеОтчета.ДанныеXML, "XBRL_Entry_Point") > 0 Тогда // Это наш промежуточный формат XML

		ОтчетыФайла   = ОтчетыПоРазделамИзОтчетаXML(ДанныеОтчета);
		НулевыеОтчеты = НулевыеОтчетыИзОтчетаXML(ДанныеОтчета);
		
	Иначе // Тут ожидаем отчет XBRL
		
		// Пока у нас был случай получения от спец.депа отчета в XBRL по форме 504
		// Считаем, что в отчете всё соответствует. Проверка не реализована, т.к. работа с полноценным XBRL у нас не ведется
		ОтчетыФайла   = ОтчетыИзОтчетаXBRL(ДанныеОтчета);
		НулевыеОтчеты = НулевыеОтчетыИзОтчетаXBRL(ДанныеОтчета);
		
	КонецЕсли;	
	
	КонтрольНулевогоОтчета = ПроверкаПризнакаНулевогоОтчета(ДанныеОтчета.ИмяОтчета, 
																		ОтчетыФайла, 
																		НулевыеОтчеты);
	Возврат КонтрольНулевогоОтчета;																		
			
КонецФункции	

Функция ОтчетыБезРазделаСОтветственными()
	
	ОтчетыБезРазделаОтветственныхЛиц = Новый Массив;
	ОтчетыБезРазделаОтветственныхЛиц.Добавить("ГКФО_СопроводительноеПисьмо");

	Возврат ОтчетыБезРазделаОтветственныхЛиц;
	
КонецФункции	

Функция КонтрольОтветственногоОтчета(ДанныеОтчета)

	ОтчетыСОтветственным = ОтчетыСОтветственнымИзОтчетаXML(ДанныеОтчета);
	
	Возврат ОтчетыСОтветственным.Найти(ДанныеОтчета.ИмяОтчета) <> Неопределено;
	
КонецФункции	

Функция КонтрольОтветственногоОтчетаПоПоказателю(ДанныеXML)

	ШаблоныПоиска = Новый Массив;
	ШаблоныПоиска.Добавить("<FIOLiczaOtvZaPrOblast Value=""");
	ШаблоныПоиска.Добавить("<nfo-dic:FIOLiczaOtvZaPrOblast contextRef=""");
	ШаблоныПоиска.Добавить("<FIODLSostOtch Value=""");
	
	КонтрольОтветственного = Ложь;
	Для Каждого ШаблонПоиска Из ШаблоныПоиска Цикл
		
		Если СтрНайти(ДанныеXML, ШаблонПоиска) > 0 Тогда

			КонтрольОтветственного = Истина;
			Прервать;
				
		КонецЕсли;	
		
	КонецЦикла;
	Возврат КонтрольОтветственного;
	
КонецФункции	

Функция ОтчетыИзОтчетаXBRL(ДанныеОтчета)
	
	ОтчетыXBRL = Новый Массив;
	Если ДанныеОтчета.ИмяОтчета = "ОКУД0420504" Тогда
		
		ОтчетыXBRL.Добавить("ОКУД0420504");	
		
	КонецЕсли;	
	
	//Чтение = Новый ЧтениеXML;
	//Чтение.УстановитьСтроку(ДанныеОтчета.ДанныеXML);
	//ПостроительDOM = Новый ПостроительDOM;
	//ДокументDOM    = ПостроительDOM.Прочитать(Чтение);
	//
	//СтрокаЗапросаXPath = "//*[@dimension=""dim-int:PrOblastOtcetnostiTaxis""]/dim-int:PrOblastOtchTypedName/text()";
	//ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath(СтрокаЗапросаXPath, ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
	//ЭлементDOM   = ВыборкаXPath.ПолучитьСледующий();
	//Пока ЭлементDOM <> Неопределено Цикл
	//	
	//	ОтчетXBRL = ИзвлечьИмяОтчета(ДанныеОтчета.ИмяОтчета, ЭлементDOM.Данные);
	//	Если ОтчетXBRL = ДанныеОтчета.ИмяОтчета Тогда 
	//	
	//		ОтчетыXBRL.Добавить(ОтчетXBRL);
	//		
	//	КонецЕсли;	
	//	
	//	ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
	//	
	//КонецЦикла;	
	Возврат ОтчетыXBRL;
	
КонецФункции	

Функция НулевыеОтчетыИзОтчетаXBRL(ДанныеОтчета)

	Возврат Новый Массив;
	
КонецФункции	

Функция НулевыеОтчетыИзОтчетаXML(ДанныеОтчета)
	
    ВариантыЭлементов = Новый Массив;
	ВариантыЭлементов.Добавить(ВРег("OKUDAxis"));
	ВариантыЭлементов.Добавить(ВРег("OKUDEnumerator"));
	
	НулевыеОтчеты = Новый Массив;
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДанныеОтчета.ДанныеXML);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(Чтение);
	
	СтрокаЗапросаXPath = "//*[@Value=""ZnachPokOtsMember""]";
	ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath(СтрокаЗапросаXPath, ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
	ЭлементDOM   = ВыборкаXPath.ПолучитьСледующий();
	Пока ЭлементDOM <> Неопределено Цикл
		
		Если ДанныеОтчета.ИмяОтчета = "ОКУД0420011" Тогда // 011-й отчет один в точке входа и в нем наличие "ZnachPokOtsMember" уже достаточно для определения нулевого отчета
			
			НулевыеОтчеты.Добавить("ОКУД0420011");
			Прервать;
			
		КонецЕсли;	
		
		Для Каждого ПодчиненныйЭлементDOM Из ЭлементDOM.РодительскийУзел.ДочерниеУзлы Цикл
			
			Если ВариантыЭлементов.Найти(ВРег(ПодчиненныйЭлементDOM.ИмяЭлемента)) <> Неопределено Тогда

				НулевойОтчет = ИзвлечьИмяОтчета(ДанныеОтчета.ИмяОтчета, ПодчиненныйЭлементDOM.Атрибуты.ПолучитьИменованныйЭлемент("Value").Значение);
				Если НулевойОтчет = ДанныеОтчета.ИмяОтчета Тогда
					
					НулевыеОтчеты.Добавить(НулевойОтчет);	
					//Сообщить(СтрШаблон("Найден отчет %1 с признаком нулевого отчета в элементе %2", ДанныеОтчета.ИмяОтчета, ЭлементDOM.ИмяЭлемента));
					
				Иначе	
					
					//Сообщить(СтрШаблон("Найден отчет %1 с признаком нулевого отчета для отчета %2 в элементе %3", ДанныеОтчета.ИмяОтчета, НулевойОтчет, ЭлементDOM.ИмяЭлемента));

				КонецЕсли;	
				
			КонецЕсли;
		
		КонецЦикла;	
		
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		
	КонецЦикла;	
	Возврат НулевыеОтчеты;
	
КонецФункции	

Функция ОтчетыСОтветственнымИзОтчетаXML(ДанныеОтчета)

	ОтчетыСОтветственным = Новый Массив;
	
	// 011-й отчет и ВладельцыИИСвПИФ одни в точке входа и в них просто достаточно проверить наличие элемента с ответственным
	Если ДанныеОтчета.ИмяОтчета = "ОКУД0420011" Или ДанныеОтчета.ИмяОтчета = "ВладельцыИИСвПИФ"	Тогда 
		
		Если КонтрольОтветственногоОтчетаПоПоказателю(ДанныеОтчета.ДанныеXML) Тогда
			
			ОтчетыСОтветственным.Добавить(ДанныеОтчета.ИмяОтчета);
			Возврат ОтчетыСОтветственным;
			
		КонецЕсли;	
			
	КонецЕсли;	
	
	ВариантыЭлементов = СтрРазделить(ВРег("OKUDAxis,OKUDEnumerator,PrOblastOtcetnostiTaxis"), ",", Ложь);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДанныеОтчета.ДанныеXML);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(Чтение);
	
	ВариантыСтрокиЗапросаXPath = СтрРазделить("//FIOLiczaOtvZaPrOblast,//LiczoOtvZaPrOblast", ",", Ложь);
	
	Для Каждого СтрокаЗапросаXPath Из ВариантыСтрокиЗапросаXPath Цикл 
		
		ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath(СтрокаЗапросаXPath, ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
		ЭлементDOM   = ВыборкаXPath.ПолучитьСледующий();
		Пока ЭлементDOM <> Неопределено Цикл
			
			Для Каждого ПодчиненныйЭлементDOM Из ЭлементDOM.РодительскийУзел.ДочерниеУзлы Цикл
				
				Если ВариантыЭлементов.Найти(ВРег(ПодчиненныйЭлементDOM.ИмяЭлемента)) <> Неопределено Тогда
					
					ИмяОтчета = ИзвлечьИмяОтчета(ДанныеОтчета.ИмяОтчета, ПодчиненныйЭлементDOM.Атрибуты.ПолучитьИменованныйЭлемент("Value").Значение);
					ОтчетыСОтветственным.Добавить(ИмяОтчета);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
			
		КонецЦикла;
		
	КонецЦикла;
	Возврат ОтчетыСОтветственным;
	
КонецФункции	

Функция ОтчетыПоРазделамИзОтчетаXML(ДанныеОтчета)
	
	ОтчетыИсключения = ОтчетыСодержащиеТолькоРазделОтветственныхВУФО();
	
	РазделыОтчета = СтрРазделить(ДанныеОтчета.РазделыОтчета, ",", Ложь);
	
    ОбщиеРазделы = Новый Массив;
	Если Не (ОтчетыИсключения.Найти(ДанныеОтчета.ИмяОтчета) <> Неопределено И ДанныеОтчета.ИсточникДанных = "УФО") Тогда
		
		ОбщиеРазделы.Добавить(ВРег("SR_Sved_ObOtchOrg_OtvLicza"));
		
	КонецЕсли;	
	ОбщиеРазделы.Добавить(ВРег("sr_sved_otch_org_otv_predm_obl"));
	ОбщиеРазделы.Добавить(ВРег("sr_sved_otch_org_inf_ob_otch"));
	Если ВРег(ДанныеОтчета.ИмяОтчета) <> "SR_INFO" Тогда
		
		ОбщиеРазделы.Добавить(ВРег("SR_INFO"));
		
	КонецЕсли;	
	Если ВРег(ДанныеОтчета.ИмяОтчета) <> "SR_SVED" Тогда

		ОбщиеРазделы.Добавить(ВРег("SR_SVED_OTCH_ORG_PODPISANT"));
		ОбщиеРазделы.Добавить(ВРег("SR_SVED_OTCH_ORG_UK"));
		
	КонецЕсли;

	АктуальныеОтчеты = Новый ТаблицаЗначений;
	АктуальныеОтчеты.Колонки.Добавить("Отчет", Новый ОписаниеТипов("Строка"));
	Для Каждого Раздел Из РазделыОтчета Цикл
		
		Если ОбщиеРазделы.Найти(СтрЗаменить(ВРег(Раздел), "_ITEM", "")) <> Неопределено Тогда

			Продолжить;
			
		КонецЕсли;	
		НоваяСтрока = АктуальныеОтчеты.Добавить();
		НоваяСтрока.Отчет = ИзвлечьИмяОтчета(ДанныеОтчета.ИмяОтчета, СтрЗаменить(ВРег(Раздел), "_ITEM", ""));
		
	КонецЦикла;
	АктуальныеОтчеты.Свернуть("Отчет");
	Возврат АктуальныеОтчеты.ВыгрузитьКолонку("Отчет");
	
КонецФункции

Функция ОтчетыСодержащиеТолькоРазделОтветственныхВУФО() 
	
	Результат = Новый Массив;
	Результат.Добавить("ОКУД0420402");
	Результат.Добавить("ОКУД0420404");
	Возврат Результат;
	
КонецФункции

Функция ПроверкаПризнакаНулевогоОтчета(ИмяОтчета, ОтчетыФайла, НулевыеОтчеты)
	
	ДанныеОтчетаЕстьВФайле        = ОтчетыФайла.Найти(ИмяОтчета) <> Неопределено;
	ПризнакНулевогоОтчетаВыгружен = НулевыеОтчеты.Найти(ИмяОтчета) <> Неопределено;
	
	Результат = "";
	Если ДанныеОтчетаЕстьВФайле И ПризнакНулевогоОтчетаВыгружен Тогда
		
		Результат = "Установлен ошибочно!";
		
	ИначеЕсли Не ДанныеОтчетаЕстьВФайле И Не ПризнакНулевогоОтчетаВыгружен Тогда
		
		Результат = "Не установлен!";
		
	ИначеЕсли Не ДанныеОтчетаЕстьВФайле И ПризнакНулевогоОтчетаВыгружен Тогда	
		
		Результат = "Установлен";
		
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьИмяОтчета(ТекущееИмяОтчета, ПредставлениеОтчета)
	
	Результат = ПредставлениеОтчета;
	
	Позиция0420 = СтрНайти(ПредставлениеОтчета, "0420");
	Если Позиция0420 > 0 Тогда
		
		Результат = "ОКУД" + ВРег(Сред(ПредставлениеОтчета, Позиция0420, 7));	
		
	ИначеЕсли ВРег(ПредставлениеОтчета) = ВРег("SvedOKolVldInvPaiPIFuchitIIS") Тогда	
		               
		Результат = "ВладельцыИИСвПИФ";
		
	ИначеЕсли ТекущееИмяОтчета = "БФО" Тогда
		
		Результат = "БФО";
		
	ИначеЕсли ТекущееИмяОтчета = "ГКФО_СопроводительноеПисьмо" Тогда 
		
		Результат = "ГКФО_СопроводительноеПисьмо";
		

	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420432" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_2") > 0 Тогда	
		
		Результат = "ОКУД0420432";	
		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420523" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_2") > 0 Тогда	
		
		Результат = "ОКУД0420523";	


	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420419" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_3") > 0 Тогда	
		
		Результат = "ОКУД0420419";	
		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420510" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_3") > 0 Тогда	
		
		Результат = "ОКУД0420510";	

		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420520" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_4") > 0 Тогда	
		
		Результат = "ОКУД0420520";	

		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420515" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_5") > 0 Тогда	
		
		Результат = "ОКУД0420515";	
		
		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420406" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_6") > 0 Тогда	
		
		Результат = "ОКУД0420406";	
		
	ИначеЕсли ТекущееИмяОтчета = "ОКУД0420516" И СтрНайти(ВРег(ПредставлениеОтчета), "SR_NFO_6") > 0 Тогда	
		
		Результат = "ОКУД0420516";	
		
	ИначеЕсли ТекущееИмяОтчета = "SR_INFO" Тогда	
		
		Результат = ТекущееИмяОтчета;
		
	ИначеЕсли ТекущееИмяОтчета = "SR_SVED" Тогда	
		
		Результат = ТекущееИмяОтчета;
		
	ИначеЕсли ОтчетыСодержащиеТолькоРазделОтветственныхВУФО().Найти(ТекущееИмяОтчета) <> Неопределено Тогда
		
		Результат = ТекущееИмяОтчета;
		
	Иначе
		
		Сообщить(СтрШаблон("Не удалось определить имя отчета по представлению %1 для текущего отчета %2", ПредставлениеОтчета, ТекущееИмяОтчета));
		
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции	

Процедура ВывестиСтрокиОтчета(ДатаТочка, ОтчетыТочкиВхода, ФайлыОтчетовТочкиВхода, Макет, ДокументРезультат)

	ID_Пакетов = ФайлыОтчетовТочкиВхода.Скопировать(, "ИдентификаторОтчета");
	ID_Пакетов.Свернуть("ИдентификаторОтчета");
	ID_Пакетов.Сортировать("ИдентификаторОтчета");
	
	Если ID_Пакетов.Количество() = 0 Тогда
		НоваяСтрока = ID_Пакетов.Добавить();
	КонецЕсли;	
	
	ОтчетыСЗаполненнымОтветственным = Новый Соответствие;
	Для Каждого СтрокаФайлов Из ФайлыОтчетовТочкиВхода Цикл
		
		Если СтрокаФайлов.КонтрольОтветственного Тогда
			
			ОтчетыСЗаполненнымОтветственным.Вставить(СтрШаблон("%1#%2#%3", 
			СтрокаФайлов.ИдентификаторОтчета, СтрокаФайлов.ИмяПакета, СтрокаФайлов.СубъектАналитики), 0);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	НачальнаяСтрокаОбласти = ДокументРезультат.ВысотаТаблицы + 1;

	Для Каждого СтрокаID_Пакетов Из ID_Пакетов Цикл
		
		НачальнаяСтрокаОбластиПакет = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОтчетыБезФайлов = Новый Массив;
		
		Для Каждого СтрокаОтчета Из ОтчетыТочкиВхода Цикл

			Если СтрокаОтчета.ИмяПакета = "SR_INFO" И Раздел_SR_INFO_ЕстьВФайлахПакета(ФайлыОтчетовТочкиВхода) Тогда
				// Если среди файлов пакета раздел SR_INFO уже есть в каком-то файле кроме файла SR_INFO, 
				// то вывод отчета SR_INFO отдельной строкой не имеет смысла
				Продолжить; 
				
			КонецЕсли;	
  			Если СтрНайти("ORDER, ORDER_dov", СтрокаОтчета.ИмяПакета) = 0 Тогда

				Отбор = Новый Структура("ID_Строки, ИдентификаторОтчета", СтрокаОтчета.ID_Строки, СтрокаID_Пакетов.ИдентификаторОтчета); 
				
			Иначе

				Отбор = Новый Структура("ИмяПакета, ИдентификаторОтчета", СтрокаОтчета.ИмяПакета, СтрокаID_Пакетов.ИдентификаторОтчета); 
				
			КонецЕсли;	
			
			НайденныеСтроки = ФайлыОтчетовТочкиВхода.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				
				Для Каждого СтрокаФайлов Из НайденныеСтроки Цикл
					
					ОбластьОтчета = ВывестиСтрокуОтчета(ДатаТочка, СтрокаОтчета, СтрокаФайлов, СтрокаID_Пакетов, Макет, ДокументРезультат, ОтчетыСЗаполненнымОтветственным);  
					
				КонецЦикла;	 
				
			Иначе	

				ОтчетыБезФайлов.Добавить(СтрокаОтчета);
				
			КонецЕсли;	
			
		КонецЦикла;
		
		Для Каждого СтрокаОтчета Из ОтчетыБезФайлов Цикл
			ОбластьОтчета = ВывестиСтрокуОтчета(ДатаТочка, СтрокаОтчета, , СтрокаID_Пакетов, Макет, ДокументРезультат);  
		КонецЦикла;	
		
		ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,     3, ДокументРезультат.ВысотаТаблицы, 3).Объединить(); // Версия таксономии
		ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,     4, ДокументРезультат.ВысотаТаблицы, 4).Объединить(); // ID отчета
		ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,    15, ДокументРезультат.ВысотаТаблицы, 15).Объединить(); // Примечание
		ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,     4, ДокументРезультат.ВысотаТаблицы, 4).ГраницаСнизу  = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Пунктир, 2);
		ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 4, ДокументРезультат.ВысотаТаблицы, 13).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Пунктир, 2);
		ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,    14, ДокументРезультат.ВысотаТаблицы, 14).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Пунктир, 2);
		
	КонецЦикла;
	
	ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет,  4, ДокументРезультат.ВысотаТаблицы,  4).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	ДокументРезультат.Область(НачальнаяСтрокаОбластиПакет, 14, ДокументРезультат.ВысотаТаблицы, 14).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	
	ДокументРезультат.Область(НачальнаяСтрокаОбласти, 1, ДокументРезультат.ВысотаТаблицы, 1).Объединить();
	ДокументРезультат.Область(НачальнаяСтрокаОбласти, 2, ДокументРезультат.ВысотаТаблицы, 2).Объединить();
	ДокументРезультат.Область(НачальнаяСтрокаОбласти, 3, ДокументРезультат.ВысотаТаблицы, 3).Объединить();
	
	ДокументРезультат.Область(НачальнаяСтрокаОбласти, 1, ДокументРезультат.ВысотаТаблицы, 2).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 1, ДокументРезультат.ВысотаТаблицы, 14).ГраницаСнизу = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
	
КонецПроцедуры

Функция Раздел_SR_INFO_ЕстьВФайлахПакета(ФайлыОтчетовТочкиВхода)
	
	ФлагSR_INFO = Ложь;
	Для Каждого СтрокаФайловXE Из ФайлыОтчетовТочкиВхода Цикл
		
		Если СтрНайти(СтрокаФайловXE.ДанныеXML, "SR_INFO") > 0 И Не СтрНачинаетсяС(ВРег(СтрокаФайловXE.ИмяФайла), "SR_INFO") Тогда
			
			ФлагSR_INFO = Истина;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	Возврат ФлагSR_INFO;
	
КонецФункции

Функция ВывестиСтрокуОтчета(ДатаТочка, СтрокаОтчета, СтрокаФайлов = Неопределено, СтрокаID_Пакетов, Макет, ДокументРезультат, ОтчетыСЗаполненнымОтветственным = Неопределено)
	
	Если ОтчетыСЗаполненнымОтветственным = Неопределено Тогда
		
		ОтчетыСЗаполненнымОтветственным = Новый Соответствие;
		
	КонецЕсли;	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка" + ?(СтрокаФайлов = Неопределено, "К", ""));
	ОбластьСтрока.Параметры.Заполнить(ДатаТочка);
	ОбластьСтрока.Параметры.Заполнить(СтрокаОтчета);
	Если СтрокаФайлов <> Неопределено Тогда
		
		ОбластьСтрока.Параметры.ИмяФайла            = СтрокаФайлов.ИмяФайла;
		ОбластьСтрока.Параметры.Примечание          = СтрокаФайлов.Примечание;
		ОбластьСтрока.Параметры.ДатаЗагрузки        = СтрокаФайлов.ДатаЗагрузки;
		ОбластьСтрока.Параметры.ПараметрыСкачивания = СтрокаФайлов.ПараметрыСкачивания;
		Если ВРег(СтрокаФайлов.КонтрольНулевого) = ВРег("Установлен") Тогда
			
			ОбластьСтрока.Область("КонтрольНулевого").Картинка = БиблиотекаКартинок.ПроверкаУспешна;
			
		Иначе	
			
			ОбластьСтрока.Параметры.КонтрольНулевого = СтрокаФайлов.КонтрольНулевого;
			Если ЗначениеЗаполнено(СтрокаФайлов.КонтрольНулевого) Тогда
				
				ОбластьСтрока.Область("ИмяОтчета").ЦветТекста = Новый Цвет(255, 0, 0);	
				
			КонецЕсли;	
			
		КонецЕсли;	
		Если СтрокаФайлов.КонтрольОтветственного Тогда
			
			ОбластьСтрока.Область("КонтрольОтветственного").Картинка = БиблиотекаКартинок.ПроверкаУспешна;
			
		ИначеЕсли СтрНайти("SR_INFO, SR_SVED, ORDER, ОКУД0420508, ОКУД0420509, БФО", СтрокаОтчета.ИмяПакета) = 0 Тогда
			
			// Здесь идет проверка для отчетов, которые выгружаются из нескольких источников (БУХ, УФО) Например, 402, 404, 501...
			// Если ответственный заполнен в отчете выгруженном из одного источника, тогда не нужно 
			// сигнализировать об отсутствии заполнении ответственного в отчетах выгруженных из остальных источников
			ТребуетсяКонтрольОтветственного = ОтчетыСЗаполненнымОтветственным.Получить(СтрШаблон("%1#%2#%3", 
				СтрокаФайлов.ИдентификаторОтчета, СтрокаОтчета.ИмяПакета, СтрокаОтчета.СубъектАналитики)) = Неопределено
				И Не (СтрНайти(СтрокаОтчета.ИмяПакета, "04205") > 0 И ВРег(СтрокаФайлов.КонтрольНулевого) = ВРег("Установлен"))
				И Не ОтчетыБезРазделаСОтветственными().Найти(СтрокаОтчета.ИмяПакета) <> Неопределено;			
				
			Если ТребуетсяКонтрольОтветственного Тогда
					
				ОбластьСтрока.Параметры.КонтрольОтветственного = "Не заполнен";
				ОбластьСтрока.Область("ИмяОтчета").ЦветТекста = Новый Цвет(255, 0, 0);	
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЕсли;	
	ОбластьСтрока.Параметры.Заполнить(СтрокаID_Пакетов);
    ОбластьСтрока.Параметры.Контроль = (СтрокаФайлов <> Неопределено);
	
	Возврат ДокументРезультат.Вывести(ОбластьСтрока);
		
КонецФункции

// В некоторых отчетах встречаются периоды из другого отчетного периода. Например, в 0420011 за июнь могут быть остатки и на 30.06 и на 31.05
// Если не фильтровать отчеты по имени файла, примечанию, тогда к отчету за май, например, может подтянуться файл с отчетом за июнь
Функция ПроверитьПоПериоду(СтрокаОтчета, СтрокаФайловXE)
	
	Результат = Истина;
	
	Месяц = ВРег(Формат(СтрокаОтчета.ОтчетнаяДата, "ДФ=MMММ"));

	Если ЕстьМесяцВСтроке(СтрокаФайловXE.ИмяФайла + СтрокаФайловXE.Примечание) И СтрНайти(ВРег(СтрокаФайловXE.ИмяФайла + СтрокаФайловXE.Примечание), Месяц) = 0 Тогда
		Результат = Ложь;
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции	

Функция ЕстьМесяцВСтроке(ПроверяемаяСтрока)
	
	Результат = Ложь;
	
	ПроверяемаяСтрокаВРег = ВРег(ПроверяемаяСтрока);
	
	ТекДата = Дата(2024, 1, 1);
	Пока ТекДата < Дата(2025, 1, 1) Цикл
		Если СтрНайти(ПроверяемаяСтрокаВРег, ВРег(Формат(ТекДата, "ДФ=MMММ"))) > 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;	
		ТекДата = ДобавитьМесяц(ТекДата, 1);
	КонецЦикла;	
	
	Возврат Результат;	
	
КонецФункции

Функция ВложенияПриказовИДоверенностей(ВложенияПакетов)
	
	Вложения = ВложенияПакетов.Скопировать(, "File_Path, Instance_ID");
	Вложения.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
	
	Для Каждого СтрокаВложений Из Вложения Цикл
		СтрокаВложений.Имя = РаботаСФайламиКлиентСервер.РазложитьПолноеИмяФайла(СтрокаВложений.File_Path).Имя;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВложений", Вложения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таб.Instance_ID КАК ИдентификаторОтчета,
		|	Таб.File_Path КАК ИмяФайла,
		|	Таб.Имя КАК Имя
		|ПОМЕСТИТЬ _Вложения
		|ИЗ
		|	&ТаблицаВложений КАК Таб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ORDER"" КАК КонтрольныйФайл
		|ПОМЕСТИТЬ _КонтрольныеФайлы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ORDER_dov""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ИдентификаторОтчета КАК ИдентификаторОтчета,
		|	_КонтрольныеФайлы.КонтрольныйФайл КАК КонтрольныйФайл
		|ПОМЕСТИТЬ ТаблицаКонтроля
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Вложения.ИдентификаторОтчета КАК ИдентификаторОтчета
		|	ИЗ
		|		_Вложения КАК _Вложения) КАК ВложенныйЗапрос,
		|	_КонтрольныеФайлы КАК _КонтрольныеФайлы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКонтроля.ИдентификаторОтчета КАК ИдентификаторОтчета,
		|	ТаблицаКонтроля.КонтрольныйФайл КАК ИмяПакета,
		|	МАКСИМУМ(_Вложения.ИдентификаторОтчета ЕСТЬ НЕ NULL ) КАК Контроль,
		|	МАКСИМУМ(_Вложения.Имя) КАК ИмяФайла
		|ПОМЕСТИТЬ _Предварительная
		|ИЗ
		|	ТаблицаКонтроля КАК ТаблицаКонтроля
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Вложения КАК _Вложения
		|		ПО ТаблицаКонтроля.ИдентификаторОтчета = _Вложения.ИдентификаторОтчета
		|			И (ВЫБОР
		|				КОГДА ТаблицаКонтроля.КонтрольныйФайл = ""ORDER""
		|					ТОГДА _Вложения.ИмяФайла ПОДОБНО ""%\ORDER_[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9].pdf""
		|				ИНАЧЕ _Вложения.ИмяФайла ПОДОБНО ""%\ORDER_dov_[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9].pdf""
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКонтроля.ИдентификаторОтчета,
		|	ТаблицаКонтроля.КонтрольныйФайл,
		|	_Вложения.Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Предварительная.ИдентификаторОтчета КАК ИдентификаторОтчета,
		|	_Предварительная.ИмяПакета КАК ИмяПакета,
		|	_Предварительная.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	_Предварительная КАК _Предварительная
		|ГДЕ
		|	_Предварительная.Контроль";
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПодготовитьРазделыXBRL(ОтчетностьЦБ, ВерсииТаксономии)
	
	ТипыБулевоИNull = Новый Массив;
	ТипыБулевоИNull.Добавить(Тип("Null"));
	ТипыБулевоИNull.Добавить(Тип("Булево"));
	
	РазделыXBRLНаКонецПериода = Новый ТаблицаЗначений;
	РазделыXBRLНаКонецПериода.Колонки.Добавить("ИмяПакета", 	   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	РазделыXBRLНаКонецПериода.Колонки.Добавить("ВерсияТаксономии", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	РазделыXBRLНаКонецПериода.Колонки.Добавить("МалоеПредприятие", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	РазделыXBRLНаКонецПериода.Колонки.Добавить("КонецПериода", 	   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	РазделыXBRLНаКонецПериода.Колонки.Добавить("ИсточникДанных",   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	РазделыXBRLНаКонецПериода.Колонки.Добавить("РазделыXBRL", 	   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1000)));
	
	ВремРазделыXBRL = ОтчетностьЦБ.ПолучитьТаблицуИзМакета("РазделыXBRL", , , , , Ложь);
	ВремРазделыXBRL.Сортировать("ИмяПакета,ТаксономияС,ТаксономияПо,МалоеПредприятие,КонецПериода,ИсточникДанных");
	
	Для Каждого СтрокаРазделыXBRL Из ВремРазделыXBRL Цикл
		Для Каждого ВерсияТаксономии Из ВерсииТаксономии Цикл
			
			Если ЗначениеЗаполнено(СтрокаРазделыXBRL.ТаксономияС) И ВерсияТаксономии < СтрокаРазделыXBRL.ТаксономияС Тогда
				Продолжить;
			ИначеЕсли ЗначениеЗаполнено(СтрокаРазделыXBRL.ТаксономияПо) И ВерсияТаксономии > СтрокаРазделыXBRL.ТаксономияПо Тогда
				Продолжить;
			КонецЕсли;
			
			КонцыПериодов = СтрРазделить(СтрокаРазделыXBRL.КонецПериода, ",", Ложь);
			Если КонцыПериодов.Количество() = 0 Тогда
				
				КонцыПериодов = СтрРазделить("Месяц,Квартал,Год,Годовая", ",", Ложь);
				
			КонецЕсли;	
			
			Для Каждого КонецПериода Из КонцыПериодов Цикл
				
				ПараметрыПоиска = Новый Структура("ИмяПакета, ВерсияТаксономии, МалоеПредприятие, КонецПериода, ИсточникДанных", 
					СтрокаРазделыXBRL.ИмяПакета, ВерсияТаксономии, ВРЕГ(СтрокаРазделыXBRL.МалоеПредприятие), 
					КонецПериода, СтрокаРазделыXBRL.ИсточникДанных);
				НайденныеСтроки = РазделыXBRLНаКонецПериода.НайтиСтроки(ПараметрыПоиска);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					НайденныеСтроки[0].РазделыXBRL = НайденныеСтроки[0].РазделыXBRL + "," + СтрокаРазделыXBRL.ИмяРаздела;
					
				Иначе	
					
					НоваяСтрокаРазделыXBRL = РазделыXBRLНаКонецПериода.Добавить();
					НоваяСтрокаРазделыXBRL.ВерсияТаксономии = ВерсияТаксономии;
					НоваяСтрокаРазделыXBRL.МалоеПредприятие = ВРЕГ(СтрокаРазделыXBRL.МалоеПредприятие);
					НоваяСтрокаРазделыXBRL.КонецПериода     = КонецПериода;
					НоваяСтрокаРазделыXBRL.РазделыXBRL      = СтрокаРазделыXBRL.ИмяРаздела;
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРазделыXBRL, СтрокаРазделыXBRL, , "МалоеПредприятие, КонецПериода");
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаРазделыXBRL Из РазделыXBRLНаКонецПериода Цикл
		СтрокаРазделыXBRL.РазделыXBRL = СтрокаРазделыXBRL.РазделыXBRL + ?(ЗначениеЗаполнено(СтрокаРазделыXBRL.РазделыXBRL), ",", "") + "OKUD" + СтрЗаменить(СтрокаРазделыXBRL.ИмяПакета, "ОКУД", "") + "Member";
		// Понадобилось выгрузить нулевой 401-й отчет и чек-лист не видит его. Добавляем к списку разделов раздел с ответственными, но с этим нужно быть аккуратнее, т.к. могут подтянуться ненужные файлы
		Если СтрНачинаетсяС(СтрокаРазделыXBRL.ИмяПакета, "ОКУД0420401") И ПустаяСтрока(СтрокаРазделыXBRL.ИсточникДанных) Тогда
			СтрокаРазделыXBRL.РазделыXBRL = СтрокаРазделыXBRL.РазделыXBRL + "," + "SR_Sved_ObOtchOrg_OtvLicza";
		КонецЕсли;	
	КонецЦикла;
	
	Возврат РазделыXBRLНаКонецПериода;
	
КонецФункции

Процедура ЗаполнитьУсловияОтбора(ОтчетностьЦБ, ТаблицаОтчеты, Отказ)
	
	ТаблицаОтчеты.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	МассивЗначей = ТаблицаОтчеты.ВыгрузитьКолонку("ЗначениеОсиДляОтбора"); 
	ТаблицаОтчеты.Колонки.Удалить("ЗначениеОсиДляОтбора");
	ТаблицаОтчеты.Колонки.Добавить("ЗначениеОсиДляОтбора");
	ТаблицаОтчеты.ЗагрузитьКолонку(МассивЗначей, "ЗначениеОсиДляОтбора");
	
	ВерсииТаксономии = Новый Массив;
	Для Каждого СтрокаОтчета Из ТаблицаОтчеты Цикл
		СтрокаОтчета.Идентификатор = Новый УникальныйИдентификатор;
		Если ВерсииТаксономии.Найти(СтрокаОтчета.ВерсияТаксономии) = Неопределено Тогда
			ВерсииТаксономии.Добавить(СтрокаОтчета.ВерсияТаксономии);
		КонецЕсли;
	КонецЦикла;

	Для Каждого ВерсияТаксономии Из ВерсииТаксономии Цикл
		ТаблицаОсей = ТаблицаОтчеты.Скопировать(Новый Структура("ВерсияТаксономии", ВерсияТаксономии), "Идентификатор,ЗначениеОсиДляОтбора");
		Если ТаблицаОсей.Количество() > 0 Тогда
			ОтчетностьЦБ.ВерсияТаксономии = ВерсияТаксономии;
			МассивЗначенийОсей = ОтчетностьЦБ.ПолучитьМассивЗначенийОсей(ТаблицаОсей, "ЗначениеОсиДляОтбора", Ложь, Отказ);	
			ТаблицаОсей.ЗагрузитьКолонку(МассивЗначенийОсей, "ЗначениеОсиДляОтбора");
			Для Каждого СтрокаОсей Из ТаблицаОсей Цикл
				ТаблицаОтчеты.Найти(СтрокаОсей.Идентификатор, "Идентификатор").ЗначениеОсиДляОтбора = СтрокаОсей.ЗначениеОсиДляОтбора;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОтчеты.Колонки.Удалить("Идентификатор");
	ТаблицаОтчеты.Колонки.Добавить("УсловиеОтбора", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаОтчета Из ТаблицаОтчеты Цикл
		Если ЗначениеЗаполнено(СтрокаОтчета.ЗначениеОсиДляОтбора) Тогда
			Если СтрокаОтчета.ИмяПакета = "ОКУД0420502" Тогда
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420502_R1/sr_0420502_R1_Item/IdAifPifTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
			ИначеЕсли СтрокаОтчета.ИмяПакета = "ОКУД0420503" Тогда
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420503_R1/sr_0420503_R1_Item/IdAifPifTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
			ИначеЕсли СтрокаОтчета.ИмяПакета = "ОКУД0420504" Тогда
				УсловиеОтбора1 = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420504_r4_2/sr_0420504_r4_2_Item/IdAifPifTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
				// Т.к. у нас 504-й отчет может быть прикреплен сразу в XBRL, то нужно было как-то проверить, что это именно он возвращается из XE. Но всё оказалось проще потому что..
				// 504-й отчет в точке входа один и для точки входа из XE не должен подтянуться какой-то другой отчет, где тоже есть показатель RegNomPravilDoverUpravFondom
				// Поэтому проверка, что в прикрепленном файле находится именно он оказалась не нужна. Просто делаем отбор по номеру правил ПИФ-а, чтобы отобрать 504-й отчет нужного ПИФ-а
				УсловиеОтбора2 = СтрШаблон("Convert(XML, [File_Data]).value('declare namespace uk-dic=""http://www.cbr.ru/xbrl/nso/uk/dic""; (//uk-dic:RegNomPravilDoverUpravFondom)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("%1 OR %2", УсловиеОтбора1, УсловиеОтбора2) ;
			ИначеЕсли СтрокаОтчета.ИмяПакета = "ОКУД0420505" Тогда
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420505_R1/sr_0420505_R1_Item/IdAifPifTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
			ИначеЕсли СтрокаОтчета.ИмяПакета = "ОКУД0420506" Тогда
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420506/sr_0420506_Item/ID_fondaTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
			ИначеЕсли СтрокаОтчета.ИмяПакета = "ОКУД0420507" Тогда
				СтрокаОтчета.УсловиеОтбора = СтрШаблон("Convert(XML, [File_Data]).value('(XBRL_Entry_Point/sr_0420507/sr_0420507_Item/ID_fondaTaxis/@Value)[1]', 'nvarchar(100)') = '%1'", СтрокаОтчета.ЗначениеОсиДляОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВедетсяУчетДолжностныхЛиц(Организация)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",		 ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДолжностныеЛицаОрганизаций.Период КАК Период
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций КАК ДолжностныеЛицаОрганизаций
		|ГДЕ
		|	ДолжностныеЛицаОрганизаций.Организация = &Организация
		|	И ДолжностныеЛицаОрганизаций.Период <= &Период";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции