// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Контроль сделок РЕПО-М",
		"0.02",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ВыполнитьКонтрольСделокРЕПО_М", 
		"Выполнить контроль сделок РЕПО-М"
		,
		, 
		Ложь, 
		"ВызовСерверногоМетода");
		
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//     элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	КалендарьКотировок = ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
	
	Если Не ЭтоРабочийИлиТорговыйДень(КалендарьКотировок) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, , ПараметрыКоманды);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду(" + ИдентификаторКоманды + ")";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если ИдентификаторКоманды = "ВыполнитьКонтрольСделокРЕПО_М" Тогда
	
		ВыполнитьКонтрольСделокРЕПО_М(КалендарьКотировок, ПараметрыКоманды);
	
	КонецЕсли; 
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, Ложь);
	
КонецПроцедуры

Процедура ВыполнитьКонтрольСделокРЕПО_М(КалендарьКотировок, ПараметрыКоманды)
		
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПО.Ссылка КАК Ссылка,
		|	СделкаРЕПО.Рынок КАК Рынок,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Количество КАК Количество,
		|	НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ) КАК Дата,
		|	СделкаРЕПО.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	СделкаРЕПО.Дисконт КАК Дисконт,
		|	СделкаРЕПО.ВалютаСделки КАК ВалютаСделки
		|ПОМЕСТИТЬ _ДанныеСделокРЕПО_М
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка
		|ГДЕ
		|	СделкаРЕПО.ЧастьСделкиРЕПО = 1
		|	И СделкаРЕПО.РежимБиржевыхТоргов.РЕПО_М
		|	И СделкаРЕПО.Проведен
		|	И СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеСделокРЕПО_М.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) - 1 КАК КоличествоДней
		|ПОМЕСТИТЬ _СрокиРЕПО
		|ИЗ
		|	_ДанныеСделокРЕПО_М КАК _ДанныеСделокРЕПО_М
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = &Календарь)
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДанныеКалендаря.Дата МЕЖДУ _ДанныеСделокРЕПО_М.Дата И _ДанныеСделокРЕПО_М.ДатаВторойЧастиРЕПО)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеСделокРЕПО_М.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК КоличествоДней,
		|	&ВалютаРубли КАК Валюта,
		|	РежимыБиржевыхТоргов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _РежимыТоргов
		|ИЗ
		|	Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|ГДЕ
		|	РежимыБиржевыхТоргов.Код = ""EQRP""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеСделокРЕПО_М.Ссылка КАК СделкаРЕПО,
		|	_ДанныеСделокРЕПО_М.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДанныеСделокРЕПО_М.Количество КАК Количество,
		|	_ДанныеСделокРЕПО_М.Дата КАК Дата,
		|	_ДанныеСделокРЕПО_М.ДатаВторойЧастиРЕПО КАК ДатаВторойЧасти,
		|	_СрокиРЕПО.КоличествоДней КАК СрокРЕПО,
		|	_ДанныеСделокРЕПО_М.Дисконт КАК ДисконтСделки,
		|	ЕСТЬNULL(РыночныеРискиНКЦ.Дисконт, 0) КАК ДисконтНКЦ,
		|	_ДанныеСделокРЕПО_М.ВалютаСделки КАК ВалютаСделки,
		|	ЕСТЬNULL(_РежимыТоргов.Ссылка, НЕОПРЕДЕЛЕНО) КАК РежимТоргов,
		|	ЕСТЬNULL(КотировкиТорговыхПлощадок.РежимТоргов, НЕОПРЕДЕЛЕНО) КАК РежимТорговКотировки
		|ИЗ
		|	_ДанныеСделокРЕПО_М КАК _ДанныеСделокРЕПО_М
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СрокиРЕПО КАК _СрокиРЕПО
		|		ПО _ДанныеСделокРЕПО_М.Ссылка = _СрокиРЕПО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеРискиНКЦ КАК РыночныеРискиНКЦ
		|		ПО (РыночныеРискиНКЦ.ДатаРасчетов = _ДанныеСделокРЕПО_М.Дата)
		|			И _ДанныеСделокРЕПО_М.ЦеннаяБумага = РыночныеРискиНКЦ.ЦеннаяБумага
		|			И (_ДанныеСделокРЕПО_М.Количество МЕЖДУ РыночныеРискиНКЦ.ДиапазонНачало И РыночныеРискиНКЦ.ДиапазонОкончание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТоргов КАК _РежимыТоргов
		|		ПО _ДанныеСделокРЕПО_М.ВалютаСделки = _РежимыТоргов.Валюта
		|			И (_СрокиРЕПО.КоличествоДней = _РежимыТоргов.КоличествоДней)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО _ДанныеСделокРЕПО_М.Дата = КотировкиТорговыхПлощадок.Период
		|			И _ДанныеСделокРЕПО_М.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И _ДанныеСделокРЕПО_М.Рынок = КотировкиТорговыхПлощадок.Рынок
		|			И (КотировкиТорговыхПлощадок.Биржа = &Биржа)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов.РЕПО)
		|			И (НЕ КотировкиТорговыхПлощадок.РежимТоргов.РЕПО_М)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов = _РежимыТоргов.Ссылка)
		|			И (КотировкиТорговыхПлощадок.Валюта = _РежимыТоргов.Валюта)
		|ГДЕ
		|	(_ДанныеСделокРЕПО_М.Дисконт < ЕСТЬNULL(РыночныеРискиНКЦ.Дисконт, 0)
		|			ИЛИ КотировкиТорговыхПлощадок.РежимТоргов ЕСТЬ NULL
		|			ИЛИ _РежимыТоргов.Ссылка ЕСТЬ NULL)";		
	#КонецОбласти
	
	ПредыдущийТорговыйДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(КалендарьКотировок, НачалоДня(ТекущаяДата())-1);
    
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыКоманды.Организация);
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	Запрос.УстановитьПараметр("ВалютаРубли", 		ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("Календарь", 			КалендарьКотировок);
	Запрос.УстановитьПараметр("НачалоПериода", 		ПредыдущийТорговыйДень);
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	КонецДня(ПредыдущийТорговыйДень));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДанныеОповещения = Новый Массив;
	
	ШаблонОшибки = "По сделке '%1' с бумагой '%2' %3.";
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеОшибки = Новый Массив;
	
		Если Выборка.ДисконтСделки < Выборка.ДисконтНКЦ Тогда
			ОписаниеОшибки.Добавить(СтрШаблон("Дисконт по сделке (%1) ниже допустимого (%2)", Выборка.ДисконтСделки, Выборка.ДисконтНКЦ));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.РежимТорговКотировки) Тогда
			ОписаниеОшибки.Добавить("В день сделки нет торгов в режиме " + Выборка.РежимТоргов);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Выборка.РежимТоргов) Тогда
		
			ЗаписьЖурналаРегистрации("Дополнительные отчеты и обработки", 
									УровеньЖурналаРегистрации.Ошибка,
									ЭтотОбъект.Метаданные(),
									Неопределено,
									"Не удалось сопоставить режмм торгов при контроле сделок РЕПО-М");
		
		КонецЕсли;		
		
		Если ОписаниеОшибки.Количество() > 0 Тогда
			ДанныеОповещения.Добавить(СтрШаблон(ШаблонОшибки, Выборка.СделкаРЕПО, Выборка.ЦеннаяБумага, СтрСоединить(ОписаниеОшибки, "; ")));
		КонецЕсли;
		
	
	КонецЦикла;
	
	Если ДанныеОповещения.Количество() > 0 Тогда
	
		СформироватьОповещения(ДанныеОповещения, ПараметрыКоманды.Организация);
	
	КонецЕсли;

КонецПроцедуры

Функция ЭтоРабочийИлиТорговыйДень(КалендарьКотировок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Календарь КАК Календарь
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата = &Дата
		|	И ДанныеКалендаря.Календарь В (&КалендарьКотировок, ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
	Запрос.УстановитьПараметр("Дата", 				НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КалендарьКотировок", КалендарьКотировок);
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Процедура СформироватьОповещения(ДанныеОповещения, Организация)

	Текст = СтрСоединить(ДанныеОповещения, Символы.ПС);
	РеквизитыОповещения = Новый Структура("Текст, Организация", Текст, Организация);
	Справочники.Оповещения.СформироватьОповещения("Обработка._КонтрольСделокРЕПО_М", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	
КонецПроцедуры