
Процедура УстановитьБлокировки(ОснованиеЗадолженности)
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;

	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание", ОснованиеЗадолженности);
	
	БлокировкаДанных.Заблокировать();

КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Если ТипЗнч(ЭтотОбъект.Поручение) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") И ЭтотОбъект.Поручение.ВыводВсехАктивов Тогда
		Возврат;
	КонецЕсли;
	
	ОснованиеПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Поручение, "Основание");
	
	ОснованиеЗадолженностиПоДенежнымСредствамПоПоручениям = ?(ЗначениеЗаполнено(ОснованиеПоручения), ОснованиеПоручения, ЭтотОбъект.Поручение); 
	
	УстановитьБлокировки(ОснованиеЗадолженностиПоДенежнымСредствамПоПоручениям);

	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);

	Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.Записывать = Истина;
	
	// задолженность по д/с
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ПериодДень КАК Период,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание = &Основание) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("Период",                       Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодДень",                   ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Основание",                    ОснованиеЗадолженностиПоДенежнымСредствамПоПоручениям);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отсутствует задолженность по документу " + ЭтотОбъект.Поручение + "!'"), ЭтотОбъект, "Поручение",, Отказ);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.ДобавитьРасход(), Выборка);	
		
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
				
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
		ЭтотОбъект.Поручение = ДанныеЗаполнения;
		
	Конецесли;
		
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ЭтотОбъект.Поручение = Документы.ПоручениеНаДвижениеЦенныхБумаг.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
		
КонецПроцедуры

#КонецОбласти
