
Процедура УстановитьСтатусЗаявкиНаПриобретениеПаев(Организация, ЗаявкаПайщика, НовыйСтатус, Период, Отказ = Ложь) Экспорт
	
	Попытка
		
		Блокировка				= Новый БлокировкаДанных;
		ЭлементБлокировки		= Блокировка.Добавить(Метаданные.РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.ПолноеИмя());
		ЭлементБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("Организация", 	Организация);
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаПайщика",	ЗаявкаПайщика);
		                        
		Блокировка.Заблокировать();
        		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗаявокНаПриобретениеПаевСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокНаПриобретениеПаев.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ЗаявкаПайщика = &ЗаявкаПайщика) КАК СтатусыЗаявокНаПриобретениеПаевСрезПоследних");
			
		Запрос.УстановитьПараметр("Период",			Период);
		Запрос.УстановитьПараметр("ЗаявкаПайщика",	ЗаявкаПайщика);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем текущий статус
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				Возврат;
			ИначеЕсли Выборка.Статус = Перечисления.СтатусыЗаявокПайщиков.Принята Тогда
				// Это конечный статус, его не меняем
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Запрещено изменять статус '%1' документа %2", Выборка.Статус, ЗаявкаПайщика), ЗаявкаПайщика,,, Отказ);
				Возврат;		
			КонецЕсли;
		КонецЕсли;
				
		МенеджерЗаписи					= РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.Период			= Период;
		МенеджерЗаписи.Организация		= Организация;
		МенеджерЗаписи.ЗаявкаПайщика	= ЗаявкаПайщика;
		МенеджерЗаписи.Статус			= НовыйСтатус;
		
		МенеджерЗаписи.Записать(Истина);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ЗаявкаПайщика,,, Отказ);
	КонецПопытки;	
		
КонецПроцедуры
