 
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходности по активам",
		"0.59",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДатуПервогоВводаПоСчетуДУ(ВхОрганизация, ВхСчетДоверительногоУправления, ВхПериодОтчета) Экспорт
	
	Перем ДатаПервогоВвода;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НАЧАЛОПЕРИОДА(ВводыВыводы.Период, ДЕНЬ) КАК НачалоПериода
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводы
		|ГДЕ
		|	ВводыВыводы.Организация = &Организация
		|	И ВводыВыводы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводы.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВводыВыводы.Период";
	
	Запрос.УстановитьПараметр("Организация", ВхОрганизация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ВхСчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДатаПервогоВвода = РезультатЗапроса.Выгрузить()[0].НачалоПериода;
	КонецЕсли;
	
	Если ДатаПервогоВвода = Неопределено и ВхСчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица и 
		ВхСчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет тогда
		ДатаПервогоВвода = НачалоГода(ВхПериодОтчета.ДатаНачала);
	КонецЕсли;
	
	Возврат ДатаПервогоВвода;
	
КонецФункции

Функция ПолучитьДатаНачалаОтчетаДляСчетаДУ(вхСчетДоверительногоУправления)
	
	ДатаПервогоВвода = ПолучитьДатуПервогоВводаПоСчетуДУ(ЭтотОбъект.Организация, вхСчетДоверительногоУправления, ЭтотОбъект.Период);
	Если ДатаПервогоВвода = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ДатаПервогоВвода > ЭтотОбъект.Период.ДатаНачала Тогда
		ДатаНачала = ДатаПервогоВвода;
	Иначе
		ДатаНачала = ЭтотОбъект.Период.ДатаНачала;
	КонецЕсли;

	Возврат ДатаНачала;
	
КонецФункции

// не надо. Артефакт разработки. Вдруг еще понадобитсч
Функция ПолучитьКодыБрокера(СписокСчетовДУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.Брокер КАК Брокер,
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.Код КАК Код,
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер КАК ОсновнойБрокер,
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров КАК РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ТекущаяДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.ОсновнойБрокер
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ТекущаяДата)
		|	И РегистрСведенийКодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления В(&СписокСчетовДУ)"; 
	
	Запрос.УстановитьПараметр("СписокСчетовДУ", СписокСчетовДУ);
	Запрос.УстановитьПараметр("ТекущаяДата", ЭтотОбъект.Период.ДатаОкончания);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	Возврат Результат;
	
КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка, СписокСчетовДУ = Неопределено) Экспорт 

	Сессия = Неопределено;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();	
	
	Попытка
    	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;	

	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "ДляУправляющих2" Тогда
		Для Каждого Элемемент из СписокСчетовДУ Цикл
			СчетДУ = Элемемент.Значение;
			ДатаНачала = ПолучитьДатаНачалаОтчетаДляСчетаДУ(СчетДУ);
			Если ДатаНачала = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет СЧА на " + Формат(НачалоДня(ДатаНачала) - 3600*24, "ДФ=dd.MM.yyyy") + " у счета ДУ " + СчетДУ + ". Счет ДУ пропущен");
				Продолжить;
			КонецЕсли;
			СформироватьПоСчетуДУ(СчетДУ, ДатаНачала, ДокументРезультат, ДокументРасшифровка); 
		КонецЦикла
	Иначе 
		ДатаНачала = ЭтотОбъект.Период.ДатаНачала; 
		СформироватьПоСчетуДУ(ЭтотОбъект.СчетДоверительногоУправления, ДатаНачала, ДокументРезультат, ДокументРасшифровка); 
	КонецЕсли;	
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПоСчетуДУ(ВхСчетДоверительногоУправления, ДатаНачала, ДокументРезультат, ДокументРасшифровка) 
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
#Область Запросище	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""АС"" КАК Код,
		|	""Активы по амортизированной стоимости"" КАК Наименование
		|ПОМЕСТИТЬ _ВидыАктивов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СС"",
		|	""Активы по справедливой стоимости""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	10 КАК Порядок,
		|	""по открытым позициям"" КАК Группировка
		|ПОМЕСТИТЬ _Группировки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	20,
		|	""по закрытым позициям""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	30,
		|	""размещение ДС""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	""денежные средства и расходы""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	310 КАК КодАналитии,
		|	""МНО"" КАК Аналитика
		|ПОМЕСТИТЬ _Аналитики
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	320,
		|	""РЕПО""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	330,
		|	""Депозит""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	410,
		|	""денежные средства на р/сч и брокере""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	415,
		|	""денежные средства в валюте""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	420,
		|	""комиссия банка""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	430,
		|	""комиссия депозитария""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	440,
		|	""вознаграждение управляющего""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	450,
		|	""услуги спецдепозитария""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	460,
		|	""необходимые расходы спецдепозитария""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	465,
		|	""расходы по вознаграждению спецдепозитария""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	470,
		|	""НДФЛ""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	480,
		|	""Прочее""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	40 КАК Группировка,
		|	420 КАК Аналитика
		|ПОМЕСТИТЬ _ДоходыРасходыШаблон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	430
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	440
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	450
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	460
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	465
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	470
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	40,
		|	480
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦБпоАС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетАС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦБпоCC
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			Счет В ИЕРАРХИИ (&СчетСС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_ЦБпоCC.ЦеннаяБумага, _ЦБпоАС.ЦеннаяБумага) КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _БумагиСДвойнойКлассификацией
		|ИЗ
		|	_ЦБпоАС КАК _ЦБпоАС
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЦБпоCC КАК _ЦБпоCC
		|		ПО (_ЦБпоCC.ЦеннаяБумага = _ЦБпоАС.ЦеннаяБумага)
		|ГДЕ
		|	_ЦБпоCC.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|	И _ЦБпоАС.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _Регистраторы
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Активность
		|	И ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПоставкаЦенныхБумаг), ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|	И ОперацииСЦеннымиБумагами.ЦеннаяБумага В
		|			(ВЫБРАТЬ
		|				_ЦБпоАС.ЦеннаяБумага КАК ЦеннаяБумага
		|			ИЗ
		|				_ЦБпоАС КАК _ЦБпоАС
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				_БумагиСДвойнойКлассификацией.ЦеннаяБумага
		|			ИЗ
		|				_БумагиСДвойнойКлассификацией КАК _БумагиСДвойнойКлассификацией)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор КАК Документ.ПоставкаЦенныхБумаг).Основание
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор
		|	КОНЕЦ КАК Сделка,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (&СчетАС)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоНачальныйОстаток,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ _ДокументыАктивовАСПредварительно
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Движения,
		|			Счет В ИЕРАРХИИ (&СчетАС, &СчетСС),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						_ЦБпоАС.ЦеннаяБумага КАК ЦеннаяБумага
		|					ИЗ
		|						_ЦБпоАС КАК _ЦБпоАС
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_БумагиСДвойнойКлассификацией.ЦеннаяБумага
		|					ИЗ
		|						_БумагиСДвойнойКлассификацией КАК _БумагиСДвойнойКлассификацией)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|ГДЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				_Регистраторы.Регистратор
		|			ИЗ
		|				_Регистраторы КАК _Регистраторы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДокументыАктивовАСПредварительно.Сделка КАК Сделка,
		|	_ДокументыАктивовАСПредварительно.ВидАктива КАК ВидАктива,
		|	_ДокументыАктивовАСПредварительно.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_ДокументыАктивовАСПредварительно.Сделка) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|				ТОГДА _ДокументыАктивовАСПредварительно.КоличествоКонечныйОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Остаток
		|ПОМЕСТИТЬ _ДокументыАктивовАС
		|ИЗ
		|	_ДокументыАктивовАСПредварительно КАК _ДокументыАктивовАСПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДокументыАктивовАСПредварительно.Сделка,
		|	_ДокументыАктивовАСПредварительно.ВидАктива,
		|	_ДокументыАктивовАСПредварительно.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	1 КАК ЕстьКоммиссияВДебиторке
		|ПОМЕСТИТЬ _КомиссияТПлюсВДебиторке
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАКонец
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В(&ВидыЗадолженностиКомиссии)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	1
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНачало
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В(&ВидыЗадолженностиКомиссии)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(РасходыПоСделкеОбороты.Сделка.Дата, ДЕНЬ) КАК ДатаСделки,
		|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
		|	СУММА(РасходыПоСделкеОбороты.СуммаОборот) КАК СуммаКомиссии,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходыПоСделкеОбороты.Сделка) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА УсловияСделокСВалютой.Валюта
		|		ИНАЧЕ РасходыПоСделкеОбороты.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	НАЧАЛОПЕРИОДА(РасходыПоСделкеОбороты.Период, ДЕНЬ) КАК ДатаОплаты,
		|	ЕСТЬNULL(УсловияСделок.ДатаИсполнения, ЕСТЬNULL(УсловияСделокРЕПО.ДатаИсполнения, УсловияСделокСВалютой.ДатаИсполнения)) КАК ДатаИсполнения,
		|	ЕСТЬNULL(ЕСТЬNULL(УсловияСделок.Сделка.ВидСделки, УсловияСделокСВалютой.СделкаСВалютой.ВидСделки), ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделокРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|							ТОГДА ""Покупка (РЕПО)""
		|						ИНАЧЕ ""Продажа (РЕПО)""
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА УсловияСделокРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""Продажа (РЕПО ч.2)""
		|					ИНАЧЕ ""Покупка (РЕПО ч.2)""
		|				КОНЕЦ
		|		КОНЕЦ) КАК ВидОперации,
		|	ЕСТЬNULL(УсловияСделок.Рынок, ЕСТЬNULL(УсловияСделокРЕПО.Рынок, ""Валюта"")) КАК Рынок,
		|	ЕСТЬNULL(УсловияСделокРЕПО.ЧастьСделкиРЕПО, 0) КАК ЧастьСделкиРЕПО
		|ПОМЕСТИТЬ _Комиссии
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -15),
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (&ВидыЗадолженностиКомиссии)) КАК РасходыПоСделкеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО РасходыПоСделкеОбороты.Сделка = УсловияСделок.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО РасходыПоСделкеОбороты.Сделка = УсловияСделокРЕПО.СделкаРЕПО
		|			И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСВалютой КАК УсловияСделокСВалютой
		|		ПО РасходыПоСделкеОбороты.Сделка = УсловияСделокСВалютой.СделкаСВалютой
		|ГДЕ
		|	(ЕСТЬNULL(УсловияСделок.ДатаИсполнения, ЕСТЬNULL(УсловияСделокРЕПО.ДатаИсполнения, УсловияСделокСВалютой.ДатаИсполнения)) >= &НачалоПериода
		|			ИЛИ НАЧАЛОПЕРИОДА(РасходыПоСделкеОбороты.Период, ДЕНЬ) >= &НачалоПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(РасходыПоСделкеОбороты.Сделка.Дата, ДЕНЬ),
		|	РасходыПоСделкеОбороты.Сделка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(РасходыПоСделкеОбороты.Сделка) = ТИП(Документ.СделкаСВалютой)
		|			ТОГДА УсловияСделокСВалютой.Валюта
		|		ИНАЧЕ РасходыПоСделкеОбороты.ЦеннаяБумага
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(РасходыПоСделкеОбороты.Период, ДЕНЬ),
		|	ЕСТЬNULL(УсловияСделок.ДатаИсполнения, ЕСТЬNULL(УсловияСделокРЕПО.ДатаИсполнения, УсловияСделокСВалютой.ДатаИсполнения)),
		|	ЕСТЬNULL(ЕСТЬNULL(УсловияСделок.Сделка.ВидСделки, УсловияСделокСВалютой.СделкаСВалютой.ВидСделки), ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделокРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|							ТОГДА ""Покупка (РЕПО)""
		|						ИНАЧЕ ""Продажа (РЕПО)""
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА УсловияСделокРЕПО.СделкаРЕПО.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""Продажа (РЕПО ч.2)""
		|					ИНАЧЕ ""Покупка (РЕПО ч.2)""
		|				КОНЕЦ
		|		КОНЕЦ),
		|	ЕСТЬNULL(УсловияСделок.Рынок, ЕСТЬNULL(УсловияСделокРЕПО.Рынок, ""Валюта"")),
		|	ЕСТЬNULL(УсловияСделокРЕПО.ЧастьСделкиРЕПО, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Комиссии.ДатаСделки КАК ДатаСделки,
		|	_Комиссии.Сделка КАК Сделка,
		|	СУММА(ВЫБОР
		|			КОГДА _Комиссии.ДатаОплаты <= &КонецПериода
		|				ТОГДА _Комиссии.СуммаКомиссии
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомиссии,
		|	_Комиссии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_Комиссии.ДатаОплаты) КАК ДатаОплаты,
		|	_Комиссии.ДатаИсполнения КАК ДатаИсполнения,
		|	_Комиссии.ВидОперации КАК ВидОперации,
		|	_Комиссии.Рынок КАК Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО
		|ПОМЕСТИТЬ _КомиссияОплаченная
		|ИЗ
		|	_Комиссии КАК _Комиссии
		|ГДЕ
		|	_Комиссии.ДатаОплаты < &КонецПериода
		|	И _Комиссии.ДатаОплаты >= &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	_Комиссии.ДатаСделки,
		|	_Комиссии.Сделка,
		|	_Комиссии.ЦеннаяБумага,
		|	_Комиссии.ДатаИсполнения,
		|	_Комиссии.ВидОперации,
		|	_Комиссии.Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Комиссии.ДатаСделки КАК ДатаСделки,
		|	_Комиссии.Сделка КАК Сделка,
		|	СУММА(_Комиссии.СуммаКомиссии) КАК СуммаКомиссии,
		|	_Комиссии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_Комиссии.ДатаОплаты) КАК ДатаОплаты,
		|	_Комиссии.ДатаИсполнения КАК ДатаИсполнения,
		|	_Комиссии.ВидОперации КАК ВидОперации,
		|	_Комиссии.Рынок КАК Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"") КАК ВидАктива
		|ПОМЕСТИТЬ _НераспределеннаяКомиссияНачало
		|ИЗ
		|	_Комиссии КАК _Комиссии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДокументыАктивовАС КАК _ДокументыАктивовАС
		|		ПО _Комиссии.Сделка = _ДокументыАктивовАС.Сделка
		|ГДЕ
		|	_Комиссии.ДатаСделки < &НачалоПериода
		|	И _Комиссии.ЧастьСделкиРЕПО = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_Комиссии.ДатаСделки,
		|	_Комиссии.Сделка,
		|	_Комиссии.ЦеннаяБумага,
		|	_Комиссии.ДатаИсполнения,
		|	_Комиссии.ВидОперации,
		|	_Комиссии.Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО,
		|	ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Комиссии.ДатаСделки КАК ДатаСделки,
		|	_Комиссии.Сделка КАК Сделка,
		|	СУММА(_Комиссии.СуммаКомиссии) КАК СуммаКомиссии,
		|	_Комиссии.ЦеннаяБумага КАК ЦеннаяБумага,
		|	МАКСИМУМ(_Комиссии.ДатаОплаты) КАК ДатаОплаты,
		|	_Комиссии.ДатаИсполнения КАК ДатаИсполнения,
		|	_Комиссии.ВидОперации КАК ВидОперации,
		|	_Комиссии.Рынок КАК Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"") КАК ВидАктива
		|ПОМЕСТИТЬ _НераспределеннаяКомиссияКонец
		|ИЗ
		|	_Комиссии КАК _Комиссии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДокументыАктивовАС КАК _ДокументыАктивовАС
		|		ПО _Комиссии.Сделка = _ДокументыАктивовАС.Сделка
		|ГДЕ
		|	_Комиссии.ДатаОплаты > &КонецПериода
		|	И _Комиссии.ЧастьСделкиРЕПО = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	_Комиссии.ДатаСделки,
		|	_Комиссии.Сделка,
		|	_Комиссии.ЦеннаяБумага,
		|	_Комиссии.ДатаИсполнения,
		|	_Комиссии.ВидОперации,
		|	_Комиссии.Рынок,
		|	_Комиссии.ЧастьСделкиРЕПО,
		|	ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК Сумма,
		|	20 КАК Группировка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК Аналитика,
		|	&ВалютаРубль КАК Валюта,
		|	СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаВал,
		|	1 КАК Курс,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива
		|ПОМЕСТИТЬ _СЧА_НачалоПредварительно
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И СтоимостьПереоценки.Период = &ДатаСЧАНачало
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА 30
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА 30
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА 20
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 30
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 40
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 20
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА 20
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА 20
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (&ВидыЗадолженностиКомиссии)
		|			ТОГДА 30
		|		ИНАЧЕ 40
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА 330
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА 310
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 320
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Биржи)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеКупона).Облигация
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (&ВидыЗадолженностиКомиссии)
		|			ТОГДА 320
		|		ИНАЧЕ 480
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА &ВалютаРубль
		|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
		|	КОНЕЦ,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынок,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = КурсыВалют.Валюта
		|			И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = КурсыВалют.Период
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНачало
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	-СУММА(ДенежныеСредстваМНООстатки.СуммаОстаток),
		|	40,
		|	410,
		|	&ВалютаРубль,
		|	-СУММА(ДенежныеСредстваМНООстатки.СуммаОстаток),
		|	1,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			КОНЕЦПЕРИОДА(&ДатаСЧАНачало, ДЕНЬ),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваМНООстатки.РасчетныйСчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток,
		|	30,
		|	310,
		|	&ВалютаРубль,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток,
		|	1,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			КОНЕЦПЕРИОДА(&ДатаСЧАНачало, ДЕНЬ),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	-СУММА(_НераспределеннаяКомиссияНачало.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	30,
		|	320,
		|	&ВалютаРубль,
		|	-СУММА(_НераспределеннаяКомиссияНачало.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	1,
		|	_НераспределеннаяКомиссияНачало.ВидАктива
		|ИЗ
		|	_НераспределеннаяКомиссияНачало КАК _НераспределеннаяКомиссияНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияТПлюсВДебиторке КАК _КомиссияТПлюсВДебиторке
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НераспределеннаяКомиссияНачало.ВидАктива
		|
		|ИМЕЮЩИЕ
		|	СУММА(_НераспределеннаяКомиссияНачало.СуммаКомиссии) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	СУММА(_НераспределеннаяКомиссияНачало.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	20,
		|	_НераспределеннаяКомиссияНачало.ЦеннаяБумага,
		|	&ВалютаРубль,
		|	СУММА(_НераспределеннаяКомиссияНачало.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	1,
		|	_НераспределеннаяКомиссияНачало.ВидАктива
		|ИЗ
		|	_НераспределеннаяКомиссияНачало КАК _НераспределеннаяКомиссияНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияТПлюсВДебиторке КАК _КомиссияТПлюсВДебиторке
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НераспределеннаяКомиссияНачало.ЦеннаяБумага,
		|	_НераспределеннаяКомиссияНачало.ВидАктива
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)
		|			ТОГДА 465
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)
		|			ТОГДА 460
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|			ТОГДА 450
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|			ТОГДА 440
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|			ТОГДА 430
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|			ТОГДА 420
		|		ИНАЧЕ 480
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАНачало = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	480,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАНачало = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАНачало,
		|	-ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	470,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	-ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАНачало = КурсыВалют.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧА_НачалоПредварительно.Период КАК Период,
		|	СУММА(_СЧА_НачалоПредварительно.Сумма) КАК Сумма,
		|	_СЧА_НачалоПредварительно.Группировка КАК Группировка,
		|	_СЧА_НачалоПредварительно.Аналитика КАК Аналитика,
		|	_СЧА_НачалоПредварительно.Валюта КАК Валюта,
		|	СУММА(_СЧА_НачалоПредварительно.СуммаВал) КАК СуммаВал,
		|	_СЧА_НачалоПредварительно.Курс КАК Курс,
		|	_СЧА_НачалоПредварительно.ВидАктива КАК ВидАктива,
		|	СУММА(ВЫБОР
		|			КОГДА _СЧА_НачалоПредварительно.Аналитика = 470
		|				ТОГДА 0
		|			ИНАЧЕ _СЧА_НачалоПредварительно.Сумма
		|		КОНЕЦ) КАК СуммаСЧА
		|ПОМЕСТИТЬ _СЧА_Начало
		|ИЗ
		|	_СЧА_НачалоПредварительно КАК _СЧА_НачалоПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА_НачалоПредварительно.Период,
		|	_СЧА_НачалоПредварительно.Группировка,
		|	_СЧА_НачалоПредварительно.Аналитика,
		|	_СЧА_НачалоПредварительно.Валюта,
		|	_СЧА_НачалоПредварительно.Курс,
		|	_СЧА_НачалоПредварительно.ВидАктива
		|
		|ИМЕЮЩИЕ
		|	СУММА(_СЧА_НачалоПредварительно.Сумма) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК Сумма,
		|	10 КАК Группировка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК Аналитика,
		|	&ВалютаРубль КАК Валюта,
		|	СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаВал,
		|	1 КАК Курс,
		|	ВЫБОР
		|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива
		|ПОМЕСТИТЬ _СЧА_КонецПредварительно
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И СтоимостьПереоценки.Период = &ДатаСЧАКонец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА 30
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА 30
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА 10
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 30
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 40
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА 10
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА 10
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА 10
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (&ВидыЗадолженностиКомиссии)
		|			ТОГДА 30
		|		ИНАЧЕ 40
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА 330
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА 310
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 320
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Биржи)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БанковскиеСчета)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = &ВалютаРубль
		|			ТОГДА 410
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.ПогашениеКупона).Облигация
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ВЫРАЗИТЬ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Документ.НачислениеДивидендов).ЦеннаяБумага
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности В (&ВидыЗадолженностиКомиссии)
		|			ТОГДА 320
		|		ИНАЧЕ 480
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (ТИП(Справочник.Акции), ТИП(Справочник.Облигации), ТИП(Справочник.Векселя), ТИП(Справочник.Паи))
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) <> ТИП(Документ.СделкаРЕПО)
		|			ТОГДА &ВалютаРубль
		|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта
		|	КОНЕЦ,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынок,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта = КурсыВалют.Валюта
		|			И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = КурсыВалют.Период
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАКонец
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	-СУММА(ДенежныеСредстваМНООстатки.СуммаОстаток),
		|	40,
		|	410,
		|	&ВалютаРубль,
		|	-СУММА(ДенежныеСредстваМНООстатки.СуммаОстаток),
		|	1,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			КОНЕЦПЕРИОДА(&ДатаСЧАКонец, ДЕНЬ),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваМНООстатки.РасчетныйСчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток,
		|	30,
		|	310,
		|	&ВалютаРубль,
		|	ДенежныеСредстваМНООстатки.СуммаОстаток,
		|	1,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			КОНЕЦПЕРИОДА(&ДатаСЧАКонец, ДЕНЬ),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	-СУММА(_НераспределеннаяКомиссияКонец.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	30,
		|	320,
		|	&ВалютаРубль,
		|	-СУММА(_НераспределеннаяКомиссияКонец.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	1,
		|	_НераспределеннаяКомиссияКонец.ВидАктива
		|ИЗ
		|	_НераспределеннаяКомиссияКонец КАК _НераспределеннаяКомиссияКонец
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияТПлюсВДебиторке КАК _КомиссияТПлюсВДебиторке
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НераспределеннаяКомиссияКонец.ВидАктива
		|
		|ИМЕЮЩИЕ
		|	СУММА(_НераспределеннаяКомиссияКонец.СуммаКомиссии) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	СУММА(_НераспределеннаяКомиссияКонец.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	10,
		|	_НераспределеннаяКомиссияКонец.ЦеннаяБумага,
		|	&ВалютаРубль,
		|	СУММА(_НераспределеннаяКомиссияКонец.СуммаКомиссии * ЕСТЬNULL(_КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке, 0)),
		|	1,
		|	_НераспределеннаяКомиссияКонец.ВидАктива
		|ИЗ
		|	_НераспределеннаяКомиссияКонец КАК _НераспределеннаяКомиссияКонец
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияТПлюсВДебиторке КАК _КомиссияТПлюсВДебиторке
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НераспределеннаяКомиссияКонец.ЦеннаяБумага,
		|	_НераспределеннаяКомиссияКонец.ВидАктива
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)
		|			ТОГДА 465
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)
		|			ТОГДА 460
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|			ТОГДА 450
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|			ТОГДА 440
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|			ТОГДА 430
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|			ТОГДА 420
		|		ИНАЧЕ 480
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАКонец = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	480,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАКонец = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ДатаСЧАКонец,
		|	-ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	40,
		|	470,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	-ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток,
		|	КурсыВалют.Курс,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Валюта = КурсыВалют.Валюта
		|			И (&ДатаСЧАКонец = КурсыВалют.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СЧА_КонецПредварительно.Период КАК Период,
		|	СУММА(_СЧА_КонецПредварительно.Сумма) КАК Сумма,
		|	_СЧА_КонецПредварительно.Группировка КАК Группировка,
		|	_СЧА_КонецПредварительно.Аналитика КАК Аналитика,
		|	_СЧА_КонецПредварительно.Валюта КАК Валюта,
		|	СУММА(_СЧА_КонецПредварительно.СуммаВал) КАК СуммаВал,
		|	_СЧА_КонецПредварительно.Курс КАК Курс,
		|	_СЧА_КонецПредварительно.ВидАктива КАК ВидАктива,
		|	СУММА(ВЫБОР
		|			КОГДА _СЧА_КонецПредварительно.Аналитика = 470
		|				ТОГДА 0
		|			ИНАЧЕ _СЧА_КонецПредварительно.Сумма
		|		КОНЕЦ) КАК СуммаСЧА
		|ПОМЕСТИТЬ _СЧА_Конец
		|ИЗ
		|	_СЧА_КонецПредварительно КАК _СЧА_КонецПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА_КонецПредварительно.Период,
		|	_СЧА_КонецПредварительно.Группировка,
		|	_СЧА_КонецПредварительно.Аналитика,
		|	_СЧА_КонецПредварительно.Валюта,
		|	_СЧА_КонецПредварительно.Курс,
		|	_СЧА_КонецПредварительно.ВидАктива
		|
		|ИМЕЮЩИЕ
		|	СУММА(_СЧА_КонецПредварительно.Сумма) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаДокумент.Ссылка КАК Документ,
		|	СделкаДокумент.Дата КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|			ТОГДА УсловияСделок.ДатаПоставки
		|		ИНАЧЕ УсловияСделок.ДатаОплаты
		|	КОНЕЦ КАК ДатаРасчетов,
		|	СделкаДокумент.ВидСделки КАК ВидОперации,
		|	УсловияСделок.Рынок КАК Рынок,
		|	УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	(УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс КАК Сумма,
		|	0 КАК ЧастьСделкиРЕПО,
		|	УсловияСделок.ВалютаОплаты КАК ВалютаОплаты,
		|	УсловияСделок.Сумма + УсловияСделок.СуммаКупона КАК СуммаВал,
		|	КурсыВалют.Курс КАК Курс
		|ПОМЕСТИТЬ _СделкиПредварительно
		|ИЗ
		|	Документ.Сделка КАК СделкаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО СделкаДокумент.Ссылка = УсловияСделок.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СделкаДокумент.ВалютаОплаты = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|					ТОГДА УсловияСделок.ДатаПоставки
		|				ИНАЧЕ УсловияСделок.ДатаОплаты
		|			КОНЕЦ = КурсыВалют.Период)
		|ГДЕ
		|	СделкаДокумент.Проведен
		|	И СделкаДокумент.Организация = &Организация
		|	И СделкаДокумент.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (СделкаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ ВЫБОР
		|				КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|					ТОГДА УсловияСделок.ДатаПоставки
		|				ИНАЧЕ УсловияСделок.ДатаОплаты
		|			КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОДокумент.Ссылка,
		|	СделкаРЕПОДокумент.Дата,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|			ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|			ТОГДА ВЫБОР
		|					КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""Покупка (РЕПО)""
		|					ИНАЧЕ ""Продажа (РЕПО)""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ""Продажа (РЕПО ч.2)""
		|				ИНАЧЕ ""Покупка (РЕПО ч.2)""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	УсловияСделокРЕПО.Рынок,
		|	УсловияСделокРЕПО.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				И ВЫБОР
		|					КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|						ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|					ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|				КОНЕЦ < &НачалоПериода
		|			ТОГДА 0
		|		ИНАЧЕ (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|	КОНЕЦ,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО,
		|	УсловияСделокРЕПО.ВалютаОплаты,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				И ВЫБОР
		|					КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|						ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|					ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|				КОНЕЦ < &НачалоПериода
		|			ТОГДА 0
		|		ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|	КОНЕЦ,
		|	КурсыВалют.Курс
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО СделкаРЕПОДокумент.Ссылка = УсловияСделокРЕПО.Регистратор
		|			И (СделкаРЕПОДокумент.ЧастьСделкиРЕПО < 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СделкаРЕПОДокумент.ВалютаОплаты = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|					ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|				ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|			КОНЕЦ = КурсыВалют.Период)
		|ГДЕ
		|	СделкаРЕПОДокумент.Проведен
		|	И СделкаРЕПОДокумент.Организация = &Организация
		|	И СделкаРЕПОДокумент.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (СделкаРЕПОДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ ВЫБОР
		|				КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|					ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|				ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|			КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО МЕЖДУ &НачалоПериода И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Документ,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ДатаРасчетов,
		|	ВложенныйЗапрос.ВидОперации,
		|	ВложенныйЗапрос.Рынок,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКД - (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	0,
		|	ВложенныйЗапрос.ВалютаСделки,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКДВал - (УсловияСделок.Сумма + УсловияСделок.СуммаКупона),
		|	КурсыВалют.Курс
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияСделок.Сделка КАК Документ,
		|		УсловияСделок.Период КАК Период,
		|		УсловияСделок.Регистратор КАК Регистратор,
		|		УсловияСделок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|				ТОГДА УсловияСделок.ДатаПоставки
		|			ИНАЧЕ УсловияСделок.ДатаОплаты
		|		КОНЕЦ КАК ДатаРасчетов,
		|		СделкаДокумент.ВидСделки КАК ВидОперации,
		|		УсловияСделок.Рынок КАК Рынок,
		|		УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Цена
		|		КОНЕЦ КАК Цена,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.ЦенаКупона
		|		КОНЕЦ КАК ЦенаКупона,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Количество
		|		КОНЕЦ КАК Количество,
		|		ВЫБОР
		|			КОГДА СделкаДокумент.ВалютаСделки = &ВалютаРубль
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделок.Отменено
		|							ТОГДА 0
		|						ИНАЧЕ (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКД,
		|		0 КАК КоличествоДней,
		|		0 КАК Ставка,
		|		СделкаДокумент.ВалютаСделки КАК ВалютаСделки,
		|		СделкаДокумент.Ссылка КАК Основание,
		|		МАКСИМУМ(УсловияСделокСрез.Период) КАК ПериодПоследнихУсловий,
		|		СделкаДокумент.НомерСделки КАК НомерСделки,
		|		ВЫБОР
		|			КОГДА СделкаДокумент.ВалютаСделки = &ВалютаРубль
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделок.Отменено
		|							ТОГДА 0
		|						ИНАЧЕ (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКДВал,
		|		КурсыВалют.Курс КАК Курс
		|	ИЗ
		|		РегистрСведений.УсловияСделок КАК УсловияСделок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|			ПО (УсловияСделок.Активность)
		|				И УсловияСделок.Сделка = СделкаДокумент.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделокСрез
		|			ПО (УсловияСделокСрез.Активность)
		|				И УсловияСделок.Организация = УсловияСделокСрез.Организация
		|				И УсловияСделок.Сделка = УсловияСделокСрез.Сделка
		|				И УсловияСделок.Рынок = УсловияСделокСрез.Рынок
		|				И УсловияСделок.ЦеннаяБумага = УсловияСделокСрез.ЦеннаяБумага
		|				И УсловияСделок.Период > УсловияСделокСрез.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (СделкаДокумент.ВалютаСделки = КурсыВалют.Валюта)
		|				И (ВЫБОР
		|					КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|						ТОГДА УсловияСделок.ДатаПоставки
		|					ИНАЧЕ УсловияСделок.ДатаОплаты
		|				КОНЕЦ = КурсыВалют.Период)
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(УсловияСделок.Регистратор) <> ТИП(Документ.Сделка)
		|		И (УсловияСделок.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|				ИЛИ ВЫБОР
		|					КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|						ТОГДА УсловияСделок.ДатаПоставки
		|					ИНАЧЕ УсловияСделок.ДатаОплаты
		|				КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода)
		|		И УсловияСделок.Организация = &Организация
		|		И УсловияСделок.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияСделок.Сделка,
		|		УсловияСделок.Период,
		|		УсловияСделок.Регистратор,
		|		УсловияСделок.СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|				ТОГДА УсловияСделок.ДатаПоставки
		|			ИНАЧЕ УсловияСделок.ДатаОплаты
		|		КОНЕЦ,
		|		СделкаДокумент.ВидСделки,
		|		УсловияСделок.Рынок,
		|		УсловияСделок.ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Цена
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.ЦенаКупона
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделок.Количество
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СделкаДокумент.ВалютаСделки = &ВалютаРубль
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделок.Отменено
		|							ТОГДА 0
		|						ИНАЧЕ (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		СделкаДокумент.ВалютаСделки,
		|		СделкаДокумент.Ссылка,
		|		СделкаДокумент.НомерСделки,
		|		КурсыВалют.Курс,
		|		ВЫБОР
		|			КОГДА УсловияСделок.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СделкаДокумент.ВалютаСделки = &ВалютаРубль
		|				ТОГДА ВЫБОР
		|						КОГДА УсловияСделок.Отменено
		|							ТОГДА 0
		|						ИНАЧЕ (УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО (УсловияСделок.Активность)
		|			И ВложенныйЗапрос.ПериодПоследнихУсловий = УсловияСделок.Период
		|			И ВложенныйЗапрос.Основание = УсловияСделок.Сделка
		|			И ВложенныйЗапрос.Рынок = УсловияСделок.Рынок
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ВложенныйЗапрос.ВалютаСделки = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|					ТОГДА УсловияСделок.ДатаПоставки
		|				ИНАЧЕ УсловияСделок.ДатаОплаты
		|			КОНЕЦ = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Документ,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.ДатаРасчетов,
		|	ВложенныйЗапрос.ВидОперации,
		|	ВложенныйЗапрос.Рынок,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКД - (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО,
		|	ВложенныйЗапрос.ВалютаСделки,
		|	ВложенныйЗапрос.СуммаСделкиСУчетомНКДВал - (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона),
		|	КурсыВалют.Курс
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияСделокРЕПО.СделкаРЕПО КАК Документ,
		|		УсловияСделокРЕПО.Период КАК Период,
		|		УсловияСделокРЕПО.Регистратор КАК Регистратор,
		|		УсловияСделокРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|		КОНЕЦ КАК ДатаРасчетов,
		|		ВЫБОР
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Покупка (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Продажа (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Продажа (РЕПО ч.2)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Покупка (РЕПО ч.2)""
		|		КОНЕЦ КАК ВидОперации,
		|		УсловияСделокРЕПО.Рынок КАК Рынок,
		|		УсловияСделокРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Цена
		|		КОНЕЦ КАК Цена,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.ЦенаКупона
		|		КОНЕЦ КАК ЦенаКупона,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Количество
		|		КОНЕЦ КАК Количество,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКД,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО
		|		КОНЕЦ КАК ДатаВторойЧастиРЕПО,
		|		УсловияСделокРЕПО.СтавкаРЕПО КАК Ставка,
		|		СделкаРЕПОДокумент.ВалютаСделки КАК ВалютаСделки,
		|		СделкаРЕПОДокумент.Ссылка КАК Основание,
		|		МАКСИМУМ(УсловияСделокРЕПОСрез.Период) КАК ПериодПоследнихУсловий,
		|		УсловияСделокРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|		СделкаРЕПОДокумент.НомерСделки КАК НомерСделки,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|		КОНЕЦ КАК СуммаСделкиСУчетомНКДВал,
		|		КурсыВалют.Курс КАК Курс
		|	ИЗ
		|		РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|			ПО (УсловияСделокРЕПО.Активность)
		|				И УсловияСделокРЕПО.СделкаРЕПО = СделкаРЕПОДокумент.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПОСрез
		|			ПО (УсловияСделокРЕПОСрез.Активность)
		|				И УсловияСделокРЕПО.Организация = УсловияСделокРЕПОСрез.Организация
		|				И УсловияСделокРЕПО.СделкаРЕПО = УсловияСделокРЕПОСрез.СделкаРЕПО
		|				И УсловияСделокРЕПО.Рынок = УсловияСделокРЕПОСрез.Рынок
		|				И УсловияСделокРЕПО.ЦеннаяБумага = УсловияСделокРЕПОСрез.ЦеннаяБумага
		|				И УсловияСделокРЕПО.ЧастьСделкиРЕПО = УсловияСделокРЕПОСрез.ЧастьСделкиРЕПО
		|				И УсловияСделокРЕПО.Период > УсловияСделокРЕПОСрез.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (СделкаРЕПОДокумент.ВалютаСделки = КурсыВалют.Валюта)
		|				И (ВЫБОР
		|					КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|						ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|					ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|				КОНЕЦ = КурсыВалют.Период)
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(УсловияСделокРЕПО.Регистратор) <> ТИП(Документ.СделкаРЕПО)
		|		И УсловияСделокРЕПО.Организация = &Организация
		|		И УсловияСделокРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И (УсловияСделокРЕПО.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|				ИЛИ ВЫБОР
		|					КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|						ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|					ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|				КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияСделокРЕПО.СделкаРЕПО,
		|		УсловияСделокРЕПО.Период,
		|		УсловияСделокРЕПО.Регистратор,
		|		УсловияСделокРЕПО.СчетДоверительногоУправления,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|		КОНЕЦ,
		|		УсловияСделокРЕПО.Рынок,
		|		УсловияСделокРЕПО.ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Цена
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.ЦенаКупона
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Количество
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|		КОНЕЦ,
		|		УсловияСделокРЕПО.СтавкаРЕПО,
		|		СделкаРЕПОДокумент.ВалютаСделки,
		|		СделкаРЕПОДокумент.Ссылка,
		|		УсловияСделокРЕПО.ЧастьСделкиРЕПО,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.ДатаВторойЧастиРЕПО = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|			ИНАЧЕ УсловияСделокРЕПО.ДатаВторойЧастиРЕПО
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Покупка (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|				ТОГДА ""Продажа (РЕПО)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Продажа (РЕПО ч.2)""
		|			КОГДА СделкаРЕПОДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|				ТОГДА ""Покупка (РЕПО ч.2)""
		|		КОНЕЦ,
		|		СделкаРЕПОДокумент.НомерСделки,
		|		ВЫБОР
		|			КОГДА УсловияСделокРЕПО.Отменено
		|				ТОГДА 0
		|			ИНАЧЕ (УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс
		|		КОНЕЦ,
		|		КурсыВалют.Курс) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО (УсловияСделокРЕПО.Активность)
		|			И ВложенныйЗапрос.ПериодПоследнихУсловий = УсловияСделокРЕПО.Период
		|			И ВложенныйЗапрос.Основание = УсловияСделокРЕПО.СделкаРЕПО
		|			И ВложенныйЗапрос.Рынок = УсловияСделокРЕПО.Рынок
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделокРЕПО.ЦеннаяБумага
		|			И ВложенныйЗапрос.ЧастьСделкиРЕПО = УсловияСделокРЕПО.ЧастьСделкиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ВложенныйЗапрос.ВалютаСделки = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА УсловияСделокРЕПО.ДатаПоставки > УсловияСделокРЕПО.ДатаОплаты
		|					ТОГДА УсловияСделокРЕПО.ДатаПоставки
		|				ИНАЧЕ УсловияСделокРЕПО.ДатаОплаты
		|			КОНЕЦ = КурсыВалют.Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаСВалютойДокумент.Ссылка,
		|	СделкаСВалютойДокумент.Дата,
		|	УсловияСделокСВалютой.ДатаИсполнения,
		|	СделкаСВалютойДокумент.ВидСделки,
		|	""Валюта"",
		|	УсловияСделокСВалютой.Валюта,
		|	ВЫБОР
		|		КОГДА УсловияСделокСВалютой.Контрвалюта = &ВалютаРубль
		|			ТОГДА УсловияСделокСВалютой.СуммаКонтрвалюты
		|		ИНАЧЕ УсловияСделокСВалютой.Сумма / КурсыВалют.Кратность * КурсыВалют.Курс
		|	КОНЕЦ,
		|	0,
		|	УсловияСделокСВалютой.Валюта,
		|	УсловияСделокСВалютой.Сумма,
		|	УсловияСделокСВалютой.Курс
		|ИЗ
		|	Документ.СделкаСВалютой КАК СделкаСВалютойДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСВалютой КАК УсловияСделокСВалютой
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО УсловияСделокСВалютой.Валюта = КурсыВалют.Валюта
		|				И УсловияСделокСВалютой.ДатаИсполнения = КурсыВалют.Период
		|		ПО СделкаСВалютойДокумент.Ссылка = УсловияСделокСВалютой.Регистратор
		|ГДЕ
		|	СделкаСВалютойДокумент.Проведен
		|	И СделкаСВалютойДокумент.Организация = &Организация
		|	И СделкаСВалютойДокумент.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаСВалютойДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаДокумент.Ссылка,
		|	СделкаДокумент.Дата,
		|	ВЫБОР
		|		КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|			ТОГДА УсловияСделок.ДатаПоставки
		|		ИНАЧЕ УсловияСделок.ДатаОплаты
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
		|	""Валюта"",
		|	УсловияСделок.ВалютаОплаты,
		|	(УсловияСделок.Сумма + УсловияСделок.СуммаКупона) / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	0,
		|	УсловияСделок.ВалютаОплаты,
		|	УсловияСделок.Сумма + УсловияСделок.СуммаКупона,
		|	КурсыВалют.Курс
		|ИЗ
		|	Документ.Сделка КАК СделкаДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО СделкаДокумент.Ссылка = УсловияСделок.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СделкаДокумент.ВалютаОплаты = КурсыВалют.Валюта
		|			И (ВЫБОР
		|				КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|					ТОГДА УсловияСделок.ДатаПоставки
		|				ИНАЧЕ УсловияСделок.ДатаОплаты
		|			КОНЕЦ = КурсыВалют.Период)
		|ГДЕ
		|	СделкаДокумент.Проведен
		|	И СделкаДокумент.Организация = &Организация
		|	И СделкаДокумент.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И (СделкаДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИЛИ ВЫБОР
		|				КОГДА УсловияСделок.ДатаПоставки > УсловияСделок.ДатаОплаты
		|					ТОГДА УсловияСделок.ДатаПоставки
		|				ИНАЧЕ УсловияСделок.ДатаОплаты
		|			КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода)
		|	И УсловияСделок.ВалютаОплаты <> &ВалютаРубль
		|	И СделкаДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаОснования.Основание,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка),
		|	""Валюта"",
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	СУММА(ВЫБОР
		|			КОГДА ОплатаОснования.Ссылка.ВалютаОплаты = &ВалютаРубль
		|				ТОГДА ОплатаОснования.СуммаОплатыКупона
		|			ИНАЧЕ ОперацииСЦеннымиБумагами.СуммаКупона * КурсыВалют.Курс / КурсыВалют.Кратность
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ / ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ),
		|	0,
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	СУММА(ОплатаОснования.СуммаОплатыКупона * ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ / ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ),
		|	КурсыВалют.Курс
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ОплатаОснования.Ссылка.ВалютаОплаты = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ОплатаОснования.Основание
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)))
		|			И (ОплатаОснования.Ссылка.Проведен)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ > 0
		|	И ОплатаОснования.Ссылка.ВалютаОплаты <> &ВалютаРубль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание,
		|	ОплатаОснования.Ссылка.ВалютаОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СделкиПредварительно.ДатаОперации КАК ДатаОперации,
		|	_СделкиПредварительно.ДатаРасчетов КАК ДатаРасчетов,
		|	ЕСТЬNULL(_Комиссии.ДатаОплаты, НАЧАЛОПЕРИОДА(_СделкиПредварительно.ДатаОперации, ДЕНЬ)) КАК ДатаОплатыКомиссии,
		|	_СделкиПредварительно.ВидОперации КАК ВидОперации,
		|	_СделкиПредварительно.Рынок КАК Рынок,
		|	_СделкиПредварительно.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СделкиПредварительно.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	ВЫБОР
		|		КОГДА _СделкиПредварительно.ДатаРасчетов > &КонецПериода
		|				И _СделкиПредварительно.ЧастьСделкиРЕПО = 0
		|			ТОГДА 0
		|		ИНАЧЕ _СделкиПредварительно.Сумма
		|	КОНЕЦ + ВЫБОР
		|		КОГДА _СделкиПредварительно.Рынок = ""Валюта""
		|				И ТИПЗНАЧЕНИЯ(_СделкиПредварительно.Документ) <> ТИП(Документ.СделкаСВалютой)
		|			ТОГДА 0
		|		КОГДА _СделкиПредварительно.ЧастьСделкиРЕПО = 2
		|			ТОГДА 0
		|		КОГДА _СделкиПредварительно.ЧастьСделкиРЕПО = 1
		|			ТОГДА ВЫБОР
		|					КОГДА _СделкиПредварительно.ВидОперации = ""Покупка (РЕПО)""
		|						ТОГДА ЕСТЬNULL(_Комиссии.СуммаКомиссии, 0)
		|					ИНАЧЕ -ЕСТЬNULL(_Комиссии.СуммаКомиссии, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _СделкиПредварительно.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ЕСТЬNULL(_Комиссии.СуммаКомиссии, 0)
		|				КОГДА _СделкиПредварительно.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					ТОГДА -ЕСТЬNULL(_Комиссии.СуммаКомиссии, 0)
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	_СделкиПредварительно.ВалютаОплаты КАК ВалютаОплаты,
		|	ВЫБОР
		|		КОГДА _СделкиПредварительно.ДатаРасчетов > &КонецПериода
		|				И _СделкиПредварительно.ЧастьСделкиРЕПО = 0
		|			ТОГДА 0
		|		ИНАЧЕ _СделкиПредварительно.СуммаВал
		|	КОНЕЦ КАК СуммаВал,
		|	_СделкиПредварительно.Курс КАК Курс,
		|	_СделкиПредварительно.Документ КАК Документ,
		|	ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"") КАК ВидАктива
		|ПОМЕСТИТЬ _СделкиДокументы
		|ИЗ
		|	_СделкиПредварительно КАК _СделкиПредварительно
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияОплаченная КАК _Комиссии
		|		ПО _СделкиПредварительно.Документ = _Комиссии.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДокументыАктивовАС КАК _ДокументыАктивовАС
		|		ПО _СделкиПредварительно.Документ = _ДокументыАктивовАС.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Период, ДЕНЬ) КАК Период,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета + БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета + БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета + БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение + БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона + БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам + БухПартииЦенныхБумаг.ИндексацияНоминала КАК Сумма,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.Партия, БухПартииЦенныхБумаг.Партия) КАК Партия,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СтрокаПартии, БухПартииЦенныхБумаг.СтрокаПартии) КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
		|	БухПартииЦенныхБумаг.Рынок КАК Рынок,
		|	БухПартииЦенныхБумаг.Количество КАК Количество
		|ПОМЕСТИТЬ _РеклассПриход
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО БухПартииЦенныхБумаг.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И БухПартииЦенныхБумаг.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|ГДЕ
		|	БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.РеклассификацияАктивовЕПС
		|	И БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Период, ДЕНЬ) КАК Период,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета + БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета + БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета + БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение + БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона + БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам + БухПартииЦенныхБумаг.ИндексацияНоминала КАК Сумма,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.Партия, БухПартииЦенныхБумаг.Партия) КАК Партия,
		|	ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.СтрокаПартии, БухПартииЦенныхБумаг.СтрокаПартии) КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
		|	БухПартииЦенныхБумаг.Рынок КАК Рынок,
		|	БухПартииЦенныхБумаг.Количество КАК Количество
		|ПОМЕСТИТЬ _РеклассРасход
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО БухПартииЦенныхБумаг.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И БухПартииЦенныхБумаг.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|ГДЕ
		|	БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.РеклассификацияАктивовЕПС
		|	И БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_РеклассПриход.Период КАК Период,
		|	_РеклассПриход.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_РеклассРасход.ВидАктива КАК ВидАктиваРасход,
		|	_РеклассПриход.ВидАктива КАК ВидАктиваПриход,
		|	СУММА(_РеклассРасход.Сумма) КАК СуммаРасход,
		|	СУММА(_РеклассПриход.Сумма) КАК СуммаПриход,
		|	СУММА(_РеклассРасход.Количество) КАК КоличествоРасход,
		|	СУММА(_РеклассПриход.Количество) КАК КоличествоПриход,
		|	_РеклассПриход.Регистратор КАК Регистратор,
		|	_РеклассПриход.Рынок КАК Рынок
		|ПОМЕСТИТЬ _Рекласс
		|ИЗ
		|	_РеклассРасход КАК _РеклассРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеклассПриход КАК _РеклассПриход
		|		ПО (_РеклассПриход.Регистратор = _РеклассРасход.Регистратор)
		|			И _РеклассРасход.ЦеннаяБумага = _РеклассПриход.ЦеннаяБумага
		|			И _РеклассРасход.Партия = _РеклассПриход.Партия
		|			И _РеклассРасход.СтрокаПартии = _РеклассПриход.СтрокаПартии
		|ГДЕ
		|	_РеклассПриход.ВидАктива <> _РеклассРасход.ВидАктива
		|
		|СГРУППИРОВАТЬ ПО
		|	_РеклассПриход.Период,
		|	_РеклассПриход.Регистратор,
		|	_РеклассПриход.ЦеннаяБумага,
		|	_РеклассПриход.ВидАктива,
		|	_РеклассРасход.ВидАктива,
		|	_РеклассПриход.Рынок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период КАК Период,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА -ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|	КОНЕЦ КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиБумагРЕПО
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|ГДЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК Дата,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки КАК ДатаРасчетов,
		|	""Ввод ЦБ"" КАК ВидОперации,
		|	ОперацииСЦеннымиБумагами.Рынок КАК Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА((ВводЦенныхБумагЦенныеБумаги.СуммаРынок + ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок) * КурсыВалют.Курс / КурсыВалют.Кратность) КАК Сумма,
		|	&ВалютаРубль КАК Валюта,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.СуммаРынок + ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок) КАК СуммаВал,
		|	КурсыВалют.Курс КАК Курс,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Документ,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка КАК Основание,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ КАК ВидАктива
		|ПОМЕСТИТЬ _ЦенныеБумагиДокументыПредварительно
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ОперацииСЦеннымиБумагами.Валюта = КурсыВалют.Валюта
		|			И ОперацииСЦеннымиБумагами.ДатаПоставки = КурсыВалют.Период
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Валюта,
		|	КурсыВалют.Курс,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ,
		|	ВводЦенныхБумагЦенныеБумаги.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки,
		|	""Вывод ЦБ"",
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.СуммаРынок + ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок),
		|	&ВалютаРубль,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.СуммаРынок + ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок),
		|	1,
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка,
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка,
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.Количество),
		|	ВЫБОР
		|		КОГДА ВыводЦенныхБумагЦенныеБумаги.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ВыводЦенныхБумагЦенныеБумаги.Ссылка
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = ВыводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.СтрокаПартии = ВыводЦенныхБумагЦенныеБумаги.НомерСтроки
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.ДатаПоставки,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка,
		|	ОперацииСЦеннымиБумагами.Основание,
		|	ВЫБОР
		|		КОГДА ВыводЦенныхБумагЦенныеБумаги.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
		|			ТОГДА ""АС""
		|		ИНАЧЕ ""СС""
		|	КОНЕЦ,
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	""Погашение купона"",
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ОплатаОснования.Ссылка.ВалютаОплаты = &ВалютаРубль
		|				ТОГДА ОплатаОснования.СуммаОплатыКупона
		|			ИНАЧЕ ОперацииСЦеннымиБумагами.СуммаКупона * КурсыВалют.Курс / КурсыВалют.Кратность
		|		КОНЕЦ * (ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ + ЕСТЬNULL(_ОстаткиБумагРЕПО.КоличествоОстаток, 0)) / ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ),
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	СУММА(ОплатаОснования.СуммаОплатыКупона * (ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ + ЕСТЬNULL(_ОстаткиБумагРЕПО.КоличествоОстаток, 0)) / ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ),
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание,
		|	СУММА(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ + ЕСТЬNULL(_ОстаткиБумагРЕПО.КоличествоОстаток, 0)),
		|	NULL
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ОплатаОснования.Ссылка.ВалютаОплаты = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ОплатаОснования.Основание
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)))
		|			И (ОплатаОснования.Ссылка.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиБумагРЕПО КАК _ОстаткиБумагРЕПО
		|		ПО (ОплатаОснования.Основание.ДатаФиксации = _ОстаткиБумагРЕПО.Период)
		|			И ОперацииСЦеннымиБумагами.ЦеннаяБумага = _ОстаткиБумагРЕПО.ЦеннаяБумага
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеКупона)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеКупона).Количество
		|			КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|				ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|		КОНЕЦ + ЕСТЬNULL(_ОстаткиБумагРЕПО.КоличествоОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВидПогашения,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ОплатаОснования.Ссылка.ВалютаОплаты = &ВалютаРубль
		|				ТОГДА ОплатаОснования.СуммаОплаты
		|			ИНАЧЕ ОперацииСЦеннымиБумагами.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность
		|		КОНЕЦ),
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	СУММА(ОплатаОснования.СуммаОплаты),
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание,
		|	ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество,
		|	NULL
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ОплатаОснования.Ссылка.ВалютаОплаты = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ОплатаОснования.Основание
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
		|			И (ОплатаОснования.Ссылка.Проведен)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Регистратор КАК Документ.ПогашениеЦеннойБумаги).ВидПогашения,
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ),
		|	""Начисление дивидендов"",
		|	ОперацииСЦеннымиБумагами.Рынок,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ОплатаОснования.Ссылка.ВалютаОплаты = &ВалютаРубль
		|			ТОГДА ОплатаОснования.СуммаОплаты
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность
		|	КОНЕЦ,
		|	ОплатаОснования.Ссылка.ВалютаОплаты,
		|	ОплатаОснования.СуммаОплаты,
		|	КурсыВалют.Курс,
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание,
		|	ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеДивидендов).Количество,
		|	NULL
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|		ПО ОперацииСЦеннымиБумагами.Регистратор = ОплатаОснования.Основание
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовПаи), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (ОплатаОснования.Ссылка.ВалютаОплаты = КурсыВалют.Валюта)
		|			И (НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|			И (ОплатаОснования.Ссылка.Проведен)
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.Дата, ДЕНЬ) МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.НачислениеДивидендов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Рекласс.Период,
		|	_Рекласс.Период,
		|	""Вывод ЦБ"",
		|	_Рекласс.Рынок,
		|	_Рекласс.ЦеннаяБумага,
		|	_Рекласс.СуммаРасход,
		|	&ВалютаРубль,
		|	_Рекласс.СуммаРасход,
		|	1,
		|	_Рекласс.Регистратор,
		|	_Рекласс.Регистратор,
		|	_Рекласс.КоличествоРасход,
		|	_Рекласс.ВидАктиваРасход
		|ИЗ
		|	_Рекласс КАК _Рекласс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Рекласс.Период,
		|	_Рекласс.Период,
		|	""Ввод ЦБ"",
		|	_Рекласс.Рынок,
		|	_Рекласс.ЦеннаяБумага,
		|	_Рекласс.СуммаПриход,
		|	&ВалютаРубль,
		|	_Рекласс.СуммаПриход,
		|	1,
		|	_Рекласс.Регистратор,
		|	_Рекласс.Регистратор,
		|	_Рекласс.КоличествоПриход,
		|	_Рекласс.ВидАктиваПриход
		|ИЗ
		|	_Рекласс КАК _Рекласс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумагиДокументы.Дата КАК Дата,
		|	_ЦенныеБумагиДокументы.ДатаРасчетов КАК ДатаРасчетов,
		|	_ЦенныеБумагиДокументы.ВидОперации КАК ВидОперации,
		|	_ЦенныеБумагиДокументы.Рынок КАК Рынок,
		|	_ЦенныеБумагиДокументы.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ДокументыАктивовАС.Остаток ЕСТЬ NULL
		|				ИЛИ _ДокументыАктивовАС.Остаток = 0
		|			ТОГДА _ЦенныеБумагиДокументы.Сумма
		|		ИНАЧЕ _ЦенныеБумагиДокументы.Сумма * _ДокументыАктивовАС.Остаток / _ЦенныеБумагиДокументы.Количество
		|	КОНЕЦ КАК Сумма,
		|	_ЦенныеБумагиДокументы.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА _ДокументыАктивовАС.Остаток ЕСТЬ NULL
		|				ИЛИ _ДокументыАктивовАС.Остаток = 0
		|			ТОГДА _ЦенныеБумагиДокументы.СуммаВал
		|		ИНАЧЕ _ЦенныеБумагиДокументы.СуммаВал * _ДокументыАктивовАС.Остаток / _ЦенныеБумагиДокументы.Количество
		|	КОНЕЦ КАК СуммаВал,
		|	_ЦенныеБумагиДокументы.Курс КАК Курс,
		|	_ЦенныеБумагиДокументы.Документ КАК Документ,
		|	ЕСТЬNULL(_ЦенныеБумагиДокументы.ВидАктива, ЕСТЬNULL(_ДокументыАктивовАС.ВидАктива, ""СС"")) КАК ВидАктива
		|ПОМЕСТИТЬ _ЦенныеБумагиДокументы
		|ИЗ
		|	_ЦенныеБумагиДокументыПредварительно КАК _ЦенныеБумагиДокументы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДокументыАктивовАС КАК _ДокументыАктивовАС
		|		ПО _ЦенныеБумагиДокументы.Основание = _ДокументыАктивовАС.Сделка
		|ГДЕ
		|	_ЦенныеБумагиДокументы.Документ ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.Период КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе)
		|			ТОГДА ""Размещение""
		|		КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ЗакрытиеДепозитногоВклада)
		|			ТОГДА ""Закрытие""
		|		КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу)
		|			ТОГДА ""Приход процентов""
		|	КОНЕЦ КАК ВидОперации,
		|	ОстаткиДенежныхСредств.Сумма / КурсыВалют.Кратность * КурсыВалют.Курс КАК Сумма,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.РазмещениеКредитногоИнструмента)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|	КОНЕЦ КАК ДепозитныйВклад,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредств.Сумма КАК СуммаВал,
		|	КурсыВалют.Курс КАК Курс,
		|	ОстаткиДенежныхСредств.Регистратор КАК Документ
		|ПОМЕСТИТЬ _ДепозитныеВкладыДокументы
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ОстаткиДенежныхСредств.Валюта = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ЗакрытиеДепозитногоВклада), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу))
		|	И ОстаткиДенежныхСредств.Активность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВводыВыводыАктивовВВалютеУчета.Период,
		|	""Ввод депозита"",
		|	ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость,
		|	ВводКредитногоИнструмента.КредитныйИнструмент,
		|	&ВалютаРубль,
		|	ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость,
		|	1,
		|	ВводыВыводыАктивовВВалютеУчета.Регистратор
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводКредитногоИнструмента КАК ВводКредитногоИнструмента
		|		ПО ВводыВыводыАктивовВВалютеУчета.Регистратор = ВводКредитногоИнструмента.Ссылка
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВводыВыводыАктивовВВалютеУчета.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|	И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	И ВводыВыводыАктивовВВалютеУчета.Активность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВводыВыводыАктивовВВалютеУчета.Период,
		|	""Вывод депозита"",
		|	ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость,
		|	ВыводКредитногоИнструмента.КредитныйИнструмент,
		|	&ВалютаРубль,
		|	ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость,
		|	1,
		|	ВводыВыводыАктивовВВалютеУчета.Регистратор
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводКредитногоИнструмента КАК ВыводКредитногоИнструмента
		|		ПО ВводыВыводыАктивовВВалютеУчета.Регистратор = ВыводКредитногоИнструмента.Ссылка
		|ГДЕ
		|	ВводыВыводыАктивовВВалютеУчета.Организация = &Организация
		|	И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВводыВыводыАктивовВВалютеУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВводыВыводыАктивовВВалютеУчета.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|	И ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	И ВводыВыводыАктивовВВалютеУчета.Активность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.Период,
		|	""Размещение"",
		|	ОстаткиДенежныхСредств.Сумма,
		|	NULL,
		|	&ВалютаРубль,
		|	ОстаткиДенежныхСредств.Сумма,
		|	1,
		|	ОстаткиДенежныхСредств.Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В ИЕРАРХИИ(&ВидыЗадолженностиКомиссии)
		|	И ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.Период КАК Дата,
		|	""Приход процентов"" КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.ПриходПроцентовМНО)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ПриходПроцентовМНО).МНО
		|	КОНЕЦ КАК МНО,
		|	ОстаткиДенежныхСредств.Сумма / КурсыВалют.Кратность * КурсыВалют.Курс КАК Сумма,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредств.Сумма КАК СуммаВал,
		|	КурсыВалют.Курс КАК Курс,
		|	ОстаткиДенежныхСредств.Регистратор КАК Документ
		|ПОМЕСТИТЬ _МНОДокументы
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ОстаткиДенежныхСредств.Валюта = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовМНО))
		|	И ОстаткиДенежныхСредств.Активность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваМНООбороты.Период,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаПриход <> 0
		|			ТОГДА ""Размещение""
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаРасход <> 0
		|			ТОГДА ""Закрытие""
		|	КОНЕЦ,
		|	ДенежныеСредстваМНООбороты.МНО,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаПриход <> 0
		|			ТОГДА ДенежныеСредстваМНООбороты.СуммаПриход
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаРасход <> 0
		|			ТОГДА ДенежныеСредстваМНООбороты.СуммаРасход
		|	КОНЕЦ,
		|	&ВалютаРубль,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаПриход <> 0
		|			ТОГДА ДенежныеСредстваМНООбороты.СуммаПриход
		|		КОГДА ДенежныеСредстваМНООбороты.СуммаРасход <> 0
		|			ТОГДА ДенежныеСредстваМНООбороты.СуммаРасход
		|	КОНЕЦ,
		|	1,
		|	ДенежныеСредстваМНООбороты.МНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООбороты
		|ГДЕ
		|	(ДенежныеСредстваМНООбороты.СуммаПриход <> 0
		|			ИЛИ ДенежныеСредстваМНООбороты.СуммаРасход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиДокументы.ДатаОперации КАК ДатаОперации,
		|	_СделкиДокументы.ДатаРасчетов КАК ДатаРасчетов,
		|	_СделкиДокументы.ВидОперации КАК ВидОперации,
		|	_СделкиДокументы.Рынок КАК Рынок,
		|	_СделкиДокументы.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СделкиДокументы.Сумма КАК Сумма,
		|	_СделкиДокументы.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_СделкиДокументы.ВалютаОплаты КАК Валюта,
		|	_СделкиДокументы.СуммаВал КАК СуммаВал,
		|	_СделкиДокументы.Курс КАК Курс,
		|	_СделкиДокументы.Документ КАК Документ,
		|	_СделкиДокументы.ВидАктива КАК ВидАктива
		|ПОМЕСТИТЬ _Объединение
		|ИЗ
		|	_СделкиДокументы КАК _СделкиДокументы
		|ГДЕ
		|	(_СделкиДокументы.ДатаРасчетов <= &КонецПериода
		|			ИЛИ _СделкиДокументы.ДатаОплатыКомиссии < &КонецПериода
		|				И _СделкиДокументы.ЧастьСделкиРЕПО = 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЦенныеБумагиДокументы.Дата,
		|	_ЦенныеБумагиДокументы.ДатаРасчетов,
		|	_ЦенныеБумагиДокументы.ВидОперации,
		|	_ЦенныеБумагиДокументы.Рынок,
		|	_ЦенныеБумагиДокументы.ЦеннаяБумага,
		|	_ЦенныеБумагиДокументы.Сумма,
		|	0,
		|	_ЦенныеБумагиДокументы.Валюта,
		|	_ЦенныеБумагиДокументы.СуммаВал,
		|	_ЦенныеБумагиДокументы.Курс,
		|	_ЦенныеБумагиДокументы.Документ,
		|	_ЦенныеБумагиДокументы.ВидАктива
		|ИЗ
		|	_ЦенныеБумагиДокументы КАК _ЦенныеБумагиДокументы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДепозитныеВкладыДокументы.ДатаОперации,
		|	НАЧАЛОПЕРИОДА(_ДепозитныеВкладыДокументы.ДатаОперации, ДЕНЬ),
		|	_ДепозитныеВкладыДокументы.ВидОперации,
		|	""Депозитный вклад"",
		|	_ДепозитныеВкладыДокументы.ДепозитныйВклад,
		|	_ДепозитныеВкладыДокументы.Сумма,
		|	0,
		|	_ДепозитныеВкладыДокументы.Валюта,
		|	_ДепозитныеВкладыДокументы.СуммаВал,
		|	_ДепозитныеВкладыДокументы.Курс,
		|	_ДепозитныеВкладыДокументы.Документ,
		|	""СС""
		|ИЗ
		|	_ДепозитныеВкладыДокументы КАК _ДепозитныеВкладыДокументы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_МНОДокументы.Дата,
		|	НАЧАЛОПЕРИОДА(_МНОДокументы.Дата, ДЕНЬ),
		|	_МНОДокументы.ВидОперации,
		|	""МНО"",
		|	_МНОДокументы.МНО,
		|	_МНОДокументы.Сумма,
		|	0,
		|	_МНОДокументы.Валюта,
		|	_МНОДокументы.СуммаВал,
		|	_МНОДокументы.Курс,
		|	_МНОДокументы.Документ,
		|	""СС""
		|ИЗ
		|	_МНОДокументы КАК _МНОДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДоходыРасходыШаблон.Группировка КАК Группировка,
		|	_ДоходыРасходыШаблон.Аналитика КАК Аналитика,
		|	&ВалютаРубль КАК Валюта,
		|	СУММА(ЕСТЬNULL(ДвиженияРасходы.СуммаОборот, 0)) КАК Сумма
		|ПОМЕСТИТЬ _ДоходыРасходыКомисии
		|ИЗ
		|	_ДоходыРасходыШаблон КАК _ДоходыРасходыШаблон
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
		|					ТОГДА 470
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)
		|					ТОГДА 465
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)
		|					ТОГДА 460
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|					ТОГДА 450
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|					ТОГДА 440
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|					ТОГДА 430
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|					ТОГДА 420
		|				ИНАЧЕ 480
		|			КОНЕЦ КАК Аналитика,
		|			ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			КОНЕЦ КАК СуммаОборот
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|					&НачалоПериода,
		|					&КонецПериода,
		|					Регистратор,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности, ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ГДЕ
		|			ЗадолженностиПоДенежнымСредствамОбороты.Основание.Дата > &НачалоПериода
		|			И ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Регистратор) <> ТИП(Документ.Оплата)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
		|					ТОГДА 470
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)
		|					ТОГДА 465
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)
		|					ТОГДА 460
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария)
		|					ТОГДА 450
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|					ТОГДА 440
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария)
		|					ТОГДА 430
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.БанковскаяКомиссия))
		|					ТОГДА 420
		|				ИНАЧЕ 480
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					ТОГДА -ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход
		|				ИНАЧЕ ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход
		|			КОНЕЦ
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|					&НачалоПериода,
		|					&КонецПериода,
		|					Регистратор,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ВидЗадолженности В ИЕРАРХИИ (&ВидыЗадолженности, ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ГДЕ
		|			ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.Оплата)
		|			И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.Оплата).Аванс
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			480,
		|			ВЫБОР
		|				КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|				ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			КОНЕЦ
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|					&НачалоПериода,
		|					&КонецПериода,
		|					,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.НачислениеЗадолженности)
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ГДЕ
		|			ЗадолженностиПоДенежнымСредствамОбороты.Основание.Дата > &НачалоПериода
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			480,
		|			РезервыПредстоящихРасходовОбороты.СуммаОборот
		|		ИЗ
		|			РегистрНакопления.РезервыПредстоящихРасходов.Обороты(
		|					&НачалоПериода,
		|					&КонецПериода,
		|					Регистратор,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТИПЗНАЧЕНИЯ(СубъектАналитики) В (ЗНАЧЕНИЕ(Справочник.БанковскиеСчета), ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании), ЗНАЧЕНИЕ(Справочник.Биржи))) КАК РезервыПредстоящихРасходовОбороты) КАК ДвиженияРасходы
		|		ПО _ДоходыРасходыШаблон.Аналитика = ДвиженияРасходы.Аналитика
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДоходыРасходыШаблон.Группировка,
		|	_ДоходыРасходыШаблон.Аналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СЧАКонец.ВидАктива, СЧАНачало.ВидАктива) КАК ВидАктива,
		|	ЕСТЬNULL(СЧАКонец.Группировка, СЧАНачало.Группировка) КАК Группировка,
		|	ЕСТЬNULL(СЧАНачало.Аналитика, СЧАКонец.Аналитика) КАК Аналитика,
		|	СУММА(ЕСТЬNULL(СЧАНачало.Сумма, 0)) КАК СуммаНачала,
		|	СУММА(ЕСТЬNULL(СЧАКонец.Сумма, 0)) КАК СуммаКонец,
		|	ЕСТЬNULL(СЧАКонец.Валюта, СЧАНачало.Валюта) КАК Валюта,
		|	СУММА(ЕСТЬNULL(СЧАНачало.СуммаСЧА, 0)) КАК СуммаСЧАНачала,
		|	СУММА(ЕСТЬNULL(СЧАКонец.СуммаСЧА, 0)) КАК СуммаСЧАКонец
		|ПОМЕСТИТЬ _НачалоКонец
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СЧА_Конец.ВидАктива КАК ВидАктива,
		|		_СЧА_Конец.Группировка КАК Группировка,
		|		_СЧА_Конец.Аналитика КАК Аналитика,
		|		СУММА(_СЧА_Конец.Сумма) КАК Сумма,
		|		_СЧА_Конец.Валюта КАК Валюта,
		|		СУММА(_СЧА_Конец.СуммаСЧА) КАК СуммаСЧА
		|	ИЗ
		|		_СЧА_Конец КАК _СЧА_Конец
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СЧА_Конец.ВидАктива,
		|		_СЧА_Конец.Группировка,
		|		_СЧА_Конец.Аналитика,
		|		_СЧА_Конец.Валюта) КАК СЧАКонец
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СЧА_Начало.ВидАктива КАК ВидАктива,
		|			_СЧА_Начало.Группировка КАК Группировка,
		|			_СЧА_Начало.Аналитика КАК Аналитика,
		|			СУММА(_СЧА_Начало.Сумма) КАК Сумма,
		|			_СЧА_Начало.Валюта КАК Валюта,
		|			СУММА(_СЧА_Начало.СуммаСЧА) КАК СуммаСЧА
		|		ИЗ
		|			_СЧА_Начало КАК _СЧА_Начало
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СЧА_Начало.ВидАктива,
		|			_СЧА_Начало.Группировка,
		|			_СЧА_Начало.Аналитика,
		|			_СЧА_Начало.Валюта) КАК СЧАНачало
		|		ПО (СЧАНачало.ВидАктива = СЧАКонец.ВидАктива)
		|			И (СЧАНачало.Аналитика = СЧАКонец.Аналитика)
		|			И (СЧАНачало.Валюта = СЧАКонец.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(СЧАКонец.ВидАктива, СЧАНачало.ВидАктива),
		|	ЕСТЬNULL(СЧАКонец.Группировка, СЧАНачало.Группировка),
		|	ЕСТЬNULL(СЧАНачало.Аналитика, СЧАКонец.Аналитика),
		|	ЕСТЬNULL(СЧАКонец.Валюта, СЧАНачало.Валюта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Объединение.ВидАктива КАК ВидАктива,
		|	_Объединение.ДатаОперации КАК ДатаОперации,
		|	_Объединение.ДатаРасчетов КАК ДатаРасчетов,
		|	ВЫБОР
		|		КОГДА _Объединение.Рынок = ""МНО""
		|				ИЛИ _Объединение.Рынок = ""Депозитный вклад""
		|			ТОГДА 30
		|		КОГДА _Объединение.ВидОперации В (""Покупка (РЕПО)"", ""Покупка (РЕПО ч.2)"", ""Продажа (РЕПО)"", ""Продажа (РЕПО ч.2)"")
		|				И _Объединение.Валюта = &ВалютаРубль
		|			ТОГДА 30
		|		КОГДА _Объединение.ВидОперации В (""Покупка (РЕПО)"", ""Покупка (РЕПО ч.2)"", ""Продажа (РЕПО)"", ""Продажа (РЕПО ч.2)"")
		|				И _Объединение.Валюта <> &ВалютаРубль
		|			ТОГДА 40
		|		КОГДА _Объединение.Рынок = ""Валюта""
		|			ТОГДА 40
		|		ИНАЧЕ 20
		|	КОНЕЦ КАК Группировка,
		|	ВЫБОР
		|		КОГДА _Объединение.Рынок = ""МНО""
		|			ТОГДА 310
		|		КОГДА _Объединение.Рынок = ""Депозитный вклад""
		|			ТОГДА 330
		|		КОГДА _Объединение.ВидОперации В (""Покупка (РЕПО)"", ""Покупка (РЕПО ч.2)"", ""Продажа (РЕПО)"", ""Продажа (РЕПО ч.2)"")
		|				И _Объединение.Валюта = &ВалютаРубль
		|			ТОГДА 320
		|		КОГДА _Объединение.ВидОперации В (""Покупка (РЕПО)"", ""Покупка (РЕПО ч.2)"", ""Продажа (РЕПО)"", ""Продажа (РЕПО ч.2)"")
		|				И _Объединение.Валюта <> &ВалютаРубль
		|			ТОГДА 415
		|		КОГДА _Объединение.Рынок = ""Валюта""
		|			ТОГДА 415
		|		ИНАЧЕ _Объединение.ЦеннаяБумага
		|	КОНЕЦ КАК Аналитика,
		|	ВЫБОР
		|		КОГДА _Объединение.ВидОперации = ""Ввод ЦБ""
		|				ИЛИ _Объединение.ВидОперации = ""Ввод депозита""
		|			ТОГДА _Объединение.Сумма
		|		КОГДА _Объединение.ВидОперации = ""Вывод ЦБ""
		|				ИЛИ _Объединение.ВидОперации = ""Вывод депозита""
		|			ТОГДА -_Объединение.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВводВывод,
		|	ВЫБОР
		|		КОГДА _Объединение.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка), ""Покупка (РЕПО)"", ""Покупка (РЕПО ч.2)"", ""Размещение"")
		|			ТОГДА _Объединение.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПокупки,
		|	ВЫБОР
		|		КОГДА _Объединение.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа), ""Продажа (РЕПО)"", ""Продажа (РЕПО ч.2)"", ""Закрытие"", ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПолноеПогашение), ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ЧастичноеПогашение), ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.Оферта))
		|			ТОГДА _Объединение.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПродажи,
		|	ВЫБОР
		|		КОГДА _Объединение.ВидОперации В (""Погашение купона"", ""Начисление дивидендов"", ""Приход процентов"")
		|			ТОГДА _Объединение.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПогашения,
		|	_Объединение.Валюта КАК Валюта,
		|	_Объединение.СуммаВал КАК СуммаВал,
		|	_Объединение.Курс КАК Курс,
		|	_Объединение.ВидОперации КАК ВидОперации,
		|	_Объединение.Документ КАК Документ
		|ПОМЕСТИТЬ _Движения
		|ИЗ
		|	_Объединение КАК _Объединение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СС"",
		|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
		|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
		|	40,
		|	410,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ -ОстаткиДенежныхСредств.Сумма
		|	КОНЕЦ / КурсыВалют.Кратность * КурсыВалют.Курс,
		|	0,
		|	0,
		|	0,
		|	ОстаткиДенежныхСредств.Валюта,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ -ОстаткиДенежныхСредств.Сумма
		|	КОНЕЦ,
		|	КурсыВалют.Курс,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ""Ввод денежных средств""
		|		ИНАЧЕ ""Вывод денежных средств""
		|	КОНЕЦ,
		|	ОстаткиДенежныхСредств.Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ОстаткиДенежныхСредств.Валюта = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = КурсыВалют.Период)
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Движения.ВидАктива КАК ВидАктива,
		|	_Движения.Группировка КАК Группировка,
		|	_Движения.Аналитика КАК Аналитика,
		|	СУММА(_Движения.СуммаВводВывод) КАК СуммаВводВывод,
		|	СУММА(_Движения.СуммаПокупки) КАК СуммаПокупки,
		|	СУММА(_Движения.СуммаПродажи) КАК СуммаПродажи,
		|	СУММА(_Движения.СуммаПогашения) КАК СуммаПогашения,
		|	_Движения.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ДвиженияСвернуто
		|ИЗ
		|	_Движения КАК _Движения
		|
		|СГРУППИРОВАТЬ ПО
		|	_Движения.ВидАктива,
		|	_Движения.Группировка,
		|	_Движения.Аналитика,
		|	_Движения.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_НачалоКонец.ВидАктива, ЕСТЬNULL(_ДвиженияСвернуто.ВидАктива, ""СС"")) КАК ВидАктива,
		|	ЕСТЬNULL(_НачалоКонец.Группировка, ЕСТЬNULL(_ДвиженияСвернуто.Группировка, _ДоходыРасходыКомисии.Группировка)) КАК Группировка,
		|	ЕСТЬNULL(_НачалоКонец.Аналитика, ЕСТЬNULL(_ДвиженияСвернуто.Аналитика, _ДоходыРасходыКомисии.Аналитика)) КАК Аналитика,
		|	ЕСТЬNULL(_НачалоКонец.СуммаНачала, 0) КАК СуммаНачала,
		|	ЕСТЬNULL(_НачалоКонец.СуммаСЧАНачала, 0) КАК СуммаСЧАНачала,
		|	ЕСТЬNULL(_ДвиженияСвернуто.СуммаВводВывод, 0) КАК СуммаВводВывод,
		|	ЕСТЬNULL(_ДвиженияСвернуто.СуммаПокупки, 0) КАК СуммаПокупки,
		|	ЕСТЬNULL(_ДвиженияСвернуто.СуммаПродажи, 0) КАК СуммаПродажи,
		|	ЕСТЬNULL(_ДвиженияСвернуто.СуммаПогашения, 0) КАК СуммаПогашения,
		|	ЕСТЬNULL(_НачалоКонец.СуммаКонец, 0) КАК СуммаКонец,
		|	ЕСТЬNULL(_НачалоКонец.СуммаСЧАКонец, 0) КАК СуммаСЧАКонец,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_НачалоКонец.Аналитика, ЕСТЬNULL(_ДвиженияСвернуто.Аналитика, _ДоходыРасходыКомисии.Аналитика)) В (410)
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(_НачалоКонец.Аналитика, ЕСТЬNULL(_ДвиженияСвернуто.Аналитика, _ДоходыРасходыКомисии.Аналитика)) В (420, 430, 440, 450, 460, 465, 470, 480)
		|			ТОГДА -ЕСТЬNULL(_ДоходыРасходыКомисии.Сумма, 0)
		|		ИНАЧЕ ЕСТЬNULL(_НачалоКонец.СуммаКонец, 0) - ЕСТЬNULL(_НачалоКонец.СуммаНачала, 0) - ЕСТЬNULL(_ДвиженияСвернуто.СуммаВводВывод, 0) - ЕСТЬNULL(_ДвиженияСвернуто.СуммаПокупки, 0) + ЕСТЬNULL(_ДвиженияСвернуто.СуммаПродажи, 0) + ЕСТЬNULL(_ДвиженияСвернуто.СуммаПогашения, 0)
		|	КОНЕЦ КАК ДоходыРасходы,
		|	ЕСТЬNULL(_НачалоКонец.Валюта, ЕСТЬNULL(_ДвиженияСвернуто.Валюта, &ВалютаРубль)) КАК Валюта
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_НачалоКонец КАК _НачалоКонец
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДвиженияСвернуто КАК _ДвиженияСвернуто
		|		ПО _НачалоКонец.ВидАктива = _ДвиженияСвернуто.ВидАктива
		|			И _НачалоКонец.Аналитика = _ДвиженияСвернуто.Аналитика
		|			И (ВЫБОР
		|				КОГДА _НачалоКонец.Аналитика = 415
		|					ТОГДА _НачалоКонец.Валюта = _ДвиженияСвернуто.Валюта
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДоходыРасходыКомисии КАК _ДоходыРасходыКомисии
		|		ПО _НачалоКонец.Аналитика = _ДоходыРасходыКомисии.Аналитика
		|			И (_ДоходыРасходыКомисии.Сумма <> 0)
		|ГДЕ
		|	НЕ(ЕСТЬNULL(_НачалоКонец.Группировка, ЕСТЬNULL(_ДвиженияСвернуто.Группировка, _ДоходыРасходыКомисии.Группировка)) = 40
		|				И (ЕСТЬNULL(_НачалоКонец.СуммаНачала, 0) = 0
		|					И ЕСТЬNULL(_НачалоКонец.СуммаКонец, 0) = 0
		|					И ЕСТЬNULL(_ДвиженияСвернуто.СуммаВводВывод, 0) = 0
		|					И ЕСТЬNULL(_ДоходыРасходыКомисии.Сумма, 0) = 0
		|					И ЕСТЬNULL(_ДвиженияСвернуто.СуммаПокупки, 0) = 0
		|					И ЕСТЬNULL(_ДвиженияСвернуто.СуммаПродажи, 0) = 0
		|					И ЕСТЬNULL(_ДвиженияСвернуто.СуммаПогашения, 0) = 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИтоговаяТаблица.Аналитика КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|ГДЕ
		|	_ИтоговаяТаблица.Группировка В (10, 20)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК Аналитика,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд
		|		ИНАЧЕ _ЦенныеБумаги.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ""Акции""
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Облигации""
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ""Паи""
		|		ИНАЧЕ ""Прочие""
		|	КОНЕЦ КАК ВидЦеннойБумаги,
		|	ЕСТЬNULL(_ЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, """") КАК РегНомер,
		|	ЕСТЬNULL(ISINы.Код, """") КАК ISIN,
		|	ЕСТЬNULL(КодыММВБКраткие.Код, КодыММВБ.Код) КАК КодММВБ,
		|	ЕСТЬNULL(_ЦенныеБумаги.ЦеннаяБумага.НомерВыпуска, """""""") КАК НомерВыпуска,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Привилегированная)
		|			ТОГДА ""прив.""
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Обыкновенная)
		|			ТОГДА ""обыкн.""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Тип,
		|	ЕСТЬNULL(Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЛОЖЬ) КАК Еврооблигация,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ""Акции""
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						ТОГДА ""ОФЗ""
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|							ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА ""Муниципальные""
		|					ИНАЧЕ ""Корпоративные""
		|				КОНЕЦ
		|	КОНЕЦ КАК ГруппировкаУправляющего1,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД)
		|							ИЛИ НЕ(Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|									И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка))
		|						ТОГДА ""с фиксированным купоном""
		|					КОГДА Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|							И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка)
		|						ТОГДА ""с плавающим купоном""
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ГруппировкаУправляющего2,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(&КонецПериода, Облигации.ДатаПогашения, ГОД) < 3
		|							И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД)
		|								ИЛИ НЕ(Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|										И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка)))
		|						ТОГДА ""до 3 лет""
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|							И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД)
		|								ИЛИ НЕ(Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|										И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка)))
		|							И (РАЗНОСТЬДАТ(&КонецПериода, Облигации.ДатаПогашения, ГОД) >= 3
		|								И РАЗНОСТЬДАТ(&КонецПериода, Облигации.ДатаПогашения, ГОД) < 5)
		|						ТОГДА ""от 3 до 5 лет""
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|							И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД)
		|								ИЛИ НЕ(Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|										И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка)))
		|							И РАЗНОСТЬДАТ(&КонецПериода, Облигации.ДатаПогашения, ГОД) >= 5
		|						ТОГДА ""свыше 5 лет""
		|					КОГДА РАЗНОСТЬДАТ(&КонецПериода, Облигации.ДатаПогашения, ГОД) >= 3
		|							И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД)
		|								ИЛИ НЕ(Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|										И НЕ Облигации.БазоваяСтавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиОблигаций.ПустаяСсылка)))
		|						ТОГДА ""свыше 3 лет""
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ГруппировкаУправляющего3,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА Облигации.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ПараметрыЦБ
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК ISINы
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ISINы.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыММВБ
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КодыММВБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)) КАК КодыММВБКраткие
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КодыММВБКраткие.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧА_Начало.Период КАК Период,
		|	_СЧА_Начало.Аналитика КАК Аналитика,
		|	-_СЧА_Начало.Сумма КАК Сумма,
		|	РАЗНОСТЬДАТ(&НачалоПериода, &ДатаСЧАКонец, ДЕНЬ) + 1 КАК Дней,
		|	ВЫБОР
		|		КОГДА _СЧА_Начало.Группировка = 10
		|				ИЛИ _СЧА_Начало.Группировка = 20
		|			ТОГДА 1
		|		ИНАЧЕ _СЧА_Начало.Группировка
		|	КОНЕЦ КАК Порядок,
		|	_СЧА_Начало.Валюта КАК Валюта,
		|	_СЧА_Начало.СуммаВал КАК СуммаВал,
		|	_СЧА_Начало.Курс КАК Курс,
		|	""СЧА на начало"" КАК Операция,
		|	"""" КАК Документ,
		|	_СЧА_Начало.ВидАктива КАК ВидАктива
		|ПОМЕСТИТЬ _Потоки
		|ИЗ
		|	_СЧА_Начало КАК _СЧА_Начало
		|ГДЕ
		|	(_СЧА_Начало.Группировка <> 40
		|			ИЛИ _СЧА_Начало.Аналитика В (410, 415))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СЧА_Конец.Период,
		|	_СЧА_Конец.Аналитика,
		|	_СЧА_Конец.Сумма,
		|	0,
		|	ВЫБОР
		|		КОГДА _СЧА_Конец.Группировка = 10
		|				ИЛИ _СЧА_Конец.Группировка = 20
		|			ТОГДА 1
		|		ИНАЧЕ _СЧА_Конец.Группировка
		|	КОНЕЦ,
		|	_СЧА_Конец.Валюта,
		|	_СЧА_Конец.СуммаВал,
		|	_СЧА_Конец.Курс,
		|	""СЧА на конец"",
		|	"""",
		|	_СЧА_Конец.ВидАктива
		|ИЗ
		|	_СЧА_Конец КАК _СЧА_Конец
		|ГДЕ
		|	(_СЧА_Конец.Группировка <> 40
		|			ИЛИ _СЧА_Конец.Аналитика В (410, 415))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Движения.ДатаРасчетов,
		|	_Движения.Аналитика,
		|	-_Движения.СуммаВводВывод - _Движения.СуммаПокупки + _Движения.СуммаПродажи + _Движения.СуммаПогашения + ВЫБОР
		|		КОГДА _КомиссияТПлюсВДебиторке.ЕстьКоммиссияВДебиторке = 1
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(_НераспределеннаяКомиссияКонец.СуммаКомиссии, 0)
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(_Движения.ДатаРасчетов, &ДатаСЧАКонец, ДЕНЬ) + 1,
		|	ВЫБОР
		|		КОГДА _Движения.Группировка = 10
		|				ИЛИ _Движения.Группировка = 20
		|			ТОГДА 1
		|		ИНАЧЕ _Движения.Группировка
		|	КОНЕЦ,
		|	_Движения.Валюта,
		|	_Движения.СуммаВал,
		|	_Движения.Курс,
		|	_Движения.ВидОперации,
		|	_Движения.Документ,
		|	_Движения.ВидАктива
		|ИЗ
		|	_Движения КАК _Движения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияТПлюсВДебиторке КАК _КомиссияТПлюсВДебиторке
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НераспределеннаяКомиссияКонец КАК _НераспределеннаяКомиссияКонец
		|		ПО _Движения.Аналитика = _НераспределеннаяКомиссияКонец.ЦеннаяБумага
		|			И _Движения.Документ = _НераспределеннаяКомиссияКонец.Сделка
		|			И _Движения.ВидАктива = _НераспределеннаяКомиссияКонец.ВидАктива
		|ГДЕ
		|	(_Движения.Группировка <> 40
		|			ИЛИ _Движения.Аналитика = 415)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
		|	410,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА -ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ ОстаткиДенежныхСредств.Сумма
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(ОстаткиДенежныхСредств.Период, &ДатаСЧАКонец, ДЕНЬ) + 1,
		|	40,
		|	&ВалютаРубль,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА -ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ ОстаткиДенежныхСредств.Сумма
		|	КОНЕЦ,
		|	1,
		|	""Движения по расчетному и брокерскому счету"",
		|	ОстаткиДенежныхСредств.Регистратор,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.Активность
		|	И НЕ(ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредств.Регистратор) = ТИП(Документ.КорректировкаРегистров)
		|				И (ОстаткиДенежныхСредств.Период МЕЖДУ ДАТАВРЕМЯ(2025, 1, 9, 0, 0, 0) И ДАТАВРЕМЯ(2025, 1, 10, 23, 59, 59)))
		|	И НЕ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В ИЕРАРХИИ (&ВидыЗадолженностиКомиссии, &ВидыЗадолженности)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(_МНОДокументы.Дата, ДЕНЬ),
		|	410,
		|	ВЫБОР
		|		КОГДА _МНОДокументы.ВидОперации В (""Размещение"")
		|			ТОГДА _МНОДокументы.Сумма
		|		ИНАЧЕ -_МНОДокументы.Сумма
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(_МНОДокументы.Дата, &ДатаСЧАКонец, ДЕНЬ) + 1,
		|	40,
		|	&ВалютаРубль,
		|	ВЫБОР
		|		КОГДА _МНОДокументы.ВидОперации В (""Размещение"")
		|			ТОГДА _МНОДокументы.Сумма
		|		ИНАЧЕ -_МНОДокументы.Сумма
		|	КОНЕЦ,
		|	1,
		|	""Движения по МНО"",
		|	_МНОДокументы.Документ,
		|	""СС""
		|ИЗ
		|	_МНОДокументы КАК _МНОДокументы
		|ГДЕ
		|	_МНОДокументы.ВидОперации <> ""Приход процентов""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Комиссии.ДатаИсполнения,
		|	410,
		|	_Комиссии.СуммаКомиссии,
		|	РАЗНОСТЬДАТ(_Комиссии.ДатаИсполнения, &ДатаСЧАКонец, ДЕНЬ) + 1,
		|	40,
		|	&ВалютаРубль,
		|	_Комиссии.СуммаКомиссии,
		|	1,
		|	""Оплата комиссии"",
		|	_Комиссии.Сделка,
		|	""СС""
		|ИЗ
		|	_КомиссияОплаченная КАК _Комиссии
		|ГДЕ
		|	_Комиссии.ДатаОплаты <= &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.Период,
		|	410,
		|	ОстаткиДенежныхСредств.Сумма,
		|	РАЗНОСТЬДАТ(ОстаткиДенежныхСредств.Период, &ДатаСЧАКонец, ДЕНЬ) + 1,
		|	40,
		|	&ВалютаРубль,
		|	ОстаткиДенежныхСредств.Сумма,
		|	1,
		|	""Оплата комиссии"",
		|	ОстаткиДенежныхСредств.Регистратор,
		|	""СС""
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В ИЕРАРХИИ(&ВидыЗадолженностиКомиссии)
		|	И ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Потоки.ВидАктива КАК ВидАктива,
		|	_Потоки.Аналитика КАК Аналитика,
		|	СУММА(_Потоки.Сумма) КАК ДоходРасход,
		|	СУММА(-_Потоки.Сумма * _Потоки.Дней) КАК Расчет
		|ПОМЕСТИТЬ _ДанныеДляДоходности
		|ИЗ
		|	_Потоки КАК _Потоки
		|
		|СГРУППИРОВАТЬ ПО
		|	_Потоки.ВидАктива,
		|	_Потоки.Аналитика";
	
#КонецОбласти 	
	
	ДнейВГоду = ДеньГода(КонецГода(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ДнейВГоду", ДнейВГоду); 
	
	ДнейОтчета = Цел((ЭтотОбъект.Период.ДатаОкончания - ДатаНачала) / 86400) + 1;
	Запрос.УстановитьПараметр("ДнейОтчета", ДнейОтчета);

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ВхСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("ВалютаРубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	ВидыЗадолженности = Новый Массив;
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.БанковскаяКомиссия);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПрочимУслугам);
	ВидыЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий);
	
	Запрос.УстановитьПараметр("ВидыЗадолженности", ВидыЗадолженности);
		
	ВидыЗадолженностиКомиссии = Новый Массив;
	ВидыЗадолженностиКомиссии.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	ВидыЗадолженностиКомиссии.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);	
	
	Запрос.УстановитьПараметр("ВидыЗадолженностиКомиссии", ВидыЗадолженностиКомиссии);        
	
	СчетаАС = Новый Массив;
	СчетаАС.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	СчетаАС.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);    
	Запрос.УстановитьПараметр("СчетАС", СчетаАС);
	
	СчетаСС = Новый Массив;
	СчетаСС.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	Запрос.УстановитьПараметр("СчетСС", СчетаСС);
	
	//для разделения активов на АС и СС достаточно этих счетов. Главное выделить облигации, которые учитываются по разным видам активов. 
	// все остальные прочие активы по умолчанию оцениваются по справедливой
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
	ЭтотОбъект.Период.ДатаОкончания,
	ЭтотОбъект.Организация,
	ВхСчетДоверительногоУправления);		
		
	Запрос.УстановитьПараметр("МассивТипыЦенныхБумаг", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы());
	
	ДатаСЧАНачало = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(
				ЭтотОбъект.Организация, 
				ВхСчетДоверительногоУправления, 
				НачалоДня(ДатаНачала) - 3600*24);
				
	Если ДатаСЧАНачало = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет СЧА на " + Формат(НачалоДня(ДатаНачала) - 3600*24, "ДФ=dd.MM.yyyy") + " у счета ДУ " + ВхСчетДоверительногоУправления );
		Возврат;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаСЧАНачало", ДатаСЧАНачало);
	
	ДатаСЧАКонец = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(
				ЭтотОбъект.Организация, 
				ВхСчетДоверительногоУправления, 
				НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
				
	Если ДатаСЧАКонец = Неопределено 
		ИЛИ НачалоДня(ДатаСЧАКонец) <> НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет СЧА на " + Формат(НачалоДня(ЭтотОбъект.Период.ДатаОкончания), "ДФ=dd.MM.yyyy")  + " у счета ДУ " + ВхСчетДоверительногоУправления );
		Возврат;
	КонецЕсли;	
				
				
	Запрос.УстановитьПараметр("ДатаСЧАКонец", ДатаСЧАКонец); 
	
	Запрос.Выполнить(); 
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "Основной" Тогда 
		ПечатьВариантОсновной(ВхСчетДоверительногоУправления, ДатаНачала, Запрос, ДокументРезультат, ДнейОтчета);
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "ДляУправляющих" 
		ИЛИ ЭтотОбъект.КлючТекущегоВарианта = "ДляУправляющих2" Тогда
		ПечатьВариантДляУправляющих(ВхСчетДоверительногоУправления, ДатаНачала, Запрос, ДокументРезультат, ДнейОтчета);
	КонецЕсли;	
	
	Если ЭтотОбъект.КлючТекущегоВарианта <> "ДляУправляющих2" Тогда 
		ПечатьРасшифровка(Запрос, ДокументРасшифровка, ДнейВГоду);
	КонецЕсли;
	
КонецПроцедуры	


Процедура ПечатьВариантОсновной(вхСчетДоверительногоУправления, ДатаНачала, Запрос, ДокументРезультат, ДнейОтчета)

#Область Запросик	
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВидыАктивов.Наименование КАК ВидАктива,
	|	_ИтоговаяТаблица.Группировка КАК ГруппировкаКод,
	|	_Группировки.Группировка КАК Группировка,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика = 415
	|			ТОГДА _Аналитики.Аналитика + "", "" + _ИтоговаяТаблица.Валюта.Наименование
	|		ИНАЧЕ ЕСТЬNULL(_ПараметрыЦБ.ВидЦеннойБумаги, _Аналитики.Аналитика)
	|	КОНЕЦ КАК ВидЦеннойБумаги,
	|	ВЫБОР
	|		КОГДА НЕ _ИтоговаяТаблица.Группировка В (10, 20)
	|			ТОГДА _Аналитики.Аналитика
	|		КОГДА _ИтоговаяТаблица.Аналитика ССЫЛКА Справочник.Паи
	|			ТОГДА ЕСТЬNULL(РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда, """") + "", рег.номер "" + ВЫРАЗИТЬ(_ИтоговаяТаблица.Аналитика КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
	|		КОГДА _ИтоговаяТаблица.Аналитика ССЫЛКА Справочник.Акции
	|				И _ПараметрыЦБ.НомерВыпуска <> """"
	|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + _ПараметрыЦБ.Тип + "", выпуск "" + _ПараметрыЦБ.НомерВыпуска
	|		КОГДА _ИтоговаяТаблица.Аналитика ССЫЛКА Справочник.Акции
	|				И _ПараметрыЦБ.НомерВыпуска <> """"
	|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", "" + _ПараметрыЦБ.Тип + "", ISIN "" + _ПараметрыЦБ.ISIN
	|		КОГДА _ИтоговаяТаблица.Аналитика ССЫЛКА Справочник.Облигации
	|				И _ПараметрыЦБ.Еврооблигация
	|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", ISIN "" + _ПараметрыЦБ.ISIN
	|		КОГДА _ПараметрыЦБ.НомерВыпуска = """"
	|			ТОГДА РеквизитыЭмитента.КраткоеНаименованиеПоУставу
	|		ИНАЧЕ РеквизитыЭмитента.КраткоеНаименованиеПоУставу + "", выпуск "" + _ПараметрыЦБ.НомерВыпуска
	|	КОНЕЦ КАК Аналитика,
	|	ЕСТЬNULL(_ПараметрыЦБ.КодММВБ, """") КАК КодММВБ,
	|	ЕСТЬNULL(_ПараметрыЦБ.РегНомер, """") КАК РегНомер,
	|	ЕСТЬNULL(_ПараметрыЦБ.ISIN, """") КАК ISIN,
	|	_ИтоговаяТаблица.Аналитика КАК АналитикаКод,
	|	_ИтоговаяТаблица.СуммаНачала КАК СуммаНачала,
	|	_ИтоговаяТаблица.СуммаСЧАНачала КАК СуммаСЧАНачала,
	|	_ИтоговаяТаблица.СуммаВводВывод КАК СуммаВводВывод,
	|	_ИтоговаяТаблица.СуммаПокупки КАК СуммаПокупки,
	|	_ИтоговаяТаблица.СуммаПродажи КАК СуммаПродажи,
	|	_ИтоговаяТаблица.СуммаПогашения КАК СуммаПогашения,
	|	_ИтоговаяТаблица.СуммаКонец КАК СуммаКонец,
	|	_ИтоговаяТаблица.СуммаСЧАКонец КАК СуммаСЧАКонец,
	|	_ИтоговаяТаблица.ДоходыРасходы КАК ДоходыРасходы,
	|	ЕСТЬNULL(_ДанныеДляДоходности.ДоходРасход, 0) КАК ДоходРасходРасчет,
	|	ЕСТЬNULL(_ДанныеДляДоходности.Расчет, 0) КАК Расчет,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика В (420, 430, 440, 450, 460, 465, 470, 480)
	|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.СуммаНачала * &ДнейОтчета / &ДнейВГоду КАК ЧИСЛО(19, 2))
	|		КОГДА _ДанныеДляДоходности.Расчет ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫРАЗИТЬ(_ДанныеДляДоходности.Расчет / &ДнейВГоду КАК ЧИСЛО(19, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СредневзвешеннаяСумма,
	|	ВЫБОР
	|		КОГДА _ДанныеДляДоходности.Расчет <> 0
	|			ТОГДА 100 * _ИтоговаяТаблица.ДоходыРасходы / (_ДанныеДляДоходности.Расчет / &ДнейВГоду)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Доходность
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДляДоходности КАК _ДанныеДляДоходности
	|		ПО _ИтоговаяТаблица.Аналитика = _ДанныеДляДоходности.Аналитика
	|			И _ИтоговаяТаблица.ВидАктива = _ДанныеДляДоходности.ВидАктива
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Группировки КАК _Группировки
	|		ПО _ИтоговаяТаблица.Группировка = _Группировки.Порядок
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Аналитики КАК _Аналитики
	|		ПО _ИтоговаяТаблица.Аналитика = _Аналитики.КодАналитии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыАктивов КАК _ВидыАктивов
	|		ПО _ИтоговаяТаблица.ВидАктива = _ВидыАктивов.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыЦБ КАК _ПараметрыЦБ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|					&КонецПериода,
	|					ЮрФизЛицо В
	|							(ВЫБРАТЬ
	|								_ПараметрыЦБ.Эмитент
	|							ИЗ
	|								_ПараметрыЦБ)
	|						И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
	|			ПО (РеквизитыЭмитента.ЮрФизЛицо = _ПараметрыЦБ.Эмитент)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(
	|					&КонецПериода,
	|					ПаевойИнвестиционныйФонд В
	|						(ВЫБРАТЬ
	|							_ПараметрыЦБ.Эмитент
	|						ИЗ
	|							_ПараметрыЦБ)) КАК РеквизитыПИФСрезПоследних
	|			ПО (РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = _ПараметрыЦБ.Эмитент)
	|		ПО _ИтоговаяТаблица.Аналитика = _ПараметрыЦБ.Аналитика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидАктива,
	|	ГруппировкаКод,
	|	АналитикаКод
	|ИТОГИ
	|	МАКСИМУМ(Группировка),
	|	СУММА(СуммаНачала),
	|	СУММА(СуммаСЧАНачала),
	|	СУММА(СуммаВводВывод),
	|	СУММА(СуммаПокупки),
	|	СУММА(СуммаПродажи),
	|	СУММА(СуммаПогашения),
	|	СУММА(СуммаКонец),
	|	СУММА(СуммаСЧАКонец),
	|	СУММА(ДоходыРасходы),
	|	СУММА(ДоходРасходРасчет),
	|	СУММА(Расчет),
	|	СУММА(СредневзвешеннаяСумма)
	|ПО
	|	ОБЩИЕ,
	|	ВидАктива,
	|	_Группировки.Порядок,
	|	ВидЦеннойБумаги
	|АВТОУПОРЯДОЧИВАНИЕ";
#КонецОбласти	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьВидЦБ = Макет.ПолучитьОбласть("ГруппировкаВидЦБ");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");  
	ОбластьВидАктива = Макет.ПолучитьОбласть("ВидАктива"); 
	
		
	//шапка
	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(вхСчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		
	ОбластьШапка.Параметры.НомерДоговора	= вхСчетДоверительногоУправления.НомерДоговора;	
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(вхСчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодОтчета 	= ПредставлениеПериода(ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП=Истина");
	ОбластьШапка.Параметры.ДнейОтчета 		= ДнейОтчета;
	
	ОбластьШапка.Параметры.УчредительУправления = НаименованияКлиента.КраткоеНаименование; 
	ОбластьШапка.Параметры.ДоверительныйУправляющий = ЭтотОбъект.Организация;

	ДокументРезультат.Вывести(ОбластьШапка); 
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаВидАктива = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидАктива.Следующий() Цикл 
			
			ЗаполнитьЗначенияСвойств(ОбластьВидАктива.Параметры, ВыборкаВидАктива);
			Если ВыборкаВидАктива.СредневзвешеннаяСумма <> 0 Тогда 
				ОбластьВидАктива.Параметры.Доходность = Окр(ВыборкаВидАктива.ДоходыРасходы / ВыборкаВидАктива.СредневзвешеннаяСумма *100, 2);
			КонецЕсли;	
			ДокументРезультат.Вывести(ОбластьВидАктива);        
			
			
			ВыборкаГруппа = ВыборкаВидАктива.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаГруппа.Следующий() Цикл 
				
				ЗаполнитьЗначенияСвойств(ОбластьГруппа.Параметры, ВыборкаГруппа);
				Если НЕ (ВыборкаГруппа.СредневзвешеннаяСумма = 0 
					ИЛИ ВыборкаГруппа.Группировка = "денежные средства и расходы") Тогда 
					ОбластьГруппа.Параметры.Доходность = Окр(ВыборкаГруппа.ДоходыРасходы / ВыборкаГруппа.СредневзвешеннаяСумма *100, 2);
				КонецЕсли;	
				ДокументРезультат.Вывести(ОбластьГруппа);        
				
				ВыборкаВидЦБ = ВыборкаГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаВидЦБ.Следующий() Цикл 
					ЗаполнитьЗначенияСвойств(ОбластьВидЦБ.Параметры, ВыборкаВидЦБ);      
					
					Если ВыборкаГруппа.Группировка = "по открытым позициям" 
						ИЛИ ВыборкаГруппа.Группировка = "по закрытым позициям" Тогда   
						
						Если ВыборкаВидЦБ.СредневзвешеннаяСумма <> 0 Тогда 
							ОбластьВидЦБ.Параметры.Доходность = Окр(ВыборкаВидЦБ.ДоходыРасходы / ВыборкаВидЦБ.СредневзвешеннаяСумма *100, 2);
						КонецЕсли;	
						ДокументРезультат.Вывести(ОбластьВидЦБ);  
						
					КонецЕсли;	
					
					ВыборкаРаздел = ВыборкаВидЦБ.Выбрать(ОбходРезультатаЗапроса.Прямой);
					//ДокументРезультат.НачатьГруппуСтрок();
					Пока ВыборкаРаздел.Следующий() Цикл 
						ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаРаздел); 
						Если СтрНачинаетсяС(ВыборкаРаздел.ВидЦеннойБумаги, "денежные средства в валюте") 
							ИЛИ СтрНачинаетсяС(ВыборкаРаздел.ВидЦеннойБумаги, "РЕПО")	Тогда 
							ОбластьСтрока.Параметры.Аналитика = ВыборкаРаздел.ВидЦеннойБумаги;
						КонецЕсли;					
						ДокументРезультат.Вывести(ОбластьСтрока);
						
					КонецЦикла;
					//ДокументРезультат.ЗакончитьГруппуСтрок();   
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		//итог
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка); 
		Если Выборка.СредневзвешеннаяСумма <> 0 Тогда 
			ОбластьИтог.Параметры.Доходность = Окр(Выборка.ДоходыРасходы / Выборка.СредневзвешеннаяСумма *100, 2);
		КонецЕсли;	
		ДокументРезультат.Вывести(ОбластьИтог);
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция ПолучитьТаблицуКатегорий()
	
	ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(25)); 
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Макет = ПолучитьМакет("ШаблонГруппировок");

	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовки|Колонки");
	ОбластьДанные = Макет.ПолучитьОбласть("Строки|Колонки");
	
	
	Рез = Новый ТаблицаЗначений;  
	
	КоличествоКолонок = ОбластьЗаголовки.ШиринаТаблицы;
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для инд = 1 по КоличествоКолонок Цикл 
		НаименованиеКолонки = ОбластьЗаголовки.ПолучитьОбласть(1, инд).ТекущаяОбласть.Текст; 
		Если НаименованиеКолонки = "Аналитика" Тогда
			Рез.Колонки.Добавить(НаименованиеКолонки, ТипЧисло);
		Иначе	
			Рез.Колонки.Добавить(НаименованиеКолонки, ТипСтрока);
		КонецЕсли;
	КонецЦикла;	

	Для индСтроки = 1 по КоличествоСтрок Цикл
		НоваяСтрока = Рез.Добавить();
		Для индКолонки = 1 по КоличествоКолонок Цикл
			ТекстЯчейки = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;
			НоваяСтрока[ИндКолонки-1] = ТекстЯчейки;
		КонецЦикла;		
	КонецЦикла;
	
	Возврат Рез;  
	
	//Таблица нужна только для того,чтобы отсортировать результирующий запрос.  
	// У активов ВС и СС своя нумерация. Но возьмем только СС. Для сортировки этого достаточно. 
	// В шаблоне составил полный перечень категорий
	// У группы код категории определяется в момент вывода. 
	
КонецФункции

Процедура ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьОсновная, ОбластьКБ)
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "ДляУправляющих" Тогда 
		ДокументРезультат.Вывести(ОбластьОсновная);
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "ДляУправляющих2" Тогда
		ДокументРезультат.Вывести(ОбластьКБ);
		ДокументРезультат.Присоединить(ОбластьОсновная);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьВариантДляУправляющих(вхСчетДоверительногоУправления, ДатаНачала, Запрос, ДокументРезультат, ДнейОтчета)
	
	ТаблицаКатегорий = ПолучитьТаблицуКатегорий(); 
	Запрос.УстановитьПараметр("ВнешняяТаблица", ТаблицаКатегорий);
	
	// с дюрацией в отчете происходит следующий сюрреализм  
	// Значение дюрации для ценных бумаг берем с котировок. 
	// 1. У Акций дюрации нет  и слава богу. 
	// 2. Деньги, депозиты - Дюрация  = 0, но сумму по этим активам должны учесть при расчете дюрации по портфелю.
	// 3. Для облигаций с плавающим купоном, 
	//   - если дюрация < года, считаем ее равной 0.25
	//   - если дюрация >=года, тогда 1. 
	// 4. Но это еще не всё! Для бумаг по амортизированной стоимости в итогах дюрацию не учитываем,
	//    но в отчете показываем. 
	
	
	Запрос.Текст = 
#Область Запрос
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Категории.Аналитика КАК Аналитика,
	|	Категории.ГруппировкаУправляющего1 КАК ГруппировкаУправляющего1,
	|	Категории.ГруппировкаУправляющего2 КАК ГруппировкаУправляющего2,
	|	Категории.ГруппировкаУправляющего3 КАК ГруппировкаУправляющего3,
	|	Категории.Категория КАК Категория
	|ПОМЕСТИТЬ _Категории
	|ИЗ
	|	&ВнешняяТаблица КАК Категории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКПолучениюОбороты.Регистратор КАК Регистратор,
	|	БухПартииЦенныхБумагКПолучениюОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагКПолучениюОбороты.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ВекселяДоПогашения))
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ КАК ВидАктива
	|ПОМЕСТИТЬ _ПокупкиПоВидуАктива
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагКПолучениюОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумаг.Регистратор,
	|	БухПартииЦенныхБумаг.КоличествоПриход,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумаг.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ВекселяДоПогашения))
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумаг
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) = ТИП(Документ.Сделка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УсловияСделок.ДатаИсполнения КАК Период,
	|	УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
	|	УсловияСделок.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(_ПокупкиПоВидуАктива.ВидАктива, ""СС"") КАК ВидАктива,
	|	УсловияСделок.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность КАК СуммаРуб,
	|	УсловияСделок.Сумма КАК СуммаВал,
	|	УсловияСделок.ЦенаПроцент КАК ЦенаПроцент,
	|	УсловияСделок.Количество КАК Количество
	|ПОМЕСТИТЬ _ПокупкиПериод
	|ИЗ
	|	РегистрСведений.УсловияСделок КАК УсловияСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПокупкиПоВидуАктива КАК _ПокупкиПоВидуАктива
	|		ПО УсловияСделок.Регистратор = _ПокупкиПоВидуАктива.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО УсловияСделок.ВалютаОплаты = КурсыВалют.Валюта
	|			И УсловияСделок.ДатаИсполнения = КурсыВалют.Период
	|ГДЕ
	|	УсловияСделок.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УсловияСделок.Активность
	|	И УсловияСделок.Организация = &Организация
	|	И УсловияСделок.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И УсловияСделок.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
	|	И НЕ УсловияСделок.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ПокупкиПериод.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПокупкиПериод.ВидАктива КАК ВидАктива,
	|	СУММА(_ПокупкиПериод.СуммаРуб) / СУММА(_ПокупкиПериод.Количество) КАК ЦенаРуб,
	|	СУММА(_ПокупкиПериод.СуммаВал) / СУММА(_ПокупкиПериод.Количество) КАК ЦенаВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_ПокупкиПериод.ЦеннаяБумага) = ТИП(Справочник.Акции)
	|			ТОГДА NULL
	|		ИНАЧЕ СУММА(_ПокупкиПериод.ЦенаПроцент * _ПокупкиПериод.Количество) / СУММА(_ПокупкиПериод.Количество)
	|	КОНЕЦ КАК ЦенаПроцент
	|ПОМЕСТИТЬ _ЦеныПокупки
	|ИЗ
	|	_ПокупкиПериод КАК _ПокупкиПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПокупкиПериод.ЦеннаяБумага,
	|	_ПокупкиПериод.ВидАктива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ КАК ВидАктива,
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) / СУММА(СтоимостьПереоценки.Количество) КАК ЦенаРуб,
	|	СУММА(СтоимостьПереоценки.Сумма) / СУММА(СтоимостьПереоценки.Количество) КАК ЦенаВал,
	|	ВЫБОР
	|		КОГДА НоминалыЦенныхБумагСрезПоследних.Номинал ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫРАЗИТЬ(СУММА(СтоимостьПереоценки.Сумма) / СУММА(СтоимостьПереоценки.Количество) * 100 / НоминалыЦенныхБумагСрезПоследних.Номинал КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК ЦенаПроцент
	|ПОМЕСТИТЬ _ЦеныНачало
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаСЧАНачало, ) КАК НоминалыЦенныхБумагСрезПоследних
	|		ПО СтоимостьПереоценки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
	|ГДЕ
	|	СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
	|	И СтоимостьПереоценки.Период = &ДатаСЧАНачало
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьПереоценки.ЦеннаяБумага,
	|	НоминалыЦенныхБумагСрезПоследних.Номинал,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(_ЦеныНачало.ЦеннаяБумага, _ЦеныПокупки.ЦеннаяБумага) КАК ЦеннаяБумага,
	|	ЕСТЬNULL(_ЦеныНачало.ВидАктива, _ЦеныПокупки.ВидАктива) КАК ВидАктива,
	|	ЕСТЬNULL(_ЦеныНачало.ЦенаРуб, _ЦеныПокупки.ЦенаРуб) КАК ЦенаРуб,
	|	ЕСТЬNULL(_ЦеныНачало.ЦенаВал, _ЦеныПокупки.ЦенаВал) КАК ЦенаВал,
	|	ЕСТЬNULL(_ЦеныНачало.ЦенаПроцент, _ЦеныПокупки.ЦенаПроцент) КАК ЦенаПроцент
	|ПОМЕСТИТЬ _ЦеныНачалоИПокупки
	|ИЗ
	|	_ЦеныНачало КАК _ЦеныНачало
	|		ПОЛНОЕ СОЕДИНЕНИЕ _ЦеныПокупки КАК _ЦеныПокупки
	|		ПО _ЦеныНачало.ЦеннаяБумага = _ЦеныПокупки.ЦеннаяБумага
	|			И _ЦеныНачало.ВидАктива = _ЦеныПокупки.ВидАктива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ КАК ВидАктива,
	|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) / СУММА(СтоимостьПереоценки.Количество) КАК ЦенаРуб,
	|	СУММА(СтоимостьПереоценки.Сумма) / СУММА(СтоимостьПереоценки.Количество) КАК ЦенаВал,
	|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
	|	ВЫБОР
	|		КОГДА НоминалыЦенныхБумагСрезПоследних.Номинал ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫРАЗИТЬ(СУММА(СтоимостьПереоценки.Сумма) / СУММА(СтоимостьПереоценки.Количество) * 100 / НоминалыЦенныхБумагСрезПоследних.Номинал КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК ЦенаПроцент
	|ПОМЕСТИТЬ _ЦеныКонец
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаСЧАКонец, ) КАК НоминалыЦенныхБумагСрезПоследних
	|		ПО СтоимостьПереоценки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
	|ГДЕ
	|	СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
	|	И СтоимостьПереоценки.Период = &ДатаСЧАКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьПереоценки.ЦеннаяБумага,
	|	НоминалыЦенныхБумагСрезПоследних.Номинал,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ВидЦены = ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость)
	|			ТОГДА ""АС""
	|		ИНАЧЕ ""СС""
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.Период КАК Период,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.DURATION КАК DURATION,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.YIELDATWAP КАК YIELDATWAP,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.YIELDCLOSE КАК YIELDCLOSE
	|ПОМЕСТИТЬ _Котировки
	|ИЗ
	|	РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
	|			&ДатаСЧАКонец,
	|			Биржа = &ММВБ
	|				И РежимТоргов.ОсновнойРежим
	|				И Период = &ДатаСЧАКонец
	|				И Валюта = &ВалютаРубль
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_ЦенныеБумаги.ЦеннаяБумага
	|					ИЗ
	|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВидыАктивов.Наименование КАК ВидАктива,
	|	_ИтоговаяТаблица.Группировка КАК ГруппировкаКод,
	|	_Группировки.Группировка КАК Группировка,
	|	ВЫБОР
	|		КОГДА _ПараметрыЦБ.ГруппировкаУправляющего1 ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА _ИтоговаяТаблица.Аналитика = 330
	|						ТОГДА ""Депозиты""
	|					КОГДА _ИтоговаяТаблица.Аналитика В (310, 320, 410, 415)
	|						ТОГДА ""Деньги""
	|				КОНЕЦ
	|		ИНАЧЕ _ПараметрыЦБ.ГруппировкаУправляющего1
	|	КОНЕЦ КАК ГруппировкаУправляющего1,
	|	_ПараметрыЦБ.ГруппировкаУправляющего2 КАК ГруппировкаУправляющего2,
	|	_ПараметрыЦБ.ГруппировкаУправляющего3 КАК ГруппировкаУправляющего3,
	|	ВЫБОР
	|		КОГДА НЕ _ИтоговаяТаблица.Группировка В (10, 20)
	|			ТОГДА _Аналитики.Аналитика
	|		ИНАЧЕ _ПараметрыЦБ.КодММВБ
	|	КОНЕЦ КАК Аналитика,
	|	ЕСТЬNULL(_ПараметрыЦБ.ISIN, """") КАК ISIN,
	|	_ИтоговаяТаблица.СуммаНачала КАК СуммаНачала,
	|	_ИтоговаяТаблица.СуммаСЧАНачала КАК СуммаСЧАНачала,
	|	_ИтоговаяТаблица.СуммаВводВывод КАК СуммаВводВывод,
	|	_ИтоговаяТаблица.СуммаПокупки КАК СуммаПокупки,
	|	_ИтоговаяТаблица.СуммаПродажи КАК СуммаПродажи,
	|	_ИтоговаяТаблица.СуммаПогашения КАК СуммаПогашения,
	|	_ИтоговаяТаблица.СуммаКонец КАК СуммаКонец,
	|	_ИтоговаяТаблица.СуммаСЧАКонец КАК СуммаСЧАКонец,
	|	_ИтоговаяТаблица.ДоходыРасходы КАК ДоходыРасходы,
	|	_ИтоговаяТаблица.Аналитика КАК АналитикаКод,
	|	ЕСТЬNULL(_ДанныеДляДоходности.ДоходРасход, 0) КАК ДоходРасходРасчет,
	|	ЕСТЬNULL(_ДанныеДляДоходности.Расчет, 0) КАК Расчет,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика В (420, 430, 440, 450, 460, 465, 470, 480)
	|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.СуммаНачала * &ДнейОтчета / &ДнейВГоду КАК ЧИСЛО(19, 2))
	|		КОГДА _ДанныеДляДоходности.Расчет ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫРАЗИТЬ(_ДанныеДляДоходности.Расчет / &ДнейВГоду КАК ЧИСЛО(19, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СредневзвешеннаяСумма,
	|	ВЫБОР
	|		КОГДА _ДанныеДляДоходности.Расчет <> 0
	|			ТОГДА 100 * _ИтоговаяТаблица.ДоходыРасходы / (_ДанныеДляДоходности.Расчет / &ДнейВГоду)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Доходность,
	|	ЕСТЬNULL(_ЦеныНачало.ЦенаПроцент, ЕСТЬNULL(_ЦеныНачало.ЦенаРуб, 0)) КАК ЦенаНачало,
	|	ЕСТЬNULL(_ЦеныКонец.ЦенаПроцент, ЕСТЬNULL(_ЦеныКонец.ЦенаРуб, 0)) КАК ЦенаКонец,
	|	ЕСТЬNULL(_ЦеныКонец.ЦенаПроцент, ЕСТЬNULL(_ЦеныКонец.ЦенаРуб, 0)) - ЕСТЬNULL(_ЦеныНачало.ЦенаПроцент, ЕСТЬNULL(_ЦеныНачало.ЦенаРуб, 0)) КАК Переоценка,
	|	ЕСТЬNULL(_ЦеныКонец.Количество, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика В (310, 320, 330, 410, 415)
	|			ТОГДА 0
	|		КОГДА _КатегорииЦБ.Категория В (""4.2"", ""5.2"", ""6.2"")
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))) < 1
	|						ТОГДА 0.25
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))
	|	КОНЕЦ КАК DURATION,
	|	_Котировки.YIELDCLOSE КАК YIELDCLOSE,
	|	ЕСТЬNULL(_ПараметрыЦБ.ВалютаНоминала, _ИтоговаяТаблица.Валюта) КАК Валюта,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика В (310, 320, 330, 410, 415)
	|			ТОГДА 0
	|		КОГДА _КатегорииЦБ.Категория В (""4.2"", ""5.2"", ""6.2"")
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))) < 1
	|						ТОГДА 0.25
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))
	|	КОНЕЦ * _ИтоговаяТаблица.СуммаСЧАКонец КАК ПроизведениеДюрацииНаСумму,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.Аналитика В (310, 320, 330, 410, 415)
	|			ТОГДА 0
	|		КОГДА _ИтоговаяТаблица.ВидАктива = ""АС""
	|			ТОГДА 0
	|		КОГДА _КатегорииЦБ.Категория В (""4.2"", ""5.2"", ""6.2"")
	|				И _ИтоговаяТаблица.ВидАктива = ""СС""
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))) < 1
	|						ТОГДА 0.25
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.DURATION, 0) / 365 КАК ЧИСЛО(10, 3))
	|	КОНЕЦ * _ИтоговаяТаблица.СуммаСЧАКонец КАК ПроизведениеДюрацииНаСуммуВсего,
	|	_ИтоговаяТаблица.СуммаСЧАКонец * (ВЫРАЗИТЬ(ЕСТЬNULL(_Котировки.YIELDCLOSE, 0) КАК ЧИСЛО(10, 3))) КАК ПроизведениеYIELDCLOSEНаСумму,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.Аналитика) = ТИП(Справочник.Облигации)
	|				ИЛИ _ИтоговаяТаблица.Аналитика В (310, 320, 330, 410, 415)
	|			ТОГДА _ИтоговаяТаблица.СуммаСЧАКонец
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДляРасчетаДюрацииПоГруппировкам,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.Аналитика) = ТИП(Справочник.Облигации)
	|					И _ИтоговаяТаблица.ВидАктива = ""СС""
	|				ИЛИ _ИтоговаяТаблица.Аналитика В (310, 320, 330, 410, 415)
	|			ТОГДА _ИтоговаяТаблица.СуммаСЧАКонец
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДляРасчетаДюрацииВсего,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_ПараметрыЦБ.ВалютаНоминала, _ИтоговаяТаблица.Валюта) = &ВалютаРубль
	|			ТОГДА ""1."" + ЕСТЬNULL(_КатегорииЦБ.Категория, _КатегорииПрочие.Категория)
	|		КОГДА ЕСТЬNULL(_ПараметрыЦБ.ВалютаНоминала, _ИтоговаяТаблица.Валюта) <> &ВалютаРубль
	|			ТОГДА ""2."" + ЕСТЬNULL(_КатегорииЦБ.Категория, _КатегорииПрочие.Категория)
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДляДоходности КАК _ДанныеДляДоходности
	|		ПО _ИтоговаяТаблица.Аналитика = _ДанныеДляДоходности.Аналитика
	|			И _ИтоговаяТаблица.ВидАктива = _ДанныеДляДоходности.ВидАктива
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Группировки КАК _Группировки
	|		ПО _ИтоговаяТаблица.Группировка = _Группировки.Порядок
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Аналитики КАК _Аналитики
	|		ПО _ИтоговаяТаблица.Аналитика = _Аналитики.КодАналитии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыАктивов КАК _ВидыАктивов
	|		ПО _ИтоговаяТаблица.ВидАктива = _ВидыАктивов.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыЦБ КАК _ПараметрыЦБ
	|		ПО _ИтоговаяТаблица.Аналитика = _ПараметрыЦБ.Аналитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Категории КАК _КатегорииЦБ
	|		ПО (_ПараметрыЦБ.ГруппировкаУправляющего1 = _КатегорииЦБ.ГруппировкаУправляющего1)
	|			И (ЕСТЬNULL(_ПараметрыЦБ.ГруппировкаУправляющего2, """") = _КатегорииЦБ.ГруппировкаУправляющего2)
	|			И (ЕСТЬNULL(_ПараметрыЦБ.ГруппировкаУправляющего3, """") = _КатегорииЦБ.ГруппировкаУправляющего3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Котировки КАК _Котировки
	|		ПО (_Котировки.ЦеннаяБумага = _ИтоговаяТаблица.Аналитика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныНачалоИПокупки КАК _ЦеныНачало
	|		ПО (_ЦеныНачало.ЦеннаяБумага = _ИтоговаяТаблица.Аналитика)
	|			И (_ЦеныНачало.ВидАктива = _ИтоговаяТаблица.ВидАктива)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныКонец КАК _ЦеныКонец
	|		ПО (_ЦеныКонец.ЦеннаяБумага = _ИтоговаяТаблица.Аналитика)
	|			И (_ЦеныКонец.ВидАктива = _ИтоговаяТаблица.ВидАктива)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Категории КАК _КатегорииПрочие
	|		ПО _ИтоговаяТаблица.Аналитика = _КатегорииПрочие.Аналитика
	|ГДЕ
	|	_Группировки.Порядок <> 20
	|
	|УПОРЯДОЧИТЬ ПО
	|	Категория,
	|	ВидАктива УБЫВ,
	|	АналитикаКод УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ГруппировкаКод),
	|	СУММА(СуммаНачала),
	|	СУММА(СуммаСЧАНачала),
	|	СУММА(СуммаКонец),
	|	СУММА(СуммаСЧАКонец),
	|	СУММА(ДоходыРасходы),
	|	СУММА(ДоходРасходРасчет),
	|	СУММА(Расчет),
	|	СУММА(СредневзвешеннаяСумма),
	|	СУММА(ПроизведениеДюрацииНаСумму),
	|	СУММА(ПроизведениеДюрацииНаСуммуВсего),
	|	СУММА(ПроизведениеYIELDCLOSEНаСумму),
	|	СУММА(СуммаДляРасчетаДюрацииПоГруппировкам),
	|	СУММА(СуммаДляРасчетаДюрацииВсего)
	|ПО
	|	ОБЩИЕ,
	|	ВидАктива,
	|	Валюта,
	|	ГруппировкаУправляющего1,
	|	ГруппировкаУправляющего2,
	|	ГруппировкаУправляющего3
	|АВТОУПОРЯДОЧИВАНИЕ";
#КонецОбласти	
	
	Макет = ПолучитьМакет("ОтчетУправляющего");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Основная");
	
	ОбластьИтог = Макет.ПолучитьОбласть("Итог|Основная");
	ОбластьВалюта = Макет.ПолучитьОбласть("Валюта|Основная");
	ОбластьВидАктива = Макет.ПолучитьОбласть("ВидАктива|Основная");
	ОбластьГруппировкаУправляющего1 = Макет.ПолучитьОбласть("ГруппировкаУправляющего1|Основная");
	ОбластьГруппировкаУправляющего2 = Макет.ПолучитьОбласть("ГруппировкаУправляющего2|Основная");
	ОбластьГруппировкаУправляющего3 = Макет.ПолучитьОбласть("ГруппировкаУправляющего3|Основная");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Основная"); 
	
	//доп области с Номером договора. Не стал переименовывать. Первоначально был код брокера
	ОбластьШапкаКБ = Макет.ПолучитьОбласть("Шапка|Договор");
	ОбластьИтогКБ = Макет.ПолучитьОбласть("Итог|Договор");
	ОбластьВалютаКБ = Макет.ПолучитьОбласть("Валюта|Договор");
	ОбластьВидАктиваКБ = Макет.ПолучитьОбласть("ВидАктива|Договор");
	ОбластьГруппировкаУправляющего1КБ = Макет.ПолучитьОбласть("ГруппировкаУправляющего1|Договор");
	ОбластьГруппировкаУправляющего2КБ = Макет.ПолучитьОбласть("ГруппировкаУправляющего2|Договор");
	ОбластьГруппировкаУправляющего3КБ = Макет.ПолучитьОбласть("ГруппировкаУправляющего3|Договор");
	ОбластьСтрокаКБ = Макет.ПолучитьОбласть("Строка|Договор"); 
	
	//и сразу их заполним
	ОбластьШапкаКБ.Параметры.НомерДоговора = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьИтогКБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьВалютаКБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьВидАктиваКБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьГруппировкаУправляющего1КБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьГруппировкаУправляющего2КБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьГруппировкаУправляющего3КБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора;
	ОбластьСтрокаКБ.Параметры.НомерДоговора  = вхСчетДоверительногоУправления.НомерДоговора; 
		

	//шапка
	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(вхСчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		
	ОбластьШапка.Параметры.НомерДоговора	= вхСчетДоверительногоУправления.НомерДоговора;	
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(вхСчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодОтчета 	= ПредставлениеПериода(ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП=Истина");
	ОбластьШапка.Параметры.ДнейОтчета 		= ДнейОтчета;
	
	ОбластьШапка.Параметры.УчредительУправления = НаименованияКлиента.КраткоеНаименование; 
	ОбластьШапка.Параметры.ДоверительныйУправляющий = ЭтотОбъект.Организация;
	
	ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьШапка, ОбластьШапкаКБ);
	
	Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока Выборка.Следующий() Цикл 
		
		СуммаСЧА = Выборка.СуммаСЧАКонец;  
		Если СуммаСЧА = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У счета доверительного управления " + вхСчетДоверительногоУправления + " (" + вхСчетДоверительногоУправления.НомерДоговора +") сумма СЧА на конец отчета равна 0. Отчет по этому клиенту не будет построен" );
			Прервать;
		КонецЕсли;
		
		ВыборкаВидАктива = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидАктива.Следующий() Цикл  
			
			ЗаполнитьЗначенияСвойств(ОбластьВидАктива.Параметры, ВыборкаВидАктива);
			Если ВыборкаВидАктива.СредневзвешеннаяСумма <> 0 Тогда 
				ОбластьВидАктива.Параметры.Доходность = Окр(ВыборкаВидАктива.ДоходыРасходы / ВыборкаВидАктива.СредневзвешеннаяСумма *100, 2); 
			КонецЕсли; 
			ОбластьВидАктива.Параметры.Доля = ВыборкаВидАктива.СуммаСЧАКонец / СуммаСЧА * 100;
			Если ВыборкаВидАктива.СуммаДляРасчетаДюрацииПоГруппировкам > 0 Тогда
				ОбластьВидАктива.Параметры.DURATION = ВыборкаВидАктива.ПроизведениеДюрацииНаСумму / ВыборкаВидАктива.СуммаДляРасчетаДюрацииПоГруппировкам;
			КонецЕсли;
			
			Если  ВыборкаВидАктива.ВидАктива = "Активы по справедливой стоимости" Тогда 
				Категория = "10";
			ИначеЕсли  ВыборкаВидАктива.ВидАктива = "Активы по амортизированной стоимости" Тогда
				Категория = "30";
			КонецЕсли;
			
			ОбластьВидАктива.Параметры.Категория = Категория; 
			ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьВидАктива, ОбластьВидАктиваКБ);
			
			ВыборкаВалюта = ВыборкаВидАктива.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВалюта.Следующий() Цикл   
				
				Если ВыборкаВалюта.Валюта = ЭтотОбъект.Организация.ВалютаУчета
					И ВыборкаВалюта.ВидАктива = "Активы по справедливой стоимости" Тогда 
					КатегорияЗнак1 = "1";
					НаименованиеРаздела = "РУБЛЕВЫЕ АКТИВЫ";
				ИначеЕсли ВыборкаВалюта.Валюта = ЭтотОбъект.Организация.ВалютаУчета
					И ВыборкаВалюта.ВидАктива = "Активы по амортизированной стоимости" Тогда
					КатегорияЗнак1 = "3";
					НаименованиеРаздела = "РУБЛЕВЫЕ АКТИВЫ";
				ИначеЕсли ВыборкаВалюта.Валюта <> ЭтотОбъект.Организация.ВалютаУчета
					И ВыборкаВалюта.ВидАктива = "Активы по справедливой стоимости" Тогда 
					КатегорияЗнак1 = "2";
					НаименованиеРаздела = "АКТИВЫ (" + ВыборкаВалюта.Валюта.Наименование + ")";
				ИначеЕсли ВыборкаВалюта.Валюта <> ЭтотОбъект.Организация.ВалютаУчета
					И ВыборкаВалюта.ВидАктива = "Активы по амортизированной стоимости" Тогда 
					КатегорияЗнак1 = "4";
					НаименованиеРаздела = "АКТИВЫ (" + ВыборкаВалюта.Валюта.Наименование + ")";
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ОбластьВалюта.Параметры, ВыборкаВалюта);
				Если ВыборкаВалюта.СредневзвешеннаяСумма <> 0 Тогда 
					ОбластьВалюта.Параметры.Доходность = Окр(ВыборкаВалюта.ДоходыРасходы / ВыборкаВалюта.СредневзвешеннаяСумма *100, 2);
				КонецЕсли;	
				ОбластьВалюта.Параметры.Доля = ВыборкаВалюта.СуммаСЧАКонец / СуммаСЧА * 100;
				Если ВыборкаВалюта.СуммаДляРасчетаДюрацииПоГруппировкам > 0 Тогда
					ОбластьВалюта.Параметры.DURATION = ВыборкаВалюта.ПроизведениеДюрацииНаСумму / ВыборкаВалюта.СуммаДляРасчетаДюрацииПоГруппировкам;
				КонецЕсли;    		
				ОбластьВалюта.Параметры.Категория = КатегорияЗнак1;
				ОбластьВалюта.Параметры.Валюта = НаименованиеРаздела;
				ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьВалюта, ОбластьВалютаКБ);
				
				ВыборкаГруппировкаУправляющего1 =  ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока  ВыборкаГруппировкаУправляющего1.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ОбластьГруппировкаУправляющего1.Параметры, ВыборкаГруппировкаУправляющего1); 
					Если ЗначениеЗаполнено(ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1) Тогда
						Если ВыборкаГруппировкаУправляющего1.СредневзвешеннаяСумма <> 0 Тогда 
							ОбластьГруппировкаУправляющего1.Параметры.Доходность = Окр(ВыборкаГруппировкаУправляющего1.ДоходыРасходы / ВыборкаГруппировкаУправляющего1.СредневзвешеннаяСумма *100, 2);
						КонецЕсли;
						ОбластьГруппировкаУправляющего1.Параметры.Доля = ВыборкаГруппировкаУправляющего1.СуммаСЧАКонец / СуммаСЧА * 100;
						Если ВыборкаГруппировкаУправляющего1.СуммаДляРасчетаДюрацииПоГруппировкам > 0 Тогда
							ОбластьГруппировкаУправляющего1.Параметры.DURATION = ВыборкаГруппировкаУправляющего1.ПроизведениеДюрацииНаСумму / ВыборкаГруппировкаУправляющего1.СуммаДляРасчетаДюрацииПоГруппировкам;
						КонецЕсли;
						Если ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Деньги" Тогда
							КатегорияЗнак2 = "3";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Депозиты" Тогда
							КатегорияЗнак2 = "2";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Акции" Тогда
							КатегорияЗнак2 = "1";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "ОФЗ"
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по справедливой стоимости" Тогда
							КатегорияЗнак2 = "4";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "ОФЗ"
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по амортизированной стоимости" Тогда
							КатегорияЗнак2 = "1";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Корпоративные" 
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по справедливой стоимости" Тогда
							КатегорияЗнак2 = "5";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Корпоративные"
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по амортизированной стоимости" Тогда
							КатегорияЗнак2 = "2";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Муниципальные"
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по справедливой стоимости"  Тогда
							КатегорияЗнак2 = "6";
						ИначеЕсли ВыборкаГруппировкаУправляющего1.ГруппировкаУправляющего1 = "Муниципальные"
							И ВыборкаГруппировкаУправляющего1.ВидАктива = "Активы по амортизированной стоимости" Тогда
							КатегорияЗнак2 = "3";
						КонецЕсли;
						ОбластьГруппировкаУправляющего1.Параметры.Категория = КатегорияЗнак1 + "." + КатегорияЗнак2;
						ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьГруппировкаУправляющего1, ОбластьГруппировкаУправляющего1КБ);
					КонецЕсли;  
					
					ВыборкаГруппировкаУправляющего2 =  ВыборкаГруппировкаУправляющего1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока  ВыборкаГруппировкаУправляющего2.Следующий() Цикл
						ЗаполнитьЗначенияСвойств(ОбластьГруппировкаУправляющего2.Параметры, ВыборкаГруппировкаУправляющего2); 
						Если ЗначениеЗаполнено(ВыборкаГруппировкаУправляющего2.ГруппировкаУправляющего2) Тогда 
							Если ВыборкаГруппировкаУправляющего2.СредневзвешеннаяСумма <> 0 Тогда 
								ОбластьГруппировкаУправляющего2.Параметры.Доходность = Окр(ВыборкаГруппировкаУправляющего2.ДоходыРасходы / ВыборкаГруппировкаУправляющего2.СредневзвешеннаяСумма *100, 2);
							КонецЕсли;
							ОбластьГруппировкаУправляющего2.Параметры.Доля = ВыборкаГруппировкаУправляющего2.СуммаСЧАКонец / СуммаСЧА * 100;
							Если ВыборкаГруппировкаУправляющего2.ГруппировкаУправляющего2 = "с фиксированным купоном" Тогда
								КатегорияЗнак3 = "1";
							ИначеЕсли ВыборкаГруппировкаУправляющего2.ГруппировкаУправляющего2 = "с плавающим купоном" Тогда
								КатегорияЗнак3 = "2";
							КонецЕсли; 
							Если ВыборкаГруппировкаУправляющего2.СуммаДляРасчетаДюрацииПоГруппировкам > 0 Тогда
								ОбластьГруппировкаУправляющего2.Параметры.DURATION = ВыборкаГруппировкаУправляющего2.ПроизведениеДюрацииНаСумму / ВыборкаГруппировкаУправляющего2.СуммаДляРасчетаДюрацииПоГруппировкам;
							КонецЕсли; 
							Если ВыборкаГруппировкаУправляющего2.СуммаДляРасчетаДюрацииПоГруппировкам > 0 
								И КатегорияЗнак3 = "1" Тогда   // этот показатель считаем только для облигаций с фиксированным купоном
								ОбластьГруппировкаУправляющего2.Параметры.YIELDCLOSE = ВыборкаГруппировкаУправляющего2.ПроизведениеYIELDCLOSEНаСумму / ВыборкаГруппировкаУправляющего2.СуммаДляРасчетаДюрацииПоГруппировкам;
							КонецЕсли; 

							ОбластьГруппировкаУправляющего2.Параметры.Категория = КатегорияЗнак1 + "." + КатегорияЗнак2 + "." + КатегорияЗнак3;
							ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьГруппировкаУправляющего2, ОбластьГруппировкаУправляющего2КБ);
						КонецЕсли;	
						
						ВыборкаГруппировкаУправляющего3 =  ВыборкаГруппировкаУправляющего2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока  ВыборкаГруппировкаУправляющего3.Следующий() Цикл
							ЗаполнитьЗначенияСвойств(ОбластьГруппировкаУправляющего3.Параметры, ВыборкаГруппировкаУправляющего3);
							Если ЗначениеЗаполнено(ВыборкаГруппировкаУправляющего3.ГруппировкаУправляющего3) Тогда
								Если ВыборкаГруппировкаУправляющего3.СредневзвешеннаяСумма <> 0 Тогда 
									ОбластьГруппировкаУправляющего3.Параметры.Доходность = Окр(ВыборкаГруппировкаУправляющего3.ДоходыРасходы / ВыборкаГруппировкаУправляющего3.СредневзвешеннаяСумма *100, 2);
								КонецЕсли;
								ОбластьГруппировкаУправляющего3.Параметры.Доля = ВыборкаГруппировкаУправляющего3.СуммаСЧАКонец / СуммаСЧА * 100;
								Если ВыборкаГруппировкаУправляющего3.СуммаДляРасчетаДюрацииПоГруппировкам > 0 Тогда
									ОбластьГруппировкаУправляющего3.Параметры.DURATION = ВыборкаГруппировкаУправляющего3.ПроизведениеДюрацииНаСумму / ВыборкаГруппировкаУправляющего3.СуммаДляРасчетаДюрацииПоГруппировкам;
								КонецЕсли;       
								Если ВыборкаГруппировкаУправляющего3.СуммаДляРасчетаДюрацииПоГруппировкам > 0 
									И КатегорияЗнак3 = "1" Тогда   // этот показатель считаем только для облигаций с фиксированным купоном
									ОбластьГруппировкаУправляющего3.Параметры.YIELDCLOSE = ВыборкаГруппировкаУправляющего3.ПроизведениеYIELDCLOSEНаСумму / ВыборкаГруппировкаУправляющего3.СуммаДляРасчетаДюрацииПоГруппировкам;
								КонецЕсли; 
								
								Если ВыборкаГруппировкаУправляющего3.ГруппировкаУправляющего3 = "до 3 лет" Тогда
									КатегорияЗнак4 = "1";
								ИначеЕсли ВыборкаГруппировкаУправляющего3.ГруппировкаУправляющего3 = "свыше 3 лет" Тогда
									КатегорияЗнак4 = "2";
								ИначеЕсли ВыборкаГруппировкаУправляющего3.ГруппировкаУправляющего3 = "от 3 до 5 лет" Тогда
									КатегорияЗнак4 = "2";
								ИначеЕсли ВыборкаГруппировкаУправляющего3.ГруппировкаУправляющего3 = "свыше 5 лет" Тогда
									КатегорияЗнак4 = "3";
								КонецЕсли; 
								ОбластьГруппировкаУправляющего3.Параметры.Категория = КатегорияЗнак1 + "." + КатегорияЗнак2 + "." + КатегорияЗнак3 + "." + КатегорияЗнак4;
								
								ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьГруппировкаУправляющего3, ОбластьГруппировкаУправляющего3КБ);
							КонецЕсли;
							
							ВыборкаАналитика =  ВыборкаГруппировкаУправляющего3.Выбрать(ОбходРезультатаЗапроса.Прямой);
							Пока  ВыборкаАналитика.Следующий() Цикл
								ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаАналитика); 
								ОбластьСтрока.Параметры.Доля = ВыборкаАналитика.СуммаСЧАКонец / СуммаСЧА * 100;  
								ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьСтрока, ОбластьСтрокаКБ);
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла; 
			КонецЦикла;
		КонецЦикла;
		
		//итого 
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка); 
		Если Выборка.СредневзвешеннаяСумма <> 0 Тогда 
			ОбластьИтог.Параметры.Доходность = Окр(Выборка.ДоходыРасходы / Выборка.СредневзвешеннаяСумма *100, 2);
		КонецЕсли;
		ОбластьИтог.Параметры.Доля = Выборка.СуммаСЧАКонец / СуммаСЧА * 100;
		Если Выборка.СуммаДляРасчетаДюрацииВсего > 0 Тогда
			ОбластьИтог.Параметры.DURATION = Выборка.ПроизведениеДюрацииНаСуммуВсего / Выборка.СуммаДляРасчетаДюрацииВсего;
		КонецЕсли;
		ВывестиОбластьВариантУправляющего(ДокументРезультат, ОбластьИтог, ОбластьИтогКБ);
		
	КонецЦикла;	
	
КонецПроцедуры     

Процедура ПечатьРасшифровка(Запрос, ДокументРасшифровка, ДнейВГоду)

	//расшифровка
	МакетРасшифрока = ПолучитьМакет("Расшифровка");
	
	ОбластьАктив = МакетРасшифрока.ПолучитьОбласть("Актив");
	ОбластьОперации = МакетРасшифрока.ПолучитьОбласть("Операции");
	ОбластьДоходность = МакетРасшифрока.ПолучитьОбласть("Доходность");
	ОбластьВидАктива = МакетРасшифрока.ПолучитьОбласть("ВидАктива");

#Область Запросец
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВидыАктивов.Наименование КАК ВидАктива,
		|	_Потоки.Порядок КАК Порядок,
		|	_Потоки.Период КАК Период,
		|	ЕСТЬNULL(_Аналитики.Аналитика, _Потоки.Аналитика) КАК Аналитика,
		|	_Потоки.Сумма КАК ДоходРасход,
		|	_Потоки.Дней КАК Дней,
		|	_Потоки.Сумма * _Потоки.Дней КАК Расчет,
		|	_Потоки.Операция КАК Операция,
		|	_Потоки.Документ КАК Документ,
		|	ВЫБОР
		|		КОГДА _Потоки.Валюта = &ВалютаРубль
		|			ТОГДА """"
		|		ИНАЧЕ _Потоки.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ВЫБОР
		|		КОГДА _Потоки.Валюта = &ВалютаРубль
		|			ТОГДА """"
		|		ИНАЧЕ _Потоки.СуммаВал
		|	КОНЕЦ КАК СуммаВал,
		|	ВЫБОР
		|		КОГДА _Потоки.Валюта = &ВалютаРубль
		|			ТОГДА """"
		|		ИНАЧЕ _Потоки.Курс
		|	КОНЕЦ КАК Курс
		|ИЗ
		|	_Потоки КАК _Потоки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Аналитики КАК _Аналитики
		|		ПО _Потоки.Аналитика = _Аналитики.КодАналитии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыАктивов КАК _ВидыАктивов
		|		ПО _Потоки.ВидАктива = _ВидыАктивов.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидАктива,
		|	Порядок,
		|	Период,
		|	Аналитика
		|ИТОГИ
		|	СУММА(ДоходРасход),
		|	СУММА(Расчет)
		|ПО
		|	ВидАктива,
		|	Порядок,
		|	Аналитика
		|АВТОУПОРЯДОЧИВАНИЕ";
	
#КонецОбласти	
	ВыборкаАктивы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАктивы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьВидАктива.Параметры, ВыборкаАктивы);
		ДокументРасшифровка.Вывести(ОбластьВидАктива); 
		ДокументРасшифровка.НачатьГруппуСтрок(, Ложь);
		
		ВыборкаПорядок = ВыборкаАктивы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаПорядок.Следующий() Цикл       //порядок. не обрабатываем группировку
			
			ВыборкаРаздел = ВыборкаПорядок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			
			Пока ВыборкаРаздел.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьАктив.Параметры, ВыборкаРаздел); 
				ДокументРасшифровка.Вывести(ОбластьАктив);
				ДокументРасшифровка.НачатьГруппуСтрок(, Ложь);
				
				ВыборкаОперации = ВыборкаРаздел.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаОперации.Следующий() Цикл 
					ЗаполнитьЗначенияСвойств(ОбластьОперации.Параметры, ВыборкаОперации); 
					ДокументРасшифровка.Вывести(ОбластьОперации);
				КонецЦикла;
				
				// по деньгам доход/расход считается только по оплатам комиссии. 
				//Если ВыборкаРаздел.ДоходРасходДеньги = 0 Тогда  
				СуммаДоходРасход = ВыборкаРаздел.ДоходРасход;
				//Иначе	
				//	СуммаДоходРасход = ВыборкаРаздел.ДоходРасходДеньги;
				//КонецЕсли;	
				
				ОбластьДоходность.Параметры.ДоходРасход = СуммаДоходРасход;
				ОбластьДоходность.Параметры.Расчет = ВыборкаРаздел.Расчет;
				ОбластьДоходность.Параметры.Средневзвес = Окр(ВыборкаРаздел.Расчет/ДнейВГоду, 2);
				Если ВыборкаРаздел.Расчет <> 0 Тогда 
					ОбластьДоходность.Параметры.Доходность = Окр(СуммаДоходРасход / (ВыборкаРаздел.Расчет/ДнейВГоду)*100, 2);
				КонецЕсли;	
				ДокументРасшифровка.Вывести(ОбластьДоходность);
				ДокументРасшифровка.ЗакончитьГруппуСтрок();
			КонецЦикла;
		КонецЦикла; 
		ДокументРасшифровка.ЗакончитьГруппуСтрок();
	КонецЦикла;
	//ДокументРасшифровка.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры
