
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// если расчетный счет закрыт, то исполнитель тоже должен быть закрыт
		ДатаЗакрытияСчета = Запись.РасчетныйСчет.ДатаЗакрытия;
		
		Если ЗначениеЗаполнено(ДатаЗакрытияСчета) Тогда
			Если Запись.ДатаЗакрытия > ДатаЗакрытияСчета Или Не ЗначениеЗаполнено(Запись.ДатаЗакрытия) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя по р/счету «" + Запись.РасчетныйСчет + "» не должна быть позднее даты закрытия счета " + Формат(ДатаЗакрытияСчета, "ДФ=dd.MM.yyyy"),,,, Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	КонтрольВидаБанковскихСчетов(Отказ);
	
КонецПроцедуры // ПередЗаписью

Процедура КонтрольВидаБанковскихСчетов(Отказ)
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если ЭтотОбъект[0].Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
			//Проверка только для управляющих компаний
			//ДК ошибочно попадает в проверку. Технический долг #Архитектор и #Аналитик
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(Исполнители.Организация КАК Справочник.Организации) КАК Организация,
			|	ВЫРАЗИТЬ(Исполнители.РасчетныйСчет КАК Справочник.БанковскиеСчета) КАК РасчетныйСчет,
			|	ВЫРАЗИТЬ(Исполнители.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления) КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ ВТ_Исполнители
			|ИЗ
			|	&Исполнители КАК Исполнители
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ИСТИНА КАК ЛицензияУказана,
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности КАК ВидДеятельности,
			|	МАКСИМУМ(ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует) КАК Действует
			|ПОМЕСТИТЬ _ВидыДеятельностиЛицензий
			|ИЗ
			|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
			|ГДЕ
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления,
			|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ВидДеятельности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_Исполнители.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВТ_Исполнители.РасчетныйСчет КАК РасчетныйСчет,
			|	ЕСТЬNULL(ВсеВидыЛицензий.ЛицензияУказана, ЛОЖЬ) КАК ЛицензияУказана,
			|	ВЫБОР
			|		КОГДА ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.РасчетныйСчет) = ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета
			|		ИНАЧЕ ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетДоверительногоУправления), ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.Иное))
			|	КОНЕЦ КАК КонтрольВидБанковскогоСчета,
			|	ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|		ИЛИ ЕСТЬNULL(_ВидыДеятельностиЛицензий.Действует, ЛОЖЬ) КАК КонтрольВидУправленияДовереннымиСредствами,
			|	ВТ_Исполнители.РасчетныйСчет.ЮрФизЛицо = ВТ_Исполнители.Организация.ЮрФизЛицо КАК ВладелецСчетаУК
			|ИЗ
			|	ВТ_Исполнители КАК ВТ_Исполнители
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УправляющиеКомпании КАК УправляющиеКомпании
			|		ПО ВТ_Исполнители.Организация.ЮрФизЛицо = УправляющиеКомпании.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ВидыДеятельностиЛицензий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|			_ВидыДеятельностиЛицензий.ЛицензияУказана КАК ЛицензияУказана
			|		ИЗ
			|			_ВидыДеятельностиЛицензий КАК _ВидыДеятельностиЛицензий) КАК ВсеВидыЛицензий
			|		ПО ВТ_Исполнители.СчетДоверительногоУправления = ВсеВидыЛицензий.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВидыДеятельностиЛицензий КАК _ВидыДеятельностиЛицензий
			|		ПО ВТ_Исполнители.СчетДоверительногоУправления = _ВидыДеятельностиЛицензий.СчетДоверительногоУправления
			|			И ВТ_Исполнители.РасчетныйСчет.ВидУправленияДовереннымиСредствами = _ВидыДеятельностиЛицензий.ВидДеятельности
			|ГДЕ
			|	(НЕ ВсеВидыЛицензий.ЛицензияУказана
			|			ИЛИ НЕ ВЫБОР
			|					КОГДА ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.РасчетныйСчет) = ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета
			|					ИНАЧЕ ВТ_Исполнители.РасчетныйСчет.ВидБанковскогоСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.СчетДоверительногоУправления), ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.Иное))
			|				КОНЕЦ
			|			ИЛИ НЕ(ВТ_Исполнители.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
			|					ИЛИ ЕСТЬNULL(_ВидыДеятельностиЛицензий.Действует, ЛОЖЬ))
			|			ИЛИ НЕ ВТ_Исполнители.РасчетныйСчет.ЮрФизЛицо = ВТ_Исполнители.Организация.ЮрФизЛицо)";
		
		Запрос.УстановитьПараметр("Исполнители", ЭтотОбъект.Выгрузить(, "Организация,РасчетныйСчет,СчетДоверительногоУправления"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ЛицензияУказана Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета внутреннего учёта '" + Строка(Выборка.СчетДоверительногоУправления) + "' не задана лицензия, в рамках которой осуществляется управление активами",,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения = "";
			Если НЕ Выборка.ВладелецСчетаУК Тогда
				ТекстСообщения = " текущая организация не является владельцем счета";
			ИначеЕсли НЕ Выборка.КонтрольВидБанковскогоСчета И НЕ Выборка.КонтрольВидУправленияДовереннымиСредствами Тогда
				ТекстСообщения = " неверно указан 'Вид банковского счета' и поле 'Управление средствами' не соответствует условиям договора доверительного управления";
			ИначеЕсли НЕ Выборка.КонтрольВидБанковскогоСчета Тогда
				ТекстСообщения = " неверно указан 'Вид банковского счета'";
			Иначе
				ТекстСообщения = " поле 'Управление средствами' не соответствует условиям договора доверительного управления";
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В расчётном счёте " + Выборка.РасчетныйСчет + ТекстСообщения,,,, Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

