Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеДляКорректировки, "ВидЗадолженности");
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.КорректировкаЗадолженности.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления, 
		ДанныеОснования.ВидЗадолженности, 
		УчетныйРегистр, 
		Отказ, Истина);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);         	
	
	Движения[УчетныйРегистр].Записать();
	
КонецПроцедуры

Процедура УстановитьБлокировки(ВидЗадолженности, Валюта, ВестиУчетНДС)
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	// задолженность по д/с
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности",             ВидЗадолженности);
	ЭлементБлокировкиДанных.УстановитьЗначение("Контрагент",             	   ЭтотОбъект.Контрагент);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",             	       Валюта);
	
	Если ВестиУчетНДС  Тогда
	
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("Контрагент",             	   РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
		ЭлементБлокировкиДанных.УстановитьЗначение("Аванс",       			       Ложь);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности",             Справочники.ВидыЗадолженности.НДСПоАвансам);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",             	       ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
		
	КонецЕсли;
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	ВестиУчетНДС = РаботаСНДС.ВестиУчетНДС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	ИФНС = РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина); 
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.ОснованиеДляКорректировки, "ВидЗадолженности, Валюта");
	ВидЗадолженности 	 = ДанныеДокумента.ВидЗадолженности;
	Валюта 				 = ДанныеДокумента.Валюта;
	
	ТипЗадолженности = Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ВидЗадолженности);
	ТипЗадолженностикЗачету = ?(ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская, Перечисления.ТипыЗадолженности.Дебиторская);
	
	УстановитьБлокировки(ВидЗадолженности, Валюта, ВестиУчетНДС);
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать	= Истина;
	Движения.ПлановыеДатыОплат.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.КорректировкаЗадолженности.ПодготовитьДанныеПроведения(ЭтотОбъект.Ссылка, Запрос, ТипЗадолженности, ДанныеДокумента, ВестиУчетНДС);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Дата КАК Период,
		|	_ПоДокументу.ОснованиеДо КАК Основание,
		|	&ТипЗадолженности КАК ТипЗадолженности,
		|	&ВидЗадолженности КАК ВидЗадолженности,
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Валюта КАК Валюта,
		|	&Контрагент КАК Контрагент,
		|	ЛОЖЬ КАК Аванс,
		|	ВЫБОР
		|		КОГДА _ПоДокументу.ОснованиеДо = _ПоДокументу.ОснованиеПосле
		|			ТОГДА _ПоДокументу.СуммаПосле - _ПоДокументу.СуммаДо
		|		ИНАЧЕ -_ПоДокументу.СуммаДо
		|	КОНЕЦ КАК Сумма,
		|	0 КАК СуммаКупона,
		|	""Корректировка стоимости услуг"" КАК Содержание
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Дата,
		|	_ПоДокументу.ОснованиеПосле,
		|	&ТипЗадолженности,
		|	&ВидЗадолженности,
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&Контрагент,
		|	ЛОЖЬ,
		|	_ПоДокументу.СуммаПосле,
		|	0,
		|	""Отражение стоимости услуг при замене основания ""
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу
		|ГДЕ
		|	_ПоДокументу.ОснованиеДо <> _ПоДокументу.ОснованиеПосле
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&Дата,
		|	_ВозникновениеАвансов.ОснованиеДо,
		|	&ТипЗадолженности,
		|	&ВидЗадолженности,
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&Контрагент,
		|	ЛОЖЬ,
		|	-_ВозникновениеАвансов.Сумма,
		|	0,
		|	""Учет образовавшейся предоплаты""
		|ИЗ
		|	_ВозникновениеАвансов КАК _ВозникновениеАвансов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Дата,
		|	&Ссылка,
		|	ВЫБОР
		|		КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	КОНЕЦ,
		|	&ВидЗадолженности,
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&Контрагент,
		|	ИСТИНА,
		|	_ВозникновениеАвансов.Сумма,
		|	0,
		|	""Учет образовавшейся предоплаты""
		|ИЗ
		|	_ВозникновениеАвансов КАК _ВозникновениеАвансов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Дата,
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям),
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&ИФНС,
		|	ЛОЖЬ,
		|	_ИзменениеНДС.ДельтаСуммаНДС,
		|	0,
		|	""Корректировка входного НДС""
		|ИЗ
		|	_ИзменениеНДС КАК _ИзменениеНДС
		|ГДЕ
		|	&ВестиУчетНДС
		|	И &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&Дата,
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям),
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&ИФНС,
		|	ЛОЖЬ,
		|	_ИзменениеНДС.ДельтаСуммаНДС,
		|	0,
		|	ВЫБОР
		|		КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|			ТОГДА ""Восстановление НДС по приобретенным товарам""
		|		ИНАЧЕ ""Предъявление к вычету входного НДС в связи с увеличением стоимости товаров""
		|	КОНЕЦ
		|ИЗ
		|	_ИзменениеНДС КАК _ИзменениеНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЗадолженностиНДС КАК _ОстаткиЗадолженностиНДС
		|		ПО _ИзменениеНДС.ОснованиеДо = _ОстаткиЗадолженностиНДС.Основание
		|			И (_ОстаткиЗадолженностиНДС.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям))
		|ГДЕ
		|	_ОстаткиЗадолженностиНДС.Основание ЕСТЬ NULL
		|	И &ВестиУчетНДС
		|	И &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Дата,
		|	&Ссылка,
		|	ВЫБОР
		|		КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ВЫБОР
		|					КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода),
		|	&Организация,
		|	&СчетДоверительногоУправления,
		|	&Валюта,
		|	&ИФНС,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|			ТОГДА -_ИзменениеНДС.ДельтаСуммаНДС
		|		ИНАЧЕ _ИзменениеНДС.ДельтаСуммаНДС
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ВЫБОР
		|					КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|						ТОГДА ""Восстановление НДС по приобретенным товарам""
		|					ИНАЧЕ ""Предъявление к вычету входного НДС в связи с увеличением стоимости товаров""
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ИзменениеНДС.ДельтаСуммаНДС < 0
		|					ТОГДА ""Вычет НДС при уменьшении стоимости отгруженных ТРУ""
		|				ИНАЧЕ ""Учет суммы НДС с корректировки выручки""
		|			КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	_ИзменениеНДС КАК _ИзменениеНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЗадолженностиНДС КАК _ОстаткиЗадолженностиНДС
		|		ПО _ИзменениеНДС.ОснованиеДо = _ОстаткиЗадолженностиНДС.Основание
		|			И (_ОстаткиЗадолженностиНДС.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям))
		|ГДЕ
		|	_ОстаткиЗадолженностиНДС.Основание ЕСТЬ NULL
		|	И &ВестиУчетНДС";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	ТаблицаЗачетов = Документы.КорректировкаЗадолженности.ПодготовитьТаблицуЗачетаАвансов(Запрос);
	
	Для Каждого СтрокаЗачета из ТаблицаЗачетов Цикл
		
		//движения
		ЗаписьЗадолженности = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		ЗаписьЗадолженности.Период = Дата;
		ЗаписьЗадолженности.Организация = ЭтотОбъект.Организация;
		ЗаписьЗадолженности.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		ЗаписьЗадолженности.Основание = СтрокаЗачета.ДокументЗадолженности;
		ЗаписьЗадолженности.ТипЗадолженности = ТипЗадолженности;
		ЗаписьЗадолженности.ВидЗадолженности = ВидЗадолженности;
		ЗаписьЗадолженности.Валюта = Валюта;
		ЗаписьЗадолженности.Контрагент = ЭтотОбъект.Контрагент;
		ЗаписьЗадолженности.Аванс = Ложь;
		ЗаписьЗадолженности.Сумма = СтрокаЗачета.Сумма;
		ЗаписьЗадолженности.СуммаКупона = 0;
		
		ЗаписьЗадолженности = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
		ЗаписьЗадолженности.Период = Дата;
		ЗаписьЗадолженности.Организация = ЭтотОбъект.Организация;
		ЗаписьЗадолженности.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		ЗаписьЗадолженности.Основание = СтрокаЗачета.ДокументОплаты;
		ЗаписьЗадолженности.ТипЗадолженности = ТипЗадолженностиКЗачету;
		ЗаписьЗадолженности.ВидЗадолженности = ВидЗадолженности;
		ЗаписьЗадолженности.Валюта = Валюта;
		ЗаписьЗадолженности.Контрагент = ЭтотОбъект.Контрагент;
		ЗаписьЗадолженности.Аванс = Истина;
		ЗаписьЗадолженности.Сумма = СтрокаЗачета.Сумма;
		ЗаписьЗадолженности.СуммаКупона = 0;
		
		Если ВестиУчетНДС И ЗначениеЗаполнено(СтрокаЗачета.ДокументАвансовыйСчетФактура) Тогда
			
			ЗаписьЗадолженности = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
			ЗаписьЗадолженности.Период = Дата;
			ЗаписьЗадолженности.Организация = ЭтотОбъект.Организация;
			ЗаписьЗадолженности.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			ЗаписьЗадолженности.Основание = СтрокаЗачета.ДокументАвансовыйСчетФактура;
			ЗаписьЗадолженности.ТипЗадолженности = ТипЗадолженности;
			ЗаписьЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСПоАвансам;
			ЗаписьЗадолженности.Валюта = Валюта;
			ЗаписьЗадолженности.Контрагент = ИФНС;
			ЗаписьЗадолженности.Аванс = Ложь;
			ЗаписьЗадолженности.Сумма = СтрокаЗачета.СуммаНДС;
			ЗаписьЗадолженности.СуммаКупона = 0;
			
			ЗаписьЗадолженности = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			ЗаписьЗадолженности.Период = Дата;
			ЗаписьЗадолженности.Организация = ЭтотОбъект.Организация;
			ЗаписьЗадолженности.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			ЗаписьЗадолженности.Основание = СтрокаЗачета.ДокументАвансовыйСчетФактура;
			ЗаписьЗадолженности.ТипЗадолженности = ТипЗадолженности;
			ЗаписьЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСТекущегоПериода;
			ЗаписьЗадолженности.Валюта = Валюта;
			ЗаписьЗадолженности.Контрагент = ИФНС;
			ЗаписьЗадолженности.Аванс = Ложь;
			ЗаписьЗадолженности.Сумма = СтрокаЗачета.СуммаНДС;
			ЗаписьЗадолженности.СуммаКупона = 0;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЭтотОбъект.ЭтоОтмена Тогда
		//сдвинем плановые даты погашения задолженности
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ПоДокументу.ОснованиеПосле КАК ОснованиеПосле,
			|	_ПоДокументу.ДатаОплатыПосле КАК ДатаОплатыПосле
			|ИЗ
			|	_ПоДокументу КАК _ПоДокументу
			|ГДЕ
			|	_ПоДокументу.ОснованиеПосле <> НЕОПРЕДЕЛЕНО
			|	И _ПоДокументу.ДатаОплатыПосле <> ДАТАВРЕМЯ(1, 1, 1)
			|	И (_ПоДокументу.ДатаОплатыДо <> _ПоДокументу.ДатаОплатыПосле
			|			ИЛИ _ПоДокументу.ОснованиеПосле <> _ПоДокументу.ОснованиеДо)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ПлановыеДатыОплат.Добавить();
			Движение.Период = Дата;
			Движение.Организация = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ВидЗадолженности = ВидЗадолженности;
			Движение.Валюта = Валюта;
			Движение.Основание = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОснованиеПосле), ВыборкаДетальныеЗаписи.ОснованиеПосле, ЭтотОбъект.Ссылка);
			Движение.ДатаОплаты = ВыборкаДетальныеЗаписи.ДатаОплатыПосле;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НуженВходящийДокумент() Экспорт
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОснованиеДляКорректировки) Тогда
		Возврат НЕ Справочники.ВидыЗадолженности.ЭтоИсходящаяУслуга(ЭтотОбъект.ОснованиеДляКорректировки.ВидЗадолженности);
	Иначе
		Возврат Ложь;
	КонецЕсли;
			
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления;
		ЭтотОбъект.ОснованиеДляКорректировки 	= ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.Контрагент 					= ДанныеЗаполнения.Контрагент;
		ЭтотОбъект.Договор 						= ДанныеЗаполнения.Договор;
		ЭтотОбъект.ЭтоОтмена 					= Ложь;
		
		Для Каждого СтрокаЗаполнения Из ДанныеЗаполнения.Основания Цикл
			Строка = ЭтотОбъект.Основания.Добавить();
			Строка.ОснованиеДо 			= СтрокаЗаполнения.Основание;
			Строка.ОснованиеПосле 		= СтрокаЗаполнения.Основание;
			Строка.СодержаниеДо 		= СтрокаЗаполнения.Содержание;
			Строка.СодержаниеПосле 		= СтрокаЗаполнения.Содержание;
			Строка.ДатаОплатыДо 		= СтрокаЗаполнения.ДатаОплаты;
			Строка.ДатаОплатыПосле 		= СтрокаЗаполнения.ДатаОплаты;
			Строка.ЦеннаяБумагаДо 		= СтрокаЗаполнения.ЦеннаяБумага;
			Строка.ЦеннаяБумагаПосле 	= СтрокаЗаполнения.ЦеннаяБумага;
			Строка.СуммаДо 				= СтрокаЗаполнения.Сумма;
			Строка.СуммаПосле 			= СтрокаЗаполнения.Сумма;
			Строка.СтавкаНДСДо 			= СтрокаЗаполнения.СтавкаНДС;
			Строка.СтавкаНДСПосле 		= СтрокаЗаполнения.СтавкаНДС;
			Строка.СуммаНДСДо 			= СтрокаЗаполнения.СуммаНДС;
			Строка.СуммаНДСПосле 		= СтрокаЗаполнения.СуммаНДС;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВидВходящегоДокумента) Тогда
		ПроверяемыеРеквизиты.Добавить("НомерВходящегоДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаВходящегоДокумента");
	КонецЕсли;
		
	Если ТипЗнч(ЭтотОбъект.ОснованиеДляКорректировки) = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.ОснованиеДляКорректировки, "ВидЗадолженности");
		
		Если ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде Тогда
			ИндексДатыПолучения = ПроверяемыеРеквизиты.Найти("ДатаПолученияДокумента");
			Если ИндексДатыПолучения <> Неопределено Тогда 
				ПроверяемыеРеквизиты.Удалить(ИндексДатыПолучения);
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
			ИндексДоговора = ПроверяемыеРеквизиты.Найти("Договор");
			Если ИндексДоговора <> Неопределено Тогда 
				ПроверяемыеРеквизиты.Удалить(ИндексДоговора);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ТипЗнч(ЭтотОбъект.ОснованиеДляКорректировки) <> Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализована корректировка на основании документа вида " + ТипЗнч(ЭтотОбъект.ОснованиеДляКорректировки), ЭтотОбъект.Ссылка,,,Отказ); 
			Возврат;
		КонецЕсли;
		
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.ОснованиеДляКорректировки, "Контрагент, Договор, Предварительно, ВидЗадолженности, Валюта");
		
		Если ДанныеДокумента.Валюта <> Организация.ВалютаУчета Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение валютных корректировок не реализовано!", ЭтотОбъект.Ссылка,,,Отказ);
		КонецЕсли;	
		
		Если ДанныеДокумента.Предварительно Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализованы корректировки для предварительной задолженности", ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.Контрагент <> ЭтотОбъект.Контрагент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент корректировки и основания должен совпадать!", ЭтотОбъект.Ссылка,, "Объект.Контрагент", Отказ);
		КонецЕсли;
		Если ДанныеДокумента.Договор <> ЭтотОбъект.Договор Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор корректировки и основания должен совпадать!", ЭтотОбъект.Ссылка,, "Объект.Договор", Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделке
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоФорвардуПоставки
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоТорговойКомиссии
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
			//нужна привязка к бумаге, в движениях не реализовано
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализованы корректировки для вида задолженности " + ДанныеДокумента.ВидЗадолженности, ЭтотОбъект.Ссылка,,, Отказ);
		ИначеЕсли Не (ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.КомиссияБанкаЗаПереводДС
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыНаКоммунальныеУслуги
			ИЛИ ДанныеДокумента.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоСодержаниюНедвижимости) Тогда
			//эти виды задолженности проверены, движения формируются корректно
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализованы корректировки для вида задолженности " + ДанныеДокумента.ВидЗадолженности, ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТабличнаяЧастьКорректировки.ОснованиеДо КАК ОснованиеДо,
		|	_ТабличнаяЧастьКорректировки.СодержаниеДо КАК СодержаниеДо,
		|	_ТабличнаяЧастьКорректировки.ДатаОплатыДо КАК ДатаОплатыДо,
		|	_ТабличнаяЧастьКорректировки.ЦеннаяБумагаДо КАК ЦеннаяБумагаДо,
		|	_ТабличнаяЧастьКорректировки.СуммаДо КАК СуммаДо,
		|	_ТабличнаяЧастьКорректировки.СтавкаНДСДо КАК СтавкаНДСДо,
		|	_ТабличнаяЧастьКорректировки.СуммаНДСДо КАК СуммаНДСДо
		|ПОМЕСТИТЬ _ТабличнаяЧастьКорректировки
		|ИЗ
		|	&ТабличнаяЧастьКорректировки КАК _ТабличнаяЧастьКорректировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженностиОснования.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	(ВЫБРАТЬ
		|		НачислениеЗадолженностиОснования.Ссылка КАК Ссылка,
		|		НачислениеЗадолженностиОснования.НомерСтроки КАК НомерСтроки,
		|		НачислениеЗадолженностиОснования.Основание КАК Основание,
		|		НачислениеЗадолженностиОснования.Содержание КАК Содержание,
		|		НачислениеЗадолженностиОснования.ДатаОплаты КАК ДатаОплаты,
		|		НачислениеЗадолженностиОснования.ЦеннаяБумага КАК ЦеннаяБумага,
		|		НачислениеЗадолженностиОснования.Сумма КАК Сумма,
		|		НачислениеЗадолженностиОснования.СтавкаНДС КАК СтавкаНДС,
		|		НачислениеЗадолженностиОснования.СуммаНДС КАК СуммаНДС
		|	ИЗ
		|		Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|	ГДЕ
		|		НачислениеЗадолженностиОснования.Ссылка = &ОснованиеДляКорректировки) КАК НачислениеЗадолженностиОснования
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ТабличнаяЧастьКорректировки КАК _ТабличнаяЧастьКорректировки
		|		ПО НачислениеЗадолженностиОснования.Основание = _ТабличнаяЧастьКорректировки.ОснованиеДо
		|			И НачислениеЗадолженностиОснования.Содержание = _ТабличнаяЧастьКорректировки.СодержаниеДо
		|			И НачислениеЗадолженностиОснования.ДатаОплаты = _ТабличнаяЧастьКорректировки.ДатаОплатыДо
		|			И НачислениеЗадолженностиОснования.ЦеннаяБумага = _ТабличнаяЧастьКорректировки.ЦеннаяБумагаДо
		|			И НачислениеЗадолженностиОснования.Сумма = _ТабличнаяЧастьКорректировки.СуммаДо
		|			И НачислениеЗадолженностиОснования.СтавкаНДС = _ТабличнаяЧастьКорректировки.СтавкаНДСДо
		|			И НачислениеЗадолженностиОснования.СуммаНДС = _ТабличнаяЧастьКорректировки.СуммаНДСДо
		|ГДЕ
		|	_ТабличнаяЧастьКорректировки.ОснованиеДо ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ОснованиеДляКорректировки", ЭтотОбъект.ОснованиеДляКорректировки);
		Запрос.УстановитьПараметр("ТабличнаяЧастьКорректировки", ЭтотОбъект.Основания.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружена строка, соответствующая строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " исходного документа!", ЭтотОбъект.Ссылка,,,Отказ);
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти