
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
		
	Объект.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
		
	Если ЭтаФорма.Параметры.Свойство("ЦеннаяБумага") Тогда
		Объект.ЦеннаяБумага = ЭтаФорма.Параметры.ЦеннаяБумага;
		ЭтаФорма.ОтборПоЦеннойБумаге = Истина;
	КонецЕсли;
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ТипИсточникаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		ПроверяемыеРеквизиты.Добавить("ЦеннаяБумага");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦеннойБумагеПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		Объект.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗагрузитьИндексы(Команда)
	ЗагрузитьИндексы();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьИндексыИзМатрикс(Команда)
	ЗагрузитьИндексыИзМатрикс();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьСписокИндексаММВБ(Команда)
	ЗагрузитьСписокИндексаММВБ();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКБДММВБ(Команда)
	ЗагрузитьКБДММВБ();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКБДГосударственныхОблигацийСША(Команда)
	ЗагрузитьКБДГосударственныхОблигацийСША();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКБДГосударственныхОблигацийЗоныЕвро(Команда)
	ЗагрузитьКБДГосударственныхОблигацийЗоныЕвро();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьROISfix(Команда)
	ЗагрузитьROISfix();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьRUONIA(Команда)
	ЗагрузитьRUONIA();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьСрочнаяRUONIA(Команда)
	ЗагрузитьСрочнаяRUONIA();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьMosPrime(Команда)
	ЗагрузитьMosPrime();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьИнформациюОВнебиржевыхСделках(Команда)
	ЗагрузитьИнформациюОВнебиржевыхСделках();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьПараметрыКривойБескупоннойДоходности(Команда)
	ЗагрузитьПараметрыКривойБескупоннойДоходности();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьВсе(Команда)
	ЗагрузитьВсе();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьИндексы(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьЗначенияИндексов(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИндексыИзМатрикс(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьЗначенияИндексовИзМатрикс(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКБДММВБ(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьЗначенияКБДММВБ(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКБДГосударственныхОблигацийСША(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьКБДГосударственныхОблигацийСША(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКБДГосударственныхОблигацийЗоныЕвро(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьКБДГосударственныхОблигацийЗоныЕвро(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьROISfix(ОбработкаОбъект = Неопределено)
	
	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьЗначенияROISfix(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИнформациюОВнебиржевыхСделках(ОбработкаОбъект = Неопределено)
	
	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьИнформациюОВнебиржевыхСделках(ЭтаФорма.ИмпортироватьТолькоОтсутствующиеКотировки);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыКривойБескупоннойДоходности(ОбработкаОбъект = Неопределено)
	
	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьПараметрыКривойБескупоннойДоходности(Истина);
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокИндексаММВБ(ОбработкаОбъект = Неопределено)
	
	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьСписокИндексаММВБ();
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьRUONIA(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьRUONIA();
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСрочнаяRUONIA(ОбработкаОбъект = Неопределено)

	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьСрочнуюRUONIA();
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьMosPrime(ОбработкаОбъект = Неопределено)
	
	ОчиститьОбъект = (ОбработкаОбъект = Неопределено);
	
	Если ОчиститьОбъект Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьЗначенияMosPrime();
	
	Если ОчиститьОбъект Тогда
		УдалитьИнформациюОбОшибках(ОбработкаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВсе()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	ЗагрузитьИндексы(ОбработкаОбъект);
	ЗагрузитьИндексыИзМатрикс(ОбработкаОбъект);
	ЗагрузитьКБДММВБ(ОбработкаОбъект);
	ЗагрузитьКБДГосударственныхОблигацийСША(ОбработкаОбъект);
	ЗагрузитьКБДГосударственныхОблигацийЗоныЕвро(ОбработкаОбъект);	
	ЗагрузитьИнформациюОВнебиржевыхСделках(ОбработкаОбъект);
		
	УдалитьИнформациюОбОшибках(ОбработкаОбъект);	
	
КонецПроцедуры

#Область Служебные_и_вспомогательные_функции

&НаСервере
Процедура УдалитьИнформациюОбОшибках(ОбработкаОбъект, ОчиститьПеременную = Истина)

	Если ОбработкаОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ОбработкаОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;

	Если ОчиститьПеременную Тогда
		ОбработкаОбъект = Неопределено
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
