&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПисьмоТема			= Параметры.Тема;
	ПисьмоОтправитель	= Параметры.Отправитель;
	ПисьмоПолучатели	= Параметры.Получатели;
	ПисьмоКопии			= Параметры.Копии;
	ПисьмоСлепыеКопии	= Параметры.СлепыеКопии;
	
	Если Параметры.Тексты.Количество() Тогда
		ОписаниеТелаПисьма	= Параметры.Тексты[0];
		ПисьмоТело			= ОписаниеТелаПисьма.Получить("Текст");
		
		Если ОписаниеТелаПисьма.Получить("ТипТекста") = "HTML" Тогда
			Элементы.ПисьмоТело.Вид = ВидПоляФормы.ПолеHTMLДокумента;	
		ИначеЕсли ОписаниеТелаПисьма.Получить("ТипТекста") = "РазмеченныйТекст" Тогда
			Элементы.ПисьмоТело.Вид = ВидПоляФормы.ПолеФорматированногоДокумента;
		Иначе
			Элементы.ПисьмоТело.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;	
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПисьмоТело.ТолькоПросмотр = (Элементы.ПисьмоТело.Вид <> ВидПоляФормы.ПолеHTMLДокумента);	
	
	Для Каждого Вложение Из Параметры.Вложения Цикл
		СтрокаВложение = ПисьмоВложения.Добавить();
		СтрокаВложение.Данные	= Вложение.Значение;
		СтрокаВложение.ИмяФайла = Вложение.Ключ;
		СтрокаВложение.РазмерФайла = Формат(СтрДлина(Base64Строка(Вложение.Значение)), "ЧДЦ=0; ЧС=3; ЧФ='Ч КБ'"); // Вложение.Данные.Размер()
	КонецЦикла;
	
	ЭтаФорма.Заголовок		= ПисьмоТема;
	ЭтаФорма.ТолькоПросмотр	= Истина;
	
	Элементы.ПисьмоВложенияКомандаСохранитьВсеВложения.Доступность	= (ПисьмоВложения.Количество() > 0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	ВременныйКаталог = КаталогВременныхФайлов() + XMLСтрока(ИдентификаторПисьма) + "\";
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьВложение(Команда)

	ОткрытьВложение(Элементы.ПисьмоВложения.ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьВложение(Команда)

	Вложение = Элементы.ПисьмоВложения.ТекущиеДанные;	
	Если Вложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла	= Вложение.ИмяФайла;
	ДиалогСохраненияФайла.Фильтр			= "Все файлы|*.*";
	
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		Вложение.Данные.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьВсеВложения(Команда)

	Если ПисьмоВложения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДиалогСохраненияФайла.Выбрать() Тогда
		Каталог = ДиалогСохраненияФайла.Каталог + ?(СтрЗаканчиваетсяНа(ДиалогСохраненияФайла.Каталог, "\"), "", "\");
		Для Каждого Вложение Из ПисьмоВложения Цикл
			Вложение.Данные.Записать(Каталог + Вложение.ИмяФайла);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПисьмоВложенияПриАктивизацииСтроки(Элемент)

	ЕстьДанные = (Элементы.ПисьмоВложения.ТекущиеДанные <> Неопределено);	
	
	Элементы.ПисьмоВложенияКомандаОткрытьВложение.Доступность	= ЕстьДанные;	
	Элементы.ПисьмоВложенияКомандаСохранитьВложение.Доступность	= ЕстьДанные;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПисьмоВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьВложение(ПисьмоВложения.НайтиПоИдентификатору(ВыбраннаяСтрока)); 			
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложение(Вложение)

	ВременныйКаталог = КаталогВременныхФайлов() + XMLСтрока(ИдентификаторПисьма) + "\";
	
	ФайлВложения = ВременныйКаталог + Вложение.ИмяФайла; 
	Вложение.Данные.Записать(ФайлВложения);
	
	ЗапуститьПриложение(ФайлВложения);	
	
КонецПроцедуры
