
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("СписокПользователей", СписокПользователей);
	Параметры.Свойство("ДатаНачала", ЭтаФорма.ДатаНачала);
	Параметры.Свойство("ДатаОкончания", ЭтаФорма.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьсяВЖурналРегистрации(Команда)
	
	ЭтаФорма.ВладелецФормы.Активизировать();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ЭтаФорма.СписокПользователей <> Неопределено Тогда
	
		Элементы.КомандаВернутьсяВЖурналРегистрации.Видимость = Истина;
		ЭтаФорма.Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
		
		Отбор = Неопределено;
		
		ЭлементыПользовательскихНастроек = Настройки.Элементы;
		
		Для каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
			Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
				Элемент.Элементы.Очистить();
				Отбор = Элемент;				
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Если Отбор = Неопределено Тогда
			Отбор = ЭлементыПользовательскихНастроек.Добавить(Тип("ОтборКомпоновкиДанных"));
		КонецЕсли; 
		
		ОтборОтветственный = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборОтветственный.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ОтборОтветственный.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборОтветственный.ПравоеЗначение = ЭтаФорма.СписокПользователей;
		
		ОтборДатаНачала = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборДатаНачала.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПериодВыполненияНачало");
		ОтборДатаНачала.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ОтборДатаНачала.ПравоеЗначение = ЭтаФорма.ДатаНачала;
		
		ОтборДатаОкончания = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборДатаОкончания.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПериодВыполненияНачало");
		ОтборДатаОкончания.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ОтборДатаОкончания.ПравоеЗначение = ЭтаФорма.ДатаОкончания;
		
		ЭтаФорма.СписокПользователей = Неопределено; // чтобы этот код не отрабатывал при интерактивной загрузке настроек
		
	КонецЕсли;
	
КонецПроцедуры
