// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Автоматическая пролонгация и оповещение о завершении договоров ДУ",
		"0.03",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоматическаяПролонгацияИОповещениеОЗавершенииДоговоровДУРЭМ", 	"Автоматическая пролонгация и оповещение о завершении договоров ДУ РЭМ",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоматическаяПролонгацияИОповещениеОЗавершенииДоговоровДУТраст", "Автоматическая пролонгация и оповещение о завершении договоров ДУ Траст",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "АвтоматическаяПролонгацияИОповещениеОЗавершенииДоговоровДУДУРПИ", "Автоматическая пролонгация и оповещение о завершении договоров ДУ РПИ",, 	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяПролонгацияИОповещениеОЗавершенииДоговоровДУ") Тогда
		ЭтотОбъект.Период		= НачалоДня(ТекущаяДата()); 
		ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
		ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
		
#Область СборСтатистики_Начало

		Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
			ЭтотОбъект, 
			"Период,Организация", 
			Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
		
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);

#КонецОбласти
		
		Оповестить(ПолучателиОповещения);

#Область СборСтатистики_Конец

		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

#КонецОбласти

КонецЕсли;
	
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

Процедура Оповестить(ПолучателиОповещения) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЗаполнитьОтчет(ДокументРезультат);
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = "Завершение срока действия договоров ДУ " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры	

Процедура ЗаполнитьОтчет(ДокументРезультат) Экспорт
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	РАЗНОСТЬДАТ(&Период, СчетаДоверительногоУправления.ДатаРасторжения, ДЕНЬ) КАК ДнейДоРасторжения,
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.АвтоматическаяПролонгация КАК АвтоматическаяПролонгация,
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.ВариантСрокаПролонгации КАК ВариантСрокаПролонгации,
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.СрокПролонгации КАК СрокПролонгации
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(&Период, ) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних
		|		ПО (УсловияДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаРасторжения <= ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, 31)
		|	И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И (УсловияДоговоровДоверительногоУправленияСрезПоследних.АвтоматическаяПролонгация = ИСТИНА
		|			ИЛИ РАЗНОСТЬДАТ(&Период, СчетаДоверительногоУправления.ДатаРасторжения, ДЕНЬ) >= 0)";
		
	Запрос.УстановитьПараметр("Организация"	, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период"		, ЭтотОбъект.Период);
	
	СчетаДУ = Запрос.Выполнить().Выгрузить();
	
	КонтрольЗакрытыхНепролонгированныхДоговоров(СчетаДУ);
	
	ВыестиИнформациюОЗавершенииДоговоров(СчетаДУ, 0	, ДокументРезультат);
	ВыестиИнформациюОЗавершенииДоговоров(СчетаДУ, 1	, ДокументРезультат);
	ВыестиИнформациюОЗавершенииДоговоров(СчетаДУ, 7	, ДокументРезультат);
	ВыестиИнформациюОЗавершенииДоговоров(СчетаДУ, 30, ДокументРезультат);
	
	ПродлитьДоговораИстекающиеСегодня(СчетаДУ, ДокументРезультат);
	
КонецПроцедуры

Процедура КонтрольЗакрытыхНепролонгированныхДоговоров(СчетаДУ)
	
	Для Каждого СтрокаСчетовДУ Из СчетаДУ Цикл
		Если СтрокаСчетовДУ.АвтоматическаяПролонгация
		   И СтрокаСчетовДУ.ДнейДоРасторжения < 0 Тогда
			ЗарегистрироватьОшибку(СтрШаблон("Счёт ДУ  %1 не пролонгировался автоматический", СтрокаСчетовДУ.СчетДоверительногоУправления)); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ВыестиИнформациюОЗавершенииДоговоров(СчетаДУ, ДнейДоРасторжения, ДокументРезультат)
	
	ПараметрыПоиска = Новый Структура("ДнейДоРасторжения, АвтоматическаяПролонгация", ДнейДоРасторжения, Ложь);
	НайденныеСтроки = СчетаДУ.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьЗаголовок.Параметры.Заголовок = "Срок действия договоров закончится через " + СтрокаСЧислом("; %1 день; ; %1 дня; %1 дней; %1 дня", ДнейДоРасторжения, ВидЧисловогоЗначения.Количественное);

	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	Если ДнейДоРасторжения = 0 Тогда
		ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 1, ДокументРезультат.ВысотаТаблицы, 1).ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаСчетовДУ Из НайденныеСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока.Параметры.Строка = Строка(НомерСтроки) + ". " + СтрокаСчетовДУ.СчетДоверительногоУправления + " (" + СтрокаСчетовДУ.КодСчета + ")";
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура ПродлитьДоговораИстекающиеСегодня(СчетаДУ, ДокументРезультат)
	
	ПараметрыПоиска = Новый Структура("ДнейДоРасторжения, АвтоматическаяПролонгация", 0, Истина);
	НайденныеСтроки = СчетаДУ.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьЗаголовок.Параметры.Заголовок = "Договора пролонгированы автоматически";
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 1, ДокументРезультат.ВысотаТаблицы, 1).ЦветТекста = Новый Цвет(0, 150, 0);
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаСчетовДУ Из НайденныеСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если ИзменитьДатуРасторжения(СтрокаСчетовДУ.СчетДоверительногоУправления, СтрокаСчетовДУ.ВариантСрокаПролонгации, СтрокаСчетовДУ.СрокПролонгации) Тогда
			Если СтрокаСчетовДУ.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.ДоКонцаСледующегоГода Тогда
				ОбластьСтрока.Параметры.Строка = Строка(НомерСтроки) + ". " + СтрокаСчетовДУ.СчетДоверительногоУправления + " (" + СтрокаСчетовДУ.КодСчета + ") до " + Формат(СтрокаСчетовДУ.СчетДоверительногоУправления.ДатаРасторжения, "ДФ=dd.MM.yyyy");
				
			ИначеЕсли СтрокаСчетовДУ.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации Тогда
				ОбластьСтрока.Параметры.Строка = Строка(НомерСтроки) + ". " + СтрокаСчетовДУ.СчетДоверительногоУправления + " (" + СтрокаСчетовДУ.КодСчета + ") " + СтрокаСЧислом("; на %1 день; ; на %1 дня; на %1 дней; на %1 дня", СтрокаСчетовДУ.СрокПролонгации, ВидЧисловогоЗначения.Количественное);
				
			ИначеЕсли СтрокаСчетовДУ.ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации Тогда
				ОбластьСтрока.Параметры.Строка = Строка(НомерСтроки) + ". " + СтрокаСчетовДУ.СчетДоверительногоУправления + " (" + СтрокаСчетовДУ.КодСчета + ") " + СтрокаСЧислом("; на %1 год; ; на %1 года; на %1 лет; на %1 год", СтрокаСчетовДУ.СрокПролонгации, ВидЧисловогоЗначения.Количественное);
				
			КонецЕсли;
		Иначе	
			ОбластьСтрока.Параметры.Строка = Строка(НомерСтроки) + ". Не удалось изменить дату расторжения в счете ДУ " + СтрокаСчетовДУ.СчетДоверительногоУправления + " (" + СтрокаСчетовДУ.КодСчета + ")";
			ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 1, ДокументРезультат.ВысотаТаблицы, 1).ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Функция ИзменитьДатуРасторжения(СчетДоверительногоУправления, ВариантСрокаПролонгации, СрокПролонгации)
	
	СчетДоверительногоУправленияОбъект = СчетДоверительногоУправления.ПолучитьОбъект();

	ТекущаяДатаРасторжения = СчетДоверительногоУправленияОбъект.ДатаРасторжения;
	
	Если ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.ДоКонцаСледующегоГода Тогда
		СчетДоверительногоУправленияОбъект.ДатаРасторжения = КонецГода(ДобавитьМесяц(СчетДоверительногоУправленияОбъект.ДатаРасторжения, 12));		
		
	ИначеЕсли ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоЛетСрокаПролонгации Тогда
		СчетДоверительногоУправленияОбъект.ДатаРасторжения = ДобавитьМесяц(СчетДоверительногоУправленияОбъект.ДатаРасторжения, 12 * СрокПролонгации);
		
	ИначеЕсли ВариантСрокаПролонгации = Перечисления.ВариантыСрокаПролонгации.КоличествоДнейСрокаПролонгации Тогда
		СчетДоверительногоУправленияОбъект.ДатаРасторжения = СчетДоверительногоУправленияОбъект.ДатаРасторжения + СрокПролонгации * 86400;
		
	Иначе	
		ЗарегистрироватьОшибку("Не удалось изменить дату расторжения в счете ДУ """ + СчетДоверительногоУправленияОбъект.Ссылка + """, не указан вариант срока пролонгации");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		СчетДоверительногоУправленияОбъект.Записать();
		
		ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Информация, СчетДоверительногоУправленияОбъект.Метаданные(), СчетДоверительногоУправленияОбъект.Ссылка, 
								"Изменена дата расторжения с " + Формат(ТекущаяДатаРасторжения, "ДФ=dd.MM.yyyy") + " на " + Формат(СчетДоверительногоУправленияОбъект.ДатаРасторжения, "ДФ=dd.MM.yyyy"), РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	Исключение
		ЗарегистрироватьОшибку("Не удалось изменить дату расторжения в счете ДУ """ + СчетДоверительногоУправленияОбъект.Ссылка + """");
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;








