
Функция ПолучитьГруппуОбъекта(Объект, СообщатьЕслиГруппаНеНайдена = Ложь) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		ИмяОбъекта = Объект;
	Иначе
		ИмяОбъекта = Объект.Метаданные().Имя;
	КонецЕсли;
	
	Если      ИмяОбъекта = "ЮрФизЛица" Тогда
		ГруппаОбъекта = Справочники.ГруппыИмпортируемыхОбъектов[?(Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо, "ЮридическиеЛица", "ФизическиеЛица")];
	Иначе
		Попытка
			ГруппаОбъекта = Справочники.ГруппыИмпортируемыхОбъектов[ИмяОбъекта];
		Исключение
			ГруппаОбъекта = Справочники.ГруппыИмпортируемыхОбъектов.НайтиПоНаименованию(ИмяОбъекта, Истина);
		КонецПопытки
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГруппаОбъекта) И СообщатьЕслиГруппаНеНайдена Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти группу импортируемых объектов, соответствующую объекту '" + Строка(Объект) + "'");
	КонецЕсли;
	
	Возврат ГруппаОбъекта;
	
КонецФункции // ПолучитьГруппуОбъекта

Функция ПолучитьГруппуПоНаименованию(ИмяГруппы, СообщатьЕслиГруппаНеНайдена = Ложь, СоздаватьГруппуПриОтсутствии = Ложь) Экспорт
	
	ГруппаОбъектов = Неопределено;
	
	Попытка
		// сначала проверим среди предопределенных по идентификатору
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов[ИмяГруппы];
	Исключение
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.НайтиПоНаименованию(ИмяГруппы, Истина);
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ГруппаОбъектов) Тогда
		Если СообщатьЕслиГруппаНеНайдена Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти группу импортируемых объектов по имени '" + ИмяГруппы + "'");
		КонецЕсли;
		
		Если СоздаватьГруппуПриОтсутствии Тогда
			Попытка
				ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.СоздатьЭлемент();
				ГруппаОбъектов.Наименование = ИмяГруппы;
				ГруппаОбъектов.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать группу испортируемых объектов с именем '" + ИмяГруппы + "'. Система сообщает: " + ОписаниеОшибки());
			КонецПопытки;
			
			ГруппаОбъектов = ГруппаОбъектов.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГруппаОбъектов;
	
КонецФункции // ПолучитьГруппуПоНаименованию
