
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ЦеннаяБумага", ПараметрКоманды);
	
	СчетДоверительногоУправления = ПолучитьСчетДоверительногоУправления(ПараметрыВыполненияКоманды.Источник);
	Если ТипЗнч(СчетДоверительногоУправления) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		ПараметрыФормы.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	КонецЕсли; 
	
	ОткрытьФорму("Отчет.ИсторияЦеннойБумаги.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСчетДоверительногоУправления(Источник)

	СчетДоверительногоУправления = Неопределено;
	Если Не Источник.ВладелецФормы = Неопределено Тогда
	
		ФормаРодитель = ПолучитьФормуРодитель(Источник.ВладелецФормы);
		Попытка
			СчетДоверительногоУправления = ФормаРодитель.Объект.СчетДоверительногоУправления;
		Исключение
		КонецПопытки; 
		
	КонецЕсли; 
	
	Возврат СчетДоверительногоУправления;

КонецФункции
 
&НаКлиенте
Функция ПолучитьФормуРодитель(ЭлементФормы)
	
	Родитель = ЭлементФормы.Родитель;
	Если Не ТипЗнч(Родитель) = Тип("УправляемаяФорма") Тогда
		Родитель = ПолучитьФормуРодитель(Родитель);
	КонецЕсли; 
	
	Возврат Родитель;
	
КонецФункции
 