
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	
	ЭтотОбъект.ОтчетСверкиДанных = "";
	
	ОбъектНаСервере = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	РезультатСверки = ОбъектНаСервере.ВыполнитьПроверку();
	
	Если РезультатСверки <> Неопределено Тогда
		ЭтотОбъект.ОтчетСверкиДанных = РезультатСверки;	
	КонецЕсли;
	
	ОбъектНаСервере.ОповеститьОбОшибках();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверка завершена");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверку(Команда) 
	
	ВыполнитьПроверкуНаСервере();
	
КонецПроцедуры


