#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ДополнительныйОтбор = Новый Структура("ИмяРеквизита, ЗначениеРеквизита", "ВидДеятельностиНФО", ЭтотОбъект.ВидДеятельностиНФО);
		БухгалтерскийУчет.ПроверитьУникальностьЭлементаПоРеквизиту(
			ЭтотОбъект, "ГруппыФинансовогоУчетаДоходовРасходов", "Код", ЭтотОбъект.Код, Отказ, ДополнительныйОтбор);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Добавить("Код");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли