
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ЭтаФорма, "Запись") И ЭтаФорма.Запись.Свойство("ИсходныйКлючЗаписи") Тогда	
		КлючЗаписиРегистра = ЭтаФорма.Запись.ИсходныйКлючЗаписи;
	Иначе
		КлючЗаписиРегистра = ЭтаФорма.Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
	Если КлючЗаписиРегистра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоговорБрокерскогоОбслуживания	= РаботаСИсполнителями.ПолучитьДоговор(КлючЗаписиРегистра);	
	КорневойЭлемент					= ?(ЗначениеЗаполнено(ДоговорБрокерскогоОбслуживания), ДоговорБрокерскогоОбслуживания, КлючЗаписиРегистра); 
	
	АдресДереваДочернихЭлементов = РаботаСИсполнителями.ПолучитьДочерниеЭлементы(КорневойЭлемент, , "ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)", , ЭтаФорма.УникальныйИдентификатор);
	Если ЗначениеЗаполнено(АдресДереваДочернихЭлементов) Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидимыеКолонки",				"Представление");
		ДополнительныеПараметры.Вставить("ОтмеченныеЭлементы",			Новый Структура("Элемент", КлючЗаписиРегистра));
		ДополнительныеПараметры.Вставить("ПолеКлючевогоЗначенияСтроки", "Элемент");
		ДополнительныеПараметры.Вставить("ПутьКДаннымКартинкиСтроки",	"ДеревоЗначений.ДанныеКартинки");
		ДополнительныеПараметры.Вставить("КартинкаСтрок",				БиблиотекаКартинок.РегистрСведенийЗапись);
		
		РезультатВопроса = РаботаСФормамиКлиент.ПоказатьДеревоЗначений(АдресДереваДочернихЭлементов, , ЭтаФорма, "Закрыть", "Закрыть", "Договор брокерского обслуживания", ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры
