
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", 						КонецДня(ТекущаяДата()));
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ДатаНачалаСогласованияПоручений", 	РаботаСДокументами.ДатаНачалаСогласованияПорученийНаВыводАктивов());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	РаботаСФайловымХранилищемКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры
