
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры
	
#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Каталог = ЭтаФорма.КаталогВыгрузки;
	ДиалогВыбора.Показать(Новый ОписаниеОповещения("ВыбратьИЗагрузитьФайлЗавершение", ЭтаФорма, Новый Структура("ДиалогВыбора", ДиалогВыбора)));
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		АдресВХранилище = ВыгрузитьНаСервере();
		
		Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		
			СоответствиеДвоичныхДанных = ПолучитьИзВременногоХранилища(АдресВХранилище);
			
			Для каждого ЭлементСтруктуры Из СоответствиеДвоичныхДанных Цикл
				Каталог = ЭтаФорма.КаталогВыгрузки + ?(СтрЗаканчиваетсяНа(ЭтаФорма.КаталогВыгрузки, "\"), "", "\");
				ЭлементСтруктуры.Значение.Записать(Каталог + ЭлементСтруктуры.Ключ + ".xml");
			КонецЦикла; 
			
			ИсходнаяСтрока = ";Создан %1 файл;;Создано %1 файла;Создано %1 файлов;Создано %1 файла";
			ПоказатьОповещениеПользователя("Выгрузка завершена. " + СтрокаСЧислом(ИсходнаяСтрока, СоответствиеДвоичныхДанных.Количество(), ВидЧисловогоЗначения.Количественное));
		
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Функция ВыгрузитьНаСервере()

	СтруктураПараметров = Новый Структура("Организация, ДатаПредоставленияИнформации, ВыгружаемыйПериод, ВыгружатьСделкиРЕПО"); 
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтаФорма);
	СтруктураПараметров.Вставить("Клиенты", ЭтаФорма.Клиенты.Выгрузить());
	
	СоответствиеДвоичныхДанных = Документы.СведенияПредоставляемыеЮрФизЛицами.ПолучитьСоответствиеДвоичныхДанных(СтруктураПараметров);
	
	Если Не СоответствиеДвоичныхДанных = Неопределено Тогда
		Возврат ПоместитьВоВременноеХранилище(СоответствиеДвоичныхДанных);
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВыбратьИЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ЭтаФорма.КаталогВыгрузки = ДополнительныеПараметры.ДиалогВыбора.Каталог;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 


 