
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка", "Создание задач в первой форме", "0.50","", Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СоздатьЗадачиПоОфертам", "Создание задач по офертам",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СоздатьЗадачиПоЗапросамФССП", "Создание задач по запросам ФССП",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СоздатьЗадачиПоЗапросамФССПиПроверитьВложения", "Создание задач по запросам ФССП и проверить вложения",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПроверкаОфертПоступившихНовыхОблигаций", "Проверка оферт поступивших новых облигаций",,  Ложь, "ВызовСерверногоМетода");

	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
			
	Если ИдентификаторКоманды = "СоздатьЗадачиПоОфертам" Тогда
		
		ЗаполнитьЗначенияРеквизитовИзПараметров(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ПараметрыКоманды);
		СоздатьЗадачиПоОфертам(Истина); //ПроверятьВесьПериодПредъявления
		
	ИначеЕсли ИдентификаторКоманды = "ПроверкаОфертПоступившихНовыхОблигаций" Тогда
		
		ПроверитьОфертыПоступившихНовыхОблигаций();
		
	ИначеЕсли ИдентификаторКоманды = "СоздатьЗадачиПоЗапросамФССП"
		Или ИдентификаторКоманды = "СоздатьЗадачиПоЗапросамФССПиПроверитьВложения" Тогда
		
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка); 
		
		КонтрольНаличияВложений = (ИдентификаторКоманды = "СоздатьЗадачиПоЗапросамФССПиПроверитьВложения");
				
		Если ПараметрыКоманды.Свойство("Организация") И ЗначениеЗаполнено(ПараметрыКоманды.Организация) Тогда
			СоздатьЗадачиПоЗапросамФССП(ПараметрыКоманды.Организация, Истина, КонтрольНаличияВложений);	
		Иначе
			ЗарегистрироватьОшибку("Для команды [" + ИдентификаторКоманды + "] отсутствует параметр [Организация].");	
		КонецЕсли;
		
	Иначе
		ЗарегистрироватьОшибку("Для команды [" + ИдентификаторКоманды + "] не определены действия.");
	КонецЕсли;
	
	ОповеститьОбОшибках(Неопределено);
	
КонецПроцедуры

// Интерфейс для запуска отложенного задания
//
// Параметры:
//  Команда			 - Строка - Идентификатор выполняемого метода
//  ПараметрыКоманды - Структура - Содержит параметры запуска метода
//
Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод <> "СоздатьЗадачуОферты" Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаСсылка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьСсылкуПоИмениОбъекта("_СозданиеЗадачВПервойФорме");
	
	Если ОбработкаСсылка = Неопределено Тогда
		ЗарегистрироватьОшибку("В справочнике дополнительных отчетов и обработок отсутствует обработка с именем [_СозданиеЗадачВПервойФорме].");
		Возврат;	
	КонецЕсли;
	
	МассивКоманд = ОбработкаСсылка.Команды.НайтиСтроки(Новый Структура("Идентификатор", "СоздатьЗадачуОферты"));
	
	Для Каждого КомандаСозданияЗадачи из МассивКоманд Цикл
			
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ОбработкаСсылка, "СоздатьЗадачуОферты", КомандаСозданияЗадачи.ГруппаПараметров);
					
		ЗаполнитьЗначенияРеквизитовИзПараметров(ОбработкаСсылка, ПараметрыКоманды);
		
		Прервать;
		
	КонецЦикла;
		
	КлючиЗапуска = Новый ТаблицаЗначений;
	КлючиЗапуска.Колонки.Добавить("Облигация", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	КлючиЗапуска.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
		
	Для Каждого Экземпляр Из Экземпляры Цикл
	
		НовыйКлючЗапуска = КлючиЗапуска.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКлючЗапуска, Экземпляр.Параметры);
		НовыйКлючЗапуска.Идентификатор = Экземпляр.Идентификатор;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючиЗапуска.Облигация КАК Облигация,
		|	КлючиЗапуска.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ _КлючиЗапуска
		|ИЗ
		|	&КлючиЗапуска КАК КлючиЗапуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КлючиЗапуска.Облигация КАК Облигация,
		|	_КлючиЗапуска.Идентификатор КАК Идентификатор
		|ИЗ
		|	_КлючиЗапуска КАК _КлючиЗапуска
		|ИТОГИ ПО
		|	Облигация";
	
	Запрос.УстановитьПараметр("КлючиЗапуска", КлючиЗапуска);
	
	ВыборкаГруппировкаПоОблигации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Облигация");
	
	Пока ВыборкаГруппировкаПоОблигации.Следующий() Цикл
		
		Если ВыборкаГруппировкаПоОблигации.Облигация <> Неопределено Тогда
			ЭтотОбъект.Облигация = ВыборкаГруппировкаПоОблигации.Облигация;
		КонецЕсли;
		
		СоздатьЗадачиПоОфертам(Истина);
				
		ВыборкаИдентификатор = ВыборкаГруппировкаПоОблигации.Выбрать();
		
		Пока ВыборкаИдентификатор.Следующий() Цикл
			РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ВыборкаИдентификатор.Идентификатор);
		КонецЦикла; 
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьЗначенияРеквизитовИзПараметров(ОбработкаСсылка, ПараметрыКоманды)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ОбработкаСсылка);
	ЭтотОбъект.ДатаФормированияОстатков = ТекущаяДатаСеанса();
		
	//Количество рабочих дней до даты начала предъявления за которое нужно поставить задачу.
	//Функция учитывает и текущий день: 
	//	1. поэтому "Количество дней" + 1,
	//	2. В условии отбора "АкцептС" < ДатаНачалаПредьявления, еще + 1 т.к. если дата "АкцептС" выпадает на выходные - задачу ставим за три рабочих дня без учета выходных,
	//	т.е. как будто "АкцептС" выпал на последний рабочий день перед выходными. 
	ЭтотОбъект.ДатаНачалаПредъявления = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ЭтотОбъект.ДатаФормированияОстатков), ПараметрыКоманды.КоличествоДней + 2); 
			
	//В режиме перезаписи сверяется количество ценнных бумаг на остатках с данными в табличной части задачи.
	//Если есть расхождения - табличная часть перезаписывается (актуальными данными из 1С).
	ЭтотОбъект.РежимПерезаписи = Истина;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	// дополним текст ошибки сообщениями пользователю
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстОшибки = ТекстОшибки + Символы.ПС + "Сообщения пользователю:";
		Для Каждого ТекСообщение Из МассивСообщений Цикл
			
			Если ТекСообщение.Текст = "" Тогда
				Продолжить;
			Иначе
				Текст = ТекСообщение.Текст + ". " + Строка(ТекСообщение.КлючДанных);
				ТекстОшибки = ТекстОшибки + Символы.ПС + Текст; 
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ТекстОшибки = ТекстОшибки;                                  
	КонецЕсли;
	
    Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда    	
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбОшибках(ЕстьОшибки)Экспорт
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");	
	
КонецПроцедуры

Процедура СверитьДанныеСПервойФормой(ТаблицаЗадач, ПараметрыПодключения)
	
	ПараметрыЗадач1Ф = Новый ТаблицаЗначений;
	ПараметрыЗадач1Ф.Колонки.Добавить("НомерЗадачи", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ПараметрыЗадач1Ф.Колонки.Добавить("РегНомер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(21)));
	ПараметрыЗадач1Ф.Колонки.Добавить("Закрыта", Новый ОписаниеТипов("Булево"));
	ПараметрыЗадач1Ф.Колонки.Добавить("КлючЗадачиJson", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ПараметрыЗадач1Ф.Колонки.Добавить("ТабличнаяЧасть", Новый ОписаниеТипов("ТаблицаЗначений"));
	ПараметрыЗадач1Ф.Колонки.Добавить("Акцепт", Новый ОписаниеТипов("Булево"));
	ПараметрыЗадач1Ф.Колонки.Добавить("ДатаВыкупа", Новый ОписаниеТипов("Дата"));
	ПараметрыЗадач1Ф.Колонки.Добавить("АкцептПо", Новый ОписаниеТипов("Дата"));
	ПараметрыЗадач1Ф.Колонки.Добавить("КоличествоКлиентов", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	ПараметрыЗадач1Ф.Колонки.Добавить("Ошибки");
	
	ОтправленныеЗапросы = Новый Массив;
	
	//1. Получаем из 1Ф данные задач по параметру "рег номер"
	ТекстСообщения = "Не удалось получить данные задачи (оферты) по рег.номеру облигации [%1]";
		
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 100);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam185, ExtParam469"));
	
	СтруктураЗапроса.filterModel.ExtParam185 = Новый Структура("filterType, type, filter", "text", "equals");
	СтруктураЗапроса.filterModel.ExtParam469 = Новый Структура("filterType, type, dateFrom", "date", "equals");
	
	Для Каждого СтрокаТаблицаЗадач Из ТаблицаЗадач Цикл
		
		Если ОтправленныеЗапросы.Найти(СтрокаТаблицаЗадач.РегНомер) = Неопределено Тогда
				
			СтруктураЗапроса.filterModel.ExtParam185.filter = СтрокаТаблицаЗадач.РегНомер;
			СтруктураЗапроса.filterModel.ExtParam469.dateFrom = Формат(СтрокаТаблицаЗадач.ДатаВыкупа, "ДФ=yyyy-MM-dd");
			
			ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/186/data", ТелоЗапроса, ТекстСообщения);
			
			ОтправленныеЗапросы.Добавить(СтрокаТаблицаЗадач.РегНомер); 
			
			Если HTTPОтвет = Неопределено Тогда
				СтрокаТаблицаЗадач.Ошибки.Добавить(СтрШаблон(ТекстСообщения, СтрокаТаблицаЗадач.РегНомер));
				Продолжить;
			КонецЕсли;
			
			РезультатЗапроса = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
			
			Если Не (РезультатЗапроса.Свойство("totalCount") И РезультатЗапроса.Свойство("tasksDataSourceResponse"))  Тогда
				СтрокаТаблицаЗадач.Ошибки.Добавить(СтрШаблон(ТекстСообщения, СтрокаТаблицаЗадач.РегНомер));
				Продолжить;
			КонецЕсли;
			//в 1-ой форме отсутствуют задачи с таким параметром
			Если РезультатЗапроса.totalCount = 0 И Не ЗначениеЗаполнено(СтрокаТаблицаЗадач.НомерЗадачи) Тогда
				Продолжить;		 
			КонецЕсли;

			//по одному рег номеру может быть несколько задач т.к.
			//1. для портфелей с дефолтными бумагами задачи ставятся отдельно.
			//2. по одной бумаге может быть несколько оферт
			Для Каждого Задача Из РезультатЗапроса.tasksDataSourceResponse Цикл
				
				НоваяСтрока = ПараметрыЗадач1Ф.Добавить();
				НоваяСтрока.НомерЗадачи = Формат(Задача.taskId, "ЧГ=0");
				НоваяСтрока.Закрыта     = Задача.isClosed;
				НоваяСтрока.РегНомер    = СтрокаТаблицаЗадач.РегНомер;
	
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицаЗадач.НомерЗадачи) Тогда
			
			МассивЗадач1Ф = ПараметрыЗадач1Ф.НайтиСтроки(Новый Структура("НомерЗадачи", СтрокаТаблицаЗадач.НомерЗадачи));
			  
			Если МассивЗадач1Ф.Количество() = 0 Тогда
				//Если среди найденых задач нет номера той задачи, которая зарегистрирована с таким параметром в 1С
				//добавим ее номер в таблицу для поиска задач по номеру в 1Ф.
				НоваяСтрока = ПараметрыЗадач1Ф.Добавить();
				НоваяСтрока.НомерЗадачи = СтрокаТаблицаЗадач.НомерЗадачи;
				НоваяСтрока.РегНомер    = СтрокаТаблицаЗадач.РегНомер;
				СтрокаТаблицаЗадач.Ошибки.Добавить("В ответ на запрос по параметру рег.номер [" + СтрокаТаблицаЗадач.РегНомер  + "] не найдена задача [" + СтрокаТаблицаЗадач.НомерЗадачи + "]. Проверьте задачу в 1Ф, и рег.номер ЦБ [" + СтрокаТаблицаЗадач.ЦеннаяБумага + "] в 1С.");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//2. Собираем парметры и ключи на основании данных 1Ф
	ТекстСообщения = "Не удалось получить данные по номеру задачи [%1]. Не собран ключ для сверки.";
	
	Для Каждого СтрокаПараметрыЗадач1Ф Из ПараметрыЗадач1Ф Цикл		
		
		СтрокаПараметрыЗадач1Ф.Ошибки = Новый Массив; 
		
		ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("taskId, selectedInfoParts", СтрокаПараметрыЗадач1Ф.НомерЗадачи, РаботаСКоллекциями.ЗначениеВМассив("ExtParams")));
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks", ТелоЗапроса, ТекстСообщения);

		Если HTTPОтвет = Неопределено Тогда
			СтрокаПараметрыЗадач1Ф.Ошибки.Добавить(СтрШаблон(ТекстСообщения, СтрокаПараметрыЗадач1Ф.НомерЗадачи));
		Иначе
			ДесериализоватьПараметрыЗадачи(СтрокаПараметрыЗадач1Ф, ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8")));
		КонецЕсли;
		
		//если по рег номеру найдена задача в 1Ф, и для нее не удалось собрать все данные для дальнейшей сверки
		//исключаем загрузку задач с таким рег номером.
		Если СтрокаПараметрыЗадач1Ф.Ошибки.Количество() > 0 Тогда
			
			ТекстОшибкиПриСборкеКлюча = "";
			
			Для Каждого Ошибка Из СтрокаПараметрыЗадач1Ф.Ошибки Цикл
				ТекстОшибкиПриСборкеКлюча = ?(ТекстОшибкиПриСборкеКлюча = "", "", ТекстОшибкиПриСборкеКлюча + Символы.ПС) + Ошибка;
			КонецЦикла;

			МассивСтрокДанных1С = ТаблицаЗадач.НайтиСтроки(Новый Структура("РегНомер", СтрокаПараметрыЗадач1Ф.РегНомер));
					
			Для Каждого СтрокаДанных1С Из МассивСтрокДанных1С Цикл
				СтрокаДанных1С.Ошибки.Добавить(ТекстОшибкиПриСборкеКлюча);
			КонецЦикла;

		КонецЕсли;
	
	КонецЦикла;
	
	//3. Сверяем данные
	ТаблицаЗадач.Сортировать("НомерЗадачи ВОЗР"); //Сначала проверяем данные без номеров в 1Ф.
	
	Для Каждого СтрокаТаблицаЗадач Из ТаблицаЗадач Цикл
		
		Если СтрокаТаблицаЗадач.Ошибки.Количество() > 0 Тогда
			
			Для Каждого ТекстОшибки Из СтрокаТаблицаЗадач.Ошибки Цикл
				ЗарегистрироватьОшибку(ТекстОшибки);	
			КонецЦикла;
			
			Продолжить; //если есть ошибки -> данные могут быть не полными.
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицаЗадач.НомерЗадачи) Тогда
			
			МассивЗадач1Ф = ПараметрыЗадач1Ф.НайтиСтроки(Новый Структура("НомерЗадачи", СтрокаТаблицаЗадач.НомерЗадачи));
			
			Если МассивЗадач1Ф.Количество() = 0 Тогда
				
				ЗарегистрироватьОшибку("В 1-ой форме не найдена задача [" + СтрокаТаблицаЗадач.НомерЗадачи + "]");
				
			ИначеЕсли МассивЗадач1Ф.Количество() = 1 Тогда
				
				СтрокаТаблицаЗадач.СверитьПерезаписатьТабЧасть = ЭтотОбъект.РежимПерезаписи;
				
				Если СтрокаТаблицаЗадач.КлючЗадачиJson <> МассивЗадач1Ф[0].КлючЗадачиJson Тогда
					
					ТекстОшибкиНеравенстваКлючей = "Ошибка: Задача [" + СтрокаТаблицаЗадач.НомерЗадачи + "]. Ключ 1Ф [" + МассивЗадач1Ф[0].КлючЗадачиJson + "] не соответствует ключу 1С [" + СтрокаТаблицаЗадач.КлючЗадачиJson + "].";
					
					Для Каждого Ошибка1Ф Из МассивЗадач1Ф[0].Ошибки Цикл
						ТекстОшибкиНеравенстваКлючей = ТекстОшибкиНеравенстваКлючей + Символы.ПС + Ошибка1Ф;
					КонецЦикла;
					
					ЗарегистрироватьОшибку(ТекстОшибкиНеравенстваКлючей);
					
				КонецЕсли;
													
				Если МассивЗадач1Ф[0].Закрыта Тогда
					
					Если СтрокаТаблицаЗадач.АкцептПо >= ЭтотОбъект.ДатаФормированияОстатков Тогда 
						ЗарегистрироватьОшибку("В 1-ой форме задача [" + СтрокаТаблицаЗадач.НомерЗадачи + "] со статусом [Закрыта].");
					КонецЕсли;
					
					СтрокаТаблицаЗадач.СверитьПерезаписатьТабЧасть = Ложь;
					Продолжить; 
					
				КонецЕсли;
				
				Если СтрокаТаблицаЗадач.СверитьПерезаписатьТабЧасть Тогда
					СверитьТабличныеЧасти(МассивЗадач1Ф[0], СтрокаТаблицаЗадач);
				КонецЕсли;
					
				Если МассивЗадач1Ф[0].КоличествоКлиентов <> СтрокаТаблицаЗадач.КоличествоКлиентов Тогда
					СтрокаТаблицаЗадач.ИзменитьКоличествоКлиентов = Истина;	
				КонецЕсли;
				
				ПараметрыЗадач1Ф.Удалить(ПараметрыЗадач1Ф.Индекс(МассивЗадач1Ф[0]));
							
			КонецЕсли;
						
		Иначе
			
			//Проверяем задачи по рег номеру. Может есть активные задачи, у которых изменена дата выкупа как на стороне 1С, так и на стороне 1Ф.
			//Может по прошлым офертам остались активные задачи.
			МассивЗадачОтборПоРегНомеру = ПараметрыЗадач1Ф.НайтиСтроки(Новый Структура("РегНомер", СтрокаТаблицаЗадач.РегНомер));
											
			Если МассивЗадачОтборПоРегНомеру.Количество() = 0 Тогда
				
				СтрокаТаблицаЗадач.СоздатьЗадачу = Истина;	

			Иначе
				
				//Проверяем задачи по ключу. Может уже есть задачи с такими параметрами
				МассивЗадачОтборПоКлючу = ПараметрыЗадач1Ф.НайтиСтроки(Новый Структура("КлючЗадачиJson", СтрокаТаблицаЗадач.КлючЗадачиJson));
				
				Если МассивЗадачОтборПоКлючу.Количество() > 0 Тогда
					
					НомераЗадач = "";
					Для Каждого Задача1Ф Из МассивЗадачОтборПоКлючу Цикл
						НомераЗадач = ?(НомераЗадач = "", "", НомераЗадач + ", ") + Задача1Ф.НомерЗадачи + ?(Задача1Ф.Закрыта, " (Закрыта)", "") + "";
						ПараметрыЗадач1Ф.Удалить(ПараметрыЗадач1Ф.Индекс(Задача1Ф));
					КонецЦикла;
					
					ЗарегистрироватьОшибку("Ошибка формирования задач. В 1-ой форме уже присутствуют задачи по офертам со следующими параметрами: [" + СтрокаТаблицаЗадач.КлючЗадачиJson + "]. Задача [" + НомераЗадач + "].");
					
				Иначе
					
					ЕстьОшибка = Ложь;
					
					Для Каждого Задача1Ф Из МассивЗадачОтборПоРегНомеру Цикл
						
						Если Не Задача1Ф.Закрыта И Задача1Ф.ДатаВыкупа <> СтрокаТаблицаЗадач.ДатаВыкупа И Задача1Ф.Акцепт = СтрокаТаблицаЗадач.Акцепт Тогда
							
							// Возможны ситуации, когда по одной бумаге оферты идут одна за другой (при этом не пересекались периоды предъявления): в 1Ф была активна задача по одной оферте, и нужно было поставить задачу по другой оферте
							// Решили, что нужно ставить задачу в таком случае + добавить уведомление
							ЗарегистрироватьОшибку("В 1Ф по рег. номеру [" + Задача1Ф.РегНомер + "] найдена активная зазача [" + Задача1Ф.НомерЗадачи + "]. Дата выкупа по оферте [" + Формат(Задача1Ф.ДатаВыкупа, "ДФ=dd.MM.yyyy") + "].");
							
							// Если по одной бумаге сформированы данные для нескольких задач по разным офертам - Фиксируем ошибку, т.к. это нестандартная ситуация.
							// Когда для одной бумаги в 1Ф уже есть задача по оферте, при попытке поставить еще одну - фиксируем ошибку.
							ЗадачиДляПостановки = ТаблицаЗадач.НайтиСтроки(Новый Структура("НомерЗадачи",  Задача1Ф.НомерЗадачи));
							
							Если ЗадачиДляПостановки.Количество() = 0 Тогда  
								ПараметрыЗадач1Ф.Удалить(ПараметрыЗадач1Ф.Индекс(Задача1Ф));
							КонецЕсли;							
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если Не ЕстьОшибка Тогда
						СтрокаТаблицаЗадач.СоздатьЗадачу = Истина;	
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
					
	КонецЦикла;
	
	Если ПараметрыЗадач1Ф.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи1Ф.НомерЗадачи КАК НомерЗадачи,
			|	Задачи1Ф.АкцептПо КАК АкцептПо,
			|	Задачи1Ф.Закрыта КАК Закрыта
			|ПОМЕСТИТЬ _ЗадачиПервойФормы
			|ИЗ
			|	&Задачи1Ф КАК Задачи1Ф
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЗадачиПервойФормы.НомерЗадачи КАК НомерЗадачи,
			|	ЕСТЬNULL(НомераТранзакций.Ключ, """") <> """" КАК ЕстьКлюч,
			|	ВЫРАЗИТЬ(НомераТранзакций.Субъект КАК Справочник.Облигации).Наименование КАК Облигация
			|ИЗ
			|	_ЗадачиПервойФормы КАК _ЗадачиПервойФормы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераТранзакций КАК НомераТранзакций
			|		ПО _ЗадачиПервойФормы.НомерЗадачи = НомераТранзакций.Номер
			|			И (НомераТранзакций.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
			|ГДЕ
			|	_ЗадачиПервойФормы.АкцептПо >= &Дата
			|	И НЕ _ЗадачиПервойФормы.Закрыта";
		
		Запрос.УстановитьПараметр("Задачи1Ф", ПараметрыЗадач1Ф);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаФормированияОстатков);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем только активные задачи. Возможны ситуации когда задача отклоняется до наступления даты исполнения. Если принято решение не участвовать в оферте.
		Пока Выборка.Следующий() Цикл
			ЗарегистрироватьОшибку("В 1-ой форме обнаружена активная задача по оферте [" + Выборка.НомерЗадачи + "], номер которой" + ?(Выборка.ЕстьКлюч, "", " не") + " зафиксирован в регистре [Номера транзакций]." + ?(Выборка.ЕстьКлюч, " Проверьте условия оферт по бумаге [" + Выборка.Облигация + "]. Проверьте необходимость акцептования оферт по счетам ДУ.", ""));
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПоставитьЗадачиВПервойФорме(ТаблицаЗадач, МассивНомеровЗадач) 
			
	Сервер = ?(ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза, "1f", "test1f") + ".g1.lan";
		
	ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения(Сервер);
	
	Если ПараметрыПодключения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СверитьДанныеСПервойФормой(ТаблицаЗадач, ПараметрыПодключения);
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗадач Цикл
		
		Если Не (СтрокаТаблицы.СоздатьЗадачу Или СтрокаТаблицы.СверитьПерезаписатьТабЧасть Или СтрокаТаблицы.ИзменитьКоличествоКлиентов)
				Или СтрокаТаблицы.Ошибки.Количество() > 0 Тогда	
			Продолжить;	
		КонецЕсли;
				
		Если СтрокаТаблицы.СоздатьЗадачу Тогда 
			
			ТекстСообщения = "Ошибка создания задачи по оферте в 1-ой форме.";
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", СтрокаТаблицы.ТекстЗадачиJson, ТекстСообщения);
			
			//создаем задачу. в ответе получаем ее номер. Задача ставится со статусом "Новая".
			//отловил лаг - запрос упал с ошибкой, но при этом создалась задача в 1Ф.
			Если HTTPОтвет = Неопределено Тогда
				
				ЗарегистрироватьОшибку(ТекстСообщения);   
				Продолжить; 
				
			Иначе
				
				ОтветОбъект = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8")); 
				НомерЗадачи = Формат(ОтветОбъект.data.value, "ЧГ=0");
				
				Если ПустаяСтрока(НомерЗадачи) Тогда
					
					ЗарегистрироватьОшибку("Ошибка создания задачи в 1-ой форме. В ответ на запрос не получен номер задачи. Текст запроса:"+ Символы.ПС + СтрокаТаблицы.ТекстЗадачиJson + Символы.ПС + "Код ответа: " + HTTPОтвет.КодСостояния + "");
					Продолжить;
				
				КонецЕсли;
				
				МассивНомеровЗадач.Добавить(НомерЗадачи);
					
			КонецЕсли;
						
			//Значение параметра "Компании_Группы"(310) заполняется отдельным запросом.
			ТекстСообщения = "Не удалось записать значение параметра [Компании_Группы] для задачи [" + НомерЗадачи + "].";
			ТекстЗапроса = "/app/v1.2/api/eps/multilookup/310/" + НомерЗадачи + "/update?v=1.2&api_key=EpTable";
						
			Для Каждого КодУК Из СтрокаТаблицы.КодыУК Цикл
				
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, КодУК, ТекстСообщения);
			
				Если HTTPОтвет = Неопределено Тогда
					ЗарегистрироватьОшибку(ТекстСообщения);	
				КонецЕсли;
				
			КонецЦикла;
				
			Если Не ЗаписатьНомерЗадачи(НомерЗадачи, СтрокаТаблицы.ЦеннаяБумага, СтрокаТаблицы.КлючЗадачиJson) Тогда
				
				ЗарегистрироватьОшибку("При создании задачи в 1-ой форме. Не удалось записать данные в регистр [Номера транзакций]");
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Удаление табличной части. Для перезаписи табличной части осуществляем предварительную очистку.
		Если СтрокаТаблицы.СверитьПерезаписатьТабЧасть И ЗначениеЗаполнено(СтрокаТаблицы.НомерЗадачи) Тогда 
			
			НомерЗадачи = СтрокаТаблицы.НомерЗадачи;
			
			ТекстЗапроса = "/app/v1.2/api/task/" + НомерЗадачи + "/ep/table/478/erase?v=1.2&api_key=EpTable";
			ТекстСообщения = "Не удалось очистить табличную часть в задаче [" + НомерЗадачи+ "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса,, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);   
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		//Табличная часть задачи создается отдельным запросом.
		Если СтрокаТаблицы.СоздатьЗадачу Или (СтрокаТаблицы.СверитьПерезаписатьТабЧасть И ЗначениеЗаполнено(СтрокаТаблицы.НомерЗадачи)) Тогда 
			
			ТекстЗапроса = "/app/v1.2/api/task/" + НомерЗадачи + "/ep/table/478/update?v=1.2&api_key=EpTable";
			ТекстСообщения = "Не удалось создать табличную часть в задаче [" + НомерЗадачи + "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, СтрокаТаблицы.ТекстТабЧастьJson, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);   
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		//Перезапишем параметр "Общее количество клиентов компаний"	
		Если СтрокаТаблицы.ИзменитьКоличествоКлиентов Тогда 
			
			ТекстЗапроса = "/app/v1.2/api/publications/action/UpdateNumberOfClientsOffers?TaskID=" + СтрокаТаблицы.НомерЗадачи + "&NumberOfClients=" + СтрокаТаблицы.КоличествоКлиентов;
			ТекстСообщения = "Не удалось перезаписать значение параметра [Общее количество клиентов компаний] в задаче [" + СтрокаТаблицы.НомерЗадачи + "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("GET", ПараметрыПодключения, ТекстЗапроса,, ТекстСообщения);   
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
		//В задачу добавляем комментарий об изменениях, и отправляем копию пользователям на почту.
		Если СтрокаТаблицы.Сообщения.Количество() > 0 И СтрокаТаблицы.Сообщения.Свойство("КомментарийВЗадачу") Тогда 
			
			ТекстЗапроса = "/api/comments/add";
			ТекстСообщения = "Не удалось записать комментарий об изменении количества ценных бумаг на остатках в задаче [" + СтрокаТаблицы.НомерЗадачи + "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, СтрокаТаблицы.Сообщения.КомментарийВЗадачу, ТекстСообщения);
		
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);
			КонецЕсли;
			
			Если СтрокаТаблицы.Сообщения.Свойство("РЭМ") Тогда				
				РеквизитыОповещения = Новый Структура("Тема, Текст, ОрганизацияСтр, ТипТекста", "Обработка создания задач в 1Ф (оферты).", СтрокаТаблицы.Сообщения.РЭМ, "РЭМ", "HTML"); 
				Справочники.Оповещения.СформироватьОповещения("Обработка._СозданиеЗадачВПервойФорме.Оферты", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);	
			КонецЕсли;
			
			Если СтрокаТаблицы.Сообщения.Свойство("Траст") Тогда
				РеквизитыОповещения = Новый Структура("Тема, Текст, ОрганизацияСтр, ТипТекста", "Обработка создания задач в 1Ф (оферты).", СтрокаТаблицы.Сообщения.Траст, "Траст", "HTML"); 
				Справочники.Оповещения.СформироватьОповещения("Обработка._СозданиеЗадачВПервойФорме.Оферты", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
			КонецЕсли;
			
		КонецЕсли;
		
		//После того как была создана задача со статусом "Новая" и в нее добавлены все необходимые данные (зпаполнен параметр "Компании_Группы", заполнена табличная часть)
		//необходимо отправить запрос перехода "Новая" -> "Поставить задачу". При переходе подтягиваются подписчики задачи на стороне 1Ф.
		//Если перезаписываем табличную часть в ранее созданной задаче, не нужно отправлять запрос перехода. 
		Если СтрокаТаблицы.СоздатьЗадачу Тогда 
			
			ТекстЗапроса = "/app/v1.0/api/task/step/" + НомерЗадачи + "";
			ТекстСообщения = "Не удалось выполнить запрос перехода [Поставить задачу] в задаче [" + НомерЗадачи + "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, ПолучитьСтрокуJSON(Новый Структура("stepId, comment", 1111, "")), ТекстСообщения);
						
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла; 
	
	Если МассивНомеровЗадач.Количество() > 0 Тогда
					
		ТекстСообщения = "";
		
		Для Каждого ТекНомерЗадачи Из МассивНомеровЗадач Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + "http://1f.g1.lan/MaintaskForm.aspx?TaskID=" + ТекНомерЗадачи + "";
		КонецЦикла;
		
		РеквизитыОповещения = Новый Структура("Тема, Текст, ТипСообщения", "Обработка создания задач в 1Ф (оферты).", "В 1Ф созданы задачи: " + ТекстСообщения, "Служебные"); 
		Справочники.Оповещения.СформироватьОповещения("Обработка._СозданиеЗадачВПервойФорме.Оферты", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);			
			
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьСтрокуJSON(Данные)
	
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Процедура ДесериализоватьПараметрыЗадачи(СтрокаДанных, ЗадачаОбъект)
	
	Если Не (ЗадачаОбъект.Свойство("subcatID") И ЗадачаОбъект.subcatID = 186) Тогда
		СтрокаДанных.Ошибки.Добавить("Ошибка получения данных из 1-ой формы. По номеру [" + НомерЗадачи + "] найдена задача с категорией [" + ЗадачаОбъект.subcatDescription + "].");
		Возврат;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.Закрыта) Тогда
		СтрокаДанных.Закрыта = ЗадачаОбъект.isClosed; 
	КонецЕсли;
		
	СтруктураКлюч = Новый Структура("reg_number, offer_date, approval_required");
	
	Для Каждого Параметр Из ЗадачаОбъект.extParams Цикл
				
		Если Параметр.id = 185 Тогда //РегНомер
			СтруктураКлюч.reg_number = Параметр.value;
		ИначеЕсли Параметр.id = 469 Тогда //ДатаВыкупа
			СтруктураКлюч.offer_date = Лев(Параметр.value, 10); 
		ИначеЕсли Параметр.id = 1181 Тогда//Акцепт 1181
			СтруктураКлюч.approval_required = Параметр.value;
		ИначеЕсли Параметр.id = 1398 Тогда
			СтрокаДанных.КоличествоКлиентов = Параметр.value;
		ИначеЕсли Параметр.id = 474 Тогда //"Окончание периода предъявления"
			
			Попытка
				СтрокаДанных.АкцептПо = Дата(СтрЗаменить(Лев(Параметр.value, 10), "-", ""));
			Исключение
				ЗарегистрироватьОшибку("Не удалось преобразовать значение [" + Параметр.value + "] в дату при определении Окончания периода предъявления для оферты. Задача [" + СтрокаДанных.НомерЗадачи+ "]."); 
			КонецПопытки;
			
		ИначеЕсли Параметр.id = 478 Тогда//Проверяем если изменились данные в таб части.
			СтрокаДанных.ТабличнаяЧасть = ДесериализоватьТабличнуюЧастьЗадачи(Параметр.value.values);	
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из СтруктураКлюч Цикл
		
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтрокаДанных.Ошибки.Добавить("Ошибка сборки ключа на основании данных из 1-ой формы. Номер задачи [" + СтрокаДанных.НомерЗадачи + "].Отсутствует значение параметра [" + Элемент.Ключ + "].");
			Возврат;	
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаДанных.Акцепт         = СтруктураКлюч.approval_required;
	СтрокаДанных.ДатаВыкупа     = Дата(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураКлюч.offer_date));
	СтрокаДанных.КлючЗадачиJson = ПолучитьСтрокуJSON(СтруктураКлюч); 
	
КонецПроцедуры

Функция ДесериализоватьСтрокуJSON(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Функция ДесериализоватьТабличнуюЧастьЗадачи(МассивДанных)
	
	ТабличнаяЧасть = Новый ТаблицаЗначений;
	ТабличнаяЧасть.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТабличнаяЧасть.Колонки.Добавить("КодКлиента", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ТабличнаяЧасть.Колонки.Добавить("КлиентИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ТабличнаяЧасть.Колонки.Добавить("КодУК", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТабличнаяЧасть.Колонки.Добавить("УКИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ТабличнаяЧасть.Колонки.Добавить("КодБрокера", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТабличнаяЧасть.Колонки.Добавить("БрокерИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ТабличнаяЧасть.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ЭлементДанных Из МассивДанных Цикл
		
		Если ЭлементДанных.columnId = 74 Или ЭлементДанных.columnId = 75 Или ЭлементДанных.columnId = 76 Или ЭлементДанных.columnId = 77 Или ЭлементДанных.columnId = 78 Тогда
			
			СтрокаТаблицы = ТабличнаяЧасть.Найти(Формат(ЭлементДанных.rowId, "ЧГ="), "НомерСтроки");
			
			Если СтрокаТаблицы = Неопределено Тогда
				
				НоваяСтрока = ТабличнаяЧасть.Добавить();
				НоваяСтрока.НомерСтроки = Формат(ЭлементДанных.rowId, "ЧГ=");
				
				Если ЭлементДанных.columnId = 74 Тогда
					НоваяСтрока.КодУК  = ЭлементДанных.value.taskId;
					НоваяСтрока.УКИмя  = ЭлементДанных.value.taskText;
				ИначеЕсли ЭлементДанных.columnId = 75 Тогда
					НоваяСтрока.КлиентИмя  = ЭлементДанных.value;
				ИначеЕсли ЭлементДанных.columnId = 76 Тогда
					НоваяСтрока.КодБрокера  = ЭлементДанных.value.id;
					НоваяСтрока.БрокерИмя   = ЭлементДанных.value.value;
				ИначеЕсли ЭлементДанных.columnId = 77 Тогда 
					НоваяСтрока.КодКлиента  = ЭлементДанных.value;
				ИначеЕсли ЭлементДанных.columnId = 78 Тогда
					НоваяСтрока.Количество  = ЭлементДанных.value;
				КонецЕсли
				
			Иначе
				
				Если ЭлементДанных.columnId = 74 Тогда
					СтрокаТаблицы.КодУК  = ЭлементДанных.value.taskId;
					СтрокаТаблицы.УКИмя  = ЭлементДанных.value.taskText;
				ИначеЕсли ЭлементДанных.columnId = 75 Тогда
					СтрокаТаблицы.КлиентИмя  = ЭлементДанных.value;
				ИначеЕсли ЭлементДанных.columnId = 76 Тогда
					СтрокаТаблицы.КодБрокера  = ЭлементДанных.value.id;
					СтрокаТаблицы.БрокерИмя   = ЭлементДанных.value.value;
				ИначеЕсли ЭлементДанных.columnId = 77 Тогда 
					СтрокаТаблицы.КодКлиента = ЭлементДанных.value;
				ИначеЕсли ЭлементДанных.columnId = 78 Тогда
					СтрокаТаблицы.Количество = ЭлементДанных.value;
				КонецЕсли
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличнаяЧасть;

КонецФункции

Процедура СверитьТабличныеЧасти(Данные1Ф, Данные1С)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные1Ф.НомерСтроки КАК НомерСтроки,
		|	Данные1Ф.КодКлиента КАК КодКлиента,
		|	Данные1Ф.КлиентИмя КАК КлиентИмя,
		|	Данные1Ф.КодБрокера КАК КодБрокера,
		|	Данные1Ф.БрокерИмя КАК БрокерИмя,
		|	Данные1Ф.КодУК КАК КодУК,
		|	Данные1Ф.УКИмя КАК УКИмя,
		|	Данные1Ф.Количество КАК Количество
		|ПОМЕСТИТЬ _ДанныеПервойФормы
		|ИЗ
		|	&Данные1Ф КАК Данные1Ф
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные1С.УКИмя КАК УКИмя,
		|	Данные1С.БрокерИмя КАК БрокерИмя,
		|	Данные1С.КлиентИмя КАК КлиентИмя,
		|	Данные1С.КодКлиента КАК КодКлиента,
		|	Данные1С.КодУК КАК КодУК,
		|	Данные1С.КодБрокера КАК КодБрокера,
		|	Данные1С.Количество КАК Количество
		|ПОМЕСТИТЬ _Данные1С
		|ИЗ
		|	&Данные1С КАК Данные1С
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ДанныеПервойФормы.НомерСтроки) КАК КоличествоСтрок,
		|	_ДанныеПервойФормы.КодКлиента КАК КодКлиента,
		|	_ДанныеПервойФормы.КлиентИмя КАК КлиентИмя,
		|	_ДанныеПервойФормы.КодБрокера КАК КодБрокера,
		|	_ДанныеПервойФормы.БрокерИмя КАК БрокерИмя,
		|	_ДанныеПервойФормы.КодУК КАК КодУК,
		|	_ДанныеПервойФормы.УКИмя КАК УКИмя,
		|	_ДанныеПервойФормы.Количество КАК Количество
		|ПОМЕСТИТЬ _ДублиСтрок
		|ИЗ
		|	_ДанныеПервойФормы КАК _ДанныеПервойФормы
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПервойФормы.КодКлиента,
		|	_ДанныеПервойФормы.КлиентИмя,
		|	_ДанныеПервойФормы.КодБрокера,
		|	_ДанныеПервойФормы.БрокерИмя,
		|	_ДанныеПервойФормы.КодУК,
		|	_ДанныеПервойФормы.УКИмя,
		|	_ДанныеПервойФормы.Количество
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ДанныеПервойФормы.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_Данные1С.КодУК, _ДанныеПервойФормы.КодУК) КАК КодУК,
		|	ЕСТЬNULL(_Данные1С.Количество, 0) КАК Количество1С,
		|	ЕСТЬNULL(_ДанныеПервойФормы.Количество, 0) КАК Количество1Ф,
		|	""<tr><td> "" + ЕСТЬNULL(_Данные1С.УКИмя, ВЫРАЗИТЬ(КодыПервойФормы.Объект КАК Справочник.Организации).Наименование) + ""</td><td> "" + ЕСТЬNULL(_Данные1С.КлиентИмя, _ДанныеПервойФормы.КлиентИмя) + ""</td><td> "" + ЕСТЬNULL(_Данные1С.КодКлиента, _ДанныеПервойФормы.КодКлиента) + ""</td><td> "" + ЕСТЬNULL(_Данные1С.БрокерИмя, _ДанныеПервойФормы.БрокерИмя) + ""</td><td> %1</td><td> %2</td></tr>"" КАК Сообщение,
		|	""Счет ДУ ["" + ЕСТЬNULL(_Данные1С.КлиентИмя, _ДанныеПервойФормы.КлиентИмя) + "", код "" + ЕСТЬNULL(_Данные1С.КодКлиента, _ДанныеПервойФормы.КодКлиента) + ""], УК ["" + ЕСТЬNULL(_Данные1С.УКИмя, ВЫРАЗИТЬ(КодыПервойФормы.Объект КАК Справочник.Организации).Наименование) + ""], брокер ["" + ЕСТЬNULL(_Данные1С.БрокерИмя, _ДанныеПервойФормы.БрокерИмя) + ""]. Было: %1, стало: %2."" КАК КомментарийВЗадачу
		|ИЗ
		|	_ДанныеПервойФормы КАК _ДанныеПервойФормы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Данные1С КАК _Данные1С
		|		ПО _ДанныеПервойФормы.КодУК = _Данные1С.КодУК
		|			И _ДанныеПервойФормы.КодБрокера = _Данные1С.КодБрокера
		|			И _ДанныеПервойФормы.КодКлиента = _Данные1С.КодКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации)) КАК КодыПервойФормы
		|		ПО _ДанныеПервойФормы.КодУК = КодыПервойФормы.Код
		|ГДЕ
		|	ЕСТЬNULL(_Данные1С.Количество, 0) <> ЕСТЬNULL(_ДанныеПервойФормы.Количество, 0)";
	
	Запрос.УстановитьПараметр("Данные1Ф", Данные1Ф.ТабличнаяЧасть);
	Запрос.УстановитьПараметр("Данные1С", Данные1С.ТабличнаяЧасть);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщенияТраст = "";
	ТекстСообщенияРЭМ   = "";
	КомментарийВЗадачуРЭМ = "";
	КомментарийВЗадачуТраст = "";
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщенияРЭМ   = ТекстСообщенияРЭМ   + ?(Выборка.КодУК = "261", ?(ТекстСообщенияРЭМ = "", "", Символы.ПС) + СтрЗаменить(СтрШаблон(Выборка.Сообщение, Выборка.Количество1Ф, Выборка.Количество1С), "<tr>", "<tr class=""line"">"), "");
		ТекстСообщенияТраст = ТекстСообщенияТраст + ?(Выборка.КодУК = "260", ?(ТекстСообщенияТраст = "", "", Символы.ПС) + СтрЗаменить(СтрШаблон(Выборка.Сообщение, Выборка.Количество1Ф, Выборка.Количество1С), "<tr>", "<tr class=""line"">"), "");
		КомментарийВЗадачуРЭМ = КомментарийВЗадачуРЭМ   + ?(Выборка.КодУК = "261", Символы.ПС + СтрШаблон(Выборка.КомментарийВЗадачу, Выборка.Количество1Ф, Выборка.Количество1С), "");
		КомментарийВЗадачуТраст = КомментарийВЗадачуТраст + ?(Выборка.КодУК = "260", Символы.ПС + СтрШаблон(Выборка.КомментарийВЗадачу, Выборка.Количество1Ф, Выборка.Количество1С), "");
					
	КонецЦикла;
	
	СообщениеHTML =
		"<html><head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
		|	<style>
		|		body  { font: 10pt sans-serif; }
		|		table { text-align: left; border-spacing: 0; border-collapse: collapse; }
		|		td    { vertical-align: top; border: 1px solid #CCC085; padding: 5px; }
		|		.top  { font-size: 14px; font-weight: 600; background: #F4ECC5; }
		|		.line { font-size: 12px;}
		|	</style>
		|</head>
		|<body>
		|<p><a href=""http://1f.g1.lan/MaintaskForm.aspx?TaskID=" + Данные1С.НомерЗадачи + """>Задача " + Данные1С.НомерЗадачи + "</a></p> 
		|<table cols=""6""><tr class=""top""><td colspan=""6"">Изменение количества ценных бумаг</td></tr>
		|<tr class=""top""><td>УК</td><td>Счет доверительного управления</td><td>Код</td><td>Брокер</td><td>Было</td><td>Стало</td></tr>ТЕКС_СООБЩЕНИЯ</table></body></html>";
	
	Если ТекстСообщенияРЭМ <> "" Тогда
		
		Данные1С.Сообщения.Вставить("РЭМ", СтрЗаменить(СообщениеHTML, "ТЕКС_СООБЩЕНИЯ", ТекстСообщенияРЭМ));
		
	КонецЕсли;
	
	Если ТекстСообщенияТраст <> "" Тогда
		
		Данные1С.Сообщения.Вставить("Траст", СтрЗаменить(СообщениеHTML, "ТЕКС_СООБЩЕНИЯ", ТекстСообщенияТраст));
		
	КонецЕсли;
	
	Если КомментарийВЗадачуРЭМ <> "" Или КомментарийВЗадачуТраст <> "" Тогда
								
		КомментарийВЗадачу = Новый Структура();
		КомментарийВЗадачу.Вставить("taskId", Данные1Ф.НомерЗадачи);
		КомментарийВЗадачу.Вставить("commentText", "Измненение количества ценных бумаг:" + КомментарийВЗадачуРЭМ + КомментарийВЗадачуТраст);
		КомментарийВЗадачу.Вставить("initiatorUserId", 3686);
		
		Данные1С.Сообщения.Вставить("КомментарийВЗадачу", ПолучитьСтрокуJSON(КомментарийВЗадачу));
		
	Иначе
		
		Если Запрос.МенеджерВременныхТаблиц.Таблицы["_ДублиСтрок"].ПолучитьДанные().Пустой() Тогда //проверка на дубли строк.
			Данные1С.СверитьПерезаписатьТабЧасть = Ложь;
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

Функция СоздатьЗадачиПоОфертам(ПроверятьВесьПериодПредъявления = Ложь) Экспорт
				
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СоздатьЗадачиПоОфертам()";
	ПараметрыДляСтатистики = "ДатаНачалаПредъявления,ДатаФормированияОстатков,РежимПерезаписи" + ?(ЗначениеЗаполнено(ЭтотОбъект.Облигация), ",Облигация","") + ?(ЗначениеЗаполнено(ЭтотОбъект.НомерЗадачи), ",НомерЗадачи", "");
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, ПараметрыДляСтатистики, Новый Структура("ПроверятьВесьПериодПредъявления", ПроверятьВесьПериодПредъявления));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);	
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//для доп. оферт, у которых период предъявления составляет несколько лет (дата выкупа = дате погашения) задачу ставим за три дня до окончания срока предъявления.
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияОферт.Облигация КАК Облигация,
		|	УсловияОферт.Облигация.ГосударственныйРегистрационныйНомер КАК РегНомер,
		|	УсловияОферт.Облигация.Эмитент.Наименование КАК ЭмитентНаименование,
		|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
		|	УсловияОферт.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияОферт.АкцептС КАК АкцептС,
		|	УсловияОферт.АкцептПо КАК АкцептПо,
		|	УсловияОферт.ТолькоДляФизическихЛиц КАК ФлагТолькоДляФЛ,
		|	ВЫБОР
		|		КОГДА УсловияОферт.АкцептПо <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияОферт.АкцептПо
		|		ИНАЧЕ УсловияОферт.ДатаВыкупа
		|	КОНЕЦ КАК КрайняяДатаФиксацииОстатков,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК КраткийКод
		|ПОМЕСТИТЬ _УсловияОферт
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаНП, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО УсловияОферт.Облигация = КодыВТорговыхСистемахСрезПоследних.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоБумаге
		|				ТОГДА УсловияОферт.Облигация = &Облигация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПроверятьВесьПериодПредъявления
		|				ТОГДА УсловияОферт.АкцептС < &ДатаНП
		|						И УсловияОферт.ДатаВыкупа >= &ТекущаяДата
		|						И ВЫБОР
		|							КОГДА УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта)
		|									И УсловияОферт.ДатаВыкупа = УсловияОферт.Облигация.ДатаПогашения
		|								ТОГДА УсловияОферт.АкцептПо МЕЖДУ &ТекущаяДата И &ДатаНП
		|							ИНАЧЕ УсловияОферт.АкцептПо = ДАТАВРЕМЯ(1, 1, 1)
		|									ИЛИ УсловияОферт.АкцептПо >= &ТекущаяДата
		|						КОНЕЦ
		|			ИНАЧЕ УсловияОферт.АкцептС = &ДатаНП
		|					И &ТекущаяДата < УсловияОферт.ДатаВыкупа
		|					И &ТекущаяДата >= УсловияОферт.АкцептС
		|		КОНЕЦ
		|	И УсловияОферт.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияОферт.Облигация КАК Облигация,
		|	_УсловияОферт.РегНомер КАК РегНомер,
		|	_УсловияОферт.ЭмитентНаименование КАК ЭмитентНаименование,
		|	_УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
		|	_УсловияОферт.ЦенаПроцент КАК ЦенаПроцент,
		|	_УсловияОферт.АкцептС КАК АкцептС,
		|	_УсловияОферт.АкцептПо КАК АкцептПо,
		|	_УсловияОферт.ФлагТолькоДляФЛ КАК ФлагТолькоДляФЛ,
		|	_УсловияОферт.КрайняяДатаФиксацииОстатков КАК КрайняяДатаФиксацииОстатков,
		|	_УсловияОферт.КраткийКод КАК КраткийКод
		|ПОМЕСТИТЬ _Оферты
		|ИЗ
		|	_УсловияОферт КАК _УсловияОферт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК ДосрочныеПогашения
		|		ПО _УсловияОферт.Облигация = ДосрочныеПогашения.Облигация
		|			И (ДосрочныеПогашения.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно))
		|			И _УсловияОферт.ДатаВыкупа > ДосрочныеПогашения.ДатаВыкупа
		|ГДЕ
		|	ДосрочныеПогашения.Облигация ЕСТЬ NULL";
#КонецОбласти

	Запрос.УстановитьПараметр("ПроверятьВесьПериодПредъявления", ПроверятьВесьПериодПредъявления);
	Запрос.УстановитьПараметр("ДатаНП", ЭтотОбъект.ДатаНачалаПредъявления);
	Запрос.УстановитьПараметр("ТекущаяДата", ЭтотОбъект.ДатаФормированияОстатков);
	Запрос.УстановитьПараметр("ОтборПоБумаге", ЗначениеЗаполнено(ЭтотОбъект.Облигация));
	Запрос.УстановитьПараметр("Облигация", ЭтотОбъект.Облигация);
	
	Запрос.Выполнить();
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы["_Оферты"].ПолучитьДанные().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат Неопределено;
	КонецЕсли;

	КлючиЗадач = Новый ТаблицаЗначений;	
	КлючиЗадач.Колонки.Добавить("Облигация", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	КлючиЗадач.Колонки.Добавить("КлючЗадачиСАкцептом", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	КлючиЗадач.Колонки.Добавить("КлючЗадачиБезАкцепта", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	Пока Выборка.Следующий() Цикл
			
		НоваяСтрока = КлючиЗадач.Добавить();	
		НоваяСтрока.Облигация = Выборка.Облигация; 
		НоваяСтрока.КлючЗадачиСАкцептом  = ПолучитьСтрокуJSON(Новый Структура("reg_number, offer_date, approval_required", Выборка.РегНомер, Формат(Выборка.ДатаВыкупа, "ДФ=гггг-ММ-дд"), Истина));
		НоваяСтрока.КлючЗадачиБезАкцепта = ПолучитьСтрокуJSON(Новый Структура("reg_number, offer_date, approval_required", Выборка.РегНомер, Формат(Выборка.ДатаВыкупа, "ДФ=гггг-ММ-дд"), Ложь));
		
	КонецЦикла;
		
	//Если есть оферты - создадим таблицу в которую будем собирать данные
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ТекстЗадачиJson", Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("ТекстТабЧастьJson", Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("КлючЗадачиJson", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ТаблицаДанных.Колонки.Добавить("РегНомер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(21)));
	ТаблицаДанных.Колонки.Добавить("ДатаВыкупа", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("АкцептПо", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("НомерЗадачи", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТаблицаДанных.Колонки.Добавить("СоздатьЗадачу", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("СверитьПерезаписатьТабЧасть", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Акцепт", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Сообщения", Новый ОписаниеТипов("Структура"));
	ТаблицаДанных.Колонки.Добавить("КоличествоКлиентов", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	ТаблицаДанных.Колонки.Добавить("ИзменитьКоличествоКлиентов", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("ТабличнаяЧасть", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблицаДанных.Колонки.Добавить("КодыУК");
	ТаблицаДанных.Колонки.Добавить("Ошибки");
	
#Область ТЕКСТ_ЗАПРОСА  
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлючиЗадач.Облигация КАК Облигация,
		|	КлючиЗадач.КлючЗадачиСАкцептом КАК КлючЗадачиСАкцептом,
		|	КлючиЗадач.КлючЗадачиБезАкцепта КАК КлючЗадачиБезАкцепта
		|ПОМЕСТИТЬ _КлючиЗадач
		|ИЗ
		|	&КлючиЗадач КАК КлючиЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|			ТОГДА 1
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧастьСделкиРепо,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаОстатков,
		|			Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_Оферты.Облигация
		|					ИЗ
		|						_Оферты КАК _Оферты)) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияСделокРЕПОСрезПоследних.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаИсполнения
		|	КОНЕЦ КАК ДатаИсполнения,
		|	УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет.Брокер КАК Брокер
		|ПОМЕСТИТЬ _ЗадолженностьПоВсемСделкамРепо
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.Организация КАК Организация,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО КАК СделкаРЕПО,
		|		2 КАК ЧастьСделкиРепо,
		|		ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ * ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|				&ДатаОстатков,
		|				Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							_Оферты.Облигация
		|						ИЗ
		|							_Оферты КАК _Оферты)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоЦеннымБумагамОстатки.Организация,
		|		_ЗадолженностьПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
		|		_ЗадолженностьПоЦеннымБумагамОстатки.ЦеннаяБумага,
		|		_ЗадолженностьПоЦеннымБумагамОстатки.Основание,
		|		_ЗадолженностьПоЦеннымБумагамОстатки.ЧастьСделкиРепо,
		|		ВЫБОР
		|			КОГДА _ЗадолженностьПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ * _ЗадолженностьПоЦеннымБумагамОстатки.КоличествоОстаток
		|	ИЗ
		|		_ЗадолженностьПоЦеннымБумагамОстатки КАК _ЗадолженностьПоЦеннымБумагамОстатки
		|	ГДЕ
		|		_ЗадолженностьПоЦеннымБумагамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ВложенныйЗапрос.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ВложенныйЗапрос.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И ВложенныйЗапрос.ЧастьСделкиРепо = УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоВсемСделкамРепо.Организация КАК Организация,
		|	_ЗадолженностьПоВсемСделкамРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗадолженностьПоВсемСделкамРепо.Брокер КАК Брокер,
		|	СУММА(_ЗадолженностьПоВсемСделкамРепо.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкамРепоИтоги
		|ИЗ
		|	_Оферты КАК _Оферты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьПоВсемСделкамРепо КАК _ЗадолженностьПоВсемСделкамРепо
		|		ПО _Оферты.Облигация = _ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага
		|			И (ВЫБОР
		|				КОГДА _ЗадолженностьПоВсемСделкамРепо.ЧастьСделкиРепо = 1
		|					ТОГДА ИСТИНА
		|				КОГДА _ЗадолженностьПоВсемСделкамРепо.ЧастьСделкиРепо = 2
		|					ТОГДА _ЗадолженностьПоВсемСделкамРепо.КоличествоОстаток < 0
		|							ИЛИ _Оферты.КрайняяДатаФиксацииОстатков >= _ЗадолженностьПоВсемСделкамРепо.ДатаИсполнения
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоВсемСделкамРепо.Организация,
		|	_ЗадолженностьПоВсемСделкамРепо.СчетДоверительногоУправления,
		|	_ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага,
		|	_ЗадолженностьПоВсемСделкамРепо.Брокер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоЦеннымБумагамОстатки.Организация КАК Организация,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	_ЗадолженностьПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.Сделка.Брокер КАК Брокер,
		|	ВЫБОР
		|		КОГДА _ЗадолженностьПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * _ЗадолженностьПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияСделокСрезПоследних.ДатаПоставки
		|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаИсполнения
		|	КОНЕЦ КАК ДатаИсполнения
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкам
		|ИЗ
		|	_ЗадолженностьПоЦеннымБумагамОстатки КАК _ЗадолженностьПоЦеннымБумагамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних КАК УсловияСделокСрезПоследних
		|		ПО _ЗадолженностьПоЦеннымБумагамОстатки.Организация = УсловияСделокСрезПоследних.Организация
		|			И _ЗадолженностьПоЦеннымБумагамОстатки.СчетДоверительногоУправления = УсловияСделокСрезПоследних.СчетДоверительногоУправления
		|			И _ЗадолженностьПоЦеннымБумагамОстатки.Основание = УсловияСделокСрезПоследних.Сделка
		|			И _ЗадолженностьПоЦеннымБумагамОстатки.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|ГДЕ
		|	_ЗадолженностьПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораСчетаДУ,
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.Брокер КАК Брокер,
		|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкамИтоги
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ЗадолженностьПоСделкам.Организация КАК Организация,
		|		_ЗадолженностьПоСделкам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ЗадолженностьПоСделкам.Основание КАК Основание,
		|		_ЗадолженностьПоСделкам.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ЗадолженностьПоСделкам.Брокер КАК Брокер,
		|		_ЗадолженностьПоСделкам.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		_Оферты КАК _Оферты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьПоСделкам КАК _ЗадолженностьПоСделкам
		|			ПО _Оферты.Облигация = _ЗадолженностьПоСделкам.ЦеннаяБумага
		|				И (_ЗадолженностьПоСделкам.КоличествоОстаток < 0
		|					ИЛИ _ЗадолженностьПоСделкам.КоличествоОстаток > 0
		|						И _Оферты.КрайняяДатаФиксацииОстатков >= _ЗадолженностьПоСделкам.ДатаИсполнения)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	ВложенныйЗапрос.Брокер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.Организация, _ЗадолженностьПоСделкамИтоги.Организация) КАК Организация,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления, _ЗадолженностьПоСделкамИтоги.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления, _ЗадолженностьПоСделкамИтоги.ВидДоговораСчетаДУ) КАК ВидДоговораСчетаДУ,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага, _ЗадолженностьПоСделкамИтоги.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Брокер, _ЗадолженностьПоСделкамИтоги.Брокер) КАК Брокер,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкамИтоги.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаОстатков,
		|			Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_Оферты.Облигация
		|					ИЗ
		|						_Оферты КАК _Оферты)) КАК ОстаткиЦенныхБумагОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗадолженностьПоСделкамИтоги КАК _ЗадолженностьПоСделкамИтоги
		|		ПО ОстаткиЦенныхБумагОстатки.Организация = _ЗадолженностьПоСделкамИтоги.Организация
		|			И ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = _ЗадолженностьПоСделкамИтоги.СчетДоверительногоУправления
		|			И ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = _ЗадолженностьПоСделкамИтоги.ЦеннаяБумага
		|			И ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Брокер = _ЗадолженностьПоСделкамИтоги.Брокер
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкамИтоги.КоличествоОстаток, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумаг.Организация КАК Организация,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумаг.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиЦенныхБумаг.ВидДоговораСчетаДУ КАК ВидДоговораСчетаДУ,
		|	_ОстаткиЦенныхБумаг.Брокер КАК Брокер,
		|	_Оферты.Облигация КАК Облигация,
		|	_Оферты.РегНомер КАК РегНомер,
		|	_Оферты.ЭмитентНаименование КАК ЭмитентНаименование,
		|	_Оферты.КраткийКод КАК КраткийКод,
		|	_Оферты.ДатаВыкупа КАК ДатаВыкупа,
		|	_Оферты.ЦенаПроцент КАК ЦенаПроцент,
		|	_Оферты.АкцептС КАК АкцептС,
		|	_Оферты.АкцептПо КАК АкцептПо
		|ПОМЕСТИТЬ _УсловияОфертСОстатками
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Оферты КАК _Оферты
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = _Оферты.Облигация
		|			И (ВЫБОР
		|				КОГДА _Оферты.ФлагТолькоДляФЛ
		|					ТОГДА _ОстаткиЦенныхБумаг.ВидДоговораСчетаДУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА НЕ БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС ЕСТЬ NULL
		|				И БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД)
		|			ТОГДА ""до погашения""
		|		КОГДА НЕ БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС ЕСТЬ NULL
		|				И БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|			ТОГДА ""по амортизированной стоимости кроме бумаг до погашения""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КлассификацияЦенныхБумаг,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _КлассификацияЦБ
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаОстатков,
		|			Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И УчетныйАктивЕПС В (&УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости)
		|				И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации) В
		|					(ВЫБРАТЬ
		|						_Оферты.Облигация
		|					ИЗ
		|						_Оферты)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлассификацияЦБ.Организация КАК Организация,
		|	_КлассификацияЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КлассификацияЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_КлассификацияЦБ.КлассификацияЦенныхБумаг КАК КлассификацияЦенныхБумаг,
		|	_КлассификацияЦБ.КоличествоОстаток КАК КоличествоОстаток,
		|	ВложенныйЗапрос.КоличествоКлассов КАК КоличествоКлассов
		|ПОМЕСТИТЬ _ОстаткиБухПартииСКлассификациейЦБ
		|ИЗ
		|	_КлассификацияЦБ КАК _КлассификацияЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КлассификацияЦБ.Организация КАК Организация,
		|			_КлассификацияЦБ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_КлассификацияЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _КлассификацияЦБ.КлассификацияЦенныхБумаг) КАК КоличествоКлассов
		|		ИЗ
		|			_КлассификацияЦБ КАК _КлассификацияЦБ
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КлассификацияЦБ.Организация,
		|			_КлассификацияЦБ.СчетДоверительногоУправления,
		|			_КлассификацияЦБ.ЦеннаяБумага) КАК ВложенныйЗапрос
		|		ПО _КлассификацияЦБ.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _КлассификацияЦБ.ЦеннаяБумага = ВложенныйЗапрос.ЦеннаяБумага
		|			И _КлассификацияЦБ.Организация = ВложенныйЗапрос.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияОфертСОстатками.Организация КАК Организация,
		|	_УсловияОфертСОстатками.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияОфертСОстатками.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_УсловияОфертСОстатками.КоличествоОстаток + ЕСТЬNULL(_ЗадолженностьПоСделкамРепоИтоги.КоличествоОстаток, 0) КАК ОстатокСУчетомРепо,
		|	_УсловияОфертСОстатками.Брокер КАК Брокер,
		|	ЕСТЬNULL(НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование, ЛОЖЬ) КАК ТребуетсяАкцепт,
		|	ВЫБОР
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.КонтрольСаморегулируемыхОрганизаций), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций))
		|			ТОГДА ""СРО""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний))
		|			ТОГДА ""СК""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов)
		|			ТОГДА ""АИФ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ)
		|			ТОГДА ""ФОГФ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА ""РВИ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов))
		|			ТОГДА ""ЮЛ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""УК СС""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ""ПИФ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА ВЫБОР
		|					КОГДА &ДатаОстатков > ДАТАВРЕМЯ(2022, 3, 15)
		|						ТОГДА ""ПФР""
		|					ИНАЧЕ ""Не подаем""
		|				КОНЕЦ
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
		|			ТОГДА ""ФЛ""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""ПН""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""ПР""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""СС""
		|		КОГДА _УсловияОфертСОстатками.ВидДоговораСчетаДУ = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|			ТОГДА ""ИИС""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипКлиента,
		|	_УсловияОфертСОстатками.РегНомер КАК РегНомер,
		|	_УсловияОфертСОстатками.ЭмитентНаименование КАК ЭмитентНаименование,
		|	_УсловияОфертСОстатками.КраткийКод КАК КраткийКод,
		|	_УсловияОфертСОстатками.ДатаВыкупа КАК ДатаВыкупа,
		|	_УсловияОфертСОстатками.ЦенаПроцент КАК ЦенаПроцент,
		|	_УсловияОфертСОстатками.АкцептС КАК АкцептС,
		|	_УсловияОфертСОстатками.АкцептПо КАК АкцептПо,
		|	ЕСТЬNULL(_ОстаткиБухПартииСКлассификациейЦБ.КлассификацияЦенныхБумаг, """") КАК КлассификацияЦенныхБумаг,
		|	ЕСТЬNULL(_ОстаткиБухПартииСКлассификациейЦБ.КоличествоОстаток, 0) КАК ОстатокСУчетомКлассификации,
		|	ЕСТЬNULL(_ОстаткиБухПартииСКлассификациейЦБ.КоличествоКлассов, 1) КАК КоличествоКлассов
		|ПОМЕСТИТЬ _ОстаткиЦБ
		|ИЗ
		|	_УсловияОфертСОстатками КАК _УсловияОфертСОстатками
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоСделкамРепоИтоги КАК _ЗадолженностьПоСделкамРепоИтоги
		|		ПО _УсловияОфертСОстатками.Организация = _ЗадолженностьПоСделкамРепоИтоги.Организация
		|			И _УсловияОфертСОстатками.СчетДоверительногоУправления = _ЗадолженностьПоСделкамРепоИтоги.СчетДоверительногоУправления
		|			И _УсловияОфертСОстатками.Брокер = _ЗадолженностьПоСделкамРепоИтоги.Брокер
		|			И _УсловияОфертСОстатками.ЦеннаяБумага = _ЗадолженностьПоСделкамРепоИтоги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
		|				&ДатаОстатков,
		|				Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.СогласиеНаОферту)) КАК НастройкиАкцептованияОперацийСрезПоследних
		|		ПО _УсловияОфертСОстатками.Организация = НастройкиАкцептованияОперацийСрезПоследних.Организация
		|			И _УсловияОфертСОстатками.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиБухПартииСКлассификациейЦБ КАК _ОстаткиБухПартииСКлассификациейЦБ
		|		ПО _УсловияОфертСОстатками.Организация = _ОстаткиБухПартииСКлассификациейЦБ.Организация
		|			И _УсловияОфертСОстатками.СчетДоверительногоУправления = _ОстаткиБухПартииСКлассификациейЦБ.СчетДоверительногоУправления
		|			И _УсловияОфертСОстатками.ЦеннаяБумага = _ОстаткиБухПартииСКлассификациейЦБ.ЦеннаяБумага
		|ГДЕ
		|	_УсловияОфертСОстатками.КоличествоОстаток + ЕСТЬNULL(_ЗадолженностьПоСделкамРепоИтоги.КоличествоОстаток, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыПервойФормы.Объект КАК Объект,
		|	КодыПервойФормы.ГруппаОбъектов КАК ГруппаОбъектов,
		|	КодыПервойФормы.Код КАК Код
		|ПОМЕСТИТЬ _КодыПервойФормы
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&ДатаОстатков,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации), &ГруппаБрокерскиеКомпании)
		|				И Объект В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ОстаткиЦБ.Организация КАК Объект
		|					ИЗ
		|						_ОстаткиЦБ КАК _ОстаткиЦБ
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_ОстаткиЦБ.Брокер
		|					ИЗ
		|						_ОстаткиЦБ КАК _ОстаткиЦБ)) КАК КодыПервойФормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.Наименование КАК БрокерНаименование,
		|	_КодыПервойФормы.Код КАК КодБрокераВПервойФорме,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодКлиента,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер КАК ОсновнойБрокер
		|ПОМЕСТИТЬ _ВсеКодыУБрокеров
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаОстатков,
		|			Организация В (&ОрганизацияТраст, &ОрганизацияРЭМ)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ОстаткиЦБ.СчетДоверительногоУправления
		|					ИЗ
		|						_ОстаткиЦБ КАК _ОстаткиЦБ)
		|				И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаОстатков
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаОстатков, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыПервойФормы КАК _КодыПервойФормы
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = _КодыПервойФормы.Объект
		|			И (_КодыПервойФормы.ГруппаОбъектов = &ГруппаБрокерскиеКомпании)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаОстатков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.БрокерНаименование КАК БрокерНаименование,
		|	_ВсеКодыУБрокеров.КодБрокераВПервойФорме КАК КодБрокераВПервойФорме,
		|	_ВсеКодыУБрокеров.КодКлиента КАК КодКлиента
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокеров
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.КодКлиента) КАК КоличествоКодов
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.КодКлиента) = 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦБ.ЦеннаяБумага КАК Облигация,
		|	_ОстаткиЦБ.РегНомер КАК РегНомер,
		|	_ОстаткиЦБ.ЭмитентНаименование КАК ЭмитентНаименование,
		|	_ОстаткиЦБ.КраткийКод КАК КраткийКод,
		|	_ОстаткиЦБ.ДатаВыкупа КАК ДатаВыкупа,
		|	_ОстаткиЦБ.ЦенаПроцент КАК ЦенаПроцент,
		|	_ОстаткиЦБ.АкцептС КАК АкцептС,
		|	_ОстаткиЦБ.АкцептПо КАК АкцептПо,
		|	_ОстаткиЦБ.ТребуетсяАкцепт КАК ТребуетсяАкцепт,
		|	_ОстаткиЦБ.Организация КАК Организация,
		|	_ОстаткиЦБ.Организация.Наименование КАК ОрганизацияНаименование,
		|	_КодыПервойФормы.Код КАК КодУК,
		|	ВложенныйЗапрос.КоличествоКлиентов КАК КоличествоКлиентов,
		|	_ОстаткиЦБ.СчетДоверительногоУправления.Наименование КАК СчетДУНаименование,
		|	ВЫБОР
		|		КОГДА _ОстаткиЦБ.КоличествоКлассов > 1
		|			ТОГДА _ОстаткиЦБ.ОстатокСУчетомКлассификации
		|		ИНАЧЕ _ОстаткиЦБ.ОстатокСУчетомРепо
		|	КОНЕЦ КАК Количество,
		|	_ОстаткиЦБ.КлассификацияЦенныхБумаг КАК КлассификацияЦенныхБумаг,
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.КодКлиента, КодыУОсновногоБрокера.КодКлиента) КАК КодКлиентаУБрокера,
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.БрокерНаименование, КодыУОсновногоБрокера.БрокерНаименование) КАК БрокерНаименование,
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.КодБрокераВПервойФорме, КодыУОсновногоБрокера.КодБрокераВПервойФорме) КАК КодБрокера,
		|	_ОстаткиЦБ.ТипКлиента КАК ТипКлиента,
		|	ВЫБОР
		|		КОГДА _ОстаткиЦБ.ТребуетсяАкцепт
		|			ТОГДА _КлючиЗадач.КлючЗадачиСАкцептом
		|		ИНАЧЕ _КлючиЗадач.КлючЗадачиБезАкцепта
		|	КОНЕЦ КАК КлючЗадачи
		|ПОМЕСТИТЬ _ДанныеДляФормированияЗадач
		|ИЗ
		|	_ОстаткиЦБ КАК _ОстаткиЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокеров КАК _ЕдиничныеКодыУБрокеров
		|		ПО _ОстаткиЦБ.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК КодыУОсновногоБрокера
		|		ПО _ОстаткиЦБ.СчетДоверительногоУправления = КодыУОсновногоБрокера.СчетДоверительногоУправления
		|			И (КодыУОсновногоБрокера.ОсновнойБрокер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ОстаткиЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|			_ОстаткиЦБ.ТребуетсяАкцепт КАК ТребуетсяАкцепт,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ОстаткиЦБ.СчетДоверительногоУправления) КАК КоличествоКлиентов
		|		ИЗ
		|			_ОстаткиЦБ КАК _ОстаткиЦБ
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ОстаткиЦБ.ЦеннаяБумага,
		|			_ОстаткиЦБ.ТребуетсяАкцепт) КАК ВложенныйЗапрос
		|		ПО _ОстаткиЦБ.ЦеннаяБумага = ВложенныйЗапрос.ЦеннаяБумага
		|			И _ОстаткиЦБ.ТребуетсяАкцепт = ВложенныйЗапрос.ТребуетсяАкцепт
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КлючиЗадач КАК _КлючиЗадач
		|		ПО _ОстаткиЦБ.ЦеннаяБумага = _КлючиЗадач.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыПервойФормы КАК _КодыПервойФормы
		|		ПО _ОстаткиЦБ.Организация = _КодыПервойФормы.Объект
		|			И (_КодыПервойФормы.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДляФормированияЗадач.Облигация КАК Облигация,
		|	ДанныеДляФормированияЗадач.КлассификацияЦенныхБумаг КАК КлассификацияЦенныхБумаг,
		|	ДанныеДляФормированияЗадач.ТребуетсяАкцепт КАК ТребуетсяАкцепт,
		|	ДанныеДляФормированияЗадач.РегНомер КАК РегНомер,
		|	ДанныеДляФормированияЗадач.ЭмитентНаименование КАК ЭмитентНаименование,
		|	ДанныеДляФормированияЗадач.КраткийКод КАК КраткийКод,
		|	ДанныеДляФормированияЗадач.ДатаВыкупа КАК ДатаВыкупа,
		|	ДанныеДляФормированияЗадач.ЦенаПроцент КАК ЦенаПроцент,
		|	ДанныеДляФормированияЗадач.АкцептС КАК АкцептС,
		|	ДанныеДляФормированияЗадач.АкцептПо КАК АкцептПо,
		|	ДанныеДляФормированияЗадач.Организация КАК Организация,
		|	ДанныеДляФормированияЗадач.ОрганизацияНаименование КАК ОрганизацияНаименование,
		|	ДанныеДляФормированияЗадач.КодУК КАК КодУК,
		|	ДанныеДляФормированияЗадач.КоличествоКлиентов КАК КоличествоКлиентов,
		|	ДанныеДляФормированияЗадач.СчетДУНаименование КАК СчетДУНаименование,
		|	ДанныеДляФормированияЗадач.Количество КАК Количество,
		|	ДанныеДляФормированияЗадач.КодКлиентаУБрокера КАК КодКлиентаУБрокера,
		|	ДанныеДляФормированияЗадач.БрокерНаименование КАК БрокерНаименование,
		|	ДанныеДляФормированияЗадач.КодБрокера КАК КодБрокера,
		|	ДанныеДляФормированияЗадач.ТипКлиента КАК ТипКлиента,
		|	ДанныеДляФормированияЗадач.КлючЗадачи КАК КлючЗадачи,
		|	НомераТранзакций.Номер КАК НомерЗадачи
		|ИЗ
		|	_ДанныеДляФормированияЗадач КАК ДанныеДляФормированияЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераТранзакций КАК НомераТранзакций
		|		ПО ДанныеДляФормированияЗадач.Облигация = НомераТранзакций.Субъект
		|			И ДанныеДляФормированияЗадач.КлючЗадачи = НомераТранзакций.Ключ
		|			И (НомераТранзакций.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоНомеру
		|				ТОГДА НомераТранзакций.Номер = &НомерЗадачи
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|ИТОГИ ПО
		|	Облигация,
		|	ДатаВыкупа,
		|	ТребуетсяАкцепт";
#КонецОбласти

	Запрос.УстановитьПараметр("ОтборПоНомеру", ЗначениеЗаполнено(ЭтотОбъект.НомерЗадачи));
	Запрос.УстановитьПараметр("НомерЗадачи", СокрЛП(ЭтотОбъект.НомерЗадачи));
	Запрос.УстановитьПараметр("КлючиЗадач", КлючиЗадач);
	Запрос.УстановитьПараметр("ДатаОстатков", ЭтотОбъект.ДатаФормированияОстатков);
	Запрос.УстановитьПараметр("ОрганизацияРЭМ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("ОрганизацияТраст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	Запрос.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости", Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости());
	Запрос.УстановитьПараметр("ГруппаБрокерскиеКомпании", Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("Брокерские компании"));
	
	ГруппировкаПоЦБ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоЦБ.Следующий() Цикл
		
		ГруппировкаПоДатеВыкупа = ГруппировкаПоЦБ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоДатеВыкупа.Следующий() Цикл 
		
			ГруппировкаПоАкцепту = ГруппировкаПоДатеВыкупа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ГруппировкаПоАкцепту.Следующий() Цикл
				
				ТабличнаяЧасть = Новый ТаблицаЗначений;
				ТабличнаяЧасть.Колонки.Добавить("КлиентИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
				ТабличнаяЧасть.Колонки.Добавить("УКИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
				ТабличнаяЧасть.Колонки.Добавить("БрокерИмя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
				ТабличнаяЧасть.Колонки.Добавить("КодКлиента", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
				ТабличнаяЧасть.Колонки.Добавить("КодУК", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
				ТабличнаяЧасть.Колонки.Добавить("КодБрокера", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
				ТабличнаяЧасть.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
				
				СтрокиТабЧасти = Новый Массив;
				МассивОшибок   = Новый Массив;
				МассивКодовУК  = Новый Массив;
				НомерСтроки    = 0;

				ДетальныеЗаписи = ГруппировкаПоАкцепту.Выбрать();
				
				Пока ДетальныеЗаписи.Следующий() Цикл
				
					Если ПустаяСтрока(ДетальныеЗаписи.КодБрокера) Тогда
						МассивОшибок.Добавить("Не удалось однозначно определить код у брокера [" + ДетальныеЗаписи.БрокерНаименование + "] для клиента [" + ДетальныеЗаписи.СчетДУНаименование + "] . Для постановки задачи в 1-ой Форме необходим код брокера.");
					КонецЕсли;
					
					Если ПустаяСтрока(ДетальныеЗаписи.КодУК) Тогда
						МассивОшибок.Добавить("Не удалось определить код УК [" + ДетальныеЗаписи.ОрганизацияНаименование + "]. Для постановки задачи в 1-ой Форме необходим код УК.");
					КонецЕсли;
					
					Если ПустаяСтрока(ДетальныеЗаписи.ТипКлиента) Тогда
						МассивОшибок.Добавить("Не удалось определить тип клиента счета ДУ [" + ДетальныеЗаписи.СчетДУНаименование + "]. Для постановки задачи в 1-ой Форме необходим тип счета ДУ.");
					КонецЕсли;
					
					Если ПустаяСтрока(ДетальныеЗаписи.РегНомер) Тогда
						МассивОшибок.Добавить("У бумаги отсутствует рег. номер [" + ДетальныеЗаписи.Облигация + "]. Для постановки задачи в 1-ой Форме необходим рег.номер ценной бумаги.");	
					КонецЕсли;
					
					Если ПустаяСтрока(ДетальныеЗаписи.КодКлиентаУБрокера) Тогда
						МассивОшибок.Добавить("Не удалось определить код клиента [" + ДетальныеЗаписи.СчетДУНаименование + "] у брокера.");	
					КонецЕсли;
					
					Если ПустаяСтрока(ДетальныеЗаписи.БрокерНаименование) Тогда
						МассивОшибок.Добавить("Не удалось определить брокера для клиента [" + ДетальныеЗаписи.СчетДУНаименование + "] в регистре [Коды счетов доверительного управления у брокера].");	
					КонецЕсли;
					
					Если МассивОшибок.Количество() > 0 Тогда
						
						Для Каждого ТекСообщение Из МассивОшибок Цикл
							ЗарегистрироватьОшибку(ТекСообщение);	
						КонецЦикла;
						
					    Продолжить;
						
					КонецЕсли;
					
					Если НомерСтроки = 0 Тогда // Новая задача
						
						ТекстЗадачи = "" + ДетальныеЗаписи.ЭмитентНаименование + " (" + ДетальныеЗаписи.КраткийКод + ").";
						
						МассивПараметров = Новый Массив();
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 301, "Text", "Эмитент", ДетальныеЗаписи.ЭмитентНаименование));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 185, "Text", "Регистрационный номер", ДетальныеЗаписи.РегНомер));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 469, "Date", "Дата выкупа", Формат(ДетальныеЗаписи.ДатаВыкупа, "ДФ=гггг-ММ-дд")));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 468, "Date", "Дата начала периода предъявления", Формат(ДетальныеЗаписи.АкцептС, "ДФ=гггг-ММ-дд")));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 474, "Date", "Окончание периода предъявления", Формат(ДетальныеЗаписи.АкцептПо, "ДФ=гггг-ММ-дд")));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 524, "Text", "Цена выкупа", Строка(ДетальныеЗаписи.ЦенаПроцент)));
						МассивПараметров.Добавить(Новый Структура("id, type, name, value", 1398, "Int", "Общее количество клиентов компаний", Строка(Формат(ДетальныеЗаписи.КоличествоКлиентов, "ЧГ=0"))));
																
						Если ДетальныеЗаписи.ТребуетсяАкцепт Тогда
							
							ТекстЗадачи = ТекстЗадачи + " Требуется согласование юристов.";
							МассивПараметров.Добавить(Новый Структура("id, name, value", 1181, "Неликвид", "1"));  //старый ид  1179
							
						КонецЕсли;
										
						НоваяСтрока = ТаблицаДанных.Добавить();
						НоваяСтрока.ТекстЗадачиJson    = ПолучитьСтрокуJSON(Новый Структура("subcatId, userToMakeOwnerId, priorityId, taskText, extParams", 186, 3686, 1, ТекстЗадачи, МассивПараметров)); //owner - ID постановщика задачи  3649
						НоваяСтрока.КлючЗадачиJson     = ДетальныеЗаписи.КлючЗадачи;						
						НоваяСтрока.ЦеннаяБумага       = ДетальныеЗаписи.Облигация;
						НоваяСтрока.НомерЗадачи        = ДетальныеЗаписи.НомерЗадачи;
						НоваяСтрока.РегНомер           = ДетальныеЗаписи.РегНомер;
						НоваяСтрока.ДатаВыкупа         = ДетальныеЗаписи.ДатаВыкупа;
						НоваяСтрока.АкцептПо           = ДетальныеЗаписи.АкцептПо;
						НоваяСтрока.Ошибки             = МассивОшибок;
						НоваяСтрока.КоличествоКлиентов = Строка(Формат(ДетальныеЗаписи.КоличествоКлиентов, "ЧГ=0"));
											
					КонецЕсли;
					
					НоваяСтрокаТабЧасти = ТабличнаяЧасть.Добавить();
					НоваяСтрокаТабЧасти.КлиентИмя  = ДетальныеЗаписи.СчетДУНаименование;
					НоваяСтрокаТабЧасти.УКИмя      = ДетальныеЗаписи.ОрганизацияНаименование;
					НоваяСтрокаТабЧасти.БрокерИмя  = ДетальныеЗаписи.БрокерНаименование;
					НоваяСтрокаТабЧасти.КодКлиента = ДетальныеЗаписи.КодКлиентаУБрокера;
					НоваяСтрокаТабЧасти.КодУК      = ДетальныеЗаписи.КодУК;
					НоваяСтрокаТабЧасти.КодБрокера = ДетальныеЗаписи.КодБрокера;
					НоваяСтрокаТабЧасти.Количество = ДетальныеЗаписи.Количество;
					
					МассивПараметровСтроки = Новый Массив;
					МассивПараметровСтроки.Добавить(Новый Структура("id, value", 74, ДетальныеЗаписи.КодУК)); // УК.260 - Регион Траст, 261 - РЭМ
				    МассивПараметровСтроки.Добавить(Новый Структура("id, value", 75, ДетальныеЗаписи.СчетДУНаименование)); //Клиент
				    МассивПараметровСтроки.Добавить(Новый Структура("id, value", 79, ДетальныеЗаписи.ТипКлиента));  
				    МассивПараметровСтроки.Добавить(Новый Структура("id, value, dataSourceItemId", 76, ДетальныеЗаписи.БрокерНаименование, ДетальныеЗаписи.КодБрокера)); // брокер - БК Регион - 68, ГПБ - 69, Кит Финанс - 70, ВБРР - 72
					МассивПараметровСтроки.Добавить(Новый Структура("id, value", 77, ДетальныеЗаписи.КодКлиентаУБрокера)); //Код у брокера
					МассивПараметровСтроки.Добавить(Новый Структура("id, value", 78, ДетальныеЗаписи.Количество)); // Количество
					МассивПараметровСтроки.Добавить(Новый Структура("id, value", 144, ДетальныеЗаписи.КлассификацияЦенныхБумаг)); // Классификация

					СтрокиТабЧасти.Добавить(Новый Структура("id, modifyType, cols", НомерСтроки, "create", МассивПараметровСтроки));
					
					Если МассивКодовУК.Найти(ДетальныеЗаписи.КодУК) = Неопределено Тогда
						МассивКодовУК.Добавить(ДетальныеЗаписи.КодУК);	
					КонецЕсли;
					
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;
					
				НоваяСтрока.КодыУК            = МассивКодовУК;
				НоваяСтрока.ТекстТабЧастьJson = ПолучитьСтрокуJSON(Новый Структура("rows", СтрокиТабЧасти));
				НоваяСтрока.ТабличнаяЧасть    = ТабличнаяЧасть;
				
			КонецЦикла;
				
		КонецЦикла;
	
	КонецЦикла; 
	
	ДопПараметрыДляСбораСтатистики = Новый Структура;
	МассивНомеровЗадач = Новый Массив;
	
	Если ТаблицаДанных.Количество() > 0 Тогда		
		ПоставитьЗадачиВПервойФорме(ТаблицаДанных, МассивНомеровЗадач);		
	КонецЕсли;
	
	Если МассивНомеровЗадач.Количество() > 0 Тогда
		ДопПараметрыДляСбораСтатистики.Вставить("СозданныеЗадачи", РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивНомеровЗадач, ","));
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДопПараметрыДляСбораСтатистики);
	
	Возврат МассивНомеровЗадач;
			
КонецФункции

Процедура ПроверитьОфертыПоступившихНовыхОблигаций() Экспорт
	
	//Если в портфеле появилась новая ценная бумга, проверяем наличие оферт по бумаге (доп. оферта и обязательное досрочное погашение), и формируем сообщение об офертах.	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПроверитьОфертыПоступившихНовыхОблигаций()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм);
	
	ТемаПисьма = "ВАЖНО! Новые данные об оферте.";
	
	//Собираем количество НОВЫХ ценных бумаг поступивших в портфель.
	//Анализируем обороты остатков за три предыдущих рабочих дня + задолженность по поручениям, задолженность по сделкам, задолженность по сделкам репо
	//Задолженность по сделкам и по поручениям: Учитываем всю кредиторскую задолженность (есть обязательство – должны исполнить) + дебиторскую задолженность, которая исполнится до или в крайнюю дату предъявления по оферте (бумаги, которые поступят позже крайней даты предъявления нам не интересны).
	//Задолженность по сделкам Репо: Учитываем всю задолженность по первой части репо. По второй части репо учитываем всю кредиторскую задолженность (т.к. у нас есть обязательство и мы должны его исполнить, т.е. мы не можем скинуть эти бумаги по оферте) + дебиторскую задолженность, которая исполнится до или в крайнюю дату предъявления по оферте.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.Организация КАК Организация
		|ПОМЕСТИТЬ _ДействующиеСчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация В (&РЭМ, &Траст)
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &МинусТриРабочихДня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.Организация КАК Организация,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагОстаткиИОбороты
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			&МинусТриРабочихДня,
		|			&КонецТекущегоДня,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация В (&РЭМ, &Траст)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ДействующиеСчетаДоверительногоУправления.Ссылка
		|					ИЗ
		|						_ДействующиеСчетаДоверительногоУправления КАК _ДействующиеСчетаДоверительногоУправления)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.Организация КАК Организация,
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ПоступившиеНовыеЦенныеБумаги
		|ИЗ
		|	_ОстаткиЦенныхБумагОстаткиИОбороты КАК _ОстаткиЦенныхБумагОстаткиИОбороты
		|ГДЕ
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА УсловияСделокСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияСделокСрезПоследних.ДатаПоставки
		|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаИсполнения
		|	КОНЕЦ КАК ДатаИсполнения,
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага ЕСТЬ NULL КАК НоваяЦеннаяБумага
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамПоСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&КонецТекущегоДня,
		|			Организация В (&РЭМ, &Траст)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ДействующиеСчетаДоверительногоУправления.Ссылка
		|					ИЗ
		|						_ДействующиеСчетаДоверительногоУправления КАК _ДействующиеСчетаДоверительногоУправления)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагОстаткиИОбороты КАК _ОстаткиЦенныхБумагОстаткиИОбороты
		|		ПО ЗадолженностиПоЦеннымБумагамОстатки.Организация = _ОстаткиЦенныхБумагОстаткиИОбороты.Организация
		|			И ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления = _ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления
		|			И ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага = _ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				,
		|				Организация В (&РЭМ, &Траст)
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК УсловияСделокСрезПоследних
		|		ПО ЗадолженностиПоЦеннымБумагамОстатки.Организация = УсловияСделокСрезПоследних.Организация
		|			И ЗадолженностиПоЦеннымБумагамОстатки.Основание = УсловияСделокСрезПоследних.Сделка
		|			И ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДатаИсполненияПо КАК ДатаИсполнения,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага ЕСТЬ NULL КАК НоваяЦеннаяБумага
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамПоПоручениям
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагамПоПоручениям.Остатки(
		|			&КонецТекущегоДня,
		|			Организация В (&РЭМ, &Траст)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ДействующиеСчетаДоверительногоУправления.Ссылка
		|					ИЗ
		|						_ДействующиеСчетаДоверительногоУправления КАК _ДействующиеСчетаДоверительногоУправления)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагОстаткиИОбороты КАК _ОстаткиЦенныхБумагОстаткиИОбороты
		|		ПО ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Организация = _ОстаткиЦенныхБумагОстаткиИОбороты.Организация
		|			И ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.СчетДоверительногоУправления = _ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления
		|			И ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.ЦеннаяБумага = _ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага
		|ГДЕ
		|	ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДатаИсполненияПо <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент ССЫЛКА Справочник.ЮрФизЛица
		|		И ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо) КАК ФизЛицо,
		|	МИНИМУМ(ВложенныйЗапрос.ДатаФиксацииОстатков) КАК ДатаФиксацииОстатков
		|ПОМЕСТИТЬ _НовыеЦенныеБумаги
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ПоступившиеНовыеЦенныеБумаги.Организация КАК Организация,
		|		_ПоступившиеНовыеЦенныеБумаги.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ПоступившиеНовыеЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|		&ТекущаяДата КАК ДатаФиксацииОстатков
		|	ИЗ
		|		_ПоступившиеНовыеЦенныеБумаги КАК _ПоступившиеНовыеЦенныеБумаги
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам.Организация,
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам.СчетДоверительногоУправления,
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам.ЦеннаяБумага,
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам.ДатаИсполнения
		|	ИЗ
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам КАК _ЗадолженностьПоЦеннымБумагамПоСделкам
		|	ГДЕ
		|		_ЗадолженностьПоЦеннымБумагамПоСделкам.НоваяЦеннаяБумага
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям.Организация,
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям.СчетДоверительногоУправления,
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям.ЦеннаяБумага,
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям.ДатаИсполнения
		|	ИЗ
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям КАК _ЗадолженностьПоЦеннымБумагамПоПоручениям
		|	ГДЕ
		|		_ЗадолженностьПоЦеннымБумагамПоПоручениям.НоваяЦеннаяБумага) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ВложенныйЗапрос.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ЦеннаяБумага,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент ССЫЛКА Справочник.ЮрФизЛица
		|		И ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НовыеЦенныеБумаги.Организация КАК Организация,
		|	_НовыеЦенныеБумаги.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияОферт.Облигация КАК Облигация,
		|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа,
		|	УсловияОферт.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
		|	УсловияОферт.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияОферт.Цена КАК Цена,
		|	УсловияОферт.АкцептС КАК АкцептС,
		|	УсловияОферт.АкцептПо КАК АкцептПо,
		|	УсловияОферт.ОписаниеУсловий КАК ОписаниеУсловий,
		|	УсловияОферт.ТипОферты КАК ТипОферты,
		|	УсловияОферт.ДатаОбъявления КАК ДатаОбъявления,
		|	ВЫБОР
		|		КОГДА УсловияОферт.АкцептПо <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияОферт.АкцептПо
		|		ИНАЧЕ УсловияОферт.ДатаВыкупа
		|	КОНЕЦ КАК ДатаФиксацииОстатков
		|ПОМЕСТИТЬ _УсловияОфертНовыхЦенныхБумаг
		|ИЗ
		|	_НовыеЦенныеБумаги КАК _НовыеЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _НовыеЦенныеБумаги.ЦеннаяБумага = УсловияОферт.Облигация
		|			И (НЕ УсловияОферт.ТолькоДляФизическихЛиц
		|				ИЛИ УсловияОферт.ТолькоДляФизическихЛиц = _НовыеЦенныеБумаги.ФизЛицо)
		|			И (УсловияОферт.АкцептПо <> ДАТАВРЕМЯ(1, 1, 1)
		|					И УсловияОферт.АкцептПо >= _НовыеЦенныеБумаги.ДатаФиксацииОстатков
		|				ИЛИ УсловияОферт.ДатаВыкупа >= _НовыеЦенныеБумаги.ДатаФиксацииОстатков)
		|			И (УсловияОферт.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|			ТОГДА 1
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА 2
		|	КОНЕЦ КАК ЧастьСделкиРепо,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкамРепо
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&КонецТекущегоДня,
		|			Организация В (&РЭМ, &Траст)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_УсловияОфертНовыхЦенныхБумаг.Облигация
		|					ИЗ
		|						_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг)) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОСрезПоследних.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияСделокРЕПОСрезПоследних.ДатаПоставки
		|		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаИсполнения
		|	КОНЕЦ КАК ДатаИсполнения
		|ПОМЕСТИТЬ _ЗадолженностьПоВсемСделкамРепо
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.Организация КАК Организация,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО КАК СделкаРЕПО,
		|		2 КАК ЧастьСделкиРепо,
		|		ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ * ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|				&КонецТекущегоДня,
		|				Организация В (&РЭМ, &Траст)
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							_УсловияОфертНовыхЦенныхБумаг.Облигация
		|						ИЗ
		|							_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоСделкамРепо.Организация,
		|		_ЗадолженностьПоСделкамРепо.СчетДоверительногоУправления,
		|		_ЗадолженностьПоСделкамРепо.ЦеннаяБумага,
		|		_ЗадолженностьПоСделкамРепо.Основание,
		|		_ЗадолженностьПоСделкамРепо.ЧастьСделкиРепо,
		|		ВЫБОР
		|			КОГДА _ЗадолженностьПоСделкамРепо.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ * _ЗадолженностьПоСделкамРепо.КоличествоОстаток
		|	ИЗ
		|		_ЗадолженностьПоСделкамРепо КАК _ЗадолженностьПоСделкамРепо) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ВложенныйЗапрос.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ВложенныйЗапрос.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ВложенныйЗапрос.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И ВложенныйЗапрос.ЧастьСделкиРепо = УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоВсемСделкамРепо.Организация КАК Организация,
		|	_ЗадолженностьПоВсемСделкамРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ЗадолженностьПоВсемСделкамРепо.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкамРепоИтоги
		|ИЗ
		|	_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьПоВсемСделкамРепо КАК _ЗадолженностьПоВсемСделкамРепо
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага
		|			И (ВЫБОР
		|				КОГДА _ЗадолженностьПоВсемСделкамРепо.ЧастьСделкиРепо = 1
		|					ТОГДА ИСТИНА
		|				КОГДА _ЗадолженностьПоВсемСделкамРепо.ЧастьСделкиРепо = 2
		|					ТОГДА _ЗадолженностьПоВсемСделкамРепо.КоличествоОстаток < 0
		|							ИЛИ _УсловияОфертНовыхЦенныхБумаг.ДатаФиксацииОстатков >= _ЗадолженностьПоВсемСделкамРепо.ДатаИсполнения
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоВсемСделкамРепо.Организация,
		|	_ЗадолженностьПоВсемСделкамРепо.СчетДоверительногоУправления,
		|	_ЗадолженностьПоВсемСделкамРепо.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.Организация КАК Организация,
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ЗадолженностьПоЦеннымБумагамПоСделкам.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги
		|ИЗ
		|	_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьПоЦеннымБумагамПоСделкам КАК _ЗадолженностьПоЦеннымБумагамПоСделкам
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоЦеннымБумагамПоСделкам.ЦеннаяБумага
		|			И (_ЗадолженностьПоЦеннымБумагамПоСделкам.КоличествоОстаток < 0
		|				ИЛИ _УсловияОфертНовыхЦенныхБумаг.ДатаФиксацииОстатков >= _ЗадолженностьПоЦеннымБумагамПоСделкам.ДатаИсполнения)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.Организация,
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагамПоСделкам.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.Организация КАК Организация,
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ЗадолженностьПоЦеннымБумагамПоПоручениям.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги
		|ИЗ
		|	_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностьПоЦеннымБумагамПоПоручениям КАК _ЗадолженностьПоЦеннымБумагамПоПоручениям
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоЦеннымБумагамПоПоручениям.ЦеннаяБумага
		|			И (_ЗадолженностьПоЦеннымБумагамПоПоручениям.КоличествоОстаток < 0
		|				ИЛИ _УсловияОфертНовыхЦенныхБумаг.ДатаФиксацииОстатков >= _ЗадолженностьПоЦеннымБумагамПоПоручениям.ДатаИсполнения)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.Организация,
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.СчетДоверительногоУправления,
		|	_ЗадолженностьПоЦеннымБумагамПоПоручениям.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияОфертНовыхЦенныхБумаг.Организация КАК Организация,
		|	_УсловияОфертНовыхЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияОфертНовыхЦенныхБумаг.Облигация КАК Облигация,
		|	_УсловияОфертНовыхЦенныхБумаг.ДатаВыкупа КАК ДатаВыкупа,
		|	_УсловияОфертНовыхЦенныхБумаг.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
		|	_УсловияОфертНовыхЦенныхБумаг.ЦенаПроцент КАК ЦенаПроцент,
		|	_УсловияОфертНовыхЦенныхБумаг.Цена КАК Цена,
		|	_УсловияОфертНовыхЦенныхБумаг.АкцептС КАК АкцептС,
		|	_УсловияОфертНовыхЦенныхБумаг.АкцептПо КАК АкцептПо,
		|	_УсловияОфертНовыхЦенныхБумаг.ОписаниеУсловий КАК ОписаниеУсловий,
		|	_УсловияОфертНовыхЦенныхБумаг.ТипОферты КАК ТипОферты,
		|	_УсловияОфертНовыхЦенныхБумаг.ДатаОбъявления КАК ДатаОбъявления,
		|	_УсловияОфертНовыхЦенныхБумаг.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	ЕСТЬNULL(_ПоступившиеНовыеЦенныеБумаги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоЦеннымБумагамПоСделкамИтоги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкамРепоИтоги.КоличествоОстаток, 0) КАК Количество
		|ПОМЕСТИТЬ _ОбщиеОстатки
		|ИЗ
		|	_УсловияОфертНовыхЦенныхБумаг КАК _УсловияОфертНовыхЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоступившиеНовыеЦенныеБумаги КАК _ПоступившиеНовыеЦенныеБумаги
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Организация = _ПоступившиеНовыеЦенныеБумаги.Организация
		|			И _УсловияОфертНовыхЦенныхБумаг.СчетДоверительногоУправления = _ПоступившиеНовыеЦенныеБумаги.СчетДоверительногоУправления
		|			И _УсловияОфертНовыхЦенныхБумаг.Облигация = _ПоступившиеНовыеЦенныеБумаги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги КАК _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Организация = _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги.Организация
		|			И _УсловияОфертНовыхЦенныхБумаг.СчетДоверительногоУправления = _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги.СчетДоверительногоУправления
		|			И _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоЦеннымБумагамПоСделкамИтоги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги КАК _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Организация = _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги.Организация
		|			И _УсловияОфертНовыхЦенныхБумаг.СчетДоверительногоУправления = _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги.СчетДоверительногоУправления
		|			И _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоСделкамРепоИтоги КАК _ЗадолженностьПоСделкамРепоИтоги
		|		ПО _УсловияОфертНовыхЦенныхБумаг.Организация = _ЗадолженностьПоСделкамРепоИтоги.Организация
		|			И _УсловияОфертНовыхЦенныхБумаг.СчетДоверительногоУправления = _ЗадолженностьПоСделкамРепоИтоги.СчетДоверительногоУправления
		|			И _УсловияОфертНовыхЦенныхБумаг.Облигация = _ЗадолженностьПоСделкамРепоИтоги.ЦеннаяБумага
		|ГДЕ
		|	ЕСТЬNULL(_ПоступившиеНовыеЦенныеБумаги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоЦеннымБумагамПоСделкамИтоги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоЦеннымБумагамПоПоручениямИтоги.КоличествоОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоСделкамРепоИтоги.КоличествоОстаток, 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _ВсеКодыУБрокеров
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			,
		|			Организация В (&РЭМ, &Траст)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ОбщиеОстатки.СчетДоверительногоУправления
		|					ИЗ
		|						_ОбщиеОстатки КАК _ОбщиеОстатки)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ТекущаяДата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _СчетаСОднимБрокером
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.Организация КАК Организация,
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) КАК КоличествоКодов
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.Организация,
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) = 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.Организация = _ВсеКодыУБрокеров.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыБрокеровСМаксимальнымПериодом
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.Организация КАК Организация,
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ВсеКодыУБрокеров.Период) КАК Период
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.Организация,
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.Организация = _ВсеКодыУБрокеров.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ВсеКодыУБрокеров.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_СчетаСОднимБрокером.Код, _КодыБрокеровСМаксимальнымПериодом.Код) КАК Код
		|ПОМЕСТИТЬ _КодыУБрокеров
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ОбщиеОстатки.Организация КАК Организация,
		|		_ОбщиеОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|	ИЗ
		|		_ОбщиеОстатки КАК _ОбщиеОстатки) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаСОднимБрокером КАК _СчетаСОднимБрокером
		|		ПО ВложенныйЗапрос.Организация = _СчетаСОднимБрокером.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _СчетаСОднимБрокером.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыБрокеровСМаксимальнымПериодом КАК _КодыБрокеровСМаксимальнымПериодом
		|		ПО ВложенныйЗапрос.Организация = _КодыБрокеровСМаксимальнымПериодом.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _КодыБрокеровСМаксимальнымПериодом.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Текст КАК ТекстПисьма
		|ПОМЕСТИТЬ _ПисьмаКОтправке
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.ДатаСоздания >= &МинусТриРабочихДня
		|	И ПакетыДанныхКОбработке.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо)
		|	И (ВЫРАЗИТЬ(ПакетыДанныхКОбработке.Тема КАК СТРОКА(100))) = (ВЫРАЗИТЬ(&ТемаПисьма КАК СТРОКА(100)))
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбщиеОстатки.Организация КАК Организация,
		|	_ОбщиеОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОбщиеОстатки.Облигация КАК Облигация,
		|	_ОбщиеОстатки.ДатаВыкупа КАК ДатаВыкупа,
		|	_ОбщиеОстатки.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
		|	_ОбщиеОстатки.ЦенаПроцент КАК ЦенаПроцент,
		|	_ОбщиеОстатки.Цена КАК Цена,
		|	_ОбщиеОстатки.АкцептС КАК АкцептС,
		|	_ОбщиеОстатки.АкцептПо КАК АкцептПо,
		|	_ОбщиеОстатки.ТипОферты КАК ТипОферты,
		|	_ОбщиеОстатки.ДатаОбъявления КАК ДатаОбъявления,
		|	_ОбщиеОстатки.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	_ОбщиеОстатки.Количество КАК Количество,
		|	_ОбщиеОстатки.Количество * _ОбщиеОстатки.Цена КАК Сумма,
		|	_КодыУБрокеров.Код КАК КодУБрокера,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК КодISIN
		|ИЗ
		|	_ОбщиеОстатки КАК _ОбщиеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокеров КАК _КодыУБрокеров
		|		ПО _ОбщиеОстатки.Организация = _КодыУБрокеров.Организация
		|			И _ОбщиеОстатки.СчетДоверительногоУправления = _КодыУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ОбщиеОстатки.Облигация = КодыВТорговыхСистемахСрезПоследних.Объект
		|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|ИТОГИ ПО
		|	Облигация,
		|	ДатаВыкупа,
		|	Организация";
	
	ТекДата = ТекущаяДатаСеанса();
	
	Запрос.УстановитьПараметр("КонецТекущегоДня", КонецДня(ТекДата));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("МинусТриРабочихДня", Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекДата, -4));
	Запрос.УстановитьПараметр("РЭМ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("Траст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	Запрос.УстановитьПараметр("ТемаПисьма", ТемаПисьма);
#EndRegion
			
	ГруппировкаПоЦеннойБумаге = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Облигация");
	
	ТекстПисьма = "";
	
	Пока ГруппировкаПоЦеннойБумаге.Следующий() Цикл
							
		ГруппировкаПоДатеВыкупа = ГруппировкаПоЦеннойБумаге.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаВыкупа");
		
		Пока ГруппировкаПоДатеВыкупа.Следующий() Цикл
			
			ДобавитьУсловиеОферты = Истина;
			
			ГруппировкаПоОрганизации = ГруппировкаПоДатеВыкупа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
			
			Пока ГруппировкаПоОрганизации.Следующий() Цикл
				
				ДобавитьДанныеОрганизации = Истина;
				
				Выборка = ГруппировкаПоОрганизации.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если ДобавитьУсловиеОферты Тогда
						
						ТекстПисьма = ТекстПисьма + ?(ТекстПисьма = "", "", "<br>") + "<table cols=""4""><tr class=""top""><td colspan=""4"">Облигация: " + Выборка.Облигация + " (ISIN " + Выборка.КодISIN + ")</td></tr>";
						ТекстПисьма = ТекстПисьма + "<tr class=""top2""><td colspan=""4"">Условия оферты</td></tr>";
						ТекстПисьма = ТекстПисьма + "<tr class=""line""><td colspan=""4"">Дата выкупа: <b>" + Формат(Выборка.ДатаВыкупа, "ДФ=dd.MM.yyyy") + "</b><br>";
						ТекстПисьма = ТекстПисьма + "Только для физ лиц: <b>" + Выборка.ТолькоДляФизическихЛиц + "</b><br>";
						ТекстПисьма = ТекстПисьма + "Цена: <b>" + Выборка.Цена + "</b><br>";
						ТекстПисьма = ТекстПисьма + "Цена процент: <b>" + Выборка.ЦенаПроцент + "</b><br>";
						ТекстПисьма = ТекстПисьма + "Акцепт с: <b>" + Формат(Выборка.АкцептС, "ДФ=dd.MM.yyyy") + "</b> по: <b>" + Формат(Выборка.АкцептПо, "ДФ=dd.MM.yyyy") + "</b><br>";   
						ТекстПисьма = ТекстПисьма + "Тип оферты: <b>" + Выборка.ТипОферты + "</b><br>";  
						ТекстПисьма = ТекстПисьма + "Дата объявления: <b>" + Формат(Выборка.ДатаОбъявления, "ДФ=dd.MM.yyyy") + "</b></td></tr>"; 
						
						ТекстПисьма = ТекстПисьма + 
							"<tr class=""top""><td colspan=""4"">Остатки ценных бумаг</td></tr>
							|<tr class=""top""><td>Счет доверительного управления</td><td>Код у брокера</td><td>Количество</td><td>Сумма</td></tr>";
							
						ДобавитьУсловиеОферты = Ложь;
						
					КонецЕсли;
					
					Если ДобавитьДанныеОрганизации Тогда
						ТекстПисьма = ТекстПисьма + "<tr class=""top3""><td colspan=""4"">" + Выборка.Организация + "</td></tr>";
						ДобавитьДанныеОрганизации = Ложь;
					КонецЕсли;
					
					ТекстПисьма = ТекстПисьма + "<tr class=""line""><td>" + Выборка.СчетДоверительногоУправления + "</td>";
					ТекстПисьма = ТекстПисьма + "<td>" + Выборка.КодУБрокера + "</td>";
					ТекстПисьма = ТекстПисьма + "<td>" + Выборка.Количество + "</td>";
					ТекстПисьма = ТекстПисьма + "<td>" + Выборка.Сумма + "</td></tr>";
	
				КонецЦикла;
				
			КонецЦикла;
			
			ТекстПисьма = ТекстПисьма + "</table>";

		КонецЦикла;
						
	КонецЦикла;
	
	Если ТекстПисьма <> "" Тогда
		
		ТекстПисьма = 
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style>
			|		body  { font: 10pt sans-serif; }
			|		table { text-align: left; border-spacing: 0; border-collapse: collapse; }
			|		td    { vertical-align: top; border: 1px solid #CCC085; padding: 5px; }
			|		.top  { font-size: 14px; font-weight: 600; background: #F4ECC5; }
			|		.top2 { font-size: 14px; background: #F8F2D8; }
			|		.top3 { font-size: 14px; font-weight: 600; background: #FBF9EC; }
			|		.line { font-size: 12px;}
			|	</style>
			|</head>
			|<body>
			|" + ТекстПисьма + "</body></html>";
		
		
		ПисьмаКОтправке = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПисьмаКОтправке"].ПолучитьДанные().Выгрузить();
		
		Для Каждого Письмо Из ПисьмаКОтправке Цикл
							
			Если СтрНайти(Письмо.ТекстПисьма, ТекстПисьма) > 0 Тогда
				
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
				Возврат;
				
			КонецЕсли;
			
		КонецЦикла;
		
		РеквизитыОповещения = Новый Структура("Тема, Текст", ТемаПисьма, ТекстПисьма); 
		Справочники.Оповещения.СформироватьОповещения("Обработка._СозданиеЗадачВПервойФорме.ПроверкаОферт", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
			
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

Процедура СоздатьЗадачиПоЗапросамФССП(Организация, РегламентноеЗадание = Ложь, КонтрольНаличияВложений = Ложь) Экспорт 
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СоздатьЗадачиПоЗапросамФССП()";
	
	ПараметрыДляСтатистики = "Организация,РегламентноеЗадание,КонтрольОтсутствияВложений";
	ЗначенияПараметров = Новый Структура(ПараметрыДляСтатистики, Организация, РегламентноеЗадание, КонтрольНаличияВложений);
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЗначенияПараметров, ПараметрыДляСтатистики);

	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(		
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ТекстСообщенияПользователям = "";
	Сервер_1Ф = ?(ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза, "1f", "test1f") + ".g1.lan";
	
	Запрос = Новый Запрос;

#Область Текст_Запроса	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВходящийДокумент.Ссылка КАК Ссылка,
		|	ВходящийДокумент.Номер КАК Номер,
		|	ВходящийДокумент.ВидВходящегоДокумента КАК ВидДокумента,
		|	ВЫБОР
		|		КОГДА ВходящийДокумент.Отправитель ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу
		|		ИНАЧЕ ВходящийДокумент.Отправитель
		|	КОНЕЦ КАК Отправитель,
		|	ВходящийДокумент.СрокОтвета КАК СрокОтвета,
		|	КодыВоВнешнихСистемах.Код КАК КодУК,
		|	ВходящийДокумент.НомерВходящегоДокумента КАК НомерВхДок,
		|	ВходящийДокумент.ДатаВходящегоДокумента КАК ДатаВхДок,
		|	НомераТранзакций.Номер КАК НомерЗадачи
		|ИЗ
		|	Документ.ВходящийДокумент КАК ВходящийДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации)
		|					И Объект = &Организация) КАК КодыВоВнешнихСистемах
		|		ПО ВходящийДокумент.Организация = КодыВоВнешнихСистемах.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераТранзакций КАК НомераТранзакций
		|		ПО ВходящийДокумент.Ссылка = НомераТранзакций.Субъект
		|			И (НомераТранзакций.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВходящийДокумент.Отправитель ССЫЛКА Справочник.ЮрФизЛица)
		|			И ВходящийДокумент.Отправитель = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	ВходящийДокумент.Организация = &Организация
		|	И НЕ ВходящийДокумент.ПометкаУдаления
		|	И ВходящийДокумент.Дата > &НачалоПериода
		|	И ВходящийДокумент.ТипВходящегоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыВходящихДокументов.ЗапросФССП)
		|	И (НомераТранзакций.Субъект ЕСТЬ NULL Или &КонтрольНаличияВложений)";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДатаСеанса(), -3));
	Запрос.УстановитьПараметр("КонтрольНаличияВложений", КонтрольНаличияВложений);

	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Количество() = 0 Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения(Сервер_1Ф); 
	
	Если ПараметрыПодключения = Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Не удалось установить соединение с 1Ф.");
		Возврат;			
	КонецЕсли;
	
	НомераНовыхЗадач = "";
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(Выборка.НомерЗадачи) Тогда	
			НомерЗадачи = Выборка.НомерЗадачи;	
		Иначе
		
			ПараметрыЗадачи = Новый Структура();
			ПараметрыЗадачи.Вставить("subcatId", 169);
			ПараметрыЗадачи.Вставить("userToMakeOwnerId", 3686); 
			ПараметрыЗадачи.Вставить("taskText", Выборка.ВидДокумента);
			ПараметрыЗадачи.Вставить("priorityId", 1);
			
			Если ЗначениеЗАполнено(Выборка.СрокОтвета) Тогда
				ПараметрыЗадачи.Вставить("orderedTime", Формат(Выборка.СрокОтвета, "ДФ=гггг-ММ-дд") + "T12:00:00"); 		
			КонецЕсли; 
			
			ДопПараметры = Новый Массив();
					
			ДопПараметры.Добавить(Новый Структура("id, value", 51, Выборка.КодУК));
			ДопПараметры.Добавить(Новый Структура("id, value", 47, Выборка.Отправитель));
			ДопПараметры.Добавить(Новый Структура("id, value", 440, "72041"));
			
			ПараметрыЗадачи.Вставить("extParams", ДопПараметры);
			
			ТелоЗапроса = ПолучитьСтрокуJSON(ПараметрыЗадачи);
			
			ТекстСообщения = "Ошибка создания задачи по запросу ФССП в 1-ой форме.";
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения, 1);
				
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);   
				Продолжить;
			Иначе
				
				ОтветОбъект = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8")); 
				НомерЗадачи = Формат(ОтветОбъект.data.value, "ЧГ=0");
				
				//запишем в регистр "Номера транзакций"
				СтруктураКлюча = Новый Структура();
				СтруктураКлюча.Вставить("mk", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ПрефиксНумерации"));
				СтруктураКлюча.Вставить("request_number", Выборка.НомерВхДок); 
				СтруктураКлюча.Вставить("request_date", Формат(Выборка.ДатаВхДок, "ДФ=гггг-ММ-дд")); 
	
				ТекКлюч = ПолучитьСтрокуJSON(СтруктураКлюча);

				Если Не ЗаписатьНомерЗадачи(НомерЗадачи, Выборка.Ссылка, ТекКлюч) Тогда				
					ЗарегистрироватьОшибку("При создании задачи по запросу ФССП в 1-ой форме. Не удалось записать номер задачи [" + НомерЗадачи + "] в регистр [Номера транзакций]" + Символы.ПС + ОписаниеОшибки());
					Продолжить;	
				КонецЕсли;
				
				НомераНовыхЗадач = НомераНовыхЗадач + ?(НомераНовыхЗадач = "", "", ", ") + НомерЗадачи; 
				
			КонецЕсли;
			
		КонецЕсли;
			
		//прикрепим файлы к задаче
		ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Выборка.Ссылка);
			
		Если РегламентноеЗадание И КонтрольНаличияВложений И ДанныеФайлов.Количество() = 0 Тогда 
			
			ТекстСообщенияПользователям = ТекстСообщенияПользователям + Символы.ПС
				+ "<tr><td>" + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.Ссылка, Выборка.Номер) + "</td>"
				+ "<td><A href=""http://" + Сервер_1Ф + "/maintaskform.aspx?TaskID=" + НомерЗадачи + """>" + НомерЗадачи + "</A></td>"
				+ "<td class=""error"">В первой форме создана задача по запросу ФССП. Во входящем документе отсутствуют вложенные файлы.</td></tr>";
					
			Продолжить;
			
		КонецЕсли;
			
		Для Каждого ЭлементДанных Из ДанныеФайлов Цикл
			
			ОписаниеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ЭлементДанных.ИдентификаторФайла);
			
			ТекФайл = ПолучитьИзВременногоХранилища(ОписаниеФайла.Адрес);
			ИмяТекФайла = ОписаниеФайла.Имя + "." + ОписаниеФайла.Расширение; 
			
			СтруктураЗапроса = Новый Структура();
			СтруктураЗапроса.Вставить("writeComment", Ложь);
			СтруктураЗапроса.Вставить("fileData", Base64Строка(ТекФайл));
			СтруктураЗапроса.Вставить("fileName", ИмяТекФайла);
			
			ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
								
			ТекстОшибки = "Не удалось загрузить файл [" + ИмяТекФайла + "] в 1Ф из входящего документа [" + Выборка.Ссылка + "]."; 
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/files/preupload/base64", ТелоЗапроса, ТекстОшибки, 1); 
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстОшибки);
				Продолжить;
			КонецЕсли;
				
			ОтветОбъект = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
			
			Если Не ОтветОбъект.Свойство("data") Тогда
				ЗарегистрироватьОшибку("Не удалось загрузить файл [" + ИмяТекФайла + "] в 1Ф из входящего документа [" + Выборка.Ссылка + "]." + Символы.ПС + ОписаниеОшибки());
				Продолжить;
			КонецЕсли;
							
			Для Каждого ДанныеФайла Из ОтветОбъект.data Цикл 
				
				ИдФайла = Формат(ДанныеФайла.preUploadFileId, "ЧГ=0");
				
				СтруктураЗапроса = Новый Структура();
				СтруктураЗапроса.Вставить("taskId", НомерЗадачи);
				СтруктураЗапроса.Вставить("preUploadedFileId", ИдФайла); 
				
				ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
				
				ТекстОшибки = "Не удалось вложить файл [id=" + ИдФайла + ", name=" + ИмяТекФайла + "] в задачу 1Ф [" + НомерЗадачи + "] из входящего документа [" + Выборка.Ссылка + "].";
				
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/files/upload/PreUploadedFilesToTask", ТелоЗапроса, ТекстОшибки, 1);
				
				Если HTTPОтвет = Неопределено Тогда
					ЗарегистрироватьОшибку(ТекстОшибки);
				КонецЕсли;
						
			КонецЦикла;
								
		КонецЦикла;
							
	КонецЦикла;
	
	Если ТекстСообщенияПользователям <> "" Тогда
		
		ТекстСообщенияПользователям =
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style type=""text/css"">
			|		body     { font-family: ""Arial""; font-size: 12px; }
			|		table    { text-align: left; border-spacing: 0; border-collapse: collapse; }
			|		td       { border: 1px solid #ACC8BD; padding: 5px; }
			|		.top     { background: #E4F0DD; }
			|		.error   { background: #FFA07A; }
			|	</style>
			|</head><body><table cols=""3"">
			|<tr class=""top""><td>Входящий документ 1С</td><td>Задача в первой форме</td><td>Комментарий</td></tr>"
			+ ТекстСообщенияПользователям + "</table></body></html>";

		РеквизитыОповещения = Новый Структура("Организация, Текст", Организация, ТекстСообщенияПользователям);
		Справочники.Оповещения.СформироватьОповещения("Обработка._СозданиеЗадачВПервойФорме.ЗапросыФССП", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

	ОповеститьОбОшибках(Неопределено);
	
	Если Не РегламентноеЗадание Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Каманда выполнена." + ?(НомераНовыхЗадач = "", "", " Созданы новые задачи: " + НомераНовыхЗадач));	
	КонецЕсли;
			
КонецПроцедуры

Функция ЗаписатьНомерЗадачи(НомерЗадачи, СубъектСсылка, КлючЗаписи)
	
	РезультатЗаписи = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
				
	Попытка
		Запись = РегистрыСведений.НомераТранзакций.СоздатьМенеджерЗаписи();
	
		Запись.Субъект                 = СубъектСсылка;
		Запись.ВнешняяСистема          = Справочники.ВнешниеСистемы.ПерваяФорма;
		Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор;
		Запись.Номер                   = НомерЗадачи;
		Запись.Ключ                    = КлючЗаписи;

		Запись.Записать();
		
		РезультатЗаписи = Истина;
	Исключение
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатЗаписи;
		
КонецФункции


////////////////////////////////////////////////////////////////////////////////

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;