&НаСервере
Процедура СформироватьСписокРазделовОтчета()
	
	ЭтаФорма.РазделыОтчета.Очистить();
	
	ЭтаФорма.СохраняемыеРазделы = Отчеты.РегламентированныйОтчетБаланс.СформироватьСписокРазделовОтчета(ЭтаФорма.ИмяФормы, СтруктураРеквизитовФормы.НКО);
	
	Для Каждого Раздел Из ЭтаФорма.СохраняемыеРазделы Цикл
		ДобавитьРазделОтчета(РазделыОтчета, Раздел.Значение, Раздел.Представление);
		Раздел.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьРазделОтчета(РазделыОтчета, ИмяРаздела, Представление)

	НоваяСтрока = РазделыОтчета.Добавить();
	
	НоваяСтрока.ИмяРаздела = ИмяРаздела;
	НоваяСтрока.Представление = Представление;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	ЭтаФорма.СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчетБаланс.ПолучитьСтруктуруПараметров(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиСервер()
	
	ЭтаФорма.ВыводитьСопоставимыеДанные = Истина;
	СформироватьСписокРазделовОтчета();
	
	СтруктураНаименованийОтчета	= КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
	
	ИмяМакетаСоставаПоказателей = КонсолидированнаяОтчетность.ПолучитьИмяМакетаСоставаПоказателей("РегламентированныйОтчетБаланс", СтруктураРеквизитовФормы);	
	МакетСоставаПоказателей		= Отчеты[СтруктураНаименованийОтчета.ИсточникОтчета].ПолучитьМакет(ИмяМакетаСоставаПоказателей);
			
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МакетСоставаПоказателей", МакетСоставаПоказателей);
	СтруктураПараметров.Вставить("мТаблицаСоставПоказателей", мТаблицаСоставПоказателей);
	СтруктураПараметров.Вставить("УникальныйИдентификатор", ЭтаФорма.УникальныйИдентификатор);
	
	СтруктураПараметров.Вставить("Адрес_ТаблицаРасшифровки", Адрес_ТаблицаРасшифровки);
	СтруктураПараметров.Вставить("Адрес_мСтруктураЦветовРаскраски", Адрес_мСтруктураЦветовРаскраски);
	СтруктураПараметров.Вставить("Адрес_мСтруктураВариантыЗаполнения", Адрес_мСтруктураВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаВариантыЗаполнения", Адрес_мТаблицаВариантыЗаполнения);
	СтруктураПараметров.Вставить("Адрес_мТаблицаСчетов", Адрес_мТаблицаСчетов);
	
	КонсолидированнаяОтчетность.ЗаполнитьНачальныеНастройкиСервер(СтруктураПараметров);
	
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Если Лев(ЭлементСтруктуры.Ключ, 6) = "Адрес_" Тогда
			ЭтаФорма[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
		
		СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
		СписокСохранения.Свойство("НКО",						СтруктураРеквизитовФормы.НКО);
		СписокСохранения.Свойство("ВидДеятельностиОрганизации",	СтруктураРеквизитовФормы.ВидДеятельностиОрганизации);
		
		СтруктураРеквизитовФормы.Организация					= СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
		СтруктураРеквизитовФормы.СчетДоверительногоУправления	= СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
		
		ЗаполнитьНачальныеНастройкиСервер();
	
		ЗаполнитьТабличныеДокументыИзМакетов();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
           И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
        	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

        КонецЕсли;
		
	Иначе
		
		ЗаполнитьНачальныеНастройкиСервер();
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			// документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе
			// Это новый документ.
			Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
				СтруктураРеквизитовФормы.ВалютаДокумента  		  	= ЭтаФорма.НастройкиОтчета.ВалютаДокумента;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         	= ЭтаФорма.НастройкиОтчета.ЕдиницаИзмерения;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	= ЭтаФорма.НастройкиОтчета.ТочностьЕдиницыИзмерения;
				ЭтаФорма.Подписант 									= ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
			Иначе	
				СтруктураРеквизитовФормы.ВалютаДокумента  		  = СтруктураРеквизитовФормы.Организация.ВалютаУчета;
				СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
				СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			КонецЕсли; 
			
			ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
			СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода = КонсолидированнаяОтчетность.ПолучитьОтчетНаКонецПредыдущегоПериода(СтруктураРеквизитовФормы, ИсточникОтчета);			
			ЭтаФорма.СтатусОтчета = "Черновик";
						
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьТабличныеДокументыИзМакетов();
		ЗаполнитьДенежныйПоказательСРазмерностью();
		
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
	
		Если ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
			
			ЭтаФорма.КлючТекущихНастроек = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
			КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
		
		КонецЕсли;
		
		Если ЭтаФорма.НастройкиОтчета.Свойство("ВыводитьСопоставимыеДанные")
			И ЗначениеЗаполнено(ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные)
			И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные) = Тип("Булево") Тогда
		
			ЭтаФорма.ВыводитьСопоставимыеДанные	= ЭтаФорма.НастройкиОтчета.ВыводитьСопоставимыеДанные;
		
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.НаимСчетаДоверительногоУправления = СтруктураРеквизитовФормы.СчетДоверительногоУправления.Наименование;
	
	Если Месяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) = 1 Тогда 
		СтруктураРеквизитовФормы.СтрПериодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	ИначеЕсли СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.СтрПериодОтчета = "период с " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	Иначе
		СтруктураРеквизитовФормы.СтрПериодОтчета = "Январь - " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ='ММММ гггг'") + " г." ;
	КонецЕсли;
	
	ИнициализироватьСтруктуруЗаголовковОтчетов();
	
	мСкопированаФорма = Неопределено;
	Параметры.Свойство("мСкопированаФорма", мСкопированаФорма);
	Если ЗначениеЗаполнено(мСкопированаФорма) Тогда 
		Модифицированность = Истина;
	КонецЕсли;
	
	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);
	Элементы.НомерКорректировки.Видимость = ЭтаФорма.СтатусОтчета = "Корректировка";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазмерностьВалюту()
	
	ЕдиницаИзмеренияНадпись = "";
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента), СтруктураРеквизитовФормы.ВалютаДокумента, "руб");
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		ЕдиницаИзмеренияНадпись ="в "+ ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЕдиницаИзмеренияНадпись ="в тысячах " + ПредставлениеВалютыДокумента;
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЕдиницаИзмеренияНадпись = "в миллионах " + ПредставлениеВалютыДокумента;
	КонецЕсли;
	
	Возврат ЕдиницаИзмеренияНадпись;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДенежныйПоказательСРазмерностью()
	
	ДенежныйПоказательСРазмерностью = КонсолидированнаяОтчетность.ПолучитьДенежныйПоказательСРазмерностью(СтруктураРеквизитовФормы, ЭтаФорма);
	
	РазмерностьДокумента = ПолучитьРазмерностьВалюту();
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		ИмяРаздела = ТекСтрока.ИмяРаздела;
		
		Попытка
			ТекРаздел = ТекСтрока.ТабличныйДокумент;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если НЕ ТекРаздел.Области.Найти("ДенежныйПоказательСРазмерностью") = Неопределено
			и ТекРаздел.Области.ДенежныйПоказательСРазмерностью.СодержитЗначение
			Тогда
			ТекРаздел.Области.ДенежныйПоказательСРазмерностью.Значение = ДенежныйПоказательСРазмерностью;
		КонецЕсли;
		Если НЕ ТекРаздел.Области.Найти("НаименованиеВалютыОтчета") = Неопределено 
			и ТекРаздел.Области.НаименованиеВалютыОтчета.СодержитЗначение
			Тогда
			ТекРаздел.Области.НаименованиеВалютыОтчета.Значение = РазмерностьДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСтруктуруЗаголовковОтчетов()
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов = Новый Соответствие;
	
	КонецПредыдущегоГода = КонецГода(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	
	ГодОтчета = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ = 'гггг'");
	ГодПредыдущий = Формат(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12), "ДФ = 'гггг'");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодОтчетногоГода", "за " + ГодОтчета + "г.");
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("ЗаПериодПредыдущегоГода", "за " + ГодПредыдущий + "г.");
	
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаОтчетнуюДату", "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD"));
	СтруктураРеквизитовФормы.ЗаголовкиОтчетов.Вставить("НаКонецПредыдущегоГода", "На " + Формат(КонецПредыдущегоГода, "ДЛФ=DD"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем ТаблицаРасшифровки;
	Перем РазделыСРучнойКорректировкой;
	
	СтруктураРеквизитовФормы.Организация = СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	СтруктураРеквизитовФормы.СчетДоверительногоУправления = СтруктураРеквизитовФормы.мСохраненныйДок.СчетДоверительногоУправления;
	
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         	 = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 	 = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.ВалютаДокумента			 = СтруктураРеквизитовФормы.мСохраненныйДок.ВалютаДокумента;
	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода	 = СтруктураРеквизитовФормы.мСохраненныйДок.ОтчетНаКонецПрошлогоГода;
	Комментарий                                        	 = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтатусОтчета                                         = СтруктураРеквизитовФормы.мСохраненныйДок.СтатусОтчета;
	НомерКорректировки                                 	 = СтруктураРеквизитовФормы.мСохраненныйДок.НомерКорректировки;

	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Адрес_ТаблицаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("РазделыСРучнойКорректировкой", РазделыСРучнойКорректировкой);
	СписокСохранения.Свойство("Подписант", ЭтаФорма.Подписант);
	
	Для Каждого ТекСтрока из ЭтаФорма.РазделыОтчета Цикл
		Если Не РазделыСРучнойКорректировкой.Найти(ТекСтрока.ИмяРаздела) = Неопределено Тогда
			ТекСтрока.РучнаяКорректировка = Истина;
			КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ТекСтрока.ИмяРаздела, ТекСтрока.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрока из ПоказателиОтчета Цикл
		Попытка
			ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекСтрока.ИмяРаздела);
			ТабДок.Области[ТекСтрока.ИмяПоказателя].Значение = ТекСтрока.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеДокументыИзМакетов(ЭтоНовый = Истина)
	
	ТаблицаИзменяемыхОбластей = КонсолидированнаяОтчетность.ПолучитьТаблицуИзменяемыхОбластей("РегламентированныйОтчетБалансФормаОтчета_МСФО39_СК_2020");	
	
	Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
		
		Попытка
			
			Префикс = "МСФО39_";
			
			Если ТекСтрока.ИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
			
				Префикс = Префикс
					+ ?(ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВидДеятельностиОрганизации) И СтруктураРеквизитовФормы.ВидДеятельностиОрганизации <> "НПФ", СтруктураРеквизитовФормы.ВидДеятельностиОрганизации + "_", "")
					+ ?(СтруктураРеквизитовФормы.НКО, "НКО_", "");
			
			КонецЕсли; 
			
			ИмяМакета = Префикс + "Макет" + ТекСтрока.ИмяРаздела;
			
			КонсолидированнаяОтчетность.ЗаполнитьТабличныйДокументИзМакета(ЭтаФорма, ТекСтрока, ИмяМакета, ТаблицаИзменяемыхОбластей);
						
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
		
		СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
		СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
		
		ЗаполнитьАвто();
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
			ЭтаФорма.СтатусОтчета = "Черновик";
		КонецЕсли; 
		
		Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.Перезаполнить Тогда
			Записать(Неопределено);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьИПерезаполнить Или ЭтаФорма.НастройкиОтчета.СтруктураДействий.ОткрытьФорму Тогда
		ЭтаФорма.Открыть();
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить() Экспорт
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ОтчетТитульнаяСтраница";
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = 0;
	
	ЗаполнитьАвто();
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма, ЭтаФорма.НастройкиОтчета.Подписант);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СтатусОтчета) Тогда
		ЭтаФорма.СтатусОтчета = "Черновик";
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьСтруктуруРеквизитовФормы();
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормы, Параметры);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	КонсолидированнаяОтчетность.ЗаполнитьСтруктуруПеременныхДляОтбора(СтруктураПеременныхДляОтбора);
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	ИмяОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].ИмяРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсолидированнаяОтчетностьКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	КонсолидированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонсолидированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
	 ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета) Тогда
	
		ПредыдущаяСтрока = ЭтаФорма.РазделыОтчета.НайтиПоИдентификатору(СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета);
		Если Не ПредыдущаяСтрока = Неопределено Тогда
		
			ПредыдущаяСтрока.ТабличныйДокумент = ЭтаФорма.ТабличныйДокумент;
		
		КонецЕсли; 
	
	КонецЕсли; 
		
	НаимТекущегоРаздела = Элемент.ТекущиеДанные.ИмяРаздела;
	ЭтаФорма.РучнаяКорректировка = Элемент.ТекущиеДанные.РучнаяКорректировка;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = НаимТекущегоРаздела;
	
	Если НаимТекущегоРаздела = "ОтчетТитульнаяСтраница" Тогда
		
		Элементы.РучнаяКорректировка.Доступность = Ложь;
		
	Иначе
		
		Элементы.РучнаяКорректировка.Доступность = Истина;
	
	КонецЕсли; 	
	
	ЭтаФорма.ТабличныйДокумент = Элемент.ТекущиеДанные.ТабличныйДокумент;
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Истина;
		РучнаяКорректировкаПриУстановкеСервер(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		УстановитьЦветФонаЯчейки(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
	Иначе
		
		ЭтаФорма.РучнаяКорректировка = Истина;
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РучнаяКорректировкаПриИзмененииВопросЗавершение",
		ЭтотОбъект,)
		,
		НСтр("ru = 'Будет произведено автоматическое заполнение закладки. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаПриИзмененииВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РазделыОтчета.ТекущиеДанные.РучнаяКорректировка = Ложь;
	ЭтаФорма.РучнаяКорректировка = Ложь;
	ЗаполнитьАвто(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриУстановкеСервер(ИмяРаздела)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Раздел", ИмяРаздела);
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	
	//// Обновляем цвет ячеек и обновляем документ
	//КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	//ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		
КонецПроцедуры

&НаСервере 
Процедура УстановитьЦветФонаЯчейки(ИмяТекРаздела = "", ТекРаздел = Неопределено)

	КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяТекРаздела, ТекРаздел);
	Если ЗначениеЗаполнено(ТекРаздел = Неопределено) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяТекРаздела);
	Иначе
		ЭтаФорма.ТабличныйДокумент = ТекРаздел;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Расчет(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифровкаНажатие(Неопределено);
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеОтчета

&НаСервереБезКонтекста
Функция ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет)
	Возврат РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Период, СчетДоверительногоУправления, Отчет);
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьАвто(ИмяРаздела = "")

	Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.ВалютаДокумента) Тогда
		ПоказатьПредупреждение(,"Необходимо указать валюту отчета!");
		Возврат;
	КонецЕсли;
	
	Если Не (ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") И ЭтаФорма.НастройкиОтчета.Свойство("АвтоматическоеФормирование")) Тогда
		ЭтаФорма.НастройкиОтчета = ПолучитьНастройкиОтчета(
			ЭтаФорма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, 
			ЭтаФорма.СтруктураРеквизитовФормы.СчетДоверительногоУправления,
			"РегламентированныйОтчетБаланс");		
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, -12);
	Если СтруктураРеквизитовФормы.НестандартныйПериод Тогда
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12);
	Иначе
		СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецМесяца(ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, -12));
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета  = КонецГода(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	
	СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода    = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода = "На " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	КонсолидированнаяОтчетностьКлиент.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	// Очистка разделов
	Очистить(ИмяРаздела);
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	нСч = 0;
	ПредставлениеОсновногоРаздела = ЭтаФорма.РазделыОтчета[0].Представление;
	// Заполнение разделов
	Если ИмяРаздела = "" Тогда
		
		Всего = ЭтаФорма.РазделыОтчета.Количество();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				
				Состояние("Заполняется раздел: " + ТекСтрока.Представление, нСч/Всего * 100, "Заполнение...");
				Выполнить("Подключаемый_ЗаполнитьРаздел_" + ТекСтрока.ИмяРаздела + "()");
				нСч = нСч + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяРаздела + "()");
		КонецЕсли;
		
	КонецЕсли;
	
	Если нСч Тогда
		Состояние("Заполняется раздел: " + ПредставлениеОсновногоРаздела, нСч/Всего * 100, "Заполнение...");
	КонецЕсли;
	
	// Заполнение основного раздела	
	Если ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) ИЛИ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			Очистить(ИмяОсновногоРаздела);
		КонецЕсли;
		
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
		Если нСч Тогда
			Состояние();
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		
		ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета[0].ТабличныйДокумент;
		
	Иначе
		
		ЭтаФорма.ТабличныйДокумент = Элементы.РазделыОтчета.ТекущиеДанные.ТабличныйДокумент;
	
	КонецЕсли;
	
	КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		
КонецПроцедуры

 &НаСервере
Процедура Очистить(ИмяРаздела = "")
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Если ИмяРаздела = "" Тогда
		
		ТаблицаРасшифровки.Очистить();
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			ОчиститьТабличноеПоле(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
			
		КонецЦикла;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Раздел", ИмяРаздела);
		НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаРасшифровки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ТабДок = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
		ОчиститьТабличноеПоле(ТабДок, ИмяРаздела);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Адрес_ТаблицаРасшифровки);
	ЗаполнитьЗаголовки(ИмяРаздела);
	ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела)
	
	Если ИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
		Возврат;	
	КонецЕсли; 
	
	НайденныеСтроки = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела));
	
	Если ЭтаФорма.РучнаяКорректировка Тогда
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока.РучнаяКорректировка = Ложь;
		
		КонецЦикла; 
		
		ЭтаФорма.РучнаяКорректировка = Ложь;
	КонецЕсли;
	
	//// Обновляем цвет ячеек и обновляем документ
	//КонсолидированнаяОтчетность.УстановитьЦветФонаЯчейки(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	//ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	УстановитьЦветФонаЯчейки(ИмяРаздела);	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПоле(ВыбТабличныйДокумент, ИмяРаздела)
	
	Для Каждого ТекОбласть Из ВыбТабличныйДокумент.Области Цикл
			
		Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка макета: раздел " + ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		ТекОбласть.Очистить();
		
	КонецЦикла;
	
	РучнаяКорректировкаПриОчисткеРаздела(ИмяРаздела);
	
КонецПроцедуры // ОчиститьТабличноеПоле()

&НаСервере
Процедура ЗаполнитьЗаголовки(ИмяРаздела = "")
	//#ЗаполнениеЗаголовков
	
	Если ИмяРаздела = "" Тогда
		мМассивРазделов = ЭтаФорма.РазделыОтчета.Выгрузить(, "ИмяРаздела").ВыгрузитьКолонку(0);
	Иначе
		мМассивРазделов = Новый Массив;
		мМассивРазделов.Добавить(ИмяРаздела);
	КонецЕсли;
	
	Для Каждого ТекИмяРаздела из мМассивРазделов Цикл
		Если ТекИмяРаздела = "Настройка"
			или ТекИмяРаздела = "Проверка"
			или ТекИмяРаздела = "ПроверкаПротоколОшибок"
			Тогда
			Продолжить;
		КонецЕсли;
		
		ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ТекИмяРаздела);
		
		// Настройки заполнения шапки: Текущий период
		Если НЕ ТекРаздел.Области.Найти("ТекущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
		КонецЕсли;
		
		// Настройки заполнения шапки: Предыдущий период
		Если НЕ ТекРаздел.Области.Найти("ПредыдущийПериод") = Неопределено Тогда
			ТекРаздел.Области.ПредыдущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		КонецЕсли;
		
		// Настройки для заголовков периодов
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокНачалоПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокНачалоПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		Если НЕ ТекРаздел.Области.Найти("ЗаголовокКонецПериода") = Неопределено Тогда
			ТекРаздел.Области.ЗаголовокКонецПериода.Значение    = "Балансовая стоимость на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy") + " г.";
		КонецЕсли;
		
		// Настройки для титульного листа
		Если ТекИмяРаздела = "ОтчетТитульнаяСтраница" Тогда
			Если НЕ ТекРаздел.Области.Найти("ТекущийПериод1") = Неопределено Тогда
				ТекРаздел.Области.ТекущийПериод1.Значение    = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
			Если НЕ СведенияОбОрганизации = Неопределено Тогда
			
				Если НЕ ТекРаздел.Области.Найти("Организация") = Неопределено Тогда
					ТекРаздел.Области.Организация.Значение    = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
						СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
						СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				
				Если НЕ ТекРаздел.Области.Найти("ПочтовыйАдресОрганизации") = Неопределено Тогда
					ТекРаздел.Области.ПочтовыйАдресОрганизации.Значение    = СведенияОбОрганизации.ЮридическийАдрес;
				КонецЕсли;	
			
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ОбщиеПроцедурыЗаполнения

&НаСервере
Функция ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь, стрДопПоля = "", стрГруппировка = "Счет")
	
	Если ТипЗнч(ВидыСубконто) = Тип("СписокЗначений") Тогда
		
		Если Развернутый Тогда
			КоличествоСубконто = ВидыСубконто.Количество();
			Для Ном = 1 По КоличествоСубконто Цикл
				стрДопПоля = стрДопПоля + Символы.ПС + "Субконто" + Ном + ",";
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СальдоОборот = "Оборот" Тогда
		
		ШаблонТекстаЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК СуммаОборотКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			" + ?(ПустаяСтрока(КодКорреспондентскогоСчета), "", ВидСравненияКорсчета + ", &ВидыСубконтоКорСчета") + "
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор + "
		|
		|ИТОГИ
		|	СУММА(СуммаОборотДт),
		|	СУММА(СуммаОборотКт)
		|ПО
		|	" + стрГруппировка;
		
	Иначе
		
		ШаблонТекстаЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вэУправленческий.Счет КАК Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт
		|		ИНАЧЕ вэУправленческий.Сумма" + ?(Развернутый, "Развернутый", "") + "ОстатокКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			" + ?(СальдоОборот = "НаНачало", "&НачалоПериода", "&грКонецПериода") + ",
		|			Счет В ИЕРАРХИИ (&СписокСчетов),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ") КАК вэУправленческий" + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|		ПО вэУправленческий.Счет = СчетаСОборотнымСубконтоКонтрагенты.Счет", "") + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор + ?(ЕстьСчетаСОборотнымСубконтоКонтрагенты, ?(стрОтбор = "", "ГДЕ", " И ") + "
		|			(НЕ СчетаСОборотнымСубконтоКонтрагенты.Счет ЕСТЬ NULL )
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вэУправленческий.Счет,
		|	" + стрДопПоля + "
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотДт
		|		ИНАЧЕ вэУправленческий.СуммаОборотДт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА вэУправленческий.Организация.ВалютаУчета = &ВалютаДокумента
		|			ТОГДА вэУправленческий.СуммаОборотКт
		|		ИНАЧЕ вэУправленческий.СуммаОборотКт * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ,
		|	вэУправленческий.Организация.ВалютаУчета КАК ВалютаУправленческогоУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			,
		|			" + ?(СальдоОборот = "НаНачало", "ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1)", "&КонецПериода") + ",
		|			,
		|			Счет В ИЕРАРХИИ (&СписокСчетов)
		|				И Счет В
		|					(ВЫБРАТЬ
		|						СчетаСОборотнымСубконтоКонтрагенты.Счет
		|					ИЗ
		|						СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты),
		|			&ВидыСубконто,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			" + стрОтборВирт + ",
		|			,
		|			) КАК вэУправленческий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО вэУправленческий.Организация.ВалютаУчета = КурсВалютыПроводки.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода,) КАК РеквизитыПИФСрезПоследних
		|		ПО ВЫРАЗИТЬ(вэУправленческий.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|" + стрОтбор, "") + "
		|
		|ИТОГИ
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокДт),
		|	СУММА(Сумма" + ?(СальдоОборот = "НаНачало", "Начальный", "Конечный") + ?(Развернутый, "Развернутый", "") + "ОстатокКт)
		|ПО
		|	" + стрГруппировка;
	КонецЕсли;
	
	Возврат ШаблонТекстаЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, ВидыСубконто = Неопределено, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", стрТаблицаКурсовВалют = "КоэффициентыВалютПП", РезервПодОбесценение = ЛОЖЬ)
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос, стрОтборВирт);
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если СальдоОборот = "НаНачало" Или СальдоОборот = "НаКонец" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьШаблонТекстаЗапроса(СальдоОборот, ВидыСубконто, Ложь, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	
	Если ЗаПериод = "ЗаПрошлыйПериод" Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", стрТаблицаКурсовВалют);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
			
		КонсолидированнаяОтчетность.СкорректироватьСлагаемоеНаименование_ОФР(Запрос, СлагаемоеНаименование);
		
		ТекСумма = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
		КонецЕсли;
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
	Если РезервПодОбесценение Тогда
		ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, СальдоОборот, ЗаПериод, ТекРаздел, стрСчетОбесценение, стрОтборВирт = "", ИмяЯчейкиНеобесцененные = "03", ИмяЯчейкиОбесцененные = "04")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	КодКорреспондентскогоСчета = "";
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос, стрОтборВирт);
	
	Запрос.Выполнить();
	
	Врем_мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	мТаблицаСчетов = Врем_мТаблицаСчетов.Скопировать();
	
	мТаблицаСчетов.Колонки.Добавить("СуммаОбесцененные", Новый ОписаниеТипов("Число"));
	мТаблицаСчетов.Колонки.Добавить("ИмяРеквизитаСуммыОбесценение", Новый ОписаниеТипов("Строка"));
	мТаблицаСчетов.Колонки.Добавить("ДтКтОбесценение", Новый ОписаниеТипов("Строка"));
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		Если стр_мТаблицаСчетов.ИмяСлагаемого = "!СКД" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеКт"; //Берем противоположное: Дт - Кт
			стр_мТаблицаСчетов.ДтКтОбесценение = "кредит";
		ИначеЕсли  стр_мТаблицаСчетов.ИмяСлагаемого = "!СКК" Тогда
			стр_мТаблицаСчетов.ИмяРеквизитаСуммыОбесценение = "СуммаОбесцененныеДт"; //Берем противоположное: Кт - Дт
			стр_мТаблицаСчетов.ДтКтОбесценение = "дебет";
		КонецЕсли;
	КонецЦикла;
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	// КешТаблицаДляСчетовОбесценение+++
	Если НЕ Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
		СписокСчетовОбесцененные = Новый СписокЗначений;
		тзЯчейки = мТаблицаСчетов.Скопировать();
		тзЯчейки.Свернуть("ИмяЯчейки");
		стрИменаЯчеек = "";
		Для Каждого стр_тзЯчейки из тзЯчейки Цикл
			стрИменаЯчеек = стрИменаЯчеек + ?(стрИменаЯчеек = "", "", ",") + стр_тзЯчейки.ИмяЯчейки;
			мСтроки_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.НайтиСтроки(Новый Структура("Строка", стр_тзЯчейки.ИмяЯчейки));
			Для Каждого стр_мКешТаблицаДляСчетовОбесценение из мСтроки_мКешТаблицаДляСчетовОбесценение Цикл
				СписокСчетовОбесцененные.Добавить(стр_мКешТаблицаДляСчетовОбесценение.Счет);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокСчетовОбесцененные.Количество() = 0 Тогда
		//!!!!!!ТекстСообщения = НСтр("ru = 'Раздел " + ИмяРаздела + ". При заполнении строки " + стрИменаЯчеек + " не найдены счета из колонки ""Резерв под обесценение"", используется счет: " + стрСчетОбесценение + "'");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		СписокСчетовОбесцененные = ПолучитьСчетПоКоду(стрСчетОбесценение);
	КонецЕсли;
	// КешТаблицаДляСчетовОбесценение---
	
	Запрос.УстановитьПараметр("СчетОбесцененные", СписокСчетовОбесцененные);
	
	// ДепозитыМенее90Дней добавлено в запрос
	
	ТекстЗапроса = КонсолидированнаяОтчетность.ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные_ТекстЗапроса(ЭтаФорма);
	
	Если стрОтборВирт = "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", "И ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &стрОтборВирт", стрОтборВирт);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		
		ТекСчет = СтрокаСчета.Счет;
		
		ИмяСлагаемого     = СтрокаСчета.ИмяСлагаемого;
		ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
		ИмяРеквизитаСуммыОбесценение = СтрокаСчета.ИмяРеквизитаСуммыОбесценение;
		
		ЗнакОперации      = СтрокаСчета.ЗнакОперации;
		ТекстРасшифровки  = СтрокаСчета.ТекстРасшифровки;
		
		ИмяЯчейки             = СтрокаСчета.ИмяЯчейки;
		СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		
		Если ТекстРасшифровки = "" Тогда
			СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(ТекСчет.Код), КодКорреспондентскогоСчета, ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
		Иначе
			СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		КонецЕсли;
		
		ТекСумма = 0;
		ТекСуммаОбесцененные = 0;
		
		ВыборкаПоСчетам.Сбросить();
		ОтборСчета = Новый Структура("Счет", ТекСчет);
		Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
			ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
			СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаСуммыОбесценение) Тогда
				ТекСуммаОбесцененные = ?(ЗнакОперации = "-", -1, 1) * ВыборкаПоСчетам[ИмяРеквизитаСуммыОбесценение];
				СтрокаСчета.СуммаОбесцененные = СтрокаСчета.СуммаОбесцененные + ТекСуммаОбесцененные;
				
				СтрокаСчета.Сумма = СтрокаСчета.Сумма - ТекСуммаОбесцененные;
				ТекСумма = СтрокаСчета.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
		// 03
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.ИмяПоказателя, ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
		
		// 04
		стрИмяПоказателя = СтрЗаменить(СтрокаСчета.ИмяПоказателя, "Необесцененные", "Обесцененные");
		
		стрТекстСчетСчеты = ?(СписокСчетовОбесцененные.Количество() = 1, "счете", "счетах");
		стрТекстРасшифровки = "Остаток на конец периода #Период# по " + СтрокаСчета.ДтКтОбесценение + "у счета " + ТекСчет + " с учетом отборов по строке для столбца 3 (анализ ценных бумаг на " + стрТекстСчетСчеты + " " + СписокСчетовОбесцененные + ")";
		
		стрСлагаемоеНаименование = СтрЗаменить(стрТекстРасшифровки, "#Период#", ПредставлениеПериода(?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(ЗаПериод = "ЗаТекущийПериод", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" ));
		
		ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки + ИмяЯчейкиОбесцененные, стрИмяПоказателя, ЗнакОперации, стрСлагаемоеНаименование, ТекСуммаОбесцененные, СписокСчетовОбесцененные, , , , ИмяРаздела);
		
	КонецЦикла;
		
	ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма, СуммаОбесцененные");
	ВремТз.Свернуть("ИмяЯчейки", "Сумма, СуммаОбесцененные");
	Для Каждого СтрокаСчета Из ВремТз Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиНеобесцененные, СтрокаСчета.Сумма);
		УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки + ИмяЯчейкиОбесцененные, СтрокаСчета.СуммаОбесцененные);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос, стрОтборВирт);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	НачалоЦикла = ?(НомерКолонкиОтчетногоПериода = "", 2, 1);
	КоличествоЦиклов = ?(НомерКолонкиПредыдущегоПериода = "", 1, 2);	
	
	Для НомерЦикла = 1 По КоличествоЦиклов Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФинансовыеОрганизацииТП", "&ФинансовыеОрганизацииПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ИмяРаздела = "АнализЧувствительности71" Тогда
			ВалютаВыведена = Ложь;
		КонецЕсли;
		
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			Если ТекстРасшифровки = "" Тогда
				СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
			Иначе
				СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина"));
			КонецЕсли;
			
			ТекСумма = 0;
			ТекСуммаРасшифровки = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				Если ИмяРаздела = "АнализЧувствительности71" Тогда
					ТекСуммаРасшифровки = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы + "ВВалюте");
				КонецЕсли;
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			Если ИмяРаздела = "АнализЧувствительности71" Тогда //Расшифровка в валюте проводки, отчет в валюте документа
				Если Не ВалютаВыведена Тогда
					Выборка = ВыборкаПоСчетам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ТекВалюта = Запрос.Параметры.Валюта;
					ТекКурс = Запрос.Параметры.Курс;
					ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", "", "#Валюта: " + ТекВалюта + "; Курс = " + ТекКурс + " * 0,1",0, , , , , ИмяРаздела);
					ВалютаВыведена = Истина;
				КонецЕсли;
				
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСуммаРасшифровки, ТекСчет, , , , ИмяРаздела);
			Иначе
				Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
					стрЗначенияОтбора = "";
					Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
						стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
					КонецЦикла;
					
					стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
					СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
				КонецЕсли;
				ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ТекСумма, ТекСчет, , , , ИмяРаздела);
			КонецЕсли;
			
		КонецЦикла;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, ТекРаздел, НомерКолонкиОтчетногоПериода, НомерКолонкиПредыдущегоПериода, ВидыСубконто = Неопределено, Развернутый = Ложь, стрОтбор = "", стрОтборВирт = "", КодКорреспондентскогоСчета = "", ВидыСубконтоКорСчета = Неопределено, ВидСравненияКорСчета = "КорСчет В ИЕРАРХИИ (&СписокКорСчетов)", ШаблонТекстаЗапроса = "")
	
	ИмяРаздела = мИмяЗаполняемогоРаздела;
	
	//Запрос = ПолучитьИзВременногоХранилища(Адрес_Запрос);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос, стрОтборВирт);
	
	Запрос.Выполнить();
	
	мТаблицаСчетов      = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = Новый СписокЗначений;
	Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
		ТекСчет = СтрокаСчета.Счет;
		Если СписокСчетов.НайтиПоЗначению(ТекСчет) = Неопределено Тогда
			СписокСчетов.Добавить(ТекСчет);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Если Не ПустаяСтрока(КодКорреспондентскогоСчета) Тогда
		СпискокКорСчетов = ПолучитьСчетПоКоду(КодКорреспондентскогоСчета);
		Запрос.УстановитьПараметр("СписокКорСчетов", СпискокКорСчетов);
		Запрос.УстановитьПараметр("ВидыСубконтоКорСчета", ВидыСубконтоКорСчета);
	КонецЕсли;
	
	Если (ВидСальдо = "НаНачало" Или ВидСальдо = "НаКонец") И (ИмяРаздела <> "АнализЧувствительности71") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет
		|ИЗ
		|	СчетаСОборотнымСубконтоКонтрагенты КАК СчетаСОборотнымСубконтоКонтрагенты
		|ГДЕ
		|	СчетаСОборотнымСубконтоКонтрагенты.Счет В ИЕРАРХИИ (&СписокСчетов)";
		
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Не Запрос.Выполнить().Пустой();
	Иначе
		ЕстьСчетаСОборотнымСубконтоКонтрагенты = Ложь;
	КонецЕсли;
	
	Если ШаблонТекстаЗапроса = "" Тогда
		ШаблонТекстаЗапроса = ПолучитьШаблонТекстаЗапроса(ВидСальдо, ВидыСубконто, Развернутый, стрОтбор, стрОтборВирт, КодКорреспондентскогоСчета, ВидыСубконтоКорСчета, ВидСравненияКорСчета, ЕстьСчетаСОборотнымСубконтоКонтрагенты);
	КонецЕсли;
	
	Если ИмяРаздела = "АнализЧувствительности71" Тогда
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "КАК СуммаКонечныйОстатокДт,",
		"КАК СуммаКонечныйОстатокДт,
		|	вэУправленческий.ВалютнаяСуммаОстатокДт КАК СуммаКонечныйОстатокДтВВалюте,
		|	вэУправленческий.ВалютнаяСуммаОстатокКт КАК СуммаКонечныйОстатокКтВВалюте,");
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "
		|ИТОГИ", "
		|ИТОГИ
		|	СУММА(СуммаКонечныйОстатокДтВвалюте),
		|	СУММА(СуммаКонечныйОстатокКтВвалюте),");
	КонецЕсли;
	
	Для НомерЦикла = 1 По 2 Цикл
		
		Если НомерЦикла = 1 Тогда
			ТекстЗапроса = ШаблонТекстаЗапроса;
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
			НомерКолонки = НомерКолонкиОтчетногоПериода;
		Иначе
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&НачалоПериода", "&НачалоПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПредыдущегоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&грКонецПериода", "&грКонецПредыдущегоПериода");
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КурсыВалютНаКонецТекущегоПериода", "КурсыВалютНаКонецПрошлогоПериода");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоэффициентыВалютТП", "КоэффициентыВалютПП");
			
			ТекПредставлениеПериода = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
			НомерКолонки = НомерКолонкиПредыдущегоПериода;
		КонецЕсли;
		
		мТаблицаСчетов.ЗаполнитьЗначения(0, "Сумма");
		
		Запрос.Текст = ТекстЗапроса;
		
		
		ТекстСравненияПоСубконтоПредставление = "";
		СравнениеИтогаСНулем = "";
		КонсолидированнаяОтчетность.ОтборПоСубконтоПлюсМинус(Запрос, ВидСальдо, мТаблицаСчетов, ТекстСравненияПоСубконтоПредставление, СравнениеИтогаСНулем, стрОтборВирт);
		
		стрВсеСчета = "";
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			стрВсеСчета = стрВсеСчета + ?(стрВсеСчета = "", "", ", ") + СтрокаСчета.Счет;
		КонецЦикла;
		
		ВыборкаПоСчетам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//данные выводим итогом по счетам
		ИтогСумма = 0;
			
		Для Каждого СтрокаСчета Из мТаблицаСчетов Цикл
			
			ТекСчет = СтрокаСчета.Счет;
			
			ИмяСлагаемого = СтрокаСчета.ИмяСлагаемого;
			ИмяРеквизитаСуммы = СтрокаСчета.ИмяРеквизитаСуммы;
			ЗнакОперации = СтрокаСчета.ЗнакОперации;
			ТекстРасшифровки = СтрокаСчета.ТекстРасшифровки;
			
			ИмяЯчейки = Лев(СтрокаСчета.ИмяЯчейки, 3) + НомерКолонки;
			СтрокаСчета.ИмяЯчейки = ИмяЯчейки;
			
			//Если ТекстРасшифровки = "" Тогда
			//	СлагаемоеНаименование = НаименованиеСлагаемого(ИмяСлагаемого, СокрЛП(СтрокаСчета.Счет.Код), КодКорреспондентскогоСчета, ?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета));
			//Иначе
			//	СлагаемоеНаименование = СтрЗаменить(ТекстРасшифровки, "#Период#", ПредставлениеПериода(?(НомерЦикла = 1, мДатаНачалаПериодаОтчета, мДатаНачалаПрошлогоПериодаОтчета), ?(НомерЦикла = 1, мДатаКонцаПериодаОтчета, мДатаКонцаПрошлогоПериодаОтчета), "ФП = Истина"));
			//КонецЕсли;
			
			ТекСумма = 0;
			
			ВыборкаПоСчетам.Сбросить();
			ОтборСчета = Новый Структура("Счет", ТекСчет);
			Если ВыборкаПоСчетам.НайтиСледующий(ОтборСчета) Тогда
				ТекСумма = ?(ЗнакОперации = "-", -1, 1) * ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы);
				СтрокаСчета.Сумма = СтрокаСчета.Сумма + ТекСумма;
			КонецЕсли;
			
			ИтогСумма = ИтогСумма + ТекСумма;
			
		КонецЦикла;
			
		//обнулим сумму, если она не подходит под условие СравнениеИтогаСНулем
		Если СравнениеИтогаСНулем = "Больше" и ИтогСумма < 0 Тогда
			ИтогСумма = 0;
		ИначеЕсли СравнениеИтогаСНулем = "Меньше" и ИтогСумма > 0 Тогда
			ИтогСумма = 0;
		КонецЕсли;
		
		СлагаемоеНаименование = "Все субконто у которых " + ТекстСравненияПоСубконтоПредставление + " итог по счетам: " + стрВсеСчета;
		
		Если Запрос.Параметры.Свойство("мВидыДоходовРасходовНФО") и СтрЧислоВхождений(стрОтборВирт, "ГруппыФинансовогоУчетаДоходовРасходов") > 0  Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мВидыДоходовРасходовНФО Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", ", ") + эл;
			КонецЦикла;
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор по ОФР " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("мУПЦБКлассификация") и СтрЧислоВхождений(стрОтборВирт, "мУПЦБКлассификация") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.мУПЦБКлассификация Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("УчетныйАктивЦБРФ") и СтрЧислоВхождений(стрОтборВирт, "УчетныйАктивЦБРФ") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.УчетныйАктивЦБРФ Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по", "исключая");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + " классификации: " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если Запрос.Параметры.Свойство("ДополнительнаяАналитика") и СтрЧислоВхождений(стрОтборВирт, "ДополнительнаяАналитика") > 0 Тогда
			стрЗначенияОтбора = "";
			Для Каждого эл из Запрос.Параметры.ДополнительнаяАналитика Цикл
				стрЗначенияОтбора = стрЗначенияОтбора + ?(стрЗначенияОтбора = "", "", "; ") + """" + СокрЛП(эл) + """";
			КонецЦикла;
			
			стрОтбор = ?(СтрЧислоВхождений(стрОтборВирт, "ТОГДА ИСТИНА") > 0, "по дополнительной аналитике", "исключая дополнительную аналитику");
			
			СлагаемоеНаименование = СлагаемоеНаименование + Символы.ПС + "Отбор " + стрОтбор + ": " + стрЗначенияОтбора;
		КонецЕсли;
		
		Если НЕ СтрокаСчета = Неопределено Тогда
			ЗнакОперации = "+";
			ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейки, "Строка """ + СтрокаСчета.ИмяПоказателя + """, графа """ + ТекПредставлениеПериода + """", ЗнакОперации, СлагаемоеНаименование, ИтогСумма, стрВсеСчета, , , , ИмяРаздела);
		КонецЕсли;
		
		ВремТз = мТаблицаСчетов.Скопировать(, "ИмяЯчейки, Сумма");
		ВремТз.Свернуть("ИмяЯчейки", "Сумма");
		Для Каждого СтрокаСчета Из ВремТз Цикл
			//значение ячейки выставляем по итогу
			УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, ИтогСумма);
			//УстановитьЗначениеПоказателя(ТекРаздел, СтрокаСчета.ИмяЯчейки, СтрокаСчета.Сумма);
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос, стрОтборВирт = "")
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ СчетаСОборотнымСубконтоКонтрагенты ИЗ &ТаблицаСчетовСОбСубконто КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютТП ИЗ &КоэффициентыВалютТП КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ КоэффициентыВалютПП ИЗ &КоэффициентыВалютПП КАК ТЗ";
	
	Если СтрНайти(стрОтборВирт, "&УчетныйАктивЦБРФ") > 0 Тогда
	
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент КАК Эмитент,
		|		ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|		ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|	ПОМЕСТИТЬ ПереопределенияАктивов
		|	ИЗ
		|		РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|	;
        |
		|	////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Акции.Ссылка КАК Ссылка
		|	ПОМЕСТИТЬ Активы
		|	ИЗ
		|		Справочник.Акции КАК Акции
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|			ПО Акции.Эмитент = ПереопределенияАктивов.Эмитент
		|				И Акции.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|	ГДЕ
		|		ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, Акции.УчетныйАктивЦБРФ) В (&УчетныйАктивЦБРФ)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Облигации.Ссылка
		|	ИЗ
		|		Справочник.Облигации КАК Облигации
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|			ПО Облигации.Эмитент = ПереопределенияАктивов.Эмитент
		|				И Облигации.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|	ГДЕ
		|		ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, Облигации.УчетныйАктивЦБРФ) В (&УчетныйАктивЦБРФ);
		|
		|	////////////////////////////////////////////////////////////////////////////////
		|";
	
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетПоКоду(Счета, флСообщитьОНеНайденномСчете = Истина)
	
	Если ТипЗнч(Счета) <> Тип("Строка") Тогда
		Возврат Неопределено;
	Иначе
		
		ПланСчетов = ПланыСчетов.Единый;
		
		СписокСчетов = Новый СписокЗначений;
		
		Счета = СтрЗаменить(Счета, " ", "");
		Счета = СтрЗаменить(Счета, ",", Символы.ПС);
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(Счета) Цикл
			
			КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			СчетСсылка = ПланыСчетов.Единый.НайтиПоКоду(КодСчета);
			Если ЗначениеЗаполнено(СчетСсылка) Тогда
			
				СписокСчетов.Добавить(СчетСсылка);
			
			КонецЕсли; 
			//КодСчета = СтрПолучитьСтроку(Счета, НомерСтроки);
			////СчетСсылка = ПланСчетов.НайтиОсновнойПоКоду(КодСчета);
			//мСчета = УПЦБ_ЗащищенныйМодуль.НайтиОсновнойПоКоду(КодСчета, Адрес_КешТаблицаДляПоискаСчетов, Объект.РегистрБухгалтерии);
			//Если мСчета.Количество() = 0 Тогда
			//	
			//	Если флСообщитьОНеНайденномСчете Тогда
			//		
			//		ТекстСообщения = СтрШаблон(
			//		НСтр("ru = 'Не удалось определить счет по коду «%1». Данные по этому счету не попадут в отчет.'"),
			//		КодСчета);
			//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//		
			//	КонецЕсли;
			//	
			//Иначе
			//	Для Каждого СчетСсылка из мСчета Цикл
			//		СписокСчетов.Добавить(СчетСсылка);
			//	КонецЦикла;
			//КонецЕсли;
			
		КонецЦикла;
		
		Возврат СписокСчетов;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуПоСчету(ТекСчет, ВыборкаПоСчетам, ИмяРеквизитаСуммы)
	
	СуммаПоСчету = 0;
	
	Если Найти(ИмяРеквизитаСуммы, "Остаток") > 0 И Найти(ИмяРеквизитаСуммы, "Развернутый") = 0 Тогда
		Если ТекСчет.Вид = ВидСчета.АктивноПассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
				Если СуммаОборотПоСчету > 0 Тогда
					СуммаПоСчету = СуммаОборотПоСчету;
				КонецЕсли;
			ИначеЕсли Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаОборотПоСчету = ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы];
				Если СуммаОборотПоСчету < 0 Тогда
					СуммаПоСчету = -СуммаОборотПоСчету;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Активный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Дт") > 0 Тогда
				СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы] - ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Дт", "Кт")];
			КонецЕсли;
		ИначеЕсли ТекСчет.Вид = ВидСчета.Пассивный Тогда
			Если Найти(ИмяРеквизитаСуммы, "Кт") > 0 Тогда
				СуммаПоСчету = -(ВыборкаПоСчетам[СтрЗаменить(ИмяРеквизитаСуммы, "Кт", "Дт")] - ВыборкаПоСчетам[ИмяРеквизитаСуммы]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СуммаПоСчету = ВыборкаПоСчетам[ИмяРеквизитаСуммы];
	КонецЕсли;
	
	Возврат СуммаПоСчету;
	
КонецФункции

&НаСервере
Процедура ДобавитьСчетВТаблицуСчетов(ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, КодСчета, ТекстРасшифровки = "", ИмяРеквизитаСуммы = "")
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	СписокСчетов = ПолучитьСчетПоКоду(КодСчета);
	
	Если СписокСчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого эл_СписокСчетов из СписокСчетов Цикл
		
		НоваяСтрокаСчета = мТаблицаСчетов.Добавить();
		НоваяСтрокаСчета.ИмяЯчейки = ИмяЯчейки;
		НоваяСтрокаСчета.ИмяПоказателя = ИмяПоказателя;
		НоваяСтрокаСчета.Счет = эл_СписокСчетов.Значение;
		НоваяСтрокаСчета.ЗнакОперации = ЗнакОперации;
		НоваяСтрокаСчета.ИмяСлагаемого = ИмяСлагаемого;
		НоваяСтрокаСчета.ТекстРасшифровки = СтрЗаменить(ТекстРасшифровки, КодСчета, эл_СписокСчетов.Значение);
		Если ИмяРеквизитаСуммы <> "" Тогда
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ИмяРеквизитаСуммы;
		Иначе
			НоваяСтрокаСчета.ИмяРеквизитаСуммы = ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода)
	
	Возврат КонсолидированнаяОтчетность.НаименованиеСлагаемого(ИмяСлагаемого, КодСчета, КодКорреспондентскогоСчета, ДатаНачалаПериода, ДатаКонцаПериода);
	
КонецФункции

&НаСервере
Функция ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого)
	
	Возврат КонсолидированнаяОтчетность.ПолучитьИмяРеквизитаСуммыПоИмениСлагаемого(ИмяСлагаемого);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет = Неопределено, КорСчет = Неопределено, Сдвиг = Неопределено, ПраваяГраница = Неопределено, Раздел = Неопределено)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	Если ТипЗнч(ИмяСлагаемого) = Тип("Массив") Тогда
		МассивСлагаемых	= ИмяСлагаемого;
		МассивЗначений	= Сумма;
	Иначе
		МассивСлагаемых	= РаботаСКоллекциями.ЗначениеВМассив(ИмяСлагаемого);
		МассивЗначений	= РаботаСКоллекциями.ЗначениеВМассив(Сумма);
	КонецЕсли;
	
	ВсегоСлагаемых = МассивСлагаемых.Количество(); 
		
	Для н = 1 По ВсегоСлагаемых Цикл 
		СтруктураПолей = Новый Структура("СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, ИмяСлагаемого, Сумма, Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел",
		СчетДоверительногоУправления, ИмяЯчейки, ИмяПоказателя, ЗнакОперации, МассивСлагаемых[н-1], МассивЗначений[н-1], Счет, КорСчет, Сдвиг, ПраваяГраница, Раздел);
		
		КонсолидированнаяОтчетность.ДобавитьСтрокуВРасшифровку(ТаблицаРасшифровки, мДатаНачалаПериодаОтчета, мДатаКонцаПериодаОтчета, СтруктураПолей);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПоказателя(ТабДокумент, ИмяЯчейки, Знач ЗначениеЯчейки)
	
	Попытка
		Если ТипЗнч(ЗначениеЯчейки) <> Тип("Число") И ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
			ЗначениеЯчейки = Строка(ЗначениеЯчейки);
			Если СтрНайти(ТабДокумент.Области[ИмяЯчейки].Значение, ЗначениеЯчейки) = 0 И ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = ", " + ЗначениеЯчейки;
			ИначеЕсли ЗначениеЗаполнено(ТабДокумент.Области[ИмяЯчейки].Значение) Тогда
				ЗначениеЯчейки = "";
			КонецЕсли;
		КонецЕсли; 
		ТабДокумент.Области[ИмяЯчейки].Значение = ТабДокумент.Области[ИмяЯчейки].Значение + ?(ЗначениеЯчейки = Null, 0,ЗначениеЯчейки);
	Исключение
		ТекстСообщения = "Ошибка заполнения раздела: " + мИмяЗаполняемогоРаздела + " не найдена ячейка " + ИмяЯчейки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДепозитныеВкладыДолгосрочные()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК ДепозитныйВклад
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) > 90
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПрошлогоПериода,
		|			&КонецПрошлогоПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) > 90";
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПрошлогоПериода", СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПрошлогоПериода", СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДепозитныйВклад");

КонецФункции 

&НаСервере
Функция ПолучитьДепозитныеВкладыКраткосрочные()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК ДепозитныйВклад
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) <= 90
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПрошлогоПериода,
		|			&КонецПрошлогоПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПрошлогоПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) <= 90";
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПрошлогоПериода", СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПрошлогоПериода", СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДепозитныйВклад");

КонецФункции 

&НаСервере
Функция ПолучитьМассивБрокеровКредитныхОрганизаций()

	МассивБрокеров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БрокерскиеКомпании.ЮрФизЛицо КАК Брокер
		|ИЗ
		|	Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|		ПО БрокерскиеКомпании.ЮрФизЛицо = ПеречниОбъектов.Объект
		|			И (ПеречниОбъектов.Период = &ДатаПеречня)
		|			И (ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ))
		|			И (ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора))
		|			И (ПеречниОбъектов.Включен)
		|ГДЕ
		|	ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)";
	
	ДатаПеречня = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ДатаПеречня", ДатаПеречня);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Брокер");

КонецФункции 

&НаСервере
Функция ПолучитьМассивБрокеровНеКредитныхОрганизаций()

	МассивБрокеров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БрокерскиеКомпании.ЮрФизЛицо КАК Брокер
		|ИЗ
		|	Справочник.БрокерскиеКомпании КАК БрокерскиеКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|		ПО БрокерскиеКомпании.ЮрФизЛицо = ПеречниОбъектов.Объект
		|			И (ПеречниОбъектов.Период = &ДатаПеречня)
		|			И (ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ))
		|			И (ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора))
		|			И (ПеречниОбъектов.Включен)
		|ГДЕ
		|	ПеречниОбъектов.ВидПеречня <> ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)";
	
	ДатаПеречня = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ДатаПеречня", ДатаПеречня);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Брокер");

КонецФункции 

&НаСервере
Функция ПодготовитьВременныеТаблицыДокумента()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВалютаДокумента"          	, СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("НачалоПериода"            	, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода"             	, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода" 	, СтруктураРеквизитовФормы.мДатаНачалаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода"  	, СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета);
	Запрос.УстановитьПараметр("грКонецПериода"           	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("грКонецПредыдущегоПериода"	, Новый Граница(СтруктураРеквизитовФормы.мДатаКонцаПрошлогоПериодаОтчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, СтруктураРеквизитовФормы.Организация);

	ЗапрашиваемыеТаблицы = Новый СписокЗначений;
	ЗапрашиваемыеТаблицы.Добавить("КоэффициентыВалют");
	ЗапрашиваемыеТаблицы.Добавить("КурсыВалютНаКонец");
	ЗапрашиваемыеТаблицы.Добавить("ТаблицаСчетовСОбСубконто");
	ЗапрашиваемыеТаблицы.Добавить("ФинансовыеОрганизации");
	
	ВременныеТаблицы = КонсолидированнаяОтчетность.ПодготовитьВременныеТаблицыДокумента(Запрос, ЗапрашиваемыеТаблицы);
	
	Для Каждого ЭлементСтруктуры из ВременныеТаблицы Цикл 
		Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;	
	
	Если ВременныеТаблицы.Свойство("ДатаПеречняТП") Тогда 
		ЭтаФорма.Комментарий = "При построении отчета использован перечень организаций финансового сектора по состоянию на " + Формат(ВременныеТаблицы.ДатаПеречняТП, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти 

#Область ПроцедурыЗаполненияРазделов

&НаСервере
Процедура ДобавитьВ_КешТаблицаДляСчетовОбесценение(мТаблицаСчетов)
	
	Если Адрес_КешТаблицаДляСчетовОбесценение = "" Тогда
		мКешТаблицаДляСчетовОбесценение = Новый ТаблицаЗначений;
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Строка");
		мКешТаблицаДляСчетовОбесценение.Колонки.Добавить("Счет");
	Иначе
		мКешТаблицаДляСчетовОбесценение = ПолучитьИзВременногоХранилища(Адрес_КешТаблицаДляСчетовОбесценение);
	КонецЕсли;
	
	Для Каждого стр_мТаблицаСчетов из мТаблицаСчетов Цикл
		стр_мКешТаблицаДляСчетовОбесценение = мКешТаблицаДляСчетовОбесценение.Добавить();
		стр_мКешТаблицаДляСчетовОбесценение.Строка = Лев(стр_мТаблицаСчетов.ИмяЯчейки, 3);
		стр_мКешТаблицаДляСчетовОбесценение.Счет = стр_мТаблицаСчетов.Счет; 
	КонецЦикла;
	
	Адрес_КешТаблицаДляСчетовОбесценение = ПоместитьВоВременноеХранилище(мКешТаблицаДляСчетовОбесценение, УникальныйИдентификатор);
	
КонецПроцедуры

// 5.1
&НаСервере
Процедура ЗаполнитьРаздел_ДенежныеСредстваСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение							= СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение							= СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	// Примечания
	ТекРаздел.Области.Примечание512_Дата1.Значение						= Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
    ТекРаздел.Области.Примечание513_Дата1.Значение						= Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание513_Дата2.Значение						= Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание513_Дата3.Значение						= Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание513_Дата4.Значение						= Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	// Расчетные поля 
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20202", "Сальдо на конец периода #Период# по дебету счета 20202");
	ДобавитьСчетВТаблицуСчетов("П01", "Денежные средства в кассе", "+", "!СКД", "20203", "Сальдо на конец периода #Период# по дебету счета 20203");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Денежные средства в пути", "+", "!СКД", "20209", "Сальдо на конец периода #Период# по дебету счета 20209");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20315", "Сальдо на конец периода #Период# по дебету счета 20315 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20322", "Сальдо на конец периода #Период# по дебету счета 20322 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20324", "Сальдо на конец периода #Период# по дебету счета 20324 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20325", "Сальдо на конец периода #Период# по кредиту счета 20325 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20601", "Сальдо на конец периода #Период# по дебету счета 20601 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20602", "Сальдо на конец периода #Период# по дебету счета 20602 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20605", "Сальдо на конец периода #Период# по кредиту счета 20605 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20607", "Сальдо на конец периода #Период# по дебету счета 20607 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20613", "Сальдо на конец периода #Период# по кредиту счета 20613 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20316", "Сальдо на конец периода #Период# по дебету счета 20316 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20323", "Сальдо на конец периода #Период# по дебету счета 20323 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20326", "Сальдо на конец периода #Период# по дебету счета 20326 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20327", "Сальдо на конец периода #Период# по кредиту счета 20327 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20604", "Сальдо на конец периода #Период# по дебету счета 20604 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20606", "Сальдо на конец периода #Период# по кредиту счета 20606 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20608", "Сальдо на конец периода #Период# по дебету счета 20608 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20610", "Сальдо на конец периода #Период# по дебету счета 20610 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20612", "Сальдо на конец периода #Период# по кредиту счета 20612 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "-", "!СКК", "20614", "Сальдо на конец периода #Период# по кредиту счета 20614 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладКраткосрочный;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Депозиты в кредитных организациях и банках-нерезидентах, классифицированные как денежные эквиваленты", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603 по МНО");
	стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03",,,,стрОтборВирт);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20501", "Сальдо на конец периода #Период# по дебету счета 20501, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "20502", "Сальдо на конец периода #Период# по дебету счета 20502, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Денежные средства, переданные в доверительное управление", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочее""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Прочие денежные средства", "+", "!СКД", "20802", "Сальдо на конец периода #Период# по дебету счета 20802, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
КонецПроцедуры

// 5.2
&НаСервере
Процедура ЗаполнитьРаздел_СверкаСуммВОтчетеОДенежныхПотокахСоСтатьямиСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение		= СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение		= СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
КонецПроцедуры

// 6.1
&НаСервере
Процедура ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизацияхСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Примечания	
	ТекРаздел.Области.Примечание611_Дата1.Значение = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание611_Дата2.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание611_Дата3.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание611_Дата4.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");	
	ТекРаздел.Области.Примечание612_Дата1.Значение = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание612_Дата2.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");	
	
	// Расчетные поля
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// обнулим кеш таблицы для счетов обесценение
	Адрес_КешТаблицаДляСчетовОбесценение = "";
			
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Резерв под обесценение", "+", "!СКК", "51520", "Сальдо на конец периода #Период# по кредиту счета 51520");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Резерв под обесценение", "+", "!СКК", "51523", "Сальдо на конец периода #Период# по кредиту счета 51523");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Резерв под обесценение", "+", "!СКК", "50421", "Сальдо на конец периода #Период# по кредиту счета 50421");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Резерв под обесценение", "+", "!СКК", "50424", "Сальдо на конец периода #Период# по кредиту счета 50424");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Резерв под обесценение", "+", "!СКК", "50426", "Сальдо на конец периода #Период# по кредиту счета 50426, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Долговые ценные бумаги кредитных организаций и банков-нерезидентов""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0206", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20321", "Сальдо на конец периода #Период# по кредиту счета 20321, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П0206", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20615", "Сальдо на конец периода #Период# по кредиту счета 20615, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П0206", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20616", "Сальдо на конец периода #Период# по кредиту счета 20616, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0306", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20321", "Сальдо на конец периода #Период# по кредиту счета 20321, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П0306", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20615", "Сальдо на конец периода #Период# по кредиту счета 20615, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П0306", "Депозиты в кредитных организациях и банках-нерезидентах. Резерв под обесценение", "+", "!СКК", "20616", "Сальдо на конец периода #Период# по кредиту счета 20616, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46417", "Сальдо на конец периода #Период# по кредиту счета 46417 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46717", "Сальдо на конец периода #Период# по кредиту счета 46717 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47317", "Сальдо на конец периода #Период# по кредиту счета 47317 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0506", "Прочие размещенные средства. Резерв под обесценение", "+", "!СКК", "46417", "Сальдо на конец периода #Период# по кредиту счета 46417, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П0506", "Прочие размещенные средства. Резерв под обесценение", "+", "!СКК", "46717", "Сальдо на конец периода #Период# по кредиту счета 46717, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П0506", "Прочие размещенные средства. Резерв под обесценение", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П0506", "Прочие размещенные средства. Резерв под обесценение", "+", "!СКК", "47317", "Сальдо на конец периода #Период# по кредиту счета 47317, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П0506", "Прочие размещенные средства. Резерв под обесценение", "+", "!СКК", "20805", "Сальдо на конец периода #Период# по кредиту счета 20805, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "51513", "Сальдо на конец периода #Период# по дебету счета 51513");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "51516", "Сальдо на конец периода #Период# по дебету счета 51516");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "51554", "Сальдо на конец периода #Период# по дебету счета 51554");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "-", "!СКК", "51555", "Сальдо на конец периода #Период# по кредиту счета 51555");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "51560", "Сальдо на конец периода #Период# по дебету счета 51560");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "-", "!СКК", "51561", "Сальдо на конец периода #Период# по кредиту счета 51561");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50413", "Сальдо на конец периода #Период# по дебету счета 50413");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50416", "Сальдо на конец периода #Период# по дебету счета 50416");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50454", "Сальдо на конец периода #Период# по дебету счета 50454");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "-", "!СКК", "50455", "Сальдо на конец периода #Период# по кредиту счета 50455");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50460", "Сальдо на конец периода #Период# по дебету счета 50460");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "-", "!СКК", "50461", "Сальдо на конец периода #Период# по кредиту счета 50461");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50418", "Сальдо на конец периода #Период# по дебету счета 50418, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Долговые ценные бумаги кредитных организаций и банков-нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "+", "!СКД", "50464", "Сальдо на конец периода #Период# по дебету счета 50464, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Долговые ценные бумаги кредитных организаций и банков-нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги кредитных организаций и банков-нерезидентов. Необесцененные", "-", "!СКК", "50465", "Сальдо на конец периода #Период# по кредиту счета 50465, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Долговые ценные бумаги кредитных организаций и банков-нерезидентов""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20315", "Сальдо на конец периода #Период# по дебету счета 20315 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20322", "Сальдо на конец периода #Период# по дебету счета 20322 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20324", "Сальдо на конец периода #Период# по дебету счета 20324 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20325", "Сальдо на конец периода #Период# по кредиту счета 20325 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20601", "Сальдо на конец периода #Период# по дебету счета 20601 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20602", "Сальдо на конец периода #Период# по дебету счета 20602 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20603", "Сальдо на конец периода #Период# по дебету счета 20603 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20605", "Сальдо на конец периода #Период# по кредиту счета 20605 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20607", "Сальдо на конец периода #Период# по дебету счета 20607 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20609", "Сальдо на конец периода #Период# по дебету счета 20609 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20611", "Сальдо на конец периода #Период# по кредиту счета 20611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20613", "Сальдо на конец периода #Период# по кредиту счета 20613 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20316", "Сальдо на конец периода #Период# по дебету счета 20316 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20323", "Сальдо на конец периода #Период# по дебету счета 20323 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20326", "Сальдо на конец периода #Период# по дебету счета 20326 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20327", "Сальдо на конец периода #Период# по кредиту счета 20327 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20604", "Сальдо на конец периода #Период# по дебету счета 20604 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20606", "Сальдо на конец периода #Период# по кредиту счета 20606 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20608", "Сальдо на конец периода #Период# по дебету счета 20608 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "+", "!СКД", "20610", "Сальдо на конец периода #Период# по дебету счета 20610 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20612", "Сальдо на конец периода #Период# по кредиту счета 20612 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	ДобавитьСчетВТаблицуСчетов("П02", "Депозиты в кредитных организациях и банках-нерезидентах. Необесцененные", "-", "!СКК", "20614", "Сальдо на конец периода #Период# по кредиту счета 20614 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Депозиты в кредитных организациях и банках нерезидентах"" или ""Субординированные депозиты""");
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	стрОтборВирт = СтруктураПеременныхДляОтбора.ДепозитныйВкладДолгосрочный;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", стрОтборВирт, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46410", "Сальдо на конец периода #Период# по дебету счета 46410 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46411", "Сальдо на конец периода #Период# по дебету счета 46411 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46418", "Сальдо на конец периода #Период# по кредиту счета 46418 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46419", "Сальдо на конец периода #Период# по дебету счета 46419 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46420", "Сальдо на конец периода #Период# по дебету счета 46420 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46421", "Сальдо на конец периода #Период# по кредиту счета 46421 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46422", "Сальдо на конец периода #Период# по кредиту счета 46422 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46710", "Сальдо на конец периода #Период# по дебету счета 46710 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46711", "Сальдо на конец периода #Период# по дебету счета 46711 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46718", "Сальдо на конец периода #Период# по кредиту счета 46718 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46719", "Сальдо на конец периода #Период# по дебету счета 46719 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46720", "Сальдо на конец периода #Период# по дебету счета 46720 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46721", "Сальдо на конец периода #Период# по кредиту счета 46721 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46722", "Сальдо на конец периода #Период# по кредиту счета 46722 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47020", "Сальдо на конец периода #Период# по дебету счета 47020 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47021", "Сальдо на конец периода #Период# по кредиту счета 47021 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47022", "Сальдо на конец периода #Период# по кредиту счета 47022 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47310", "Сальдо на конец периода #Период# по дебету счета 47310 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47311", "Сальдо на конец периода #Период# по дебету счета 47311 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47318", "Сальдо на конец периода #Период# по кредиту счета 47318 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47319", "Сальдо на конец периода #Период# по дебету счета 47319 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47320", "Сальдо на конец периода #Период# по дебету счета 47320 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47321", "Сальдо на конец периода #Период# по кредиту счета 47321 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47322", "Сальдо на конец периода #Период# по кредиту счета 47322 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Сделки обратного репо""");
	стрОтборКредитныеОрганизации = " И Субконто1 В(&БрокерыКредитныеОрганизации)";	
	Запрос.УстановитьПараметр("БрокерыКредитныеОрганизации", ПолучитьМассивБрокеровКредитныхОрганизаций());
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", стрОтборКредитныеОрганизации, "03", "04");
	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46410", "Сальдо на конец периода #Период# по дебету счета 46410, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46411", "Сальдо на конец периода #Период# по дебету счета 46411, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "46418", "Сальдо на конец периода #Период# по кредиту счета 46418, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46419", "Сальдо на конец периода #Период# по дебету счета 46419, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46420", "Сальдо на конец периода #Период# по дебету счета 46420, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "46421", "Сальдо на конец периода #Период# по кредиту счета 46421, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46710", "Сальдо на конец периода #Период# по дебету счета 46710, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46711", "Сальдо на конец периода #Период# по дебету счета 46711, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "46718", "Сальдо на конец периода #Период# по кредиту счета 46718, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46719", "Сальдо на конец периода #Период# по дебету счета 46719, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "46720", "Сальдо на конец периода #Период# по дебету счета 46720, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "46721", "Сальдо на конец периода #Период# по кредиту счета 46721, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	//ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	//ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47020", "Сальдо на конец периода #Период# по дебету счета 47020, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "47021", "Сальдо на конец периода #Период# по кредиту счета 47021, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47310", "Сальдо на конец периода #Период# по дебету счета 47310, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47311", "Сальдо на конец периода #Период# по дебету счета 47311, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "47318", "Сальдо на конец периода #Период# по кредиту счета 47318, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47319", "Сальдо на конец периода #Период# по дебету счета 47319, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "47320", "Сальдо на конец периода #Период# по дебету счета 47320, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ДобавитьСчетВТаблицуСчетов("П05", "Прочие размещенные средства. Необесцененные", "-", "!СКК", "47321", "Сальдо на конец периода #Период# по кредиту счета 47321, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", "И НЕ Субконто2 ССЫЛКА Документ.СделкаРЕПО", "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0503", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "20803", "Сальдо на конец периода #Период# по дебету счета 20803");
	ДобавитьСчетВТаблицуСчетов("П0503", "Прочие размещенные средства. Необесцененные", "+", "!СКД", "20801", "Сальдо на конец периода #Период# по дебету счета 20801");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,, , , , , );	
	
КонецПроцедуры

// 6.2
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение	= СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение	= СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	// Расчетные поля	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО) КАК СтавкаМакс,
		|	МИНИМУМ(УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО) КАК СтавкаМин,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМакс,
		|	МИНИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМин,
		|	МАКСИМУМ(УсловияСделокРЕПОСрезПоследнихП.СтавкаРЕПО) КАК СтавкаМаксП,
		|	МИНИМУМ(УсловияСделокРЕПОСрезПоследнихП.СтавкаРЕПО) КАК СтавкаМинП,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследнихП.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследнихП.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМаксП,
		|	МИНИМУМ(РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследнихП.СделкаРЕПО.Дата, УсловияСделокРЕПОСрезПоследнихП.ДатаВторойЧастиРЕПО, ДЕНЬ)) КАК ИнтервалМинП
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЧастьСделкиРЕПО = 1
		|				И СделкаРЕПО.Дата <= &КонецПериода
		|				И ДатаВторойЧастиРЕПО > &КонецПериода
		|				И &ТолькоКредитныеОрганизации) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПредыдущегоПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЧастьСделкиРЕПО = 1
		|					И СделкаРЕПО.Дата <= &КонецПредыдущегоПериода
		|					И ДатаВторойЧастиРЕПО > &КонецПредыдущегоПериода
		|					И &ТолькоКредитныеОрганизации) КАК УсловияСделокРЕПОСрезПоследнихП
		|		ПО (ИСТИНА)";
	
	// Только кредитные организации и банки-нерезиденты  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", "СделкаРЕПО.СделкаСЦентральнымКонтрагентом = ИСТИНА");  	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат[0].СтавкаМин <> NULL Тогда  
		УстановитьЗначениеПоказателя(ТекРаздел, "П0402", Строка(Результат[0].СтавкаМин) + "% - " + Строка(Результат[0].СтавкаМакс) + "%");
		УстановитьЗначениеПоказателя(ТекРаздел, "П0403", Строка(Результат[0].ИнтервалМин) + " д. - " + Строка(Результат[0].ИнтервалМакс) + " д.");
	КонецЕсли;
	
	Если Результат[0].СтавкаМинП <> NULL Тогда  
		УстановитьЗначениеПоказателя(ТекРаздел, "П0404", Строка(Результат[0].СтавкаМинП) + "% - " + Строка(Результат[0].СтавкаМаксП) + "%");
		УстановитьЗначениеПоказателя(ТекРаздел, "П0405", Строка(Результат[0].ИнтервалМинП) + " д. - " + Строка(Результат[0].ИнтервалМаксП) + " д.");	
	КонецЕсли;

КонецПроцедуры

// 7.1
&НаСервере
Процедура ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимости2017Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50104", "Сальдо на конец периода #Период# по дебету счета 50104, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50105", "Сальдо на конец периода #Период# по дебету счета 50105, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50106", "Сальдо на конец периода #Период# по дебету счета 50106, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50107", "Сальдо на конец периода #Период# по дебету счета 50107, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50108", "Сальдо на конец периода #Период# по дебету счета 50108, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50109", "Сальдо на конец периода #Период# по дебету счета 50109, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50110", "Сальдо на конец периода #Период# по дебету счета 50110, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50118", "Сальдо на конец периода #Период# по дебету счета 50118, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50122", "Сальдо на конец периода #Период# по кредиту счета 50122, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50123", "Сальдо на конец периода #Период# по кредиту счета 50123, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50124", "Сальдо на конец периода #Период# по кредиту счета 50124, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50125", "Сальдо на конец периода #Период# по кредиту счета 50125, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50126", "Сальдо на конец периода #Период# по кредиту счета 50126, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50127", "Сальдо на конец периода #Период# по кредиту счета 50127, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50128", "Сальдо на конец периода #Период# по кредиту счета 50128, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50130", "Сальдо на конец периода #Период# по кредиту счета 50130, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50131", "Сальдо на конец периода #Период# по дебету счета 50131, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50132", "Сальдо на конец периода #Период# по дебету счета 50132, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50133", "Сальдо на конец периода #Период# по дебету счета 50133, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50134", "Сальдо на конец периода #Период# по дебету счета 50134, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50135", "Сальдо на конец периода #Период# по дебету счета 50135, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50136", "Сальдо на конец периода #Период# по дебету счета 50136, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50137", "Сальдо на конец периода #Период# по дебету счета 50137, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50139", "Сальдо на конец периода #Период# по дебету счета 50139, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50150", "Сальдо на конец периода #Период# по дебету счета 50150, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50151", "Сальдо на конец периода #Период# по кредиту счета 50151, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50152", "Сальдо на конец периода #Период# по дебету счета 50152, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50153", "Сальдо на конец периода #Период# по кредиту счета 50153, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50154", "Сальдо на конец периода #Период# по дебету счета 50154, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50155", "Сальдо на конец периода #Период# по кредиту счета 50155, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50156", "Сальдо на конец периода #Период# по дебету счета 50156, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50157", "Сальдо на конец периода #Период# по кредиту счета 50157, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50158", "Сальдо на конец периода #Период# по дебету счета 50158, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50159", "Сальдо на конец периода #Период# по кредиту счета 50159, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50160", "Сальдо на конец периода #Период# по дебету счета 50160, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50161", "Сальдо на конец периода #Период# по кредиту счета 50161, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50162", "Сальдо на конец периода #Период# по дебету счета 50162, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50163", "Сальдо на конец периода #Период# по кредиту счета 50163, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50167", "Сальдо на конец периода #Период# по кредиту счета 50167, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51211", "Сальдо на конец периода #Период# по дебету счета 51211, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51212", "Сальдо на конец периода #Период# по дебету счета 51212, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51213", "Сальдо на конец периода #Период# по дебету счета 51213, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51214", "Сальдо на конец периода #Период# по дебету счета 51214, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51215", "Сальдо на конец периода #Период# по дебету счета 51215, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51216", "Сальдо на конец периода #Период# по дебету счета 51216, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51217", "Сальдо на конец периода #Период# по дебету счета 51217, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51218", "Сальдо на конец периода #Период# по кредиту счета 51218, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51219", "Сальдо на конец периода #Период# по кредиту счета 51219, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51220", "Сальдо на конец периода #Период# по кредиту счета 51220, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51221", "Сальдо на конец периода #Период# по кредиту счета 51221, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51222", "Сальдо на конец периода #Период# по кредиту счета 51222, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51223", "Сальдо на конец периода #Период# по кредиту счета 51223, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51224", "Сальдо на конец периода #Период# по кредиту счета 51224, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51225", "Сальдо на конец периода #Период# по дебету счета 51225, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51226", "Сальдо на конец периода #Период# по дебету счета 51226, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51227", "Сальдо на конец периода #Период# по дебету счета 51227, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51228", "Сальдо на конец периода #Период# по дебету счета 51228, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51229", "Сальдо на конец периода #Период# по дебету счета 51229, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51230", "Сальдо на конец периода #Период# по дебету счета 51230, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51231", "Сальдо на конец периода #Период# по дебету счета 51231, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51250", "Сальдо на конец периода #Период# по дебету счета 51250, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51251", "Сальдо на конец периода #Период# по кредиту счета 51251, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51252", "Сальдо на конец периода #Период# по дебету счета 51252, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51253", "Сальдо на конец периода #Период# по кредиту счета 51253, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51254", "Сальдо на конец периода #Период# по дебету счета 51254, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51255", "Сальдо на конец периода #Период# по кредиту счета 51255, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51256", "Сальдо на конец периода #Период# по дебету счета 51256, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51257", "Сальдо на конец периода #Период# по кредиту счета 51257, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51258", "Сальдо на конец периода #Период# по дебету счета 51258, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51259", "Сальдо на конец периода #Период# по кредиту счета 51259, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51260", "Сальдо на конец периода #Период# по дебету счета 51260, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51261", "Сальдо на конец периода #Период# по кредиту счета 51261, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "51262", "Сальдо на конец периода #Период# по дебету счета 51262, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "51263", "Сальдо на конец периода #Период# по кредиту счета 51263, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50605", "Сальдо на конец периода #Период# по дебету счета 50605, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50606", "Сальдо на конец периода #Период# по дебету счета 50606, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50607", "Сальдо на конец периода #Период# по дебету счета 50607, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50608", "Сальдо на конец периода #Период# по дебету счета 50608, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50618", "Сальдо на конец периода #Период# по дебету счета 50618, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50622", "Сальдо на конец периода #Период# по кредиту счета 50622, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50623", "Сальдо на конец периода #Период# по кредиту счета 50623, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50624", "Сальдо на конец периода #Период# по кредиту счета 50624, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50625", "Сальдо на конец периода #Период# по кредиту счета 50625, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50626", "Сальдо на конец периода #Период# по кредиту счета 50626, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50627", "Сальдо на конец периода #Период# по дебету счета 50627, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50628", "Сальдо на конец периода #Период# по дебету счета 50628, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50629", "Сальдо на конец периода #Период# по дебету счета 50629, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50630", "Сальдо на конец периода #Период# по дебету счета 50630, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50631", "Сальдо на конец периода #Период# по дебету счета 50631, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50166", "Сальдо на конец периода #Период# по дебету счета 50166, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "50670", "Сальдо на конец периода #Период# по дебету счета 50670, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ДобавитьСчетВТаблицуСчетов("П02", "Ценные бумаги, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "-", "!СКК", "50671", "Сальдо на конец периода #Период# по кредиту счета 50671, у которых по реквизиту ""Классификатор активов и обязательств"" значение ""Ценные буммаги по справ.строимости, при первоначальном признании в прибыли и убытки""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Прочие долевые инструменты, классифицируемые как оцениваемые по справедливой стоимости, изменения которой отражаются в составе прибыли или убытка, при первоначальном признании", "+", "!СКД", "60202", "Сальдо на конец периода #Период# по дебету счета 60202");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Производные финансовые инструменты", "+", "!СКД", "52701", "Сальдо на конец периода #Период# по дебету счета 52701");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	стрОтборВирт = "#ОтборПоСубконтоДоговорЦенныеБумагиПлюс";
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Производные финансовые инструменты", "-", "!СКК", "52602", "Сальдо на конец периода #Период# по кредиту счета 52602");
	ДобавитьСчетВТаблицуСчетов("П03", "Производные финансовые инструменты", "+", "!СКД", "52601", "Сальдо на конец периода #Период# по дебету счета 52601");
	ДобавитьСчетВТаблицуСчетов("П03", "Производные финансовые инструменты", "+", "!СКД", "52603", "Сальдо на конец периода #Период# по дебету счета 52603");
	ДобавитьСчетВТаблицуСчетов("П03", "Производные финансовые инструменты", "-", "!СКК", "52604", "Сальдо на конец периода #Период# по кредиту счета 52604");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды_ОтборПоСубконтоПлюсМинус(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);
	
КонецПроцедуры

// 7.4
&НаСервере
Процедура ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимостиСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50605", "Сальдо на конец периода #Период# по дебету счета 50605");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50607", "Сальдо на конец периода #Период# по дебету счета 50607");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50622", "Сальдо на конец периода #Период# по кредиту счета 50622");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50624", "Сальдо на конец периода #Период# по кредиту счета 50624");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50627", "Сальдо на конец периода #Период# по дебету счета 50627");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50629", "Сальдо на конец периода #Период# по дебету счета 50629");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50670", "Сальдо на конец периода #Период# по дебету счета 50670");
	ДобавитьСчетВТаблицуСчетов("П02", "Долевые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50671", "Сальдо на конец периода #Период# по кредиту счета 50671");
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50606", "Сальдо на конец периода #Период# по дебету счета 50606");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50608", "Сальдо на конец периода #Период# по дебету счета 50608");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50623", "Сальдо на конец периода #Период# по кредиту счета 50623");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50625", "Сальдо на конец периода #Период# по кредиту счета 50625");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50628", "Сальдо на конец периода #Период# по дебету счета 50628");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50630", "Сальдо на конец периода #Период# по дебету счета 50630");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50670", "Сальдо на конец периода #Период# по дебету счета 50670");
	ДобавитьСчетВТаблицуСчетов("П03", "Долевые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50671", "Сальдо на конец периода #Период# по кредиту счета 50671");
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ; // + СтруктураПеременныхДляОтбора.ФинансовыеОрганизации;
	стрОтбор	 = СтруктураПеременныхДляОтбора.ФинансовыеОрганизации;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , стрОтбор, стрОтборВирт);
	
	стрОтборВирт = "";
	стрОтбор 	 = "";
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50606", "Сальдо на конец периода #Период# по дебету счета 50606");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50608", "Сальдо на конец периода #Период# по дебету счета 50608");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50623", "Сальдо на конец периода #Период# по кредиту счета 50623");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50625", "Сальдо на конец периода #Период# по кредиту счета 50625");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50628", "Сальдо на конец периода #Период# по дебету счета 50628");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50630", "Сальдо на конец периода #Период# по дебету счета 50630");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50670", "Сальдо на конец периода #Период# по дебету счета 50670");
	ДобавитьСчетВТаблицуСчетов("П04", "Долевые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50671", "Сальдо на конец периода #Период# по кредиту счета 50671");
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ; // + СтруктураПеременныхДляОтбора.ФинансовыеОрганизации_НЕ;
	стрОтбор	 = СтруктураПеременныхДляОтбора.ФинансовыеОрганизации_НЕ;
	
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , стрОтбор, стрОтборВирт);
	
	стрОтборВирт = "";
	стрОтбор	 = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "50104", "Сальдо на конец периода #Период# по дебету счета 50104");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "-", "!СКК", "50122", "Сальдо на конец периода #Период# по кредиту счета 50122");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "50131", "Сальдо на конец периода #Период# по дебету счета 50131");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "50150", "Сальдо на конец периода #Период# по дебету счета 50150");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "-", "!СКК", "50151", "Сальдо на конец периода #Период# по кредиту счета 50151");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "51211", "Сальдо на конец периода #Период# по дебету счета 51211");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "-", "!СКК", "51218", "Сальдо на конец периода #Период# по кредиту счета 51218");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "51225", "Сальдо на конец периода #Период# по дебету счета 51225");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "+", "!СКД", "51250", "Сальдо на конец периода #Период# по дебету счета 51250");
	ДобавитьСчетВТаблицуСчетов("П06", "Долговые ценные бумаги, Правительства Российской Федерации", "-", "!СКК", "51251", "Сальдо на конец периода #Период# по кредиту счета 51251");
		
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);	
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "50105", "Сальдо на конец периода #Период# по дебету счета 50105");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "-", "!СКК", "50123", "Сальдо на конец периода #Период# по кредиту счета 50123");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "50132", "Сальдо на конец периода #Период# по дебету счета 50132");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "50152", "Сальдо на конец периода #Период# по дебету счета 50152");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "-", "!СКК", "50153", "Сальдо на конец периода #Период# по кредиту счета 50153");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "51212", "Сальдо на конец периода #Период# по дебету счета 51212");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "-", "!СКК", "51219", "Сальдо на конец периода #Период# по кредиту счета 51219");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "51226", "Сальдо на конец периода #Период# по дебету счета 51226");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "+", "!СКД", "51252", "Сальдо на конец периода #Период# по дебету счета 51252");
	ДобавитьСчетВТаблицуСчетов("П07", "Долговые ценные бумаги, субъектов Российской Федерации и органов местного самоуправления", "-", "!СКК", "51253", "Сальдо на конец периода #Период# по кредиту счета 51253");
			
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);	
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "50108", "Сальдо на конец периода #Период# по дебету счета 50108");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "-", "!СКК", "50126", "Сальдо на конец периода #Период# по кредиту счета 50126");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "50135", "Сальдо на конец периода #Период# по дебету счета 50135");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "50158", "Сальдо на конец периода #Период# по дебету счета 50158");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "-", "!СКК", "50159", "Сальдо на конец периода #Период# по кредиту счета 50159");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "51215", "Сальдо на конец периода #Период# по дебету счета 51215");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "-", "!СКК", "51222", "Сальдо на конец периода #Период# по кредиту счета 51222");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "51229", "Сальдо на конец периода #Период# по дебету счета 51229");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "+", "!СКД", "51258", "Сальдо на конец периода #Период# по дебету счета 51258");
	ДобавитьСчетВТаблицуСчетов("П08", "Долговые ценные бумаги, иностранных государств", "-", "!СКК", "51259", "Сальдо на конец периода #Период# по кредиту счета 51259");
				
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);	
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50106", "Сальдо на конец периода #Период# по дебету счета 50106");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50109", "Сальдо на конец периода #Период# по дебету счета 50109");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50124", "Сальдо на конец периода #Период# по кредиту счета 50124");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50127", "Сальдо на конец периода #Период# по кредиту счета 50127");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50133", "Сальдо на конец периода #Период# по дебету счета 50133");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50136", "Сальдо на конец периода #Период# по дебету счета 50136");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50154", "Сальдо на конец периода #Период# по дебету счета 50154");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50155", "Сальдо на конец периода #Период# по кредиту счета 50155");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "50160", "Сальдо на конец периода #Период# по дебету счета 50160");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "50161", "Сальдо на конец периода #Период# по кредиту счета 50161");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51213", "Сальдо на конец периода #Период# по дебету счета 51213");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51216", "Сальдо на конец периода #Период# по дебету счета 51216");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "51220", "Сальдо на конец периода #Период# по кредиту счета 51220");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "51223", "Сальдо на конец периода #Период# по кредиту счета 51223");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51227", "Сальдо на конец периода #Период# по дебету счета 51227");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51230", "Сальдо на конец периода #Период# по дебету счета 51230");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51254", "Сальдо на конец периода #Период# по дебету счета 51254");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "51255", "Сальдо на конец периода #Период# по кредиту счета 51255");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "+", "!СКД", "51260", "Сальдо на конец периода #Период# по дебету счета 51260");
	ДобавитьСчетВТаблицуСчетов("П09", "Долговые ценные бумаги, кредитных организаций и банков-нерезидентов", "-", "!СКК", "51261", "Сальдо на конец периода #Период# по кредиту счета 51261");
				
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ;
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , , стрОтборВирт);	
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50107", "Сальдо на конец периода #Период# по дебету счета 50107");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50110", "Сальдо на конец периода #Период# по дебету счета 50110");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50125", "Сальдо на конец периода #Период# по кредиту счета 50125");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50128", "Сальдо на конец периода #Период# по кредиту счета 50128");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50134", "Сальдо на конец периода #Период# по дебету счета 50134");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50137", "Сальдо на конец периода #Период# по дебету счета 50137");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50156", "Сальдо на конец периода #Период# по дебету счета 50156");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50157", "Сальдо на конец периода #Период# по кредиту счета 50157");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "50162", "Сальдо на конец периода #Период# по дебету счета 50162");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "50163", "Сальдо на конец периода #Период# по кредиту счета 50163");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51214", "Сальдо на конец периода #Период# по дебету счета 51214");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51217", "Сальдо на конец периода #Период# по дебету счета 51217");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "51221", "Сальдо на конец периода #Период# по кредиту счета 51221");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "51224", "Сальдо на конец периода #Период# по кредиту счета 51224");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51228", "Сальдо на конец периода #Период# по дебету счета 51228");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51231", "Сальдо на конец периода #Период# по дебету счета 51231");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51256", "Сальдо на конец периода #Период# по дебету счета 51256");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "51257", "Сальдо на конец периода #Период# по кредиту счета 51257");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "+", "!СКД", "51262", "Сальдо на конец периода #Период# по дебету счета 51262");
	ДобавитьСчетВТаблицуСчетов("П10", "Долговые ценные бумаги, некредитных финансовых организаций", "-", "!СКК", "51263", "Сальдо на конец периода #Период# по кредиту счета 51263");
				
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ; // + СтруктураПеременныхДляОтбора.ФинансовыеОрганизации;
	стрОтбор	 = СтруктураПеременныхДляОтбора.ФинансовыеОрганизации;
	
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , стрОтбор, стрОтборВирт);	
	
	стрОтборВирт = "";
	стрОтбор	 = "";
	
	мТаблицаСчетов.Очистить();
	
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50107", "Сальдо на конец периода #Период# по дебету счета 50107");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50110", "Сальдо на конец периода #Период# по дебету счета 50110");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50125", "Сальдо на конец периода #Период# по кредиту счета 50125");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50128", "Сальдо на конец периода #Период# по кредиту счета 50128");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50134", "Сальдо на конец периода #Период# по дебету счета 50134");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50137", "Сальдо на конец периода #Период# по дебету счета 50137");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50156", "Сальдо на конец периода #Период# по дебету счета 50156");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50157", "Сальдо на конец периода #Период# по кредиту счета 50157");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "50162", "Сальдо на конец периода #Период# по дебету счета 50162");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "50163", "Сальдо на конец периода #Период# по кредиту счета 50163");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51214", "Сальдо на конец периода #Период# по дебету счета 51214");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51217", "Сальдо на конец периода #Период# по дебету счета 51217");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "51221", "Сальдо на конец периода #Период# по кредиту счета 51221");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "51224", "Сальдо на конец периода #Период# по кредиту счета 51224");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51228", "Сальдо на конец периода #Период# по дебету счета 51228");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51231", "Сальдо на конец периода #Период# по дебету счета 51231");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51256", "Сальдо на конец периода #Период# по дебету счета 51256");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "51257", "Сальдо на конец периода #Период# по кредиту счета 51257");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "+", "!СКД", "51262", "Сальдо на конец периода #Период# по дебету счета 51262");
	ДобавитьСчетВТаблицуСчетов("П11", "Долговые ценные бумаги, нефинансовых организаций", "-", "!СКК", "51263", "Сальдо на конец периода #Период# по кредиту счета 51263");
				
	УчетныйАктивЦБРФ = Новый Массив;
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка());
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.Иное);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги);
	УчетныйАктивЦБРФ.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов);
	Запрос.УстановитьПараметр("УчетныйАктивЦБРФ", УчетныйАктивЦБРФ);
	
	стрОтборВирт = СтруктураПеременныхДляОтбора.УчетныйАктивЦБРФ; // + СтруктураПеременныхДляОтбора.ФинансовыеОрганизации_НЕ;
	стрОтбор 	 = СтруктураПеременныхДляОтбора.ФинансовыеОрганизации_НЕ;
	
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03", , , стрОтбор, стрОтборВирт);
	
КонецПроцедуры

// 12.1
&НаСервере
Процедура ЗаполнитьРаздел_ЗаймыПрочиеРазмещенныеСредстваИДЗСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.Примечание1211_Дата1.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	ТекРаздел.Области.Примечание1211_Дата2.Значение = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	// Расчетные поля
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	// обнулим кеш таблица для счетов обесценение
	Адрес_КешТаблицаДляСчетовОбесценение = "";
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "51518", "Сальдо на конец периода #Период# по кредиту счета 51518");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "51519", "Сальдо на конец периода #Период# по кредиту счета 51519");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "51521", "Сальдо на конец периода #Период# по кредиту счета 51521");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "51522", "Сальдо на конец периода #Период# по кредиту счета 51522");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "51524", "Сальдо на конец периода #Период# по кредиту счета 51524");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50419", "Сальдо на конец периода #Период# по кредиту счета 50419");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50420", "Сальдо на конец периода #Период# по кредиту счета 50420");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50422", "Сальдо на конец периода #Период# по кредиту счета 50422");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50423", "Сальдо на конец периода #Период# по кредиту счета 50423");
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50425", "Сальдо на конец периода #Период# по кредиту счета 50425");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0106", "Долговые ценные бумаги, в том числе: Резерв под обесценение", "+", "!СКК", "50426", "Сальдо на конец периода #Период# по кредиту счета 50426, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков-нерезидентов""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0206", "долговые ценные бумаги, переданные без прекращения признания. Резерв под обесценение", "+", "!СКК", "50426", "Сальдо на конец периода #Период# по кредиту счета 50426 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Долговые ценные бумаги, переданные без прекращения признания""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0306", "Займы выданные. Резерв под обесценение", "+", "!СКК", "48910", "Сальдо на конец периода #Период# по кредиту счета 48910");
	ДобавитьСчетВТаблицуСчетов("П0306", "Займы выданные. Резерв под обесценение", "+", "!СКК", "49010", "Сальдо на конец периода #Период# по кредиту счета 49010");
	ДобавитьСчетВТаблицуСчетов("П0306", "Займы выданные. Резерв под обесценение", "+", "!СКК", "48510", "Сальдо на конец периода #Период# по кредиту счета 48510");
	ДобавитьСчетВТаблицуСчетов("П0306", "Займы выданные. Резерв под обесценение", "+", "!СКК", "48610", "Сальдо на конец периода #Период# по кредиту счета 48610");
	ДобавитьСчетВТаблицуСчетов("П0306", "Займы выданные. Резерв под обесценение", "+", "!СКК", "49310", "Сальдо на конец периода #Период# по кредиту счета 49310");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	// Исключая кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации_НЕ = "
		| И ВЫБОР
		|		КОГДА Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "45517", "Сальдо на конец периода #Период# по кредиту счета 45517 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "45717", "Сальдо на конец периода #Период# по кредиту счета 45717 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46017", "Сальдо на конец периода #Период# по кредиту счета 46017 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46117", "Сальдо на конец периода #Период# по кредиту счета 46117 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46217", "Сальдо на конец периода #Период# по кредиту счета 46217 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46317", "Сальдо на конец периода #Период# по кредиту счета 46317 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46417", "Сальдо на конец периода #Период# по кредиту счета 46417 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46517", "Сальдо на конец периода #Период# по кредиту счета 46517 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46617", "Сальдо на конец периода #Период# по кредиту счета 46617 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46717", "Сальдо на конец периода #Период# по кредиту счета 46717 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46817", "Сальдо на конец периода #Период# по кредиту счета 46817 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "46917", "Сальдо на конец периода #Период# по кредиту счета 46917 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47117", "Сальдо на конец периода #Период# по кредиту счета 47117 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47217", "Сальдо на конец периода #Период# по кредиту счета 47217 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	ДобавитьСчетВТаблицуСчетов("П0406", "Сделки обратного репо. Резерв под обесценение", "+", "!СКК", "47317", "Сальдо на конец периода #Период# по кредиту счета 47317 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо"" (кроме кредитных организаций)");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,стрОтборКредитныеОрганизации_НЕ,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0506", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Резерв под обесценение", "+", "!СКК", "47425", "Сальдо на конец периода #Период# по кредиту счета 47425 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0506", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Резерв под обесценение", "+", "!СКК", "30607", "Сальдо на конец периода #Период# по кредиту счета 30607");
	ДобавитьСчетВТаблицуСчетов("П0506", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Резерв под обесценение", "+", "!СКК", "50908", "Сальдо на конец периода #Период# по кредиту счета 50908");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0606", "Финансовая аренда. Резерв под обесценение", "+", "!СКК", "47702", "Сальдо на конец периода #Период# по кредиту счета 47702");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0706", "Дебиторская задолженность по договорам, не содержащим значительного страхового риска. Резерв под обесценение", "+", "!СКК", "48107", "Сальдо на конец периода #Период# по кредиту счета 48107");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47425", "Сальдо на конец периода #Период# по кредиту счета 47425 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие размещенные средства""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47904", "Сальдо на конец периода #Период# по кредиту счета 47904");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47905", "Сальдо на конец периода #Период# по кредиту счета 47905");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "60324", "Сальдо на конец периода #Период# по кредиту счета 60324 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо"" или ""Резерв под обесценение прочих активов""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "45517", "Сальдо на конец периода #Период# по кредиту счета 45517 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "45717", "Сальдо на конец периода #Период# по кредиту счета 45717 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46017", "Сальдо на конец периода #Период# по кредиту счета 46017 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46117", "Сальдо на конец периода #Период# по кредиту счета 46117 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46217", "Сальдо на конец периода #Период# по кредиту счета 46217 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46317", "Сальдо на конец периода #Период# по кредиту счета 46317 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46417", "Сальдо на конец периода #Период# по кредиту счета 46417 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46517", "Сальдо на конец периода #Период# по кредиту счета 46517 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46617", "Сальдо на конец периода #Период# по кредиту счета 46617 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46817", "Сальдо на конец периода #Период# по кредиту счета 46817 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46717", "Сальдо на конец периода #Период# по кредиту счета 46717 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "46917", "Сальдо на конец периода #Период# по кредиту счета 46917 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47017", "Сальдо на конец периода #Период# по кредиту счета 47017 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47117", "Сальдо на конец периода #Период# по кредиту счета 47117 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47217", "Сальдо на конец периода #Период# по кредиту счета 47217 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П1106", "Прочее. Резерв под обесценение", "+", "!СКК", "47317", "Сальдо на конец периода #Период# по кредиту счета 47317 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	флЭтоРезервПодОбесценение = Истина;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,,,,,,флЭтоРезервПодОбесценение);
		
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51511", "Сальдо на конец периода #Период# по дебету счета 51511, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51512", "Сальдо на конец периода #Период# по дебету счета 51512, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51514", "Сальдо на конец периода #Период# по дебету счета 51514, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51515", "Сальдо на конец периода #Период# по дебету счета 51515, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51517", "Сальдо на конец периода #Период# по дебету счета 51517, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51550", "Сальдо на конец периода #Период# по дебету счета 51550, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКД", "51551", "Сальдо на конец периода #Период# по дебету счета 51551, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51552", "Сальдо на конец периода #Период# по дебету счета 51552, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "51553", "Сальдо на конец периода #Период# по кредиту счета 51553, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51556", "Сальдо на конец периода #Период# по дебету счета 51556, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "51557", "Сальдо на конец периода #Период# по кредиту счета 51557, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51558", "Сальдо на конец периода #Период# по дебету счета 51558, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "51559", "Сальдо на конец периода #Период# по кредиту счета 51559, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "51562", "Сальдо на конец периода #Период# по дебету счета 51562, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "51563", "Сальдо на конец периода #Период# по кредиту счета 51563, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50411", "Сальдо на конец периода #Период# по дебету счета 50411, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50412", "Сальдо на конец периода #Период# по дебету счета 50412, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50414", "Сальдо на конец периода #Период# по дебету счета 50414, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50415", "Сальдо на конец периода #Период# по дебету счета 50415, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50417", "Сальдо на конец периода #Период# по дебету счета 50417, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50418", "Сальдо на конец периода #Период# по дебету счета 50418, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50450", "Сальдо на конец периода #Период# по дебету счета 50450, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50451", "Сальдо на конец периода #Период# по кредиту счета 50451, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50452", "Сальдо на конец периода #Период# по дебету счета 50452, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50453", "Сальдо на конец периода #Период# по кредиту счета 50453, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50456", "Сальдо на конец периода #Период# по дебету счета 50456, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50457", "Сальдо на конец периода #Период# по кредиту счета 50457, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50458", "Сальдо на конец периода #Период# по дебету счета 50458, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50459", "Сальдо на конец периода #Период# по кредиту счета 50459, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50462", "Сальдо на конец периода #Период# по дебету счета 50462, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50463", "Сальдо на конец периода #Период# по кредиту счета 50463, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "+", "!СКД", "50464", "Сальдо на конец периода #Период# по дебету счета 50464, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П01", "Долговые ценные бумаги, в том числе: Необесцененные", "-", "!СКК", "50465", "Сальдо на конец периода #Период# по кредиту счета 50465, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П02", "долговые ценные бумаги, переданные без прекращения признания. Необесцененные", "+", "!СКД", "50418", "Сальдо на конец периода #Период# по дебету счета 50418 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П02", "долговые ценные бумаги, переданные без прекращения признания. Необесцененные", "+", "!СКД", "50464", "Сальдо на конец периода #Период# по дебету счета 50464 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ДобавитьСчетВТаблицуСчетов("П02", "долговые ценные бумаги, переданные без прекращения признания. Необесцененные", "-", "!СКК", "50465", "Сальдо на конец периода #Период# по кредиту счета 50465 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Долговые ценные бумаги кредитных организаций и банков нерезидентов""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48501", "Сальдо на конец периода #Период# по дебету счета 48501");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48502", "Сальдо на конец периода #Период# по дебету счета 48502");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48503", "Сальдо на конец периода #Период# по дебету счета 48503");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48504", "Сальдо на конец периода #Период# по кредиту счета 48504");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКД", "48505", "Сальдо на конец периода #Период# по дебету счета 48505");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48506", "Сальдо на конец периода #Период# по дебету счета 48506");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48507", "Сальдо на конец периода #Период# по дебету счета 48507");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48508", "Сальдо на конец периода #Период# по кредиту счета 48508");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКД", "48509", "Сальдо на конец периода #Период# по кредиту счета 48509");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48601", "Сальдо на конец периода #Период# по дебету счета 48601");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48602", "Сальдо на конец периода #Период# по дебету счета 48602");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48603", "Сальдо на конец периода #Период# по дебету счета 48603");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48604", "Сальдо на конец периода #Период# по кредиту счета 48604");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48605", "Сальдо на конец периода #Период# по кредиту счета 48605");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48606", "Сальдо на конец периода #Период# по дебету счета 48606");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКК", "48607", "Сальдо на конец периода #Период# по кредиту счета 48607");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48608", "Сальдо на конец периода #Период# по кредиту счета 48608");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48609", "Сальдо на конец периода #Период# по кредиту счета 48609");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48901", "Сальдо на конец периода #Период# по дебету счета 48901");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48902", "Сальдо на конец периода #Период# по дебету счета 48902");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48903", "Сальдо на конец периода #Период# по дебету счета 48903");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48904", "Сальдо на конец периода #Период# по кредиту счета 48904");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48905", "Сальдо на конец периода #Период# по кредиту счета 48905");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48906", "Сальдо на конец периода #Период# по дебету счета 48906");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "48907", "Сальдо на конец периода #Период# по дебету счета 48907");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48908", "Сальдо на конец периода #Период# по кредиту счета 48908");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "48909", "Сальдо на конец периода #Период# по кредиту счета 48909");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49001", "Сальдо на конец периода #Период# по дебету счета 49001");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49002", "Сальдо на конец периода #Период# по дебету счета 49002");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49003", "Сальдо на конец периода #Период# по дебету счета 49003");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49004", "Сальдо на конец периода #Период# по кредиту счета 49004");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49005", "Сальдо на конец периода #Период# по кредиту счета 49005");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49006", "Сальдо на конец периода #Период# по дебету счета 49006");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49007", "Сальдо на конец периода #Период# по дебету счета 49007");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49008", "Сальдо на конец периода #Период# по кредиту счета 49008");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49009", "Сальдо на конец периода #Период# по кредиту счета 49009");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49301", "Сальдо на конец периода #Период# по дебету счета 49301");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49302", "Сальдо на конец периода #Период# по дебету счета 49302");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49303", "Сальдо на конец периода #Период# по дебету счета 49303");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49304", "Сальдо на конец периода #Период# по кредиту счета 49304");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49305", "Сальдо на конец периода #Период# по кредиту счета 49305");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49306", "Сальдо на конец периода #Период# по дебету счета 49306");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "+", "!СКД", "49307", "Сальдо на конец периода #Период# по дебету счета 49307");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49308", "Сальдо на конец периода #Период# по кредиту счета 49308");
	ДобавитьСчетВТаблицуСчетов("П03", "Займы выданные. Необесцененные", "-", "!СКК", "49309", "Сальдо на конец периода #Период# по кредиту счета 49309");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	// Исключая кредитные организации и банки-нерезиденты
	стрОтборКредитныеОрганизации_НЕ = " И ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45510", "Сальдо на конец периода #Период# по дебету счета 45510 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45511", "Сальдо на конец периода #Период# по дебету счета 45511 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45518", "Сальдо на конец периода #Период# по кредиту счета 45518 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45519", "Сальдо на конец периода #Период# по дебету счета 45519 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45520", "Сальдо на конец периода #Период# по дебету счета 45520 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45521", "Сальдо на конец периода #Период# по кредиту счета 45521 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45709", "Сальдо на конец периода #Период# по дебету счета 45709 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45711", "Сальдо на конец периода #Период# по дебету счета 45711 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45718", "Сальдо на конец периода #Период# по кредиту счета 45718 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45719", "Сальдо на конец периода #Период# по дебету счета 45719 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "45720", "Сальдо на конец периода #Период# по дебету счета 45720 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45721", "Сальдо на конец периода #Период# по кредиту счета 45721 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46010", "Сальдо на конец периода #Период# по дебету счета 46010 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46011", "Сальдо на конец периода #Период# по дебету счета 46011 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46018", "Сальдо на конец периода #Период# по кредиту счета 46018 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46019", "Сальдо на конец периода #Период# по дебету счета 46019 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46020", "Сальдо на конец периода #Период# по дебету счета 46020 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46021", "Сальдо на конец периода #Период# по кредиту счета 46021 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46110", "Сальдо на конец периода #Период# по дебету счета 46110 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46111", "Сальдо на конец периода #Период# по дебету счета 46111 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46118", "Сальдо на конец периода #Период# по кредиту счета 46118 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46119", "Сальдо на конец периода #Период# по дебету счета 46119 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46120", "Сальдо на конец периода #Период# по дебету счета 46120 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46121", "Сальдо на конец периода #Период# по кредиту счета 46121 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46210", "Сальдо на конец периода #Период# по дебету счета 46210 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46211", "Сальдо на конец периода #Период# по дебету счета 46211 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46218", "Сальдо на конец периода #Период# по кредиту счета 46218 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46219", "Сальдо на конец периода #Период# по дебету счета 46219 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46220", "Сальдо на конец периода #Период# по дебету счета 46220 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46221", "Сальдо на конец периода #Период# по кредиту счета 46221 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46310", "Сальдо на конец периода #Период# по дебету счета 46310 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46311", "Сальдо на конец периода #Период# по дебету счета 46311 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46318", "Сальдо на конец периода #Период# по кредиту счета 46318 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46319", "Сальдо на конец периода #Период# по дебету счета 46319 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46320", "Сальдо на конец периода #Период# по дебету счета 46320 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46321", "Сальдо на конец периода #Период# по кредиту счета 46321 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46410", "Сальдо на конец периода #Период# по дебету счета 46410 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46411", "Сальдо на конец периода #Период# по дебету счета 46411 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46418", "Сальдо на конец периода #Период# по кредиту счета 46418 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46419", "Сальдо на конец периода #Период# по дебету счета 46419 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46420", "Сальдо на конец периода #Период# по дебету счета 46420 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46421", "Сальдо на конец периода #Период# по кредиту счета 46421 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46510", "Сальдо на конец периода #Период# по дебету счета 46510 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46511", "Сальдо на конец периода #Период# по дебету счета 46511 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46518", "Сальдо на конец периода #Период# по кредиту счета 46518 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46519", "Сальдо на конец периода #Период# по дебету счета 46519 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46520", "Сальдо на конец периода #Период# по дебету счета 46520 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46521", "Сальдо на конец периода #Период# по кредиту счета 46521 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46610", "Сальдо на конец периода #Период# по дебету счета 46610 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46611", "Сальдо на конец периода #Период# по дебету счета 46611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46618", "Сальдо на конец периода #Период# по кредиту счета 46618 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46619", "Сальдо на конец периода #Период# по дебету счета 46619 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46620", "Сальдо на конец периода #Период# по дебету счета 46620 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46621", "Сальдо на конец периода #Период# по кредиту счета 46621 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46710", "Сальдо на конец периода #Период# по дебету счета 46710 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46711", "Сальдо на конец периода #Период# по дебету счета 46711 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46718", "Сальдо на конец периода #Период# по кредиту счета 46718 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46719", "Сальдо на конец периода #Период# по дебету счета 46719 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46720", "Сальдо на конец периода #Период# по дебету счета 46720 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46721", "Сальдо на конец периода #Период# по кредиту счета 46721 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46810", "Сальдо на конец периода #Период# по дебету счета 46810 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46811", "Сальдо на конец периода #Период# по дебету счета 46811 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46818", "Сальдо на конец периода #Период# по кредиту счета 46818 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46819", "Сальдо на конец периода #Период# по дебету счета 46819 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46820", "Сальдо на конец периода #Период# по дебету счета 46820 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46821", "Сальдо на конец периода #Период# по кредиту счета 46821 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46910", "Сальдо на конец периода #Период# по дебету счета 46910 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46911", "Сальдо на конец периода #Период# по дебету счета 46911 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46918", "Сальдо на конец периода #Период# по кредиту счета 46918 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46919", "Сальдо на конец периода #Период# по дебету счета 46919 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "46920", "Сальдо на конец периода #Период# по дебету счета 46920 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46921", "Сальдо на конец периода #Период# по кредиту счета 46921 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47020", "Сальдо на конец периода #Период# по дебету счета 47020 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47021", "Сальдо на конец периода #Период# по кредиту счета 47021 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47110", "Сальдо на конец периода #Период# по дебету счета 47110 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47111", "Сальдо на конец периода #Период# по дебету счета 47111 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	//ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47118", "Сальдо на конец периода #Период# по кредиту счета 47118 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	//ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47119", "Сальдо на конец периода #Период# по дебету счета 47119 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47120", "Сальдо на конец периода #Период# по дебету счета 47120 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47121", "Сальдо на конец периода #Период# по кредиту счета 47121 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47210", "Сальдо на конец периода #Период# по дебету счета 47210 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47211", "Сальдо на конец периода #Период# по дебету счета 47211 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47218", "Сальдо на конец периода #Период# по кредиту счета 47218 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47219", "Сальдо на конец периода #Период# по дебету счета 47219 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47220", "Сальдо на конец периода #Период# по дебету счета 47220 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47221", "Сальдо на конец периода #Период# по кредиту счета 47221 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47310", "Сальдо на конец периода #Период# по дебету счета 47310 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47311", "Сальдо на конец периода #Период# по дебету счета 47311 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47318", "Сальдо на конец периода #Период# по кредиту счета 47318 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47319", "Сальдо на конец периода #Период# по дебету счета 47319 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47320", "Сальдо на конец периода #Период# по дебету счета 47320 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47321", "Сальдо на конец периода #Период# по кредиту счета 47321 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45522", "Сальдо на конец периода #Период# по кредиту счета 45522 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "45722", "Сальдо на конец периода #Период# по кредиту счета 45722 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46022", "Сальдо на конец периода #Период# по кредиту счета 46022 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46122", "Сальдо на конец периода #Период# по кредиту счета 46122 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46222", "Сальдо на конец периода #Период# по кредиту счета 46222 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46322", "Сальдо на конец периода #Период# по кредиту счета 46322 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46422", "Сальдо на конец периода #Период# по кредиту счета 46422 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46522", "Сальдо на конец периода #Период# по кредиту счета 46522 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46622", "Сальдо на конец периода #Период# по кредиту счета 46622 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46722", "Сальдо на конец периода #Период# по кредиту счета 46722 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46822", "Сальдо на конец периода #Период# по кредиту счета 46822 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "46922", "Сальдо на конец периода #Период# по кредиту счета 46922 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47022", "Сальдо на конец периода #Период# по кредиту счета 47022 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47122", "Сальдо на конец периода #Период# по кредиту счета 47122 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47222", "Сальдо на конец периода #Период# по кредиту счета 47222 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47322", "Сальдо на конец периода #Период# по кредиту счета 47322 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", "И Субконто2 ССЫЛКА Документ.СделкаРЕПО" + стрОтборКредитныеОрганизации_НЕ, "03", "04");
	
	мТаблицаСчетов.Очистить();
	Запрос.УстановитьПараметр("БрокерыНеКредитныеОрганизации", ПолучитьМассивБрокеровНеКредитныхОрганизаций());
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П04", "Сделки обратного репо. Необесцененные", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочие сделки обратного репо""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", " И Субконто1 В(&БрокерыНеКредитныеОрганизации) И Субконто2 ССЫЛКА Документ.СделкаРЕПО" , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Необесцененные", "+", "!СКД", "30602", "Сальдо на конец периода #Период# по дебету счета 30602, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Необесцененные", "+", "!СКД", "47408", "Сальдо на конец периода #Период# по дебету счета 47408, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Необесцененные", "+", "!СКД", "50905", "Сальдо на конец периода #Период# по дебету счета 50905, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Необесцененные", "+", "!СКД", "50906", "Сальдо на конец периода #Период# по дебету счета 50906, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям. Необесцененные", "-", "!СКК", "50907", "Сальдо на конец периода #Период# по кредиту счета 50907, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагам""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Финансовая аренда. Необесцененные", "+", "!СКД", "47701", "Сальдо на конец периода #Период# по дебету счета 47701, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по финансовой аренде""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П07", "Дебиторская задолженность по договорам, не содержащим значительного страхового риска", "+", "!СКД", "60332", "Сальдо на конец периода #Период# по дебету счета 60332");
	ДобавитьСчетВТаблицуСчетов("П07", "Дебиторская задолженность по договорам, не содержащим значительного страхового риска", "+", "!СКД", "48101", "Сальдо на конец периода #Период# по дебету счета 48101");	
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П08", "Дебиторская задолженность по договорам, не содержащим значительного страхового риска", "+", "!СКД", "60332", "Сальдо на конец периода #Период# по дебету счета 60332");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты по начисленным доходам по акциям, долям, паям. Необесцененные", "+", "!СКД", "60347", "Сальдо на конец периода #Период# по дебету счета 60347, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по начисленным доходам по акциям, долям, паям""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П10", "Расчеты с акционерами, участниками. Необесцененные", "+", "!СКД", "60330", "Сальдо на конец периода #Период# по дебету счета 60330, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты с акционерами, участниками""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47902", "Сальдо на конец периода #Период# по дебету счета 47902");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47901", "Сальдо на конец периода #Период# по дебету счета 47901, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Прочее""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", , "03", "04");
	
	мТаблицаСчетов.Очистить();
	//ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45510", "Сальдо на конец периода #Период# по дебету счета 45510 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45511", "Сальдо на конец периода #Период# по дебету счета 45511 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45519", "Сальдо на конец периода #Период# по дебету счета 45519 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45520", "Сальдо на конец периода #Период# по дебету счета 45520 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45709", "Сальдо на конец периода #Период# по дебету счета 45709 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45711", "Сальдо на конец периода #Период# по дебету счета 45711 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45719", "Сальдо на конец периода #Период# по дебету счета 45719 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "45720", "Сальдо на конец периода #Период# по дебету счета 45720 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46010", "Сальдо на конец периода #Период# по дебету счета 46010 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46011", "Сальдо на конец периода #Период# по дебету счета 46011 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46019", "Сальдо на конец периода #Период# по дебету счета 46019 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46020", "Сальдо на конец периода #Период# по дебету счета 46020 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46110", "Сальдо на конец периода #Период# по дебету счета 46110 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46111", "Сальдо на конец периода #Период# по дебету счета 46111 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46119", "Сальдо на конец периода #Период# по дебету счета 46119 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46210", "Сальдо на конец периода #Период# по дебету счета 46210 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46211", "Сальдо на конец периода #Период# по дебету счета 46211 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46219", "Сальдо на конец периода #Период# по дебету счета 46219 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46220", "Сальдо на конец периода #Период# по дебету счета 46220 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46310", "Сальдо на конец периода #Период# по дебету счета 46310 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46311", "Сальдо на конец периода #Период# по дебету счета 46311 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46319", "Сальдо на конец периода #Период# по дебету счета 46319 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46320", "Сальдо на конец периода #Период# по дебету счета 46320 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46519", "Сальдо на конец периода #Период# по дебету счета 46519 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46410", "Сальдо на конец периода #Период# по дебету счета 46410 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46411", "Сальдо на конец периода #Период# по дебету счета 46411 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46419", "Сальдо на конец периода #Период# по дебету счета 46419 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46420", "Сальдо на конец периода #Период# по дебету счета 46420 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46510", "Сальдо на конец периода #Период# по дебету счета 46510 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46511", "Сальдо на конец периода #Период# по дебету счета 46511 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46519", "Сальдо на конец периода #Период# по дебету счета 46519 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46520", "Сальдо на конец периода #Период# по дебету счета 46520 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46610", "Сальдо на конец периода #Период# по дебету счета 46610 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46611", "Сальдо на конец периода #Период# по дебету счета 46611 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46619", "Сальдо на конец периода #Период# по дебету счета 46619 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46620", "Сальдо на конец периода #Период# по дебету счета 46620 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46710", "Сальдо на конец периода #Период# по дебету счета 46710 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46711", "Сальдо на конец периода #Период# по дебету счета 46711 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46719", "Сальдо на конец периода #Период# по дебету счета 46719 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46720", "Сальдо на конец периода #Период# по дебету счета 46720 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46910", "Сальдо на конец периода #Период# по дебету счета 46910 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46911", "Сальдо на конец периода #Период# по дебету счета 46911 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46919", "Сальдо на конец периода #Период# по дебету счета 46919 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "46920", "Сальдо на конец периода #Период# по дебету счета 46920 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47010", "Сальдо на конец периода #Период# по дебету счета 47010 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47011", "Сальдо на конец периода #Период# по дебету счета 47011 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47019", "Сальдо на конец периода #Период# по дебету счета 47019 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47020", "Сальдо на конец периода #Период# по дебету счета 47020 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47110", "Сальдо на конец периода #Период# по дебету счета 47110 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47111", "Сальдо на конец периода #Период# по дебету счета 47111 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47119", "Сальдо на конец периода #Период# по дебету счета 47119 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47120", "Сальдо на конец периода #Период# по дебету счета 47120 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47210", "Сальдо на конец периода #Период# по дебету счета 47210 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47211", "Сальдо на конец периода #Период# по дебету счета 47211 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47219", "Сальдо на конец периода #Период# по дебету счета 47219 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47220", "Сальдо на конец периода #Период# по дебету счета 47220 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47310", "Сальдо на конец периода #Период# по дебету счета 47310 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47311", "Сальдо на конец периода #Период# по дебету счета 47311 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47319", "Сальдо на конец периода #Период# по дебету счета 47319 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "+", "!СКД", "47320", "Сальдо на конец периода #Период# по дебету счета 47320 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "45518", "Сальдо на конец периода #Период# по кредиту счета 45518 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "45521", "Сальдо на конец периода #Период# по кредиту счета 45521 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "45718", "Сальдо на конец периода #Период# по кредиту счета 45718 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "45721", "Сальдо на конец периода #Период# по кредиту счета 45721 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46118", "Сальдо на конец периода #Период# по кредиту счета 46118 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46121", "Сальдо на конец периода #Период# по кредиту счета 46121 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46218", "Сальдо на конец периода #Период# по кредиту счета 46218 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46221", "Сальдо на конец периода #Период# по кредиту счета 46221 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46318", "Сальдо на конец периода #Период# по кредиту счета 46318 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46321", "Сальдо на конец периода #Период# по кредиту счета 46321 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46418", "Сальдо на конец периода #Период# по кредиту счета 46418 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46421", "Сальдо на конец периода #Период# по кредиту счета 46421 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46518", "Сальдо на конец периода #Период# по кредиту счета 46518 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46521", "Сальдо на конец периода #Период# по кредиту счета 46521 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46618", "Сальдо на конец периода #Период# по кредиту счета 46618 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46621", "Сальдо на конец периода #Период# по кредиту счета 46621 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46718", "Сальдо на конец периода #Период# по кредиту счета 46718 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46721", "Сальдо на конец периода #Период# по кредиту счета 46721 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46918", "Сальдо на конец периода #Период# по кредиту счета 46918 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "46921", "Сальдо на конец периода #Период# по кредиту счета 46921 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47018", "Сальдо на конец периода #Период# по кредиту счета 47018 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47021", "Сальдо на конец периода #Период# по кредиту счета 47021 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47118", "Сальдо на конец периода #Период# по кредиту счета 47118 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47121", "Сальдо на конец периода #Период# по кредиту счета 47121 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47218", "Сальдо на конец периода #Период# по кредиту счета 47218 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47221", "Сальдо на конец периода #Период# по кредиту счета 47221 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47318", "Сальдо на конец периода #Период# по кредиту счета 47318 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ДобавитьСчетВТаблицуСчетов("П11", "Прочее. Необесцененные", "-", "!СКК", "47321", "Сальдо на конец периода #Период# по кредиту счета 47321 по финансовым инструментам, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства"" или ""Сделки обратного репо"" или ""Прочие сделки обратного репо""");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод_ОбесцененныеНеобесцененные(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, "ЦО", "И НЕ Субконто2 ССЫЛКА Документ.СделкаРЕПО", "03", "04");	
	
	стрОтборВирт = "";
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1103", "Прочее. Необесцененные", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 по МНО");
	стрОтборВирт = СтруктураПеременныхДляОтбора.МНО;
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел,,,стрОтборВирт, , , , , );
	
	// Отбор по банкротам
	стрОтборБанкроты = " ГДЕ Субконто1 В (&Банкроты) И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.МНО)";
	стрОтборБанкроты_НЕ = " ГДЕ Субконто1 НЕ В (&Банкроты) И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.МНО)";
	
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1103", "Прочее. Необесцененные", "+", "!СКД", "60323", "Сальдо на конец периода #Период# по дебету счета 60323 (кроме банкротов)");
	ДобавитьСчетВТаблицуСчетов("П1103", "Прочее. Необесцененные", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (кроме банкротов)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , стрОтборБанкроты_НЕ);	
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П1104", "Прочее. Необесцененные", "+", "!СКД", "60323", "Сальдо на конец периода #Период# по дебету счета 60323 (банкроты)");
	ДобавитьСчетВТаблицуСчетов("П1104", "Прочее. Необесцененные", "+", "!СКД", "47423", "Сальдо на конец периода #Период# по дебету счета 47423 (банкроты)");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел, , стрОтборБанкроты);	
	
КонецПроцедуры

// 24.1
&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеАктивыСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Вложения в драгоценные металлы, монеты", "+", "!СКД", "20302", "Сальдо на конец периода #Период# по дебету счета 20302");
	ДобавитьСчетВТаблицуСчетов("П03", "Вложения в драгоценные металлы, монеты", "+", "!СКД", "20303", "Сальдо на конец периода #Период# по дебету счета 20303");
	ДобавитьСчетВТаблицуСчетов("П03", "Вложения в драгоценные металлы, монеты", "+", "!СКД", "20305", "Сальдо на конец периода #Период# по дебету счета 20305");
	ДобавитьСчетВТаблицуСчетов("П03", "Вложения в драгоценные металлы, монеты", "+", "!СКД", "20308", "Сальдо на конец периода #Период# по дебету счета 20308");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Вложения в природные камни", "+", "!СКД", "20401", "Сальдо на конец периода #Период# по дебету счета 20401");
	ДобавитьСчетВТаблицуСчетов("П04", "Вложения в природные камни", "+", "!СКД", "20403", "Сальдо на конец периода #Период# по дебету счета 20403");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по налогам и сборам, кроме налога на прибыль", "+", "!СКД", "60302", "Сальдо на конец периода #Период# по дебету счета 60302");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П06", "Расчеты с персоналом", "+", "!СКД", "60306", "Сальдо на конец периода #Период# по дебету счета 60306");
	ДобавитьСчетВТаблицуСчетов("П06", "Расчеты с персоналом", "+", "!СКД", "60308", "Сальдо на конец периода #Период# по дебету счета 60308");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
		
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П07", "Расчеты по социальному страхованию", "+", "!СКД", "60336", "Сальдо на конец периода #Период# по дебету счета 60336");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П08", "Налог на добавленную стоимость, уплаченный", "+", "!СКД", "60310", "Сальдо на конец периода #Период# по дебету счета 60310");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с поставщиками и подрядчиками", "+", "!СКД", "60312", "Сальдо на конец периода #Период# по дебету счета 60312");
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с поставщиками и подрядчиками", "+", "!СКД", "60314", "Сальдо на конец периода #Период# по дебету счета 60314");
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с поставщиками и подрядчиками", "+", "!СКД", "31001", "Сальдо на конец периода #Период# по дебету счета 31001");
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с поставщиками и подрядчиками", "+", "!СКД", "61403", "Сальдо на конец периода #Период# по дебету счета 61403");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61002", "Сальдо на конец периода #Период# по дебету счета 61002");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61003", "Сальдо на конец периода #Период# по дебету счета 61003");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61008", "Сальдо на конец периода #Период# по дебету счета 61008");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61009", "Сальдо на конец периода #Период# по дебету счета 61009");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61010", "Сальдо на конец периода #Период# по дебету счета 61010");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61013", "Сальдо на конец периода #Период# по дебету счета 61013");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "62101", "Сальдо на конец периода #Период# по дебету счета 62101");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "62102", "Сальдо на конец периода #Период# по дебету счета 62102");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61014", "Сальдо на конец периода #Период# по дебету счета 61014");
	ДобавитьСчетВТаблицуСчетов("П10", "Запасы", "+", "!СКД", "61101", "Сальдо на конец периода #Период# по дебету счета 61014");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Накопленная величина изменения справедливой стоимости объекта хеджирования (твердое договорное обязательство)", "+", "!СКД", "52802", "Сальдо на конец периода #Период# по дебету счета 52802");
	ДобавитьСчетВТаблицуСчетов("П11", "Накопленная величина изменения справедливой стоимости объекта хеджирования (твердое договорное обязательство)", "-", "!СКК", "52801", "Сальдо на конец периода #Период# по кредиту счета 52801");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "20804", "Сальдо на конец периода #Период# по дебету счета 20804");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "47417", "Сальдо на конец периода #Период# по дебету счета 47417");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "61401", "Сальдо на конец периода #Период# по дебету счета 61401");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "60332", "Сальдо на конец периода #Период# по дебету счета 60332");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");   
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "42319", "Сальдо на конец периода #Период# по дебету счета 42319, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "42619", "Сальдо на конец периода #Период# по дебету счета 42619, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "42719", "Сальдо на конец периода #Период# по дебету счета 42719, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "42819", "Сальдо на конец периода #Период# по дебету счета 42819, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "42919", "Сальдо на конец периода #Период# по дебету счета 42919, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43019", "Сальдо на конец периода #Период# по дебету счета 43019, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43119", "Сальдо на конец периода #Период# по дебету счета 43119, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43219", "Сальдо на конец периода #Период# по дебету счета 43219, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43319", "Сальдо на конец периода #Период# по дебету счета 43319, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43419", "Сальдо на конец периода #Период# по дебету счета 43419, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43519", "Сальдо на конец периода #Период# по дебету счета 43519, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43619", "Сальдо на конец периода #Период# по дебету счета 43619, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43719", "Сальдо на конец периода #Период# по дебету счета 43719, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43819", "Сальдо на конец периода #Период# по дебету счета 43819, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "43919", "Сальдо на конец периода #Период# по дебету счета 43919, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "44019", "Сальдо на конец периода #Период# по дебету счета 44019, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "52019", "Сальдо на конец периода #Период# по дебету счета 52019, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ДобавитьСчетВТаблицуСчетов("П12", "Прочее", "+", "!СКД", "52319", "Сальдо на конец периода #Период# по дебету счета 52319, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие активы (прочее)""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П13", "Резерв под обесценение прочих активов", "-", "!СКК", "20805", "Сальдо на конец периода #Период# по кредиту счета 20805, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П13", "Резерв под обесценение прочих активов", "-", "!СКК", "60324", "Сальдо на конец периода #Период# по кредиту счета 60324, у которых по реквизиту ""Классификатор активов и обязательств"" значение равно ""Резерв под обесценение прочих активов""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П13", "Резерв под обесценение прочих активов", "-", "!СКК", "20321", "Сальдо на конец периода #Период# по кредиту счета 20321, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Депозиты в кредитных организациях и банках-нерезидентах"" или ""Субординированные депозиты""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П13", "Резерв под обесценение прочих активов", "-", "!СКК", "47425", "Сальдо на конец периода #Период# по кредиту счета 47425, у которых по реквизиту ""Классификатор активов и обязательств"" значение не равно ""Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям"" или ""Прочие размещенные средства""");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "02", "03");

КонецПроцедуры

// 35.1
&НаСервере
Процедура ЗаполнитьРаздел_ПрочиеОбязательстваСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Расчеты по конверсионным операциям, производным финансовым инструментам, операциям с ценными бумагами и брокерским операциям", "+", "!СКК", "47407", "Сальдо на конец периода #Период# по кредиту счета 47407");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П03", "Расчеты с акционерами, участниками", "+", "!СКК", "60320", "Сальдо на конец периода #Период# по кредиту счета 60320");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П04", "Расчеты с покупателями и клиентами", "+", "!СКК", "60331", "Сальдо на конец периода #Период# по кредиту счета 60331");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П05", "Расчеты по договорам страхования без значительного страхового риска", "+", "!СКК", "60331", "Сальдо на конец периода #Период# по кредиту счета 60331");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
    мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П08", "Расчеты с прочими кредиторами", "+", "!СКК", "60322", "Сальдо на конец периода #Период# по кредиту счета 60322");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с персоналом", "+", "!СКК", "60305", "Сальдо на конец периода #Период# по кредиту счета 60305");
	ДобавитьСчетВТаблицуСчетов("П09", "Расчеты с персоналом", "+", "!СКК", "60307", "Сальдо на конец периода #Период# по кредиту счета 60307");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П10", "Налог на добавленную стоимость полученный", "+", "!СКК", "60309", "Сальдо на конец периода #Период# по кредиту счета 60309");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
    мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П11", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60311", "Сальдо на конец периода #Период# по кредиту счета 60311");
	ДобавитьСчетВТаблицуСчетов("П11", "Расчеты с поставщиками и подрядчиками", "+", "!СКК", "60313", "Сальдо на конец периода #Период# по кредиту счета 60313");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
    мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П12", "Расчеты по налогам и сборам, кроме налога на прибыль", "+", "!СКК", "60301", "Сальдо на конец периода #Период# по кредиту счета 60301");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П13", "Авансы (предоплаты) полученные", "+", "!СКК", "61304", "Сальдо на конец периода #Период# по кредиту счета 61304");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");

	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П15", "Расчеты по социальному страхованию", "+", "!СКК", "60335", "Сальдо на конец периода #Период# по кредиту счета 60335");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П16", "Накопленная величина изменения справедливой стоимости объекта хеджирования (твердое договорное обязательство)", "+", "!СКК", "52803", "Сальдо на конец периода #Период# по кредиту счета 52803");
	ДобавитьСчетВТаблицуСчетов("П16", "Накопленная величина изменения справедливой стоимости объекта хеджирования (твердое договорное обязательство)", "-", "!СКД", "52804", "Сальдо на конец периода #Период# по дебету счета 52804");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
	мТаблицаСчетов.Очистить();
 	ДобавитьСчетВТаблицуСчетов("П17", "Прочие обязательства", "+", "!СКК", "47422", "Сальдо на конец периода #Период# по кредиту счета 47422");
	ДобавитьСчетВТаблицуСчетов("П17", "Прочие обязательства", "+", "!СКК", "47903", "Сальдо на конец периода #Период# по кредиту счета 47903");
	ДобавитьСчетВТаблицуСчетов("П17", "Прочие обязательства", "+", "!СКК", "31002", "Сальдо на конец периода #Период# по кредиту счета 31002");
	ДобавитьСчетВТаблицуСчетов("П17", "Прочие обязательства", "+", "!СКК", "47416", "Сальдо на конец периода #Период# по кредиту счета 47416");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "НаКонец", ТекРаздел, "03", "04");
	
КонецПроцедуры

// 50 (Нераспределенная прибыль)
&НаСервере
Процедура ЗаполнитьРаздел_НераспределеннаяПрибыльСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71001", "Оборот по кредиту счета 71001");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71002", "Оборот по кредиту счета 71002");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71003", "Оборот по дебету счета 71003");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71004", "Оборот по дебету счета 71004");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71005", "Оборот по кредиту счета 71005");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71006", "Оборот по дебету счета 71006");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71501", "Оборот по кредиту счета 71501");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71502", "Оборот по дебету счета 71502");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71503", "Оборот по кредиту счета 71503");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71504", "Оборот по дебету счета 71504");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71505", "Оборот по кредиту счета 71505");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71506", "Оборот по дебету счета 71506");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71507", "Оборот по кредиту счета 71507");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71508", "Оборот по дебету счета 71508");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71509", "Оборот по кредиту счета 71509");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71510", "Оборот по дебету счета 71510");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71511", "Оборот по кредиту счета 71511");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71512", "Оборот по дебету счета 71512");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71513", "Оборот по кредиту счета 71513");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71514", "Оборот по дебету счета 71514");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71701", "Оборот по кредиту счета 71701");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71702", "Оборот по дебету счета 71702");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71801", "Оборот по кредиту счета 71801");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71802", "Оборот по дебету счета 71802");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , , , , );
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71001", "Оборот по дебету счета 71001");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71002", "Оборот по дебету счета 71002");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71003", "Оборот по кредиту счета 71003");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71004", "Оборот по кредиту счета 71004");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71005", "Оборот по дебету счета 71005");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71006", "Оборот по кредиту счета 71006");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71501", "Оборот по дебету счета 71501");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71502", "Оборот по кредиту счета 71502");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71503", "Оборот по дебету счета 71503");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71504", "Оборот по кредиту счета 71504");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71505", "Оборот по дебету счета 71505");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71506", "Оборот по кредиту счета 71506");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71507", "Оборот по дебету счета 71507");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71508", "Оборот по кредиту счета 71508");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71509", "Оборот по дебету счета 71509");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71510", "Оборот по кредиту счета 71510");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71511", "Оборот по дебету счета 71511");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71512", "Оборот по кредиту счета 71512");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71513", "Оборот по дебету счета 71513");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71514", "Оборот по кредиту счета 71514");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71701", "Оборот по дебету счета 71701");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71702", "Оборот по кредиту счета 71702");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "-", "!ДО", "71801", "Оборот по дебету счета 71801");
	ДобавитьСчетВТаблицуСчетов("П01", "Нераспределенная прибыль (непокрытый убыток)", "+", "!КО", "71802", "Оборот по кредиту счета 71802");
	ЗаполнитьРазделПоСпискуСчетовЗаОтчетныйИПредыдущийПериоды(Запрос, "Оборот", ТекРаздел, "02", "", , , , , , , );
	
КонецПроцедуры

// 62.9 
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОКредитномКачествеФинансовыхАктивовСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредства.НомерСтроки КАК НомерСтроки,
		|	ДенежныеСредства.Сумма КАК Сумма,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ДенежныеСредства.УК) КАК УК,
		|	ДенежныеСредства.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ДенежныеСредства
		|ИЗ
		|	(ВЫБРАТЬ
		|		""04"" КАК НомерСтроки,
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Банк.ЮрФизЛицо КАК УК,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БанковскиеСчета),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""39"",
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства22)
		|				ТОГДА -1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|		КОНЕЦ,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства22)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""07"",
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|		&КонтрагентНКЦ,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства10), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства11)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ДенежныеСредства.УК = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.НомерСтроки КАК НомерСтроки,
		|	Расчеты.Сумма КАК Сумма,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Расчеты.УК) КАК УК,
		|	Расчеты.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Расчеты
		|ИЗ
		|	(ВЫБРАТЬ
		|		""40"" КАК НомерСтроки,
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты08), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ КАК Сумма,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК УК,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты08), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты25), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""40"",
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1.Контрагент,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""40"",
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(плансчетов.единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами08)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(плансчетов.единый.РасчетыСБрокерами02)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ,
		|		NULL,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами07), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами08)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""44"",
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами47)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""40"",
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(планСчетов.Единый.ПрочиеСредства17), ЗНАЧЕНИЕ(планСчетов.Единый.РасчетыСДебиторамиИКредиторами24))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(планСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(планСчетов.Единый.РасчетыСДебиторамиИКредиторами23))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства17), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами23), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами24)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 В (&БрокерыКредитныеОрганизации)
		|				ТОГДА ""07""
		|			ИНАЧЕ ""39""
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(планСчетов.Единый.ПрочиеСредства18)
		|				ТОГДА -1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(планСчетов.Единый.ПрочиеСредства19)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ,
		|		ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства18), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства19)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Расчеты.УК = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Займы.НомерСтроки КАК НомерСтроки,
		|	Займы.Сумма КАК Сумма,
		|	Займы.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Займы
		|ИЗ
		|	(ВЫБРАТЬ
		|		""38"" КАК НомерСтроки,
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ЗаймыВыданныеЮридическимЛицам01)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК Займы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Депозиты.Сумма КАК Сумма,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Депозиты.Банк) КАК Банк,
		|	Депозиты.ЭтоМНО КАК ЭтоМНО,
		|	Депозиты.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма,
		|		ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОНЕЦ КАК Банк,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		КОНЕЦ КАК ЭтоМНО,
		|		ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Депозиты.Банк = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, ЦенныеБумаги.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ЦенныеБумаги.Эмитент) КАК Эмитент,
		|	ЦенныеБумаги.Облигация КАК Облигация,
		|	ЦенныеБумаги.Сумма КАК Сумма,
		|	ЦенныеБумаги.РазделОтчета КАК РазделОтчета
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ КАК УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо КАК Эмитент,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) КАК Облигация,
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма,
		|		1 КАК РазделОтчета
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации),
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|		2
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации),
		|		ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|		3
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации),
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения51), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения53), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения57), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения59), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения63), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения65))
		|				ТОГДА -1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения19), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения20), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения22), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения23), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения25), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения26))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения11), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения12), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения14), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения15), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения17), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения18), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения50), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения52), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения56), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения58), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения62), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения64))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ,
		|		4
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения11), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения12), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения14), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения15), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения17), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения18), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения19), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения20), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения22), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения23), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения25), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения26), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения50), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения51), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения52), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения53), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения56), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения57), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения58), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения59), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения62), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения63), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения64), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения65)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо,
		|		ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации),
		|		ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения65)
		|				ТОГДА -1 * ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения26)
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения18), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения64))
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ,
		|		5
		|	ИЗ
		|		РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&грКонецПериода,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения18), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения26), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения64), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения65)),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации) КАК ЕдиныйБухгалтерскийУчетОстатки) КАК ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО ЦенныеБумаги.Эмитент = ПереопределенияАктивов.Эмитент
		|			И ЦенныеБумаги.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&КонецПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ЦенныеБумаги.Эмитент = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	РейтингиСрезПоследних.Шкала.ТипШкалы КАК ТипШкалы,
		|	РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала КАК Шкала,
		|	РейтингиСрезПоследних.ЗначениеРейтинга КАК ЗначениеРейтинга,
		|	ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5) КАК СтрокаСопоставления,
		|	РейтингиСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _РейтингиСрезПоследних
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&КонецПериода,
		|			Субъект В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.Облигация
		|					ИЗ
		|						_ЦенныеБумаги КАК _ЦенныеБумаги
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_ЦенныеБумаги.Эмитент
		|					ИЗ
		|						_ЦенныеБумаги КАК _ЦенныеБумаги
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_Депозиты.Банк
		|					ИЗ
		|						_Депозиты КАК _Депозиты
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_ДенежныеСредства.УК
		|					ИЗ
		|						_ДенежныеСредства КАК _ДенежныеСредства
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						_Расчеты.УК
		|					ИЗ
		|						_Расчеты КАК _Расчеты)
		|				И (Шкала.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ Шкала.ДатаПереходаВАрхив > &КонецПериода)) КАК РейтингиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&КонецПериода, Источник = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПереченьЦБ_РФДляОтчетности)) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|		ПО РейтингиСрезПоследних.Шкала = СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная
		|			И (РейтингиСрезПоследних.ЗначениеРейтинга.Оценка МЕЖДУ СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное.Оценка И СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка)
		|ГДЕ
		|	(РейтингиСрезПоследних.ДатаПереходаВАрхив > &КонецПериода
		|			ИЛИ РейтингиСрезПоследних.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|	И (РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив > &КонецПериода
		|			ИЛИ РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	РейтингиСрезПоследних.Субъект,
		|	РейтингиСрезПоследних.Шкала.ТипШкалы,
		|	РейтингиСрезПоследних.РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала,
		|	РейтингиСрезПоследних.ЗначениеРейтинга,
		|	ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5),
		|	РейтингиСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.АКРА)
		|			ТОГДА 1
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX)
		|			ТОГДА 2
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.FitchRatings)
		|			ТОГДА 3
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.Moodys)
		|			ТОГДА 4
		|		КОГДА _РейтингиСрезПоследних.РейтинговоеАгентство = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.StandardAndPoors)
		|			ТОГДА 5
		|	КОНЕЦ КАК ПриоритетРейтинговогоАгентства
		|ПОМЕСТИТЬ _ПриоритетыРейтинговыхАгентств
		|ИЗ
		|	_РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Субъект КАК Субъект,
		|	ВложенныйЗапрос.СтрокаСопоставления КАК СтрокаСопоставления,
		|	_РейтингиСрезПоследних.Шкала КАК Шкала
		|ПОМЕСТИТЬ _Рейтинги
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СтрокиСМаксимальнымРейтингом.Субъект КАК Субъект,
		|		_СтрокиСМаксимальнымРейтингом.ТипШкалы КАК ТипШкалы,
		|		_СтрокиСМаксимальнымРейтингом.СтрокаСопоставления КАК СтрокаСопоставления,
		|		МИНИМУМ(_ПриоритетыРейтинговыхАгентств.ПриоритетРейтинговогоАгентства) КАК ПриоритетРейтинговогоАгентства
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_РейтингиСрезПоследних.Субъект КАК Субъект,
		|			_РейтингиСрезПоследних.ТипШкалы КАК ТипШкалы,
		|			МИНИМУМ(_РейтингиСрезПоследних.СтрокаСопоставления) КАК СтрокаСопоставления
		|		ИЗ
		|			_РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_РейтингиСрезПоследних.Субъект,
		|			_РейтингиСрезПоследних.ТипШкалы) КАК _СтрокиСМаксимальнымРейтингом
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПриоритетыРейтинговыхАгентств КАК _ПриоритетыРейтинговыхАгентств
		|				ПО _РейтингиСрезПоследних.РейтинговоеАгентство = _ПриоритетыРейтинговыхАгентств.РейтинговоеАгентство
		|			ПО _СтрокиСМаксимальнымРейтингом.Субъект = _РейтингиСрезПоследних.Субъект
		|				И _СтрокиСМаксимальнымРейтингом.ТипШкалы = _РейтингиСрезПоследних.ТипШкалы
		|				И _СтрокиСМаксимальнымРейтингом.СтрокаСопоставления = _РейтингиСрезПоследних.СтрокаСопоставления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СтрокиСМаксимальнымРейтингом.Субъект,
		|		_СтрокиСМаксимальнымРейтингом.ТипШкалы,
		|		_СтрокиСМаксимальнымРейтингом.СтрокаСопоставления) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПриоритетыРейтинговыхАгентств КАК _ПриоритетыРейтинговыхАгентств
		|		ПО ВложенныйЗапрос.ПриоритетРейтинговогоАгентства = _ПриоритетыРейтинговыхАгентств.ПриоритетРейтинговогоАгентства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|		ПО (_ПриоритетыРейтинговыхАгентств.РейтинговоеАгентство = _РейтингиСрезПоследних.РейтинговоеАгентство)
		|			И ВложенныйЗапрос.Субъект = _РейтингиСрезПоследних.Субъект
		|			И ВложенныйЗапрос.ТипШкалы = _РейтингиСрезПоследних.ТипШкалы
		|			И ВложенныйЗапрос.СтрокаСопоставления = _РейтингиСрезПоследних.СтрокаСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДенежныеСредства.НомерСтроки КАК НомерСтроки,
		|	_ДенежныеСредства.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ЕСТЬNULL(_РейтингиНациональные.СтрокаСопоставления, 5)
		|		ИНАЧЕ _РейтингиМеждународные.СтрокаСопоставления
		|	КОНЕЦ КАК Рейтинг
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиМеждународные
		|		ПО _ДенежныеСредства.УК = _РейтингиМеждународные.Субъект
		|			И (НЕ _РейтингиМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _ДенежныеСредства.Валюта = &ВалютаУчета
		|					ТОГДА _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиНациональные
		|		ПО _ДенежныеСредства.УК = _РейтингиНациональные.Субъект
		|			И (_РейтингиМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА _Депозиты.ЭтоМНО
		|			ТОГДА ""02""
		|		ИНАЧЕ ""06""
		|	КОНЕЦ,
		|	_Депозиты.Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ЕСТЬNULL(_РейтингиНациональные.СтрокаСопоставления, 5)
		|		ИНАЧЕ _РейтингиМеждународные.СтрокаСопоставления
		|	КОНЕЦ
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиМеждународные
		|		ПО _Депозиты.Банк = _РейтингиМеждународные.Субъект
		|			И (НЕ _РейтингиМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _Депозиты.Валюта = &ВалютаУчета
		|					ТОГДА _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиНациональные
		|		ПО _Депозиты.Банк = _РейтингиНациональные.Субъект
		|			И (_РейтингиМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""12""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""19""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""26""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""13""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""20""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""27""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""14""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""21""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""28""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""15""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""22""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""29""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|				И _ЦенныеБумаги.Эмитент В (&ФинансовыеОрганизацииТП)
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""16""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""23""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""30""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|		КОГДА _ЦенныеБумаги.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|				И НЕ _ЦенныеБумаги.Эмитент В (&ФинансовыеОрганизацииТП)
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 1
		|						ТОГДА ""17""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 2
		|						ТОГДА ""24""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 3
		|						ТОГДА ""31""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 4
		|						ТОГДА ""36""
		|					КОГДА _ЦенныеБумаги.РазделОтчета = 5
		|						ТОГДА ""37""
		|				КОНЕЦ
		|	КОНЕЦ,
		|	_ЦенныеБумаги.Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиЦБМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(_РейтингиЦБНациональные.СтрокаСопоставления, 5) = 5
		|						ТОГДА ВЫБОР
		|								КОГДА ЕСТЬNULL(_РейтингиЭмитентовМеждународные.СтрокаСопоставления, 5) = 5
		|									ТОГДА ЕСТЬNULL(_РейтингиЭмитентовНациональные.СтрокаСопоставления, 5)
		|								ИНАЧЕ _РейтингиЭмитентовМеждународные.СтрокаСопоставления
		|							КОНЕЦ
		|					ИНАЧЕ _РейтингиЦБНациональные.СтрокаСопоставления
		|				КОНЕЦ
		|		ИНАЧЕ _РейтингиЦБМеждународные.СтрокаСопоставления
		|	КОНЕЦ
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЦБМеждународные
		|		ПО _ЦенныеБумаги.Облигация = _РейтингиЦБМеждународные.Субъект
		|			И (НЕ _РейтингиЦБМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _ЦенныеБумаги.Облигация.ВалютаНоминала = &ВалютаУчета
		|					ТОГДА _РейтингиЦБМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиЦБМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЦБНациональные
		|		ПО _ЦенныеБумаги.Облигация = _РейтингиЦБНациональные.Субъект
		|			И (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиЦБНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЭмитентовМеждународные
		|		ПО (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБНациональные.СтрокаСопоставления = 5)
		|			И _ЦенныеБумаги.Эмитент = _РейтингиЭмитентовМеждународные.Субъект
		|			И (НЕ _РейтингиЭмитентовМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _ЦенныеБумаги.Облигация.ВалютаНоминала = &ВалютаУчета
		|					ТОГДА _РейтингиЭмитентовМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиЭмитентовМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиЭмитентовНациональные
		|		ПО (_РейтингиЦБМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиЦБНациональные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЦБНациональные.СтрокаСопоставления = 5)
		|			И (_РейтингиЭмитентовМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиЭмитентовМеждународные.СтрокаСопоставления = 5)
		|			И _ЦенныеБумаги.Эмитент = _РейтингиЭмитентовНациональные.Субъект
		|			И (_РейтингиЭмитентовНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиЭмитентовНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Займы.НомерСтроки,
		|	_Займы.Сумма,
		|	5
		|ИЗ
		|	_Займы КАК _Займы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Расчеты.НомерСтроки,
		|	_Расчеты.Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_РейтингиМеждународные.СтрокаСопоставления, 5) = 5
		|			ТОГДА ЕСТЬNULL(_РейтингиНациональные.СтрокаСопоставления, 5)
		|		ИНАЧЕ _РейтингиМеждународные.СтрокаСопоставления
		|	КОНЕЦ
		|ИЗ
		|	_Расчеты КАК _Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиМеждународные
		|		ПО _Расчеты.УК = _РейтингиМеждународные.Субъект
		|			И (НЕ _РейтингиМеждународные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (ВЫБОР
		|				КОГДА _Расчеты.Валюта = &ВалютаУчета
		|					ТОГДА _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяНацВалюта)
		|				ИНАЧЕ _РейтингиМеждународные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _РейтингиНациональные
		|		ПО _Расчеты.УК = _РейтингиНациональные.Субъект
		|			И (_РейтингиМеждународные.Субъект ЕСТЬ NULL
		|				ИЛИ _РейтингиМеждународные.СтрокаСопоставления = 5)
		|			И (_РейтингиНациональные.Шкала.Владелец = ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.RAEX))
		|			И (_РейтингиНациональные.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 1
		|			ТОГДА ""03""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 2
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 3
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 4
		|			ТОГДА ""06""
		|		ИНАЧЕ ""07""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1))
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 1
		|			ТОГДА ""03""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 2
		|			ТОГДА ""04""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 3
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.Рейтинг = 4
		|			ТОГДА ""06""
		|		ИНАЧЕ ""07""
		|	КОНЕЦ";
		
	Запрос.УстановитьПараметр("КонтрагентНКЦ", ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	Запрос.УстановитьПараметр("БрокерыКредитныеОрганизации", ПолучитьМассивБрокеровКредитныхОрганизаций());
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;

КонецПроцедуры

// 62.10
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОКредитномКачествеПоДепозитамСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
КонецПроцедуры

// 62.14
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	мТаблицаСчетов = ПолучитьИзВременногоХранилища(Адрес_мТаблицаСчетов);
	
	мТаблицаСчетов.Очистить();
	ДобавитьСчетВТаблицуСчетов("П0903", "Расчеты по начисленным доходам по акциям, долям, паям (просроченные)", "+", "!СКД", "60347", "Сальдо на конец периода #Период# по дебету счета 60347");
	ЗаполнитьРазделПоСпискуСчетовЗаПериод(Запрос, "НаКонец", "ЗаТекущийПериод", ТекРаздел);	
	
КонецПроцедуры

// 62.15 
&НаСервере
Процедура ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательствСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел1
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""01"",
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И (ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|						ИЛИ ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.ПогашениеКупона))
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47408"", ""47423""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47022""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""РОССИЯ""
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""50905""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47423""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания) ССЫЛКА Справочник.ДоговорыБрокерскогоОбслуживания
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ДоговорыБрокерскогоОбслуживания).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры) ССЫЛКА Справочник.Договоры
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Договоры).Контрагент
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""07"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""503""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета) ССЫЛКА Справочник.БанковскиеСчета
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.БанковскиеСчета).Банк.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""03"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)
		|			ТОГДА ""02""
		|		ИНАЧЕ ""11""
		|	КОНЕЦ КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел10
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60347"", ""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = ПеречниОбъектов.Объект
		|			И (ПеречниОбъектов.Период = &ДатаПеречня)
		|			И (ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ))
		|			И (ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора))
		|			И (ПеречниОбъектов.Включен)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ВЫБОР
		|		КОГДА ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации)
		|			ТОГДА ""02""
		|		ИНАЧЕ ""11""
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""31"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _Раздел23
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"", ""47422""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.ЮрФизЛица) ССЫЛКА Справочник.ЮрФизЛица
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""31"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления) ССЫЛКА Справочник.СчетаДоверительногоУправления
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления).Организация.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления) ССЫЛКА Справочник.СчетаДоверительногоУправления
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.СчетаДоверительногоУправления).Организация.ЮрФизЛицо
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПеречниОбъектовСрезПоследних.Объект КАК Объект
		|ПОМЕСТИТЬ СтраныОЭСР
		|ИЗ
		|	РегистрСведений.ПеречниОбъектов.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ОЭСР)
		|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СтраныОЭСР)) КАК ПеречниОбъектовСрезПоследних
		|ГДЕ
		|	ПеречниОбъектовСрезПоследних.Включен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел1.НомерСтроки КАК НомерСтроки,
		|	_Раздел1.Сумма КАК Сумма,
		|	_Раздел1.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Раздел1 КАК _Раздел1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел3.НомерСтроки,
		|	_Раздел3.Сумма,
		|	_Раздел3.ЮрФизЛицо
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел10.НомерСтроки,
		|	_Раздел10.Сумма,
		|	_Раздел10.ЮрФизЛицо
		|ИЗ
		|	_Раздел10 КАК _Раздел10
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел23.НомерСтроки,
		|	_Раздел23.Сумма,
		|	_Раздел23.ЮрФизЛицо
		|ИЗ
		|	_Раздел23 КАК _Раздел23
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия), ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
		|				ИЛИ _ИтоговаяТаблица.ЮрФизЛицо = ""РОССИЯ""
		|			ТОГДА ""03""
		|		КОГДА НЕ СтраныОЭСР.Объект ЕСТЬ NULL
		|			ТОГДА ""04""
		|		ИНАЧЕ ""05""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ СтраныОЭСР КАК СтраныОЭСР
		|			ПО РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации = СтраныОЭСР.Объект
		|		ПО _ИтоговаяТаблица.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	КурсВалютыПроводки.Курс,
		|	ВЫБОР
		|		КОГДА РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия), ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
		|				ИЛИ _ИтоговаяТаблица.ЮрФизЛицо = ""РОССИЯ""
		|			ТОГДА ""03""
		|		КОГДА НЕ СтраныОЭСР.Объект ЕСТЬ NULL
		|			ТОГДА ""04""
		|		ИНАЧЕ ""05""
		|	КОНЕЦ";
	
	ДатаПеречня = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ДатаПеречня", ДатаПеречня);	
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 62.16 
&НаСервере
Процедура ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	Запрос.УстановитьПараметр("ВалютаУчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовФормы.Организация, "ВалютаУчета"));
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	// Получение данных раздела
	Запрос.Текст = Запрос.Текст + ";" + Символы.ПС + " 
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""07"" КАК НомерСтроки,
		|	""03"" КАК НомерКолонки,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ПОМЕСТИТЬ
		|	_ИтоговаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""07"" КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего) 
		|			ТОГДА ""03""
		|		КОГДА СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1) 
		|			ТОГДА ""09""  
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего) И СчетДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1) 
		|			ТОГДА СчетДоверительногоУправления.ДатаРасторжения 
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата,
		|	вэУправленческий.СуммаРазвернутыйОстатокКт КАК СуммаВВалютеУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК вэУправленческий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 15), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 15)
		|	КОНЕЦ КАК ПятнадцатьЛет,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 5)
		|	КОНЕЦ КАК ПятьЛет,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 3)
		|	КОНЕЦ КАК ТриГода,		
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятнадцатьЛет
		|			ТОГДА ""08""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""07""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""06""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""04""
		|		ИНАЧЕ ""03""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.СуммаВВалютеУчета) * ЕСТЬNULL(КурсВалютыУчета.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыУчета
		|		ПО КурсВалютыУчета.Валюта = &ВалютаУчета,
		|	_Периоды КАК _Периоды
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятнадцатьЛет
		|			ТОГДА ""08""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ПятьЛет
		|			ТОГДА ""07""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриГода
		|			ТОГДА ""06""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""04""
		|		ИНАЧЕ ""03""
		|	КОНЕЦ,
		|	КурсВалютыУчета.Курс		
		|";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 62.17 
&НаСервере
Процедура ЗаполнитьРаздел_АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК НомерСтроки,
		|	""03"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел1
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ КАК АнализируемаяДата,
		|	ЕСТЬNULL(МНО.Ссылка, НЕОПРЕДЕЛЕНО) КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _Раздел2
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения
		|	КОНЕЦ,
		|	ЕСТЬNULL(МНО.Ссылка, НЕОПРЕДЕЛЕНО),
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО),
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47022""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО),
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&БрокерыКредитныеОрганизации)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""03"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""07"" КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Раздел7
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""503""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""11"" КАК НомерСтроки,
		|	""03"" КАК НомерКолонки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АнализируемаяДата,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Раздел9
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47408"", ""50905"", ""47423""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК МНО
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = МНО.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА МНО.ДатаВозврата
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|				И ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	КОНЕЦПЕРИОДА(&КонецПериода, ГОД),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""47902"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""28"" КАК НомерСтроки,
		|	""03"" КАК НомерКолонки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК АнализируемаяДата
		|ПОМЕСТИТЬ _Раздел23
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"", ""47422""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""28"",
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика <> ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""28"",
		|	""03"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.ДатаРасторжения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел1.НомерСтроки КАК НомерСтроки,
		|	_Раздел1.НомерКолонки КАК НомерКолонки,
		|	_Раздел1.Сумма КАК Сумма,
		|	_Раздел1.АнализируемаяДата КАК АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО КАК ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитика
		|ИЗ
		|	_Раздел1 КАК _Раздел1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел2.НомерСтроки,
		|	_Раздел2.НомерКолонки,
		|	_Раздел2.Сумма,
		|	_Раздел2.АнализируемаяДата,
		|	_Раздел2.ЦеннаяБумага,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел2 КАК _Раздел2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел3.НомерСтроки,
		|	_Раздел3.НомерКолонки,
		|	_Раздел3.Сумма,
		|	_Раздел3.АнализируемаяДата,
		|	_Раздел3.ЦеннаяБумага,
		|	_Раздел3.ДополнительнаяАналитика
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел7.НомерСтроки,
		|	_Раздел7.НомерКолонки,
		|	_Раздел7.Сумма,
		|	_Раздел7.АнализируемаяДата,
		|	_Раздел7.ЦеннаяБумага,
		|	_Раздел7.ДополнительнаяАналитика
		|ИЗ
		|	_Раздел7 КАК _Раздел7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел9.НомерСтроки,
		|	_Раздел9.НомерКолонки,
		|	_Раздел9.Сумма,
		|	_Раздел9.АнализируемаяДата,
		|	_Раздел9.ЦеннаяБумага,
		|	_Раздел9.ДополнительнаяАналитика
		|ИЗ
		|	_Раздел9 КАК _Раздел9
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел23.НомерСтроки,
		|	_Раздел23.НомерКолонки,
		|	_Раздел23.Сумма,
		|	_Раздел23.АнализируемаяДата,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_Раздел23 КАК _Раздел23";
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("БрокерыКредитныеОрганизации", ПолучитьМассивБрокеровКредитныхОрганизаций());
	Запрос.УстановитьПараметр("БрокерыНеКредитныеОрганизации", ПолучитьМассивБрокеровНеКредитныхОрганизаций());
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УчетныйАктив", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивы"));
	
	МассивДопАналитикКупонов = Новый Массив;
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикКупонов.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	
	Для каждого ТекСтрока Из Результат Цикл
	
		Если ЗначениеЗаполнено(ТекСтрока.НомерКолонки) 
			ИЛИ ЗначениеЗаполнено(ТекСтрока.АнализируемаяДата)
			ИЛИ Не ЗначениеЗаполнено(ТекСтрока.ЦеннаяБумага) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ТекСтрока.ЦеннаяБумага) = Тип("ДокументСсылка.МНО") Тогда
			ТекСтрока.УчетныйАктив = Справочники.УчетныеАктивы.ПроцентыНаМНО;
		Иначе
			Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ТекСтрока.ЦеннаяБумага);
			ЭтоКупон = МассивДопАналитикКупонов.Найти(ТекСтрока.ДополнительнаяАналитика) <> Неопределено;
			ТекСтрока.УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, Рынок, ТекСтрока.ЦеннаяБумага, ЭтоКупон);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&КонецПериода КАК ОтчетнаяДата,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, ГОД, 1)
		|	КОНЕЦ КАК Год,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ) = КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3), МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 3)
		|	КОНЕЦ КАК ТриМесяца
		|ПОМЕСТИТЬ _Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	ТаблицаИсточник.НомерКолонки КАК НомерКолонки,
		|	ТаблицаИсточник.Сумма КАК Сумма,
		|	ТаблицаИсточник.АнализируемаяДата КАК АнализируемаяДата,
		|	ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаИсточник.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив
		|ПОМЕСТИТЬ _ТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИсточник.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаИсточник.НомерКолонки КАК НомерКолонки,
		|	СУММА(_ТаблицаИсточник.Сумма) КАК Сумма,
		|	_ТаблицаИсточник.АнализируемаяДата КАК АнализируемаяДата,
		|	_ТаблицаИсточник.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаИсточник.УчетныйАктив КАК УчетныйАктив
		|ПОМЕСТИТЬ _ТаблицаИсточникСгруппированная
		|ИЗ
		|	_ТаблицаИсточник КАК _ТаблицаИсточник
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИсточник.УчетныйАктив,
		|	_ТаблицаИсточник.ЦеннаяБумага,
		|	_ТаблицаИсточник.АнализируемаяДата,
		|	_ТаблицаИсточник.НомерКолонки,
		|	_ТаблицаИсточник.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИсточникСгруппированная.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""03""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""04""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""05""
		|		ИНАЧЕ _ТаблицаИсточникСгруппированная.НомерКолонки
		|	КОНЕЦ КАК НомерКолонки,
		|	_ТаблицаИсточникСгруппированная.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияКупона)
		|			ТОГДА КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
		|				ИЛИ НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты)
		|						ТОГДА ЕСТЬNULL(МИНИМУМ(УсловияОферт.ДатаВыкупа), Облигации.ДатаПогашения)
		|					ИНАЧЕ Облигации.ДатаПогашения
		|				КОНЕЦ
		|		ИНАЧЕ _ТаблицаИсточникСгруппированная.АнализируемаяДата
		|	КОНЕЦ КАК АнализируемаяДата,
		|	_ТаблицаИсточникСгруппированная.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ТаблицаИсточникСгруппированная КАК _ТаблицаИсточникСгруппированная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних
		|		ПО _ТаблицаИсточникСгруппированная.УчетныйАктив = НастройкиУчетаАктивовСрезПоследних.УчетныйАктив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(
		|				&КонецПериода,
		|				Облигация В
		|					(ВЫБРАТЬ
		|						_ТаблицаИсточникСгруппированная.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаИсточникСгруппированная КАК _ТаблицаИсточникСгруппированная)) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО _ТаблицаИсточникСгруппированная.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ТаблицаИсточникСгруппированная.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ТаблицаИсточникСгруппированная.ЦеннаяБумага = УсловияОферт.Облигация
		|			И (&КонецПериода < УсловияОферт.ДатаВыкупа
		|				И НЕ УсловияОферт.ТолькоДляФизическихЛиц),
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИсточникСгруппированная.НомерСтроки,
		|	_ТаблицаИсточникСгруппированная.Сумма,
		|	_ТаблицаИсточникСгруппированная.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ДоТрехМесяцев)
		|			ТОГДА ""03""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтТрехМесяцевДоГода)
		|			ТОГДА ""04""
		|		КОГДА НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.СвышеГода)
		|			ТОГДА ""05""
		|		ИНАЧЕ _ТаблицаИсточникСгруппированная.НомерКолонки
		|	КОНЕЦ,
		|	_ТаблицаИсточникСгруппированная.АнализируемаяДата,
		|	НастройкиУчетаАктивовСрезПоследних.МетодикаРасчетаСрокаКупона,
		|	КупонныйДоходПоОблигациямСрезПоследних.ДатаОкончанияКупона,
		|	Облигации.ДатаПогашения,
		|	НастройкиУчетаОбщиеСрезПоследних.РассчитыватьЭСПДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""04""
		|		ИНАЧЕ ""03""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта),
		|	_Периоды КАК _Периоды
		|
		|СГРУППИРОВАТЬ ПО
		|	_ИтоговаяТаблица.НомерСтроки,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.НомерКолонки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА _ИтоговаяТаблица.НомерКолонки
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.Год
		|			ТОГДА ""05""
		|		КОГДА _ИтоговаяТаблица.АнализируемаяДата > _Периоды.ТриМесяца
		|			ТОГДА ""04""
		|		ИНАЧЕ ""03""
		|	КОНЕЦ,
		|	КурсВалютыПроводки.Курс";
	Запрос.УстановитьПараметр("ТаблицаИсточник", Результат);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла; 
	
КонецПроцедуры

// 62.18 
&НаСервере
Процедура ЗаполнитьРаздел_КраткийОбзорФинансовыхАктивовИОбязательствСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""01"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел1
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20202"", ""20203"", ""20209"", ""47901"", ""20802"", ""20501"", ""20502""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел2
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""20601"", ""20603"", ""20609"", ""20611"", ""20613""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) = ТИП(Документ.МНО)
		|			ТОГДА ""01""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Справочник.ДепозитныеВклады) В (&ДепозитныеВкладыДолгосрочные)
		|					ТОГДА ""02""
		|				ИНАЧЕ ""01""
		|			КОНЕЦ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47010"", ""47011"", ""47017"", ""47022""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &ТолькоКредитныеОрганизации) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""02"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&БрокерыКредитныеОрганизации)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47018"", ""47019""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В (&БрокерыНеКредитныеОрганизации)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""03"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел3
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""501"", ""506""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""07"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел7
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""503""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""11"" КАК НомерСтроки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты23)
		|					И НЕ ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.МНО) ССЫЛКА Документ.МНО
		|				ТОГДА 0
		|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел9
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""30602"", ""47408"", ""50905"", ""47423""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Родитель.Код В (""504""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""11"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код = ""47902"",
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""31"" КАК НомерСтроки,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ КАК Валюта
		|ПОМЕСТИТЬ _Раздел27
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""60311"", ""47422""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""31"",
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт),
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет.Код В (""47903""),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Валютный
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Валюта
		|		ИНАЧЕ &ВалютаУчета
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Раздел1.НомерСтроки КАК НомерСтроки,
		|	_Раздел1.Сумма КАК Сумма,
		|	_Раздел1.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_Раздел1 КАК _Раздел1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел2.НомерСтроки,
		|	_Раздел2.Сумма,
		|	_Раздел2.Валюта
		|ИЗ
		|	_Раздел2 КАК _Раздел2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел3.НомерСтроки,
		|	_Раздел3.Сумма,
		|	_Раздел3.Валюта
		|ИЗ
		|	_Раздел3 КАК _Раздел3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел7.НомерСтроки,
		|	_Раздел7.Сумма,
		|	_Раздел7.Валюта
		|ИЗ
		|	_Раздел7 КАК _Раздел7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел9.НомерСтроки,
		|	_Раздел9.Сумма,
		|	_Раздел9.Валюта
		|ИЗ
		|	_Раздел9 КАК _Раздел9
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Раздел27.НомерСтроки,
		|	_Раздел27.Сумма,
		|	_Раздел27.Валюта
		|ИЗ
		|	_Раздел27 КАК _Раздел27
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА Валюты.Код = ""810""
		|				ИЛИ Валюты.Код = ""643""
		|			ТОГДА ""03""
		|		КОГДА Валюты.Код = ""840""
		|			ТОГДА ""04""
		|		КОГДА Валюты.Код = ""978""
		|			ТОГДА ""05""
		|		ИНАЧЕ ""06""
		|	КОНЕЦ КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА СУММА(_ИтоговаяТаблица.Сумма)
		|		ИНАЧЕ СУММА(_ИтоговаяТаблица.Сумма) * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО _ИтоговаяТаблица.Валюта = Валюты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Валюты.Код = ""810""
		|				ИЛИ Валюты.Код = ""643""
		|			ТОГДА ""03""
		|		КОГДА Валюты.Код = ""840""
		|			ТОГДА ""04""
		|		КОГДА Валюты.Код = ""978""
		|			ТОГДА ""05""
		|		ИНАЧЕ ""06""
		|	КОНЕЦ,
		|	_ИтоговаяТаблица.НомерСтроки,
		|	КурсВалютыПроводки.Курс";
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	Запрос.УстановитьПараметр("БрокерыКредитныеОрганизации", ПолучитьМассивБрокеровКредитныхОрганизаций());
	Запрос.УстановитьПараметр("БрокерыНеКредитныеОрганизации", ПолучитьМассивБрокеровНеКредитныхОрганизаций());
	
	Запрос.УстановитьПараметр("ДепозитныеВкладыДолгосрочные", ПолучитьДепозитныеВкладыДолгосрочные());
	Запрос.УстановитьПараметр("ДепозитныеВкладыКраткосрочные", ПолучитьДепозитныеВкладыКраткосрочные());
	
	// Отбор по кредитным организациям и банкам-нерезидент
	стрОтборКредитныеОрганизации	= "ВЫРАЗИТЬ(Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ИСТИНА";		
	стрОтборКредитныеОрганизации_НЕ	= "ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Документ.СделкаРЕПО).СделкаСЦентральнымКонтрагентом = ЛОЖЬ";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКредитныеОрганизации", стрОтборКредитныеОрганизации);		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсключаяКредитныеОрганизации", стрОтборКредитныеОрганизации_НЕ);		
	
	// Отбор по банкротам
	Запрос.УстановитьПараметр("Банкроты", РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицаБанкроты(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));		
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 63.1
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
КонецПроцедуры

// 66.1
&НаСервере
Процедура ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимостиСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|	КОНЕЦ КАК НомерКолонки,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 1
		|			ТОГДА ""02""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|			ТОГДА ""03""
		|		КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|			ТОГДА ""04""
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.НомерКолонки КАК НомерКолонки,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""005""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""006""
		|					ИНАЧЕ ""007""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""008""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""009""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""012""
		|					ИНАЧЕ ""013""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	_ИтоговаяТаблица.НомерКолонки КАК НомерКолонки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат Из Результат Цикл
		Если Не ЗначениеЗаполнено(СтрокаРезультат.НомерКолонки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номер колонки по строке №" + СтрокаРезультат.НомерСтроки + ". Сумма отнесена в колонку 02");
			СтрокаРезультат.НомерКолонки = "02";
		КонецЕсли; 
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + СтрокаРезультат.НомерКолонки, СтрокаРезультат.Сумма);
	КонецЦикла;
	
КонецПроцедуры

// 66.2
&НаСервере
Процедура ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.Источник КАК Источник
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ВЫБОР
		|			КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 2
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	_ПереоценкаЦенныхБумаг.ВидЦены КАК ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	_ПереоценкаЦенныхБумаг.ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.ВидЦены КАК ВидЦены,
		|	_ИтоговаяТаблицаПредварительная.Источник КАК Источник,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""005""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""006""
		|					ИНАЧЕ ""007""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""008""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""009""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""012""
		|					ИНАЧЕ ""013""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК _02,
		|	_ИтоговаяТаблица.ВидЦены КАК _03,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК _04
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.Источник = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ИтоговаяТаблица.Сумма <> 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "02", СтрокаРезультат._02);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "03", СтрокаРезультат._03);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "04", СтрокаРезультат._04);
	КонецЦикла;
	
КонецПроцедуры

// 66.3
&НаСервере
Процедура ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	Запрос = ПодготовитьВременныеТаблицыДокумента();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	УстановитьТекстЗапросаДляПолученияВременныхТаблиц(Запрос);
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", СтруктураРеквизитовФормы.Организация.ВалютаУчета);
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД);
	//СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеПоСправедливой);
	СчетаЦБ.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи);
	
	Запрос.УстановитьПараметр("СчетаЦБ", СчетаЦБ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьПереоценки.УровеньОценки) > 1
		|			ТОГДА 0
		|		ИНАЧЕ МАКСИМУМ(СтоимостьПереоценки.УровеньОценки)
		|	КОНЕЦ КАК УровеньОценки,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.Источник КАК Источник
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
		|	ИЗ
		|		Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|	ГДЕ
		|		ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ПереоценкаЦенныхБумаг.Организация = &Организация
		|		И ПереоценкаЦенныхБумаг.Проведен
		|		И ПереоценкаЦенныхБумаг.Дата <= &КонецПериода
		|		И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|			ПО ПереоценкаЦенныхБумаг.Ссылка = СтоимостьПереоценки.Регистратор
		|		ПО ВложенныйЗапрос.Дата = ПереоценкаЦенныхБумаг.Дата
		|ГДЕ
		|	ПереоценкаЦенныхБумаг.Организация = &Организация
		|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаЦенныхБумаг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереоценкаЦенныхБумаг.Ссылка,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ КАК УчетныйАктивЦБРФ,
		|	СУММА(ВЫБОР
		|			КОГДА _ПереоценкаЦенныхБумаг.УровеньОценки = 3
		|				ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ) КАК ЭтоОблигации,
		|	_ПереоценкаЦенныхБумаг.ВидЦены КАК ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблицаПредварительная
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&грКонецПериода,
		|			Счет В ИЕРАРХИИ (&СчетаЦБ),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумаг КАК _ПереоценкаЦенныхБумаг
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).УчетныйАктивЦБРФ
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи).УчетныйАктивЦБРФ
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации, ЛОЖЬ),
		|	_ПереоценкаЦенныхБумаг.ВидЦены,
		|	_ПереоценкаЦенныхБумаг.Источник,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции) ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации) ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Справочник.Паи) ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ПОМЕСТИТЬ ПереопределенияАктивов
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&грКонецПериода, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&грКонецПериода, ) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ПереопределенияАктивов.НовыйУчетныйАктивЦБ, _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ) КАК УчетныйАктивЦБРФ,
		|	_ИтоговаяТаблицаПредварительная.Сумма КАК Сумма,
		|	_ИтоговаяТаблицаПредварительная.ЭтоОблигации КАК ЭтоОблигации,
		|	_ИтоговаяТаблицаПредварительная.ВидЦены КАК ВидЦены,
		|	_ИтоговаяТаблицаПредварительная.Источник КАК Источник,
		|	_ИтоговаяТаблицаПредварительная.Эмитент КАК Эмитент
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ИтоговаяТаблицаПредварительная КАК _ИтоговаяТаблицаПредварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределенияАктивов КАК ПереопределенияАктивов
		|		ПО _ИтоговаяТаблицаПредварительная.УчетныйАктивЦБРФ = ПереопределенияАктивов.ИсходныйУчетныйАктивЦБ
		|			И _ИтоговаяТаблицаПредварительная.Эмитент = ПереопределенияАктивов.Эмитент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АкцииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИБанков), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИБанков))
		|			ТОГДА ""005""
		|		КОГДА НЕ _ИтоговаяТаблица.ЭтоОблигации
		|				И _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АОИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.АПИ), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПрочиеАкцииНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""006""
		|					ИНАЧЕ ""007""
		|				КОНЕЦ
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства))
		|			ТОГДА ""008""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные))
		|			ТОГДА ""009""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств))
		|			ТОГДА ""010""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов))
		|			ТОГДА ""011""
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЦБРФ В (ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентовНеБумаги), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.Иное), ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ПустаяСсылка))
		|			ТОГДА ВЫБОР
		|					КОГДА _ИтоговаяТаблица.Эмитент В (&ФинансовыеОрганизацииТП)
		|						ТОГДА ""012""
		|					ИНАЧЕ ""013""
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА &ВалютаУчета = &ВалютаДокумента
		|			ТОГДА _ИтоговаяТаблица.Сумма
		|		ИНАЧЕ _ИтоговаяТаблица.Сумма * ЕСТЬNULL(КурсВалютыПроводки.Курс, 1)
		|	КОНЕЦ КАК _02,
		|	_ИтоговаяТаблица.ВидЦены КАК _03,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК _04
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыВалютТП КАК КурсВалютыПроводки
		|		ПО (&ВалютаУчета = КурсВалютыПроводки.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИтоговаяТаблица.Источник = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ИтоговаяТаблица.Сумма <> 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из Результат Цикл
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "02", СтрокаРезультат._02);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "03", СтрокаРезультат._03);
		УстановитьЗначениеПоказателя(ТекРаздел, "П" + СтрокаРезультат.НомерСтроки + "04", СтрокаРезультат._04);
	КонецЦикла;
	
КонецПроцедуры

// 66.4
&НаСервере
Процедура ЗаполнитьРаздел_ИнформацияОСверкеИзмененийПоУровню3Сервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
КонецПроцедуры

// 66.6 
&НаСервере
Процедура ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимостьСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;
	
КонецПроцедуры

// 67.1
&НаСервере
Процедура ЗаполнитьРаздел_ФинансовыеИнструментыПодлежащиеВзаимозачетуСКСервер(ТекРаздел, ИмяРаздела)
	
	мИмяЗаполняемогоРаздела = ИмяРаздела;

	// Шапка
	ТекРаздел.Области.ТекущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	
	// Расчетные поля
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ОтчетТитульнаяСтраница()
	
	ИмяРаздела = "ОтчетТитульнаяСтраница";

	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРаздела))[0];
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;

	ТекРаздел.Области.ТекущийПериод.Значение    = СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода;
	ТекРаздел.Области.ПредыдущийПериод.Значение = СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода;
		
	РасчетРаздела_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела);
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
КонецПроцедуры

// 5.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДенежныеСредства()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДенежныеСредства"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДенежныеСредстваСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ДенежныеСредства(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 5.2 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_СверкаСуммВОтчетеОДенежныхПотокахСоСтатьями2017()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "СверкаСуммВОтчетеОДенежныхПотокахСоСтатьями2017"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_СверкаСуммВОтчетеОДенежныхПотокахСоСтатьямиСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_СверкаСуммВОтчетеОДенежныхПотокахСоСтатьями(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 6.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизацияхСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ДепозитыИСредстваВКредитныхОрганизацияхСК"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ДепозитыИСредстваВКредитныхОрганизацияхСКСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ДепозитыИСредстваВКредитныхОрганизацияхСК(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 6.2
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 7.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимости2017()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ФинансовыеАктивыПоСправедливойСтоимости2017"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ФинансовыеАктивыПоСправедливойСтоимости2017Сервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ФинансовыеАктивыПоСправедливойСтоимости2017(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 7.4
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимости()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ЦенныеБумагиПоСправедливойСтоимости"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ЦенныеБумагиПоСправедливойСтоимостиСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ЦенныеБумагиПоСправедливойСтоимости(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 12.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ЗаймыПрочиеРазмещенныеСредстваИДЗ()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ЗаймыПрочиеРазмещенныеСредстваИДЗ"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;	
	
	ЗаполнитьРаздел_ЗаймыПрочиеРазмещенныеСредстваИДЗСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ЗаймыПрочиеРазмещенныеСредстваИДЗ(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 24.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеАктивыСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеАктивыСК"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеАктивыСКСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ПрочиеАктивыСК(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 35.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ПрочиеОбязательстваСК()
	
	ТекСтрока = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ПрочиеОбязательстваСК"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ПрочиеОбязательстваСКСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ПрочиеОбязательстваСК(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 50 (нераспределенная прибыль)
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_НераспределеннаяПрибыль()
	
	ТекСтрока = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "НераспределеннаяПрибыль"))[0];
	
	ЗаполнитьРаздел_НераспределеннаяПрибыльСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_НераспределеннаяПрибыль(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 62.9
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОКредитномКачествеФинансовыхАктивов()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОКредитномКачествеФинансовыхАктивов"))[0];
	
	ТекРаздел  = ТекСтрока.ТабличныйДокумент;
	ИмяРаздела = ТекСтрока.ИмяРаздела;
	
	ЗаполнитьРаздел_ИнформацияОКредитномКачествеФинансовыхАктивовСервер(ТекРаздел, ИмяРаздела);
	
	ТекСтрока.ТабличныйДокумент = ТекРаздел;
	
	РасчетРаздела_ИнформацияОКредитномКачествеФинансовыхАктивов(ТекСтрока.ТабличныйДокумент, ИмяРаздела);
	
КонецПроцедуры

// 62.10
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОКредитномКачествеПоДепозитам()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОКредитномКачествеПоДепозитам"))[0];
	
	ЗаполнитьРаздел_ИнформацияОКредитномКачествеПоДепозитамСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ИнформацияОКредитномКачествеПоДепозитам(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 62.14
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗ()
	
	ТекСтрока = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗ"))[0];
	
	ЗаполнитьРаздел_ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗ(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 62.15 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательствСК()
	
	ТекСтрока = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ГеографическийАнализФинансовыхАктивовИОбязательствСК"))[0];
	
	ЗаполнитьРаздел_ГеографическийАнализФинансовыхАктивовИОбязательствСКСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ГеографическийАнализФинансовыхАктивовИОбязательствСК(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 62.16 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСК"))[0];	
	
	ЗаполнитьРаздел_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСКСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСК(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 62.17 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСК"))[0];	
	
	ЗаполнитьРаздел_АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСКСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСК(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 62.18 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_КраткийОбзорФинансовыхАктивовИОбязательствСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "КраткийОбзорФинансовыхАктивовИОбязательствСК"))[0];	
	
	ЗаполнитьРаздел_КраткийОбзорФинансовыхАктивовИОбязательствСКСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_КраткийОбзорФинансовыхАктивовИОбязательствСК(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 63.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017"))[0];
	
	ЗаполнитьРаздел_ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017Сервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 66.1
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимости()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "УровниВИерархииСправедливойСтоимости"))[0];
	
	ЗаполнитьРаздел_УровниВИерархииСправедливойСтоимостиСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_УровниВИерархииСправедливойСтоимости(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 66.2
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "МетодыОценкиИИсходныеДанныеУровня2"))[0];
	
	ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня2Сервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня2(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 66.3
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "МетодыОценкиИИсходныеДанныеУровня3"))[0];
	
	ЗаполнитьРаздел_МетодыОценкиИИсходныеДанныеУровня3Сервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня3(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 66.4
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ИнформацияОСверкеИзмененийПоУровню3()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ИнформацияОСверкеИзмененийПоУровню3"))[0];
	
	ЗаполнитьРаздел_ИнформацияОСверкеИзмененийПоУровню3Сервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ИнформацияОСверкеИзмененийПоУровню3(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
КонецПроцедуры

// 66.6 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимость()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "АнализСправедливойСтоимостиИБалансоваяСтоимость"))[0];	
	
	ЗаполнитьРаздел_АнализСправедливойСтоимостиИБалансоваяСтоимостьСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_АнализСправедливойСтоимостиИБалансоваяСтоимость(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

// 67.1 
&НаКлиенте
Процедура Подключаемый_ЗаполнитьРаздел_ФинансовыеИнструментыПодлежащиеВзаимозачетуСК()
	
	ТекСтрока  = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ФинансовыеИнструментыПодлежащиеВзаимозачетуСК"))[0];	
	
	ЗаполнитьРаздел_ФинансовыеИнструментыПодлежащиеВзаимозачетуСКСервер(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);
	
	РасчетРаздела_ФинансовыеИнструментыПодлежащиеВзаимозачетуСК(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела);

КонецПроцедуры

#КонецОбласти 

#Область ПроцедурыРасчета

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРаздела, ИмяЯчейки, Ячейка)
	// #ЧисткаИтогов
	
	Если КонсолидированнаяОтчетностьКлиентСервер.ИтоговаяЯчейкаПервыйРасчет(ЭтаФорма, ИмяРаздела, ИмяЯчейки, Ячейка)
		Тогда
		КонсолидированнаяОтчетность.УдалитьРасшифровкуЯчейки(Адрес_ТаблицаРасшифровки, ИмяРаздела, ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейкуНачало

&НаСервере
Процедура ДобавитьЗначениеВИтоговуюЯчейку(ИмяРазделаРезультат, РазделРезультат, ИмяЯчейкиРезультат, ИмяРазделаИсточник, ИмяЯчейкиИсточник, Множитель = 1, ИмяПоказателяРезультат = "", ИмяПоказателяИсточник = "", ДобавитьКРасчетномуЗначению = ЛОЖЬ)
	
	Если ТипЗнч(ИмяЯчейкиИсточник) = Тип("Массив") Тогда
		МассивИменЯчеекИсточник	= ИмяЯчейкиИсточник;
	Иначе
		МассивИменЯчеекИсточник	= СтрРазделить(ИмяЯчейкиИсточник, ",", Ложь);
	КонецЕсли;
	
	ИмяПоказателяРезультат		= ?(ИмяПоказателяРезультат = "", "Ячейка " + ИмяЯчейкиРезультат, ИмяПоказателяРезультат);
	ИмяПоказателяИсточник_исх	= ИмяПоказателяИсточник;
	
	// Определим ячейку-результат
	Попытка
		ЯчейкаРезультат = РазделРезультат.Области[ИмяЯчейкиРезультат];
	Исключение
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найдена ячейка %2'"),
			ИмяРазделаРезультат,
			ИмяЯчейкиРезультат);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	// #ЧисткаИтогов
	Если НЕ ДобавитьКРасчетномуЗначению Тогда
		ДобавитьЗначениеВИтоговуюЯчейкуНачало(ИмяРазделаРезультат, ИмяЯчейкиРезультат, ЯчейкаРезультат); 
	КонецЕсли;
	
	// Табличный документ-источник
	Если ТипЗнч(ИмяРазделаИсточник) = Тип("Строка") Тогда
		
		Попытка
			РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаИсточник))[0];
			ТабИсточник = РазделОтчета.ТабличныйДокумент;
		Исключение
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Расчет итогов по разделу %1: не найден раздел %2'"),
			ИмяРазделаРезультат,
			ИмяРазделаИсточник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	Иначе
		
		// Если передан табличный документ, значит заполнение идет с текущего раздела
		ТабИсточник = ИмяРазделаИсточник;
		РазделОтчета = ЭтаФорма.РазделыОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", ИмяРазделаРезультат))[0];
		
	КонецЕсли;
	СтраницаИсточник = РазделОтчета;
	
	// Определим ячейку-источник
	МассивЯчеекИсточник = Новый Массив;	
	
	Для Каждого ИмяЯчейкиИсточникИзМассива Из МассивИменЯчеекИсточник Цикл  
		ИмяЯчейкиИсточникИзМассива = СокрЛП(ИмяЯчейкиИсточникИзМассива);
		
		Попытка
			ЯчейкаИсточник = ТабИсточник.Области[ИмяЯчейкиИсточникИзМассива];
		Исключение
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Расчет итогов по разделу %1: в разделе %2 не найдена ячейка %3'"),
				ИмяРазделаРезультат,
				ИмяРазделаИсточник,
				ИмяЯчейкиИсточникИзМассива);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
		МассивЯчеекИсточник.Добавить(Новый Структура("Имя, Значение", ИмяЯчейкиИсточникИзМассива, ЯчейкаИсточник.Значение));	
	КонецЦикла;
	
	Если МассивЯчеекИсточник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗначений		= Новый Массив;
	МассивРасшифровки	= Новый Массив;
	
	Для Каждого ЯчейкаИсточник Из МассивЯчеекИсточник Цикл  
		// Определим значение - источник, умноженное на "Множитель"
		ЗначениеИсточник = ЯчейкаИсточник.Значение * Множитель;
		
		// Лобавим к значению в ячейке-результат новое значение
		ЯчейкаРезультат.Значение = ЯчейкаРезультат.Значение + КонсолидированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЗначениеИсточник, СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения, СтруктураРеквизитовФормы.мДелитель);
		
		// Определим какой должен быть знак (+/-) в расшифровке
		ЗнакВРасшифровке = ?(Множитель > 0, "+", "-");
		
		ИмяПоказателяИсточник = ?(ИмяПоказателяИсточник_исх = "", "Ячейка " + ЯчейкаИсточник.Имя, ИмяПоказателяИсточник_исх);
		Если ИмяПоказателяИсточник_исх = "" и Множитель <> 1 и Множитель <> -1 Тогда
			МножительБезЗнака = ?(Множитель > 0, Множитель, -Множитель);
			ИмяПоказателяИсточник = ИмяПоказателяИсточник + " * " + МножительБезЗнака;
		КонецЕсли;
		
		// Сформируем текст расшифровки по шаблону: "Закладка ...., имя показателя"
		ТекстРасшифровки = "Закладка «" + СтраницаИсточник.Представление + "»";
		Если ЗначениеЗаполнено(ИмяПоказателяИсточник) Тогда
			ТекстРасшифровки = ТекстРасшифровки + ", " + ИмяПоказателяИсточник;
		КонецЕсли;
		
		МассивЗначений.Добавить(ЗначениеИсточник);
		МассивРасшифровки.Добавить(ТекстРасшифровки);
	КонецЦикла;
	
	// Заменим служебные команды по периоду
	стрИмяПоказателяРезультат = СтрЗаменить(ИмяПоказателяРезультат, "#ПериодТекущий#", СтруктураРеквизитовФормы.мПредставлениеТекущегоПериода);
	стрИмяПоказателяРезультат = СтрЗаменить(стрИмяПоказателяРезультат, "#ПериодПредыдущий#", СтруктураРеквизитовФормы.мПредставлениеПредыдущегоПериода);
	
	// Добавим в расшифровку
	ДобавитьСтрокуВРасшифровку(Адрес_ТаблицаРасшифровки, СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, СтруктураРеквизитовФормы.СчетДоверительногоУправления, ИмяЯчейкиРезультат, стрИмяПоказателяРезультат, ЗнакВРасшифровке, МассивРасшифровки, МассивЗначений, , , , , ИмяРазделаРезультат);
	
КонецПроцедуры //ДобавитьЗначениеВИтоговуюЯчейку

&НаСервере
Процедура Расчет(ИмяРаздела = "")
	
	КонсолидированнаяОтчетностьКлиентСервер.РасчетИтоговНачало(ЭтаФорма, ИмяРаздела); // #ЧисткаИтогов
	
	Если ИмяРаздела = "" Тогда
		
		Для Каждого ТекСтрока Из ЭтаФорма.РазделыОтчета Цикл
			
			Если Не ВРег(ТекСтрока.ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
				Выполнить("РасчетРаздела_" + ТекСтрока.ИмяРаздела + "(ТекСтрока.ТабличныйДокумент, ТекСтрока.ИмяРаздела)");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
			ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяРаздела);
			Выполнить("РасчетРаздела_" + ИмяРаздела + "(ТекРаздел, ИмяРаздела)");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ КонсолидированнаяОтчетностьКлиентСервер.НуженПересчетОсновногоРаздела("ТабличныйДокумент" + ИмяРаздела) Тогда
		ЭтаФорма.ТабличныйДокумент = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		Возврат;
	КонецЕсли;
	
	// Расчет основного раздела
	Очистить(ИмяОсновногоРаздела);
	ТекРаздел = КонсолидированнаяОтчетность.НайтиТабличныйДокументРаздела(ЭтаФорма.РазделыОтчета, ИмяОсновногоРаздела);
	Выполнить("РасчетРаздела_" + ИмяОсновногоРаздела + "(ТекРаздел, ИмяОсновногоРаздела)");
	
КонецПроцедуры

&НаСервере
Процедура РасчетРаздела_ОтчетТитульнаяСтраница(ТекРаздел, ИмяРаздела)
	
	ТекРаздел.Области["ТекущийПериод1"].Значение = Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДФ=dd.MM.yyyy");
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СтруктураРеквизитовФормы.СчетДоверительногоУправления, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
			
	Если НЕ СведенияОбОрганизации = Неопределено Тогда
	
		ТекРаздел.Области["Организация"].Значение = СведенияОбОрганизации.НаименованиеОрганизации + " Д.У. " + 
			СведенияОбОрганизации.ПолноеНаименование + " (" + СведенияОбОрганизации.КраткоеНаименование + ") по договору №" + 
			СведенияОбОрганизации.НомерДоговора + " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ТекРаздел.Области["ПочтовыйАдресОрганизации"].Значение = СведенияОбОрганизации.ЮридическийАдрес;
	
	КонецЕсли;
	
	ОтсутствуютДанныеЗаПрошлыйГод = Ложь;
	
	ПоказателиОтчета = Новый Структура;
	ПоказателиОтчета.Вставить("Области", Новый Структура("П0202, П0702, П0902", 
		Новый Структура("Значение", 0), 
		Новый Структура("Значение", 0), 
		Новый Структура("Значение", 0)));
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода) Тогда
		
		ТаблицаПоказателиОтчета = Неопределено;
		ДанныеОтчета = СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода.ДанныеОтчета.Получить();
		
		Если ДанныеОтчета.Свойство("ПоказателиОтчета", ТаблицаПоказателиОтчета) Тогда
			НайденныеСтроки = ТаблицаПоказателиОтчета.НайтиСтроки(Новый Структура("ИмяРаздела", "ОтчетТитульнаяСтраница"));
			Для каждого СтрокаПоказателей Из НайденныеСтроки Цикл
				Если ПоказателиОтчета.Области.Свойство(СтрокаПоказателей.ИмяПоказателя) Тогда
					ПоказателиОтчета.Области[СтрокаПоказателей.ИмяПоказателя].Значение = СтрокаПоказателей.Значение;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В отчете на конец предыдущего года отсутствуют данные для заполнения");
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить отчет на конец предыдущего года");
	КонецЕсли; 
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0104", "ДенежныеСредства", "П0702");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", "ДенежныеСредства", "П0703");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0204", "ДепозитыИСредстваВКредитныхОрганизацияхСК", "П0607");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ПоказателиОтчета, "П0202");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0304", "ФинансовыеАктивыПоСправедливойСтоимости2017", "П0402");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", "ФинансовыеАктивыПоСправедливойСтоимости2017", "П0403");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1104", "ЗаймыПрочиеРазмещенныеСредстваИДЗ", "П1207");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1105", ПоказателиОтчета, "П0902");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2504", "ПрочиеАктивыСК", "П1402");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П2505", "ПрочиеАктивыСК", "П1403");

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4204", "ПрочиеОбязательстваСК", "П1803");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П4205", "ПрочиеОбязательстваСК", "П1804");
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5304", "НераспределеннаяПрибыль", "П0202");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П5305", "НераспределеннаяПрибыль", "П0203");
		
	Для НомКол = 4 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П26" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П54" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П55" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);

	КонецЦикла;

КонецПроцедуры

// 5.1
&НаСервере
Процедура РасчетРаздела_ДенежныеСредства(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 7 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 5.2
&НаСервере
Процедура РасчетРаздела_СверкаСуммВОтчетеОДенежныхПотокахСоСтатьями(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0102", "ДенежныеСредства", "П0702");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0103", "ДенежныеСредства", "П0703");
	
	//ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0202", "ЗаймыИПрочиеПривлеченныеСредства", "П0802");
	//ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0203", "ЗаймыИПрочиеПривлеченныеСредства", "П0803");
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, -1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, -1);
		
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 3 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 6.1
&НаСервере
Процедура РасчетРаздела_ДепозитыИСредстваВКредитныхОрганизацияхСК(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0105", ТекРаздел, "П0104", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0107", ТекРаздел, "П0106", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0306", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0406", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0506", -1);

	Для НомКол = 3 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1, , , Истина);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);

	КонецЦикла;		
	
КонецПроцедуры

// 6.2
&НаСервере
Процедура РасчетРаздела_ИнформацияПоНоминальнымПроцентнымСтавкамИОжидаемымСрокамПогашения(ТекРаздел, ИмяРаздела)
	
КонецПроцедуры

// 7.1
&НаСервере
Процедура РасчетРаздела_ФинансовыеАктивыПоСправедливойСтоимости2017(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 4 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 7.4
&НаСервере
Процедура РасчетРаздела_ЦенныеБумагиПоСправедливойСтоимости(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, );
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 12 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 12.1
&НаСервере
Процедура РасчетРаздела_ЗаймыПрочиеРазмещенныеСредстваИДЗ(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0205", ТекРаздел, "П0204", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0305", ТекРаздел, "П0304", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0405", ТекРаздел, "П0404", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0505", ТекРаздел, "П0504", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0605", ТекРаздел, "П0604", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0705", ТекРаздел, "П0704", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0805", ТекРаздел, "П0804", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П0903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0905", ТекРаздел, "П0904", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П1003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1005", ТекРаздел, "П1004", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1105", ТекРаздел, "П1103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1105", ТекРаздел, "П1104", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0205", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0206", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0305", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0306", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0405", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0406", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0505", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0506", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0605", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0607", ТекРаздел, "П0606", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0707", ТекРаздел, "П0705", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0707", ТекРаздел, "П0706", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0807", ТекРаздел, "П0805", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0807", ТекРаздел, "П0806", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0907", ТекРаздел, "П0905", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0907", ТекРаздел, "П0906", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1007", ТекРаздел, "П1005", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1007", ТекРаздел, "П1006", -1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1107", ТекРаздел, "П1105", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1107", ТекРаздел, "П1106", -1);

	Для НомКол = 3 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1, , , Истина);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);

	КонецЦикла;

КонецПроцедуры

// 24.1
&НаСервере
Процедура РасчетРаздела_ПрочиеАктивыСК(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 3 Цикл
		
		СтрНомКол = "0" + НомКол;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, );
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П14" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, -1);
		
	КонецЦикла; 
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) Тогда
	
		Для НомСтр = 1 По 14 Цикл
			Ячейка = ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"];
			Ячейка.Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 35.1
&НаСервере
Процедура РасчетРаздела_ПрочиеОбязательстваСК(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 3 По 4 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 1 По 17 Цикл
			СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
			
			МассивЯчеек.Добавить("П" + СтрНомСтр + СтрНомКол);	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П18" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета)
	Тогда
	
		Для НомСтр = 1 По 18 Цикл
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "04"].Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 50 (нераспределенная прибыль)
&НаСервере
Процедура РасчетРаздела_НераспределеннаяПрибыль(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0202", ТекРаздел, "П0102");
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0203", ТекРаздел, "П0103");
	
	// Чистим прошлый год если не сначала года
	Если СтруктураРеквизитовФормы.НестандартныйПериод
		И СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета <> НачалоГода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета)
	Тогда
	
		Для НомСтр = 1 По 2 Цикл
			ТекРаздел.Области["П" + Прав("0" + НомСтр, 2) + "03"].Значение = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// 62.9
&НаСервере
Процедура РасчетРаздела_ИнформацияОКредитномКачествеФинансовыхАктивов(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 3 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, СтрЗаменить("П02%1, П03%1, П04%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, СтрЗаменить("П06%1, П07%1, П08%1, П09%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, СтрЗаменить("П12%1, П13%1, П14%1, П15%1, П16%1, П17%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П18" + СтрНомКол, ТекРаздел, СтрЗаменить("П19%1, П20%1, П21%1, П22%1, П23%1, П24%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, СтрЗаменить("П26%1, П27%1, П28%1, П29%1, П30%1, П31%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10" + СтрНомКол, ТекРаздел, СтрЗаменить("П11%1, П18%1, П25%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, СтрЗаменить("П33%1, П34%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П36" + СтрНомКол, ТекРаздел, СтрЗаменить("П37%1, П38%1, П39%1, П40%1, П41%1, П42%1, П43%1, П44%1, П45%1, П46%1", "%1", СтрНомКол), 1);

	КонецЦикла;

КонецПроцедуры

// 62.10
&НаСервере
Процедура РасчетРаздела_ИнформацияОКредитномКачествеПоДепозитам(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0207", ТекРаздел, "П0202, П0203, П0204, П0205, П0206", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0307", ТекРаздел, "П0302, П0303, П0304, П0305, П0306", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0407", ТекРаздел, "П0402, П0403, П0404, П0405, П0406", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0507", ТекРаздел, "П0502, П0503, П0504, П0505, П0506", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0707", ТекРаздел, "П0702, П0703, П0704, П0705, П0706", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0807", ТекРаздел, "П0802, П0803, П0804, П0805, П0806", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П0907", ТекРаздел, "П0902, П0903, П0904, П0905, П0906", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П1007", ТекРаздел, "П1002, П1003, П1004, П1005, П1006", 1);

	Для НомКол = 2 По 7 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, СтрЗаменить("П02%1, П03%1, П04%1, П05%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06" + СтрНомКол, ТекРаздел, СтрЗаменить("П07%1, П08%1, П09%1, П10%1", "%1", СтрНомКол), 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П11" + СтрНомКол, ТекРаздел, СтрЗаменить("П01%1, П06%1", "%1", СтрНомКол), 1);
	КонецЦикла;	

КонецПроцедуры

// 62.14
&НаСервере
Процедура РасчетРаздела_ИнформацияОКредитномКачествеЗаймовПрочихРазмещенныхСредствИДЗ(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 2 По 22 Цикл
		Если НомСтр = 12 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 7 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "08", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	

	Для НомКол = 3 По 8 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 2 По 11 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 13 По 22 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П23" + СтрНомКол, ТекРаздел, СтрЗаменить("П01%1, П12%1", "%1", СтрНомКол), 1);
	КонецЦикла;	

КонецПроцедуры

// 62.15 
&НаСервере
Процедура РасчетРаздела_ГеографическийАнализФинансовыхАктивовИОбязательствСК(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 1 По 31 Цикл
		Если НомСтр = 5 ИЛИ НомСтр = 20 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 5 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "06", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	
	
	Для НомКол = 3 По 6 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);

		МассивЯчеек = Новый Массив;
		Для НомСтр = 1 По 19 Цикл
			Если НомСтр = 4 ИЛИ НомСтр = 6 ИЛИ НомСтр = 8 Тогда
				Продолжить;
			КонецЕсли;

			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П20" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 21 По 31 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П33" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П33" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, -1);
	КонецЦикла;	

КонецПроцедуры

// 62.16 
&НаСервере
Процедура РасчетРаздела_АнализФинансовыхОбязательствВРазрезеСроковНаОсновеНедискДенПотоковСК(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 1 По 7 Цикл
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 10 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "11", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	
	
	Для НомКол = 3 По 11 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 1 По 7 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	

КонецПроцедуры

// 62.17 
&НаСервере
Процедура РасчетРаздела_АнализФинансовыхАктивовИФинансовыхОбязательствВРазрезеСроковСК(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 1 По 28 Цикл
		Если НомСтр = 17 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 5 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "06", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;

	Для НомКол = 3 По 6 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 1 По 16 Цикл
			Если НомСтр = 4 ИЛИ НомСтр = 6 ИЛИ НомСтр = 8 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П17" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 18 По 28 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П29" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П30" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, -1);
	КонецЦикла;	

КонецПроцедуры

// 62.18 
&НаСервере
Процедура РасчетРаздела_КраткийОбзорФинансовыхАктивовИОбязательствСК(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 1 По 31 Цикл
		Если НомСтр = 20 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 6 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "07", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	
	
	Для НомКол = 3 По 7 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 1 По 19 Цикл
			Если НомСтр = 4 ИЛИ НомСтр = 6 ИЛИ НомСтр = 8 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П20" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 21 По 31 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П32" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П33" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П33" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, -1);
	КонецЦикла;	

КонецПроцедуры

// 63.1
&НаСервере
Процедура РасчетРаздела_ИнформацияОБалансовойСтоимостиФинансовыхАктивов2017(ТекРаздел, ИмяРаздела)
	
	Для НомКол = 2 По 5 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П03" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П04" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П05" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П06" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П07" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П08" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П09" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П10" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02" + СтрНомКол, ТекРаздел, "П11" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П14" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П15" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П16" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П17" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П13" + СтрНомКол, ТекРаздел, "П18" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П20" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П21" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П22" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П23" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П19" + СтрНомКол, ТекРаздел, "П24" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, "П26" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, "П27" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, "П28" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, "П29" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П25" + СтрНомКол, ТекРаздел, "П30" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П32" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П33" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П34" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П35" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П31" + СтрНомКол, ТекРаздел, "П36" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П38" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П39" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П40" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П41" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П37" + СтрНомКол, ТекРаздел, "П42" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П13" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П19" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П25" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П31" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П12" + СтрНомКол, ТекРаздел, "П37" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П44" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П45" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П46" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П47" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П48" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П49" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П50" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П51" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П43" + СтрНомКол, ТекРаздел, "П52" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П02" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П12" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, "П43" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П54" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П55" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П56" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П57" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П58" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П59" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П60" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П61" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П53" + СтрНомКол, ТекРаздел, "П62" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П64" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П65" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П66" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П67" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П68" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П63" + СтрНомКол, ТекРаздел, "П69" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П70" + СтрНомКол, ТекРаздел, "П01" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П70" + СтрНомКол, ТекРаздел, "П53" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П70" + СтрНомКол, ТекРаздел, "П63" + СтрНомКол, 1);		
	КонецЦикла;	

КонецПроцедуры

// 66.1
&НаСервере
Процедура РасчетРаздела_УровниВИерархииСправедливойСтоимости(ТекРаздел, ИмяРаздела)
	
	ПропускаемыеСтроки = СтрРазделить("14,15,21,27,33,39,45,55,65,67,70,71,72,75,76,82,88,94,100,109,110,116", ",", Ложь);
	Для НомСтр = 5 По 121 Цикл
		Если ПропускаемыеСтроки.Найти(Строка(НомСтр)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=3; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 2 По 4 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "05", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	

	Для НомКол = 2 По 5 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;		
		МассивЯчеек.Добавить("П005" + СтрНомКол);
		МассивЯчеек.Добавить("П006" + СтрНомКол);
		МассивЯчеек.Добавить("П007" + СтрНомКол);
		МассивЯчеек.Добавить("П008" + СтрНомКол);
		МассивЯчеек.Добавить("П009" + СтрНомКол);
		МассивЯчеек.Добавить("П010" + СтрНомКол);
		МассивЯчеек.Добавить("П011" + СтрНомКол);
		МассивЯчеек.Добавить("П012" + СтрНомКол);
		МассивЯчеек.Добавить("П013" + СтрНомКол);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П106" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П084" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П086" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П108" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
	КонецЦикла;	

КонецПроцедуры

// 66.2
&НаСервере
Процедура РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня2(ТекРаздел, ИмяРаздела)
	
	НомКол = 2;
	//Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П106" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П084" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П086" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);

		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П108" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);

	//КонецЦикла;	

КонецПроцедуры

// 66.3
&НаСервере
Процедура РасчетРаздела_МетодыОценкиИИсходныеДанныеУровня3(ТекРаздел, ИмяРаздела)
	
	НомКол = 2;
	//Для НомКол = 2 По 7 Цикл

		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П004" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П015" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П045" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П055" + СтрНомКол, ТекРаздел, "П064" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П067" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П021" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П033" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П039" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П106" + СтрНомКол, ТекРаздел, "П107" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П076" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П084" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П086" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П082" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П088" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П103" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П104" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П100" + СтрНомКол, ТекРаздел, "П105" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П111" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П112" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П113" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П114" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П110" + СтрНомКол, ТекРаздел, "П115" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П117" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П118" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П119" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П120" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П116" + СтрНомКол, ТекРаздел, "П121" + СтрНомКол, 1);

		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П110" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П109" + СтрНомКол, ТекРаздел, "П116" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П108" + СтрНомКол, ТекРаздел, "П109" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П072" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);
				
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П071" + СтрНомКол, ТекРаздел, "П106" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П070" + СтрНомКол, ТекРаздел, "П108" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П014" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П003" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);

	//КонецЦикла;	

КонецПроцедуры

// 66.4 
&НаСервере
Процедура РасчетРаздела_ИнформацияОСверкеИзмененийПоУровню3(ТекРаздел, ИмяРаздела)

КонецПроцедуры

// 66.6 
&НаСервере
Процедура РасчетРаздела_АнализСправедливойСтоимостиИБалансоваяСтоимость(ТекРаздел, ИмяРаздела)
	
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00306", ТекРаздел, "П00303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00306", ТекРаздел, "П00304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00306", ТекРаздел, "П00305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00406", ТекРаздел, "П00403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00406", ТекРаздел, "П00404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00406", ТекРаздел, "П00405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00506", ТекРаздел, "П00503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00506", ТекРаздел, "П00504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00506", ТекРаздел, "П00505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00606", ТекРаздел, "П00603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00606", ТекРаздел, "П00604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00606", ТекРаздел, "П00605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00706", ТекРаздел, "П00703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00706", ТекРаздел, "П00704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00706", ТекРаздел, "П00705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00906", ТекРаздел, "П00903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00906", ТекРаздел, "П00904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П00906", ТекРаздел, "П00905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01006", ТекРаздел, "П01003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01006", ТекРаздел, "П01004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01006", ТекРаздел, "П01005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01106", ТекРаздел, "П01103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01106", ТекРаздел, "П01104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01106", ТекРаздел, "П01105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01206", ТекРаздел, "П01203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01206", ТекРаздел, "П01204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01206", ТекРаздел, "П01205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01406", ТекРаздел, "П01403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01406", ТекРаздел, "П01404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01406", ТекРаздел, "П01405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01506", ТекРаздел, "П01503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01506", ТекРаздел, "П01504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01506", ТекРаздел, "П01505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01606", ТекРаздел, "П01603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01606", ТекРаздел, "П01604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01606", ТекРаздел, "П01605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01706", ТекРаздел, "П01703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01706", ТекРаздел, "П01704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01706", ТекРаздел, "П01705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01806", ТекРаздел, "П01803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01806", ТекРаздел, "П01804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01806", ТекРаздел, "П01805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01906", ТекРаздел, "П01903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01906", ТекРаздел, "П01904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01906", ТекРаздел, "П01905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02106", ТекРаздел, "П02103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02106", ТекРаздел, "П02104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02106", ТекРаздел, "П02105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02206", ТекРаздел, "П02203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02206", ТекРаздел, "П02204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02206", ТекРаздел, "П02205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02306", ТекРаздел, "П02303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02306", ТекРаздел, "П02304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02306", ТекРаздел, "П02305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02406", ТекРаздел, "П02403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02406", ТекРаздел, "П02404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02406", ТекРаздел, "П02405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02506", ТекРаздел, "П02503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02506", ТекРаздел, "П02504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02506", ТекРаздел, "П02505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02606", ТекРаздел, "П02603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02606", ТекРаздел, "П02604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02606", ТекРаздел, "П02605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02906", ТекРаздел, "П02903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02906", ТекРаздел, "П02904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П02906", ТекРаздел, "П02905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03006", ТекРаздел, "П03003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03006", ТекРаздел, "П03004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03006", ТекРаздел, "П03005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03106", ТекРаздел, "П03103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03106", ТекРаздел, "П03104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03106", ТекРаздел, "П03105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03206", ТекРаздел, "П03203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03206", ТекРаздел, "П03204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03206", ТекРаздел, "П03205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03306", ТекРаздел, "П03303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03306", ТекРаздел, "П03304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03306", ТекРаздел, "П03305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03406", ТекРаздел, "П03403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03406", ТекРаздел, "П03404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03406", ТекРаздел, "П03405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03506", ТекРаздел, "П03503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03506", ТекРаздел, "П03504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03506", ТекРаздел, "П03505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03606", ТекРаздел, "П03603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03606", ТекРаздел, "П03604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03606", ТекРаздел, "П03605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03706", ТекРаздел, "П03703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03706", ТекРаздел, "П03704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03706", ТекРаздел, "П03705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03806", ТекРаздел, "П03803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03806", ТекРаздел, "П03804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03806", ТекРаздел, "П03805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03906", ТекРаздел, "П03903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03906", ТекРаздел, "П03904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П03906", ТекРаздел, "П03905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04006", ТекРаздел, "П04003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04006", ТекРаздел, "П04004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04006", ТекРаздел, "П04005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04206", ТекРаздел, "П04203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04206", ТекРаздел, "П04204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04206", ТекРаздел, "П04205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04306", ТекРаздел, "П04303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04306", ТекРаздел, "П04304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04306", ТекРаздел, "П04305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04406", ТекРаздел, "П04403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04406", ТекРаздел, "П04404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04406", ТекРаздел, "П04405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04506", ТекРаздел, "П04503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04506", ТекРаздел, "П04504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04506", ТекРаздел, "П04505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04606", ТекРаздел, "П04603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04606", ТекРаздел, "П04604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04606", ТекРаздел, "П04605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04706", ТекРаздел, "П04703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04706", ТекРаздел, "П04704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04706", ТекРаздел, "П04705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04806", ТекРаздел, "П04803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04806", ТекРаздел, "П04804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04806", ТекРаздел, "П04805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04906", ТекРаздел, "П04903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04906", ТекРаздел, "П04904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П04906", ТекРаздел, "П04905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05006", ТекРаздел, "П05003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05006", ТекРаздел, "П05004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05006", ТекРаздел, "П05005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05106", ТекРаздел, "П05103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05106", ТекРаздел, "П05104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05106", ТекРаздел, "П05105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05306", ТекРаздел, "П05303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05306", ТекРаздел, "П05304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05306", ТекРаздел, "П05305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05406", ТекРаздел, "П05403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05406", ТекРаздел, "П05404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05406", ТекРаздел, "П05405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05506", ТекРаздел, "П05503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05506", ТекРаздел, "П05504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05506", ТекРаздел, "П05505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05606", ТекРаздел, "П05603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05606", ТекРаздел, "П05604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05606", ТекРаздел, "П05605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05706", ТекРаздел, "П05703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05706", ТекРаздел, "П05704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05706", ТекРаздел, "П05705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05806", ТекРаздел, "П05803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05806", ТекРаздел, "П05804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05806", ТекРаздел, "П05805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05906", ТекРаздел, "П05903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05906", ТекРаздел, "П05904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П05906", ТекРаздел, "П05905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06006", ТекРаздел, "П06003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06006", ТекРаздел, "П06004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06006", ТекРаздел, "П06005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06106", ТекРаздел, "П06103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06106", ТекРаздел, "П06104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06106", ТекРаздел, "П06105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06206", ТекРаздел, "П06203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06206", ТекРаздел, "П06204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06206", ТекРаздел, "П06205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06306", ТекРаздел, "П06303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06306", ТекРаздел, "П06304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06306", ТекРаздел, "П06305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06606", ТекРаздел, "П06603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06606", ТекРаздел, "П06604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06606", ТекРаздел, "П06605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06706", ТекРаздел, "П06703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06706", ТекРаздел, "П06704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06706", ТекРаздел, "П06705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06806", ТекРаздел, "П06803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06806", ТекРаздел, "П06804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06806", ТекРаздел, "П06805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06906", ТекРаздел, "П06903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06906", ТекРаздел, "П06904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П06906", ТекРаздел, "П06905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07006", ТекРаздел, "П07003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07006", ТекРаздел, "П07004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07006", ТекРаздел, "П07005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07106", ТекРаздел, "П07103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07106", ТекРаздел, "П07104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07106", ТекРаздел, "П07105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07206", ТекРаздел, "П07203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07206", ТекРаздел, "П07204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07206", ТекРаздел, "П07205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07306", ТекРаздел, "П07303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07306", ТекРаздел, "П07304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07306", ТекРаздел, "П07305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07606", ТекРаздел, "П07603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07606", ТекРаздел, "П07604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07606", ТекРаздел, "П07605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07706", ТекРаздел, "П07703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07706", ТекРаздел, "П07704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07706", ТекРаздел, "П07705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07806", ТекРаздел, "П07803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07806", ТекРаздел, "П07804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07806", ТекРаздел, "П07805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07906", ТекРаздел, "П07903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07906", ТекРаздел, "П07904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П07906", ТекРаздел, "П07905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08006", ТекРаздел, "П08003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08006", ТекРаздел, "П08004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08006", ТекРаздел, "П08005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08106", ТекРаздел, "П08103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08106", ТекРаздел, "П08104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08106", ТекРаздел, "П08105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08206", ТекРаздел, "П08203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08206", ТекРаздел, "П08204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08206", ТекРаздел, "П08205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08306", ТекРаздел, "П08303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08306", ТекРаздел, "П08304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08306", ТекРаздел, "П08305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08406", ТекРаздел, "П08403", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08406", ТекРаздел, "П08404", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08406", ТекРаздел, "П08405", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08506", ТекРаздел, "П08503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08506", ТекРаздел, "П08504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08506", ТекРаздел, "П08505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08706", ТекРаздел, "П08703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08706", ТекРаздел, "П08704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08706", ТекРаздел, "П08705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08806", ТекРаздел, "П08803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08806", ТекРаздел, "П08804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08806", ТекРаздел, "П08805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08906", ТекРаздел, "П08903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08906", ТекРаздел, "П08904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08906", ТекРаздел, "П08905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09006", ТекРаздел, "П09003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09006", ТекРаздел, "П09004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09006", ТекРаздел, "П09005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09106", ТекРаздел, "П09103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09106", ТекРаздел, "П09104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09106", ТекРаздел, "П09105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09206", ТекРаздел, "П09203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09206", ТекРаздел, "П09204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09206", ТекРаздел, "П09205", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09306", ТекРаздел, "П09303", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09306", ТекРаздел, "П09304", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09306", ТекРаздел, "П09305", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09506", ТекРаздел, "П09503", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09506", ТекРаздел, "П09504", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09506", ТекРаздел, "П09505", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09606", ТекРаздел, "П09603", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09606", ТекРаздел, "П09604", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09606", ТекРаздел, "П09605", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09706", ТекРаздел, "П09703", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09706", ТекРаздел, "П09704", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09706", ТекРаздел, "П09705", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09806", ТекРаздел, "П09803", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09806", ТекРаздел, "П09804", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09806", ТекРаздел, "П09805", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09906", ТекРаздел, "П09903", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09906", ТекРаздел, "П09904", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П09906", ТекРаздел, "П09905", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10006", ТекРаздел, "П10003", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10006", ТекРаздел, "П10004", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10006", ТекРаздел, "П10005", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10106", ТекРаздел, "П10103", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10106", ТекРаздел, "П10104", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10106", ТекРаздел, "П10105", 1);

	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10206", ТекРаздел, "П10203", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10206", ТекРаздел, "П10204", 1);
	ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П10206", ТекРаздел, "П10205", 1);

	Для НомКол = 3 По 7 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П003" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П004" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П005" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П006" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П002" + СтрНомКол, ТекРаздел, "П007" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П008" + СтрНомКол, ТекРаздел, "П009" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П008" + СтрНомКол, ТекРаздел, "П010" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П008" + СтрНомКол, ТекРаздел, "П011" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П008" + СтрНомКол, ТекРаздел, "П012" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П014" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П015" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П016" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П017" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П018" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П013" + СтрНомКол, ТекРаздел, "П019" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П021" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П022" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П023" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П024" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П025" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П020" + СтрНомКол, ТекРаздел, "П026" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П029" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П030" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П031" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П032" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П033" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П034" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П035" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П036" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П037" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П038" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П039" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П028" + СтрНомКол, ТекРаздел, "П040" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П042" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П043" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П044" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П045" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П046" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П047" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П048" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П049" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П050" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П041" + СтрНомКол, ТекРаздел, "П051" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П028" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П027" + СтрНомКол, ТекРаздел, "П041" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П052" + СтрНомКол, ТекРаздел, "П053" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П052" + СтрНомКол, ТекРаздел, "П054" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П052" + СтрНомКол, ТекРаздел, "П055" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П052" + СтрНомКол, ТекРаздел, "П056" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П002" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П008" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П013" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П020" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П027" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П052" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П057" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П058" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П059" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П060" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П061" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П062" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П001" + СтрНомКол, ТекРаздел, "П063" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П066" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П067" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П068" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П069" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П070" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П071" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П065" + СтрНомКол, ТекРаздел, "П072" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П076" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П077" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П078" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П079" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П080" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П081" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П082" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П083" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П084" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П075" + СтрНомКол, ТекРаздел, "П085" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П087" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П088" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П089" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П090" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П091" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П092" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П086" + СтрНомКол, ТекРаздел, "П093" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П074" + СтрНомКол, ТекРаздел, "П075" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П074" + СтрНомКол, ТекРаздел, "П086" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П095" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П096" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П094" + СтрНомКол, ТекРаздел, "П097" + СтрНомКол, 1);

		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П065" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П073" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П074" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П094" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П098" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П099" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П100" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П101" + СтрНомКол, 1);
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П064" + СтрНомКол, ТекРаздел, "П102" + СтрНомКол, 1);
	КонецЦикла;	

КонецПроцедуры

// 67.1 
&НаСервере
Процедура РасчетРаздела_ФинансовыеИнструментыПодлежащиеВзаимозачетуСК(ТекРаздел, ИмяРаздела)
	
	Для НомСтр = 2 По 11 Цикл
		Если НомСтр = 8 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрНомСтр = Формат(НомСтр, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомКол = 3 По 7 Цикл
			МассивЯчеек.Добавить("П" + СтрНомСтр + Формат(НомКол, "ЧЦ=2; ЧВН="));	
		КонецЦикла;
		
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П" + СтрНомСтр + "08", ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;

	Для НомКол = 3 По 8 Цикл
		СтрНомКол = Формат(НомКол, "ЧЦ=2; ЧВН=");
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 2 По 7 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П01" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
		
		МассивЯчеек = Новый Массив;
		Для НомСтр = 9 По 11 Цикл
			МассивЯчеек.Добавить("П" + Формат(НомСтр, "ЧЦ=2; ЧВН=") + СтрНомКол);	
		КонецЦикла;
		ДобавитьЗначениеВИтоговуюЯчейку(ИмяРаздела, ТекРаздел, "П08" + СтрНомКол, ТекРаздел, МассивЯчеек, 1);
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область НастройкиОтчета

&НаКлиенте
Процедура ОткрытьФормуНастроекЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЕдиницаИзмерения 			= ДополнительныеПараметры.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= ДополнительныеПараметры.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= ДополнительныеПараметры.ВалютаДокумента;
	ИсходныйПодписант 			= ДополнительныеПараметры.Подписант;
	ОтчетНаКонецПрошлогоГода	= ДополнительныеПараметры.ОтчетНаКонецПрошлогоГода;
	
	Если ЕдиницаИзмерения <> СтруктураРеквизитовФормы.ЕдиницаИзмерения Тогда
		
		ЕдиницаИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ТочностьЕдиницыИзмерения <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		
		ТочностьЕдиницыИзмеренияПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ВалютаДокумента <> СтруктураРеквизитовФормы.ВалютаДокумента Тогда
		
		ВалютаДокументаПриИзменении();
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ИсходныйПодписант <> ЭтаФорма.Подписант Тогда
		
		КонсолидированнаяОтчетностьКлиент.ЗаполнитьПодписантаРегламентированногоОтчета(ЭтаФорма);
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ОтчетНаКонецПрошлогоГода <> СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
	Модифицированность = Истина;
	
	СтруктураОтбора = Новый Структура("ИмяРаздела", СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ЭтаФорма.ТабличныйДокумент = ЭтаФорма.РазделыОтчета.НайтиСтроки(СтруктураОтбора)[0].ТабличныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении()
	
	ПроверитьТочность();
	
	УстановитьФорматВывода();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВывода()

	КонсолидированнаяОтчетность.УстановитьФорматВывода(СтруктураРеквизитовФормы, мТаблицаСоставПоказателей, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении()
	
	ТекстСообщения = НСтр("ru = 'Изменена валюта представления отчетности.
	|Перезаполнить документ?'");
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения(
	"ВалютаДокументаПриИзмененииЗавершение",
	ЭтотОбъект),
	ТекстСообщения,
	РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвто();
	КонецЕсли;
	
	ЗаполнитьДенежныйПоказательСРазмерностью();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в рублях точность не может превышать 2 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в тысячах рублей точность не может превышать 3 знака'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			ТекстСообщения = НСтр("ru = 'При выводе сумм в миллионах рублей точность не может превышать 6 знаков'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьТочность()
	
#КонецОбласти 

#Область ЗаписьОтчета

&НаКлиенте
Процедура СохранитьНаКлиенте(ВыполняемоеОповещение=Неопределено) Экспорт

	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ИмяСобытия = "ЗаписьРегламентированногоОтчета";
	Иначе
		ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета";
	КонецЕсли; 
	
	ЗаполнитьПоказатели();
	ЗаписатьНаСервере();
	
	Если ЗначениеЗаполнено(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
	
		Модифицированность = Ложь;
	
		ИсторияРаботыПользователя.Добавить(ЭтаФорма.СтруктураРеквизитовФормы.мСохраненныйДок);
		
		Оповестить(ИмяСобытия, Новый Структура("Ключ", СтруктураРеквизитовФормы.мСохраненныйДок));
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонсолидированнаяОтчетность.ЗаписатьОтчет(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьПоказатели()

	ЭтаФорма.Показатели.Очистить();
		
	Для Каждого ТекСтрока Из РазделыОтчета Цикл
		
		Попытка
			ОбластиРаздела = ТекСтрока.ТабличныйДокумент.Области;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Для Каждого ТекОбласть Из ОбластиРаздела Цикл
			
			Если Не ТекОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Если Не ТекОбласть.СодержитЗначение Тогда
					Продолжить;
				КонецЕсли;
			Исключение
				ТекстСообщения = "Ошибка макета: раздел " + ТекСтрока.ИмяРаздела + " область " + ТекОбласть.Имя + " не содержит значение!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ТекОбласть.Значение) Тогда
			
				Продолжить;
			
			КонецЕсли; 
			
			НоваяСтрока = ЭтаФорма.Показатели.Добавить();
			НоваяСтрока.ИмяРаздела 		= ТекСтрока.ИмяРаздела;
			НоваяСтрока.ИмяПоказателя 	= ТекОбласть.Имя;
			НоваяСтрока.Значение 		= ТекОбласть.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Показатели.Сортировать("ИмяРаздела, ИмяПоказателя");
	
КонецПроцедуры

#КонецОбласти 

#Область Расшифровка

&НаКлиенте
Процедура РасшифровкаНажатиеВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Адрес_Расшифровка 	= ДополнительныеПараметры.Адрес_Расшифровка;
	ИмяРаздела 			= ДополнительныеПараметры.ИмяРаздела;
	
	ИмяЯчейки = "";
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатиеЗавершение(Знач Адрес_Расшифровка, Знач ИмяРаздела, ИмяЯчейки)
	
	СтруктураПараметров = Новый Структура(
	"Адрес_Расшифровка,
	|Адрес_СтруктураВариантыЗаполнения,
	|ОсобыйАлгоритмРасшифровки",
	Адрес_Расшифровка,
	Адрес_мСтруктураВариантыЗаполнения,
	Истина);
	
	ТабДок = КонсолидированнаяОтчетность.СформироватьМакетРасшифровки(ИмяРаздела, ИмяЯчейки, СтруктураПараметров);
	
	ВывестиРасшифровкуСервер(ТабДок, ИмяЯчейки);
	
	Элементы.ГруппаРасшифровки.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка)
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Адрес_ТаблицаРасшифровки);
	
	НайденныеСтроки = ТаблицаРасшифровки.НайтиСтроки(Новый Структура("ИмяЯчейки, Раздел", ИмяЯчейки, ИмяРаздела));
	
	ЕстьРасшифровка = (Не НайденныеСтроки.Количество() = 0);
		
	СтруктураОтбора = Новый Структура("Раздел, ИмяЯчейки", ИмяРаздела, ИмяЯчейки);
	пТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(СтруктураОтбора);
	
	Если пТаблицаРасшифровки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Адрес_Расшифровка = ПоместитьВоВременноеХранилище(пТаблицаРасшифровки, УникальныйИдентификатор);
	
	Возврат ЕстьРасшифровка;
	
КонецФункции

&НаСервере
Процедура ВывестиРасшифровкуСервер(ТабДок, ИмяСтраницы)
	
	КоличествоРасшифровок = КоличествоРасшифровок + 1;
	НомерСтраницы = Формат(КоличествоРасшифровок, "ЧГ=0");
	ИмяСтраницы = ?(ИмяСтраницы = "", "Расшифровка № " + КоличествоРасшифровок, ИмяСтраницы);
	
	ИмяЭлемента = "СтраницаРасшифровки" + НомерСтраницы;
	ТекСтраница = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Элементы.СтраницыРасшифровки);
	ТекСтраница.Заголовок = ИмяСтраницы;
	
	ИмяЭлемента = "ТабДок_Расшифровка" + НомерСтраницы;
	
	МассивДобавляемых = Новый Массив;
	МассивДобавляемых.Добавить(Новый РеквизитФормы(ИмяЭлемента, Новый ОписаниеТипов("ТабличныйДокумент")));
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ТекЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ТекСтраница);
	ТекЭлемент.ПутьКДанным = ИмяЭлемента;
	ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ТекЭлемент.ГоризонтальнаяПолосаПрокрутки = Ложь;
	
	ЭтотОбъект[ИмяЭлемента] = ТабДок;
	
	Элементы.СтраницыРасшифровки.ТекущаяСтраница = ТекСтраница;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьРасшифровкуСервер()
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекРасшифровка = Элементы.СтраницыРасшифровки.ТекущаяСтраница;
	СтраницыРасшифровки = Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы;
	
	Если ТекРасшифровка = Неопределено Тогда
		ТекРасшифровка = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
	КонецЕсли;
	
	ТекРасшифровка.Видимость = Ложь;
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемых.Добавить(ТекРасшифровка.ПодчиненныеЭлементы[0].ПутьКДанным);
	ИзменитьРеквизиты( , МассивУдаляемых);
	
	Элементы.Удалить(ТекРасшифровка);
	
	Если Элементы.СтраницыРасшифровки.ПодчиненныеЭлементы.Количество() = 0 Тогда
		
		Элементы.ГруппаРасшифровки.Видимость = Ложь;
		
	ИначеЕсли Элементы.СтраницыРасшифровки.ТекущаяСтраница = Неопределено Тогда
		
		Элементы.СтраницыРасшифровки.ТекущаяСтраница = СтраницыРасшифровки[СтраницыРасшифровки.Количество() - 1];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьНажатие(Команда)
	
	ЗаполнитьАвто();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	ЗаполнитьАвто(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНажатие(Команда)
	
	Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗакладкуНажатие(Команда)
	
	ИмяРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Очистить(ИмяРаздела);
	
	Если Не ВРег(ИмяРаздела) = ВРег(ИмяОсновногоРаздела) Тогда
		
		Очистить(ИмяОсновногоРаздела);
		Выполнить("Подключаемый_ЗаполнитьРаздел_" + ИмяОсновногоРаздела + "()");
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для продолжения необходимо сохранить документ.");
		Возврат;
	
	КонецЕсли; 
	
	ИмяФайла = "Бухгалтерский баланс на " + Формат(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазделовПредыдущегоГода = КонсолидированнаяОтчетность.ПолучитьСписокРазделовПредыдущегоГода("РегламентированныйОтчетБаланс", СтруктураРеквизитовФормы.мВыбраннаяФорма, СтруктураРеквизитовФормы.НКО);
	
	КонсолидированнаяОтчетностьКлиент.СохранитьРегламентированныйОтчетВExcel(ЭтаФорма, ДиалогСохраненияФайла.ПолноеИмяФайла, ЭтаФорма.СохраняемыеРазделы, СписокРазделовПредыдущегоГода, ЭтаФорма.ВыводитьСопоставимыеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНаКлиенте();
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	СтруктураНаименованийОтчета = КонсолидированнаяОтчетность.ПолучитьСтруктуруНаименованийОтчета(ИмяФормы);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", 					СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", 			СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("ТочностьЕдиницыИзмерения", 	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	ПараметрыФормы.Вставить("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	ПараметрыФормы.Вставить("ОтчетНаКонецПрошлогоГода", 	СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	ПараметрыФормы.Вставить("Подписант", 					ЭтаФорма.Подписант);
	ПараметрыФормы.Вставить("ИсточникОтчета",				СтруктураНаименованийОтчета.ИсточникОтчета);
	ПараметрыФормы.Вставить("ВыбраннаяФорма",				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	ПараметрыФормы.Вставить("РедакцияФормы",				СтруктураРеквизитовФормы.мРедакцияФормы);
	
	ФормаНастройкиОтчета = ПолучитьФорму("Отчет." + СтруктураНаименованийОтчета.ИсточникОтчета + ".Форма.НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ЕдиницаИзмерения 			= СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ТочностьЕдиницыИзмерения 	= СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	ВалютаДокумента 			= СтруктураРеквизитовФормы.ВалютаДокумента;
	Подписант 					= ЭтаФорма.Подписант;
	ОтчетНаКонецПрошлогоГода = СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода;
	
	ДополнительныеПараметры = Новый Структура("ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода", ЕдиницаИзмерения, ТочностьЕдиницыИзмерения, ВалютаДокумента, Подписант, ОтчетНаКонецПрошлогоГода);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуНастроекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСкрытьПоказать(Команда)
	
	Элементы.ГруппаРасшифровки.Видимость = Не Элементы.ГруппаРасшифровки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНажатие(Команда)
	
	ИмяРаздела = ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Если ИмяРаздела = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяЯчейки = ЭтаФорма.ТабличныйДокумент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Адрес_Расшифровка = "";
	
	// Считываем и помещаем данные на сервере
	РасшифровкаНайдена = РасшифровкаСервер(ИмяРаздела, ИмяЯчейки, Адрес_Расшифровка);
	
	Если РасшифровкаНайдена = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Расшифровка не сформирована.
		|Расшифровка формируется при нажатии на кнопку ""Заполнить"".'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	Если НЕ РасшифровкаНайдена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка для выбранной ячейки не существует.'"));
		
		Возврат;
		
		ТекстСообщения = НСтр("ru = 'Расшифровка для выбранной ячейки не существует.
		|Показать расшифровку для всех ячеек раздела?");
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения(
		"РасшифровкаНажатиеВопросЗавершение",
		ЭтотОбъект,
		Новый Структура(
		"Адрес_Расшифровка,
		|ИмяРаздела",
		Адрес_Расшифровка,
		ИмяРаздела)),
		ТекстСообщения,
		РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РасшифровкаНажатиеЗавершение(Адрес_Расшифровка, ИмяРаздела, ИмяЯчейки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРасшифровкуНажатие(Команда)
	
	ЗакрытьРасшифровкуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.СтатусОтчета = "Корректировка" Тогда
		Элементы.НомерКорректировки.Видимость = Истина;
		ИсточникОтчета = КонсолидированнаяОтчетность.ИсточникОтчета(ЭтаФорма.ИмяФормы);
		ЭтаФорма.НомерКорректировки = ПолучитьНомерКорректировки(ЭтаФорма.СтруктураРеквизитовФормы, ИсточникОтчета);
	Иначе
		Элементы.НомерКорректировки.Видимость = Ложь;
		ЭтаФорма.НомерКорректировки = 0;
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерКорректировки(СтруктураРеквизитовФормы, ИсточникОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕстьNULL(МАКСИМУМ(РегламентированныйОтчет.НомерКорректировки), 0) КАК НомерКорректировки
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация
		|	И РегламентированныйОтчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
		|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
		|	И РегламентированныйОтчет.ВалютаДокумента = &ВалютаДокумента
		|	И РегламентированныйОтчет.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И РегламентированныйОтчет.ТочностьЕдиницыИзмерения = &ТочностьЕдиницыИзмерения
		|	И РегламентированныйОтчет.ОтчетНаКонецПрошлогоГода = &ОтчетНаКонецПрошлогоГода
		|	И РегламентированныйОтчет.ОтчетЗаПоследнийКвартал = &ОтчетЗаПоследнийКвартал
		|	И РегламентированныйОтчет.ВыбраннаяФорма = &ВыбраннаяФорма
		|	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
		|	И РегламентированныйОтчет.СтатусОтчета = &СтатусОтчета";
	
	Запрос.УстановитьПараметр("ВалютаДокумента", 				СтруктураРеквизитовФормы.ВалютаДокумента);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", 				СтруктураРеквизитовФормы.мВыбраннаяФорма);
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 					НачалоДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", 				СтруктураРеквизитовФормы.ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ИсточникОтчета", 				ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", 					СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ОтчетЗаПоследнийКвартал", 		Ложь);
	Запрос.УстановитьПараметр("ОтчетНаКонецПрошлогоГода", 		СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода);
	Запрос.УстановитьПараметр("СтатусОтчета", 					"Корректировка");
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СтруктураРеквизитовФормы.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТочностьЕдиницыИзмерения", 		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерКорректировки = 0;
	Если Выборка.Следующий() Тогда
		НомерКорректировки = Выборка.НомерКорректировки;
	КонецЕсли;
	Возврат НомерКорректировки + 1;		
		
КонецФункции

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиВарианта(Команда)
	
	ДанныеВарианта = ОткрытьФормуМодально("ОбщаяФорма.ФормаНастройкиСохраняемыхРазделов",
							Новый Структура("СохраняемыеРазделы", ЭтаФорма.СохраняемыеРазделы));
	
	Если ДанныеВарианта = Неопределено ИЛИ ДанныеВарианта = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.СохраняемыеРазделы			= ДанныеВарианта.СохраняемыеРазделы;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.СохранитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьСохраняемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетБаланс", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		СохранитьВариантНастроекНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВариантНастроекНаСервере()
	КонсолидированнаяОтчетность.ЗагрузитьВариантНастроек(ЭтаФорма, "Отчет.РегламентированныйОтчетБаланс");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВариантНастроек(Команда)
	
	ВыборНастроек = РаботаСФормамиКлиент.ВыбратьЗагружаемыеНастройкиИзХранилищаВариантовИНастроекОтчетов("Отчет.РегламентированныйОтчетБаланс", ЭтаФорма.КлючТекущихНастроек);
	
	Если ТипЗнч(ВыборНастроек) = Тип("ВыборНастроек") Тогда
		
		ЗагрузитьВариантНастроекНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

