
&НаСервереБезКонтекста
Функция ДобавитьРабочиеДниКДате(Дата, КоличествоДней)
	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Дата, КоличествоДней + 1);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", Параметры.ФильтрПоСчетуДоверительногоУправления);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.ФильтрПоОрганизации);
	
	ЭтаФорма.СчетДоверительногоУправления = Параметры.ФильтрПоСчетуДоверительногоУправления;
	ЭтаФорма.Организация                  = Параметры.ФильтрПоОрганизации;
	
	ЭтаФорма.ДатаРегистрации    = ТекущаяДата();
	ЭтаФорма.ДатаОтбораСпискаОт = ДобавитьМесяц(?(ЗначениеЗаполнено(Параметры.ФильтрПоДатеОперации), Параметры.ФильтрПоДатеОперации, Параметры.ФильтрПоДатеДокумента), -1);          	
	ЭтаФорма.ДатаОтбораСпискаДо = ?(ЗначениеЗаполнено(Параметры.ФильтрПоДатеОперации), ДобавитьРабочиеДниКДате(Параметры.ФильтрПоДатеОперации, 2), ДобавитьРабочиеДниКДате(Параметры.ФильтрПоДатеДокумента, 2));

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокДокументовИзЖурналаРегистрации(Команда)
	
	ЗагрузитьДокументыИзЖурналаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	
	ЗагрузитьДокументыИзЖурналаРегистрации();
	
КонецПроцедуры

#Область Интеграция_с_журналом_регистрации_ДК_Регион

&НаКлиенте
Функция ПолучитьТокенАвторизации(АдресСервера, МетодАвторизации, СфераДеятельности, Логин, Пароль)
	
	Результат = Новый Структура;
	
	Попытка
	
		СоединениеHTTP = Новый HTTPСоединение( АдресСервера, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL(), Ложь);
		
		ЗаголовкиHTTP = Новый Соответствие; 	
		ЗаголовкиHTTP.Вставить("content-type", "application/x-www-form-urlencoded");
		
		ТелоЗапросаHTTP = "grant_type=client_credentials&scope=" + СфераДеятельности 
							+ "&client_id=" + Логин + "&client_secret=" + Пароль;

		ЗапросHTTP = Новый HTTPЗапрос(МетодАвторизации, ЗаголовкиHTTP);	
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапросаHTTP, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 	
		        
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки (ЗапросHTTP);    
		 	
		Результат.Вставить("КодСостояния", ОтветHTTP.КодСостояния); 
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
		
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветHTTP.ПолучитьТелоКакСтроку());

			РезультатJSON = ПрочитатьJSON( ЧтениеJSON );
			
			Результат.Вставить("Ошибка", Ложь);
			Результат.Вставить("Токен", РезультатJSON["access_token"]);
			
		Иначе
			
			Результат.Вставить("Ошибка", Истина);
			Результат.Вставить("Содержание", ОтветHTTP.ПолучитьТелоКакСтроку());
			
		КонецЕсли;
		
		Возврат Результат;
	
	Исключение
		
		Результат.Вставить("Ошибка", Истина);
		Результат.Вставить("Содержание", "Исключение при обращении к серверу авторизации ДК Регион " + АдресСервера + 
				"; Метод: " + МетодАвторизации  + Символы.ПС  + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 		
		
		Возврат Результат; 

	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДокументыИзЖурналаРегистрации()
	
	// Бой
	НастройкиПодключения = Новый Структура(
		"СерверАвторизации, МетодАвторизации, Сервер, Метод, Сфера, Логин, Пароль", 
			"auth.dk.region.ru", "connect/token",
			"pif.dk.region.ru",
			"v1.0/invoke/pif-document-registration/method/integration/insurance/document", 	
			"pif", "insurance1c", "tall54*Act*");
	// Тест
	//НастройкиПодключения = Новый Структура(
	//	"СерверАвторизации, МетодАвторизации, Сервер, Метод, Сфера, Логин, Пароль", 
	//		"stg-auth.dk.region.ru", "connect/token",
	//		"stg-pif.dk.region.ru","v1.0/invoke/pif-document-registration/method/integration/insurance/document",
	//		"pif", "insurance1c", "password");
	//
	ТокенРезультат = ПолучитьТокенАвторизации(НастройкиПодключения.СерверАвторизации, НастройкиПодключения.МетодАвторизации, 
						НастройкиПодключения.Сфера, НастройкиПодключения.Логин, НастройкиПодключения.Пароль);
						
	Если ТокенРезультат.Ошибка = Истина Тогда
		 
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось зарегистрироваться на сервере [" + НастройкиПодключения.Сервер 
				+ "] :" + ТокенРезультат.Содержание);
		Возврат;
		
	Иначе
		
		Попытка
		
			НомерДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.СчетДоверительногоУправления, "КодСчета"); 
			
			СоединениеHTTP = Новый HTTPСоединение( НастройкиПодключения.Сервер, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL(), Ложь);
			 
			ЗаголовкиHTTP = Новый Соответствие;
			ЗаголовкиHTTP.Вставить("Authorization", "Bearer " + ТокенРезультат.Токен);
			ЗаголовкиHTTP.Вставить("content-type",  "application/x-www-form-urlencoded");
			
			Метод = НастройкиПодключения.Метод + "?ReceiptDateStart=" + Формат(НачалоДня(ДатаОтбораСпискаОт),"ДФ=""гггг.ММ.дд""") 
							+ "&ReceiptDateEnd=" + Формат(КонецДня(ДатаОтбораСпискаДо),"ДФ=""гггг.ММ.дд""") + "&Contract=" + НомерДоговора; 	
							
			ЗапросHTTP = Новый HTTPЗапрос(Метод, ЗаголовкиHTTP); 	
			
			ОтветHTTP = СоединениеHTTP.Получить( ЗапросHTTP );
			
			Если ОтветHTTP.КодСостояния = 200 Тогда       
			
				ИменаПолейСДатами = Новый Массив();
				ИменаПолейСДатами.Добавить("receiptDate");
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ОтветHTTP.ПолучитьТелоКакСтроку());
				Попытка
					РезультатJSON = ПрочитатьJSON( ЧтениеJSON, Ложь, ИменаПолейСДатами, ФорматДатыJSON.ISO);
					
					ДокументыЖурналаРегистрацииДКРегион.Очистить();
					
					Для Каждого ЭлементМассива из  РезультатJSON Цикл
						
						Документ = ДокументыЖурналаРегистрацииДКРегион.Добавить();
						ЗаполнитьЗначенияСвойств(Документ, ЭлементМассива);
						
					КонецЦикла;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при чтении JSON " + НастройкиПодключения.Сервер +  ":" + Символы.ПС
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				  
			Иначе  
		        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить список документов из журнала регистрации: "
					+  ОтветHTTP.ПолучитьТелоКакСтроку(КодировкаТекста.ANSI));
			КонецЕсли; 
				
		Исключение
						
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при подключении к серверу " + НастройкиПодключения.Сервер +  ":" + Символы.ПС
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			 
		КонецПопытки;

	         	 
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ИмпортироватьДокументИзЖурналаРегистрации(Команда)
	                             
	ДанныеЖР = Элементы.ДокументыЖурналаРегистрацииДКРегион.ТекущиеДанные; 
	
	Если Не ДанныеЖР = Неопределено тогда
		НовыйДокумент = ИмпортироватьДокументИзЖурналаРегистрацииНаСервере(Новый Структура("Код, ТипДокумента, Договор, НомерДокумента, ДатаДокумента, Номер", 
			ДанныеЖР.id, ДанныеЖР.title, ДанныеЖР.contractNumber, ДанныеЖР.documentNumber, ДанныеЖР.receiptDate, ДанныеЖР.incomingNumber));
	КонецЕсли;
		
	Если Не НовыйДокумент = Неопределено Тогда
			
		ОповеститьОВыборе( НовыйДокумент );
			
	КонецЕсли;
		
КонецПроцедуры      

&НаСервере
Функция ИмпортироватьДокументИзЖурналаРегистрацииНаСервере(ДокументЖурналаРегистрации)
	
	Отказ = Ложь;
	
	Если ДокументЖурналаРегистрации.Договор <> СчетДоверительногоУправления.КодСчета Тогда		
		   
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не совпадает код клиента " + СчетДоверительногоУправления.КодСчета
				+ " и номер договора в Журнале регистрации " + ДокументЖурналаРегистрации.Договор);
				
		возврат Неопределено;
				
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов,
		|	КодыВоВнешнихСистемахСрезПоследних.ВнешняяСистема КАК ВнешняяСистема,
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ГруппаОбъектов = &ГруппаОбъектов
		|				И ВнешняяСистема = &ВнешняяСистема
		|				И Код = &Код) КАК КодыВоВнешнихСистемахСрезПоследних";
	
	Запрос.УстановитьПараметр("ГруппаОбъектов", Справочники.ГруппыИмпортируемыхОбъектов.ВходящиеДокументы);
	Запрос.УстановитьПараметр("ВнешняяСистема", Справочники.ВнешниеСистемы.ЖурналРегистрацииДКРегион);
	Запрос.УстановитьПараметр("Код", ДокументЖурналаРегистрации.Код);
	Запрос.УстановитьПараметр("Период", ДатаРегистрации);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Объект; // Документ уже был импортирован.
		
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка	
		
		НовыйДокумент = Документы.ВходящийДокумент.СоздатьДокумент();
		НовыйДокумент.Дата = ДатаРегистрации;
		НовыйДокумент.Номер = ДокументЖурналаРегистрации.Номер;
		НовыйДокумент.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ВходящийДокументДепозитарнойКомпании;
		НовыйДокумент.Организация = ЭтаФорма.Организация;
		НовыйДокумент.Отправитель = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтаФорма.СчетДоверительногоУправления);
		НовыйДокумент.ВидВходящегоДокумента = ДокументЖурналаРегистрации.ТипДокумента;
		НовыйДокумент.НомерВходящегоДокумента = ДокументЖурналаРегистрации.НомерДокумента;
		НовыйДокумент.ДатаВходящегоДокумента  = ДокументЖурналаРегистрации.ДатаДокумента;
		НовыйДокумент.Ответственный = РаботаСПользователями.ТекущийПользователь();
		 		
		НовыйДокумент.Записать();
		
		Договор = НовыйДокумент.Договоры.Добавить();
		Договор.Договор = ЭтаФорма.СчетДоверительногоУправления; 
		НовыйДокумент.Записать();
			
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме( НовыйДокумент.Ссылка,
			Справочники.ВнешниеСистемы.ЖурналРегистрацииДКРегион, 
			Справочники.ГруппыИмпортируемыхОбъектов.ВходящиеДокументы, 
			ДокументЖурналаРегистрации.Код);
			
	    ЗафиксироватьТранзакцию();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Добавлен входящий документ №" + НовыйДокумент.Номер + " на дату " + Формат(НовыйДокумент.Дата, "ДФ=""дд.ММ.гггг"""), НовыйДокумент.Ссылка);  
		
		Возврат НовыйДокумент.Ссылка;
		
	Исключение
		
        ОтменитьТранзакцию();     
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать новый входящий документ. " + ОписаниеОшибки() + "'");
		Возврат Неопределено;
		
	КонецПопытки		
	
КонецФункции

#КонецОбласти