
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Дата			= ТекущаяДатаСеанса();
		
	//##Временно - стереть 
	Объект.ПаевойИнвестиционныйФонд = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОПИФ_РегионДоходныеОблигации");
	Объект.КаталогОбмена = "\\ap69\Developers\Саня\_Разработка\Розница\ДК\";
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	
	КомандаВыгрузитьНаСервере();			
КонецПроцедуры


&НаСервере
Процедура КомандаВыгрузитьНаСервере()
	
	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанные(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗагрузитьНаСервере()

	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьДанные(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	КомандаЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьСверкуЗаявокЗаДень(Команда)
	
	КомандаВыгрузитьСверкуЗаявокЗаДеньНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаВыгрузитьСверкуЗаявокЗаДеньНаСервере()

	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьСверкуЗаявокЗаДень(Ложь);
	
КонецПроцедуры

#КонецОбласти
