&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСекторовЭкономики.Добавить("GOV", "GOV - иностранные государства");
	СписокСекторовЭкономики.Добавить("NCB", "NCB - иностранные центральные банки");
	СписокСекторовЭкономики.Добавить("DTC", "DTC - банки-нерезиденты");
	СписокСекторовЭкономики.Добавить("INS", "INS - иностранные страховые организации и пенсионные фонды");
	СписокСекторовЭкономики.Добавить("MMF", "MMF - инвестиционные фонды - нерезиденты, являющиеся фондами денежного рынка");
	СписокСекторовЭкономики.Добавить("OFC", "OFC - прочие финансовые организации");
	СписокСекторовЭкономики.Добавить("OTH", "OTH - прочие организации-нерезиденты, а также физические лица - нерезиденты");
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы	= Форма.Элементы;
	Запись		= Форма.Запись;
	
	ЭтоСектораЭкономики = (Запись.ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.СектораЭкономики"));
	
	Элементы.ДопКод.Видимость = НЕ ЭтоСектораЭкономики;
	Элементы.ДопКод1.Видимость = НЕ ЭтоСектораЭкономики;
	Элементы.ДопКод0.Видимость = НЕ ЭтоСектораЭкономики;
	
	Элементы.Код.РежимВыбораИзСписка = ЭтоСектораЭкономики;
	
	Элементы.Код.СписокВыбора.Очистить();
	
	Если ЭтоСектораЭкономики Тогда
		Для Каждого ЭлементСписка Из Форма.СписокСекторовЭкономики Цикл
			Элементы.Код.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаОбъектовПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

