
&НаСервере
Процедура ВывестиРеквизитыЮрФизЛицаНаСервере()
	
	РаботаСНормативноСправочнойИнформацией.ВывестиРеквизитыЮрФизЛица(Объект.ЮрФизЛицо, ЭтаФорма, "РеквизитыКонтрагента");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВывестиРеквизитыЮрФизЛицаНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	СкорректироватьЗаголовокФормы(ЭтаФорма, Объект.Регистратор)
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура СкорректироватьЗаголовокФормы(Форма, ЭтоРегистратор)
			
	ТекущийЗаголовок = Форма.Заголовок;
	ПозицияДвоеточия = СтрНайти(ТекущийЗаголовок, ":");
	
	Если ПозицияДвоеточия > 0 Тогда
		НачалоЗаголовка      = Лев(ТекущийЗаголовок, ПозицияДвоеточия);
		НовоеНачалоЗаголовка = ?(ЭтоРегистратор, "Регистратор:", "Депозитарная компания:");
		Форма.Заголовок      = СтрЗаменить(ТекущийЗаголовок, НачалоЗаголовка, НовоеНачалоЗаголовка);
	КонецЕсли;		
	
КонецПроцедуры // СкорректироватьЗаголовокФормы

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ВидыДеятельностиОрганизации"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНаименованиеФункциональнойРоли(Объект);
	
	ВывестиРеквизитыЮрФизЛицаНаСервере();

КонецПроцедуры
