
Процедура ПередЗаписью(Отказ)
	
	// проверки пока отключены т.к. есть косяки в старых корзинах
	// раскоментирую после переноса настроек
	
	//Для каждого СтрокаКорзины Из ЭтотОбъект.Корзина Цикл
	//
	//	Если СтрокаКорзины.ОФЗПК.Подкатегория <> Перечисления.ВидыГосударственныхОблигаций.ОФЗ
	//		ИЛИ СтрокаКорзины.ОФЗПК.Тип <> Перечисления.ТипыОблигаций.КупоннаяПК
	//		ИЛИ СтрокаКорзины.ОФЗПК.ДатаРегистрации > ЭтотОбъект.Дата
	//		ИЛИ СтрокаКорзины.ОФЗПК.ДатаПогашения <= ЭтотОбъект.Дата
	//		ИЛИ СтрокаКорзины.ОФЗПК.Амортизационная Тогда
	//	
	//		Отказ = Истина;
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В корзине разрешены только ОФЗ с переменным купоном, без амортизации номинала, в период действия которых попадает дата " + Строка(ЭтотОбъект.Дата));
	//		
	//		Возврат;
	//	
	//	КонецЕсли;	
	//
	//КонецЦикла;	
	
	//Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
	//	// нельзя записывать, если на него есть ссылки
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//		|	НастройкиФормированияСЧА.Период КАК Период
	//		|ИЗ
	//		|	РегистрСведений.НастройкиФормированияСЧА КАК НастройкиФормированияСЧА
	//		|ГДЕ
	//		|	НастройкиФормированияСЧА.КорзинаОФЗПК = &КорзинаОФЗПК";
	//	
	//	Запрос.УстановитьПараметр("КорзинаОФЗПК", ЭтотОбъект.Ссылка);
	//	
	//	Отказ = НЕ Запрос.Выполнить().Пустой();
	//	
	//    Если Отказ Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять корзину ОФЗ-ПК т.к. она уже была установлена в настройках");
	//	КонецЕсли;
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	
	РаботаСоСправочниками.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
КонецПроцедуры
