#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период        = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		Объект.КаталогФайлов = ПолучитьКаталогФайлов(Объект.Организация, Объект.Период, Объект.КаталогФайлов);
	КонецЕсли;
	
	//пометка - добавить в АктивныеСчетаДоверительногоУправления
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма520", "520 - Выписка по расчетному счету"								, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма522", "522 - Биржевой отчет брокера"									, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма527", "527 - Платежные документы"										, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма530", "530 - Подтверждения МНО и депозитов"								, Истина);	
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма029", "029 - Сверка СЧА"												, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма685", "685 - Активы, составляющие ПИФ"									, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма301", "301 - Сверка стоимости активов компенсационного фонда"			, Ложь);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма233", "233 - Сведения о составе аффилированных лиц"						, Ложь);	
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма922", "922 - Сведения о собственных средствах и активах в управлении"	, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма923", "923 - Сведения о доходности ПФР"									, Истина);
	ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить("Форма220", "220 - Сведения о минимальной достаточности и активах ПФР"		, Истина);
	// Если форма становится неиспользуемой, то надо добавить её в список "НеиспользуемыеФормы"
	//	по аналогии с тем, как используемые формы добавляются в список "ФормыПервичныхДокументовСЭД"
	
	// создадим реквизиты формы
	НовыеРеквизитыФормы = Новый Массив;
	
	// Определим список форм, для которых элементы нужно создать в любом случае (даже если форма без пометки)
	СписокФормДляСозданияЭлементов = Новый Массив;
	СписокФормДляСозданияЭлементов.Добавить("Форма301");
	
	Для Каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		ДобавитьРеквизитФормыНаСервере(ФормаПервичныхДокументовСЭД, НовыеРеквизитыФормы, СписокФормДляСозданияЭлементов);	
	КонецЦикла;
	
	Если НовыеРеквизитыФормы.Количество() > 0 Тогда
		ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизитыФормы, Новый Массив);
	КонецЕсли;
	
	// создадим элементы управления, соотв. новым реквизитам формы
	Для Индекс = 0 По ЭтаФорма.ФормыПервичныхДокументовСЭД.Количество() - 1 Цикл
		ДобавитьЭлементыФормыНаСервере(ЭтаФорма.ФормыПервичныхДокументовСЭД[Индекс], СписокФормДляСозданияЭлементов, ?(Индекс < 6, "ГруппаФормыПерваяКолонка", "ГруппаФормыВтораяКолонка"));				
	КонецЦикла;
	
	ЗаполнитьСписокКонтактныхЛиц();
	
	ЭтаФорма.ВидФормы233 = "АффилированныеЛица";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьИДоступность();	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура Подключаемый_ФлажкиФормПриИзменении(Элемент)
	
	Элементы["АктивныеСчетаДоверительногоУправления" + Элемент.Имя].Видимость = ЭтаФорма[Элемент.Имя];
	ТекЭлементСпискаФорм = ЭтаФорма.ФормыПервичныхДокументовСЭД.НайтиПоЗначению(Элемент.Имя);
	Если ТекЭлементСпискаФорм <> Неопределено И ЭтаФорма[Элемент.Имя] Тогда
		ТекЭлементСпискаФорм.Пометка = Истина;
	КонецЕсли;
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииФорма233(Элемент)
	
	Элементы.ГруппаНастройкиСпискаЛиц.Видимость = ЭтаФорма.Форма233;
	Элементы.ГруппаПодписант.Видимость = Не ЭтаФорма.Форма233;
	
	Для Каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		
		Если ФормаПервичныхДокументовСЭД.Значение <> Элемент.Имя Тогда
			
			ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение] = НЕ ЭтаФорма[Элемент.Имя];
			
			Если Элементы.Найти("АктивныеСчетаДоверительногоУправления" + ФормаПервичныхДокументовСЭД.Значение) <> Неопределено Тогда
				Элементы["АктивныеСчетаДоверительногоУправления" + ФормаПервичныхДокументовСЭД.Значение].Видимость = ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЭтаФорма.Форма233 Тогда
		Объект.КаталогФайлов = "";
	ИначеЕсли ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		Объект.КаталогФайлов = ПолучитьКаталогФайлов(Объект.Организация, Объект.Период, Объект.КаталогФайлов);
	КонецЕсли;
	
	Элементы.ГруппаОтветственныеДляФормы685.Видимость = ЭтаФорма.Форма685;
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииФорма220(Элемент)
	
	Элементы.ГруппаПодписант.Видимость = ЭтаФорма.Форма220;
	
	Подключаемый_ФлажкиФормПриИзменении(Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииФорма685(Элемент)
	
	Элементы.ГруппаОтветственныеДляФормы685.Видимость = ЭтаФорма.Форма685;
	Элементы.ГруппаНастройкиСпискаЛиц.Видимость = ЭтаФорма.Форма233;
	
	Элементы["АктивныеСчетаДоверительногоУправления" + Элемент.Имя].Видимость = ЭтаФорма[Элемент.Имя];
	ТекЭлементСпискаФорм = ЭтаФорма.ФормыПервичныхДокументовСЭД.НайтиПоЗначению(Элемент.Имя);
	Если ТекЭлементСпискаФорм <> Неопределено И ЭтаФорма[Элемент.Имя] Тогда
		ТекЭлементСпискаФорм.Пометка = Истина;
	КонецЕсли;
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность();
	ОбновитьАктивныеСчетаДоверительногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивныеСчетаДоверительногоУправленияПередНачаломИзменения(Элемент, Отказ)

	ТекущиеДанные = Элементы.АктивныеСчетаДоверительногоУправления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.АктивныеСчетаДоверительногоУправления.ТекущийЭлемент = Элементы.АктивныеСчетаДоверительногоУправленияСчетДоверительногоУправления Тогда
		Отказ = Истина;
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	Попытка
			
		ОбновитьАктивныеСчетаДоверительногоУправления();
			
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспортировать(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЭкспортировать");
	Попытка
		
		ВыполнитьКомандаЭкспортировать(ПараметрыСессии, Команда);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьФлажки");
	Попытка
		
		ВыполнитьКомандаУстановитьФлажки(ПараметрыСессии, Команда);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьФлажки");
	Попытка
		
		ВыполнитьКомандаСнятьФлажки(ПараметрыСессии, Команда);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(Объект.КаталогФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.КаталогФайлов;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.КаталогФайлов = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаСоСписокомЛицНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ЭтаФорма.ВидФормы233 = "АффилированныеЛица" Тогда
		Диалог.Фильтр				= "Файл ""XML"" (*.xml)|*.xml";
		Диалог.Заголовок			= "Файл со списком аффилированных лиц:"; 
	ИначеЕсли ЭтаФорма.ВидФормы233 = "СвязанныеЛица" Тогда
		Диалог.Фильтр				= "Файл ""Excel"" (*.xlsx)|*.xlsx";
		Диалог.Заголовок			= "Файл со списком связанных лиц:"; 
	КонецЕсли;		
		
	Диалог.ПолноеИмяФайла		= ИмяФайлаСоСписокомЛиц;
	Диалог.МножественныйВыбор	= Ложь; 
	
	Если Диалог.Выбрать() Тогда 
		ИмяФайлаСоСписокомЛиц = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РезультатВыбора = СписокКонтактныхЛиц.ВыбратьЭлемент();
	
	Если РезультатВыбора <> Неопределено Тогда
		ЗаполнитьФИО(РезультатВыбора.Значение, Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительПИФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РезультатВыбора = СписокКонтактныхЛиц.ВыбратьЭлемент();
	
	Если РезультатВыбора <> Неопределено Тогда
		ЗаполнитьФИО(РезультатВыбора.Значение, Объект.Организация, "РуководительПИФ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНеиспользуемыеПриИзменении(Элемент)
	
	Если ПоказатьНеиспользуемые Тогда
		
		Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
			ЭтаФорма.ФормыПервичныхДокументовСЭД.Добавить(НеиспользуемаяФорма.Значение, НеиспользуемаяФорма.Представление, Истина);
		КонецЦикла;
		
		ОбработатьНеиспользуемыеЭлементыНаСервере(ПоказатьНеиспользуемые);
		
	Иначе  		
		
		Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
			ЭтаФорма.ФормыПервичныхДокументовСЭД.Удалить(ЭтаФорма.ФормыПервичныхДокументовСЭД.НайтиПоЗначению(НеиспользуемаяФорма.Значение));
		КонецЦикла;	
		
		ОбработатьНеиспользуемыеЭлементыНаСервере(ПоказатьНеиспользуемые);
		
	КонецЕсли;
	
	ОбновитьАктивныеСчетаДоверительногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УполномоченноеЛицоСДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокДляВыбора = КонтактныеЛицаСД(Объект.Период, Объект.Организация);
	РезультатВыбора = СписокДляВыбора.ВыбратьЭлемент();
	
	Если РезультатВыбора <> Неопределено Тогда
		УполномоченноеЛицоСД = РезультатВыбора		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидФормы233ПриИзменении(Элемент)
	
	ЭтаФорма.ИмяФайлаСоСписокомЛиц = "";
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()
	
	ЭтоКонецКвартала = КонецДня(Объект.Период) = КонецКвартала(Объект.Период);
	ЭтаФорма.Форма923 													= ЭтоКонецКвартала;
	Элементы.АктивныеСчетаДоверительногоУправленияФорма923.Видимость 	= ЭтоКонецКвартала; 
	
	ЭтаФорма.Форма922 													= ЭтоКонецКвартала;
	Элементы.АктивныеСчетаДоверительногоУправленияФорма922.Видимость 	= ЭтоКонецКвартала; 
	
	ЭтаФорма.Форма220 													= ЭтоКонецКвартала;
	Элементы.АктивныеСчетаДоверительногоУправленияФорма220.Видимость 	= ЭтоКонецКвартала; 
	Элементы.ГруппаПодписант.Видимость									= ЭтоКонецКвартала;
	
КонецПроцедуры
	
&НаСервере
Процедура ДобавитьРеквизитФормыНаСервере(ФормаПервичныхДокументовСЭД, НовыеРеквизитыФормы, СписокФормДляСозданияЭлементов = Неопределено)
	
	НовыеРеквизитыФормы.Добавить(Новый РеквизитФормы(ФормаПервичныхДокументовСЭД.Значение, Новый ОписаниеТипов("Булево")));
	Если ФормаПервичныхДокументовСЭД.Пометка 
		Или (СписокФормДляСозданияЭлементов <> Неопределено И СписокФормДляСозданияЭлементов.Найти(ФормаПервичныхДокументовСЭД.Значение) <> Неопределено) Тогда
		НовыеРеквизитыФормы.Добавить(Новый РеквизитФормы(ФормаПервичныхДокументовСЭД.Значение, Новый ОписаниеТипов("Булево"), "АктивныеСчетаДоверительногоУправления"));
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьНеиспользуемыеЭлементыНаСервере(Показать)
	
	Если Показать Тогда
		
		НовыеРеквизитыФормы = Новый Массив;
		
		Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
			НоваяФорма = ЭтаФорма.ФормыПервичныхДокументовСЭД.НайтиПоЗначению(НеиспользуемаяФорма.Значение);			
			ДобавитьРеквизитФормыНаСервере(НоваяФорма, НовыеРеквизитыФормы);
		КонецЦикла;
		
		Если НовыеРеквизитыФормы.Количество() > 0 Тогда
			ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизитыФормы, Новый Массив);
		КонецЕсли;
		
		Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
			ДобавитьЭлементыФормыНаСервере(НоваяФорма,,"ГруппаНеиспользуемыеФормы");
		КонецЦикла;
		
	Иначе
		
		УдаляемыеРеквизиты = Новый Массив;
		
		Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
			ЭтаФорма.Элементы.Удалить(ЭтаФорма.Элементы[НеиспользуемаяФорма.Значение]);
			ЭтаФорма.Элементы.Удалить(ЭтаФорма.Элементы["АктивныеСчетаДоверительногоУправления" + СокрЛП(НеиспользуемаяФорма.Значение)]);
			
			УдаляемыеРеквизиты.Добавить(НеиспользуемаяФорма.Значение);
			УдаляемыеРеквизиты.Добавить("АктивныеСчетаДоверительногоУправления."+ СокрЛП(НеиспользуемаяФорма.Значение));
		КонецЦикла;
		
		Если УдаляемыеРеквизиты.Количество() > 0 Тогда
			ЭтаФорма.ИзменитьРеквизиты(Новый Массив, УдаляемыеРеквизиты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогиФорм(ИмяКаталога = Неопределено, НомерФормы = Неопределено)
	
	Если ИмяКаталога = Неопределено Тогда
	
		Для Каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
			
			Если Не ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение] Тогда
				Продолжить;
			КонецЕсли;
			
			НомерФормы = СтрЗаменить(ФормаПервичныхДокументовСЭД.Значение, "Форма", "");
			КаталогФайловФормы = Объект.КаталогФайлов + ?(Прав(Объект.КаталогФайлов, 1) = "\", "", "\") + НомерФормы;
			ОчиститьКаталогиФорм(КаталогФайловФормы, НомерФормы);
			
			Если НомерФормы = "530" Тогда
				ОчиститьКаталогиФорм(КаталогФайловФормы + "\Депозиты", НомерФормы);
	            ОчиститьКаталогиФорм(КаталогФайловФормы + "\МНО", НомерФормы);
			Конецесли;
			
		КонецЦикла;
		
	Иначе
			
		НайденныеФайлы = НайтиФайлы(ИмяКаталога, "*.xml", Ложь);
		
		Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
			
			ЭтоФайлТекущейФормы = Ложь;
			
			// прочитаем XML, чтобы удалить только подходящие файлы
			ЧтениеXML = Новый ЧтениеXML;
			
			Попытка
				ЧтениеXML.ОткрытьФайл(НайденныйФайл.ПолноеИмя);
				Если ЧтениеXML.Прочитать() Тогда
					ЭтоФайлТекущейФормы = (ЧтениеXML.Имя = "EDO_ODKF" + ?(НомерФормы = Неопределено, "", НомерФормы));
				КонецЕсли;
				ЧтениеXML.Закрыть(); // иначе будет ошибка совместного доступа к файлу
				
				Если ЭтоФайлТекущейФормы Тогда
					УдалитьФайлы(НайденныйФайл.ПолноеИмя);
				КонецЕсли;
					
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить файл " + НайденныйФайл.ПолноеИмя + ". Система сообщает " + ОписаниеОшибки());
			КонецПопытки;
						
		КонецЦикла;
		
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктивныеСчетаДоверительногоУправления()
	
	ЭтаФорма.АктивныеСчетаДоверительногоУправления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
#Область ТЕКСТ_ЗАПРОСА
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.СпециализированныйДепозитарий.СистемаЭлектронногоДокументооборота КАК СЭД
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУ.Ссылка КАК Ссылка,
		|	_СчетаДУ.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаИспользующиеСЭД_ВТБ
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|ГДЕ
		|	_СчетаДУ.СЭД = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СЭД_ВТБ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаИспользующиеСЭД_ВТБ.Ссылка КАК Ссылка,
		|	_СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаСОтборомПоВидуДоговора
		|ИЗ
		|	_СчетаИспользующиеСЭД_ВТБ КАК _СчетаИспользующиеСЭД_ВТБ
		|ГДЕ
		|	(_СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ИЛИ _СчетаИспользующиеСЭД_ВТБ.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК Ссылка,
		|	_СчетаСОтборомПоВидуДоговора.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ВестиЕдиныйБухгалтерскийУчет
		|ПОМЕСТИТЬ _СчетаИзОбщихНастроекУчета
		|ИЗ
		|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|			&Период,
		|			СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_СчетаСОтборомПоВидуДоговора.Ссылка
		|				ИЗ
		|					_СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора)) КАК НастройкиУчетаОбщиеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора
		|		ПО НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления = _СчетаСОтборомПоВидуДоговора.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	_СчетаДУ.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	_СчетаДУ.Ссылка КАК Договор
		|ПОМЕСТИТЬ _ПринадлежностьДоговоровКлиентам
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДУ.Ссылка
		|						ИЗ
		|							_СчетаДУ КАК _СчетаДУ)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО _СчетаДУ.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА ""Договор""
		|		КОГДА СоставИНастройкиОтчетовСрезПоследних.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|			ТОГДА ""ВидДоговора""
		|		ИНАЧЕ ""Клиент""
		|	КОНЕЦ КАК ТипНастройки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) <> ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА СоставИНастройкиОтчетовСрезПоследних.Субъект
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Клиент,
		|	СоставИНастройкиОтчетовСрезПоследних.ВидДоговора КАК ВидДоговора,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетовСрезПоследних.Субъект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА СоставИНастройкиОтчетовСрезПоследних.Субъект
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Договор,
		|	СоставИНастройкиОтчетовСрезПоследних.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Формировать
		|ПОМЕСТИТЬ _НастройкиСоставаПакетов
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|				И Отчет В (&Отчет_522, &Отчет_029, &Отчет_685)
		|				И (Субъект, ВидДоговора) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьДоговоровКлиентам.Клиент КАК Субъект,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговора
		|					ИЗ
		|						_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьДоговоровКлиентам.Клиент,
		|						_ПринадлежностьДоговоровКлиентам.ВидДоговора
		|					ИЗ
		|						_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ПринадлежностьДоговоровКлиентам.Договор,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
		|					ИЗ
		|						_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам)) КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)
		|	И СоставИНастройкиОтчетовСрезПоследних.Значение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаСОтборомПоВидуДоговора.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _ИсполнителиСобственные
		|ИЗ
		|	_СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО (ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация)
		|			И _СчетаСОтборомПоВидуДоговора.Ссылка = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|ГДЕ
		|	(ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &Период
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаСОтборомПоВидуДоговора.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _ИсполнителиБрокерские
		|ИЗ
		|	_СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|		ПО (ИсполнителиПоДенежнымСредствамБрокерские.Организация = &Организация)
		|			И _СчетаСОтборомПоВидуДоговора.Ссылка = ИсполнителиПоДенежнымСредствамБрокерские.СчетДоверительногоУправления
		|ГДЕ
		|	(ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия >= &Период
		|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаСОтборомПоВидуДоговора.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _ИсполнителиПоЦеннымБумагам
		|ИЗ
		|	_СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|		ПО (ИсполнителиПоЦеннымБумагам.Организация = &Организация)
		|			И _СчетаСОтборомПоВидуДоговора.Ссылка = ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИсполнителиСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма520
		|ИЗ
		|	_ИсполнителиСобственные КАК _ИсполнителиСобственные
		|ГДЕ
		|	&Форма520
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПринадлежностьДоговоровКлиентам.Договор КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма522
		|ИЗ
		|	_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиКлиентов
		|		ПО (_НастройкиКлиентов.ТипНастройки = ""Клиент"")
		|			И (_НастройкиКлиентов.Отчет = &Отчет_522)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиВидовДоговоров
		|		ПО (_НастройкиВидовДоговоров.ТипНастройки = ""ВидДоговора"")
		|			И (_НастройкиВидовДоговоров.Отчет = &Отчет_522)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиВидовДоговоров.Клиент
		|			И _ПринадлежностьДоговоровКлиентам.ВидДоговора = _НастройкиВидовДоговоров.ВидДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиДоговоров
		|		ПО (_НастройкиДоговоров.ТипНастройки = ""Договор"")
		|			И (_НастройкиДоговоров.Отчет = &Отчет_522)
		|			И _ПринадлежностьДоговоровКлиентам.Договор = _НастройкиДоговоров.Договор
		|ГДЕ
		|	&Форма522
		|	И НЕ(_НастройкиДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиВидовДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиКлиентов.Формировать ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ИсполнителиБрокерские.СчетДоверительногоУправления
		|ИЗ
		|	_ИсполнителиБрокерские КАК _ИсполнителиБрокерские
		|ГДЕ
		|	&Форма522
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеестрПлатежей.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма527
		|ИЗ
		|	_СчетаСОтборомПоВидуДоговора КАК _СчетаСОтборомПоВидуДоговора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ПО (&Форма527)
		|			И _СчетаСОтборомПоВидуДоговора.Ссылка = РеестрПлатежей.СчетДоверительногоУправления
		|			И (РеестрПлатежей.Организация = &Организация)
		|			И (РеестрПлатежей.ДатаПлатежа МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаспоряжениеНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма530
		|ИЗ
		|	Документ.Распоряжение КАК РаспоряжениеНаМНО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаИспользующиеСЭД_ВТБ КАК _СчетаИспользующиеСЭД_ВТБ
		|		ПО (&Форма530)
		|			И РаспоряжениеНаМНО.СчетДоверительногоУправления = _СчетаИспользующиеСЭД_ВТБ.Ссылка
		|			И (НАЧАЛОПЕРИОДА(РаспоряжениеНаМНО.Дата, ДЕНЬ) = &Период)
		|			И (РаспоряжениеНаМНО.Организация = &Организация)
		|			И (РаспоряжениеНаМНО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|			И (НЕ РаспоряжениеНаМНО.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Распоряжение.СчетДоверительногоУправления
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаИспользующиеСЭД_ВТБ КАК _СчетаИспользующиеСЭД_ВТБ
		|		ПО (&Форма530)
		|			И Распоряжение.СчетДоверительногоУправления = _СчетаИспользующиеСЭД_ВТБ.Ссылка
		|			И (НАЧАЛОПЕРИОДА(Распоряжение.ДатаРазмещения, ДЕНЬ) = &Период)
		|			И (Распоряжение.Организация = &Организация)
		|			И (Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента))
		|			И (НЕ Распоряжение.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПринадлежностьДоговоровКлиентам.Договор КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма029
		|ИЗ
		|	_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиКлиентов
		|		ПО (_НастройкиКлиентов.ТипНастройки = ""Клиент"")
		|			И (_НастройкиКлиентов.Отчет = &Отчет_029)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиВидовДоговоров
		|		ПО (_НастройкиВидовДоговоров.ТипНастройки = ""ВидДоговора"")
		|			И (_НастройкиВидовДоговоров.Отчет = &Отчет_029)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиВидовДоговоров.Клиент
		|			И _ПринадлежностьДоговоровКлиентам.ВидДоговора = _НастройкиВидовДоговоров.ВидДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиДоговоров
		|		ПО (_НастройкиДоговоров.ТипНастройки = ""Договор"")
		|			И (_НастройкиДоговоров.Отчет = &Отчет_029)
		|			И _ПринадлежностьДоговоровКлиентам.Договор = _НастройкиДоговоров.Договор
		|ГДЕ
		|	&Форма029
		|	И НЕ(_НастройкиДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиВидовДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиКлиентов.Формировать ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаИзОбщихНастроекУчета.Ссылка
		|ИЗ
		|	_СчетаИзОбщихНастроекУчета КАК _СчетаИзОбщихНастроекУчета
		|ГДЕ
		|	&Форма029
		|	И (_СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ИЛИ _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ИЛИ _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаИзОбщихНастроекУчета.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма301
		|ИЗ
		|	_СчетаИзОбщихНастроекУчета КАК _СчетаИзОбщихНастроекУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|		ПО (&Форма301)
		|			И _СчетаИзОбщихНастроекУчета.Ссылка = ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления
		|ГДЕ
		|	(_СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ИЛИ _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПринадлежностьДоговоровКлиентам.Договор КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма685
		|ИЗ
		|	_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиКлиентов
		|		ПО (_НастройкиКлиентов.ТипНастройки = ""Клиент"")
		|			И (_НастройкиКлиентов.Отчет = &Отчет_685)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиВидовДоговоров
		|		ПО (_НастройкиВидовДоговоров.ТипНастройки = ""ВидДоговора"")
		|			И (_НастройкиВидовДоговоров.Отчет = &Отчет_685)
		|			И _ПринадлежностьДоговоровКлиентам.Клиент = _НастройкиВидовДоговоров.Клиент
		|			И _ПринадлежностьДоговоровКлиентам.ВидДоговора = _НастройкиВидовДоговоров.ВидДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСоставаПакетов КАК _НастройкиДоговоров
		|		ПО (_НастройкиДоговоров.ТипНастройки = ""Договор"")
		|			И (_НастройкиДоговоров.Отчет = &Отчет_685)
		|			И _ПринадлежностьДоговоровКлиентам.Договор = _НастройкиДоговоров.Договор
		|ГДЕ
		|	&Форма685
		|	И _ПринадлежностьДоговоровКлиентам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|	И НЕ(_НастройкиДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиВидовДоговоров.Формировать ЕСТЬ NULL
		|				И _НастройкиКлиентов.Формировать ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаИзОбщихНастроекУчета.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма922
		|ИЗ
		|	_СчетаИзОбщихНастроекУчета КАК _СчетаИзОбщихНастроекУчета
		|ГДЕ
		|	&Форма922
		|	И &Период >= ДАТАВРЕМЯ(2022, 1, 1)
		|	И _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаИзОбщихНастроекУчета.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма923
		|ИЗ
		|	_СчетаИзОбщихНастроекУчета КАК _СчетаИзОбщихНастроекУчета
		|ГДЕ
		|	&Форма923
		|	И _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаИзОбщихНастроекУчета.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Форма220
		|ИЗ
		|	_СчетаИзОбщихНастроекУчета КАК _СчетаИзОбщихНастроекУчета
		|ГДЕ
		|	&Форма220
		|	И _СчетаИзОбщихНастроекУчета.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Флажок,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма520) КАК Форма520,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма522) КАК Форма522,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма527) КАК Форма527,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма530) КАК Форма530,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма029) КАК Форма029,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма301) КАК Форма301,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма685) КАК Форма685,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма922) КАК Форма922,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма923) КАК Форма923,
		|	МАКСИМУМ(ВложенныйЗапрос.Форма220) КАК Форма220,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	(ВЫБРАТЬ
		|		&Форма520 КАК Форма520,
		|		ЛОЖЬ КАК Форма522,
		|		ЛОЖЬ КАК Форма527,
		|		ЛОЖЬ КАК Форма530,
		|		ЛОЖЬ КАК Форма029,
		|		ЛОЖЬ КАК Форма301,
		|		ЛОЖЬ КАК Форма685,
		|		ЛОЖЬ КАК Форма922,
		|		ЛОЖЬ КАК Форма923,
		|		ЛОЖЬ КАК Форма220,
		|		_Форма520.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|	ИЗ
		|		_Форма520 КАК _Форма520
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		&Форма522,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма522.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма522 КАК _Форма522
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма527,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма527.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма527 КАК _Форма527
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма530,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма530.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма530 КАК _Форма530
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма029,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма029.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма029 КАК _Форма029
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма301,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма301.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма301 КАК _Форма301
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма685,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма685.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма685 КАК _Форма685
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма922,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		_Форма922.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма922 КАК _Форма922
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма923,
		|		ЛОЖЬ,
		|		_Форма923.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма923 КАК _Форма923
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		&Форма220,
		|		_Форма220.СчетДоверительногоУправления
		|	ИЗ
		|		_Форма220 КАК _Форма220) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления
		|
		|ИМЕЮЩИЕ
		|	(МАКСИМУМ(ВложенныйЗапрос.Форма520) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма522) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма527) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма530) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма029) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма301) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма685) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма922) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма923) = ИСТИНА
		|		ИЛИ МАКСИМУМ(ВложенныйЗапрос.Форма220) = ИСТИНА)";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Отчет_522", ОбщегоНазначения.ПолучитьИменованныйОбъект("_ЭскпортВСЭДВТБ_Форма522"));
	Запрос.УстановитьПараметр("Отчет_029", ОбщегоНазначения.ПолучитьИменованныйОбъект("_ЭскпортВСЭДВТБ_Форма029"));
	Запрос.УстановитьПараметр("Отчет_685", ОбщегоНазначения.ПолучитьИменованныйОбъект("_ЭскпортВСЭДВТБ_Форма685"));
	Запрос.УстановитьПараметр("САФМАР", ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF258")); //НПФ САФМАР ПН АО
	
	Для Каждого ФормаПервичныхДокументовСЭД Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		Запрос.УстановитьПараметр(ФормаПервичныхДокументовСЭД.Значение, ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение]);	
	КонецЦикла;
	
	Для Каждого НеиспользуемаяФорма Из ЭтаФорма.НеиспользуемыеФормы Цикл
		Запрос.УстановитьПараметр(НеиспользуемаяФорма.Значение, Ложь);
	КонецЦикла;
	
	ЭтаФорма.АктивныеСчетаДоверительногоУправления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЭтаФорма.АктивныеСчетаДоверительногоУправления.Сортировать("СчетДоверительногоУправления");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКонтактныхЛиц()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО Организации.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо И СвязанныеЮридическиеЛицаСрезПоследних.Действует
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, Организации.ЮрФизЛицо) = КонтактныеЛица.Объект)
		|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|	И КонтактныеЛица.КонтактноеЛицо ССЫЛКА Справочник.ЮрФизЛица
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактноеЛицо
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	СписокКонтактныхЛиц.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо"));
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьФИО(КонтактноеЛицо, Организация, ИмяРеквизитаФормы = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыСотрудниковОрганизации.Фамилия + "" "" + РеквизитыСотрудниковОрганизации.Имя + "" "" + РеквизитыСотрудниковОрганизации.Отчество КАК Подписант,
		|	КонтактныеЛица.Должность КАК ДолжностьПодписанта
		|ИЗ
		|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &КонтактноеЛицо) КАК РеквизитыСотрудниковОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО РеквизитыСотрудниковОрганизации.Организация.ЮрФизЛицо = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И (КонтактныеЛица.КонтактноеЛицо = &КонтактноеЛицо)";
	
	Если ИмяРеквизитаФормы <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК Подписант", "КАК " + ИмяРеквизитаФормы);	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КАК ДолжностьПодписанта", "КАК " + ИмяРеквизитаФормы + "Должность");
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("КонтактноеЛицо"	, КонтактноеЛицо);
	Запрос.УстановитьПараметр("Период"			, ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормыНаСервере(ФормаПервичныхДокументовСЭД, СписокФормДляСозданияЭлементов = Неопределено, ИмяГруппыФормы)
	
	Если ФормаПервичныхДокументовСЭД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеФлажкаФормы = Элементы.Добавить(ФормаПервичныхДокументовСЭД.Значение, Тип("ПолеФормы"), Элементы[ИмяГруппыФормы]);
	ПолеФлажкаФормы.Вид                = ВидПоляФормы.ПолеФлажка;
	ПолеФлажкаФормы.ПутьКДанным        = ФормаПервичныхДокументовСЭД.Значение;
	ПолеФлажкаФормы.Заголовок          = ФормаПервичныхДокументовСЭД.Представление;
	ПолеФлажкаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	Если ФормаПервичныхДокументовСЭД.Пометка 
		Или (СписокФормДляСозданияЭлементов <> Неопределено И СписокФормДляСозданияЭлементов.Найти(ФормаПервичныхДокументовСЭД.Значение) <> Неопределено) Тогда
		
		Если ФормаПервичныхДокументовСЭД.Значение = "Форма685" Тогда
			ПолеФлажкаФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииФорма685");
		ИначеЕсли ФормаПервичныхДокументовСЭД.Значение = "Форма220" Тогда
			ПолеФлажкаФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииФорма220");	
		Иначе
			ПолеФлажкаФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ФлажкиФормПриИзменении");
		КонецЕсли;                                                                                    	

		ПолеФлажкаТаблицы = Элементы.Вставить("АктивныеСчетаДоверительногоУправления" + ФормаПервичныхДокументовСЭД.Значение, Тип("ПолеФормы"), Элементы.АктивныеСчетаДоверительногоУправления, Элементы.АктивныеСчетаДоверительногоУправленияФлажок);
		ПолеФлажкаТаблицы.Вид                = ВидПоляФормы.ПолеФлажка;
		ПолеФлажкаТаблицы.ПутьКДанным        = "АктивныеСчетаДоверительногоУправления." + ФормаПервичныхДокументовСЭД.Значение;
		ПолеФлажкаТаблицы.Заголовок          = СтрЗаменить(ФормаПервичныхДокументовСЭД.Значение, "Форма", "Форма ");
		ПолеФлажкаТаблицы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажкаТаблицы.ТолькоПросмотр     = Истина;
		ПолеФлажкаТаблицы.Видимость			 = ФормаПервичныхДокументовСЭД.Пометка;
					
		ЭтаФорма[ФормаПервичныхДокументовСЭД.Значение] = ФормаПервичныхДокументовСЭД.Пометка;
		
				
	Иначе
		ПолеФлажкаФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзменении" + ФормаПервичныхДокументовСЭД.Значение);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтактныеЛицаСД(Дата, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Дата",			Дата);		
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеквизитыСотрудниковОрганизации.Фамилия + "" "" + РеквизитыСотрудниковОрганизации.Имя + "" "" + РеквизитыСотрудниковОрганизации.Отчество КАК ФИО
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО СчетаДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизации
		|		ПО (КонтактныеЛица.КонтактноеЛицо = РеквизитыСотрудниковОрганизации.ЮрФизЛицо)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Дата
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &Дата)
		|	И НЕ РеквизитыСотрудниковОрганизации.Фамилия ЕСТЬ NULL";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	
	СписокКонтактныхЛиц = Новый СписокЗначений;
			
	Пока Выборка.Следующий() Цикл		
		СписокКонтактныхЛиц.Добавить(Выборка.ФИО);
	КонецЦикла;
	
	Возврат СписокКонтактныхЛиц;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКаталогФайлов(Организация, Период, КаталогФайлов)

	Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._ЭкспортДанныхВСЭДВТБ.ШаблонКаталогаФайлов", Организация, Период, КаталогФайлов);

КонецФункции

#КонецОбласти
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = Рекви
&Н
&НаКлиенте
Процедура ВыполнитьКомандаСнятьФлажки(ПараметрыСессии, Команда)

	Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
		СтрокаАктивныеСчетаДоверительногоУправления.Флажок = Ложь;
	КонецЦикла;


КонецПроцедуры
аКлиенте
Процедура ВыполнитьКомандаУстановитьФлажки(ПараметрыСессии, Команда)

	Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
		СтрокаАктивныеСчетаДоверительногоУправления.Флажок = Истина;
	КонецЦикла;


КонецПроцедуры
зитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ВыполнитьКомандаЭкспортировать(ПараметрыСессии, Команда)

	ОчиститьКаталогиФорм();

	// Проверяем каталог верхнего уровня
	Отказ = Ложь;
	РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(Объект.КаталогФайлов, Отказ);

	Если Отказ Тогда
		Сообщить("Экспорт данных прерван");
		Возврат;	
	КонецЕсли;

	Для каждого СтрокаАктивныеСчетаДоверительногоУправления Из ЭтаФорма.АктивныеСчетаДоверительногоУправления Цикл
		Если Не СтрокаАктивныеСчетаДоверительногоУправления.Флажок Тогда
			Продолжить;
		КонецЕсли;

		Для каждого Элемент Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
			Если Элемент.Пометка Тогда
				Если СтрокаАктивныеСчетаДоверительногоУправления[Элемент.Значение] Тогда

					Если Элемент.Значение = "Форма685" Тогда
						ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.Форма." + Элемент.Значение)
							.СфомироватьДокументыСЭД(Объект.Организация, СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления, Объект.Период, Объект.КаталогФайлов, ЭтотОбъект.РуководительПИФ, ЭтотОбъект.УполномоченноеЛицоСД);	

					ИначеЕсли Элемент.Значение = "Форма220" Тогда
						ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.Форма." + Элемент.Значение)
							.СфомироватьДокументыСЭД(Объект.Организация, СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления, Объект.Период, Объект.КаталогФайлов, Подписант, ДолжностьПодписанта);			
					Иначе	
						ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.Форма." + Элемент.Значение)
							.СфомироватьДокументыСЭД(Объект.Организация, СтрокаАктивныеСчетаДоверительногоУправления.СчетДоверительногоУправления, Объект.Период, Объект.КаталогФайлов);

					КонецЕсли;

				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для каждого Элемент Из ЭтаФорма.ФормыПервичныхДокументовСЭД Цикл
		Если НЕ Элемент.Пометка Тогда
			Если ЭтаФорма[Элемент.Значение] Тогда
				Если Элемент.Значение = "Форма233" Тогда
					Если НЕ ПолучитьФорму("ВнешняяОбработка._ЭкспортДанныхВСЭДВТБ.Форма.Форма233").СфомироватьДокументыСЭД(Объект.Организация, ИмяФайлаСоСписокомЛиц, Объект.Период, Объект.КаталогФайлов, Подписант, ДолжностьПодписанта, ЭтаФорма.ВидФормы233) Тогда
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Экспорт данных завершен");


КонецПроцедуры
