#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		
		ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
		
	КонецЕсли; 
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);		
	
	ИмяПредопределенного	= РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);
	ПредставлениеВарианта	= РаботаСОтчетамиКлиентСервер.ПолучитьПредставлениеВариантаОтчета(ЭтаФорма.Отчет);	
		
	Если ЗначениеЗаполнено(ПредставлениеВарианта) Тогда
		ЭтаФорма.Заголовок = ПредставлениеВарианта;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЭтаФорма.ВариантМодифицирован = Ложь;
	КонецЕсли;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область Автоматическое_Формирование

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.СчетДоверительногоУправления.Видимость 		= Отчет.ВариантФормирования = 0;
	Элементы.Клиент.Видимость 								= Отчет.ВариантФормирования = 1;
	Элементы.ВидДоговораДоверительногоУправления.Видимость 	= Отчет.ВариантФормирования = 1;
	
КонецПроцедуры

#КонецОбласти


