Функция ПолучитьХэш(ОбъектСправочникаПотоков) Экспорт
	
	СтрокаДляХэша = Формат(ОбъектСправочникаПотоков.ДатаРасчетаПотока, "ДФ=dd.MM.yyyy");
	Для каждого СтрокаПотоков Из ОбъектСправочникаПотоков.Поток Цикл
		СтрокаДляХэша = СтрокаДляХэша + РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 %3, ", СтрокаПотоков.Дата, СтрокаПотоков.Сумма, СтрокаПотоков.Купон);
	КонецЦикла;
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(СтрокаДляХэша);
	
	Возврат СокрЛП(СтрЗаменить(Хеширование.ХешСумма, " ", ""));

КонецФункции 
