
Процедура УстановитьСтатусПоручения(Поручение, Статус, Комментарий = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
			
	МенеджерЗаписиСтатусыПоручений = РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиСтатусыПоручений.Период = ТекущаяДатаСеанса();	
	МенеджерЗаписиСтатусыПоручений.ПоручениеНаПереводДенежныхСредств = Поручение;
	МенеджерЗаписиСтатусыПоручений.Статус                            = Статус;
	МенеджерЗаписиСтатусыПоручений.Комментарий                       = Комментарий;
	МенеджерЗаписиСтатусыПоручений.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
