
#Область Хардкоды

Функция ДатаВключенияЗакрытия7гоРазделаПоРезервам() Экспорт

	Возврат '20250312'; // просто забыли сделать закрытие 7го раздела с 1.1.25 когда все начали резервы считать, прошлось включать с даты

КонецФункции

// В группу БУДУЩЕЕ входят следующие фонды:
// 	АО МНПФ БОЛЬШОЙ
// 	НПФ БУДУЩЕЕ АО
// 	НПФ Достойное БУДУЩЕЕ АО
// 	НПФ ОПФ
// 	НПФ Телеком-Союз АО
// 	НПФ ФЕДЕРАЦИЯ АО
// 	НПФ Эволюция АО
// 	ПЕРСПЕКТИВА НПФ АО
//
// Параметры:
//	Клиент	- СправочникСсылка.СчетаДоверительногоУправления - счет д/у 
//			- СправочникСсылка.ЮрФизЛица					 - юр./физ.лицо клиента
//	Дата	- Дата, Неопределено							 - дата, на которую определеятся клиент, связанный со счетом д/у
//
// Возвращаемое значение:
//	ЭтоКлиентГруппыБудущее - Булево - Истина, если это так
//
Функция ЭтоКлиентГруппыБудущее(Клиент, Дата = Неопределено) Экспорт

	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Клиент, Дата);
	Иначе
		КлиентДоверительногоУправления = Клиент;
	КонецЕсли;
	
	КлиентыГруппы = Кэширование.КлиентыГруппыБудущее();
	
	Возврат КлиентыГруппы.Найти(КлиентДоверительногоУправления) <> Неопределено;

КонецФункции

Функция ОтключенаОценкаРазницыПервоначальногоПризнания(НастройкиУчета, Партия, СтрокаПартии, Облигация, УчетныйАктивЕПС, ДатаПереоценки) Экспорт
	
	ОтключенаОценкаРазницыПП = Истина;
	
	// Есть вызовы когда в НастройкиУчета передаются НастройкиУчетаОбщие а нам нужно ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги.
	НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
		НастройкиУчета,
		Облигация,
		УчетныйАктивЕПС,
		Партия,
		СтрокаПартии);
	
	Если НастройкиУчетаЦеннойБумаги.ПартииСОценкойРазницыПервоначальногоПризнания Тогда
		ОтключенаОценкаРазницыПП = Ложь;	
	ИначеЕсли НастройкиУчетаЦеннойБумаги.ПартииСОценкойРазницыПервоначальногоПризнанияВДатуПогашенияКупона Тогда
	    // нужно проверить - не день ли погашения купонного дохода
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаОкончанияКупона
			|ИЗ
			|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
			|ГДЕ
			|	КупонныйДоходПоОблигациям.Облигация = &Облигация
			|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &ДатаОкончанияКупона";
		
		Запрос.УстановитьПараметр("ДатаОкончанияКупона", НачалоДня(ДатаПереоценки));
		Запрос.УстановитьПараметр("Облигация", Облигация);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			ОтключенаОценкаРазницыПП = Истина;
		Иначе
			ОтключенаОценкаРазницыПП = Ложь;
		КонецЕсли;
	КонецЕсли;	

	Возврат ОтключенаОценкаРазницыПП;
	
КонецФункции

Функция ПереопределениеНачальногоДисконта(НачальныйДисконт, Облигация, Количество, ДатаПереоценки, ДатаПокупки, ОпределенияКлиентов)

	Если ДатаПереоценки >= '20210412' И ОпределенияКлиентов.ЭтоКлиентСАФМАР И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Пересвет") Тогда
			
		// приходится делать так из-за точности
		_НачальныйДисконт = (1 - Количество * 329) / Количество; // все пересветы были куплены за 1руб (независимо от партии), 329 это номинал пересвета
		Если Количество = 2019320 Тогда // Сафмар посчитал эту партию так и переделывать не будет, а я не знаю как её идентифицировать, кроме как через количество
		    _НачальныйДисконт = 0.000000495213513782534908839 - 329; 
		КонецЕсли;

	ИначеЕсли ДатаПереоценки >= ДатаНачалаОбъединенияПортфелейГруппыБудущее() И ОпределенияКлиентов.ЭтоКлиентБудущее И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Пересвет")  Тогда
		
		// По этой бумаге Пересвета всего 5 партий. 1 - Это "старое Будущее", остальные бывший Сафмар, которые в Будущее переезжают т.е. это "новое Будущее".
		// Будем дейстровать от противного. Отделим единственную партию "старое Будущее", всё что не она - это понаехалы.
		// Партия увы до этой функции уже не прокидывается. По-этому отделяем по кол-ву, иначе тут уже никак. Старое Будущее это 13 499 815,0000000
		Если Количество <> 13499815 Тогда
			// приходится делать так из-за точности
			_НачальныйДисконт = (1 - Количество * 329) / Количество; // все пересветы были куплены за 1руб (независимо от партии), 329 это номинал пересвета
			Если Количество = 2019320 Тогда // Сафмар посчитал эту партию так и переделывать не будет, а я не знаю как её идентифицировать, кроме как через количество
				_НачальныйДисконт = 0.000000495213513782534908839 - 329; 
			КонецЕсли;
			
		Иначе
			
			_НачальныйДисконт = НачальныйДисконт;
			
		КонецЕсли;	
		
	ИначеЕсли ОпределенияКлиентов.ЭтоКлиентЮгория
		И ДатаПокупки < '20210101'
		И ДатаПереоценки < '20251011' Тогда // #394630 - 9.10.25 погасилась, а 10.10.25 оплатилась последняя из этих кривых бумаг
	
		БумагиСОкругленнойЦенойПриобретения = Новый Массив;
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОФЗ_26212RMFS"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОФЗ_46020RMFS"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГПНефть_003003Р"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Газпром_023"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РосНефть_002001"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РосНефть_009"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТрансНефть_0051"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТрансНефть_0081"));
		БумагиСОкругленнойЦенойПриобретения.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_09"));
		
		Если БумагиСОкругленнойЦенойПриобретения.Найти(Облигация) <> Неопределено Тогда
		
			Если НачальныйДисконт > 0 Тогда
				_НачальныйДисконт = Окр(НачальныйДисконт, 2);
			ИначеЕсли НачальныйДисконт < 0 Тогда
				_НачальныйДисконт = Окр(НачальныйДисконт, 2, РежимОкругления.Окр15как10);
			КонецЕсли;
			
		Иначе
			
			_НачальныйДисконт = НачальныйДисконт;
			
		КонецЕсли;
		
	Иначе
		
		_НачальныйДисконт = НачальныйДисконт;
		
	КонецЕсли;
	
	Возврат _НачальныйДисконт;

КонецФункции 

Функция ПолучитьОблигацииСРеструктуризациейПлатежей(Дата) Экспорт

	ТаблицаЦенныхБумаг = Новый ТаблицаЗначений;
	
	ТаблицаЦенныхБумаг.Колонки.Добавить("Облигация", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ТаблицаЦенныхБумаг.Колонки.Добавить("Эмитент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	
	Если Дата >= '20171113' Тогда
	
		СтрокаРеструктуризации = ТаблицаЦенныхБумаг.Добавить();
		СтрокаРеструктуризации.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_БизнесКонсалтиг");
		СтрокаРеструктуризации.Эмитент = СтрокаРеструктуризации.Облигация.Эмитент.ЮрФизЛицо;
	
	КонецЕсли;

	Если Дата >= '20201118' Тогда
	
		СтрокаРеструктуризации = ТаблицаЦенныхБумаг.Добавить();
		СтрокаРеструктуризации.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1_ПропертизФин");
		СтрокаРеструктуризации.Эмитент = СтрокаРеструктуризации.Облигация.Эмитент.ЮрФизЛицо;
	
	КонецЕсли;
	
	Если Дата >= '20180301' Тогда
	
		СтрокаРеструктуризации = ТаблицаЦенныхБумаг.Добавить();
		СтрокаРеструктуризации.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_Дол");
		СтрокаРеструктуризации.Эмитент = СтрокаРеструктуризации.Облигация.Эмитент.ЮрФизЛицо;
		
		СтрокаРеструктуризации = ТаблицаЦенныхБумаг.Добавить();
		СтрокаРеструктуризации.Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2");
		СтрокаРеструктуризации.Эмитент = СтрокаРеструктуризации.Облигация.Эмитент.ЮрФизЛицо;
		
	КонецЕсли;
	
	Возврат ТаблицаЦенныхБумаг;
	
КонецФункции

Функция ПолучитьОблигацииНаБалансеСПрошедшимПогашением() Экспорт

	ОблигацииНаБалансеСПрошедшимПогашением = Новый Массив;
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РисЛэнд01"));
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВнешпрБО-3"));
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстандарт"));
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДомашниеДеньги1"));
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ОВКФинанс"));
	ОблигацииНаБалансеСПрошедшимПогашением.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс"));
	
	Возврат ОблигацииНаБалансеСПрошедшимПогашением;
	
КонецФункции

Функция ПолучитьБлижайшуюРаннююДатуОбъединенияВГруппеБудущее(Дата) Экспорт

	МассивДатОбъединений = Новый Массив();
	МассивДатОбъединений.Добавить('20250818');	// Телеком перешел в Будущее
	МассивДатОбъединений.Добавить('20250916');  // все перешли в Будущее
	
	БлижайшаяРанняяДатаОбъединенияВГруппеБудущее = '00010101';
	
	Для каждого ДатаОбъединения Из МассивДатОбъединений Цикл
		Если ДатаОбъединения < Дата Тогда
			БлижайшаяРанняяДатаОбъединенияВГруппеБудущее = ДатаОбъединения;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат БлижайшаяРанняяДатаОбъединенияВГруппеБудущее;
	
КонецФункции

Функция ДатаНачалаОбъединенияПортфелейГруппыБудущее() Экспорт

	Возврат '20250818';

КонецФункции

#КонецОбласти

#Область Расчет_дисконта_премии

Функция РасчетДисконтаПремииВДеньПокупки(НачальныйДисконт, Количество, НастройкиУчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
	
	Если НачальныйДисконт > 0                           	// купили с премией
		ИЛИ НастройкиУчета.СтоимостьТелаРавнаНоминалу Тогда	// дисконт = дисконт начальный (оба < 0)
		
		РезультатРасчетаДисконтаПремии.ОценочныеДисконтПремия = НачальныйДисконт * Количество;
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт;
	РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = НачальныйДисконт * Количество;
	РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет = РезультатРасчетаДисконтаПремии.ОценочныеДисконтПремия;	
	
	Если НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.НеУчитывать Тогда
		РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Не учитывать");
	Иначе	
		РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Расчет в день покупки");
	КонецЕсли;
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииПослеПогашенияИлиОферты(НачальныйДисконт, Количество, НастройкиУчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
	
	// В эту функцию мы можем попасть в 2х случаях
	// у нас сегодня прошло погашение бумаги - все уже списано и вообще ничего начислять не надо
	// либо же мы прошли оферту, а клиент учитывал дисконт/премию до оферты
	// в этом случае нужно полностью списать премию (начислить дисконт)
	// и если с премией все и так нормально срабатывает, то для дисконта есть некоторые нюансы, которые тут отработаны

	Если НастройкиУчета.ДоводитьСтоимостьДоНоминалаВДеньОферты И НачальныйДисконт < 0 Тогда 
		
		РезультатРасчетаДисконтаПремии.ОценочныеДисконтПремия = - НачальныйДисконт;
		РезультатРасчетаДисконтаПремии.ИзменениеДисконтаПремии = РезультатРасчетаДисконтаПремии.ОценочныеДисконтПремия;
		
		РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет = Окр(НачальныйДисконт * Количество, 2);
		РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет = Окр(НачальныйДисконт * Количество, 2);
		
	Иначе
		
		НачальныйДисконт = 0;
		
	КонецЕсли;

	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Расчет после погашения или оферты");
	
	Возврат РезультатРасчетаДисконтаПремии;
	
КонецФункции 

Функция РасчетДисконтаПремииСНГ(Облигация, НачальныйДисконт, Количество, ДнейОтПокупкиДоПереоценки, ДнейОтПокупкиДоПогашения, ДнейОтПереоценкиДоПогашения, ДатаПереоценки, ДатаПокупки, ДатаПогашения, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
	
	Если НачальныйДисконт = 0 Тогда // по номиналу взяли
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = 0;
		
	ИначеЕсли НачальныйДисконт > 0 Тогда // премия, немного по-другому считается
		
	    РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = Окр(НачальныйДисконт * Количество, 2) - Окр(НачальныйДисконт * Количество, 2) * ДнейОтПокупкиДоПереоценки / ДнейОтПокупкиДоПогашения;
		
	Иначе // дисконт
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = Окр(НачальныйДисконт * Количество, 2) * ДнейОтПереоценкиДоПогашения / ДнейОтПокупкиДоПогашения;
		
	КонецЕсли;
	
	Если Облигация.Амортизационная Тогда
		
		ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
		ТаблицаАмортизаций.Колонки.Добавить("ПрошедшийПериод", Новый ОписаниеТипов("Булево"));
		ТаблицаАмортизаций.Колонки.Добавить("ДисконтЗаПериод", Новый ОписаниеТипов("Число"));
		ТаблицаАмортизаций.Колонки.Добавить("ТекущийДисконт", Новый ОписаниеТипов("Число"));
		ТаблицаАмортизаций.Колонки.Добавить("ТекущийНоминал", Новый ОписаниеТипов("Число"));
		ТаблицаАмортизаций.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
		
		ИтогАмортизаций = ТаблицаАмортизаций.Итог("Поток");
		
		РазностьДатПолная = (НачалоДня(ДатаПереоценки) - НачалоДня(ДатаПокупки)) / 86400;
		
		НоминалПриПокупке = ТаблицаАмортизаций.Итог("Поток");
		ТекущийНоминал = НоминалПриПокупке;
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = НачальныйДисконт * Количество;
		
		Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
			
			Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
				
				РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет - НачальныйДисконт * Количество * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций;
				
				ТекущийНоминал = СтрокаТаблицаАмортизаций.Номинал;
				Если НачальныйДисконт < 0 Тогда
					РезультатРасчетаДисконтаПремии.ПогашенияДисконтов = РезультатРасчетаДисконтаПремии.ПогашенияДисконтов - НачальныйДисконт * Количество / ИтогАмортизаций * СтрокаТаблицаАмортизаций.Поток;
				КонецЕсли;
				
				СтрокаТаблицаАмортизаций.ПрошедшийПериод = Истина;
				СтрокаТаблицаАмортизаций.ДисконтЗаПериод = НачальныйДисконт * Количество / ИтогАмортизаций * СтрокаТаблицаАмортизаций.Поток;
				СтрокаТаблицаАмортизаций.ТекущийНоминал = ТекущийНоминал;
				
			Иначе
				
				РазностьДат = (НачалоДня(СтрокаТаблицаАмортизаций.Дата) - НачалоДня(ДатаПокупки)) / 86400;	
				РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет - НачальныйДисконт * Количество * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций / РазностьДат * РазностьДатПолная;
				
				СтрокаТаблицаАмортизаций.ПрошедшийПериод = Ложь;
				СтрокаТаблицаАмортизаций.ДисконтЗаПериод = НачальныйДисконт * Количество * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций / РазностьДат * РазностьДатПолная;
				СтрокаТаблицаАмортизаций.РазностьДат = РазностьДат;
				
			КонецЕсли;
			
			СтрокаТаблицаАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет;
			
		КонецЦикла;
		
		Если НачальныйДисконт > 0 Тогда // премия
			
			Если ТекущийНоминал <> 0 Тогда
				ИзменениеПремии = НачальныйДисконт * Количество - РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет;
			Иначе // дошли дополного погашения
				РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = 0;
				ИзменениеПремии = НачальныйДисконт * Количество;
			КонецЕсли;
			
		ИначеЕсли НачальныйДисконт < 0 Тогда // дисконт
			
			РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет - РезультатРасчетаДисконтаПремии.ПогашенияДисконтов;
			
			ИзменениеПремии = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет / Количество;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаСНГ = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета СНГ", , , Истина);	
		
		ДанныеРасчетаСНГ = Новый Структура;
		ДанныеРасчетаСНГ.Вставить("НачальныйДисконт", НачальныйДисконт);
		ДанныеРасчетаСНГ.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		ДанныеРасчетаСНГ.Вставить("Количество", Количество);
		ДанныеРасчетаСНГ.Вставить("ДнейОтПокупкиДоПогашения", ДнейОтПокупкиДоПогашения);
		ДанныеРасчетаСНГ.Вставить("ДнейОтПокупкиДоПереоценки", ДнейОтПокупкиДоПереоценки);
		
		Если Облигация.Амортизационная Тогда
			ДанныеРасчетаСНГ.Вставить("ИтогАмортизаций", ИтогАмортизаций);
			ДанныеРасчетаСНГ.Вставить("РазностьДатПолная", РазностьДатПолная);
			ДанныеРасчетаСНГ.Вставить("НоминалПриПокупке", НоминалПриПокупке);
			ДанныеРасчетаСНГ.Вставить("ПогашенияДисконтов", РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
			ДанныеРасчетаСНГ.Вставить("ИзменениеПремии", ИзменениеПремии);
			
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаСНГ, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		КонецЕсли;
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеРасчетаСНГ", ДанныеРасчетаСНГ, "Данные расчета СНГ", Истина, Истина);
		
	КонецЕсли;
	
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Методика СНГ");
	
	Возврат РезультатРасчетаДисконтаПремии;
	
КонецФункции 

Функция РасчетДисконтаПремииАтом(Облигация, СчетДоверительногоУправления, НастройкиУчета, НачальныйДисконт, Количество, ДатаПокупки, ДатаПереоценки, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
	
	// #371057 - извращенная метиода расчета для Атомгаранта
	НачальныйДисконтНаПакет = НачальныйДисконт * Количество;
	
	// Берем интегрированную таблицу оферт (с датой объявлений!) и амортизаций (только для случая дисконта)
	// В таблице будут поля: Дата (объявления оферты или амортизации) Тип ("Оферта" или "Амортизация")
	// Таблица будет отсортирована по полю дата
	// 
	// Перед циклом по строкам таблицы мы фмксируем начальный дисконт и дату покупки
	// Обрабатываем в цикле строки таблицы
	// Если Тип = "Оферта" значит расчитываем дисконт на эту дату - это будет новый начальный дисконт
	// а дата объявления будет новой начальной покупкой
	// Если Тип = "Амортизация" - считаем дисконт в этот день и накапливаем - по окончании цикла спишем все накопленное
	ТекущийНачальныйДисконтНаПакет = НачальныйДисконтНаПакет;
	ТекущаяДатаПокупки = ДатаПокупки;
	ТекущаяДатаПогашения = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(Облигация, ДатаПокупки, ДатаПокупки, СчетДоверительногоУправления,
									НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении).ДатаВыкупа;
	
	СписанияДисконтовПриАмортизациях = 0;
	ДатаПредыдущейАморизации = ДатаПокупки;
	
	ТаблицаОфертИАмортизаций = ПолучитьОфертыИАмортизации(Облигация, ДатаПокупки, ДатаПереоценки, (НачальныйДисконт < 0));
	
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ДатаОбъявления", Новый ОписаниеТипов("Дата"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ДнейОтПокупкиДоАмортизацииИлиОферты", Новый ОписаниеТипов("Число"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ДнейОтПокупкиДоПогашения", Новый ОписаниеТипов("Число"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ДисконтЗаДень", Новый ОписаниеТипов("Число"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ИзменениеДисконта", Новый ОписаниеТипов("Число"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ТекущийДисконт", Новый ОписаниеТипов("Число"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("ДатаПогашения", Новый ОписаниеТипов("Дата"));
	ТаблицаОфертИАмортизаций.Колонки.Добавить("СписанияДисконтовПриАмортизациях", Новый ОписаниеТипов("Число"));
	
	Для каждого СтрокаОфертИАмортизаций Из ТаблицаОфертИАмортизаций Цикл
		
		// если мы считаем дисконт для погашения купона или продажи при расчете партий, и в этот день амортизация, то её не считаем - она в конце дня
		Если СтрокаОфертИАмортизаций.ТипДействия = "Амортизация" И КонецДня(СтрокаОфертИАмортизаций.Дата) > ДатаПереоценки Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОфертИАмортизаций.ТипДействия = "Оферта"
			И СтрокаОфертИАмортизаций.Дата < ДатаПереоценки // нас интересуют только уже объявленые оферты, причем рассматривать начинаем только на следующий день после объявления
			И НачалоДня(СтрокаОфертИАмортизаций.ДатаВыкупа) <= НачалоДня(ТекущаяДатаПогашения) Тогда // нас интересуют только оферты, которые сдвигают дату погашения "назад", ближе к покупке
			
			ДатаОбъявленияОферты = СтрокаОфертИАмортизаций.Дата;
			ДнейОтПокупкиДоОбъявленияОферты = (НачалоДня(ДатаОбъявленияОферты) - НачалоДня(ТекущаяДатаПокупки)) / 86400;
			ДнейОтПокупкиДоПогашения = (НачалоДня(ТекущаяДатаПогашения) - НачалоДня(ТекущаяДатаПокупки)) / 86400;
			
			ДисконтЗаДень = ТекущийНачальныйДисконтНаПакет / ДнейОтПокупкиДоПогашения;
			ИзменениеДисконта = ДисконтЗаДень * ДнейОтПокупкиДоОбъявленияОферты;
			ТекущийДисконт = Окр(ТекущийНачальныйДисконтНаПакет - ИзменениеДисконта, 2);
			
			ТекущийНачальныйДисконтНаПакет = ТекущийДисконт;
			ТекущаяДатаПокупки = ДатаОбъявленияОферты;
			ТекущаяДатаПогашения = СтрокаОфертИАмортизаций.ДатаВыкупа;
			
			
			СтрокаОфертИАмортизаций.ДатаОбъявления = ДатаОбъявленияОферты;
			СтрокаОфертИАмортизаций.ДнейОтПокупкиДоАмортизацииИлиОферты = ДнейОтПокупкиДоОбъявленияОферты;
			СтрокаОфертИАмортизаций.ДнейОтПокупкиДоПогашения = ДнейОтПокупкиДоПогашения;
			СтрокаОфертИАмортизаций.ДисконтЗаДень = ДисконтЗаДень;
			СтрокаОфертИАмортизаций.ИзменениеДисконта = ИзменениеДисконта;
			СтрокаОфертИАмортизаций.ТекущийДисконт = ТекущийДисконт;
			СтрокаОфертИАмортизаций.ДатаПогашения = ТекущаяДатаПогашения;
			
		ИначеЕсли СтрокаОфертИАмортизаций.ТипДействия = "Амортизация" И НачальныйДисконтНаПакет < 0 Тогда // амортизации интересуют только для дисконта, на премию они не влияют
			
			ДатаАмортизации = СтрокаОфертИАмортизаций.Дата;
			ДнейОтПокупкиДоАмортизации = (НачалоДня(ДатаАмортизации) - НачалоДня(ДатаПредыдущейАморизации)) / 86400;
			ДнейОтПокупкиДоПогашения = (НачалоДня(ТекущаяДатаПогашения) - НачалоДня(ТекущаяДатаПокупки)) / 86400;
			
			ДисконтЗаДень = ТекущийНачальныйДисконтНаПакет / ДнейОтПокупкиДоПогашения;
			СписанияДисконтовПриАмортизациях = СписанияДисконтовПриАмортизациях + Окр(ДисконтЗаДень * ДнейОтПокупкиДоАмортизации, 2);
			
			ДатаПредыдущейАморизации = ДатаАмортизации;
			
			СтрокаОфертИАмортизаций.ДатаОбъявления = ДатаАмортизации;
			СтрокаОфертИАмортизаций.ДнейОтПокупкиДоАмортизацииИлиОферты = ДнейОтПокупкиДоАмортизации;
			СтрокаОфертИАмортизаций.ДнейОтПокупкиДоПогашения = ДнейОтПокупкиДоПогашения;
			СтрокаОфертИАмортизаций.ДисконтЗаДень = ДисконтЗаДень;
			СтрокаОфертИАмортизаций.СписанияДисконтовПриАмортизациях = СписанияДисконтовПриАмортизациях;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НачалоДня(ТекущаяДатаПогашения) < НачалоДня(ДатаПереоценки) Тогда // была оферта к которой всё списали
		ИзменениеДисконта = ТекущийНачальныйДисконтНаПакет;
		Если НачальныйДисконтНаПакет > 0 Тогда // списали всю премию
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
		Иначе // начислили весь дисконт
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконтНаПакет;
		КонецЕсли;
	Иначе
		
		ДнейОтПокупкиДоПогашения = (НачалоДня(ТекущаяДатаПогашения) - НачалоДня(ТекущаяДатаПокупки)) / 86400;
		ДнейОтПокупкиДоПереоценки = (НачалоДня(ДатаПереоценки) - НачалоДня(ТекущаяДатаПокупки)) / 86400;
		
		ДисконтЗаДень = ТекущийНачальныйДисконтНаПакет / ДнейОтПокупкиДоПогашения;
		ИзменениеДисконта = Окр(ДисконтЗаДень * ДнейОтПокупкиДоПереоценки, 2) - СписанияДисконтовПриАмортизациях;
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = Окр(ТекущийНачальныйДисконтНаПакет - ИзменениеДисконта, 2);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет = НачальныйДисконтНаПакет - РезультатРасчетаДисконтаПремии.ТекущийДисконт;
	
	Если НачальныйДисконтНаПакет >= 0 Тогда
		РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
	Иначе
		РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет = -РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЛМСПСПАИППО = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета по методу 'Линейный метод с полным списанием при амортизаци и пересчетом при офертах", , , Истина);	
		
		РасчетЛМСПСПАИППО = Новый Структура;
		РасчетЛМСПСПАИППО.Вставить("НачальныйДисконтНаПакет", НачальныйДисконтНаПакет);
		РасчетЛМСПСПАИППО.Вставить("ДисконтНаПакет", ТекущийНачальныйДисконтНаПакет);
		Если НачалоДня(ТекущаяДатаПогашения) < НачалоДня(ДатаПереоценки) Тогда
			РасчетЛМСПСПАИППО.Вставить("БылаОфертаККоторойВсёСписали", Истина);
		Иначе
			РасчетЛМСПСПАИППО.Вставить("ДнейОтПокупкиДоПогашения", ДнейОтПокупкиДоПогашения);
			РасчетЛМСПСПАИППО.Вставить("ДнейОтПокупкиДоПереоценки", ДнейОтПокупкиДоПереоценки);
			РасчетЛМСПСПАИППО.Вставить("ДисконтЗаДень", ДисконтЗаДень);
		КонецЕсли;
		РасчетЛМСПСПАИППО.Вставить("ИзменениеДисконта", ИзменениеДисконта);
		РасчетЛМСПСПАИППО.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		РасчетЛМСПСПАИППО.Вставить("ИзменениеДисконтаНаПакет", РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛМСПСПАИППО, "ТаблицаОфертИАмортизаций", ТаблицаОфертИАмортизаций, "Таблица оферт и амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛМСПСПАИППО, "РасчетЛМСПСПАИППО", РасчетЛМСПСПАИППО, "Данные расчета ", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод с полным списанием при амортизации и пересчетом при офертах(Атомы)");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииЛинейно(НачальныйДисконт, ДнейОтПереоценкиДоПогашения, ДнейОтПокупкиДоПогашения)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
	
	// линейно дисконт считается просто:
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт * ДнейОтПереоценкиДоПогашения / ДнейОтПокупкиДоПогашения;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейно");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииДляАмортизационнойЛинейно(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, ЦенаПокупки, ДатаПереоценки, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
	
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПогашениеДисконта", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПогашениеДисконтаНаПакет", Новый ОписаниеТипов("Число"));
	
	Если ЦенаПокупки = 0 Тогда
		ЭСП = 0;
	Иначе
		ЭСП = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ТаблицаАмортизаций, ДатаПокупки, - ЦенаПокупки).Доходность;
	КонецЕсли;
	
	ПогашенияДисконтовНаПакет = 0;
	
	// списываем эти кусочки
	Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
		
		Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
		
			РазностьДат = (НачалоДня(СтрокаТаблицаАмортизаций.Дата) - НачалоДня(ДатаПокупки)) / 86400;
			
			ПогашениеДисконта =  СтрокаТаблицаАмортизаций.Поток * (1 - 1 / Pow(1 + ЭСП / 100, РазностьДат / 365));
			
			ПогашениеДисконтаНаПакет = Окр(ПогашениеДисконта * Количество, 2);
			
			РезультатРасчетаДисконтаПремии.ПогашенияДисконтов = РезультатРасчетаДисконтаПремии.ПогашенияДисконтов + ПогашениеДисконта;
			
			ПогашенияДисконтовНаПакет = ПогашенияДисконтовНаПакет + ПогашениеДисконтаНаПакет;
			
			СтрокаТаблицаАмортизаций.РазностьДат = РазностьДат;
			СтрокаТаблицаАмортизаций.ПогашениеДисконта = ПогашениеДисконта;
			СтрокаТаблицаАмортизаций.ПогашениеДисконтаНаПакет = ПогашениеДисконтаНаПакет;
			
		КонецЕсли;
	
	КонецЦикла;
	
	//ТекущийДисконт = ТекущийДисконт - ПогашенияДисконтов;
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - ПогашенияДисконтовНаПакет / Количество;
	Если ОфертаПройденаИСтоимостьРавнаНоминальной Тогда
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЭСП = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета через ЭСП для амортизационной облигации", , , Истина);	
		
		РасчетЭСП = Новый Структура;
		РасчетЭСП.Вставить("ЭСП", ЭСП);
		РасчетЭСП.Вставить("ПогашенияДисконтов", РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
		РасчетЭСП.Вставить("ПогашениеДисконтаНаПакет", ПогашениеДисконтаНаПакет);
		РасчетЭСП.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЭСП, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЭСП, "РасчетЭСП", РасчетЭСП, "Расчет через ЭСП", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейно для амортизационной бумаги");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииСАмортизациейПремииИлиДисконта(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, ДатаПереоценки, НачальныйДисконт, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
	ТаблицаАмортизаций.Колонки.Добавить("ДисконтЗаПериод", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ТекущийДисконт", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	
	ИтогАмортизаций = ТаблицаАмортизаций.Итог("Поток");
	
	РазностьДатПолная = (НачалоДня(ДатаПереоценки) - НачалоДня(ДатаПокупки)) / 86400;
	
	НоминалПриПокупке = ТаблицаАмортизаций.Итог("Поток");
	ТекущийНоминал = НоминалПриПокупке;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт;
	
	ПогашенияДисконтовНаПакет = 0;
	
	Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
		
		//ТекущийНоминал = СтрокаТаблицаАмортизаций.Номинал;
		
		Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
			
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - НачальныйДисконт * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций;
			
			ТекущийНоминал = СтрокаТаблицаАмортизаций.Номинал;
			Если НачальныйДисконт < 0 Тогда
				РезультатРасчетаДисконтаПремии.ПогашенияДисконтов = РезультатРасчетаДисконтаПремии.ПогашенияДисконтов - НачальныйДисконт / ИтогАмортизаций * СтрокаТаблицаАмортизаций.Поток;
				ПогашенияДисконтовНаПакет = ПогашенияДисконтовНаПакет - Окр(Количество * НачальныйДисконт / ИтогАмортизаций * СтрокаТаблицаАмортизаций.Поток, 2)
			КонецЕсли;
			
			СтрокаТаблицаАмортизаций.ДисконтЗаПериод = НачальныйДисконт / ИтогАмортизаций * СтрокаТаблицаАмортизаций.Поток;
			СтрокаТаблицаАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
			
		Иначе
			
			РазностьДат = (НачалоДня(СтрокаТаблицаАмортизаций.Дата) - НачалоДня(ДатаПокупки)) / 86400;	
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - НачальныйДисконт * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций / РазностьДат * РазностьДатПолная;
			
			СтрокаТаблицаАмортизаций.ДисконтЗаПериод = НачальныйДисконт * СтрокаТаблицаАмортизаций.Поток / ИтогАмортизаций / РазностьДат * РазностьДатПолная;
			СтрокаТаблицаАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
			СтрокаТаблицаАмортизаций.РазностьДат = РазностьДат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОфертаПройденаИСтоимостьРавнаНоминальной Тогда
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
	КонецЕсли;
	
	Если НачальныйДисконт > 0 Тогда // премия
		
		Если ТекущийНоминал <> 0 Тогда
			ИзменениеПремии = НачальныйДисконт - РезультатРасчетаДисконтаПремии.ТекущийДисконт;
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт - ИзменениеПремии;
		Иначе // дошли дополного погашения
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
			ИзменениеПремии = НачальныйДисконт;
		КонецЕсли;
		
	ИначеЕсли НачальныйДисконт < 0 Тогда // дисконт
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - ПогашенияДисконтовНаПакет / Количество;
		
		ИзменениеПремии = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЛинейныйСАмортизацией = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета 'Линейный метод с амотризацией дисконта или премии'", , , Истина);	
		
		РасчетЛинейныйСАмортизацией = Новый Структура;
		РасчетЛинейныйСАмортизацией.Вставить("ИтогАмортизаций", ИтогАмортизаций);
		РасчетЛинейныйСАмортизацией.Вставить("РазностьДатПолная", РазностьДатПолная);
		РасчетЛинейныйСАмортизацией.Вставить("НоминалПриПокупке", НоминалПриПокупке);
		РасчетЛинейныйСАмортизацией.Вставить("НачальныйДисконт", НачальныйДисконт);
		РасчетЛинейныйСАмортизацией.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		РасчетЛинейныйСАмортизацией.Вставить("ПогашенияДисконтов", РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
		РасчетЛинейныйСАмортизацией.Вставить("ПогашенияДисконтовНаПакет", ПогашенияДисконтовНаПакет);
		РасчетЛинейныйСАмортизацией.Вставить("ИзменениеПремии", ИзменениеПремии);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСАмортизацией, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСАмортизацией, "РасчетЛинейныйСАмортизацией", РасчетЛинейныйСАмортизацией, "Расчет линейный с амортизацией", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод с амортизацией премии или дисконта");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииМетодомНационального(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, ДатаПереоценки, НачальныйДисконт, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
	ТаблицаАмортизаций.Колонки.Добавить("ДнейОтПокупки", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("КоэффициентПериода", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ДисконтЗаПериод", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПогашениеДисконта", Новый ОписаниеТипов("Число"));
	
	ИтогАмортизаций = ТаблицаАмортизаций.Итог("Поток");
	НоминалПриПокупке = ИтогАмортизаций;
	
	ДнейОтПокупкиДоПереоценки = (НачалоДня(ДатаПереоценки) - НачалоДня(ДатаПокупки)) / 86400;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт;
	
	ПогашенияДисконтовНаПакет = 0;
	
	Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
		
		СтрокаТаблицаАмортизаций.ДнейОтПокупки = (НачалоДня(СтрокаТаблицаАмортизаций.Дата) - НачалоДня(ДатаПокупки)) / 86400;
		
		ДоляПогашенияНоминала = СтрокаТаблицаАмортизаций.Поток / НоминалПриПокупке;
		
		СтрокаТаблицаАмортизаций.КоэффициентПериода = -НачальныйДисконт * ДоляПогашенияНоминала / СтрокаТаблицаАмортизаций.ДнейОтПокупки;
		
		Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
		
			СтрокаТаблицаАмортизаций.ДисконтЗаПериод = 0;
			СтрокаТаблицаАмортизаций.ПогашениеДисконта = -НачальныйДисконт * ДоляПогашенияНоминала;
			
		Иначе
			
			СтрокаТаблицаАмортизаций.ДисконтЗаПериод = СтрокаТаблицаАмортизаций.КоэффициентПериода * ДнейОтПокупкиДоПереоценки;
			СтрокаТаблицаАмортизаций.ПогашениеДисконта = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОфертаПройденаИСтоимостьРавнаНоминальной Тогда
	//	РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0; // тут пока не ясно - ждем разъяснений
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт + ТаблицаАмортизаций.Итог("ДисконтЗаПериод");
	РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество;
	РезультатРасчетаДисконтаПремии.ИзменениеДисконтаПремии = ТаблицаАмортизаций.Итог("ДисконтЗаПериод");
	РезультатРасчетаДисконтаПремии.ПогашенияДисконтов = ТаблицаАмортизаций.Итог("ПогашениеДисконта");
	РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет = ТаблицаАмортизаций.Итог("ДисконтЗаПериод") * Количество;
	РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЛинейныйСАмортизацией = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета 'Метод Национального'", , , Истина);	
		
		РасчетЛинейныйСАмортизацией = Новый Структура;
		РасчетЛинейныйСАмортизацией.Вставить("ИтогАмортизаций", ИтогАмортизаций);
		РасчетЛинейныйСАмортизацией.Вставить("РазностьДатПолная", ДнейОтПокупкиДоПереоценки);
		РасчетЛинейныйСАмортизацией.Вставить("НоминалПриПокупке", НоминалПриПокупке);
		РасчетЛинейныйСАмортизацией.Вставить("НачальныйДисконт", НачальныйДисконт);
		РасчетЛинейныйСАмортизацией.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		РасчетЛинейныйСАмортизацией.Вставить("ПогашенияДисконтов", РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
		РасчетЛинейныйСАмортизацией.Вставить("ПогашенияДисконтовНаПакет", ПогашенияДисконтовНаПакет);
		РасчетЛинейныйСАмортизацией.Вставить("ИзменениеПремии", 0);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСАмортизацией, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСАмортизацией, "РасчетЛинейныйСАмортизацией", РасчетЛинейныйСАмортизацией, "Расчет линейный с амортизацией", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод с амортизацией премии или дисконта");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииЛинейнымМетодомСЕжедневнойПроцентнойСтавкой(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, Номинал, ДатаПереоценки, ЦенаПокупки, РасшифровкаРасчета)

	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
	
	ТаблицаАмортизаций.Колонки.Добавить("ТекущийНоминал", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("Номиналодней", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ДисконтЗаПериод", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ТекущийДисконт", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДатПремия", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СписаниеДисконта", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СписаниеТела", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ТекущееТело", Новый ОписаниеТипов("Число"));
	
	СуммаНоминалодней = 0;
	НоминалПриПокупке = ТаблицаАмортизаций.Итог("Поток");
	ТекущаяДата = ДатаПокупки;
	ТекущийНоминал = НоминалПриПокупке;
	
	Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
		
		СтрокаТаблицаАмортизаций.ТекущийНоминал = ТекущийНоминал;
		
		СтрокаТаблицаАмортизаций.РазностьДат = (СтрокаТаблицаАмортизаций.Дата - НачалоДня(ТекущаяДата)) / 86400;
		
		СтрокаТаблицаАмортизаций.Номиналодней = СтрокаТаблицаАмортизаций.ТекущийНоминал * СтрокаТаблицаАмортизаций.РазностьДат;
		СуммаНоминалодней = СуммаНоминалодней + СтрокаТаблицаАмортизаций.Номиналодней;
		
		ТекущийНоминал = ТекущийНоминал - СтрокаТаблицаАмортизаций.Поток;
		ТекущаяДата = СтрокаТаблицаАмортизаций.Дата;
	
	КонецЦикла;
	
	//ЕжедневнаяПроцентнаяСтавка = НачальныйДисконт / СуммаНоминалодней;
	
	Если Номинал = НоминалПриПокупке Тогда // когда номинал не меняется с даты покупки то и смысла нет пересчитывать по таблице
	
		// ничего не делаем
		
	ИначеЕсли НачальныйДисконт > 0 Тогда // Премия
	
		ТекущаяДата = ДатаПокупки;
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт;
		
		Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
			
			НачальнаяДата = Мин(СтрокаТаблицаАмортизаций.Дата, ДатаПереоценки);
			
			РазностьДат = (НачалоДня(НачальнаяДата) - НачалоДня(ТекущаяДата)) / 86400;
			Если РазностьДат < 0 Тогда
				РазностьДат = 0;
			КонецЕсли;
			ДисконтЗаПериод = СтрокаТаблицаАмортизаций.ТекущийНоминал * РазностьДат * НачальныйДисконт / СуммаНоминалодней;
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - ДисконтЗаПериод;
			
			ТекущаяДата = СтрокаТаблицаАмортизаций.Дата;
			
			СтрокаТаблицаАмортизаций.ДисконтЗаПериод = ДисконтЗаПериод;
			СтрокаТаблицаАмортизаций.ТекущийДисконт = ТекущийДисконт;
			СтрокаТаблицаАмортизаций.РазностьДатПремия = РазностьДат;
			
		КонецЦикла;
		
	Иначе
		
		ТекущаяДата = ДатаПокупки;
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
		ТекущееТело = ЦенаПокупки;
		Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
			
			Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
				
				ДисконтЗаПериод = СтрокаТаблицаАмортизаций.ТекущийНоминал * СтрокаТаблицаАмортизаций.РазностьДат * (-НачальныйДисконт) / СуммаНоминалодней;
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + ДисконтЗаПериод;
				
				СписаниеДисконта = РезультатРасчетаДисконтаПремии.ТекущийДисконт * СтрокаТаблицаАмортизаций.Поток / (РезультатРасчетаДисконтаПремии.ТекущийДисконт + ТекущееТело);
				СписаниеТела = СтрокаТаблицаАмортизаций.Поток - СписаниеДисконта;
				
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - СписаниеДисконта;
				ТекущееТело = ТекущееТело - СписаниеТела;
				
				СтрокаТаблицаАмортизаций.ДисконтЗаПериод = ДисконтЗаПериод;
				СтрокаТаблицаАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
				СтрокаТаблицаАмортизаций.СписаниеДисконта = СписаниеДисконта;
				СтрокаТаблицаАмортизаций.СписаниеТела = СписаниеТела;
				СтрокаТаблицаАмортизаций.ТекущееТело = ТекущееТело;
			Иначе
				
				РазностьДат = (НачалоДня(ДатаПереоценки) - НачалоДня(ТекущаяДата)) / 86400;
				Если РазностьДат < 0 Тогда
					РазностьДат = 0;
				КонецЕсли;
				ДисконтЗаПериод = СтрокаТаблицаАмортизаций.ТекущийНоминал * РазностьДат * (-НачальныйДисконт) / СуммаНоминалодней;
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + ДисконтЗаПериод;
				
				СтрокаТаблицаАмортизаций.ДисконтЗаПериод = ДисконтЗаПериод;
				СтрокаТаблицаАмортизаций.РазностьДатПремия = РазностьДат;
				СтрокаТаблицаАмортизаций.ТекущийДисконт = ТекущийДисконт;
				
			КонецЕсли;
			
			ТекущаяДата = СтрокаТаблицаАмортизаций.Дата;
			
		КонецЦикла;
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + НачальныйДисконт; // дисконт с минусом считаются
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЛинейныйСЕжедневнойСтавкой = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета 'Линейный метод с ежедневной процентной ставкой'", , , Истина);	
		
		РасчетЛинейныйСЕжедневнойСтавкой = Новый Структура;
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("НоминалПриПокупке", НоминалПриПокупке);
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("ДатаПокупки", ДатаПокупки);
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("ЦенаПокупки", ЦенаПокупки);
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("СуммаНоминалодней", СуммаНоминалодней);
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("НачальныйДисконт", НачальныйДисконт);
		РасчетЛинейныйСЕжедневнойСтавкой.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСЕжедневнойСтавкой, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСЕжедневнойСтавкой, "РасчетЛинейныйСЕжедневнойСтавкой", РасчетЛинейныйСЕжедневнойСтавкой, "Расчет линейный с ежедневной процентной ставкой", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод с ежедневной процентной ставкой");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииЛинейнымМетодомСПолнымСписаниемПриАмортизаци(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, ДатаПереоценки, ДатаОфертыПослеПокупки, РасшифровкаРасчета)
	
	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	Если НачальныйДисконт < 0 Тогда // актуально только для дисконтов, по премия списывается линейно
		
		СписывалиПолныйДисконт = Ложь;
		
		ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
		
		ТаблицаАмортизаций.Колонки.Добавить("ПрошлоДней", Новый ОписаниеТипов("Число"));
		ТаблицаАмортизаций.Колонки.Добавить("ДисконтВДеньАмортизации", Новый ОписаниеТипов("Число"));
		
		НужноНачислитьДисконта = - НачальныйДисконт;
		
		ДнейОтПокупкиДоПогашения = (НачалоДня(ДатаПогашения) - НачалоДня(ДатаПокупки)) / 86400;
		
		Для каждого СтрокаТаблицаАмортизаций Из ТаблицаАмортизаций Цикл
		
			Если СтрокаТаблицаАмортизаций.Дата < НачалоДня(ДатаПереоценки + 1) Тогда
			
				ПрошлоДней = (НачалоДня(СтрокаТаблицаАмортизаций.Дата) - НачалоДня(ДатаПокупки)) / 86400;
				
				ДисконтВДеньАмортизации = НужноНачислитьДисконта * ПрошлоДней / ДнейОтПокупкиДоПогашения;
				
				РезультатРасчетаДисконтаПремии.ПогашенияДисконтов = ДисконтВДеньАмортизации;
				
				Если ДатаОфертыПослеПокупки < СтрокаТаблицаАмортизаций.Дата Тогда
				
					СписывалиПолныйДисконт = Истина;
				
				КонецЕсли;
				
				СтрокаТаблицаАмортизаций.ПрошлоДней = ПрошлоДней;
				СтрокаТаблицаАмортизаций.ДисконтВДеньАмортизации = ДисконтВДеньАмортизации;
				
			КонецЕсли;
		
		КонецЦикла;
		
		РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - РезультатРасчетаДисконтаПремии.ПогашенияДисконтов;
		
		Если СписывалиПолныйДисконт Тогда
		
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт;
		
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
		
			РасшифровкаЛинейныйСПолнымСписанием = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета 'Линейный метод с полным списанием при амортизации'", , , Истина);	
			
			РасчетЛинейныйСПолнымСписанием = Новый Структура;
			РасчетЛинейныйСПолнымСписанием.Вставить("ДнейОтПокупкиДоПогашения", ДнейОтПокупкиДоПогашения);
			РасчетЛинейныйСПолнымСписанием.Вставить("НачальныйДисконт", НачальныйДисконт);
			РасчетЛинейныйСПолнымСписанием.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
			РасчетЛинейныйСПолнымСписанием.Вставить("СписывалиПолныйДисконт", СписывалиПолныйДисконт);
			РасчетЛинейныйСПолнымСписанием.Вставить("ПогашенияДисконтов", РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
			
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСПолнымСписанием, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
			
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйСПолнымСписанием, "РасчетЛинейныйСПолнымСписанием", РасчетЛинейныйСПолнымСписанием, "Расчет линейный с полным списанием при амортизации", Истина, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод с полным списанием при амортизации");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииЛинейнымМетодомПлюсМетодикаСафмараДляАмортизационныхОблигаций(Облигация, ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, ДатаПереоценки, РасшифровкаРасчета)
	
	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, ТекущийДисконт, 0, 0, 0, 0, 0);
	
	// в функции БухгалтерскийУчетЕПС.РассчитатьЕжедневноеПриращениеПоПотокуСафмар детально расписан алгоритм по Сафмару
	НачальныйДисконтДляРасчета = -НачальныйДисконт; // Для премии (она > 0) будет отрицательное приращения, а для дисконта положительное
	
	ТаблицаАмортизаций = БухгалтерскийУчетЕПС.ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
	ТаблицаАмортизаций.Колонки.Добавить("Период", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СуммаПоПотоку", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ЗаПериод", Новый ОписаниеТипов("Число"));
	
	Если ТаблицаАмортизаций.Количество() > 1 Тогда
	
		МинимальнаяТочкаРазрыва = 1;
		Для каждого СтрокаАмортизаций Из ТаблицаАмортизаций Цикл
			СтрокаАмортизаций.Период = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(СтрокаАмортизаций.Дата, ДатаПокупки);
			МинимальнаяТочкаРазрыва = Мин(МинимальнаяТочкаРазрыва, 1 / СтрокаАмортизаций.Период);
		КонецЦикла;
		
		Если НачальныйДисконт < 0 Тогда
			МинимумДиапазонаРасчета = 0;
			МаксимумДиапазонаРасчета = МинимальнаяТочкаРазрыва * 0.999;
		Иначе	
			МинимумДиапазонаРасчета = -МинимальнаяТочкаРазрыва * 0.999;
			МаксимумДиапазонаРасчета = 0;
		КонецЕсли;
		
		ЕжедневноеПриращение = РассчитатьЕжедневноеПриращениеПоПотокуСафмар(ТаблицаАмортизаций, МинимумДиапазонаРасчета, МаксимумДиапазонаРасчета, НачальныйДисконтДляРасчета);
		
	Иначе
	
		СтрокаАмортизаций = ТаблицаАмортизаций[0];
		СтрокаАмортизаций.Период = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(СтрокаАмортизаций.Дата, ДатаПокупки);
		ЕжедневноеПриращение = Окр(НачальныйДисконтДляРасчета / СтрокаАмортизаций.Период / (СтрокаАмортизаций.Поток - НачальныйДисконтДляРасчета), 20);
	
	КонецЕсли;
	
	ТекущийДисконтПремия = 0;
	ДнейОтПокупкиДоПереоценки = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ДатаПереоценки, ДатаПокупки);
	СписаниеПремий = 0;
	
	Для каждого СтрокаАмортизаций Из ТаблицаАмортизаций Цикл
		
		Если СтрокаАмортизаций.Период > ДнейОтПокупкиДоПереоценки 
			ИЛИ (НачалоДня(ДатаПереоценки) = НачалоДня(ДатаПогашения) И НачальныйДисконт < 0) Тогда
			СуммаПоПотоку = Окр(СтрокаАмортизаций.Поток / (1 + СтрокаАмортизаций.Период * ЕжедневноеПриращение), 12);
			ТекущийДисконтПремия = ТекущийДисконтПремия + Окр(СуммаПоПотоку * ЕжедневноеПриращение * ДнейОтПокупкиДоПереоценки, 15);
			
			СтрокаАмортизаций.СуммаПоПотоку = СуммаПоПотоку;
			СтрокаАмортизаций.ЗаПериод = Окр(СуммаПоПотоку * ЕжедневноеПриращение * ДнейОтПокупкиДоПереоценки, 15);
			
		ИначеЕсли НачальныйДисконт > 0 Тогда
			СписаниеПремий = СписаниеПремий + СтрокаАмортизаций.Поток / (1 + СтрокаАмортизаций.Период * ЕжедневноеПриращение) * ЕжедневноеПриращение * СтрокаАмортизаций.Период;
			
			СтрокаАмортизаций.ЗаПериод = СтрокаАмортизаций.Поток / (1 + СтрокаАмортизаций.Период * ЕжедневноеПриращение) * ЕжедневноеПриращение * СтрокаАмортизаций.Период;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = ТекущийДисконтПремия + НачальныйДисконт + СписаниеПремий;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаСафмар = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета 'метедика Сафмар'", , , Истина);	
		
		РасчетСафмар = Новый Структура;
		РасчетСафмар.Вставить("НачальныйДисконт", НачальныйДисконт);
		РасчетСафмар.Вставить("ЕжедневноеПриращение", ЕжедневноеПриращение);
		РасчетСафмар.Вставить("ДнейОтПокупкиДоПереоценки", ДнейОтПокупкиДоПереоценки);
		РасчетСафмар.Вставить("СписаниеПремий", СписаниеПремий);
		РасчетСафмар.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаСафмар, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаСафмар, "РасчетСафмар", РасчетСафмар, "Расчет Сафмар", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Линейный метод плюс методика сафмара для амортизационныхОблигаций");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

Функция РасчетДисконтаПремииЧерезЭСП(Облигация, ДатаПокупки, ДатаПогашения, Номинал, ЦенаПокупки, НачальныйДисконт, ДатаПереоценки, ДнейОтПокупкиДоПогашения, ДнейОтПереоценкиДоПогашения, НастройкиУчета, РасшифровкаРасчета)
	
	РезультатРасчетаДисконтаПремии = Новый Структура("ОценочныеДисконтПремия, ТекущийДисконт, ТекущийДисконтНаПакет, ИзменениеДисконтаПремии, ПогашенияДисконтов, ИзменениеДисконтаНаПакет, ОценочныйДисконтНаПакет", 0, 0, 0, 0, 0, 0, 0);
		
	Если Облигация.Амортизационная Тогда
		
		ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения);
		
	Иначе	
	
		ТаблицаАмортизаций = Новый ТаблицаЗначений;
		
		ТаблицаАмортизаций.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		ТаблицаАмортизаций.Колонки.Добавить("Поток", Новый ОписаниеТипов("Число"));
		
		НоваяСтрока = ТаблицаАмортизаций.Добавить();
		НоваяСтрока.Дата = ДатаПогашения;
		НоваяСтрока.Поток = Номинал;
	
	КонецЕсли;
	
	Если ЦенаПокупки = 0 Тогда
		ЭСП = 0;
	Иначе
		Результат = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ТаблицаАмортизаций, ДатаПокупки, - ЦенаПокупки);
		ЭСП = Результат.Доходность;
	КонецЕсли;
	
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("РазностьДатНИ", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СтоимостьЭСП", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПроцентыЭСП", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СуммаДень", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СуммаДеньНИ", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("СуммаПериодНИ", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПрошлоДней", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ТекущийДисконт", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("ПогашениеДисконта", Новый ОписаниеТипов("Число"));
	
	КоличествоСтрок = ТаблицаАмортизаций.Количество();
	СуммаДеньНИ = 0;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
	
		ТекущаяСтрока = ТаблицаАмортизаций[КоличествоСтрок - НомерСтроки];
		
		ТекущаяСтрока.РазностьДатНИ = (НачалоДня(ТекущаяСтрока.Дата) - НачалоДня(ДатаПокупки)) / 86400;
		
		ТекущаяСтрока.СтоимостьЭСП = ТекущаяСтрока.Поток / Pow(1 + ЭСП / 100, ТекущаяСтрока.РазностьДатНИ / 365);
		ТекущаяСтрока.ПроцентыЭСП = ТекущаяСтрока.СтоимостьЭСП * Pow(1 + ЭСП / 100, ТекущаяСтрока.РазностьДатНИ / 365) - ТекущаяСтрока.СтоимостьЭСП;
		ТекущаяСтрока.СуммаДень = ТекущаяСтрока.ПроцентыЭСП / ТекущаяСтрока.РазностьДатНИ;
		
		ТекущаяСтрока.ПогашениеДисконта = 0;
		Если НачальныйДисконт < 0 Тогда // купили с дисконтом - будем считать его погашения при амортизации
		
			ТекущаяСтрока.ПогашениеДисконта = ТекущаяСтрока.СтоимостьЭСП * Pow(1 + ЭСП / 100, ТекущаяСтрока.РазностьДатНИ / 365) - ТекущаяСтрока.СтоимостьЭСП;
			
		КонецЕсли;
		
		
		СуммаДеньНИ = СуммаДеньНИ + ТекущаяСтрока.СуммаДень;
		ТекущаяСтрока.СуммаДеньНИ = СуммаДеньНИ;
		
		Если НомерСтроки = КоличествоСтрок Тогда
			
			ТекущаяСтрока.РазностьДат = (НачалоДня(ТекущаяСтрока.Дата) - НачалоДня(ДатаПокупки)) / 86400;
			
		Иначе
			
			ПредыдущаяСтрока = ТаблицаАмортизаций[КоличествоСтрок - НомерСтроки - 1];
			
			ТекущаяСтрока.РазностьДат = (НачалоДня(ТекущаяСтрока.Дата) - НачалоДня(ПредыдущаяСтрока.Дата)) / 86400;
			
		КонецЕсли;
		
		ТекущаяСтрока.СуммаПериодНИ = ТекущаяСтрока.СуммаДеньНИ * ТекущаяСтрока.РазностьДат;
		
	КонецЦикла;
	
	// теперь, когда адская таблица заполнена начинаем считать 
	РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
	ПогашениеДисконта = 0;
	Для каждого СтрокаТаблицыАмортизаций Из ТаблицаАмортизаций Цикл
		
		Если НачалоДня(СтрокаТаблицыАмортизаций.Дата) < НачалоДня(ДатаПереоценки) Тогда
			
			ПогашениеДисконта = ПогашениеДисконта + СтрокаТаблицыАмортизаций.ПогашениеДисконта;
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + СтрокаТаблицыАмортизаций.СуммаПериодНИ;
			СтрокаТаблицыАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
			
		Иначе
			
			Если КонецДня(СтрокаТаблицыАмортизаций.Дата) = ДатаПереоценки Тогда
				ПогашениеДисконта = ПогашениеДисконта + СтрокаТаблицыАмортизаций.ПогашениеДисконта;
			КонецЕсли;
			
			ОсталосьДнейВПериоде = (НачалоДня(СтрокаТаблицыАмортизаций.Дата) - НачалоДня(ДатаПереоценки)) / 86400;
			СтрокаТаблицыАмортизаций.ПрошлоДней = СтрокаТаблицыАмортизаций.РазностьДат - ОсталосьДнейВПериоде;
			
			Если Облигация.Амортизационная Тогда //вот тут вот немного бяка, но она в очень мелких долях сказывается - пока пусь
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + СтрокаТаблицыАмортизаций.СуммаДеньНИ * СтрокаТаблицыАмортизаций.ПрошлоДней;
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + НачальныйДисконт;
			Иначе
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт + СтрокаТаблицыАмортизаций.СтоимостьЭСП * Pow(1 + ЭСП / 100, СтрокаТаблицыАмортизаций.ПрошлоДней / 365) - СтрокаТаблицыАмортизаций.Поток;
			КонецЕсли;
			
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт - ПогашениеДисконта;
			
			СтрокаТаблицыАмортизаций.ТекущийДисконт = РезультатРасчетаДисконтаПремии.ТекущийДисконт;
			
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если ДнейОтПокупкиДоПогашения < 365
		И НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ВЗависимостиОтКритерияСущественности
		И НастройкиУчета.КритерийСущественностиДисконтаПремии > 0 Тогда
		
		ЛинейныйТекущийДисконт = НачальныйДисконт * ДнейОтПереоценкиДоПогашения / ДнейОтПокупкиДоПогашения;
		
		Если ЛинейныйТекущийДисконт = 0 Тогда
			Если РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0 Тогда // только купили
				Оклонение = 0;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проценты, рассчитанные линейным методом для ценной бумаги " + Строка(Облигация) + " равны нулю");
				Оклонение = 100;
			КонецЕсли;
		Иначе
			Оклонение = (РезультатРасчетаДисконтаПремии.ТекущийДисконт - ЛинейныйТекущийДисконт) / ЛинейныйТекущийДисконт * 100;			
		КонецЕсли; 
		
		//Оклонение = (ЛинейныйТекущийДисконт - ТекущийДисконт) / ЛинейныйТекущийДисконт * 100;
		Оклонение = Макс(Оклонение, - Оклонение);
		
		Если Оклонение < НастройкиУчета.КритерийСущественностиДисконтаПремии Тогда
		
			РезультатРасчетаДисконтаПремии.ТекущийДисконт = ЛинейныйТекущийДисконт;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаЭСП = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета через ЭСП для амортизационной облигации", , , Истина);	
		
		РасчетЭСП = Новый Структура;
		РасчетЭСП.Вставить("ЭСП", ЭСП);
		РасчетЭСП.Вставить("ТекущийДисконт", РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЭСП, "ТаблицаАмортизаций", ТаблицаАмортизаций, "Таблица амортизаций", Истина);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЭСП, "РасчетЭСП", РасчетЭСП, "Расчет через ЭСП", Истина, Истина);
		
	КонецЕсли;
	
	РезультатРасчетаДисконтаПремии.Вставить("МетодРасчета", "Через ЭСП");
	
	Возврат РезультатРасчетаДисконтаПремии;

КонецФункции 

#КонецОбласти

#Область Расчет_стоимости_по_ЭСП

Функция РасчетСтоимостиПоЭСПМетодомЧИСТНЗ(Облигация, ДатаПереоценки, ДатаОпределенияДенежногоПотока, СчитаемДоПогашения, ЭСП, СчетДоверительногоУправления, НастройкиУчета, ДанныеПереоценки, ТочностьРасчетов = Неопределено, ДенежныйПотокВх = Неопределено, Отказ, РасшифровкаРасчета = Неопределено)

	ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов;	
	Если НастройкиУчета.ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.БухгалтерскийУчет;
	КонецЕсли;
	
	НастройкиЦелиРасчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ЦельРасчета);
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки));
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, ДатаПереоценки, Облигация, Отказ);
	
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения",		СчитаемДоПогашения);
	ПараметрыДенежногоПотока.Вставить("УчитыватьКупонКОферте",	НастройкиУчета.УчитыватьКупонКОферте);

	ПараметрыДенежногоПотока.Вставить("Дата",				ДатаОпределенияДенежногоПотока);
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",		ДатаОпределенияДенежногоПотока);
	ПараметрыДенежногоПотока.Вставить("НастройкиУчета",		НастройкиУчета);
	
	Если НастройкиУчета.Свойство("ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона_Переопределена") Тогда
		ПараметрыДенежногоПотока.Вставить("ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона",	НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона);
	КонецЕсли;
	
	Если ДенежныйПотокВх = Неопределено Тогда
		ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ДанныеПереоценки, Отказ);
	Иначе
		ДенежныйПоток = ДенежныйПотокВх;
	КонецЕсли;
	
	ДенежныйПоток.Свернуть("Дата", "Поток");
	ДенежныйПоток.Сортировать("Дата");
	
	ДенежныйПоток.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("ПроцентыПоЭСПЗаПериод", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("СтоимостьЭСПДоВычитанияПотока", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("СтоимостьЭСППослеВычитанияПотока", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("ПроцентыЭспНакопленные", Новый ОписаниеТипов("Число"));
	
	СтоимостьПоЭСП = 0;
	
	Для каждого СтрокаДенежныйПоток Из ДенежныйПоток Цикл
		
		Если НачалоДня(СтрокаДенежныйПоток.Дата) < НачалоДня(ДатаПереоценки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДенежныйПоток.РазностьДат = (НачалоДня(СтрокаДенежныйПоток.Дата) - НачалоДня(ДатаПереоценки)) / 86400;
		
		СтрокаДенежныйПоток.СтоимостьЭСПДоВычитанияПотока = Pow(1 + ЭСП / 100, СтрокаДенежныйПоток.РазностьДат / 365);
		Если ТочностьРасчетов <> Неопределено
			И ТочностьРасчетов <> 2 Тогда	// пришлось сделать специальное условие для Ростеха (см. вызов этой функции из РассчитатьКорректировкуПоЭСП)
			                                // т.к. только им пришла в голову идея округлять до 2х(!!!) знаков потоки (см. переменная ТочностьОкругленияДисконтируемыхСуммДенежныхПотоковПриРасчетеАС)
											// причем вот тут они не округляют, а ниже округляют!
			СтрокаДенежныйПоток.СтоимостьЭСПДоВычитанияПотока = Окр(СтрокаДенежныйПоток.СтоимостьЭСПДоВычитанияПотока, ТочностьРасчетов);	
		КонецЕсли;
			
		СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод = СтрокаДенежныйПоток.Поток / СтрокаДенежныйПоток.СтоимостьЭСПДоВычитанияПотока;
		Если ТочностьРасчетов <> Неопределено Тогда
			СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод = Окр(СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод, ТочностьРасчетов);
		КонецЕсли;
		
		СтоимостьПоЭСП = СтоимостьПоЭСП + СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод;
		
		СтрокаДенежныйПоток.СтоимостьЭСППослеВычитанияПотока = СтоимостьПоЭСП;
	
	КонецЦикла;
	
	Если НастройкиУчета.РазрядностьОкругленияАС <> 0 Тогда
	    СтоимостьПоЭСП = Окр(СтоимостьПоЭСП, НастройкиУчета.РазрядностьОкругленияАС);
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		ПараметрыДенежногоПотока.Вставить("ЭСП", ЭСП);
		ПараметрыДенежногоПотока.Вставить("ТочностьРасчетов", ТочностьРасчетов);
		ПараметрыДенежногоПотока.Вставить("СтоимостьПоЭСП", СтоимостьПоЭСП);
		ПараметрыДенежногоПотока.Удалить("НастройкиУчета");
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РасчетМетодомЧИСТНЗ", ПараметрыДенежногоПотока, "Расчет методом ЧИСТНЗ", Истина, Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДенежныйПоток", ДенежныйПоток, "Денежный поток", Истина);
		
	КонецЕсли;
	
	Возврат СтоимостьПоЭСП;

КонецФункции

Функция РасчетСтоимостиПоЭСПИтерационнымМетодом(Облигация, УчетныйАктивЕПС, ДатаПокупки, НачальнаяСтоимость, ДатаПереоценки, СчитаемДоПогашения, ЭСП, СчетДоверительногоУправления, НастройкиУчета, ДанныеПереоценки, Количество, РасшифровкаРасчета = Неопределено)

	НастройкиУчетаАктива = Неопределено;
	Если НастройкиУчета.РасчетСтоимостиИтерационноЕжедневноСПромежуточнымОкруглением Тогда
		НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(ДатаПереоценки, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, УчетныйАктивЕПС, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	КонецЕсли;
	
	ПараметрыДенежногоПотока = Новый Структура;
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения",		СчитаемДоПогашения);
	ПараметрыДенежногоПотока.Вставить("Дата",					ДатаПокупки);
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",			ДатаПереоценки);
	ПараметрыДенежногоПотока.Вставить("УчитыватьКупонКОферте",	НастройкиУчета.УчитыватьКупонКОферте);
	
	ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ДанныеПереоценки);
	ДенежныйПоток.Свернуть("Дата", "Поток");
	ДенежныйПоток.Сортировать("Дата");
	
	ДенежныйПоток.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("ПроцентыПоЭСПЗаПериод", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("СтоимостьЭСПДоВычитанияПотока", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("СтоимостьЭСППослеВычитанияПотока", Новый ОписаниеТипов("Число"));
	ДенежныйПоток.Колонки.Добавить("ПроцентыЭспНакопленные", Новый ОписаниеТипов("Число"));
	
	СтоимостьПоЭСП = НачальнаяСтоимость;
	ПроцентыПоЭСП = 0;
	
	ТекущаяДата = ДатаПокупки;
	
	Для каждого СтрокаДенежныйПоток Из ДенежныйПоток Цикл
		
		СтрокаДенежныйПоток.СтоимостьЭСПДоВычитанияПотока = СтоимостьПоЭСП;
		
		Если СтрокаДенежныйПоток.Дата <= НачалоДня(ДатаПереоценки) Тогда
			КонечнаяДатаПериода = СтрокаДенежныйПоток.Дата;
		Иначе
			КонечнаяДатаПериода = ДатаПереоценки;
		КонецЕсли;
		
		СтрокаДенежныйПоток.РазностьДат = (НачалоДня(КонечнаяДатаПериода) - НачалоДня(ТекущаяДата)) / 86400;
		
		Если НастройкиУчета.РасчетСтоимостиИтерационноЕжедневноСПромежуточнымОкруглением Тогда
			
			СтоимостьПоЭСПДляРасчетаПоДням = СтоимостьПоЭСП * Количество;
			ПредыдущийДень = НачалоДня(ТекущаяДата);
			ПроцентыПоЭСПИтого = 0;
			
			ДниНачисленияКорректировкиЭСП = Новый Массив;
			ТекДень = НачалоДня(ТекущаяДата) + 86400;
			Пока ТекДень <= НачалоДня(КонечнаяДатаПериода) Цикл
				ДниНачисленияКорректировкиЭСП.Добавить(ТекДень);
				ТекДень = ТекДень + 86400;
			КонецЦикла; 
			
			//ДниНачисленияКорректировкиЭСП = ПолучитьДниНачисленияКорректировкиЭСП(НачалоДня(ТекущаяДата) + 86400, НачалоДня(КонечнаяДатаПериода), Облигация, СчетДоверительногоУправления, НастройкиУчета, НастройкиУчетаАктива);
			
			Для каждого ТекущийДень Из ДниНачисленияКорректировкиЭСП Цикл
				
				РазностьДат = (ТекущийДень - ПредыдущийДень) / 86400;
				
				ПроцентыПоЭСПЗаПериод = Окр(СтоимостьПоЭСПДляРасчетаПоДням * Pow(1 + ЭСП / 100, РазностьДат / 365), 2) - СтоимостьПоЭСПДляРасчетаПоДням;
				ПроцентыПоЭСПИтого = ПроцентыПоЭСПИтого + ПроцентыПоЭСПЗаПериод;
				СтоимостьПоЭСПДляРасчетаПоДням = СтоимостьПоЭСПДляРасчетаПоДням + ПроцентыПоЭСПЗаПериод;
				
				ПредыдущийДень = ТекущийДень;
			
			КонецЦикла;
			
			СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод = ПроцентыПоЭСПИтого / Количество;
			
		Иначе // нормальные люди считают сразу за весь период
			
			СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод = СтоимостьПоЭСП * Pow(1 + ЭСП / 100, СтрокаДенежныйПоток.РазностьДат / 365) - СтоимостьПоЭСП;
			
		КонецЕсли;
		
		ПроцентыПоЭСП = ПроцентыПоЭСП + СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод;
		
		СтоимостьПоЭСП = СтоимостьПоЭСП + СтрокаДенежныйПоток.ПроцентыПоЭСПЗаПериод;
		
		Если СтрокаДенежныйПоток.Дата <= НачалоДня(ДатаПереоценки) Тогда
			СтоимостьПоЭСП = СтоимостьПоЭСП - СтрокаДенежныйПоток.Поток;
		КонецЕсли;
		
		СтрокаДенежныйПоток.СтоимостьЭСППослеВычитанияПотока	= СтоимостьПоЭСП;
		СтрокаДенежныйПоток.ПроцентыЭспНакопленные				= ПроцентыПоЭСП;
		
		ТекущаяДата = СтрокаДенежныйПоток.Дата;
		
		Если СтрокаДенежныйПоток.Дата >= НачалоДня(ДатаПереоценки) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НастройкиУчета.РазрядностьОкругленияАС <> 0 Тогда
	    СтоимостьПоЭСП = Окр(СтоимостьПоЭСП, НастройкиУчета.РазрядностьОкругленияАС);
	    ПроцентыПоЭСП = Окр(ПроцентыПоЭСП, НастройкиУчета.РазрядностьОкругленияАС);
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		ПараметрыДенежногоПотока.Вставить("ЭСП", ЭСП);
		ПараметрыДенежногоПотока.Вставить("РасчетСтоимостиИтерационноЕжедневноСПромежуточнымОкруглением", НастройкиУчета.РасчетСтоимостиИтерационноЕжедневноСПромежуточнымОкруглением);
		ПараметрыДенежногоПотока.Вставить("НачальнаяСтоимость", НачальнаяСтоимость);
		ПараметрыДенежногоПотока.Вставить("СтоимостьПоЭСП", СтоимостьПоЭСП);
		ПараметрыДенежногоПотока.Вставить("ПроцентыПоЭСП", ПроцентыПоЭСП);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РасчетИтерационнымМетодом", ПараметрыДенежногоПотока, "Расчет итерационным методом", Истина, Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДенежныйПоток", ДенежныйПоток, "Денежный поток", Истина);
		
	КонецЕсли;
	
	Возврат Новый Структура("СтоимостьПоЭСП, ПроцентыПоЭСП", СтоимостьПоЭСП, ПроцентыПоЭСП);
	
КонецФункции

#КонецОбласти

#Область Формирование_проводок

Функция ОпределитьНоминальныеСуммыПогашения(ДанныеПогашения, ДанныеБумаги, ОбъектДокумента, ВалютаУчета, Отказ)

	Если ТипЗнч(ДанныеПогашения.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		
		НоминальнаяСумма = ДанныеПогашения.Количество * Справочники.Облигации.ПолучитьНоминал(ДанныеПогашения.ЦеннаяБумага, ДанныеПогашения.Дата);
		Если ДанныеБумаги.ВалютаНоминала = ВалютаУчета Тогда
			НоминальнаяСуммаВВалютеУчета = НоминальнаяСумма;
		Иначе
			НоминальнаяСуммаВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(НоминальнаяСумма, ДанныеБумаги.ВалютаНоминала, ОбъектДокумента.Дата, ВалютаУчета, ОбъектДокумента.Дата, Отказ);
		КонецЕсли;

		Если ДанныеПогашения.ВалютаОплаты = ДанныеБумаги.ВалютаНоминала Тогда
			НоминальнаяСуммаКупона = ДанныеПогашения.СуммаКупона;
		Иначе // делаем запрос, боясь нарваться на копейки при пересчете курса
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КупонныйДоходПоОблигациям.СуммаКупона
				|ИЗ
				|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
				|ГДЕ
				|	КупонныйДоходПоОблигациям.Облигация = &Облигация
				|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &ДатаОкончанияКупона";
			
			Запрос.УстановитьПараметр("ДатаОкончанияКупона", НачалоДня(ДанныеПогашения.Дата));
			Запрос.УстановитьПараметр("Облигация", ДанныеПогашения.ЦеннаяБумага);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			    НоминальнаяСуммаКупона = ВыборкаДетальныеЗаписи.СуммаКупона * ДанныеПогашения.Количество;
			Иначе
				НоминальнаяСуммаКупона = Справочники.Облигации.ПолучитьКупон(ДанныеПогашения.ЦеннаяБумага, ДанныеПогашения.Дата) * ДанныеПогашения.Количество;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеПогашения.ВалютаОплаты = ВалютаУчета Тогда
			НоминальнаяСуммаКупонаВВалютеУчета = ДанныеПогашения.СуммаКупона;
		Иначе
			НоминальнаяСуммаКупонаВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(НоминальнаяСуммаКупона, ДанныеБумаги.ВалютаНоминала, ОбъектДокумента.Дата, ВалютаУчета, ОбъектДокумента.Дата, Отказ);
		КонецЕсли;
		
	Иначе // паи, ису, векселя - пока одни рубли (пока)
		
		НоминальнаяСумма = ДанныеПогашения.Сумма;
		НоминальнаяСуммаВВалютеУчета = ДанныеПогашения.Сумма;
		
		НоминальнаяСуммаКупона = 0;
		НоминальнаяСуммаКупонаВВалютеУчета = 0;
		
	КонецЕсли;
	
	Возврат Новый Структура("НоминальнаяСумма, НоминальнаяСуммаВВалютеУчета, НоминальнаяСуммаКупона, НоминальнаяСуммаКупонаВВалютеУчета", 
		НоминальнаяСумма, НоминальнаяСуммаВВалютеУчета, НоминальнаяСуммаКупона, НоминальнаяСуммаКупонаВВалютеУчета);

КонецФункции

Процедура СформироватьПроводкиСписанияЦеннойБумаги(УчетныйРегистр, ОбъектДокумента, Отказ) Экспорт 
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ОбъектДокумента.Дата,
		ОбъектДокумента.Организация,
		ОбъектДокумента.СчетДоверительногоУправления);
		
	УчитыватьПрошедшиеПлатежи = Ложь;
	Если НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423ПриОплатеВДеньТПлюс Тогда
		
		Если БухгалтерскийУчетЕПС.ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423(ОбъектДокумента, "Списание") Тогда
		
			НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;
			УчитыватьПрошедшиеПлатежи = Истина;
			
		Иначе
			
			НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47408;
		
		КонецЕсли;
		
	КонецЕсли;
		
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	Движения = ОбъектДокумента.Движения;
	
	ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов = БухгалтерскийУчет.ОпределитьНастройкуУчета(
														ОбъектДокумента.Дата,
														ОбъектДокумента.Организация,
														ОбъектДокумента.СчетДоверительногоУправления,
														"ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов");
	
	ЭтоСписаниеЦеннойБумаги		= (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.СписаниеЦеннойБумаги"));
	ЭтоПогашениеЦеннойБумаги	= (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПогашениеЦеннойБумаги"));
	ЭтоОплата					= (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата"));
	
	Если ЭтоПогашениеЦеннойБумаги Тогда
		ПогашениеСсылка = ОбъектДокумента.Ссылка;
	ИначеЕсли ЭтоСписаниеЦеннойБумаги Тогда
		ПогашениеСсылка = ОбъектДокумента.ПогашениеЦеннойБумаги;
	ИначеЕсли ЭтоОплата Тогда
		ПогашениеСсылка = ОбъектДокумента.Основания[0].Основание;
	КонецЕсли;
	
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	Если (ЭтоСписаниеЦеннойБумаги Или ЭтоОплата) И НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности(ПогашениеСсылка) Тогда
		// бумага не была списана в день погашения и весь НКД ранее был перенесен на эту аналитику
		АналитикаКупонНачисленный 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;	
		АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	Иначе
		АналитикаКупонНачисленный 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
		АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	КонецЕсли;	
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДебиторкиПоТелу 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
	АналитикаДебиторкиПоКупону 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	
	ДанныеПогашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПогашениеСсылка, "Дата, ЦеннаяБумага, ВалютаОплаты, Количество, Сумма, СуммаКупона");
	Если ТипЗнч(ДанныеПогашения.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
		ДанныеБумаги = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПогашения.ЦеннаяБумага, "ВалютаНоминала");
		
		РеквизитыПИФ = РегистрыСведений.РеквизитыПИФ.ПолучитьРеквизитыПИФ(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПогашения.ЦеннаяБумага, "ПаевойИнвестиционныйФонд"), ДанныеПогашения.Дата);
		ДанныеБумаги.Вставить("Эмитент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПИФ.УправляющаяКомпания, "ЮрФизЛицо"));
	Иначе
		ДанныеБумаги = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПогашения.ЦеннаяБумага, "ВалютаНоминала, Эмитент");
	КонецЕсли;	
	Контрагент = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ДанныеПогашения.ЦеннаяБумага, ДанныеПогашения.Дата);
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	
	СубконтоЦБ_Р = Новый Массив;
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Резервы);
	
	// читаем движения партий
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиНаКонецДня
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&КонецДня,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
		|ГДЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ОстаткиДенежныхСредств.Сумма) КАК Сумма,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств,
		|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) КАК ДеньПлатежа
		|ПОМЕСТИТЬ _ФактическиеПлатежи
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Период >= &ДатаПогашения
		|	И ОстаткиДенежныхСредств.Период <= &КонецДня
		|	И ОстаткиДенежныхСредств.Регистратор В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ОплатаОснования.Ссылка КАК Ссылка
		|			ИЗ
		|				Документ.Оплата.Основания КАК ОплатаОснования
		|			ГДЕ
		|				ОплатаОснования.Основание = &ПогашениеСсылка)
		|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая))
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ),
		|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств,
		|	ОстаткиДенежныхСредств.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета) КАК ДисконтПремияНачисленныйВВалютеУчета
		|ПОМЕСТИТЬ _Перекурсовка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.Количество = 0
		|	И БухПартииЦенныхБумаг.Стоимость = 0
		|	И БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|	И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|	И БухПартииЦенныхБумаг.ДисконтПремияНачисленный = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.Количество КАК Количество,
		|	БухПартииЦенныхБумаг.Стоимость КАК Стоимость,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьКупона КАК СтоимостьКупона,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|			ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПремияНачисленная,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|			ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПремияНачисленнаяВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремия < 0
		|			ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДисконтНачисленный,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремия < 0
		|			ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДисконтНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.ИндексацияНоминала КАК ИндексацияНоминала,
		|	БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)) КАК ДатаПокупки
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	МАКСИМУМ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК АналитикаРезерва,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчетаРезерва
		|ПОМЕСТИТЬ _АналитикаРезервов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов
		|				ИЗ
		|					_ДвиженияПартий КАК _ДвиженияПартий
		|				ГДЕ
		|					_ДвиженияПартий.СуммаРезервовПодОбесценение > 0),
		|			&СубконтоЦБ_Р,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &ЦеннаяБумага) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	СчетУчетаРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.Количество КАК Количество,
		|	_ДвиженияПартий.Стоимость + ВЫБОР
		|		КОГДА _ДвиженияПартий.ЦеннаяБумага <> &Облигация_РЖД_11
		|			ТОГДА 0
		|		ИНАЧЕ _ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная
		|	КОНЕЦ КАК Стоимость,
		|	_ДвиженияПартий.СтоимостьВВалютеУчета + ВЫБОР
		|		КОГДА _ДвиженияПартий.ЦеннаяБумага <> &Облигация_РЖД_11
		|			ТОГДА 0
		|		ИНАЧЕ _ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная
		|	КОНЕЦ КАК СтоимостьВВалютеУчета,
		|	_ДвиженияПартий.Переоценка КАК Переоценка,
		|	_ДвиженияПартий.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	_ДвиженияПартий.СтоимостьКупона КАК СтоимостьКупона,
		|	_ДвиженияПартий.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ДвиженияПартий.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ДвиженияПартий.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ДвиженияПартий.ПремияНачисленная КАК ПремияНачисленная,
		|	_ДвиженияПартий.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета,
		|	_ДвиженияПартий.ДисконтНачисленный КАК ДисконтНачисленный,
		|	_ДвиженияПартий.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета,
		|	_ДвиженияПартий.КорректировкаЭСП КАК КорректировкаЭСП,
		|	_ДвиженияПартий.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	_ДвиженияПартий.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_ДвиженияПартий.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	_ДвиженияПартий.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиПартий.ДатаПокупки КАК ДатаПокупки,
		|	ЕСТЬNULL(_АналитикаРезервов.АналитикаРезерва, &АналитикаРезерваПоУмолчанию) КАК АналитикаРезерва,
		|	_ДвиженияПартий.Партия КАК Партия,
		|	_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ДвиженияИОстаткиПартий
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага
		|			И _ДвиженияПартий.УчетныйАктивЕПС = _ОстаткиПартий.УчетныйАктивЕПС
		|			И _ДвиженияПартий.Партия = _ОстаткиПартий.Партия
		|			И _ДвиженияПартий.СтрокаПартии = _ОстаткиПартий.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаРезервов КАК _АналитикаРезервов
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _АналитикаРезервов.ЦеннаяБумага
		|			И _ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов = _АналитикаРезервов.СчетУчетаРезерва";

	Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ПогашениеСсылка", ПогашениеСсылка);
	Запрос.УстановитьПараметр("ДатаПогашения", ДанныеПогашения.Дата);
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ОбъектДокумента.Дата));
	Запрос.УстановитьПараметр("ЦеннаяБумага", ДанныеПогашения.ЦеннаяБумага);
	Запрос.УстановитьПараметр("СубконтоЦБ_Р", СубконтоЦБ_Р);
	Запрос.УстановитьПараметр("АналитикаРезерваПоУмолчанию", Справочники.Резервы.РезервОбесценениеУбытки12Месяцев);
	// у нее корректировка ПП пошла в тело, пока хардкод, будет исправляться по задаче по корректировке ПП
	Запрос.УстановитьПараметр("Облигация_РЖД_11", ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_11"));
	
	Запрос.Выполнить();
	
	ДвиженияПартий			= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияИОстаткиПартий"].ПолучитьДанные().Выгрузить();
	ФактическиеПлатежи	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ФактическиеПлатежи"].ПолучитьДанные().Выгрузить();
	Перекурсовка		= Запрос.МенеджерВременныхТаблиц.Таблицы["_Перекурсовка"].ПолучитьДанные().Выгрузить();
	
	// для списания ВСЕГДа должно быть списание партий, а для погашения если мы сюда попали, то тоже обязано быть списание партий, для оплат партии не обязательны - по ним ошибку не генерим
	Если ДвиженияПартий.Количество() = 0 Тогда
		Если ЭтоСписаниеЦеннойБумаги ИЛИ ЭтоПогашениеЦеннойБумаги Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ОбъектДокумента.Ссылка,,, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// у валютных бумаг если оплата или снисание идет в день отличный от дня погашения возможна перекурсовка
	Для каждого СтрокаПерекурсовка Из Перекурсовка Цикл
		
		ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС,
			|СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, 
			|ДисконтНачисленныйВВалютеУчета, ДисконтПремияНачисленныйВВалютеУчета, ДисконтПремияНачисленныйОстаток, 
			|ПереоценкаВВалютеУчета, ПереоценкаОстаток, 
			|КорректировкаЭСПВВалютеУчета, КорректировкаЭСПОстаток,
			|РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
			СтрокаПерекурсовка.ЦеннаяБумага, СтрокаПерекурсовка.УчетныйАктивЕПС,
			СтрокаПерекурсовка.СтоимостьВВалютеУчета, СтрокаПерекурсовка.СтоимостьКупонаВВалютеУчета, СтрокаПерекурсовка.ПереоценкаКупонаВВалютеУчета,
			СтрокаПерекурсовка.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПерекурсовка.ДисконтПремияНачисленныйВВалютеУчета, 0,
			0, 0, 0, 0, 0, 0);
		БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ОбъектДокумента, ПараметрыПерекурсовки, Отказ);	
	
	КонецЦикла;
	
	ПараметрыСписания = Новый Структура();
	ПараметрыСписания.Вставить("ВалютаУчета", ВалютаУчета);
	ПараметрыСписания.Вставить("ЦеннаяБумага", ДанныеПогашения.ЦеннаяБумага);
	ПараметрыСписания.Вставить("Сделка", ПогашениеСсылка);
	ПараметрыСписания.Вставить("ВалютаНоминала", ДанныеБумаги.ВалютаНоминала);
	ПараметрыСписания.Вставить("Контрагент", Контрагент);
	
	// ситуация, когда по списанию списываем только количество
	Если ДвиженияПартий.Итог("Стоимость") = 0 И ЭтоСписаниеЦеннойБумаги Тогда
		
		// это важный момент - от того, была ли оплата в прошлых днях зависит есть ли сальдо на счете 61210 и соответственно нужно ли его списывать или нет
		БылаОплатаВПрошлыхДнях = Ложь; 
		Для каждого СтрокаФактическиеПлатежи Из ФактическиеПлатежи Цикл
			Если СтрокаФактическиеПлатежи.ДеньПлатежа < НачалоДня(ОбъектДокумента.Дата) Тогда
				БылаОплатаВПрошлыхДнях = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если БылаОплатаВПрошлыхДнях Тогда
			ПараметрыСписания.Вставить("КоличествоНаСчете61210", 0);
		КонецЕсли;
		
		ПараметрыСписания.Вставить("ВалютаСделки", ДанныеБумаги.ВалютаНоминала); // вообще не важно, списываем только количество, заполняем т.к. нужно
		
		Для каждого СтрокаДвижения Из ДвиженияПартий Цикл
		
			НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
				НастройкиУчетаОбщие,
				ДанныеПогашения.ЦеннаяБумага,
				СтрокаДвижения.УчетныйАктивЕПС,
				СтрокаДвижения.Партия,
				СтрокаДвижения.СтрокаПартии);
			
			ПараметрыСписания.Вставить("НастройкиУчета", НастройкиУчетаЦеннойБумаги);
			ПараметрыСписания.Вставить("СчетУчета", СтрокаДвижения.УчетныйАктивЕПС.СчетУчета);
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаТела);
			ПараметрыСписания.Вставить("Количество", СтрокаДвижения.Количество);
			ПараметрыСписания.Вставить("Стоимость", 0);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", 0);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
		
		КонецЦикла;
		
		Возврат;
	
	КонецЕсли;
	
	НоминальныеСуммы = ОпределитьНоминальныеСуммыПогашения(ДанныеПогашения, ДанныеБумаги, ОбъектДокумента, ВалютаУчета, Отказ);
	
	// определяем суммы фактических платежей, для завешивания задолженности
	Если ФактическиеПлатежи.Количество() = 0 Тогда // не было платежей - завешивать будем по номинальной стоимости
		СуммаОплаты						= НоминальныеСуммы.НоминальнаяСумма;
		СуммаОплатыВВалютеУчета			= НоминальныеСуммы.НоминальнаяСуммаВВалютеУчета;
		СуммаОплатыКупона				= НоминальныеСуммы.НоминальнаяСуммаКупона;
		СуммаОплатыКупонаВВалютеУчета	= НоминальныеСуммы.НоминальнаяСуммаКупонаВВалютеУчета;
		ВалютаОплаты					= ДанныеБумаги.ВалютаНоминала;
		БылиПлатежи						= Ложь;
	Иначе // собираем платежи для получения фактической суммы	
		СуммаОплаты						= 0;
		СуммаОплатыВВалютеУчета			= 0;
		СуммаОплатыКупона				= 0;
		СуммаОплатыКупонаВВалютеУчета	= 0;
		БылиПлатежи						= Истина;
		
		Для каждого СтрокаФактическиеПлатежи Из ФактическиеПлатежи Цикл
			ВалютаОплаты = СтрокаФактическиеПлатежи.Валюта;
			
			Если ВалютаОплаты = ВалютаУчета Тогда
				ПлатежВВалютеУчета = СтрокаФактическиеПлатежи.Сумма;
			Иначе
				ПлатежВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(СтрокаФактическиеПлатежи.Сумма, ВалютаОплаты, ОбъектДокумента.Дата, ВалютаУчета, ОбъектДокумента.Дата, Отказ);
			КонецЕсли;
			
			Если СтрокаФактическиеПлатежи.ВариантДвиженияДенежныхСредств = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации Тогда
				СуммаОплаты = СуммаОплаты + СтрокаФактическиеПлатежи.Сумма;
				СуммаОплатыВВалютеУчета = СуммаОплатыВВалютеУчета + ПлатежВВалютеУчета;
			ИначеЕсли СтрокаФактическиеПлатежи.ВариантДвиженияДенежныхСредств = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона Тогда
				СуммаОплатыКупона = СуммаОплатыКупона + СтрокаФактическиеПлатежи.Сумма;
				СуммаОплатыКупонаВВалютеУчета = СуммаОплатыКупонаВВалютеУчета + ПлатежВВалютеУчета;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(НастройкиУчетаОбщие, ДанныеПогашения.ЦеннаяБумага, Неопределено);
	
	ДанныеПроводок = Новый Структура();
	ДанныеПроводок.Вставить("СуммаОплаты",					СуммаОплаты);
	ДанныеПроводок.Вставить("СуммаОплатыВВалютеУчета",		СуммаОплатыВВалютеУчета);
	ДанныеПроводок.Вставить("НоминальнаяСумма",				НоминальныеСуммы.НоминальнаяСумма);
	ДанныеПроводок.Вставить("НоминальнаяСуммаВВалютеУчета",	НоминальныеСуммы.НоминальнаяСуммаВВалютеУчета);
	ДанныеПроводок.Вставить("Облигация",					ДанныеПогашения.ЦеннаяБумага);
	ДанныеПроводок.Вставить("ВалютаНоминала",				ДанныеБумаги.ВалютаНоминала);
	ДанныеПроводок.Вставить("ВалютаОплаты",					ВалютаОплаты);
	ДанныеПроводок.Вставить("Аналитика",					АналитикаДебиторкиПоТелу);
	ДанныеПроводок.Вставить("Количество",					ДанныеПогашения.Количество);
	ДанныеПроводок.Вставить("Контрагент",					Контрагент);
	ДанныеПроводок.Вставить("НастройкиУчета",				НастройкиУчетаЦеннойБумаги);
	ДанныеПроводок.Вставить("ВалютаУчета",					ВалютаУчета);
	ДанныеПроводок.Вставить("БылиПлатежи",					БылиПлатежи);
	ДанныеПроводок.Вставить("УчитыватьПрошедшиеПлатежи",	УчитыватьПрошедшиеПлатежи);
	
	Если ЭтоОплата Тогда // есть нюанс со счетом 61210: если у нас оплата и списание будет в следующем дне, то количество на счете 61210 не завешиваем, чтобы не вылезло отрицательное сальдо
		
		БумагаСписанаНаКонецДня = (Запрос.МенеджерВременныхТаблиц.Таблицы["_ОстаткиНаКонецДня"].ПолучитьДанные().Выгрузить().Количество() = 0);
		// если бумага на конец дня не списана, значит списание будет в следующем дне и количество на счете 61210 не завешиваем
		Если НЕ БумагаСписанаНаКонецДня Тогда
			ДанныеПроводок.Вставить("Количество", 0);
		КонецЕсли;
		
	КонецЕсли;
	
	СоздатьПроводкиНачалаСделки(ОбъектДокумента, Движения, ПогашениеСсылка, ДанныеПроводок);
	
	Если ТипЗнч(ДанныеПогашения.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") 
		И НастройкиУчетаЦеннойБумаги.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда
		
		ДанныеПроводок = Новый Структура();
		ДанныеПроводок.Вставить("СуммаОплаты",					СуммаОплатыКупона);
		ДанныеПроводок.Вставить("СуммаОплатыВВалютеУчета",		СуммаОплатыКупонаВВалютеУчета);
		ДанныеПроводок.Вставить("НоминальнаяСумма",				НоминальныеСуммы.НоминальнаяСуммаКупона);
		ДанныеПроводок.Вставить("НоминальнаяСуммаВВалютеУчета",	НоминальныеСуммы.НоминальнаяСуммаКупонаВВалютеУчета);
		ДанныеПроводок.Вставить("Облигация",					ДанныеПогашения.ЦеннаяБумага);
		ДанныеПроводок.Вставить("ВалютаНоминала",				ДанныеБумаги.ВалютаНоминала);
		ДанныеПроводок.Вставить("ВалютаОплаты",					ВалютаОплаты);
		ДанныеПроводок.Вставить("Аналитика",					АналитикаДебиторкиПоКупону);
		ДанныеПроводок.Вставить("Количество",					ДанныеПогашения.Количество);
		ДанныеПроводок.Вставить("Контрагент",					Контрагент);
		ДанныеПроводок.Вставить("НастройкиУчета",				НастройкиУчетаЦеннойБумаги);
		ДанныеПроводок.Вставить("ВалютаУчета",					ВалютаУчета);
		ДанныеПроводок.Вставить("БылиПлатежи",					БылиПлатежи);
		ДанныеПроводок.Вставить("УчитыватьПрошедшиеПлатежи",	УчитыватьПрошедшиеПлатежи);
		
		СоздатьПроводкиНачалаСделки(ОбъектДокумента, Движения, ПогашениеСсылка, ДанныеПроводок);
	
	КонецЕсли;
	
	ТаблицаСписанийПоАктивам = Новый ТаблицаЗначений();
	ТаблицаСписанийПоАктивам.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ТаблицаСписанийПоАктивам.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	ТаблицаСписанийПоАктивам.Колонки.Добавить("СтоимостьСписания",				Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	ТаблицаСписанийПоАктивам.Колонки.Добавить("СтоимостьСписанияВВалютеУчета",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСуммаВалютная.Тип);
	
	ПараметрыСписания.Вставить("ВалютаСделки", ВалютаОплаты);
	
	Для каждого СтрокаДвижения Из ДвиженияПартий Цикл

		НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
			НастройкиУчетаОбщие,
			ДанныеПогашения.ЦеннаяБумага,
			СтрокаДвижения.УчетныйАктивЕПС,
			СтрокаДвижения.Партия,
			СтрокаДвижения.СтрокаПартии);
		
		ПараметрыСписания.Вставить("НастройкиУчета", НастройкиУчетаЦеннойБумаги);
		
		ПроверитьПравильностьСписанияЦеннойБумаги(ДанныеПогашения.ЦеннаяБумага, ОбъектДокумента, ПогашениеСсылка, ДанныеПогашения, СтрокаДвижения, НастройкиУчетаЦеннойБумаги, Отказ);
		
		// ***** СТОИМОСТЬ *****
		// когда-то (в 2019м) году мы не умели правильно вести корректировку ПП и отражали ее в теле
		// потом мы сделали правильно, но по тем счетам, где она уже была, ничего менять было нельзя и мы оставили по ним как есть
		// для этого была введена функция ПолучитьМассивСчетовСПравильнымУчетомПП чтобы отделить Счета ДУ с учетом по-старому (неправильно) и по-новому (правильно)
		ДобавкаКТелу = 0;	
		ДобавкаКТелуВВалютеУчета = 0;	
		Если СтрокаДвижения.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
			И НЕ НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнания	// партия (ранее счет ДУ) с неправильным учетом ПП
			И ОбъектДокумента.СчетДоверительногоУправления <> ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF375") // но это не счет "НПФ Национальный АО" - у него все по-своему #522665
			И ДанныеПогашения.ЦеннаяБумага <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002") Тогда // но вот именно эту бумагу стали учитывать правильно, даже у неправильных счетов ДУ
		
			ДобавкаКТелу = СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;	
			ДобавкаКТелуВВалютеУчета = СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная;	
		
		КонецЕсли;
		
		ПараметрыСписания.Вставить("СчетУчета", СтрокаДвижения.УчетныйАктивЕПС.СчетУчета);
		ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаТела);
		ПараметрыСписания.Вставить("Количество", СтрокаДвижения.Количество);
		ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.Стоимость + ДобавкаКТелу);
		ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.СтоимостьВВалютеУчета + ДобавкаКТелуВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
		
		ПараметрыСписания.Вставить("Количество", 0);
		
		// ***** ПЕРЕОЦЕНКА *****			
		Если СтрокаДвижения.Переоценка <> 0 Тогда 
			
			Если СтрокаДвижения.ПереоценкаВВалютеУчета > 0 Тогда
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
			Иначе
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаПереоценкиТела);

			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.Переоценка);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.ПереоценкаВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
			
		// ***** ИНДЕКСАЦИЯ НОМИНАЛА *****			
		Если СтрокаДвижения.ИндексацияНоминала <> 0 Тогда 
			
			Если СтрокаДвижения.ПереоценкаВВалютеУчета > 0 Тогда
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
			Иначе
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаИндексацииНоминала);
			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.ИндексацияНоминала);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.ИндексацияНоминала);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
			
		// ***** КОРРЕКТИРОВКА ЭСП *****
		Если СтрокаДвижения.КорректировкаЭСП <> 0 Тогда 
			
			Если СтрокаДвижения.КорректировкаЭСП > 0 Тогда
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКорректировокА);
			Иначе
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКорректировокП);
			КонецЕсли;
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.КорректировкаЭСП);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.КорректировкаЭСПВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
			
		Если СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0 Тогда 
			
			Если СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные > 0 Тогда
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт);
			Иначе
				ПараметрыСписания.Вставить("СчетУчета",	СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
			КонецЕсли;
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
		
		// ***** ДИСКОНТ *****			
		Если СтрокаДвижения.ДисконтНачисленный <> 0 Тогда 
			
			ПараметрыСписания.Вставить("СчетУчета", СтрокаДвижения.УчетныйАктивЕПС.СчетУчета);
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаДисконта);
			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.ДисконтНачисленный);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.ДисконтНачисленныйВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
			
		// ***** ПРЕМИЯ *****			
		Если СтрокаДвижения.ПремияНачисленная <> 0 Тогда 
			
			ПараметрыСписания.Вставить("СчетУчета", СтрокаДвижения.УчетныйАктивЕПС.СчетУчета);
			ПараметрыСписания.Вставить("ДополнительнаяАналитика", АналитикаПремии);
			ПараметрыСписания.Вставить("Стоимость", СтрокаДвижения.ПремияНачисленная);
			ПараметрыСписания.Вставить("СтоимостьВВалютеУчета", СтрокаДвижения.ПремияНачисленнаяВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ);
			
		КонецЕсли;
		
		Если ТипЗнч(ДанныеПогашения.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
			
			Если СтрокаДвижения.СтоимостьКупона <> 0 Тогда
				
				// ***** купон *****
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвижения.СтоимостьКупонаВВалютеУчета, "Погашение купона");
				
				// дебет
				Если НастройкиУчетаЦеннойБумаги.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда
					
					Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
						
					Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
					Проводка.СубконтоДт.ОснованиеРасчетов = ПогашениеСсылка;
					
				ИначеЕсли ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
					
					Проводка.СчетДт = СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКупона;
					
					Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
					
					Проводка.ВалютаДт = ДанныеБумаги.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = СтрокаДвижения.СтоимостьКупона;
					
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
					
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = ПогашениеСсылка;
					
					Проводка.ВалютаДт  = ДанныеБумаги.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = СтрокаДвижения.СтоимостьКупона;
									
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				КонецЕсли;

				// кредит
				Проводка.СчетКт = СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКупона;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				
				Проводка.ВалютаКт = ДанныеБумаги.ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = СтрокаДвижения.СтоимостьКупона;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
				
			КонецЕсли;
			
			Если СтрокаДвижения.ПереоценкаКупона <> 0 Тогда
				
				// ***** переоценка купона *****
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвижения.ПереоценкаКупонаВВалютеУчета, "Погашение купона");
				
				// дебет
				Если НастройкиУчетаЦеннойБумаги.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда
					
					Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
						
					Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
					Проводка.СубконтоДт.ОснованиеРасчетов = ПогашениеСсылка;
					
				ИначеЕсли ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
					
					Проводка.СчетДт = СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКупона;
					
					Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
					
					Проводка.ВалютаДт = ДанныеБумаги.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = СтрокаДвижения.ПереоценкаКупона;
					
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				Иначе
					
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
					
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = ПогашениеСсылка;
					
					Проводка.ВалютаДт  = ДанныеБумаги.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = СтрокаДвижения.ПереоценкаКупона;
									
					Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
					
				КонецЕсли;

				// кредит
				Проводка.СчетКт = СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаКупона;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				
				Проводка.ВалютаКт = ДанныеБумаги.ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = СтрокаДвижения.ПереоценкаКупона;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
			КонецЕсли;	
			
		КонецЕсли;			
			
		Если СтрокаДвижения.СуммаРезервовПодОбесценение > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвижения.СуммаРезервовПодОбесценение, "Списание резерва");	
			
			
			Проводка.СчетДт = СтрокаДвижения.УчетныйАктивЕПС.СчетУчетаРезервов;
			
			Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
			Проводка.СубконтоДт.Резервы	= СтрокаДвижения.АналитикаРезерва; 
			
			Проводка.ВалютаДт			= ВалютаУчета;
			Проводка.ВалютнаяСуммаДт	= СтрокаДвижения.СуммаРезервовПодОбесценение;
			
			
			Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(СтрокаДвижения.УчетныйАктивЕПС.АналитикаСписанияРезервов.НомерСчетаБухгалтерскогоУчета) ;
			
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов	= СтрокаДвижения.УчетныйАктивЕПС.АналитикаСписанияРезервов;
			Проводка.СубконтоКт.ЦенныеБумаги							= ДанныеПогашения.ЦеннаяБумага;
			
		КонецЕсли;
		
		СтрокаСписанийПоАктивам = ТаблицаСписанийПоАктивам.Добавить();
		СтрокаСписанийПоАктивам.УчетныйАктивЕПС = СтрокаДвижения.УчетныйАктивЕПС;
		СтрокаСписанийПоАктивам.Количество = СтрокаДвижения.КоличествоОстаток;
		СтрокаСписанийПоАктивам.СтоимостьСписания = СтрокаДвижения.Стоимость + СтрокаДвижения.ДисконтНачисленный + СтрокаДвижения.ПремияНачисленная + СтрокаДвижения.Переоценка + СтрокаДвижения.ИндексацияНоминала
			+ СтрокаДвижения.КорректировкаЭСП + СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные + ДобавкаКТелу;
		СтрокаСписанийПоАктивам.СтоимостьСписанияВВалютеУчета = СтрокаДвижения.СтоимостьВВалютеУчета + СтрокаДвижения.ДисконтНачисленныйВВалютеУчета + СтрокаДвижения.ПремияНачисленнаяВВалютеУчета + СтрокаДвижения.ПереоценкаВВалютеУчета + СтрокаДвижения.ИндексацияНоминала
			+ СтрокаДвижения.КорректировкаЭСПВВалютеУчета + СтрокаДвижения.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета + ДобавкаКТелуВВалютеУчета;
		
	КонецЦикла; 
	
	// на момент погашения стоимость ценной бумаги (тело + дисконт) не доросла до номинала
	// или же наоборот еще превышает номинал
	Если НоминальныеСуммы.НоминальнаяСумма <> ТаблицаСписанийПоАктивам.Итог("СтоимостьСписания") 
		ИЛИ НоминальныеСуммы.НоминальнаяСуммаВВалютеУчета <> ТаблицаСписанийПоАктивам.Итог("СтоимостьСписанияВВалютеУчета") Тогда
		
		ТаблицаСписанийПоАктивам.Свернуть("УчетныйАктивЕПС", "Количество,СтоимостьСписания,СтоимостьСписанияВВалютеУчета");
		
		Для каждого СтрокаСписанийПоАктивам Из ТаблицаСписанийПоАктивам Цикл
			НоминальнаяСуммаАктива = Окр(НоминальныеСуммы.НоминальнаяСумма / ДанныеПогашения.Количество * СтрокаСписанийПоАктивам.Количество, 2);
			НоминальнаяСуммаАктиваВВалютеУчета = Окр(НоминальныеСуммы.НоминальнаяСуммаВВалютеУчета / ДанныеПогашения.Количество * СтрокаСписанийПоАктивам.Количество, 2);
			
			Если СтрокаСписанийПоАктивам.СтоимостьСписанияВВалютеУчета < НоминальнаяСуммаАктиваВВалютеУчета Тогда
				
				СуммаДосписать = НоминальнаяСуммаАктива - СтрокаСписанийПоАктивам.СтоимостьСписания;
				СуммаДосписатьВВалютеУчета = НоминальнаяСуммаАктиваВВалютеУчета - СтрокаСписанийПоАктивам.СтоимостьСписанияВВалютеУчета;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СуммаДосписатьВВалютеУчета, "Погашение ценной бумаги");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ПогашениеСсылка;
				
				// кредит
				Проводка.СчетКт = СтрокаСписанийПоАктивам.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
				
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписанийПоАктивам.УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
				Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				
			ИначеЕсли СтрокаСписанийПоАктивам.СтоимостьСписанияВВалютеУчета > НоминальнаяСуммаАктиваВВалютеУчета Тогда
				
				СуммаДосписать = СтрокаСписанийПоАктивам.СтоимостьСписания - НоминальнаяСуммаАктива;
				СуммаДосписатьВВалютеУчета = СтрокаСписанийПоАктивам.СтоимостьСписанияВВалютеУчета - НоминальнаяСуммаАктиваВВалютеУчета;
				
				// с реализации на расходы
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СуммаДосписатьВВалютеУчета, "Погашение ценной бумаги");
				
				// дебет
				Проводка.СчетДт = СтрокаСписанийПоАктивам.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписанийПоАктивам.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
				Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПогашения.ЦеннаяБумага;
				Проводка.СубконтоКт.ОснованиеРасчетов = ПогашениеСсылка;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;											
	
КонецПроцедуры

Процедура СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент) 

	Если ПараметрыПроводки.Сумма = 0 И ПараметрыПроводки.СуммаВВалютеУчета = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
	
	// дебет
	Проводка.СчетДт = ПараметрыПроводки.СчетУчета;
	
	Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
	
	Если ПараметрыПроводки.Количество <> 0 Тогда
		Проводка.КоличествоДт = ПараметрыПроводки.Количество;	
	КонецЕсли;
	
	Проводка.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
	Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.Сумма;
	
	Проводка.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
	
	// кредит
	Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
	
	Проводка.СубконтоКт.Контрагенты = Контрагент;
	Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыПроводки.Сделка;
	
	Проводка.ВалютаКт        = ПараметрыПроводки.ВалютаНоминала;
	Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.Сумма;
	
	
	Проводка.Партия = ПараметрыПроводки.Партия;
	Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;

КонецПроцедуры

Процедура СформироватьПроводкуРеализацииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ, ДопОписание = "") 

	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыОплаты.СуммаРеализацииВВалютеУчета, "Продажа ценной бумаги " + ДопОписание);
	
	Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
	
	Проводка.СубконтоДт.Контрагенты = ПараметрыОплаты.Контрагент;
	Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
	
	Проводка.ВалютаДт        = ПараметрыОплаты.ВалютаСделки;
	Проводка.ВалютнаяСуммаДт = ПараметрыОплаты.СуммаРеализации;
	
	
	Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
	
	Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыОплаты.ЦеннаяБумага;
	Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
	
	Проводка.КоличествоКт = ПараметрыОплаты.Количество;

КонецПроцедуры

Процедура СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыСписания, Отказ, ДопОписание = "") 

	Если ПараметрыСписания.СтоимостьВВалютеУчета > 0 ИЛИ ПараметрыСписания.СтоимостьВВалютеУчета = 0 И ПараметрыСписания.Количество <> 0 Тогда // погашение списывает только количество с пустой суммой, это нормально для ЕПС
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыСписания.СтоимостьВВалютеУчета, "Списание себестоимости ценной бумаги(" + ?(ДопОписание = "", Строка(ПараметрыСписания.ДополнительнаяАналитика), ДопОписание) +")");
		
		Если (ПараметрыСписания.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный
			ИЛИ ПараметрыСписания.ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный)
			И ПараметрыСписания.Свойство("НастройкиУчета") Тогда // при полном погашении есть нюансы...
			
			Если ПараметрыСписания.НастройкиУчета.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда
			
				Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыСписания.Сделка;
				
				Проводка.КоличествоДт = ПараметрыСписания.Количество;
				
			ИначеЕсли ПараметрыСписания.НастройкиУчета.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
				
				Проводка.СчетДт = ПараметрыСписания.СчетУчета;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
				
				Проводка.КоличествоДт = ПараметрыСписания.Количество;
				Проводка.ВалютаДт  = ПараметрыСписания.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = ПараметрыСписания.Стоимость;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
			
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = ПараметрыСписания.Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыСписания.Сделка;
				
				Проводка.ВалютаДт  = ПараметрыСписания.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = ПараметрыСписания.Стоимость;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
				
			КонецЕсли;
			
		Иначе
			
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			
			Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыСписания.Сделка;
			
			Проводка.КоличествоДт = ПараметрыСписания.Количество;
			Если ПараметрыСписания.Свойство("КоличествоНаСчете61210") Тогда
				Проводка.КоличествоДт = ПараметрыСписания.КоличествоНаСчете61210;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Проводка.СчетКт = ПараметрыСписания.СчетУчета;
		
		Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
		
		Проводка.КоличествоКт = ПараметрыСписания.Количество;
		Проводка.ВалютаКт = ПараметрыСписания.ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = ПараметрыСписания.Стоимость;
		
		Проводка.ДополнительнаяАналитикаКт = ПараметрыСписания.ДополнительнаяАналитика;
		
		Если ПараметрыСписания.Свойство("Партия") Тогда
			Проводка.Партия = ПараметрыСписания.Партия;
			Проводка.СтрокаПартии = ПараметрыСписания.СтрокаПартии;
		КонецЕсли;
		
	ИначеЕсли ПараметрыСписания.СтоимостьВВалютеУчета < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -ПараметрыСписания.СтоимостьВВалютеУчета, "Списание себестоимости ценной бумаги(" + ?(ДопОписание = "", Строка(ПараметрыСписания.ДополнительнаяАналитика), ДопОписание) +")");
		
		Проводка.СчетДт = ПараметрыСписания.СчетУчета;
		
		Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
		
		Проводка.ВалютаДт = ПараметрыСписания.ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = -ПараметрыСписания.Стоимость;
		
		Проводка.ДополнительнаяАналитикаДт = ПараметрыСписания.ДополнительнаяАналитика;
		
		
		Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		
		Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыСписания.ЦеннаяБумага;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыСписания.Сделка;
		
		Если ПараметрыСписания.Свойство("Партия") Тогда
			Проводка.Партия = ПараметрыСписания.Партия;
			Проводка.СтрокаПартии = ПараметрыСписания.СтрокаПартии;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьПроводкиПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, Контрагент) Экспорт

	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.Стоимость КАК Стоимость,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки > 0
		|				ИЛИ БухПартииЦенныхБумаг.ДисконтПремияНачисленный > 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|	КОНЕЦ КАК Дисконт,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки > 0
		|				ИЛИ БухПартииЦенныхБумаг.ДисконтПремияНачисленный > 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|	КОНЕЦ КАК ДисконтВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки < 0
		|				ИЛИ БухПартииЦенныхБумаг.ДисконтПремияНачисленный < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|	КОНЕЦ КАК Премия,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки < 0
		|				ИЛИ БухПартииЦенныхБумаг.ДисконтПремияНачисленный < 0
		|			ТОГДА 0
		|		ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|	КОНЕЦ КАК ПремияВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьКупона КАК СтоимостьКупона,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ИндексацияНоминала КАК ИндексацияНоминала,
		|	БухПартииЦенныхБумаг.Количество КАК Количество
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыПроводки = Новый Структура;
		
		Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
			ПараметрыПроводки.Вставить("Сделка",			ОбъектДокумента.Основание);
		Иначе
			ПараметрыПроводки.Вставить("Сделка",			ОбъектДокумента.Ссылка);
		КонецЕсли;		
		
		ПараметрыПроводки.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыПроводки.Вставить("ЦеннаяБумага",		ВыборкаДетальныеЗаписи.ЦеннаяБумага);
		ПараметрыПроводки.Вставить("ВалютаНоминала",	ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		ПараметрыПроводки.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыПроводки.Вставить("СтрокаПартии",		ВыборкаДетальныеЗаписи.СтрокаПартии);
		
		ПараметрыПроводки.Вставить("Сумма",				ВыборкаДетальныеЗаписи.Стоимость);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета);
		ПараметрыПроводки.Вставить("Количество",		ВыборкаДетальныеЗаписи.Количество);
		ПараметрыПроводки.Вставить("Содержание",		"Покупка ценной бумаги (тело)");
		ПараметрыПроводки.Вставить("Аналитика",			АналитикаТела);
		
		СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент);
		
		ПараметрыПроводки.Вставить("Количество",		0);
		
		ПараметрыПроводки.Вставить("Сумма",				ВыборкаДетальныеЗаписи.Дисконт);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ДисконтВВалютеУчета);
		ПараметрыПроводки.Вставить("Содержание",		"Покупка ценной бумаги (дисконт)");
		ПараметрыПроводки.Вставить("Аналитика",			АналитикаДисконта);
		
		СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент);
		
		
		ПараметрыПроводки.Вставить("Сумма",				ВыборкаДетальныеЗаписи.Премия);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ПремияВВалютеУчета);
		ПараметрыПроводки.Вставить("Содержание",		"Покупка ценной бумаги (премия)");
		ПараметрыПроводки.Вставить("Аналитика",			АналитикаПремии);
		
		СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент);
		
		
		ПараметрыПроводки.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ИндексацияНоминала);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.ИндексацияНоминала);
		ПараметрыПроводки.Вставить("Содержание",		"Покупка ценной бумаги (индексация)");
		ПараметрыПроводки.Вставить("Аналитика",			АналитикаИндексацииНоминала);
		
		СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент);
		
		
		ПараметрыПроводки.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКупона);
		ПараметрыПроводки.Вставить("Сумма",				ВыборкаДетальныеЗаписи.СтоимостьКупона);
		ПараметрыПроводки.Вставить("СуммаВВалютеУчета", ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета);
		ПараметрыПроводки.Вставить("Содержание",		"Покупка ценной бумаги (купон)");
		ПараметрыПроводки.Вставить("Аналитика",			АналитикаКупонПриобретенный);
		
		СформироватьПроводкуПокупкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки, Контрагент);
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки) Экспорт

	Если ПараметрыПроводки.Сумма = 0 И ПараметрыПроводки.СуммаВВалютеУчета = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// #473904 - извраты от СНГ
	// СНГ настоял на своей схеме закрытия парных счетов корректировок ЭСП, причем они ведут учет партий на лицевых счетах
	// остальные фонды не маятся дурью и закрывают из по обычной схеме парных, 
	// но СНГ не смог реализовать ее для этих счетов - они сделали вечернюю свертку парных
	// после ряда споров, договорились, что мы будем сворачивать либо после операции (это место), либо в переоценке (см. модуль ее) - это даст такой же результат, как у них
	Если ПараметрыПроводки.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка() 
		И (ПараметрыПроводки.СчетДоходовРасходов = ПланыСчетов.Единый.ПроцентныеДоходы05 ИЛИ ПараметрыПроводки.СчетДоходовРасходов = ПланыСчетов.Единый.ПроцентныеДоходы06)
		И ПараметрыПроводки.НастройкиУчета.СворачиватьПарныеСчетаКорректировокПутемПереброски Тогда
		СформироватьПроводкиНачисленияКорректировкиЭСПСПереброской(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
		
		ПроводкаНачисления = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетУчета;
		
		ПроводкаНачисления.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаНачисления.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаНачисления.ВалютнаяСуммаДт = ПараметрыПроводки.Сумма;
		
		ПроводкаНачисления.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
		
		// кредит
		ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
		
		ПроводкаНачисления.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
		ПроводкаНачисления.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		Если ПараметрыПроводки.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт
			ИЛИ ПараметрыПроводки.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный Тогда
		
			ПроводкаНачисления.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;
		
		КонецЕсли;
		
		Если ПроводкаНачисления.СчетКт.Валютный Тогда // для счетов 106ХХ
			ПроводкаНачисления.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаНачисления.ВалютнаяСуммаКт = ПараметрыПроводки.Сумма;
		КонецЕсли;
		
	Иначе
		
		ПроводкаНачисления = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
		
		ПроводкаНачисления.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
		ПроводкаНачисления.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		Если ПараметрыПроводки.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт
			ИЛИ ПараметрыПроводки.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный Тогда
		
			ПроводкаНачисления.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
		
		КонецЕсли;
		
		Если ПроводкаНачисления.СчетДт.Валютный Тогда // для счетов 106ХХ
			ПроводкаНачисления.ВалютаДт = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаНачисления.ВалютнаяСуммаДт = -ПараметрыПроводки.Сумма;
		КонецЕсли;
		
		// кредит
		ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетУчета;
		
		ПроводкаНачисления.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаНачисления.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаНачисления.ВалютнаяСуммаКт = -ПараметрыПроводки.Сумма;
		
		ПроводкаНачисления.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;
		
	КонецЕсли;
	
	ПроводкаНачисления.Партия = ПараметрыПроводки.Партия;
	ПроводкаНачисления.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
	
	ПроверитьПарные = "";
	Если НЕ ПараметрыПроводки.Свойство("ПроверитьПарные", ПроверитьПарные) Тогда
		Возврат;
	КонецЕсли;
	Если ПроверитьПарные = "" Тогда
		Возврат;
	КонецЕсли;
	 	
	// проверим парность по счету учета
	НачальноеСальдоПоСчету500 = ПараметрыПроводки.СуммаБалансоваяВВалютеУчета;
	НачальноеСальдоПоСчету500Вал = ПараметрыПроводки.СуммаБалансовая;
	
	КонечноеСальдоПоСчету500 = ПараметрыПроводки.СуммаБалансоваяВВалютеУчета + ПараметрыПроводки.СуммаВВалютеУчета;
	КонечноеСальдоПоСчету500Вал = ПараметрыПроводки.СуммаБалансовая + ПараметрыПроводки.Сумма;
	
	НачальноеСальдоПоСчету500Парному = 0;
	КонечноеСальдоПоСчету500Парному = 0;
	
	НачальноеСальдоПоСчету500ПарномуВал = 0;
	КонечноеСальдоПоСчету500ПарномуВал = 0;
	   	
	НачальноеСальдоПоСчету700 = ПараметрыПроводки.СуммаСНачалаГода - ПараметрыПроводки.СуммаВВалютеУчета;
	КонечноеСальдоПоСчету700 = ПараметрыПроводки.СуммаСНачалаГода;
	
	Если ПараметрыПроводки.Свойство("СуммаСНачалаГодаНачальная") И ПараметрыПроводки.Свойство("СуммаСНачалаГодаКонечная") Тогда
	
		НачальноеСальдоПоСчету700 = ПараметрыПроводки.СуммаСНачалаГодаНачальная;
		КонечноеСальдоПоСчету700 = ПараметрыПроводки.СуммаСНачалаГодаКонечная;
	
	КонецЕсли;
	
	НачальноеСальдоПоСчету700Парному = 0;
	КонечноеСальдоПоСчету700Парному = 0;
	
	СуммаПереброскиВВалютеУчета = 0;
	СуммаПереброски = 0;
	//  была отрицательная после переоценки стала положительная, значит мы начисляли ПОЛОЖИТЕЛЬНУЮ сумму
	Если НачальноеСальдоПоСчету500 < 0 И КонечноеСальдоПоСчету500 > 0 Тогда
		
		СуммаПереброскиВВалютеУчета = КонечноеСальдоПоСчету500;
		СуммаПереброски = КонечноеСальдоПоСчету500Вал;
		
		// уменьшим суммы начисления
		ПроводкаНачисления.ВалютнаяСуммаДт = ПроводкаНачисления.ВалютнаяСуммаДт - СуммаПереброски;
		ПроводкаНачисления.Сумма = ПроводкаНачисления.Сумма - СуммаПереброскиВВалютеУчета;
		Если ПроводкаНачисления.СчетКт.Валютный Тогда // 106й счет
		    ПроводкаНачисления.ВалютнаяСуммаКт = ПроводкаНачисления.ВалютнаяСуммаКт - СуммаПереброски;
		КонецЕсли;
		
		// сделаем проводку по парным 500м-700м счетам
		ПроводкаПарные = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброскиВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаПарные.СчетДт = ПараметрыПроводки.СчетУчетаПарный;
		
		ПроводкаПарные.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаПарные.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаПарные.ВалютнаяСуммаДт = СуммаПереброски;
		
		ПроводкаПарные.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
		
		// кредит
		ПроводкаПарные.СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
		
		ПроводкаПарные.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ПроводкаПарные.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
		
		Если ПроводкаПарные.СчетКт.Валютный Тогда // для счетов 106ХХ
			ПроводкаПарные.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПарные.ВалютнаяСуммаКт = СуммаПереброски;
		КонецЕсли;
		
		ПроводкаПарные.Партия = ПараметрыПроводки.Партия;
		ПроводкаПарные.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
		
		// т.к. мы изменили сумму в проводке начисления и сделали проводку на парные счета изменим сальдо по счетам
		КонечноеСальдоПоСчету500 = 0;
		КонечноеСальдоПоСчету500Вал = 0;
		
		КонечноеСальдоПоСчету500Парному = СуммаПереброскиВВалютеУчета;
		КонечноеСальдоПоСчету500ПарномуВал = СуммаПереброски;
		
		КонечноеСальдоПоСчету700 = КонечноеСальдоПоСчету700 - СуммаПереброскиВВалютеУчета;
		КонечноеСальдоПоСчету700Парному = - СуммаПереброскиВВалютеУчета;
		
		
	// была положительная после переоценки стала отрицательная, значит мы начисляли ОТРИЦАТЕЛЬНУЮ сумму
	ИначеЕсли НачальноеСальдоПоСчету500 > 0 И КонечноеСальдоПоСчету500 < 0 Тогда
		
		СуммаПереброскиВВалютеУчета = - КонечноеСальдоПоСчету500;
		СуммаПереброски = - КонечноеСальдоПоСчету500Вал;
		
		// уменьшим суммы начисления
		ПроводкаНачисления.ВалютнаяСуммаКт = ПроводкаНачисления.ВалютнаяСуммаКт - СуммаПереброски;
		ПроводкаНачисления.Сумма = ПроводкаНачисления.Сумма - СуммаПереброскиВВалютеУчета;
		Если ПроводкаНачисления.СчетДт.Валютный Тогда // 106й счет
		    ПроводкаНачисления.ВалютнаяСуммаДт = ПроводкаНачисления.ВалютнаяСуммаДт - СуммаПереброски;
		КонецЕсли;
		
		СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
		СчетКт = ПараметрыПроводки.СчетУчетаПарный;
		
		// сделаем проводку по парным 500м-700м счетам
		ПроводкаПарные = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброскиВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		ПроводкаПарные.СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
		
		ПроводкаПарные.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ПроводкаПарные.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
		
		Если ПроводкаПарные.СчетДт.Валютный Тогда // для счетов 106ХХ
			ПроводкаПарные.ВалютаДт = ПараметрыПроводки.ВалютаНоминала;
			ПроводкаПарные.ВалютнаяСуммаДт = СуммаПереброски;
		КонецЕсли;
		
		// кредит
		ПроводкаПарные.СчетКт = ПараметрыПроводки.СчетУчетаПарный;
		
		ПроводкаПарные.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаПарные.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаПарные.ВалютнаяСуммаКт = СуммаПереброски;
		
		ПроводкаПарные.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;
		
		
		ПроводкаПарные.Партия = ПараметрыПроводки.Партия;
		ПроводкаПарные.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
		
		// т.к. мы изменили сумму в проводке начисления и сделали проводку на парные счета изменим сальдо по счетам
		КонечноеСальдоПоСчету500 = 0;
		КонечноеСальдоПоСчету500Вал = 0;
		
		КонечноеСальдоПоСчету500Парному = - СуммаПереброскиВВалютеУчета;
		КонечноеСальдоПоСчету500ПарномуВал = - СуммаПереброски;
		
		КонечноеСальдоПоСчету700 = КонечноеСальдоПоСчету700 + СуммаПереброскиВВалютеУчета;
		КонечноеСальдоПоСчету700Парному = + СуммаПереброскиВВалютеУчета;
		
	КонецЕсли;
	
	Если ПараметрыПроводки.НастройкиУчета.НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки Тогда
		Возврат;
	КонецЕсли;
	
	// проверим парность по счету доходов/расходов
	Если (КонечноеСальдоПоСчету700Парному <> 0 И КонечноеСальдоПоСчету700 <> 0)		// есть сальдо на обоих парных 700х
		ИЛИ (НачальноеСальдоПоСчету700 > 0 И КонечноеСальдоПоСчету700 < 0)          // изменился знак с плюса на минус - начислили положительную переоценку
		ИЛИ (НачальноеСальдоПоСчету700 < 0 И КонечноеСальдоПоСчету700 > 0) Тогда	// изменился знак с минуса на плюс - начислили отрицательную переоценку
		
		Если (КонечноеСальдоПоСчету700Парному <> 0)	// Делали 2ую проводку по переброске парных по 500м с корреспонденцией с парным 700м
			И (ПоложительноеЧисло(НачальноеСальдоПоСчету700) = ПоложительноеЧисло(КонечноеСальдоПоСчету700) // знак по 7оому не менялся
				ИЛИ НачальноеСальдоПоСчету700 = 0) Тогда // начало года - 700й был нулевой
			
			Если (МатематическиеФункции.МодульЧисла(КонечноеСальдоПоСчету700Парному) <= МатематическиеФункции.МодульЧисла(КонечноеСальдоПоСчету700)) // Сальдо на 700м парном меньше, чем на 700м
				ИЛИ (ПараметрыПроводки.СуммаВВалютеУчета > 0 И НачальноеСальдоПоСчету700 >= 0)		// Начисляем положительную переоценку на доходы
				ИЛИ (ПараметрыПроводки.СуммаВВалютеУчета < 0 И НачальноеСальдоПоСчету700 <= 0) Тогда // Начисляем отрицательныю переоценку на расходы
				
				// Тут нужно просто во 2ой проводке поменять 700й парный на обычный 700й
				Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
					
					ПроводкаПарные.СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
					
					ПроводкаПарные.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					ПроводкаПарные.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
				
				Иначе
					
					ПроводкаПарные.СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
					
					ПроводкаПарные.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					ПроводкаПарные.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
					
				КонецЕсли;
			Иначе // Сальдо на 700м парном БОЛЬШЕ, чем на 700м
				
				// Тут в зависимости от того Переоценка у нас или корректировка
				Если ПроверитьПарные = "Переоценка" Тогда
					// Нужно уменьшить сумму во 2ой проводке на сальдо на 700м основном
					СуммаПереброски = МатематическиеФункции.МодульЧисла(КонечноеСальдоПоСчету700);
					Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
						СуммаПереброскиВВалютеУчета = Окр(ПроводкаПарные.ВалютнаяСуммаДт / ПроводкаПарные.Сумма * СуммаПереброски, 2);
						ПроводкаПарные.ВалютнаяСуммаДт = ПроводкаПарные.ВалютнаяСуммаДт - СуммаПереброскиВВалютеУчета;
						Если ПроводкаПарные.СчетКт.Валютный Тогда // 106й счет
						    ПроводкаПарные.ВалютнаяСуммаКт = ПроводкаПарные.ВалютнаяСуммаКт - СуммаПереброски;
						КонецЕсли;
					Иначе
						СуммаПереброскиВВалютеУчета = Окр(ПроводкаПарные.ВалютнаяСуммаКт / ПроводкаПарные.Сумма * СуммаПереброски, 2);
						ПроводкаПарные.ВалютнаяСуммаКт = ПроводкаПарные.ВалютнаяСуммаКт - СуммаПереброскиВВалютеУчета;
						Если ПроводкаПарные.СчетДт.Валютный Тогда // 106й счет
						    ПроводкаПарные.ВалютнаяСуммаДт = ПроводкаПарные.ВалютнаяСуммаДт - СуммаПереброски;
						КонецЕсли;
					КонецЕсли;
					ПроводкаПарные.Сумма = ПроводкаПарные.Сумма - СуммаПереброски;
					
					// И скопировать 2ую проводку, но использовать там основной 700й и делать на сумму сальдо на 700м основном
					Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
						
						ПроводкаПарные2 = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброскиВВалютеУчета, ПараметрыПроводки.Содержание);
						
						// дебет
						ПроводкаПарные2.СчетДт = ПараметрыПроводки.СчетУчетаПарный;
						
						ПроводкаПарные2.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						
						ПроводкаПарные2.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
						ПроводкаПарные2.ВалютнаяСуммаДт = СуммаПереброски;
						
						ПроводкаПарные2.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
						
						// кредит
						ПроводкаПарные2.СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
						
						ПроводкаПарные2.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						ПроводкаПарные2.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
						
						Если ПроводкаПарные2.СчетКт.Валютный Тогда // для счетов 106ХХ
							ПроводкаПарные2.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
							ПроводкаПарные2.ВалютнаяСуммаКт = СуммаПереброски;
						КонецЕсли;
						
						ПроводкаПарные2.Партия = ПараметрыПроводки.Партия;
						ПроводкаПарные2.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
					
					Иначе
						
						ПроводкаПарные2 = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброскиВВалютеУчета, ПараметрыПроводки.Содержание);
						
						// дебет
						ПроводкаПарные2.СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
						
						ПроводкаПарные2.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						ПроводкаПарные2.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
						
						Если ПроводкаПарные2.СчетДт.Валютный Тогда // для счетов 106ХХ
							ПроводкаПарные2.ВалютаДт = ПараметрыПроводки.ВалютаНоминала;
							ПроводкаПарные2.ВалютнаяСуммаДт = СуммаПереброски;
						КонецЕсли;
						
						// кредит
						ПроводкаПарные2.СчетКт = ПараметрыПроводки.СчетУчетаПарный;
						
						ПроводкаПарные2.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						
						ПроводкаПарные2.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
						ПроводкаПарные2.ВалютнаяСуммаКт = СуммаПереброски;
						
						ПроводкаПарные2.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;
						
						
						ПроводкаПарные2.Партия = ПараметрыПроводки.Партия;
						ПроводкаПарные2.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
					
					КонецЕсли;
					
				Иначе // Корректировка
					// Нужно сделать переброску с основного на парный и всё
					Если НачальноеСальдоПоСчету700 < 0 И КонечноеСальдоПоСчету700 > 0 Тогда
					
						СуммаПереброски = КонечноеСальдоПоСчету700;
						
						СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
						СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
						
						ГФУДт = ПараметрыПроводки.ГФУ;
						ГФУКт = ПараметрыПроводки.ГФУПарный;
						
					Иначе  // Если НачальноеСальдоПоСчету700 > 0 И КонечноеСальдоПоСчету700 < 0 Тогда
						
						СуммаПереброски = - КонечноеСальдоПоСчету700;
						
						СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
						СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
						
						ГФУДт = ПараметрыПроводки.ГФУПарный;
						ГФУКт = ПараметрыПроводки.ГФУ;
						
					КонецЕсли;
					
					Если СуммаПереброски > 0 Тогда
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброски, "Закрытие парных счетов");
						
						// дебет
						Проводка.СчетДт = СчетДт;
						
						Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДт;
						
						// кредит
						Проводка.СчетКт = СчетКт;
						
						Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКт;
						
						// допы
						Проводка.Партия = ПараметрыПроводки.Партия;
						Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
						
					ИначеЕсли СуммаПереброски < 0 Тогда
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -СуммаПереброски, "Закрытие парных счетов");
						
						// дебет
						Проводка.СчетДт = СчетКт;
						
						Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКт;
						
						// кредит
						Проводка.СчетКт = СчетДт;
						
						Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
						Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДт;
						
						// допы
						Проводка.Партия = ПараметрыПроводки.Партия;
						Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе // парных на 500х не было, у нас одна проводка, просто изменилось сальдо на 700м
			Если ПроверитьПарные = "Переоценка" Тогда
				// Нужно уменьшить сумму во 1й проводке на сумму сальдо по модулю
				// И скопировать эту проводку, но использовать там парный 700й и делать на сумму сальдо на 700м
				Если НачальноеСальдоПоСчету700 < 0 И КонечноеСальдоПоСчету700 > 0 Тогда
				
					СуммаПереброски = КонечноеСальдоПоСчету700;
					
					СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
					
					ГФУДт = ПараметрыПроводки.ГФУПарный;
					ГФУКт = ПараметрыПроводки.ГФУ;
					
				Иначе  // Если НачальноеСальдоПоСчету700 > 0 И КонечноеСальдоПоСчету700 < 0 Тогда
					
					СуммаПереброски = - КонечноеСальдоПоСчету700;
					
					СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
					СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					
					ГФУДт = ПараметрыПроводки.ГФУ;
					ГФУКт = ПараметрыПроводки.ГФУПарный;
					
				КонецЕсли;
				
				Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
					
					СуммаПереброскиВалютная = ПроводкаНачисления.ВалютнаяСуммаДт / ПроводкаНачисления.Сумма * СуммаПереброски;
					ПроводкаНачисления.ВалютнаяСуммаДт = ПроводкаНачисления.ВалютнаяСуммаДт - СуммаПереброскиВалютная;
					
					Если ПроводкаНачисления.СчетКт.Валютный Тогда // 106й счет
					    ПроводкаНачисления.ВалютнаяСуммаКт = ПроводкаНачисления.ВалютнаяСуммаКт - СуммаПереброски;
					КонецЕсли;
					
				Иначе	
					
					СуммаПереброскиВалютная = ПроводкаНачисления.ВалютнаяСуммаКт / ПроводкаНачисления.Сумма * СуммаПереброски;
					ПроводкаНачисления.ВалютнаяСуммаКт = ПроводкаНачисления.ВалютнаяСуммаКт - СуммаПереброскиВалютная;
					
					Если ПроводкаНачисления.СчетДт.Валютный Тогда // 106й счет
					    ПроводкаНачисления.ВалютнаяСуммаДт = ПроводкаНачисления.ВалютнаяСуммаДт - СуммаПереброски;
					КонецЕсли;
					
				КонецЕсли;
				
				ПроводкаНачисления.Сумма = ПроводкаНачисления.Сумма - СуммаПереброски;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброски, ПараметрыПроводки.Содержание);
				
				Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
					// дебет
					Проводка.СчетДт = ПараметрыПроводки.СчетУчета;
					Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = СуммаПереброскиВалютная;
					Проводка.ДополнительнаяАналитикаДт = ПараметрыПроводки.Аналитика;
					
					// кредит
					Проводка.СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
					Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					
					Если Проводка.СчетКт.Валютный Тогда // для счетов 106ХХ
						Проводка.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
						Проводка.ВалютнаяСуммаКт = СуммаПереброски;
					КонецЕсли;
					
				Иначе
					// дебет
					Проводка.СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
					Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					
					Если Проводка.СчетДт.Валютный Тогда // для счетов 106ХХ
						Проводка.ВалютаДт = ПараметрыПроводки.ВалютаНоминала;
						Проводка.ВалютнаяСуммаДт = СуммаПереброски;
					КонецЕсли;
					
					// кредит
					Проводка.СчетКт = ПараметрыПроводки.СчетУчета;
					Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
					Проводка.ВалютнаяСуммаКт = СуммаПереброскиВалютная;
					Проводка.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;
				КонецЕсли;
				
				Проводка.Партия = ПараметрыПроводки.Партия;
				Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
				
				
			Иначе // Корректировка
				// Нужно сделать переброску с основного 700го на парный 700й и всё
				
				Если НачальноеСальдоПоСчету700 < 0 И КонечноеСальдоПоСчету700 > 0 Тогда
				
					СуммаПереброски = КонечноеСальдоПоСчету700;
					
					СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
					СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					
					ГФУДт = ПараметрыПроводки.ГФУ;
					ГФУКт = ПараметрыПроводки.ГФУПарный;
					
				Иначе  // Если НачальноеСальдоПоСчету700 > 0 И КонечноеСальдоПоСчету700 < 0 Тогда
					
					СуммаПереброски = - КонечноеСальдоПоСчету700;
					
					СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
					СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
					
					ГФУДт = ПараметрыПроводки.ГФУПарный;
					ГФУКт = ПараметрыПроводки.ГФУ;
					
				КонецЕсли;
				
				Если СуммаПереброски > 0 Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброски, "Закрытие парных счетов");
					
					// дебет
					Проводка.СчетДт = СчетДт;
					
					Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДт;
					
					// кредит
					Проводка.СчетКт = СчетКт;
					
					Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКт;
					
					// допы
					Проводка.Партия = ПараметрыПроводки.Партия;
					Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
					
				ИначеЕсли СуммаПереброски < 0 Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -СуммаПереброски, "Закрытие парных счетов");
					
					// дебет
					Проводка.СчетДт = СчетКт;
					
					Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУКт;
					
					// кредит
					Проводка.СчетКт = СчетДт;
					
					Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДт;
					
					// допы
					Проводка.Партия = ПараметрыПроводки.Партия;
					Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиПродажиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ) Экспорт
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(
															ОбъектДокумента.Дата,
															ОбъектДокумента.Организация,
															ОбъектДокумента.СчетДоверительногоУправления);
															
	ДатаВключенияЗакрытия7гоРазделаПоРезервам = ДатаВключенияЗакрытия7гоРазделаПоРезервам();
															
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
															ОбъектДокумента.Дата,
															ОбъектДокумента.Организация,
															ОбъектДокумента.СчетДоверительногоУправления);
															
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	СубконтоЦБ_Р = Новый Массив;
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Резервы);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Сумма КАК СуммаСделки,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупонаСделки,
		|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссияСделки,
		|	РасходыПоСделкеОбороты.СуммаОборот КАК РасходыПоСделке,
		|	Продажа.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Продажа.Партия КАК Партия,
		|	Продажа.СтрокаПартии КАК СтрокаПартии,
		|	Продажа.Количество КАК КоличествоПартииРасход,
		|	Продажа.Стоимость КАК СтоимостьПартииРасход,
		|	Продажа.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчетаПартииРасход,
		|	Продажа.СтоимостьКупона КАК СтоимостьКупонаПартииРасход,
		|	Продажа.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчетаПартииРасход,
		|	Продажа.Переоценка КАК ПереоценкаПартииРасход,
		|	Продажа.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчетаПартииРасход,
		|	Продажа.ПереоценкаКупона КАК ПереоценкаКупонаПартииРасход,
		|	Продажа.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчетаПартииРасход,
		|	Продажа.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	Продажа.ДисконтПремияНачисленный КАК ДисконтПремияНачисленныйПартииРасход,
		|	Продажа.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчетаПартииРасход,
		|	Продажа.КорректировкаЭСП КАК КорректировкаЭСППартииРасход,
		|	Продажа.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчетаПартииРасход,
		|	Продажа.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииРасход,
		|	Продажа.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход,
		|	Продажа.ИндексацияНоминала КАК ИндексацияНоминалаПартииРасход,
		|	Продажа.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	Продажа.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	Продажа.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	Продажа.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	Продажа.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	Продажа.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	Продажа.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	Продажа.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	Продажа.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	Продажа.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	ЕСТЬNULL(ПереоценкаНачисление.Переоценка, 0) КАК ПереоценкаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаВВалютеУчета, 0) КАК ПереоценкаВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупона, 0) КАК ПереоценкаКупонаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленный, 0) КАК ДисконтПремияНачисленныйПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСП, 0) КАК КорректировкаЭСППартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСПВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ИндексацияНоминала, 0) КАК ИндексацияНоминалаПартииПриход,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьВВалютеУчета, 0) КАК СтоимостьПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьКупонаВВалютеУчета, 0) КАК СтоимостьКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаВВалютеУчета, 0) КАК ПереоценкаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСППерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка,
		|	Продажа.УчетныйАктивЕПС.Родитель КАК УчетныйАктивЕПСРодитель,
		|	Продажа.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость КАК УчетныйАктивЕПСВключатьРасходыПоПокупкеВСтоимость,
		|	Продажа.УчетныйАктивЕПС.СчетУчета КАК УчетныйАктивЕПССчетУчета,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК УчетныйАктивЕПССчетУчетаПереоценкиА,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК УчетныйАктивЕПССчетУчетаПереоценкиП,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаКупона КАК УчетныйАктивЕПССчетУчетаКупона,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций КАК УчетныйАктивЕПССчетУчетаДоходовОтОпераций,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций КАК УчетныйАктивЕПССчетУчетаРасходовОтОпераций,
		|	Продажа.УчетныйАктивЕПС.АналитикаДоходовОтОпераций КАК УчетныйАктивЕПСАналитикаДоходовОтОпераций,
		|	Продажа.УчетныйАктивЕПС.АналитикаРасходовОтОпераций КАК УчетныйАктивЕПСАналитикаРасходовОтОпераций,
		|	Продажа.УчетныйАктивЕПС.АналитикаПроцентныхДоходов КАК УчетныйАктивЕПСАналитикаПроцентныхДоходов,
		|	Продажа.УчетныйАктивЕПС.АналитикаСписанияПремии КАК УчетныйАктивЕПСАналитикаСписанияПремии,
		|	Продажа.УчетныйАктивЕПС.АналитикаДоходовОтПереоценки КАК УчетныйАктивЕПСАналитикаДоходовОтПереоценки,
		|	Продажа.УчетныйАктивЕПС.АналитикаРасходовОтПереоценки КАК УчетныйАктивЕПСАналитикаРасходовОтПереоценки,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаКорректировокА КАК УчетныйАктивЕПССчетУчетаКорректировокА,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаКорректировокП КАК УчетныйАктивЕПССчетУчетаКорректировокП,
		|	Продажа.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки КАК УчетныйАктивЕПСАналитикаДоходовОтКорректировки,
		|	Продажа.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки КАК УчетныйАктивЕПСАналитикаРасходовОтКорректировки,
		|	Продажа.УчетныйАктивЕПС.АналитикаДоходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания,
		|	Продажа.УчетныйАктивЕПС.АналитикаРасходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт КАК УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт КАК УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт КАК УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт КАК УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт,
		|	Продажа.УчетныйАктивЕПС.СчетУчетаРезервов КАК УчетныйАктивЕПССчетУчетаРезервов,
		|	Продажа.Организация КАК Организация,
		|	Продажа.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(&НачалоПериода, &ОкончаниеПериода, Период, Сделка = &Сделка) КАК РасходыПоСделкеОбороты
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = РасходыПоСделкеОбороты.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК Продажа
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК ПереоценкаНачисление
		|			ПО Продажа.Регистратор = ПереоценкаНачисление.Регистратор
		|				И Продажа.ВидУчета = ПереоценкаНачисление.ВидУчета
		|				И Продажа.ЦеннаяБумага = ПереоценкаНачисление.ЦеннаяБумага
		|				И Продажа.Партия = ПереоценкаНачисление.Партия
		|				И Продажа.СтрокаПартии = ПереоценкаНачисление.СтрокаПартии
		|				И (ПереоценкаНачисление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|				И (ПереоценкаНачисление.Переоценка <> 0
		|					ИЛИ ПереоценкаНачисление.ПереоценкаКупона <> 0
		|					ИЛИ ПереоценкаНачисление.ДисконтПремияНачисленный <> 0
		|					ИЛИ ПереоценкаНачисление.КорректировкаЭСП <> 0
		|					ИЛИ ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0
		|					ИЛИ ПереоценкаНачисление.ИндексацияНоминала <> 0)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК Перекурсовка
		|			ПО Продажа.Регистратор = Перекурсовка.Регистратор
		|				И Продажа.ВидУчета = Перекурсовка.ВидУчета
		|				И Продажа.ЦеннаяБумага = Перекурсовка.ЦеннаяБумага
		|				И Продажа.Партия = Перекурсовка.Партия
		|				И Продажа.СтрокаПартии = Перекурсовка.СтрокаПартии
		|				И (Перекурсовка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|				И (Перекурсовка.Переоценка = 0)
		|				И (Перекурсовка.ПереоценкаКупона = 0)
		|				И (Перекурсовка.ДисконтПремияНачисленный = 0)
		|				И (Перекурсовка.КорректировкаЭСП = 0)
		|				И (Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0)
		|		ПО СделкаЦенныеБумаги.Ссылка = Продажа.Регистратор
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = Продажа.ЦеннаяБумага
		|			И (Продажа.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|			И (Продажа.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	МАКСИМУМ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК АналитикаРезерва,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчетаРезерва,
		|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация,
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _АналитикаРезервов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов
		|				ИЗ
		|					_ДвиженияПартий КАК _ДвиженияПартий
		|				ГДЕ
		|					_ДвиженияПартий.СуммаРезервовПодОбесценение > 0),
		|			&СубконтоЦБ_Р,
		|			(Организация, СчетДоверительногоУправления, Субконто1) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					_ДвиженияПартий.Организация,
		|					_ДвиженияПартий.СчетДоверительногоУправления,
		|					_ДвиженияПартий.ЦеннаяБумага
		|				ИЗ
		|					_ДвиженияПартий КАК _ДвиженияПартий
		|				ГДЕ
		|					_ДвиженияПартий.СуммаРезервовПодОбесценение > 0)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Организация,
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	Организация,
		|	СчетДоверительногоУправления,
		|	СчетУчетаРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДвиженияПартий.Количество КАК Количество,
		|	_ДвиженияПартий.СуммаСделки КАК СуммаСделки,
		|	_ДвиженияПартий.СуммаКупонаСделки КАК СуммаКупонаСделки,
		|	_ДвиженияПартий.ТорговаяКомиссияСделки КАК ТорговаяКомиссияСделки,
		|	_ДвиженияПартий.РасходыПоСделке КАК РасходыПоСделке,
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.Партия КАК Партия,
		|	_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии,
		|	_ДвиженияПартий.КоличествоПартииРасход КАК КоличествоПартииРасход,
		|	_ДвиженияПартий.СтоимостьПартииРасход КАК СтоимостьПартииРасход,
		|	_ДвиженияПартий.СтоимостьВВалютеУчетаПартииРасход КАК СтоимостьВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.СтоимостьКупонаПартииРасход КАК СтоимостьКупонаПартииРасход,
		|	_ДвиженияПартий.СтоимостьКупонаВВалютеУчетаПартииРасход КАК СтоимостьКупонаВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.ПереоценкаПартииРасход КАК ПереоценкаПартииРасход,
		|	_ДвиженияПартий.ПереоценкаВВалютеУчетаПартииРасход КАК ПереоценкаВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.ПереоценкаКупонаПартииРасход КАК ПереоценкаКупонаПартииРасход,
		|	_ДвиженияПартий.ПереоценкаКупонаВВалютеУчетаПартииРасход КАК ПереоценкаКупонаВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйПартииРасход КАК ДисконтПремияНачисленныйПартииРасход,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчетаПартииРасход КАК ДисконтПремияНачисленныйВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.КорректировкаЭСППартииРасход КАК КорректировкаЭСППартииРасход,
		|	_ДвиженияПартий.КорректировкаЭСПВВалютеУчетаПартииРасход КАК КорректировкаЭСПВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииРасход КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииРасход,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход,
		|	_ДвиженияПартий.ИндексацияНоминалаПартииРасход КАК ИндексацияНоминалаПартииРасход,
		|	_ДвиженияПартий.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	_ДвиженияПартий.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
		|	_ДвиженияПартий.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
		|	_ДвиженияПартий.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
		|	_ДвиженияПартий.ИндексацияНоминалаСНачалаГода КАК ИндексацияНоминалаСНачалаГода,
		|	_ДвиженияПартий.КурсовыеРазницыСНачалаГода КАК КурсовыеРазницыСНачалаГода,
		|	_ДвиженияПартий.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
		|	_ДвиженияПартий.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ДвиженияПартий.ПереоценкаПартииПриход КАК ПереоценкаПартииПриход,
		|	_ДвиженияПартий.ПереоценкаВВалютеУчетаПартииПриход КАК ПереоценкаВВалютеУчетаПартииПриход,
		|	_ДвиженияПартий.ПереоценкаКупонаПартииПриход КАК ПереоценкаКупонаПартииПриход,
		|	_ДвиженияПартий.ПереоценкаКупонаВВалютеУчетаПартииПриход КАК ПереоценкаКупонаВВалютеУчетаПартииПриход,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйПартииПриход КАК ДисконтПремияНачисленныйПартииПриход,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчетаПартииПриход КАК ДисконтПремияНачисленныйВВалютеУчетаПартииПриход,
		|	_ДвиженияПартий.КорректировкаЭСППартииПриход КАК КорректировкаЭСППартииПриход,
		|	_ДвиженияПартий.КорректировкаЭСПВВалютеУчетаПартииПриход КАК КорректировкаЭСПВВалютеУчетаПартииПриход,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход,
		|	_ДвиженияПартий.ИндексацияНоминалаПартииПриход КАК ИндексацияНоминалаПартииПриход,
		|	_ДвиженияПартий.СтоимостьПерекурсовка КАК СтоимостьПерекурсовка,
		|	_ДвиженияПартий.СтоимостьКупонаПерекурсовка КАК СтоимостьКупонаПерекурсовка,
		|	_ДвиженияПартий.ПереоценкаПерекурсовка КАК ПереоценкаПерекурсовка,
		|	_ДвиженияПартий.ПереоценкаКупонаПерекурсовка КАК ПереоценкаКупонаПерекурсовка,
		|	_ДвиженияПартий.ДисконтПремияНачисленныйПерекурсовка КАК ДисконтПремияНачисленныйПерекурсовка,
		|	_ДвиженияПартий.КорректировкаЭСППерекурсовка КАК КорректировкаЭСППерекурсовка,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка,
		|	_ДвиженияПартий.УчетныйАктивЕПСРодитель КАК УчетныйАктивЕПСРодитель,
		|	_ДвиженияПартий.УчетныйАктивЕПСВключатьРасходыПоПокупкеВСтоимость КАК УчетныйАктивЕПСВключатьРасходыПоПокупкеВСтоимость,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчета КАК УчетныйАктивЕПССчетУчета,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаПереоценкиА КАК УчетныйАктивЕПССчетУчетаПереоценкиА,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаПереоценкиП КАК УчетныйАктивЕПССчетУчетаПереоценкиП,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаКупона КАК УчетныйАктивЕПССчетУчетаКупона,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаДоходовОтОпераций КАК УчетныйАктивЕПССчетУчетаДоходовОтОпераций,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаРасходовОтОпераций КАК УчетныйАктивЕПССчетУчетаРасходовОтОпераций,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаДоходовОтОпераций КАК УчетныйАктивЕПСАналитикаДоходовОтОпераций,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаРасходовОтОпераций КАК УчетныйАктивЕПСАналитикаРасходовОтОпераций,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаПроцентныхДоходов КАК УчетныйАктивЕПСАналитикаПроцентныхДоходов,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаСписанияПремии КАК УчетныйАктивЕПСАналитикаСписанияПремии,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаДоходовОтПереоценки КАК УчетныйАктивЕПСАналитикаДоходовОтПереоценки,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаРасходовОтПереоценки КАК УчетныйАктивЕПСАналитикаРасходовОтПереоценки,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаКорректировокА КАК УчетныйАктивЕПССчетУчетаКорректировокА,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаКорректировокП КАК УчетныйАктивЕПССчетУчетаКорректировокП,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаДоходовОтКорректировки КАК УчетныйАктивЕПСАналитикаДоходовОтКорректировки,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаРасходовОтКорректировки КАК УчетныйАктивЕПСАналитикаРасходовОтКорректировки,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания,
		|	_ДвиженияПартий.УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания КАК УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт КАК УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт КАК УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт КАК УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	_ДвиженияПартий.УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт КАК УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт,
		|	ЕСТЬNULL(_АналитикаРезервов.АналитикаРезерва, &АналитикаРезерваПоУмолчанию) КАК АналитикаРезерва
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаРезервов КАК _АналитикаРезервов
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _АналитикаРезервов.ЦеннаяБумага
		|			И _ДвиженияПартий.Организация = _АналитикаРезервов.Организация
		|			И _ДвиженияПартий.СчетДоверительногоУправления = _АналитикаРезервов.СчетДоверительногоУправления
		|			И _ДвиженияПартий.УчетныйАктивЕПССчетУчетаРезервов = _АналитикаРезервов.СчетУчетаРезерва
		|ИТОГИ
		|	МИНИМУМ(Количество),
		|	МИНИМУМ(СуммаСделки),
		|	МИНИМУМ(СуммаКупонаСделки),
		|	МИНИМУМ(ТорговаяКомиссияСделки),
		|	МИНИМУМ(РасходыПоСделке)
		|ПО
		|	ЦеннаяБумага";
	
	
	Запрос.УстановитьПараметр("Сделка", ПараметрыОплаты.Сделка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыОплаты.Сделка.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОбъектДокумента.Дата));
	Запрос.УстановитьПараметр("Ссылка", ОбъектДокумента.Ссылка);
	Запрос.УстановитьПараметр("СубконтоЦБ_Р", СубконтоЦБ_Р);
	Запрос.УстановитьПараметр("АналитикаРезерваПоУмолчанию", Справочники.Резервы.РезервОбесценениеУбытки12Месяцев);
	Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	
	Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке") Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.", "Документ.ИсполнениеОбязательствПоСделке.");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссияСделки,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ДвиженияПартий.ТорговаяКомиссияСделки КАК ТорговаяКомиссияСделки,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МИНИМУМ(ТорговаяКомиссияСделки),", "");
		
	КонецЕсли;
	
	ПроизошлоВосстановлениеРезерва = Ложь;
	
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЦеннаяБумага = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦеннаяБумага.Следующий() Цикл
		
		КоличествоСделки = ВыборкаЦеннаяБумага.Количество;
		
		СуммаСделки = ВыборкаЦеннаяБумага.СуммаСделки;
		СуммаКупонаСделки = ВыборкаЦеннаяБумага.СуммаКупонаСделки;
		РасходыПоСделке = ВыборкаЦеннаяБумага.РасходыПоСделке;
		
		СуммаСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ОбъектДокумента.ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
		СуммаКупонаСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаСделки, ОбъектДокумента.ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
		РасходыПоСделкеВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(РасходыПоСделке, ОбъектДокумента.ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
		
		Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Сделка") Тогда
		
			ТорговаяКомиссияСделки = ВыборкаЦеннаяБумага.ТорговаяКомиссияСделки;
			ТорговаяКомиссияСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТорговаяКомиссияСделки, ОбъектДокумента.ВалютаТорговойКомиссии, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
		
		КонецЕсли;
		
		ОсталосьСписатьКоличество = КоличествоСделки;
		
		ВыборкаДетальныеЗаписи = ВыборкаЦеннаяБумага.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОсталосьСписатьКоличество = ОсталосьСписатьКоличество - ВыборкаДетальныеЗаписи.КоличествоПартииРасход;
			
			Если ОсталосьСписатьКоличество <> 0 Тогда 
			
				СуммаСделкиСписать				= Окр(СуммаСделки				/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				СуммаКупонаСделкиСписать		= Окр(СуммаКупонаСделки			/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				РасходыПоСделкеСписать			= Окр(РасходыПоСделке			/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				
				СуммаСделкиВВалютеУчетаСписать				= Окр(СуммаСделкиВВалютеУчета				/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				СуммаКупонаСделкиВВалютеУчетаСписать		= Окр(СуммаКупонаСделкиВВалютеУчета			/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				РасходыПоСделкеВВалютеУчетаСписать			= Окр(РасходыПоСделкеВВалютеУчета			/ КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				
			Иначе // последняя строка - сбросим на нее все погрешности округления
				
				СуммаСделкиСписать				= СуммаСделки;
				СуммаКупонаСделкиСписать		= СуммаКупонаСделки;
				РасходыПоСделкеСписать			= РасходыПоСделке;
				
				СуммаСделкиВВалютеУчетаСписать				= СуммаСделкиВВалютеУчета;
				СуммаКупонаСделкиВВалютеУчетаСписать		= СуммаКупонаСделкиВВалютеУчета;
				РасходыПоСделкеВВалютеУчетаСписать			= РасходыПоСделкеВВалютеУчета;
				
			КонецЕсли;
			
			СуммаСделки = СуммаСделки - СуммаСделкиСписать;
			СуммаКупонаСделки = СуммаКупонаСделки - СуммаКупонаСделкиСписать;
			РасходыПоСделке = РасходыПоСделке - РасходыПоСделкеСписать;
			
			СуммаСделкиВВалютеУчета = СуммаСделкиВВалютеУчета - СуммаСделкиВВалютеУчетаСписать;
			СуммаКупонаСделкиВВалютеУчета = СуммаКупонаСделкиВВалютеУчета - СуммаКупонаСделкиВВалютеУчетаСписать;
			РасходыПоСделкеВВалютеУчета = РасходыПоСделкеВВалютеУчета - РасходыПоСделкеВВалютеУчетаСписать;
			
			
			ПараметрыОплаты.Вставить("УчетныйАктивЕПС",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
			ПараметрыОплаты.Вставить("ЦеннаяБумага",		ВыборкаДетальныеЗаписи.ЦеннаяБумага);
			ПараметрыОплаты.Вставить("ВалютаНоминала",		ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
			ПараметрыОплаты.Вставить("ВалютаУчета",			ВалютаУчета);
			
			ПараметрыОплаты.Вставить("Партия",						ВыборкаДетальныеЗаписи.Партия);
			ПараметрыОплаты.Вставить("СтрокаПартии",				ВыборкаДетальныеЗаписи.СтрокаПартии);
			
			Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Сделка") Тогда
			
				ТорговаяКомиссияСделкиСписать = Окр(ТорговаяКомиссияСделки / КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				ТорговаяКомиссияСделкиВВалютеУчетаСписать = Окр(ТорговаяКомиссияСделкиВВалютеУчета / КоличествоСделки * ВыборкаДетальныеЗаписи.КоличествоПартииРасход, 2);
				
				ТорговаяКомиссияСделки = ТорговаяКомиссияСделки - ТорговаяКомиссияСделкиСписать;
				ПараметрыОплаты.Вставить("ТорговаяКомиссия",	ТорговаяКомиссияСделкиСписать);
				
				БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыТорговойКомиссииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			КонецЕсли;
			
			КоличествоСделки = КоличествоСделки - ВыборкаДетальныеЗаписи.КоличествоПартииРасход;
			
			// 2 Продажа тела и купона 47407-61
			ПараметрыОплаты.Вставить("Количество",					ВыборкаДетальныеЗаписи.КоличествоПартииРасход);
			ПараметрыОплаты.Вставить("СуммаРеализации",				СуммаСделкиСписать);
			ПараметрыОплаты.Вставить("СуммаРеализацииВВалютеУчета",	СуммаСделкиВВалютеУчетаСписать);
			
			СформироватьПроводкуРеализацииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			ПараметрыОплаты.Вставить("Количество",					0);
			ПараметрыОплаты.Вставить("СуммаРеализации",				СуммаКупонаСделкиСписать);
			ПараметрыОплаты.Вставить("СуммаРеализацииВВалютеУчета",	СуммаКупонаСделкиВВалютеУчетаСписать);
			
			СформироватьПроводкуРеализацииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ, "(Купон)");
			
			
			// 5 Начислим %ные доходы и переоценку
			ПараметрыНачисления = Новый Структура;
			
			ПараметрыНачисления.Вставить("НастройкиУчета",	НастройкиУчета);
			
			ПараметрыНачисления.Вставить("ЦеннаяБумага",	ВыборкаДетальныеЗаписи.ЦеннаяБумага);
			ПараметрыНачисления.Вставить("ВалютаНоминала",	ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
			ПараметрыНачисления.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
			ПараметрыНачисления.Вставить("СтрокаПартии",	ВыборкаДетальныеЗаписи.СтрокаПартии);
			ПараметрыНачисления.Вставить("Количество",		0);
			ПараметрыНачисления.Вставить("ВалютаСделки",	ОбъектДокумента.ВалютаСделки);
			ПараметрыНачисления.Вставить("ПроверитьПарные",	"");
			
			// дисконт-премия	
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииПриход);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
				ПараметрыНачисления.Вставить("Содержание",				"Списание премии");
				ПараметрыНачисления.Вставить("Аналитика",				АналитикаПремии);
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
				ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаСписанияПремии);
			Иначе
				ПараметрыНачисления.Вставить("Содержание",			"Начисление дисконта");
				ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы01);
				ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// ННКД	
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииПриход);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыНачисления.Вставить("Содержание",			"Переоценка купона");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы01);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// переоценка
			БалансоваяПереоценка = ВыборкаДетальныеЗаписи.ПереоценкаПартииРасход - ВыборкаДетальныеЗаписи.ПереоценкаПартииПриход;
			БалансоваяПереоценкаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход - ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииПриход;
			БалансоваяПереоценкаСНачалаГода = ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода - ВыборкаДетальныеЗаписи.ПереоценкаПартииПриход;
			
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаПартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииПриход);
			ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода);
			ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяПереоценка);
			ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяПереоценкаВВалютеУчета);
			
			ПараметрыНачисления.Вставить("Содержание",			"Переоценка");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПереоценкиТела);
			
			ПараметрыНачисления.Вставить("ПроверитьПарные",		"Переоценка");
			
			Если БалансоваяПереоценкаВВалютеУчета > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
			ИначеЕсли БалансоваяПереоценкаВВалютеУчета < 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
			ИначеЕсли БалансоваяПереоценкаВВалютеУчета = 0 Тогда
				Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход >= 0 Тогда
					ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
					ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
				Иначе	
					ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
					ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
				КонецЕсли;
			КонецЕсли;
			
			Если БалансоваяПереоценкаСНачалаГода >= 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
			КонецЕсли;
				
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// корректировка ЭСП
			БалансоваяКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСППартииРасход - ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход;
			БалансоваяКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииРасход - ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход;
			БалансоваяКорректировкаЭСПСНачалаГода = ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГода - ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход;
			
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
			ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГода);
			ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяКорректировкаЭСП);
			ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяКорректировкаЭСПВВалютеУчета);
			
			ПараметрыНачисления.Вставить("Содержание",			"КорректировкаЭСП");
			ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
			
			ПараметрыНачисления.Вставить("ПроверитьПарные",		"КорректировкаЭСП");
			
			Если БалансоваяКорректировкаЭСП > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
			КонецЕсли;
			
			Если БалансоваяКорректировкаЭСПСНачалаГода > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы05);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтКорректировки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	ПланыСчетов.Единый.ПроцентныеДоходы06);
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтКорректировки);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы06);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтКорректировки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", ПланыСчетов.Единый.ПроцентныеДоходы05);
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтКорректировки);
			КонецЕсли;
				
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			ПараметрыНачисления.Удалить("ПроверитьПарныеДоходыРасходы");
			
			// разница п/п
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход);
			
			ПараметрыНачисления.Вставить("Содержание",			"Разница первоначального признания");
			ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияСНачалаГода > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов", ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания);
			КонецЕсли;
				
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// индексация номинала
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииПриход);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииПриход);
			
			ПараметрыНачисления.Вставить("Содержание",			"Индексация номинала");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаИндексацииНоминала);
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов", ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций);
			КонецЕсли;
				
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			
			// 6 Начислим курсовую разницу
			ПараметрыНачисления.Удалить("ПроверитьПарные"); // не нужно проверять парные для курсовой - их просто нет
			
			СчетДоходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			ГФУДоходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
			СчетРасходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			ГФУРасходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетРасходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
			
			ПараметрыНачисления.Вставить("Сумма",				0);
			
			// тело
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница стоимость");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаТела);
			
			Если ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// УНКД
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон приобретенный");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонПриобретенный);
			
			Если ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
			// переоценка
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка);
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница переоценка");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПереоценкиТела);
			
			Если НастройкиУчета.ОтражатьДоходыРасходыОтПерекурсовкиПереоценкиКакПереоценку Тогда
				Если ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка > 0 Тогда
					ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
					ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
				Иначе
					ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
					ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
				КонецЕсли;
			Иначе
				Если ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка > 0 Тогда
					ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
					ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
				Иначе
					ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
					ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
				КонецЕсли;
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			// ННКД
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон начисленный");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			// дисконт-премия
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка);
			
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			
			Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
				ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница премии");
				ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
			Иначе
				ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница дисконта");
				ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			// корректировка ЭСП
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка);
			
			ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
			
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
			КонецЕсли;
			
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница корректировка ЭСП");
			
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			// разница п/п
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка);
			
			ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница п/п");
			
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка > 0 Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
				ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
			КонецЕсли;
			
			СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
			
			
			// 3 Списание себестоимости и прочего 612-501
			
			// тело
			ПараметрыОплаты.Вставить("Количество",					ВыборкаДетальныеЗаписи.КоличествоПартииРасход);
			ПараметрыОплаты.Вставить("СчетУчета",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаТела);
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.СтоимостьПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			ПараметрыОплаты.Вставить("Количество",					0);
			
			// НКДУ
			ПараметрыОплаты.Вставить("СчетУчета",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКупона);
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаКупонПриобретенный);
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.СтоимостьКупонаПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// НКДН
			ПараметрыОплаты.Вставить("СчетУчета",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКупона);
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаКупонНачисленный);
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// Дисконт/премия
			ПараметрыОплаты.Вставить("СчетУчета",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчета);
			Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
				ПараметрыОплаты.Вставить("ДополнительнаяАналитика",	АналитикаПремии);
			Иначе
				ПараметрыОплаты.Вставить("ДополнительнаяАналитика",	АналитикаДисконта);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// Переоценка
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаПереоценкиТела);
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
			Иначе
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.ПереоценкаПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// Корректировка
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокА);
			Иначе
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаКорректировокП);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.КорректировкаЭСППартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ, "Корректировка ЭСП");
			
			// Разница ПП
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
			Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход > 0 Тогда
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт);
			Иначе
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// Индексация номинала
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
			Если ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииРасход > 0 Тогда
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиА);
			Иначе
				ПараметрыОплаты.Вставить("СчетУчета",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииРасход);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииРасход);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			// 4 Доход/расход по бумаге 612-715 или наоборот
			
			ДоходРасход = СуммаСделкиСписать + СуммаКупонаСделкиСписать
				- ВыборкаДетальныеЗаписи.СтоимостьПартииРасход
				- ВыборкаДетальныеЗаписи.СтоимостьКупонаПартииРасход
				- ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииРасход
				- ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииРасход
				- ВыборкаДетальныеЗаписи.ПереоценкаПартииРасход
				- ВыборкаДетальныеЗаписи.КорректировкаЭСППартииРасход
				- ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииРасход
				- ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииРасход
				- РасходыПоСделкеСписать;
				
			ДоходРасходВВалютеУчета = СуммаСделкиВВалютеУчетаСписать + СуммаКупонаСделкиВВалютеУчетаСписать
				- ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииРасход
				- ВыборкаДетальныеЗаписи.ИндексацияНоминалаПартииРасход
				- РасходыПоСделкеВВалютеУчетаСписать;
				
			Если ДоходРасходВВалютеУчета > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ДоходРасходВВалютеУчета, "Продажа ценной бумаги");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
				
				// кредит
				Проводка.СчетКт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций;
				
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций;
				Проводка.СубконтоКт.ЦенныеБумаги         = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				
				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
				//закрыть 7 раздел
				Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ДоходРасходВВалютеУчета, "Закрытие дохода");
					
					// дебет
					Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций;
					
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций;
					Проводка.СубконтоДт.ЦенныеБумаги         = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
					Проводка.СубконтоКт.Договоры = ОбъектДокумента.СчетДоверительногоУправления;
					
					Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
					Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
				КонецЕсли;
				
			ИначеЕсли ДоходРасходВВалютеУчета < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, -ДоходРасходВВалютеУчета, "Продажа ценной бумаги");
				
				// дебет
				Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций;
				Проводка.СубконтоДт.ЦенныеБумаги         = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
				
				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
			
				//закрыть 7 раздел
				Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, -ДоходРасходВВалютеУчета, "Закрытие расхода");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
					Проводка.СубконтоДт.Договоры = ОбъектДокумента.СчетДоверительногоУправления;
					
					// кредит
					Проводка.СчетКт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций;
					
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций;
					Проводка.СубконтоКт.ЦенныеБумаги         = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
					
					Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
					Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение > 0 И ОбъектДокумента.Дата > ДатаВключенияЗакрытия7гоРазделаПоРезервам Тогда
				
				ПроизошлоВосстановлениеРезерва = Истина;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение, "Списание резерва");	
				
				
				Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаРезервов;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.Резервы	= ВыборкаДетальныеЗаписи.АналитикаРезерва; 
				
				ЭтоАктивДляПродажи = (ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи
										ИЛИ ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи);
				
				Если ЭтоАктивДляПродажи Тогда
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУРезервовДляБумагДляПродажиНаСчете106(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь);
				КонецЕсли;
				
				Проводка.ВалютаДт			= ВалютаУчета;
				Проводка.ВалютнаяСуммаДт	= ВыборкаДетальныеЗаписи.СуммаРезервовПодОбесценение;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаСписанияРезервов.НомерСчетаБухгалтерскогоУчета) ;
				
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов	= ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаСписанияРезервов;
				Проводка.СубконтоКт.ЦенныеБумаги							= ВыборкаДетальныеЗаписи.ЦеннаяБумага;

				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
			КонецЕсли;
			
			
			// 7 Закроем доходы/расходы
			Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
				
				ПараметрыНачисления.Вставить("СчетДоверительногоУправления",	ОбъектДокумента.СчетДоверительногоУправления);
				ПараметрыНачисления.Вставить("ВалютаУчета",						ОбъектДокумента.Организация.ВалютаУчета);
				
				// переоценка
				Если НастройкиУчета.НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки Тогда
					
					// положительная переоценка
					Если ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаПоложительная > 0 Тогда
						
						ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаПоложительная);
						
						ПараметрыНачисления.Вставить("СчетДоходов",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
						ПараметрыНачисления.Вставить("СчетРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
						
						Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
						
							ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(
								ОбъектДокумента, 
								ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, 
								ПараметрыНачисления.ЦеннаяБумага, 
								ПараметрыНачисления.ВалютаУчета, 
								-ПараметрыНачисления.ДоходРасход, 
								ПараметрыНачисления.Партия, 
								ПараметрыНачисления.СтрокаПартии);
								
							ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций);
							ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций);
								
						Иначе
								
							ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
							ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
							
						КонецЕсли;
						
						Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
					
					КонецЕсли;
					
					// отрицательная переоценка
					Если ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода - ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаПоложительная < 0 Тогда
					
						ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода - ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаПоложительная);
						
						ПараметрыНачисления.Вставить("СчетДоходов",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
						ПараметрыНачисления.Вставить("СчетРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
						
						Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
						
							ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(
								ОбъектДокумента, 
								ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, 
								ПараметрыНачисления.ЦеннаяБумага, 
								ПараметрыНачисления.ВалютаУчета, 
								-ПараметрыНачисления.ДоходРасход, 
								ПараметрыНачисления.Партия, 
								ПараметрыНачисления.СтрокаПартии);
								
							ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций);
							ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций);
								
						Иначе
								
							ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
							ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
							
						КонецЕсли;
						
						Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
					
					КонецЕсли;
					
				Иначе
					// общая переоценка
					
					ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода);
					
					ПараметрыНачисления.Вставить("СчетДоходов",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
					ПараметрыНачисления.Вставить("СчетРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
					
					Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПСРодитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
					
						ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(
							ОбъектДокумента, 
							ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, 
							ПараметрыНачисления.ЦеннаяБумага, 
							ПараметрыНачисления.ВалютаУчета, 
							-ПараметрыНачисления.ДоходРасход, 
							ПараметрыНачисления.Партия, 
							ПараметрыНачисления.СтрокаПартии);
							
						ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций);
						ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций);
							
					Иначе
							
						ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтПереоценки);
						ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтПереоценки);
						
					КонецЕсли;
					
					Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
					
				КонецЕсли;
				
				// индексация
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ИндексацияНоминалаСНачалаГода);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// ННКД
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ПереоценкаКупонаСНачалаГода);
				
				ПараметрыНачисления.Вставить("СчетДоходов",		ПланыСчетов.Единый.ПроцентныеДоходы01);
				
				ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
				ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// дисконт/премия
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйСНачалаГода);
				
				ПараметрыНачисления.Вставить("СчетДоходов",		ПланыСчетов.Единый.ПроцентныеДоходы01);
				ПараметрыНачисления.Вставить("СчетРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
				
				ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаПроцентныхДоходов);
				ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаСписанияПремии);
				
				ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// корректировка ЭСП
				
				ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
				
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГода);
				
				ПараметрыНачисления.Вставить("СчетДоходов",		ПланыСчетов.Единый.ПроцентныеДоходы05);
				ПараметрыНачисления.Вставить("СчетРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы06);
				
				ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтКорректировки);
				ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтКорректировки);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// разница п/п
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияСНачалаГода);
				
				ПараметрыНачисления.Вставить("СчетДоходов",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
				ПараметрыНачисления.Вставить("СчетРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
				
				ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовПервоначальногоПризнания);
				ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовПервоначальногоПризнания);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// курсовые
				ПараметрыНачисления.Вставить("ДоходРасход",		ВыборкаДетальныеЗаписи.КурсовыеРазницыСНачалаГода);
				
				ПараметрыНачисления.Вставить("СчетДоходов",		СчетДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("СчетРасходов",	СчетРасходовПерекурсовка);
				
				ПараметрыНачисления.Вставить("АналитикаДоходов",	ГФУДоходовПерекурсовка);
				ПараметрыНачисления.Вставить("АналитикаРасходов",	ГФУРасходовПерекурсовка);
				
				Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				
				// комиссии по покупке
				Если НЕ ВыборкаДетальныеЗаписи.УчетныйАктивЕПСВключатьРасходыПоПокупкеВСтоимость Тогда
					ПараметрыНачисления.Вставить("ДоходРасход",		-ВыборкаДетальныеЗаписи.РасходыПриПокупкеСНачалаГода);
					
					ПараметрыНачисления.Вставить("СчетДоходов",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаДоходовОтОпераций);
					ПараметрыНачисления.Вставить("СчетРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПССчетУчетаРасходовОтОпераций);
					
					ПараметрыНачисления.Вставить("АналитикаДоходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаДоходовОтОпераций);
					ПараметрыНачисления.Вставить("АналитикаРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПСАналитикаРасходовОтОпераций);
					
					Если ТипЗнч(ПараметрыНачисления.Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
						ПараметрыНачисления.Вставить("Партия",	ПараметрыНачисления.Партия.Основание);
					КонецЕсли;
					
					Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыНачисления);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ПроизошлоВосстановлениеРезерва И Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда // ооочень редкая штука, поэтому вытащил в отдельный запрос
		
		ЗакрытьДоходыРасходыпоРезервамСПартиямиНаЛицевыхСчетах(ОбъектДокумента);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиОплатыТорговойКомиссииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ) Экспорт

	Сделка = ПараметрыОплаты.Сделка;
	
	СуммаКомиссииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ПараметрыОплаты.ТорговаяКомиссия, Сделка.ВалютаТорговойКомиссии, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаКомиссииВВалютеУчета, "По торговой комиссии списание");
	
	Если Сделка.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		Проводка.СчетДт 						= ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоДт.ЦенныеБумаги 		= ПараметрыОплаты.ЦеннаяБумага;
		Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
	ИначеЕсли ПараметрыОплаты.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда
		Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты08;
		Проводка.СубконтоДт.Контрагенты 		= ПараметрыОплаты.КонтрагентПоКомиссии;
		Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
		Проводка.ВалютаДт  						= Сделка.ВалютаТорговойКомиссии;
		Проводка.ВалютнаяСуммаДт 				= ПараметрыОплаты.ТорговаяКомиссия;
	Иначе
		Проводка.СчетДт 											= ПараметрыОплаты.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов 	= ПараметрыОплаты.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
		Проводка.СубконтоДт.ЦенныеБумаги 							= ПараметрыОплаты.ЦеннаяБумага;
		
		Проводка.Партия = ПараметрыОплаты.Партия;
		Проводка.СтрокаПартии = ПараметрыОплаты.СтрокаПартии;
	КонецЕсли;
	
	Проводка.СчетКт 									= ПараметрыОплаты.СчетДС;
	Проводка.СубконтоКт[ПараметрыОплаты.ВидСубконтоДС]	= ПараметрыОплаты.СубконтоДС;
	
	Если Сделка.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств		= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
	Иначе	
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств		= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
	КонецЕсли;
	
	Проводка.ВалютаКт  			= Сделка.ВалютаТорговойКомиссии;
	Проводка.ВалютнаяСуммаКт 	= ПараметрыОплаты.ТорговаяКомиссия;

КонецПроцедуры

Процедура СформироватьПроводкиПокупки(ЭтотОбъект, Движения, Выборка, УчетныйАктив, ВалютаНоминала, НастройкиУчетаЦеннойБумаги, Сделка, Контрагент) Экспорт
	
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	АналитикаПП					= Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания;
	
    // ПРИХОДУЕМ СТОИМОСТЬ ТЕЛА СПИСЫВАЯ СО 47408
	СуммаПремии = ?(Выборка.ДисконтПремия > 0, Выборка.ДисконтПремияНачисленный, 0);
	СуммаПремииВВалютеУчета = ?(Выборка.ДисконтПремия > 0, Выборка.ДисконтПремияНачисленныйВВалютеУчета, 0);
	СуммаДисконта = 0;
	СуммаДисконтаВВалютеУчета = 0;
	СуммаТела = Выборка.Стоимость;
	СуммаТелаВВалютеУчета = Выборка.СтоимостьВВалютеУчета;
	
	// т.к. индексированный номинал возможен только у гособлигации
	// и они завязаны на инфляцию валюты страны
	// и врядли мы купим цб других стран
	// то пока заложимся на то, что они строго в рублях
	СуммаИндексацииНоминала = Выборка.ИндексацияНоминала; 

	Если НастройкиУчетаЦеннойБумаги.СтоимостьТелаРавнаНоминалу И Выборка.ДисконтПремия < 0 Тогда
		// на стоимости всегда номинал и дисконт < 0
		СуммаДисконта = Выборка.ДисконтПремияНачисленный;
		СуммаДисконтаВВалютеУчета = Выборка.ДисконтПремияНачисленныйВВалютеУчета;
		
	КонецЕсли;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаТелаВВалютеУчета, "Покупка ценной бумаги (тело)");
	
	// дебет
	Проводка.СчетДт = УчетныйАктив.СчетУчета;
	
	Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
	
	Проводка.КоличествоДт = Выборка.Количество;
	Проводка.ВалютаДт  = ВалютаНоминала;
	Проводка.ВалютнаяСуммаДт = СуммаТела;
	
	Проводка.ДополнительнаяАналитикаДт = АналитикаТела;
	
	// кредит
	Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
	
	Проводка.СубконтоКт.Контрагенты = Контрагент;
	Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
	
	Проводка.ВалютаКт        = ВалютаНоминала;
	Проводка.ВалютнаяСуммаКт = СуммаТела;
	
	Если СуммаПремии > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаПремииВВалютеУчета, "Покупка ценной бумаги (премия)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчета;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.КоличествоДт = 0;
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаПремии;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаПремии;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт        = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = СуммаПремии;
		
	КонецЕсли;
	
	Если СуммаДисконта < 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаДисконтаВВалютеУчета, "Покупка ценной бумаги (дисконт)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчета;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.КоличествоДт = 0;
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаДисконта;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаДисконта;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт        = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = СуммаДисконта;
	
	КонецЕсли;
	
	Если СуммаИндексацииНоминала > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаИндексацииНоминала, "Покупка ценной бумаги (индексация номинала)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.КоличествоДт = 0;
		Проводка.ВалютаДт = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаИндексацииНоминала;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаИндексацииНоминала;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт        = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = СуммаИндексацииНоминала;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		
		// ПРИХОДУЕМ СТОИМОСТЬ ТЕЛА СПИСЫВАЯ СО 47408
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.СтоимостьКупонаВВалютеУчета, "Покупка ценной бумаги (купон)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.КоличествоДт = 0;
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = Выборка.СтоимостьКупона;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаКупонПриобретенный;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт        = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = Выборка.СтоимостьКупона;
		
	КонецЕсли;
	
	
	Если Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, "Покупка ценной бумаги (корректировка ПП)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокА;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаПП;
		
		// кредит
		Проводка.СчетКт = УчетныйАктив.СчетУчетаДоходовОтОпераций;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовПервоначальногоПризнания;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
	ИначеЕсли Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, "Покупка ценной бумаги (корректировка ПП)");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
		
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовПервоначальногоПризнания;
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		// кредит
		Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокП;
		
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.ВалютаКт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		
		Проводка.ДополнительнаяАналитикаКт = АналитикаПП;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиПереоценки(ЭтотОбъект, Выборка, УчетныйАктив, ВалютаНоминала, ВалютаУчета, ОстаткиПартий, Отказ) Экспорт

	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	Если Выборка.Перекурсовка Тогда
		
		СтрокиОстатков = ОстаткиПартий.НайтиСтроки(Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии", Выборка.ЦеннаяБумага, УчетныйАктив, выборка.Партия, Выборка.СтрокаПартии));
		
		ДисконтПремияНачисленныйОстаток 										= 0;
		ПереоценкаОстаток 											= 0;
		КорректировкаЭСПОстаток 									= 0;
		РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток 	= 0;
		
		Если СтрокиОстатков.Количество()>0 Тогда
			СтрокаОстатков = СтрокиОстатков[0];
			ДисконтПремияНачисленныйОстаток 							= СтрокаОстатков.ДисконтПремияНачисленныйОстаток;
			ПереоценкаОстаток 											= СтрокаОстатков.ПереоценкаОстаток;
			КорректировкаЭСПОстаток 									= СтрокаОстатков.КорректировкаЭСПОстаток;
			РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток 	= СтрокаОстатков.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток;
		КонецЕсли;
		
		ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
			+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
			+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,"
			+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
			Выборка.ЦеннаяБумага, УчетныйАктив,
			Выборка.СтоимостьВВалютеУчета, Выборка.СтоимостьКупонаВВалютеУчета, Выборка.ПереоценкаВВалютеУчета, Выборка.ПереоценкаКупонаВВалютеУчета,
			Выборка.ДисконтПремияНачисленныйВВалютеУчета, Выборка.КорректировкаЭСПВВалютеУчета, Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
			ДисконтПремияНачисленныйОстаток,ПереоценкаОстаток,КорректировкаЭСПОстаток,РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток);
		
		ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);	
		
	Иначе
		
		//дооценки перед расходом купона, дисконта и т.п.
		Если Выборка.Переоценка <> 0 Тогда
			ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
				"Переоценка", Выборка.Переоценка, Выборка.ПереоценкаВВалютеУчета, ВалютаУчета, УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Неопределено);
			ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
		КонецЕсли;
		
		Если Выборка.ДисконтПремияНачисленный <> 0 Тогда
			ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала",
				Выборка.ДисконтПремияНачисленныйВВалютеУчета, Выборка.ДисконтПремияНачисленный, ВалютаУчета, УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала);
			ПараметрыНачисления.Вставить("Аналитика", ?(Выборка.ДисконтПремияНачисленный < 0,АналитикаПремии,АналитикаДисконта));
			НачислитьДисконтПремию(ЭтотОбъект, ПараметрыНачисления, Отказ);
		КонецЕсли;
		
		Если Выборка.КорректировкаЭСП <> 0 Тогда
			ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
				"КорректировкаЭСП", Выборка.КорректировкаЭСП, Выборка.КорректировкаЭСПВВалютеУчета,ВалютаУчета,  УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Неопределено);
			ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			Если Выборка.ПереоценкаКупона <> 0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Аналитика",
					Выборка.ПереоценкаКупонаВВалютеУчета, Выборка.ПереоценкаКупона, ВалютаУчета, УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, АналитикаКупонНачисленный);
				НачислитьНКД(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			
			Если Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"РазницаПервоначальногоПризнания", Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, ВалютаУчета,  УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Неопределено);
				ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьПроводкиПродажи(ЭтотОбъект, Движения, Выборка, УчетныйАктив, ВалютаНоминала, ВалютаУчета, Сделка, Контрагент, СуммаПартии, СуммаКупонаПартии, СуммаНакладныхРасходовПартии, СуммаНакладныхРасходовПартииВВалютеУчета, Закрывать7ойРазделПриПоступленииДенежныхСредств, ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов, АналитикаРезервов, Отказ)

	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	// СПИСЫВАЕМ СЕБЕСТОИМОСТЬ НА РЕАЛИЗАЦИЮ
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.СтоимостьВВалютеУчета, "Списание себестоимости ценной бумаги");
	
	Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
	Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
	Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
	Проводка.КоличествоДт = Выборка.Количество;
	
	Проводка.СчетКт = УчетныйАктив.СчетУчета;
	Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
	Проводка.КоличествоКт = Выборка.Количество;
	Проводка.ВалютаКт = ВалютаНоминала;
	Проводка.ВалютнаяСуммаКт = Выборка.Стоимость;
	Проводка.ДополнительнаяАналитикаКт = АналитикаТела;
	
	Если Выборка.ДисконтПремия > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.ДисконтПремияНачисленныйВВалютеУчета, "Списание себестоимости ценной бумаги (премия)");

		Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		Проводка.КоличествоДт = 0;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчета;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.КоличествоКт = 0;
		Проводка.ВалютаКт = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = Выборка.ДисконтПремияНачисленный;
		Проводка.ДополнительнаяАналитикаКт = АналитикаПремии;
		
	ИначеЕсли Выборка.ДисконтПремия < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.ДисконтПремияНачисленныйВВалютеУчета, "Списание себестоимости ценной бумаги (дисконт)");

		Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		Проводка.КоличествоДт = 0;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчета;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.КоличествоКт = 0;
		Проводка.ВалютаКт = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = Выборка.ДисконтПремияНачисленный;
		Проводка.ДополнительнаяАналитикаКт = АналитикаДисконта;
		
	КонецЕсли;
	
	ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
		"Переоценка", -Выборка.Переоценка, -Выборка.ПереоценкаВВалютеУчета, ВалютаУчета,  УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Сделка);
	ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
	
	ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
		"ИндексацияНоминала", -Выборка.ИндексацияНоминала, -Выборка.ИндексацияНоминала, ВалютаУчета, УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Сделка);
	ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
	
	ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
		"КорректировкаЭСП", -Выборка.КорректировкаЭСП, -Выборка.КорректировкаЭСПВВалютеУчета, ВалютаУчета,  УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Сделка);
	ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
	
	ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
		"РазницаПервоначальногоПризнания", -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, ВалютаУчета,  УчетныйАктив, Выборка.ЦеннаяБумага, ВалютаНоминала, Сделка);
	ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
	
	// ПРИХОДУЕМ ДОХОД ОТ ПРОДАЖИ
	СуммаПартииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаПартии, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаПартииВВалютеУчета, "Продажа ценной бумаги");
	
	Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
	Проводка.СубконтоДт.Контрагенты = Контрагент;
	Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
	Проводка.ВалютаДт        = ЭтотОбъект.ВалютаСделки;
	Проводка.ВалютнаяСуммаДт = СуммаПартии;
	
	Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
	Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
	Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
	Проводка.КоличествоКт = Выборка.Количество;
	
	Доход = СуммаПартии
		- Выборка.Стоимость
		- Выборка.Переоценка
		- Выборка.ИндексацияНоминала
		- Выборка.ДисконтПремияНачисленный
		- Выборка.КорректировкаЭСП;
		
	ДоходВВалютеУчета = СуммаПартииВВалютеУчета
		- Выборка.СтоимостьВВалютеУчета
		- Выборка.ПереоценкаВВалютеУчета
		- Выборка.ИндексацияНоминала
		- Выборка.ДисконтПремияНачисленныйВВалютеУчета
		- Выборка.КорректировкаЭСПВВалютеУчета;
		
	ДоходПоБумаге = Доход - СуммаНакладныхРасходовПартии;
	ДоходПоБумагеВВалютеУчета = ДоходВВалютеУчета - СуммаНакладныхРасходовПартииВВалютеУчета;
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
	    // СПИСЫВАЕМ СЕБЕСТОИМОСТЬ ПРОДАННОГО КУПОНА НА РЕАЛИЗАЦИЮ
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.СтоимостьКупонаВВалютеУчета, "Списание себестоимости ценной бумаги (купон)");

		Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		Проводка.КоличествоДт = 0;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.КоличествоКт = 0;
		Проводка.ВалютаКт = ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = Выборка.СтоимостьКупона;
		Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
		
		Если Выборка.ПереоценкаКупона <> 0 Тогда
		    // СПИСЫВАЕМ СЕБЕСТОИМОСТЬ ПЕРОЦЕНКИ ПРОДАННОГО КУПОНА НА РЕАЛИЗАЦИЮ
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.ПереоценкаКупонаВВалютеУчета, "Списание себестоимости ценной бумаги (переоценка купона)");

			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
			Проводка.КоличествоДт = 0;
			
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;	                                             
			Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.КоличествоКт = 0;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = Выборка.ПереоценкаКупона;
			Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;

		КонецЕсли;
		
		// ПРИХОДУЕМ ДОХОД ОТ ПРОДАЖИ КУПОНА
		СуммаКупонаПартииВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупонаПартии, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, СуммаКупонаПартииВВалютеУчета, "Продажа ценной бумаги (купон)");
		
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		Проводка.ВалютаДт        = ЭтотОбъект.ВалютаСделки;
		Проводка.ВалютнаяСуммаДт = СуммаКупонаПартии;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		Проводка.КоличествоКт = 0;
		
		Доход = СуммаКупонаПартии - Выборка.СтоимостьКупона - Выборка.ПереоценкаКупона;
		ДоходВВалютеУчета = СуммаКупонаПартииВВалютеУчета - Выборка.СтоимостьКупонаВВалютеУчета - Выборка.ПереоценкаКупонаВВалютеУчета;
		ДоходПоБумаге = ДоходПоБумаге + Доход;
		ДоходПоБумагеВВалютеУчета = ДоходПоБумагеВВалютеУчета + ДоходВВалютеУчета;
		
	КонецЕсли;

	Если ДоходПоБумагеВВалютеУчета > 0 Тогда
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, ДоходПоБумагеВВалютеУчета, "Продажа ценной бумаги");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		
		// кредит
		Проводка.СчетКт = УчетныйАктив.СчетУчетаДоходовОтОпераций;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
		Проводка.СубконтоКт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
		
		//закрыть 7 раздел
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, ДоходПоБумагеВВалютеУчета, "Закрытие дохода");
			
			// дебет
			Проводка.СчетДт = УчетныйАктив.СчетУчетаДоходовОтОпераций;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
			Проводка.СубконтоДт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
		
		КонецЕсли;
		
	ИначеЕсли ДоходПоБумагеВВалютеУчета < 0 Тогда
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, -ДоходПоБумагеВВалютеУчета, "Продажа ценной бумаги");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
		Проводка.СубконтоДт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		//закрыть 7 раздел
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, -ДоходПоБумагеВВалютеУчета, "Закрытие расхода");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
			Проводка.СубконтоКт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
		
		КонецЕсли;
		
	КонецЕсли;

	Если Выборка.СуммаРезервовПодОбесценение > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения, Выборка.СуммаРезервовПодОбесценение, "Списание резерва");	
		
		
		Проводка.СчетДт = УчетныйАктив.СчетУчетаРезервов;
		
		Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;   
		Если ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = Перечисления.СтандартыФинансовойОтчетности.МСФО39 Тогда
			Проводка.СубконтоДт.Резервы	= Справочники.Резервы.РезервПодОбесценениеМСФО39; 
		Иначе	
			ОтборАналитикаРезервов = Новый Структура();
			ОтборАналитикаРезервов.Вставить("ЦеннаяБумага", Выборка.ЦеннаяБумага);
			ОтборАналитикаРезервов.Вставить("СчетУчетаРезерва", УчетныйАктив.СчетУчетаРезервов);
			ОтборАналитикаРезервов.Вставить("Организация", ЭтотОбъект.Организация);
			ОтборАналитикаРезервов.Вставить("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
			
			СтрокиАналитикаРезервов = АналитикаРезервов.НайтиСтроки(ОтборАналитикаРезервов);
			Если СтрокиАналитикаРезервов.Количество() > 0 Тогда
				Проводка.СубконтоДт.Резервы	= СтрокиАналитикаРезервов[0].АналитикаРезерва; 
			Иначе	
				Проводка.СубконтоДт.Резервы	= Справочники.Резервы.РезервОбесценениеУбытки12Месяцев;
			КонецЕсли;
		КонецЕсли;
		
		Проводка.ВалютаДт			= ВалютаУчета;
		Проводка.ВалютнаяСуммаДт	= Выборка.СуммаРезервовПодОбесценение;
		
		
		Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаСписанияРезервов.НомерСчетаБухгалтерскогоУчета) ;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов	= УчетныйАктив.АналитикаСписанияРезервов;
		Проводка.СубконтоКт.ЦенныеБумаги							= Выборка.ЦеннаяБумага;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиНачалаСделки(ОбъектДокумента, Сделка, Контрагент, ДатаСделки, ВалютаСделки, ОбщаяСуммаСделки, ЭтоПоставка, ДвиженияПартий = Неопределено, Отказ) Экспорт
	
	Если НЕ ЭтоПоставка Тогда
		
		ВалютаСделкиДт = ВалютаСделки;
		ВалютнаяСуммаДт = ОбщаяСуммаСделки;
		
		Если ДвиженияПартий <> Неопределено Тогда
			ДвиженияПартий.Свернуть("ВалютаНоминала", "СтоимостьПокупки, СтоимостьКупона");
			
			Для Каждого СтрокаДвиженийПартий Из ДвиженияПартий Цикл
				Если СтрокаДвиженийПартий.ВалютаНоминала <> ВалютаСделки Тогда
					ВалютаСделкиДт = СтрокаДвиженийПартий.ВалютаНоминала;
					ВалютнаяСуммаДт = СтрокаДвиженийПартий.СтоимостьПокупки + СтрокаДвиженийПартий.СтоимостьКупона;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		
		ОбщаяСуммаСделкиРуб = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ОбщаяСуммаСделки, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата, Отказ), 2);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ОбщаяСуммаСделкиРуб, "Цена сделки");
		
		// дебет
		Проводка.СчетДт							= ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоДт.Контрагенты			= Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов	= Сделка;
		
		Проводка.ВалютаДт						= ВалютаСделкиДт;
		Проводка.ВалютнаяСуммаДт				= ВалютнаяСуммаДт;
		
		// кредит
		Проводка.СчетКт							= ПланыСчетов.Единый.Расчеты07;
		
		Проводка.СубконтоКт.Контрагенты			= Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов	= Сделка;
		
		Проводка.ВалютаКт						= ВалютаСделки;
		Проводка.ВалютнаяСуммаКт				= ОбщаяСуммаСделки;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаРасход,
			|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК КоличествоРасход,
			|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание
			|ПОМЕСТИТЬ ИсполненияПоСделкам
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			&ДатаНачалаОборотов,
			|			&МоментДляИсполнений,
			|			,
			|			Основание = &Сделка
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОбороты.Основание
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СУММА(ЗадолженностиПоЦеннымБумагамОбороты.СуммаРасход),
			|	СУММА(ЗадолженностиПоЦеннымБумагамОбороты.КоличествоРасход),
			|	ЗадолженностиПоЦеннымБумагамОбороты.Основание
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Обороты(&ДатаНачалаОборотов, &МоментДляИсполнений, , Основание = &Сделка) КАК ЗадолженностиПоЦеннымБумагамОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоЦеннымБумагамОбороты.Основание
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(УсловияСделокСрезПоследних.Сумма) КАК СуммаСделки,
			|	СУММА(УсловияСделокСрезПоследних.СуммаКупона) КАК СуммаСделкиКупон,
			|	ИсполненияПоСделкам.Основание КАК Основание
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(&МоментДляУсловий, Сделка = &Сделка) КАК УсловияСделокСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполненияПоСделкам КАК ИсполненияПоСделкам
			|		ПО УсловияСделокСрезПоследних.Сделка = ИсполненияПоСделкам.Основание
			|ГДЕ
			|	ИсполненияПоСделкам.Основание ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	ИсполненияПоСделкам.Основание";
		
		Запрос.УстановитьПараметр("ДатаНачалаОборотов", НачалоДня(ДатаСделки));
		Запрос.УстановитьПараметр("МоментДляИсполнений", Новый Граница(ОбъектДокумента.МоментВремени(),ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("МоментДляУсловий", Новый Граница(ОбъектДокумента.МоментВремени(),?(ТипЗнч(ОбъектДокумента.Ссылка)=Тип("ДокументСсылка.Сделка"),ВидГраницы.Включая,ВидГраницы.Исключая)));
		Запрос.УстановитьПараметр("Сделка", Сделка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			
			СуммаСделки = ВыборкаДетальныхЗаписей.СуммаСделки;
			СуммаСделкиКупон = ВыборкаДетальныхЗаписей.СуммаСделкиКупон;
			
			СуммаСделкиРуб = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата, Отказ),2);
			СуммаСделкиКупонРуб = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделкиКупон, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата, Отказ),2);
			
			//отражаем цену сделки
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаСделкиРуб + СуммаСделкиКупонРуб, "Цена сделки");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаДт  = ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = СуммаСделки + СуммаСделкиКупон;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт        = ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = СуммаСделки + СуммаСделкиКупон;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиСписанияЦеннойБумагиСПартиямиНаЛицевыхСчетах(УчетныйРегистр, ОбъектДокумента, Отказ) Экспорт 
	
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ОбъектДокумента.Дата,
		ОбъектДокумента.Организация,
		ОбъектДокумента.СчетДоверительногоУправления);
		
	Если НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423ПриОплатеВДеньТПлюс Тогда
		Если БухгалтерскийУчетЕПС.ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423(ОбъектДокумента, "Списание") Тогда
			НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;
		Иначе
			НастройкиУчетаОбщие.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47408;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоСписаниеЦеннойБумаги = ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.СписаниеЦеннойБумаги");
	ЭтоПогашениеЦеннойБумаги = ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПогашениеЦеннойБумаги");
	ЭтоОплата = ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата");
	
	МассивПогашений = Новый Массив();
	
	Если ЭтоПогашениеЦеннойБумаги Тогда
		МассивПогашений.Добавить(ОбъектДокумента.Ссылка);
	ИначеЕсли ЭтоСписаниеЦеннойБумаги Тогда
		МассивПогашений.Добавить(ОбъектДокумента.ПогашениеЦеннойБумаги);
	ИначеЕсли ЭтоОплата Тогда
		Для каждого СтрокаОснования Из ОбъектДокумента.Основания Цикл
			МассивПогашений.Добавить(СтрокаОснования.Основание);
		КонецЦикла;
	КонецЕсли;
	
	СубконтоЦБ_Р = Новый Массив;
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Резервы);
	
	// читаем движения партий
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеЦеннойБумаги.ВалютаОплаты КАК ВалютаОплаты,
		|	ПогашениеЦеннойБумаги.Количество КАК Количество,
		|	ПогашениеЦеннойБумаги.Сумма КАК Сумма,
		|	ПогашениеЦеннойБумаги.СуммаКупона КАК СуммаКупона,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК Номинал,
		|	ПогашениеЦеннойБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПогашениеЦеннойБумаги.Ссылка КАК Ссылка,
		|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _ДанныеПогашений
		|ИЗ
		|	Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ПогашениеЦеннойБумаги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО ПогашениеЦеннойБумаги.Ссылка = ЗадолженностиПоДенежнымСредствам.Регистратор
		|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|ГДЕ
		|	ПогашениеЦеннойБумаги.Ссылка В(&МассивПогашений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПремияНачисленная,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия > 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПремияНачисленнаяВВалютеУчета,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия < 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленный
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДисконтНачисленный,
		|	СУММА(ВЫБОР
		|			КОГДА БухПартииЦенныхБумаг.ДисконтПремия < 0
		|				ТОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДисконтНачисленныйВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ИндексацияНоминала) КАК ИндексацияНоминала,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	БухПартииЦенныхБумаг.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.ПереоценкаСНачалаГода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)) КАК ДатаПокупки
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ДанныеПогашений.ЦеннаяБумага
		|					ИЗ
		|						_ДанныеПогашений)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	МАКСИМУМ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК АналитикаРезерва,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчетаРезерва
		|ПОМЕСТИТЬ _АналитикаРезервов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ
		|					_ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов
		|				ИЗ
		|					_ДвиженияПартий КАК _ДвиженияПартий
		|				ГДЕ
		|					_ДвиженияПартий.СуммаРезервовПодОбесценение > 0),
		|			&СубконтоЦБ_Р,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						_ДвиженияПартий.ЦеннаяБумага
		|					ИЗ
		|						_ДвиженияПартий КАК _ДвиженияПартий
		|					ГДЕ
		|						_ДвиженияПартий.СуммаРезервовПодОбесценение > 0)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	СчетУчетаРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.Партия КАК Партия,
		|	_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии,
		|	_ДвиженияПартий.Количество КАК Количество,
		|	_ДвиженияПартий.Стоимость + ВЫБОР
		|		КОГДА _ДвиженияПартий.ЦеннаяБумага <> &Облигация_РЖД_11
		|			ТОГДА 0
		|		ИНАЧЕ _ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная
		|	КОНЕЦ КАК Стоимость,
		|	_ДвиженияПартий.СтоимостьВВалютеУчета + ВЫБОР
		|		КОГДА _ДвиженияПартий.ЦеннаяБумага <> &Облигация_РЖД_11
		|			ТОГДА 0
		|		ИНАЧЕ _ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная
		|	КОНЕЦ КАК СтоимостьВВалютеУчета,
		|	_ДвиженияПартий.Переоценка КАК Переоценка,
		|	_ДвиженияПартий.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	_ДвиженияПартий.СтоимостьКупона КАК СтоимостьКупона,
		|	_ДвиженияПартий.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	_ДвиженияПартий.ПереоценкаКупона КАК ПереоценкаКупона,
		|	_ДвиженияПартий.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	_ДвиженияПартий.ПремияНачисленная КАК ПремияНачисленная,
		|	_ДвиженияПартий.ПремияНачисленнаяВВалютеУчета КАК ПремияНачисленнаяВВалютеУчета,
		|	_ДвиженияПартий.ДисконтНачисленный КАК ДисконтНачисленный,
		|	_ДвиженияПартий.ДисконтНачисленныйВВалютеУчета КАК ДисконтНачисленныйВВалютеУчета,
		|	_ДвиженияПартий.КорректировкаЭСП КАК КорректировкаЭСП,
		|	_ДвиженияПартий.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	_ДвиженияПартий.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_ДвиженияПартий.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная,
		|	_ДанныеПогашений.ВалютаОплаты КАК Погашение_ВалютаОплаты,
		|	_ДанныеПогашений.Количество КАК Погашение_Количество,
		|	_ДанныеПогашений.Сумма КАК Погашение_Сумма,
		|	_ДанныеПогашений.СуммаКупона КАК Погашение_СуммаКупона,
		|	_ДанныеПогашений.Номинал КАК Номинал,
		|	_ДвиженияПартий.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	_ДанныеПогашений.Ссылка КАК Погашение,
		|	_ДанныеПогашений.Контрагент КАК Погашение_Контрагент,
		|	_Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	_ДвиженияПартий.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	_Остатки.ДатаПокупки КАК ДатаПокупки,
		|	ЕСТЬNULL(_АналитикаРезервов.АналитикаРезерва, &АналитикаРезерваПоУмолчанию) КАК АналитикаРезерва
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеПогашений КАК _ДанныеПогашений
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _ДанныеПогашений.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Остатки КАК _Остатки
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _Остатки.ЦеннаяБумага
		|			И _ДвиженияПартий.УчетныйАктивЕПС = _Остатки.УчетныйАктивЕПС
		|			И _ДвиженияПартий.Партия = _Остатки.Партия
		|			И _ДвиженияПартий.СтрокаПартии = _Остатки.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АналитикаРезервов КАК _АналитикаРезервов
		|		ПО _ДвиженияПартий.ЦеннаяБумага = _АналитикаРезервов.ЦеннаяБумага
		|			И _ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов = _АналитикаРезервов.СчетУчетаРезерва";

	Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
	Запрос.УстановитьПараметр("МассивПогашений", МассивПогашений);
	Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("СубконтоЦБ_Р", СубконтоЦБ_Р);
	Запрос.УстановитьПараметр("АналитикаРезерваПоУмолчанию", Справочники.Резервы.РезервОбесценениеУбытки12Месяцев);
	// у нее корректировка ПП пошла в тело, пока хардкод, будет исправляться по задаче по корректировке ПП
	Запрос.УстановитьПараметр("Облигация_РЖД_11", ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_11"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда // списания партий не было
		Если ЭтоСписаниеЦеннойБумаги ИЛИ ЭтоПогашениеЦеннойБумаги Тогда // для списания ВСЕГДа должно быть списание партий, а для погашения если мы сюда попали, то тоже обязано быть списание партий
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ОбъектДокумента.Ссылка,,, Отказ);
		Иначе
			// в любом случае ничего не делаем, только для оплат это норма
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	
	СделалиПроводкиНачалаСделки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
			НастройкиУчетаОбщие,
			Выборка.ЦеннаяБумага,
			Выборка.УчетныйАктивЕПС,
			Выборка.Партия,
			Выборка.СтрокаПартии);
			
		Если (ЭтоСписаниеЦеннойБумаги Или ЭтоОплата) И НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности(Выборка.Погашение) Тогда
			// бумага не была списана в день погашения и весь НКД ранее был перенесен на эту аналитику
			АналитикаКупонНачисленный 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;	
			АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
		Иначе
			АналитикаКупонНачисленный 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
			АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
		КонецЕсли;	
		
		Если Выборка.Стоимость = 0 Тогда // сумма уже списана -> гоним количество по маршруту 50х -> 612 -> 47407
	
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, 0, "Погашение ценной бумаги");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
			Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = Выборка.Погашение;
			
			Проводка.КоличествоДт = Выборка.Количество;
			
			// кредит
			Проводка.СчетКт = Выборка.УчетныйАктивЕПС.СчетУчета;
			
			Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			
			Проводка.ВалютаКт = Выборка.Погашение_ВалютаОплаты;
			Проводка.КоличествоКт = Выборка.Количество;
			
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			
			Проводка.Партия = Выборка.Партия;
			Проводка.СтрокаПартии = Выборка.СтрокаПартии;
			
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, 0, "Погашение ценной бумаги");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
				
			Проводка.СубконтоДт.Контрагенты = Выборка.Погашение_Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Выборка.Погашение;
			
			Проводка.ВалютаДт = Выборка.Погашение_ВалютаОплаты;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
				
			Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоКт.ОснованиеРасчетов = Выборка.Погашение;
			
			Проводка.КоличествоКт = Выборка.Количество;
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеПогашения = Новый Структура("Сумма, Количество", Выборка.Погашение_Сумма , Выборка.Погашение_Количество);
		
		ПроверитьПравильностьСписанияЦеннойБумаги(Выборка.ЦеннаяБумага, ОбъектДокумента, Выборка.Погашение, ДанныеПогашения, Выборка, НастройкиУчетаЦеннойБумаги, Отказ);
		
		Если НЕ СделалиПроводкиНачалаСделки Тогда
			
			Количество = Выборка.Погашение_Количество;
			
			СуммаВВалютеОплаты = Выборка.Погашение_Сумма;
			СуммаВВалютеНоминала = Выборка.Погашение_Количество * Выборка.Номинал;
			
			СуммаКупонаВВалютеОплаты = Выборка.Погашение_СуммаКупона;
			СуммаКупонаВВалютеНоминала = Количество * РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(Выборка.ЦеннаяБумага, НачалоДня(Выборка.Погашение.Дата), ОбъектДокумента.СчетДоверительногоУправления, Истина);
			
			Если Выборка.Погашение_ВалютаОплаты = ВалютаУчета Тогда
				СуммаВВалютеУчета = СуммаВВалютеОплаты;
				СуммаКупонаВВалютеУчета = СуммаКупонаВВалютеОплаты;
			ИначеЕсли Выборка.ВалютаНоминала = ВалютаУчета Тогда
				СуммаВВалютеУчета = СуммаВВалютеНоминала;
				СуммаКупонаВВалютеУчета = СуммаКупонаВВалютеНоминала;
			Иначе
				СуммаВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВВалютеНоминала, Выборка.ВалютаНоминала, ОбъектДокумента.Дата, ВалютаУчета, ОбъектДокумента.Дата, Отказ);
				СуммаКупонаВВалютеУчета = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКупонаВВалютеНоминала, Выборка.ВалютаНоминала, ОбъектДокумента.Дата, ВалютаУчета, ОбъектДокумента.Дата, Отказ);
			КонецЕсли;
			
			ПараметрыОплаты = Новый Структура;
			
			ПараметрыОплаты.Вставить("ВалютаУчета",						ВалютаУчета);
			ПараметрыОплаты.Вставить("Сделка",							Выборка.Погашение);
			ПараметрыОплаты.Вставить("СуммаТела",						СуммаВВалютеОплаты);
			ПараметрыОплаты.Вставить("СуммаКупона",						СуммаКупонаВВалютеОплаты);
			ПараметрыОплаты.Вставить("ВалютаСделки",					Выборка.Погашение_ВалютаОплаты);
			ПараметрыОплаты.Вставить("ВалютаОплаты",					Выборка.Погашение_ВалютаОплаты);
			ПараметрыОплаты.Вставить("Контрагент",						Выборка.Погашение_Контрагент);
			ПараметрыОплаты.Вставить("НастройкиУчета",					НастройкиУчетаЦеннойБумаги);
			
			ПараметрыОплаты.Вставить("СуммаСделкиВВалютеУчета",			СуммаВВалютеУчета);
			ПараметрыОплаты.Вставить("СуммаКупонаВВалютеУчета",			СуммаКупонаВВалютеУчета);
			
			Если НЕ НастройкиУчетаЦеннойБумаги.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда // купон идет, как при погшашении купона по 501м счетам
			
				ПараметрыОплаты.Вставить("СуммаКупона",				0);
				ПараметрыОплаты.Вставить("СуммаКупонаВВалютеУчета",	0);
				
			КонецЕсли;
			
			БухгалтерскийУчетЕПС.СформироватьПроводкиНачалаСделкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
			
			СделалиПроводкиНачалаСделки = Истина;
		
		КонецЕсли;
		
		СписыватьПереоценку = Истина;
		Если НастройкиУчетаЦеннойБумаги.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу Тогда  // переоценку списывать не надо - ее списали в погашении
			Если Выборка.Погашение.Дата < НачалоДня(ОбъектДокумента.Дата)                		// но только если погашение было в прошлом дне 
				ИЛИ НастройкиУчетаЦеннойБумаги.СписыватьПриПолномПогашенииВМоментПогашения Тогда 			// или они списывают при погашении
				СписыватьПереоценку = Ложь;
			КонецЕсли;
		КонецЕсли;
		
					
		СуммаСписать		= Окр(СуммаВВалютеОплаты		/ Количество * Выборка.КоличествоОстаток, 2);
		СуммаКупонаСписать	= Окр(СуммаКупонаВВалютеОплаты	/ Количество * Выборка.КоличествоОстаток, 2);
		
		СуммаВВалютеУчетаСписать		= Окр(СуммаВВалютеУчета			/ Количество * Выборка.КоличествоОстаток, 2);
		СуммаКупонаВВалютеУчетаСписать	= Окр(СуммаКупонаВВалютеУчета	/ Количество * Выборка.КоличествоОстаток, 2);
		
		СуммаВВалютеОплаты			= СуммаВВалютеОплаты		- СуммаСписать;
		СуммаКупонаВВалютеОплаты	= СуммаКупонаВВалютеОплаты	- СуммаКупонаСписать;
		
		СуммаВВалютеУчета		= СуммаВВалютеУчета			- СуммаВВалютеУчетаСписать;
		СуммаКупонаВВалютеУчета	= СуммаКупонаВВалютеУчета	- СуммаКупонаВВалютеУчетаСписать;
		
		ПараметрыОплаты.Вставить("УчетныйАктивЕПС",		Выборка.УчетныйАктивЕПС);
		ПараметрыОплаты.Вставить("ЦеннаяБумага",		Выборка.ЦеннаяБумага);
		ПараметрыОплаты.Вставить("ВалютаНоминала",		Выборка.ВалютаНоминала);
		ПараметрыОплаты.Вставить("ВалютаСделки",		Выборка.ВалютаНоминала);
		ПараметрыОплаты.Вставить("ВалютаУчета",			ВалютаУчета);
		
		ПараметрыОплаты.Вставить("Партия",				Выборка.Партия);
		ПараметрыОплаты.Вставить("СтрокаПартии",		Выборка.СтрокаПартии);
		
		Количество = Количество - Выборка.КоличествоОстаток;
		
		// 2 Продажа тела и купона 47407-61
		ПараметрыОплаты.Вставить("Количество",			Выборка.Количество);
		
		ПараметрыОплаты.Вставить("СуммаРеализации",				СуммаСписать);
		ПараметрыОплаты.Вставить("СуммаРеализацииВВалютеУчета",	СуммаВВалютеУчетаСписать);
		
		СформироватьПроводкуРеализацииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		Если НастройкиУчетаЦеннойБумаги.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации Тогда
		
			ПараметрыОплаты.Вставить("Количество",					0);
			ПараметрыОплаты.Вставить("СуммаРеализации",				СуммаКупонаСписать);
			ПараметрыОплаты.Вставить("СуммаРеализацииВВалютеУчета",	СуммаКупонаВВалютеУчетаСписать);
			
			СформироватьПроводкуРеализацииСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ, "(Купон)");
		
		КонецЕсли;
		
		// 3 Списание себестоимости и прочего 612-501
		
		// тело
		ПараметрыОплаты.Вставить("Количество",					Выборка.Количество);
		ПараметрыОплаты.Вставить("СчетУчета",					Выборка.УчетныйАктивЕПС.СчетУчета);
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаТела);
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.Стоимость);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.СтоимостьВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		ПараметрыОплаты.Вставить("Количество",					0);
		
		// НКДУ
		ПараметрыОплаты.Вставить("СчетУчета",					Выборка.УчетныйАктивЕПС.СчетУчетаКупона);
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаКупонПриобретенный);
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.СтоимостьКупона);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.СтоимостьКупонаВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// НКДН
		ПараметрыОплаты.Вставить("СчетУчета",					Выборка.УчетныйАктивЕПС.СчетУчетаКупона);
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаКупонНачисленный);
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.ПереоценкаКупона);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.ПереоценкаКупонаВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// Дисконт/премия
		ПараметрыОплаты.Вставить("СчетУчета",					Выборка.УчетныйАктивЕПС.СчетУчета);
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаДисконта);
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.ДисконтНачисленный);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.ДисконтНачисленныйВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// Премия
		ПараметрыОплаты.Вставить("СчетУчета",					Выборка.УчетныйАктивЕПС.СчетУчета);
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаПремии);
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.ПремияНачисленная);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.ПремияНачисленнаяВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// Переоценка
		Если СписыватьПереоценку Тогда
			ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		АналитикаПереоценкиТела);
			Если Выборка.ПереоценкаВВалютеУчета > 0 Тогда
				ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
			Иначе
				ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			КонецЕсли;
			ПараметрыОплаты.Вставить("Стоимость",					Выборка.Переоценка);
			ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.ПереоценкаВВалютеУчета);
			
			СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		КонецЕсли;
		
		// Корректировка
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		Если Выборка.КорректировкаЭСПВВалютеУчета > 0 Тогда
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаКорректировокА);
		Иначе
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		КонецЕсли;
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.КорректировкаЭСП);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.КорректировкаЭСПВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ, "Корректировка ЭСП");
		
		// Разница ПП
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		Если Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета > 0 Тогда
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт);
		Иначе
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
		КонецЕсли;
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// Индексация номинала
		ПараметрыОплаты.Вставить("ДополнительнаяАналитика",		Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала);
		Если Выборка.ИндексацияНоминала > 0 Тогда
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
		Иначе
			ПараметрыОплаты.Вставить("СчетУчета",				Выборка.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
		КонецЕсли;
		ПараметрыОплаты.Вставить("Стоимость",					Выборка.ИндексацияНоминала);
		ПараметрыОплаты.Вставить("СтоимостьВВалютеУчета",		Выборка.ИндексацияНоминала);
		
		СформироватьПроводкиСписания(ОбъектДокумента, УчетныйРегистр, ПараметрыОплаты, Отказ);
		
		// 4 Доход/расход по бумаге 612-715 или наоборот
		
		ДоходРасход = СуммаСписать + СуммаКупонаСписать
			- Выборка.Стоимость
			- Выборка.СтоимостьКупона
			- Выборка.ПереоценкаКупона
			- Выборка.ДисконтНачисленный
			- Выборка.ПремияНачисленная
			- Выборка.КорректировкаЭСП
			- Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные
			- Выборка.ИндексацияНоминала;
			
		ДоходРасходВВалютеУчета = СуммаВВалютеУчетаСписать + СуммаКупонаВВалютеУчетаСписать
			- Выборка.СтоимостьВВалютеУчета
			- Выборка.СтоимостьКупонаВВалютеУчета
			- Выборка.ПереоценкаКупонаВВалютеУчета
			- Выборка.ДисконтНачисленныйВВалютеУчета
			- Выборка.ПремияНачисленнаяВВалютеУчета
			- Выборка.КорректировкаЭСПВВалютеУчета
			- Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
			- Выборка.ИндексацияНоминала;
			
		Если СписыватьПереоценку Тогда
		
			ДоходРасход = ДоходРасход - Выборка.Переоценка;
				
			ДоходРасходВВалютеУчета = ДоходРасходВВалютеУчета - Выборка.ПереоценкаВВалютеУчета;
		
		КонецЕсли;						
			
		Если ДоходРасходВВалютеУчета > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ДоходРасходВВалютеУчета, "Продажа ценной бумаги");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			
			Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
			
			// кредит
			Проводка.СчетКт = Выборка.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
			
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = Выборка.УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
			Проводка.СубконтоКт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
			
			Проводка.Партия = Выборка.Партия;
			Проводка.СтрокаПартии = Выборка.СтрокаПартии;
			
		ИначеЕсли ДоходРасходВВалютеУчета < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, -ДоходРасходВВалютеУчета, "Продажа ценной бумаги");
			
			// дебет
			Проводка.СчетДт = Выборка.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = Выборка.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
			Проводка.СубконтоДт.ЦенныеБумаги         = Выборка.ЦеннаяБумага;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			
			Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
			
			Проводка.Партия = Выборка.Партия;
			Проводка.СтрокаПартии = Выборка.СтрокаПартии;
		
		КонецЕсли;
		
		Если Выборка.СуммаРезервовПодОбесценение > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, Выборка.СуммаРезервовПодОбесценение, "Списание резерва");	
			
			
			Проводка.СчетДт = Выборка.УчетныйАктивЕПС.СчетУчетаРезервов;
			
			Проводка.СубконтоДт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
			Проводка.СубконтоДт.Резервы	= Выборка.АналитикаРезерва; 
			
			ЭтоАктивДляПродажи = (Выборка.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи
									ИЛИ Выборка.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи);
			
			Если ЭтоАктивДляПродажи Тогда
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУРезервовДляБумагДляПродажиНаСчете106(Выборка.УчетныйАктивЕПС, Ложь);
			КонецЕсли;
			
			Проводка.ВалютаДт			= ВалютаУчета;
			Проводка.ВалютнаяСуммаДт	= Выборка.СуммаРезервовПодОбесценение;
			
			
			Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(Выборка.УчетныйАктивЕПС.АналитикаСписанияРезервов.НомерСчетаБухгалтерскогоУчета) ;
			
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов	= Выборка.УчетныйАктивЕПС.АналитикаСписанияРезервов;
			Проводка.СубконтоКт.ЦенныеБумаги							= Выборка.ЦеннаяБумага;

			Проводка.Партия = Выборка.Партия;
			Проводка.СтрокаПартии = Выборка.СтрокаПартии;
			
		КонецЕсли;
		
		// для бумаг "Для продажи" нужно перевести переоценку со 106го на 715й счет
		Если Выборка.УчетныйАктивЕПС.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
		
			ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(
									ОбъектДокумента,
									Выборка.УчетныйАктивЕПС,
									Выборка.ЦеннаяБумага,
									ВалютаУчета,
									-Выборка.ПереоценкаСНачалаГода,
									Выборка.Партия,
									Выборка.СтрокаПартии);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьПроводкиНачисленияКорректировкиЭСПСПереброской(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки)

	СуммаПереброскиКорректировкиЭСП = 0;
	СуммаПереброскиКорректировкиЭСПВВалютеУчета = 0;
	СуммаПереброскиДоходовРасходов = 0;
	
	СчетПереброски500Дт = Неопределено;
	СчетПереброски500Кт = Неопределено;
	
	СчетПереброски700Дт = Неопределено;
	СчетПереброски700Кт = Неопределено;
	АналитикаПереброски700Дт = Неопределено;
	АналитикаПереброски700Кт = Неопределено;
	
	Если ПараметрыПроводки.СуммаВВалютеУчета > 0 Тогда
		
		ПроводкаНачисления = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		Если ПараметрыПроводки.СчетУчета.Вид = ВидСчета.Активный Тогда // все ок, без переброски
			ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетУчета;
		Иначе // переброска: у нас ПАССИВНОЕ сальдо на начало проводки, а нам нужно НАЧИСЛЯТЬ - значит начисляем и потом перекидываем
			ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетУчетаПарный;
			Если ПараметрыПроводки.СуммаБалансоваяВВалютеУчета + ПараметрыПроводки.СуммаВВалютеУчета  <= 0 Тогда // начислив, мы так и остались в рамках пассивного сальдо - перенесем сумму проводки
				СуммаПереброскиКорректировкиЭСПВВалютеУчета = ПараметрыПроводки.СуммаВВалютеУчета;
				СуммаПереброскиКорректировкиЭСП = ПараметрыПроводки.Сумма;
			Иначе // начислив, мы перешли в положительное сальдо - делаем переброску на сумма начального остатка, он с минусом, поэтому меняем знак
				СуммаПереброскиКорректировкиЭСПВВалютеУчета = -ПараметрыПроводки.СуммаБалансоваяВВалютеУчета;
				СуммаПереброскиКорректировкиЭСП = -ПараметрыПроводки.СуммаБалансовая;
			КонецЕсли;
			// с активного на пассивный
			СчетПереброски500Дт = ПараметрыПроводки.СчетУчета;
			СчетПереброски500Кт = ПараметрыПроводки.СчетУчетаПарный;
		КонецЕсли;
		
		ПроводкаНачисления.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаНачисления.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаНачисления.ВалютнаяСуммаДт = ПараметрыПроводки.Сумма;
		
		// кредит
		Если ПараметрыПроводки.СчетДоходовРасходов.Вид = ВидСчета.Пассивный Тогда // все ок, без переброски
			ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетДоходовРасходов;
			ПроводкаНачисления.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
		Иначе // переброска: у нас АКТИВНОЕ сальдо на начало проводки, а нам нужно СПИСЫВАТЬ - значит списываем и потом перекидываем
			ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетДоходовРасходовПарный;
			ПроводкаНачисления.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
			Если ПараметрыПроводки.СуммаСНачалаГода <= 0 Тогда // списав, так и остались в рамках активного сальдо, (нюанс СуммаСНачалаГодаВВалютеУчета - это сумма на конец проводки, она идет уже с учетом движения)
				СуммаПереброскиДоходовРасходов = ПараметрыПроводки.СуммаВВалютеУчета; // перенесем сумму проводки
			Иначе // списав, мы перешли в пассивное сальдо - делаем переброску на сумма начального остатка
				СуммаПереброскиДоходовРасходов = ПараметрыПроводки.СуммаСНачалаГода + ПараметрыПроводки.СуммаВВалютеУчета;
			КонецЕсли;
			// с активного на пассивный
			СчетПереброски700Дт = ПараметрыПроводки.СчетДоходовРасходовПарный;
			СчетПереброски700Кт = ПараметрыПроводки.СчетДоходовРасходов;
			АналитикаПереброски700Дт = ПараметрыПроводки.ГФУПарный;
			АналитикаПереброски700Кт = ПараметрыПроводки.ГФУ;
		КонецЕсли;
		
		ПроводкаНачисления.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
	ИначеЕсли ПараметрыПроводки.СуммаВВалютеУчета < 0 Тогда
		
		ПроводкаНачисления = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
		
		// дебет
		Если ПараметрыПроводки.СчетДоходовРасходов.Вид = ВидСчета.Активный Тогда // все ок, без переброски
			ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетДоходовРасходов;
			ПроводкаНачисления.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУ;
		Иначе // переброска: у нас ПАССИВНОЕ сальдо на начало проводки, а нам нужно НАЧИСЛЯТЬ - значит начисляем и потом перекидываем			
			ПроводкаНачисления.СчетДт = ПараметрыПроводки.СчетДоходовРасходовПарный;
			ПроводкаНачисления.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыПроводки.ГФУПарный;
			Если ПараметрыПроводки.СуммаСНачалаГода >= 0 Тогда // начислив, мы так и остались в рамках пассивного сальдо - перенесем сумму проводки (нюанс СуммаСНачалаГодаВВалютеУчета - это сумма на конец проводки, она идет уже с учетом движения)
				СуммаПереброскиДоходовРасходов = -ПараметрыПроводки.СуммаВВалютеУчета; // перенесем сумму проводки, только знак на + поменяем
			Иначе // начислив, мы перешли в положительное сальдо - делаем переброску на сумма начального остатка
				СуммаПереброскиДоходовРасходов = ПараметрыПроводки.СуммаСНачалаГода - ПараметрыПроводки.СуммаВВалютеУчета;
			КонецЕсли;
			// с активного на пассивный
			СчетПереброски700Дт = ПараметрыПроводки.СчетДоходовРасходов;
			СчетПереброски700Кт = ПараметрыПроводки.СчетДоходовРасходовПарный;
			АналитикаПереброски700Дт = ПараметрыПроводки.ГФУ;
			АналитикаПереброски700Кт = ПараметрыПроводки.ГФУПарный;
		КонецЕсли;
		
		ПроводкаНачисления.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		// кредит
		Если ПараметрыПроводки.СчетУчета.Вид = ВидСчета.Пассивный Тогда // все ок, без переброски
			ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетУчета;
		Иначе // переброска: у нас АКТИВНОЕ сальдо на начало проводки, а нам нужно СПИСЫВАТЬ - значит списываем и потом перекидываем
		    ПроводкаНачисления.СчетКт = ПараметрыПроводки.СчетУчетаПарный;
			Если ПараметрыПроводки.СуммаБалансоваяВВалютеУчета + ПараметрыПроводки.СуммаВВалютеУчета  >= 0 Тогда // списав, так и остались в рамках активного сальдо - перенесем сумму проводки
				СуммаПереброскиКорректировкиЭСПВВалютеУчета = -ПараметрыПроводки.СуммаВВалютеУчета;
				СуммаПереброскиКорректировкиЭСП = -ПараметрыПроводки.Сумма;
			Иначе // начислив, мы перешли в положительное сальдо - делаем переброску на сумма начального остатка
				СуммаПереброскиКорректировкиЭСПВВалютеУчета = ПараметрыПроводки.СуммаБалансоваяВВалютеУчета;
				СуммаПереброскиКорректировкиЭСП = ПараметрыПроводки.СуммаБалансовая;
			КонецЕсли;
			// с активного на пассивный
			СчетПереброски500Дт = ПараметрыПроводки.СчетУчетаПарный;
			СчетПереброски500Кт = ПараметрыПроводки.СчетУчета;
		КонецЕсли;
		
		ПроводкаНачисления.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		
		ПроводкаНачисления.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаНачисления.ВалютнаяСуммаКт = -ПараметрыПроводки.Сумма;
		
	КонецЕсли;
	
	ПроводкаНачисления.Партия = ПараметрыПроводки.Партия;
	ПроводкаНачисления.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
	
	Если СуммаПереброскиКорректировкиЭСПВВалютеУчета <> 0 Тогда
		
		ПроводкаПереброски500 = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], СуммаПереброскиКорректировкиЭСПВВалютеУчета, "Закрытие парных счетов корректировки ЭСП");
		
		ПроводкаПереброски500.СчетДт = СчетПереброски500Дт;
		ПроводкаПереброски500.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ПроводкаПереброски500.ВалютаДт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаПереброски500.ВалютнаяСуммаДт = СуммаПереброскиКорректировкиЭСП;
		
		ПроводкаПереброски500.СчетКт = СчетПереброски500Кт;
		ПроводкаПереброски500.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.ЦеннаяБумага;
		ПроводкаПереброски500.ВалютаКт  = ПараметрыПроводки.ВалютаНоминала;
		ПроводкаПереброски500.ВалютнаяСуммаКт = СуммаПереброскиКорректировкиЭСП;
		
		ПроводкаПереброски500.Партия = ПараметрыПроводки.Партия;
		ПроводкаПереброски500.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
		
	КонецЕсли;
	
	// тут должна была быть проводка свертки парных счетов доходов/ расходов
	// мы ведь считали СчетПереброски700Дт, СчетПереброски700Кт и прочее
	// но СНГ не смог реализовать учет партий на лицевых счетах счетов 71005/71006
	// поэтому свертка в документе переоценка и уже без партий
	
КонецПроцедуры

Процедура СформироватьПроводкиНачалаСделкиСПартиямиНаЛицевыхСчетах(ОбъектДокумента, УчетныйРегистр, Параметры, Отказ) Экспорт

	Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Сделка")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПоставкаЦенныхБумаг") Тогда
		
		// начало сделки "торговое" - не делим стоимость и купон
		Если Параметры.СуммаСделкиВВалютеУчета + Параметры.СуммаКупонаВВалютеУчета <> 0
			И Параметры.СуммаТела + Параметры.СуммаКупона <> 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
			|	СУММА(БухПартииЦенныхБумаг.СтоимостьПокупки) КАК СуммаТела,
			|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СуммаКупона
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала <> &ВалютаСделки
			|	И БухПартииЦенныхБумаг.Организация = &Организация
			|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И БухПартииЦенныхБумаг.Активность
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала";
			
			Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
			Запрос.УстановитьПараметр("ВалютаСделки", Параметры.ВалютаСделки);
			Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаСделкиВВалютеУчета + Параметры.СуммаКупонаВВалютеУчета, "Цена сделки");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаДт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = Параметры.СуммаТела + Параметры.СуммаКупона;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
				
				Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаКт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = Параметры.СуммаТела + Параметры.СуммаКупона;
			Иначе
				// сделка с замещающими облигациями
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаСделкиВВалютеУчета + Параметры.СуммаКупонаВВалютеУчета, "Цена сделки");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
					
					Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
					
					Проводка.ВалютаДт  = ВыборкаДетальныеЗаписи.ВалютаНоминала;
					Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.СуммаТела + ВыборкаДетальныеЗаписи.СуммаКупона;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
					
					Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
					Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
					
					Проводка.ВалютаКт  = Параметры.ВалютаСделки;
					Проводка.ВалютнаяСуммаКт = Параметры.СуммаТела + Параметры.СуммаКупона;
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПогашениеЦеннойБумаги")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.СписаниеЦеннойБумаги")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата") Тогда
		
		ДелатьПроводкуНачалаСделки = 
			Параметры.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47408
			ИЛИ Параметры.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;
			
		ДелатьПроводкуПереброски = 
			Параметры.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;
		
		ДелатьПроводкуНачалаСделкиКупон = ДелатьПроводкуНачалаСделки И Параметры.НастройкиУчета.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации;
		
		ДелатьПроводкуПереброскиКупон = ДелатьПроводкуПереброски И Параметры.НастройкиУчета.ВключатьКупонВСуммуРеализацииПриПолномПогашенииОблигации; 
		
		// начало сделки "погашенческое" - не делим стоимость и купон
		Если Параметры.СуммаСделкиВВалютеУчета <> 0 И Параметры.СуммаТела <> 0 И ДелатьПроводкуНачалаСделки Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаСделкиВВалютеУчета, "Цена сделки");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			
			Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
			
			Проводка.ВалютаДт  = Параметры.ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = Параметры.СуммаТела;
			
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			
			Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
			
			Проводка.ВалютаКт  = Параметры.ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = Параметры.СуммаТела;

			Если ДелатьПроводкуПереброски Тогда
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаСделкиВВалютеУчета, "Задолженность");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаДт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = Параметры.СуммаТела;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаКт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = Параметры.СуммаТела;
				
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
			
			КонецЕсли;	
			
		КонецЕсли;
		
		Если Параметры.СуммаКупонаВВалютеУчета <> 0 И Параметры.СуммаКупона <> 0 И ДелатьПроводкуНачалаСделкиКупон Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаКупонаВВалютеУчета, "Цена сделки");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			
			Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
			
			Проводка.ВалютаДт  = Параметры.ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = Параметры.СуммаКупона;
			
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			
			Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
			
			Проводка.ВалютаКт  = Параметры.ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = Параметры.СуммаКупона;

			Если ДелатьПроводкуПереброскиКупон Тогда
			
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Параметры.СуммаКупонаВВалютеУчета, "Задолженность");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаДт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = Параметры.СуммаКупона;
				
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоКт.Контрагенты = Параметры.Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = Параметры.Сделка;
				
				Проводка.ВалютаКт  = Параметры.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = Параметры.СуммаКупона;
				
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
			
		КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьПроводкиНачалаСделки(ОбъектДокумента, Движения, Регистратор, ДанныеПроводок)

	ДелатьПроводкуНачалаСделки = 
		ДанныеПроводок.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47408
		ИЛИ ДанныеПроводок.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;

	ДелатьПроводкуПереброски = 
		ДанныеПроводок.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423;
		
	Если ДелатьПроводкуНачалаСделки Тогда
	
		// Создадим проводки "начала сделки"
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, ДанныеПроводок.НоминальнаяСуммаВВалютеУчета, "Цена сделки");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоДт.Контрагенты = ДанныеПроводок.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = Регистратор;
		
		Проводка.ВалютаДт  = ДанныеПроводок.ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = ДанныеПроводок.НоминальнаяСумма;
		
		Проводка.ДополнительнаяАналитикаДт = ДанныеПроводок.Аналитика;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
		
		Проводка.СубконтоКт.Контрагенты = ДанныеПроводок.Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Регистратор;
		
		Проводка.ВалютаКт  = ДанныеПроводок.ВалютаНоминала;
		Проводка.ВалютнаяСуммаКт = ДанныеПроводок.НоминальнаяСумма;
		
		Проводка.ДополнительнаяАналитикаКт = ДанныеПроводок.Аналитика;

		Если ДелатьПроводкуПереброски Тогда
			
			// перекурсовываем 47408 до фактической суммы платежа
			Если ДанныеПроводок.ВалютаНоминала <> ДанныеПроводок.ВалютаУчета И ДанныеПроводок.СуммаОплатыВВалютеУчета <> ДанныеПроводок.НоминальнаяСуммаВВалютеУчета Тогда
			
				Если ДанныеПроводок.НоминальнаяСуммаВВалютеУчета > ДанныеПроводок.СуммаОплатыВВалютеУчета Тогда
					
					СуммаПерекурсовки = ДанныеПроводок.НоминальнаяСуммаВВалютеУчета - ДанныеПроводок.СуммаОплатыВВалютеУчета;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СуммаПерекурсовки, "Перекурсовка задолженности");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
					
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ДанныеПроводок.ВалютаНоминала, Истина);
					Проводка.СубконтоДт.ЦенныеБумаги = ДанныеПроводок.Облигация;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
					
					Проводка.СубконтоКт.Контрагенты = ДанныеПроводок.Контрагент;
					Проводка.СубконтоКт.ОснованиеРасчетов = Регистратор;
					
					Проводка.ВалютаКт  = ДанныеПроводок.ВалютаНоминала;
					
					Проводка.ДополнительнаяАналитикаКт = ДанныеПроводок.Аналитика;
				
				ИначеЕсли ДанныеПроводок.НоминальнаяСуммаВВалютеУчета < ДанныеПроводок.СуммаОплатыВВалютеУчета Тогда
					
					СуммаПерекурсовки = -(ДанныеПроводок.НоминальнаяСуммаВВалютеУчета - ДанныеПроводок.СуммаОплатыВВалютеУчета);
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СуммаПерекурсовки, "Перекурсовка задолженности");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
					
					Проводка.СубконтоДт.Контрагенты = ДанныеПроводок.Контрагент;
					Проводка.СубконтоДт.ОснованиеРасчетов = Регистратор;
					
					Проводка.ВалютаДт  = ДанныеПроводок.ВалютаНоминала;
					
					Проводка.ДополнительнаяАналитикаДт = ДанныеПроводок.Аналитика;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
					
					Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ДанныеПроводок.ВалютаНоминала, Истина);
					Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПроводок.Облигация;
					
				КонецЕсли;
			
			КонецЕсли;
			
			// для Будущего переносим только то, что не оплачено!
			Если ДанныеПроводок.УчитыватьПрошедшиеПлатежи И ДанныеПроводок.БылиПлатежи Тогда
				СуммаПереносаЗадолженности = ДанныеПроводок.НоминальнаяСумма - ДанныеПроводок.СуммаОплаты;
				СуммаПереносаЗадолженностиВВалютеУчета = ДанныеПроводок.НоминальнаяСуммаВВалютеУчета - ДанныеПроводок.СуммаОплатыВВалютеУчета;
				НоминальнаяСуммаПереносаЗадолженности = СуммаПереносаЗадолженности;
			Иначе
				СуммаПереносаЗадолженности = ДанныеПроводок.СуммаОплаты;
				СуммаПереносаЗадолженностиВВалютеУчета = ДанныеПроводок.СуммаОплатыВВалютеУчета;
				НоминальнаяСуммаПереносаЗадолженности = ДанныеПроводок.НоминальнаяСумма;
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, СуммаПереносаЗадолженностиВВалютеУчета, "Задолженность");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
			
			Проводка.СубконтоДт.Контрагенты = ДанныеПроводок.Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Регистратор;
			
			Проводка.ВалютаДт  = ДанныеПроводок.ВалютаОплаты;
			Проводка.ВалютнаяСуммаДт = СуммаПереносаЗадолженности;
			
			Проводка.ДополнительнаяАналитикаДт = ДанныеПроводок.Аналитика;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
			
			Проводка.СубконтоКт.Контрагенты = ДанныеПроводок.Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = Регистратор;
			
			Проводка.ВалютаКт  = ДанныеПроводок.ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = НоминальнаяСуммаПереносаЗадолженности;
			
			Проводка.ДополнительнаяАналитикаКт = ДанныеПроводок.Аналитика;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// Создадим задолженность по погашению
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения.ЕдиныйБухгалтерскийУчет, ДанныеПроводок.НоминальнаяСуммаВВалютеУчета, "Погашение ценной бумаги");

	// дебет
	Если ДанныеПроводок.НастройкиУчета.ВариантОтраженияЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияЗадолженностиПриПолномПогашении.НаСчете47423БезСчетов47407и47408 Тогда
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
	Иначе	
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
	КонецЕсли;
	
	Проводка.СубконтоДт.Контрагенты = ДанныеПроводок.Контрагент;
	Проводка.СубконтоДт.ОснованиеРасчетов = Регистратор;
	
	Проводка.ВалютаДт  = ДанныеПроводок.ВалютаНоминала;
	Проводка.ВалютнаяСуммаДт = ДанныеПроводок.НоминальнаяСумма;
	
	Проводка.ДополнительнаяАналитикаДт = ДанныеПроводок.Аналитика;
	
	// кредит
	Проводка.СчетКт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		
	Проводка.СубконтоКт.ЦенныеБумаги = ДанныеПроводок.Облигация;
	Проводка.СубконтоКт.ОснованиеРасчетов = Регистратор;
	
	// количество только по телу, не по купону
	Если ДанныеПроводок.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела  Тогда
		Проводка.КоличествоКт = ДанныеПроводок.Количество;	
	КонецЕсли;

КонецПроцедуры

Процедура ПризнатьКомиссиюПоРЕПО(ОбъектДокумента, ПерваяЧастьРЕПО, Контрагент, КонтрагентПоКомиссии, Закрывать7ойРазделПриПоступленииДенежныхСредств) Экспорт

	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);

	// Итак, тут сделано проведение по "правильной" схеме, до 1.1.18 все проведене было не очень правильно (мягко говоря).
	// По большинству клиентов 18й год проводили, но были и такие по которым только с февраля провели
	// К сожалению эта периодичность тут не зашита
	// Проведение этого документа ранее 1.1.18 меняет проводки, и Таня К.(и остальные бухгалтера) в курсе
	// 
	// С 1го марта 18го схема опять изменилась, но это уже тут учитывается
	
	// Комиссия брокера
	ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера;
	
	// ГПБ ведет себя аналогично бирже - начисляет комиссию 1 раз и сразу поэтому ее тоже размазываем
	//
	// БК до 1.3.18 ведет себя "плохо" (и это реализовано в следующем блоке)
	// но с 1.3.18 начинает вести себя "хорошо", как ГПБ
	
	Если ПерваяЧастьРЕПО.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ") // для ГПБ тоже размазываем
		ИЛИ ОбъектДокумента.Дата > '20180402' // со 2го апреля и БК размазываем по всем
		ИЛИ (ОбъектДокумента.Дата > '20180303' // с 3го марта и БК размазываем по всем кроме традиций и нг пр
			И СокрЛП(ОбъектДокумента.СчетДоверительногоУправления.КодСчета) <> "DU_PR_RN_001"
			И СокрЛП(ОбъектДокумента.СчетДоверительногоУправления.КодСчета) <> "DU_UL_PR_24"
			И СокрЛП(ОбъектДокумента.СчетДоверительногоУправления.КодСчета) <> "DU_NPF037")
		Тогда  // для остальных с 1го марта - тоже, как хотелось, но БК в 1-2 марта опять неправильно сделал...
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходыПоСделке.СуммаОборот КАК СуммаКомиссии,
			|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток, 0) КАК ОстатокОплаченоКомиссии,
			|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток, 0) КАК НачислитьКомиссии,
			|	РасходыПоСделке.Валюта КАК Валюта
			|ИЗ
			|	РегистрНакопления.РасходыПоСделке.Обороты(
			|			,
			|			&Период,
			|			Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Сделка = &СделкаРЕПО
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоСделке
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&Период,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства19),
			|				&ВидыСубконто,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Валюта = &Валюта
			|					И Субконто1 = &СделкаРЕПО
			|					И ЛицевойСчет.ДополнительнаяАналитика = &ДополнительнаяАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки
			|		ПО РасходыПоСделке.Сделка = ЕдиныйБухгалтерскийУчетОстатки.Субконто1";
		
		
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
		
		Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
		Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
		Запрос.УстановитьПараметр("Период", ?(ТипЗнч(ОбъектДокумента) = ТИП("ДокументОбъект.Оплата"),Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Включая), Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая)));			
		
		Запрос.УстановитьПараметр("СделкаРЕПО", ПерваяЧастьРЕПО);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Валюта", ПерваяЧастьРЕПО.ВалютаСделки);
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
			СуммаКомисии = ВыборкаДетальныеЗаписи.НачислитьКомиссии;
			ВалютаКомисии = ВыборкаДетальныеЗаписи.Валюта;
			
			ЦеннаяБумага = ПерваяЧастьРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
			УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомисии, ПерваяЧастьРЕПО.ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
			
			ПроводкиПризнанияКомиссииПоРЕПО(ОбъектДокумента, ПерваяЧастьРЕПО, СуммаОперации, СуммаКомисии, ВалютаКомисии, УчетныйАктив, ЦеннаяБумага, Контрагент, КонтрагентПоКомиссии, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств);
			
		КонецЕсли;
		
	ИначеЕсли ОбъектДокумента.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда // брокер БК
		
		//если предыдущий день нерабочий - берем, что было оплачено сегодня
		
		// теущий день тоже считаем, поэтому -2 
		ПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(),НачалоДня(ОбъектДокумента.Дата), -2);
		Если НачалоДня(ПредыдущийРабочийДень) <> (НачалоДня(ОбъектДокумента.Дата) - 86400) Тогда
		
			НачалоПериода = НачалоДня(ОбъектДокумента.Дата);
			КонецПериода = КонецДня(ОбъектДокумента.Дата);
			
		//иначе - берем, что было оплачено вчера
		Иначе
		
			НачалоПериода = НачалоДня(ОбъектДокумента.Дата) - 86400;
			КонецПериода = КонецДня(ОбъектДокумента.Дата) - 86400;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасходыПоСделке.СуммаОборот КАК Комиссия,
			|	РасходыПоСделке.Валюта КАК Валюта
			|ИЗ
			|	РегистрНакопления.РасходыПоСделке.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Сделка = &СделкаРЕПО
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоСделке";
		
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);			
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);			
		Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
		Запрос.УстановитьПараметр("СделкаРЕПО", ПерваяЧастьРЕПО);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
			СуммаКомисии = ВыборкаДетальныеЗаписи.Комиссия;
			ВалютаКомисии = ВыборкаДетальныеЗаписи.Валюта;
			
			ЦеннаяБумага = ПерваяЧастьРЕПО.ЦенныеБумаги[0].ЦеннаяБумага;
			УчетныйАктив = Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО;
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомисии, ПерваяЧастьРЕПО.ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
			
			ПроводкиПризнанияКомиссииПоРЕПО(ОбъектДокумента, ПерваяЧастьРЕПО, СуммаОперации, СуммаКомисии, ВалютаКомисии, УчетныйАктив, ЦеннаяБумага, Контрагент, КонтрагентПоКомиссии, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств);
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
	
	КонецЕсли;

КонецПроцедуры
	
Процедура ПроводкиПризнанияКомиссииПоРЕПО(ОбъектДокумента, ПерваяЧастьРЕПО, СуммаОперации, СуммаКомисии, ВалютаКомиссии, УчетныйАктив, ЦеннаяБумага, Контрагент, КонтрагентПоКомиссии, ДополнительнаяАналитика, Закрывать7ойРазделПриПоступленииДенежныхСредств) Экспорт

	ПризнаватьКомиссию = Истина;
	
	Если ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТорговаяКомиссия Тогда
	
		ОписаниеПроводкиНачисления = "Начисление торговой комиссия";
		ОписаниеПроводкиПризнания = "Признание торговой комиссия";
		ОписаниеПроводкиЗакрытия = "Торговая комиссия закрытие расхода";
		
	ИначеЕсли ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера Тогда
		
		ОписаниеПроводкиНачисления = "Начисление брокерской комиссия";
		ОписаниеПроводкиПризнания = "Признание брокерской комиссия";
		ОписаниеПроводкиЗакрытия = "Комиссия брокера закрытие расхода";
		
		
		// Хардкорд для ППА, еще 1 хардкод в модуле БухгалтерскийУчет 
		Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.СделкаРЕПО") Тогда
			
			Если ОбъектДокумента.ЧастьСделкиРЕПО = 2 Тогда
			
				МассивСчетовППА = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																							ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ППА"),
																							ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
																							ОбъектДокумента.Дата);
				
				ЭтоКлиентППА = (МассивСчетовППА.Найти(ОбъектДокумента.СчетДоверительногоУправления) <> Неопределено);
				
				Если ЭтоКлиентППА И ПерваяЧастьРЕПО.Дата >= '20200622' И ПерваяЧастьРЕПО.Дата < '20200701' Тогда
					
					ПризнаватьКомиссию = Ложь;
					
					Если СуммаКомисии = 0 Тогда // нам она нужна для закрытия 7ого раздела
					
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	РасходыПоСделке.СуммаОборот КАК СуммаКомиссии,
							|	РасходыПоСделке.Валюта КАК Валюта
							|ИЗ
							|	РегистрНакопления.РасходыПоСделке.Обороты(
							|			,
							|			&КонецДня,
							|			Период,
							|			Организация = &Организация
							|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
							|				И Сделка = &СделкаРЕПО
							|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоСделке";
						
						Запрос.УстановитьПараметр("КонецДня", КонецДня(ОбъектДокумента.Дата));
						Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
						Запрос.УстановитьПараметр("СделкаРЕПО", ПерваяЧастьРЕПО);
						Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
						
						ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
						
						Если ВыборкаДетальныеЗаписи.Следующий() Тогда
						
							СуммаКомиссии = ВыборкаДетальныеЗаписи.СуммаКомиссии;
							СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКомиссии, ВыборкаДетальныеЗаписи.Валюта, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
						
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЕсли;
		
		КонецЕсли;
		// конец хардкода
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоКлиентГруппыБудущее(ОбъектДокумента.СчетДоверительногоУправления, ОбъектДокумента.Дата)	И ОбъектДокумента.Дата > '20230101' Тогда
	
		ГФУ = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(КонтрагентПоКомиссии, ОбъектДокумента.Дата);
		
	Иначе
		ГФУ = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(Контрагент, ОбъектДокумента.Дата);
	КонецЕсли;
	
	Если ПризнаватьКомиссию Тогда
	
		// ПРИЗНАНИЕ КОМИССИИ
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиНачисления);
		
		// дебет
		Если ПерваяЧастьРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы03;
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеРасходы02;
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам(Контрагент, ОбъектДокумента.Дата);
		КонецЕсли;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		// кредит
		Если ПерваяЧастьРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства18;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
		КонецЕсли;	
		
		Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПерваяЧастьРЕПО;
		
		Проводка.ВалютаКт = ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт = СуммаКомисии;
		
		// СВЕРНЕМ 18 и 19
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиПризнания);
		
		// дебет
		Если ПерваяЧастьРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства18;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
		КонецЕсли;	
		
		Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
		Проводка.СубконтоДт.ОснованиеРасчетов = ПерваяЧастьРЕПО;
		
		Проводка.ВалютаДт = ВалютаКомиссии;
		Проводка.ВалютнаяСуммаДт = СуммаКомисии;
		
		// кредит
		Если ПерваяЧастьРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства19;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19;
		КонецЕсли;	
		
		Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПерваяЧастьРЕПО;
		
		Проводка.ВалютаКт = ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт = СуммаКомисии;
		Проводка.ДополнительнаяАналитикаКт = ДополнительнаяАналитика;
	
	КонецЕсли;
	
	// ЗАКРЫТИЕ РАСХОДОВ ПО ТОРГОВОЙ КОМИССИИ НА АКТИВЫ В ДУ
	Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ОписаниеПроводкиЗакрытия);
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоДт.Договоры = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
		
		// кредит
		Если ПерваяЧастьРЕПО.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы03;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеРасходы02;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам(Контрагент, ОбъектДокумента.Дата);
		КонецЕсли;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
	
	КонецЕсли; 

КонецПроцедуры

Процедура ЗачестьНачисленныеИПолученныеПроцентыПоДепозитнымВкладам(ОбъектДокумента, Закрывать7ойРазделПриПоступленииДенежныхСредств) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Записать();
	ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Прочитать();
	ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	//возможно, условие для других вариантом выплаты процентов тоже актуально, но пока оставлю так.
	//свернуть 20603 и 20613
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет,
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	БухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
		|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
		|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Субконто1
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03)
		|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК ДепозитныйВклад
		|					ИЗ
		|						РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, КредитныйИнструмент В
		|							(ВЫБРАТЬ
		|								ПереоценкаДепозитныхВкладовДепозитныеВклады.КредитныйИнструмент КАК ДепозитныйВклад
		|							ИЗ
		|								Документ.ПереоценкаКредитныхИнструментов.КредитныеИнструменты КАК ПереоценкаДепозитныхВкладовДепозитныеВклады
		|							ГДЕ
		|								ПереоценкаДепозитныхВкладовДепозитныеВклады.Ссылка = &Ссылка
		|								И ТИПЗНАЧЕНИЯ(ПереоценкаДепозитныхВкладовДепозитныеВклады.КредитныйИнструмент) = ТИП(Справочник.ДепозитныеВклады))) КАК УсловияКредитныхИнструментовСрезПоследних
		|					ГДЕ
		|						УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов = &Авансом)) КАК БухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Остатки03.Субконто1 КАК ДепозитныйВклад,
		|	_Остатки03.СуммаОстатокДт КАК НачисленныеПроценты,
		|	_Остатки03.ВалютнаяСуммаОстатокДт КАК НачисленныеПроцентыВал,
		|	_Остатки13.СуммаОстатокКт КАК ПолученныеПроценты,
		|	_Остатки13.ВалютнаяСуммаОстатокКт КАК ПолученныеПроцентыВал,
		|	УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив КАК УчетныйАктив
		|ИЗ
		|	_Остатки КАК _Остатки03
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Остатки КАК _Остатки13
		|		ПО _Остатки03.Субконто1 = _Остатки13.Субконто1
		|			И (_Остатки03.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03))
		|			И (_Остатки13.Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&ПериодДата, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО _Остатки03.Субконто1 = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент";

	Запрос.УстановитьПараметр("Организация",                  	ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("Период",                       	Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Авансом",			  			Перечисления.ПериодичностиВыплатыПроцентов.Авансом);
	Запрос.УстановитьПараметр("Ссылка",			  				ОбъектДокумента.Ссылка);
	Запрос.УстановитьПараметр("ПериодДата",                    	ОбъектДокумента.Дата);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущийДепозит = ВыборкаДетальныеЗаписи.ДепозитныйВклад;
		УчетныйАктив = ВыборкаДетальныеЗаписи.УчетныйАктив;
		СуммаЗакрытия = Мин(ВыборкаДетальныеЗаписи.ПолученныеПроценты, ВыборкаДетальныеЗаписи.НачисленныеПроценты);
		СуммаЗакрытияВал = Мин(ВыборкаДетальныеЗаписи.ПолученныеПроцентыВал, ВыборкаДетальныеЗаписи.НачисленныеПроцентыВал);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаЗакрытия, "Закрытие полученных процентов по депозитному вкладу");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.Депозиты13;
		Проводка.СубконтоДт.БанковскиеСчета = ТекущийДепозит.БанковскийСчет;
		Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ТекущийДепозит;
		Проводка.ВалютаДт  = ТекущийДепозит.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = СуммаЗакрытияВал;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаПереоценкиА;
		Проводка.СубконтоКт.Контрагенты = ТекущийДепозит.БанковскийСчет.Банк.ЮрФизЛицо;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ТекущийДепозит;
		Проводка.ВалютаКт  = ТекущийДепозит.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = СуммаЗакрытияВал;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаЗакрытия, "Закрытие полученных процентов по депозитному вкладу");
			
			// дебет
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
			Проводка.СубконтоКт.ЦенныеБумаги = ТекущийДепозит;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДвиженияДокументаПоПарнымСчетам(ОбъектДокумента, Отказ) Экспорт
	
	НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчета(
			ОбъектДокумента.Дата,
			ОбъектДокумента.Организация,
			ОбъектДокумента.СчетДоверительногоУправления,
			"НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки");
			
	НеСворачиватьПоПарнымСчетамПереоценкуЦенныхБумаг = БухгалтерскийУчет.ОпределитьНастройкуУчета(
			ОбъектДокумента.Дата,
			ОбъектДокумента.Организация,
			ОбъектДокумента.СчетДоверительногоУправления,
			"НеСворачиватьПоПарнымСчетамПереоценкуЦенныхБумаг");
			
			
	Если НеСворачиватьПоПарнымСчетамПереоценкуЦенныхБумаг Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценки
			|ПОМЕСТИТЬ _СчетаПереоценки
			|ИЗ
			|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
			|ГДЕ
			|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
			|ИЗ
			|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
			|ГДЕ
			|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	_СчетаПереоценки.СчетУчетаПереоценки КАК СчетУчетаПереоценки
			|ИЗ
			|	_СчетаПереоценки КАК _СчетаПереоценки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Единый КАК Единый
			|		ПО _СчетаПереоценки.СчетУчетаПереоценки = Единый.Ссылка
			|ГДЕ
			|	Единый.Код ПОДОБНО ""5%""";
		
		МассивСчетовПереоценки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетУчетаПереоценки");
		
	КонецЕсли;
	
	ДанныеПарныхСчетов = Кэширование.ПолучитьДанныеПарныхСчетов();
	
	
	//#381119 - учет фьючерсов решение проблемы с парными. Счета 47407 и 47408 вообще говоря парные (Света М. присылала выдержку из нормативки) 
	//Но, у документов сделка Т0 и исполнение первая проводка идет Дт 47408 Кт 47407 и это тоже норма, хотя и возникает сальдо по парным
	//Поэтому мы эти счета и не внесли в регистр парных
	//Но по фьючерсам эти 2 счета должны сворачиваться и пришлось добавить параметр ОбработатьСчета47407и47408 в ОбработатьДвиженияДокументаПоПарнымСчетам
	Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Маржа")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПереоценкаСрочныхКонтрактов") Тогда
		
		ДанныеПарныхСчетов.ПарныеСчетаА.Добавить(ПланыСчетов.Единый.Расчеты08);
		ДанныеПарныхСчетов.ПарныеСчетаП.Добавить(ПланыСчетов.Единый.Расчеты07);
		
	ИначеЕсли ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке")
		ИЛИ ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Сделка") Тогда
		
		Если ОбъектДокумента.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
		
			ДанныеПарныхСчетов.ПарныеСчетаА.Добавить(ПланыСчетов.Единый.Расчеты08);
			ДанныеПарныхСчетов.ПарныеСчетаП.Добавить(ПланыСчетов.Единый.Расчеты07);
		
		КонецЕсли;
		
	КонецЕсли;
	
	
	СписокТиповСубконто = РаботаСМетаданнымиПовтИсп.ПолучитьСписокТиповСубконто();
	
	ТаблицаПарныхСчетов = Новый ТаблицаЗначений;
	
	ТаблицаПарныхСчетов.Колонки.Добавить("СчетА",					Новый ОписаниеТипов("ПланСчетовСсылка.Единый"));
	ТаблицаПарныхСчетов.Колонки.Добавить("СчетП",					Новый ОписаниеТипов("ПланСчетовСсылка.Единый"));
	ТаблицаПарныхСчетов.Колонки.Добавить("Субконто1",				Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаПарныхСчетов.Колонки.Добавить("Субконто2",				Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаПарныхСчетов.Колонки.Добавить("Субконто3",				Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаПарныхСчетов.Колонки.Добавить("ДополнительнаяАналитика",	Новый ОписаниеТипов("СправочникСсылка.ДополнительныеАналитикиЛицевыхСчетов"));
	ТаблицаПарныхСчетов.Колонки.Добавить("Валюта",					Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Для каждого ДвижениеЕПС Из ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет Цикл
		
		// по дебету
		ИндексА = ДанныеПарныхСчетов.ПарныеСчетаА.Найти(ДвижениеЕПС.СчетДт);
		ИндексП = ДанныеПарныхСчетов.ПарныеСчетаП.Найти(ДвижениеЕПС.СчетДт);
		
		Если (ДвижениеЕПС.СчетДт.Вид = ВидСчета.Активный И ИндексА <> Неопределено)
			ИЛИ (ДвижениеЕПС.СчетДт.Вид = ВидСчета.Пассивный И ИндексП <> Неопределено) Тогда
			
			СтрокаТаблицыПарныхСчетов = ТаблицаПарныхСчетов.Добавить();
			
			Если ДвижениеЕПС.СчетДт.Вид = ВидСчета.Активный Тогда
				СтрокаТаблицыПарныхСчетов.СчетА = ДвижениеЕПС.СчетДт;
				СтрокаТаблицыПарныхСчетов.СчетП = ДанныеПарныхСчетов.ПарныеСчетаП[ИндексА];
			Иначе
				СтрокаТаблицыПарныхСчетов.СчетА = ДанныеПарныхСчетов.ПарныеСчетаА[ИндексП];
				СтрокаТаблицыПарныхСчетов.СчетП = ДвижениеЕПС.СчетДт;
			КонецЕсли;
			
			Для каждого СтрокаВидыСубконто Из ДвижениеЕПС.СчетДт.ВидыСубконто Цикл
				СтрокаТаблицыПарныхСчетов["Субконто" + Строка(СтрокаВидыСубконто.НомерСтроки)] = ДвижениеЕПС["СубконтоДт"][СтрокаВидыСубконто.ВидСубконто];
			КонецЦикла;
			
			СтрокаТаблицыПарныхСчетов.ДополнительнаяАналитика = ДвижениеЕПС.ДополнительнаяАналитикаДт;
			СтрокаТаблицыПарныхСчетов.Валюта = ДвижениеЕПС.ВалютаДт;
			
		КонецЕсли;
		
		// по кредиту
		ИндексА = ДанныеПарныхСчетов.ПарныеСчетаА.Найти(ДвижениеЕПС.СчетКт);
		ИндексП = ДанныеПарныхСчетов.ПарныеСчетаП.Найти(ДвижениеЕПС.СчетКт);
		
		Если (ДвижениеЕПС.СчетКт.Вид = ВидСчета.Активный И ИндексА <> Неопределено)
			ИЛИ (ДвижениеЕПС.СчетКт.Вид = ВидСчета.Пассивный И ИндексП <> Неопределено) Тогда
			
			СтрокаТаблицыПарныхСчетов = ТаблицаПарныхСчетов.Добавить();
			
			Если ДвижениеЕПС.СчетКт.Вид = ВидСчета.Активный Тогда
				СтрокаТаблицыПарныхСчетов.СчетА = ДвижениеЕПС.СчетКт;
				СтрокаТаблицыПарныхСчетов.СчетП = ДанныеПарныхСчетов.ПарныеСчетаП[ИндексА];
			Иначе
				СтрокаТаблицыПарныхСчетов.СчетА = ДанныеПарныхСчетов.ПарныеСчетаА[ИндексП];
				СтрокаТаблицыПарныхСчетов.СчетП = ДвижениеЕПС.СчетКт;
			КонецЕсли;
			
			Для каждого СтрокаВидыСубконто Из ДвижениеЕПС.СчетКт.ВидыСубконто Цикл
				СтрокаТаблицыПарныхСчетов["Субконто" + Строка(СтрокаВидыСубконто.НомерСтроки)] = ДвижениеЕПС["СубконтоКт"][СтрокаВидыСубконто.ВидСубконто];
			КонецЦикла;
			
			СтрокаТаблицыПарныхСчетов.ДополнительнаяАналитика = ДвижениеЕПС.ДополнительнаяАналитикаКт;
			СтрокаТаблицыПарныхСчетов.Валюта = ДвижениеЕПС.ВалютаКт;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПарныеСчета = ТаблицаПарныхСчетов.Скопировать(, "СчетА, СчетП");
	ПарныеСчета.Свернуть("СчетА, СчетП");
		
	ГруппыСчетовПоСубконто = Новый Соответствие;
	// элементы коллекции ГруппыСчетовПоСубконто в ключе содержат массив счетов, в значении - структуру, содержащую массив субконто, а также таблицу остатков по счетам в массиве
	Для каждого СтрокаПарныхСчетов Из ПарныеСчета Цикл
		СчетДобавлен = Ложь;
		Для каждого ГруппаСчетов Из ГруппыСчетовПоСубконто Цикл
			МассивСубконто = СтрокаПарныхСчетов.СчетА.ВидыСубконто.ВыгрузитьКолонку("ВидСубконто");
			КоличествоСубконто = МассивСубконто.Количество();
			КоличествоНайдено = 0;
			Если ГруппаСчетов.Значение.МассивСубконто.Количество() = КоличествоСубконто Тогда
				Для каждого Субконто Из МассивСубконто Цикл
					Если НЕ ГруппаСчетов.Значение.МассивСубконто.Найти(Субконто) = Неопределено Тогда
						КоличествоНайдено = КоличествоНайдено + 1;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
			Если КоличествоНайдено = КоличествоСубконто Тогда
				ГруппаСчетов.Ключ.Добавить(СтрокаПарныхСчетов.СчетА);
				ГруппаСчетов.Ключ.Добавить(СтрокаПарныхСчетов.СчетП);
				СчетДобавлен = Истина;
			КонецЕсли; 
		КонецЦикла; 
		Если НЕ СчетДобавлен Тогда
			МассивСчетов = Новый Массив;
			МассивСчетов.Добавить(СтрокаПарныхСчетов.СчетА);
			МассивСчетов.Добавить(СтрокаПарныхСчетов.СчетП);
			СтруктураПараметров = Новый Структура("МассивСубконто, ТаблицаОстатков", СтрокаПарныхСчетов.СчетА.ВидыСубконто.ВыгрузитьКолонку("ВидСубконто"), Неопределено);
			ГруппыСчетовПоСубконто.Вставить(МассивСчетов, СтруктураПараметров);
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_ТаблицаПарныхСчетов.СчетА КАК СчетА,
	|	_ТаблицаПарныхСчетов.СчетП КАК СчетП,
	|	_ТаблицаПарныхСчетов.Субконто1 КАК Субконто1,
	|	_ТаблицаПарныхСчетов.Субконто2 КАК Субконто2,
	|	_ТаблицаПарныхСчетов.Субконто3 КАК Субконто3,
	|	_ТаблицаПарныхСчетов.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	_ТаблицаПарныхСчетов.Валюта КАК Валюта
	|ПОМЕСТИТЬ _ТаблицаПарныхСчетов
	|ИЗ
	|	&ТаблицаПарныхСчетов КАК _ТаблицаПарныхСчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетА,
	|	СчетП,
	|	ДополнительнаяАналитика,
	|	Субконто3,
	|	Субконто2,
	|	Субконто1";
	Запрос.УстановитьПараметр("ТаблицаПарныхСчетов", ТаблицаПарныхСчетов);
	Запрос.Выполнить();
	
	// получаем остатки по группам счетов с одинаковой аналитикой
	Для каждого ГруппаСчетов Из ГруппыСчетовПоСубконто Цикл
		
		ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	&ВыборСубконто КАК Субконто,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _ОстаткиПредварительные
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет В (&МассивСчетов),
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет,
		|	&ИндексСубконто
		|	ДополнительнаяАналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиПредварительные.Счет КАК Счет,
		|	&ВыборИзОстаткиСубконто КАК Субконто,
		|	ОстаткиПредварительные.СуммаОстаток КАК СуммаОстаток,
		|	ОстаткиПредварительные.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ОстаткиПредварительные.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ _Остатки
		|ИЗ	
		|	_ОстаткиПредварительные КАК ОстаткиПредварительные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаПарныхСчетов КАК _ТаблицаПарныхСчетов
		|		ПО (ОстаткиПредварительные.Счет = _ТаблицаПарныхСчетов.СчетА
		|			ИЛИ ОстаткиПредварительные.Счет = _ТаблицаПарныхСчетов.СчетП)
		|		И (_ТаблицаПарныхСчетов.ДополнительнаяАналитика = ОстаткиПредварительные.ДополнительнаяАналитика)
		|		&ОтборСубконто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаПарныхСчетов.СчетА,
		|	_ТаблицаПарныхСчетов.СчетП,
		|	ЕСТЬNULL(_ТаблицаПарныхСчетов.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
		|	ЕСТЬNULL(_ТаблицаПарныхСчетов.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
		|	ЕСТЬNULL(_ТаблицаПарныхСчетов.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
		|	ЕСТЬNULL(_ТаблицаПарныхСчетов.ДополнительнаяАналитика, НЕОПРЕДЕЛЕНО) КАК ДополнительнаяАналитика,
		|	ЕСТЬNULL(_ОстаткиА.СуммаОстаток, 0) КАК СуммаОстатокА,
		|	ЕСТЬNULL(_ОстаткиА.ВалютнаяСуммаОстаток, 0) КАК ВалютнаяСуммаОстатокА,
		|	-ЕСТЬNULL(_ОстаткиП.СуммаОстаток, 0) КАК СуммаОстатокП,
		|	-ЕСТЬNULL(_ОстаткиП.ВалютнаяСуммаОстаток, 0) КАК ВалютнаяСуммаОстатокП
		|ИЗ
		|	_ТаблицаПарныхСчетов КАК _ТаблицаПарныхСчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Остатки КАК _ОстаткиА
		|		ПО _ТаблицаПарныхСчетов.СчетА = _ОстаткиА.Счет
		|			И (&УсловиеСубконтоА)
		|			И _ТаблицаПарныхСчетов.ДополнительнаяАналитика = _ОстаткиА.ДополнительнаяАналитика
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Остатки КАК _ОстаткиП
		|		ПО _ТаблицаПарныхСчетов.СчетП = _ОстаткиП.Счет
		|			И (&УсловиеСубконтоП)
		|			И _ТаблицаПарныхСчетов.ДополнительнаяАналитика = _ОстаткиП.ДополнительнаяАналитика";
	
		Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
		
		Запрос.УстановитьПараметр("МассивСчетов", ГруппаСчетов.Ключ);
		Запрос.УстановитьПараметр("МассивСубконто", ГруппаСчетов.Значение.МассивСубконто);
		НомерСубконто = 1;
		УсловиеСубконто = "";
		ВыборСубконто = "";
		ВыборИзОстаткиСубконто = "";
		ОтборСубконто = "";
		ИндексСубконто = "";
		//ВложенныйЗапросСубконто = "";
		ГруппировкаСубконто = "ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика, ";
		
		Для каждого Субконто Из ГруппаСчетов.Значение.МассивСубконто Цикл
			
			ИндексСубконто = ИндексСубконто + "Субконто" + НомерСубконто + ",";
			
			ВыборСубконто = ВыборСубконто + "ЕдиныйБухгалтерскийУчетОстатки.Субконто" + НомерСубконто + " КАК Субконто" + НомерСубконто + ", 
			|	";

			ВыборИзОстаткиСубконто = ВыборИзОстаткиСубконто + "ОстаткиПредварительные.Субконто" + НомерСубконто + " КАК Субконто" + НомерСубконто + ", 
			|	";
			
			ГруппировкаСубконто = ГруппировкаСубконто + "ЕдиныйБухгалтерскийУчетОстатки.Субконто" + НомерСубконто + ", ";
			
			ОтборСубконто = ОтборСубконто + "И ОстаткиПредварительные.Субконто" + НомерСубконто + " = _ТаблицаПарныхСчетов.Субконто" + НомерСубконто + "  ";
			
			УсловиеСубконто = УсловиеСубконто + ?(НомерСубконто > 1, " И ", "");
			УсловиеСубконто = УсловиеСубконто + "_ТаблицаПарныхСчетов.Субконто" + НомерСубконто + " = _ОстаткиА.Субконто" + НомерСубконто;
			НомерСубконто = НомерСубконто + 1;
			
		КонецЦикла;
		
		ВыборСубконто = ВыборСубконто + "ИСТИНА";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыборСубконто", ВыборСубконто);
		
		ВыборИзОстаткиСубконто = ВыборИзОстаткиСубконто + "ИСТИНА";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыборИзОстаткиСубконто", ВыборИзОстаткиСубконто);
		
		ОтборСубконто = ?(ЗначениеЗаполнено(ОтборСубконто), ОтборСубконто, "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборСубконто", ОтборСубконто);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,", ГруппировкаСубконто);
		
		УсловиеСубконто = ?(ЗначениеЗаполнено(УсловиеСубконто), УсловиеСубконто, "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСубконтоА", УсловиеСубконто);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСубконтоП", СтрЗаменить(УсловиеСубконто, "_ОстаткиА", "_ОстаткиП"));
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИндексСубконто", ИндексСубконто);
		
		Запрос.Текст = ТекстЗапроса;
		ГруппаСчетов.Значение.ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = "УНИЧТОЖИТЬ _Остатки; УНИЧТОЖИТЬ _ОстаткиПредварительные";
		Запрос.Выполнить();
		
	КонецЦикла;
		
	Движения = ОбъектДокумента.Движения;
	НаборЗаписей = Движения.ЕдиныйБухгалтерскийУчет;
	ВсегоЗаписей = НаборЗаписей.Количество();
	ТекИндекс = 0;
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		Если ТекИндекс >= ВсегоЗаписей Тогда
			Прервать;
		КонецЕсли;
		ТекИндекс = ТекИндекс + 1;
		
		ПостфиксДт = ?(Запись.СчетДт.Вид = ВидСчета.Активный, "А", "П");
		ПостфиксКт = ?(Запись.СчетДт.Вид = ВидСчета.Активный, "П", "А");
		
		СтрокаТаблицыПарныхСчетов = ПарныеСчета.Найти(Запись.СчетДт, "Счет" + ПостфиксДт);
		Если НЕ СтрокаТаблицыПарныхСчетов = Неопределено Тогда
			
			Если НеСворачиватьПоПарнымСчетамПереоценкуЦенныхБумаг И МассивСчетовПереоценки.Найти(Запись.СчетДт) <> Неопределено Тогда
				ДелатьПроводкуНаРазницу = Истина;
			Иначе
				ДелатьПроводкуНаРазницу = НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки;
			КонецЕсли;
			
			ЗнакОперации = ?(Запись.СчетДт.Вид = ВидСчета.Активный, 1, -1);
			ПараметрыСчетов = Новый Структура("ПостфиксСчета, ПостфиксПарного, ПостфиксОстатка, ПостфиксПарногоОстатка, ДелатьПроводкуНаРазницу", "Дт", "Кт", ПостфиксДт, ПостфиксКт, ДелатьПроводкуНаРазницу);
			ОбработатьЗаписьПарныхСчетов(ГруппыСчетовПоСубконто, ОбъектДокумента, НаборЗаписей, Запись, Запись.СчетДт, Запись.ДополнительнаяАналитикаДт, ПараметрыСчетов, ЗнакОперации, Отказ);
		КонецЕсли; 
		
		ПостфиксДт = ?(Запись.СчетКт.Вид = ВидСчета.Активный, "П", "А");
		ПостфиксКт = ?(Запись.СчетКт.Вид = ВидСчета.Активный, "А", "П");
		
		СтрокаТаблицыПарныхСчетов = ПарныеСчета.Найти(Запись.СчетКт, "Счет" + ПостфиксКт);
		Если НЕ СтрокаТаблицыПарныхСчетов = Неопределено Тогда
			
			Если НеСворачиватьПоПарнымСчетамПереоценкуЦенныхБумаг И МассивСчетовПереоценки.Найти(Запись.СчетКт) <> Неопределено Тогда
				ДелатьПроводкуНаРазницу = Истина;
			Иначе
				ДелатьПроводкуНаРазницу = НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки;
			КонецЕсли;
			
			ЗнакОперации = ?(Запись.СчетКт.Вид = ВидСчета.Пассивный, 1, -1);
			ПараметрыСчетов = Новый Структура("ПостфиксСчета, ПостфиксПарного, ПостфиксОстатка, ПостфиксПарногоОстатка, ДелатьПроводкуНаРазницу", "Кт", "Дт", ПостфиксКт, ПостфиксДт, ДелатьПроводкуНаРазницу);
			ОбработатьЗаписьПарныхСчетов(ГруппыСчетовПоСубконто, ОбъектДокумента, НаборЗаписей, Запись, Запись.СчетКт, Запись.ДополнительнаяАналитикаКт, ПараметрыСчетов, ЗнакОперации, Отказ);
		КонецЕсли; 
		
	КонецЦикла; 
		
КонецПроцедуры

Процедура ОбработатьЗаписьПарныхСчетов(ГруппыСчетовПоСубконто, ОбъектДокумента, НаборЗаписей, Запись, СчетУчета, ДополнительнаяАналитика, ПараметрыСчетов, ЗнакОперации, Отказ)

	ПостфиксСчета = ПараметрыСчетов.ПостфиксСчета;
	ПостфиксПарного = ПараметрыСчетов.ПостфиксПарного;
	ПостфиксОстатка = ПараметрыСчетов.ПостфиксОстатка;
	ПостфиксПарногоОстатка = ПараметрыСчетов.ПостфиксПарногоОстатка;
	ДелатьПроводкуНаРазницу = ПараметрыСчетов.ДелатьПроводкуНаРазницу;
	
	Для каждого ГруппаСчетов Из ГруппыСчетовПоСубконто Цикл
		Если НЕ ГруппаСчетов.Ключ.Найти(СчетУчета) = Неопределено Тогда
			ТаблицаОстатков = ГруппаСчетов.Значение.ТаблицаОстатков;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("Счет" + ПостфиксОстатка + ", ДополнительнаяАналитика", 
			СчетУчета, ДополнительнаяАналитика);
			
	НомерСубконто = 1;
	Для каждого Субконто Из ГруппаСчетов.Значение.МассивСубконто Цикл
	
		СтруктураПоиска.Вставить("Субконто" + НомерСубконто, Запись["Субконто" + ПостфиксСчета][Субконто]);
		НомерСубконто = НомерСубконто + 1;
	
	КонецЦикла;
	
	НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокаПарныхСчетов = НайденныеСтроки[0];
	
	Если СтрокаПарныхСчетов.СуммаОстатокА <> 0 И СтрокаПарныхСчетов.СуммаОстатокП <> 0 Тогда
		
		ТекстСубконто = "";
		Для каждого Субконто Из ГруппаСчетов.Значение.МассивСубконто Цикл
			ТекстСубконто = ТекстСубконто + ?(ТекстСубконто="","",", ") + Запись["Субконто" + ПостфиксСчета][Субконто];
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены остатки одновременно на двух парных счетах: " + СтрокаПарныхСчетов.СчетА + " и " + СтрокаПарныхСчетов.СчетП + " (" + ТекстСубконто + ")", ОбъектДокумента.Ссылка, , , Отказ);
	
	КонецЕсли; 
	
	СуммаПроводки = 0;
	
	ОстатокПарногоСчета = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксПарногоОстатка];
	ОстатокВалютныйПарногоСчета = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксПарногоОстатка];
	ОстатокТекущегоСчета = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксОстатка];
	ОстатокВалютныйТекущегоСчета = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксОстатка];
	
	Если ОстатокПарногоСчета > 0 Или (ОстатокПарногоСчета + ОстатокТекущегоСчета = 0 и ЗнакОперации = -1) Тогда
		
		// получаем сумму для дополнительной проводки
		СуммаПроводки = ?(ЗнакОперации = -1, 0, Запись.Сумма - Мин(ОстатокПарногоСчета, Запись.Сумма));
		
		ВалютнаяСуммаПроводки = 0;
		Если ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
			Если ЗнакОперации = -1 Тогда
				ВалютнаяСуммаПроводки = 0;
			Иначе
				ВалютнаяСуммаПроводки = Запись["ВалютнаяСумма" + ПостфиксСчета];
				Если Запись["ВалютнаяСумма" + ПостфиксСчета] < 0 Тогда
					ВалютнаяСуммаПроводки = ВалютнаяСуммаПроводки - ОстатокВалютныйПарногоСчета;
				Иначе
					ВалютнаяСуммаПроводки = ВалютнаяСуммаПроводки - Мин(ОстатокВалютныйПарногоСчета, Запись["ВалютнаяСумма" + ПостфиксСчета]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ДелатьПроводкуНаРазницу Тогда
			
			Если СуммаПроводки > 0 Тогда
			
				// добавляем проводку на разницу
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПроводки, "Закрытие парных счетов");
				
				ЗаполнитьЗначенияСвойств(Проводка, Запись, , "Содержание, Сумма");
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксСчета].ВидыСубконто Цикл
					Проводка.СубконтоДт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
					Проводка.СубконтоКт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				
				Проводка.Организация = Запись.Организация;
				Проводка.СчетДоверительногоУправления = Запись.СчетДоверительногоУправления;
				
				Проводка["Счет" + ПостфиксПарного] = СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка];
				Проводка["Валюта" + ПостфиксПарного] = Запись["Валюта" + ПостфиксСчета];
				
				Проводка["ДополнительнаяАналитика" + ПостфиксПарного] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
				
				Если Запись["Счет" + ПостфиксСчета].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка["ВалютнаяСумма" + ПостфиксСчета] = ВалютнаяСуммаПроводки;
				Иначе
					Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				КонецЕсли;
				Если СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка["ВалютнаяСумма" + ПостфиксПарного] = ВалютнаяСуммаПроводки;
				Иначе
					Проводка["ВалютнаяСумма" + ПостфиксПарного] = 0;
				КонецЕсли;
			
			КонецЕсли;
			
			// меняем счет в исходной проводке
			Запись["Счет" + ПостфиксСчета] = СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка];
			Запись["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
			
			СуммаИзмененияПарногоОстатка = Запись.Сумма - СуммаПроводки;
			ВалютнаяСуммаИзмененияПарногоОстатка = Запись["ВалютнаяСумма" + ПостфиксСчета] - ВалютнаяСуммаПроводки;
			
		Иначе
			
			Если СуммаПроводки > 0 Тогда
			
				// добавляем проводку на разницу
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПроводки, "Закрытие парных счетов");
				
				ЗаполнитьЗначенияСвойств(Проводка, Запись, , "Содержание, Сумма");
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксСчета].ВидыСубконто Цикл
					Проводка["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксПарного].ВидыСубконто Цикл
					Проводка["Субконто" + ПостфиксПарного][ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксПарного][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				
				Проводка.Организация = Запись.Организация;
				Проводка.СчетДоверительногоУправления = Запись.СчетДоверительногоУправления;
				
				Если Запись["Счет" + ПостфиксСчета].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка["ВалютнаяСумма" + ПостфиксСчета] = ВалютнаяСуммаПроводки;
				Иначе
					Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				КонецЕсли;
				Если Проводка["Счет" + ПостфиксПарного].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка["ВалютнаяСумма" + ПостфиксПарного] = ВалютнаяСуммаПроводки;
				Иначе
					Проводка["ВалютнаяСумма" + ПостфиксПарного] = 0;
				КонецЕсли;
				
			КонецЕсли;
			
			// меняем счет в исходной проводке
			Запись["Счет" + ПостфиксСчета] = СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка];
			Запись["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
			
			Запись.Сумма = Запись.Сумма - СуммаПроводки;
			
			Если Запись["Счет" + ПостфиксСчета].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
				Запись["ВалютнаяСумма" + ПостфиксСчета] = Запись["ВалютнаяСумма" + ПостфиксСчета] - ВалютнаяСуммаПроводки;
			КонецЕсли;
			
			Если Запись["Счет" + ПостфиксПарного].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксПарного]) Тогда
				Запись["ВалютнаяСумма" + ПостфиксПарного] = Запись["ВалютнаяСумма" + ПостфиксПарного] - ВалютнаяСуммаПроводки;
			КонецЕсли;
			
			СуммаИзмененияПарногоОстатка = Запись.Сумма;
			ВалютнаяСуммаИзмененияПарногоОстатка = Запись["ВалютнаяСумма" + ПостфиксСчета];
			
		КонецЕсли;
		
		СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксОстатка] = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксОстатка] + ЗнакОперации * СуммаПроводки;
		СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксОстатка] = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксОстатка] + ЗнакОперации * ВалютнаяСуммаПроводки;
		СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксПарногоОстатка] - ЗнакОперации * СуммаИзмененияПарногоОстатка;
		СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксПарногоОстатка] - ЗнакОперации * ВалютнаяСуммаИзмененияПарногоОстатка;
		
	Иначе
		
		СуммаПроводки = ?(ЗнакОперации = 1, 0, Запись.Сумма - Мин(ОстатокТекущегоСчета, Запись.Сумма));

		ВалютнаяСуммаПроводки = 0;
		Если ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
			Если ЗнакОперации = 1 Тогда
				ВалютнаяСуммаПроводки = 0;
			Иначе
				ВалютнаяСуммаПроводки = Запись["ВалютнаяСумма" + ПостфиксСчета];
				Если Запись["ВалютнаяСумма" + ПостфиксСчета] < 0 Тогда
					ВалютнаяСуммаПроводки = ВалютнаяСуммаПроводки - ОстатокВалютныйТекущегоСчета;
				Иначе
					ВалютнаяСуммаПроводки = ВалютнаяСуммаПроводки - Мин(ОстатокВалютныйТекущегоСчета, Запись["ВалютнаяСумма" + ПостфиксСчета]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ДелатьПроводкуНаРазницу Тогда
			
			Если СуммаПроводки > 0 Тогда
			
				// добавляем проводку на разницу
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПроводки, "Закрытие парных счетов");
				
				ЗаполнитьЗначенияСвойств(Проводка, Запись, , "Содержание, Сумма");
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксСчета].ВидыСубконто Цикл
					Проводка.СубконтоДт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
					Проводка.СубконтоКт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				
				Проводка.Организация = Запись.Организация;
				Проводка.СчетДоверительногоУправления = Запись.СчетДоверительногоУправления;
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка];
				Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
				
				Проводка["Счет" + ПостфиксПарного] = СтрокаПарныхСчетов["Счет" + ПостфиксОстатка];
				Проводка["Валюта" + ПостфиксПарного] = Запись["Валюта" + ПостфиксСчета];
				
				Проводка["ДополнительнаяАналитика" + ПостфиксПарного] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
				
				Если Проводка["Счет" + ПостфиксПарного].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка.ВалютнаяСуммаДт = ВалютнаяСуммаПроводки;
					Проводка.ВалютнаяСуммаКт = ВалютнаяСуммаПроводки;
				Иначе
					Проводка.ВалютнаяСуммаДт = 0;
					Проводка.ВалютнаяСуммаКт = 0;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе			
			
			Если СуммаПроводки > 0 Тогда
			
				// добавляем проводку на разницу
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПроводки, "Закрытие парных счетов");
				
				ЗаполнитьЗначенияСвойств(Проводка, Запись, , "Содержание, Сумма");
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксСчета].ВидыСубконто Цикл
					Проводка.СубконтоДт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
					Проводка.СубконтоКт[ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				
				Проводка.Организация = Запись.Организация;
				Проводка.СчетДоверительногоУправления = Запись.СчетДоверительногоУправления;
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка];
				Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
				
				Проводка["Счет" + ПостфиксПарного] = СтрокаПарныхСчетов["Счет" + ПостфиксОстатка];
				Проводка["Валюта" + ПостфиксПарного] = Запись["Валюта" + ПостфиксСчета];
				
				Проводка["ДополнительнаяАналитика" + ПостфиксПарного] = СтрокаПарныхСчетов.ДополнительнаяАналитика;
				
				Если Запись["Счет" + ПостфиксСчета].Валютный И ЗначениеЗаполнено(Запись["ВалютнаяСумма" + ПостфиксСчета]) Тогда
					Проводка.ВалютнаяСуммаДт = ВалютнаяСуммаПроводки;
					Проводка.ВалютнаяСуммаКт = ВалютнаяСуммаПроводки;
				Иначе
					Проводка.ВалютнаяСуммаДт = 0;
					Проводка.ВалютнаяСуммаКт = 0;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксОстатка] = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксОстатка] + ЗнакОперации * (Запись.Сумма - СуммаПроводки);
		Если СтрокаПарныхСчетов["Счет" + ПостфиксОстатка].Валютный Тогда
			СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксОстатка] = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксОстатка] + ЗнакОперации * (Запись["ВалютнаяСумма" + ПостфиксСчета] - ВалютнаяСуммаПроводки);
		КонецЕсли;
		СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаПарныхСчетов["СуммаОстаток" + ПостфиксПарногоОстатка] - ЗнакОперации * СуммаПроводки;
		Если СтрокаПарныхСчетов["Счет" + ПостфиксПарногоОстатка].Валютный Тогда
			СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаПарныхСчетов["ВалютнаяСуммаОстаток" + ПостфиксПарногоОстатка] - ЗнакОперации * ВалютнаяСуммаПроводки;
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

Функция ОбработатьЗаписьПоСчетамПереоценки(ПараметрыОбработки)

	РезультатРаботы = Новый Структура("НичегоНеДелали, ИзменилиСчет, ДобавилиПроводку, ДобавилиПроводкуЗакрытия", Ложь, Ложь, Ложь, Ложь);	
	
	ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме = (ПараметрыОбработки.ОбъектДокумента.Дата < '20221001');
	
	ОбъектДокумента 	= ПараметрыОбработки.ОбъектДокумента;
	НаборЗаписей 		= ПараметрыОбработки.НаборЗаписей;
	ВидСубконтоГФУДоходовРасходов 	= ПараметрыОбработки.ВидСубконтоГФУДоходовРасходов;
	ВидСубконтоЦенныеБумаги			= ПараметрыОбработки.ВидСубконтоЦенныеБумаги;
	СтрокаОстатков 		= ПараметрыОбработки.СтрокаОстатков;
	Запись 				= ПараметрыОбработки.Запись;
	УвеличениеОстатка 	= ПараметрыОбработки.УвеличениеОстатка;
	ПостфиксСчета 		= ПараметрыОбработки.ПостфиксСчета;
	ПостфиксОстатка 	= ПараметрыОбработки.ПостфиксОстатка;
	ПостфиксПарногоСчета 	= ПараметрыОбработки.ПостфиксПарногоСчета;
	ПостфиксПарногоОстатка 	= ПараметрыОбработки.ПостфиксПарногоОстатка;
	
	ЭтоЗакрытие7огоРаздела = (Запись["Счет" + ПостфиксПарногоСчета] = ПланыСчетов.Единый.АктивыВДУ03);
	
	Если ЭтоЗакрытие7огоРаздела И НЕ ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме Тогда // тут специфика состоит в том, что нельзя менять свет в проводке, только переброски 
		
		ЭтоНачисление = (ПостфиксСчета = "Дт");
		ЭтоСписание = (ПостфиксСчета = "Кт");
		
		Если (ПостфиксОстатка = "А" И ЭтоНачисление) ИЛИ (ПостфиксОстатка = "П" И ЭтоСписание) Тогда // совпадает остаток и движение
																										  
			Если СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] > 0 Тогда 
				// остаток есть - ничего делать не нужно, будем только увеличивать его
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] + Запись.Сумма;
				
			    // проводки не добавляем
				РезультатРаботы.НичегоНеДелали = Истина;
			Иначе
				// остаток не на нужном счете
				СуммаПереброски = Мин(Запись.Сумма, СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка]);
				СуммаУвеличения = Запись.Сумма - СуммаПереброски;
				// строка остаток - уменьшаем остаток на парном счете на СуммаПереброски и увеличиваем остаток на нашем счете на СуммаУвеличения
				СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] - СуммаПереброски;
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] + СуммаУвеличения;	
				
				// проводка - делаем переброску на СуммаПереброски
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПереброски, "Перенос начисленной переоценки после закрытия 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксПарногоСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = 0;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			
		Иначе // смотрим остаток по Дт, а движение по Кт или наоборот
			
			Если СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] > Запись.Сумма Тогда 
				//	Сумма остатка своего больше или равна сумме проводки и если мы его уменьшим ничего не случится
				//		проводка - ничего не делаем
				//		строка остатков - уменьшаем остаток на совем счете	
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] - Запись.Сумма;
				
			    // проводки не добавляем
				РезультатРаботы.НичегоНеДелали = Истина;
				
			Иначе
				// остаток не на нужном счете
				СуммаПереброски = Запись.Сумма - СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка];
				// строка остаток - уменьшаем остаток на парном счете на СуммаПереброски и увеличиваем остаток на нашем счете на СуммаУвеличения
				СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] + СуммаПереброски;
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = 0;	
				
				// проводка - делаем переброску на СуммаПереброски
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаПереброски, "Перенос начисленной переоценки после закрытия 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксПарногоСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = 0;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли УвеличениеОстатка Тогда
		// Счет на своем месте
		Если (СтрокаОстатков.СуммаОстатокА = 0 И СтрокаОстатков.СуммаОстатокП = 0)
			Или СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] > 0 Тогда
	        //	Остатков нет или есть остаток своего счета
			// 		проводка - ничего не делаем
			//		строка остатков - увеличиваем остаток на совем счете
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] + Запись.Сумма;
			
			РезультатРаботы.НичегоНеДелали = Истина;
			
		ИначеЕсли СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] >= Запись.Сумма Тогда
			//	Сумма остатка парного больше или равна сумме проводки
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем счет
				Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ИзменилиСчет = Истина;
				
			Иначе
				//		проводка - не меняем счет
				//		добавляем проводку перекидки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, Запись.Сумма, "Перенос начисленной переоценки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,ВалютнаяСуммаДт,ВалютнаяСуммаКт,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;				
				//Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаОстатков["ДополнительнаяАналитика" + ПостфиксОстатка];
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			//		строка остатков - уменьшаем остаток парного на сумму проводки
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] - Запись.Сумма;
		Иначе
			//	Сумма остатка парного меньше суммы проводки
			//		СуммаВторойПроводки = исходная сумма проводки - остаток парного
			Коэффициент = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] / Запись.Сумма;
			СуммаВторойПроводки = Запись.Сумма - СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка];
			СуммаВторойПроводкиВал = 0;
			Если Запись["Счет"+ПостфиксПарногоСчета].Валютный Тогда
				СуммаВторойПроводкиВал = Окр(Запись["ВалютнаяСумма"+ПостфиксПарногоСчета] * (1 - Коэффициент), 2);
			КонецЕсли;
			
			//		проводка - меняем сумму на сумму остатка парного
			Запись.Сумма = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка];
			Если Запись["Счет"+ПостфиксПарногоСчета].Валютный Тогда
				Запись["ВалютнаяСумма"+ПостфиксПарногоСчета] = Запись["ВалютнаяСумма"+ПостфиксПарногоСчета] - СуммаВторойПроводкиВал;
			КонецЕсли;
			
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем счет, меняем сумму на сумму остатка парного
				Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ИзменилиСчет = Истина;
				
			Иначе
				//		проводка - не меняем счет
				//		добавляем проводку перекидки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, Запись.Сумма, "Перенос начисленной переоценки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				//Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаОстатков["ДополнительнаяАналитика" + ПостфиксОстатка];
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = 0;
			                                                                      
			//		доп. проводка - копия первой с исходным счетом, сумма = СуммаВторойПроводки
			//		строка остатков - остаток текущего = СуммаВторойПроводки
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, Запись.Содержание);
			ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,ВалютнаяСуммаДт,ВалютнаяСуммаКт");
			
			Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
			Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
			Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
			
			Если Проводка["Счет"+ПостфиксПарногоСчета].Валютный Тогда
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = СуммаВторойПроводкиВал;
			КонецЕсли; 
			
			Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксПарногоСчета].ВидыСубконто Цикл
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксПарногоСчета][ВидСубконтоСтрока.ВидСубконто];
			КонецЦикла;
			
			//		строка остатков - остаток парного = 0
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СуммаВторойПроводки;
			
			РезультатРаботы.ДобавилиПроводкуЗакрытия = Истина;
			
		КонецЕсли
	Иначе
		// Счет не на своем месте
		Если (СтрокаОстатков.СуммаОстатокА = 0 И СтрокаОстатков.СуммаОстатокП = 0) ИЛИ СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] > 0 Тогда
			//	Остатков нет или есть остаток парного
			//		проводка - меняем счет
			//	    строка остатков - увеличиваем остаток парного
			Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
			Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] + Запись.Сумма;
			
			РезультатРаботы.ИзменилиСчет = Истина;
			
		ИначеЕсли СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] >= Запись.Сумма Тогда	
			//	Сумма остатка своего больше или равна сумме прводки
			//		проводка - ничего не делаем
			//		строка остатков - уменьшаем остаток на совем счете	
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] - Запись.Сумма;
			
			РезультатРаботы.НичегоНеДелали = Истина;
			
		Иначе
			//	Сумма остатка своего меньше суммы прводки
			//		СуммаВторойПроводки = исходная сумма проводки - остаток своего
			Коэффициент = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] / Запись.Сумма;
			СуммаВторойПроводки = Запись.Сумма - СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка];
			
			СуммаВторойПроводкиВал = 0;
			Если Запись["Счет"+ПостфиксСчета].Валютный Тогда
				СуммаВторойПроводкиВал = Окр(Запись["ВалютнаяСумма"+ПостфиксСчета] * (1 - Коэффициент), 2);
			КонецЕсли;
			
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем сумму на сумму остатка своего
				//		строка остатков - остаток тек счета = 0
				Запись.Сумма = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка];
				
				Если Запись["Счет" + ПостфиксСчета].Валютный Тогда
					Запись["ВалютнаяСумма" + ПостфиксСчета] = Запись.Сумма;
				КонецЕсли; 
				
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = 0;
				
				//		доп. проводка - копия первой с заменой счета, сумма = СуммаВторойПроводки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, Запись.Содержание);
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,ВалютнаяСуммаДт,ВалютнаяСуммаКт");
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				
				Если Проводка["Счет" + ПостфиксПарногоСчета].Валютный Тогда
					Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = СуммаВторойПроводкиВал;
				КонецЕсли; 
				
				Для каждого ВидСубконтоСтрока Из Запись["Счет" + ПостфиксПарногоСчета].ВидыСубконто Цикл
					Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоСтрока.ВидСубконто] = Запись["Субконто" + ПостфиксПарногоСчета][ВидСубконтоСтрока.ВидСубконто];
				КонецЦикла;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			Иначе
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = 0;
				//		доп. проводка - прекидка на парный счет, сумма = СуммаВторойПроводки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, "Перенос начисленной переоценки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксПарногоСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = 0;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				//Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаОстатков["ДополнительнаяАналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ДобавилиПроводку = Истина;

			КонецЕсли;
			//		строка остатков - остаток парного = СуммаВторойПроводки
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СуммаВторойПроводки;	
		КонецЕсли;
	КонецЕсли;

	Возврат РезультатРаботы;
	
КонецФункции

Функция ОбработатьЗаписьПоСчетамКорректировок(ПараметрыОбработки)
	
	РезультатРаботы = Новый Структура("НичегоНеДелали, ИзменилиСчет, ДобавилиПроводку, ДобавилиПроводкуЗакрытия", Ложь, Ложь, Ложь, Ложь);
	
	ОбъектДокумента 	= ПараметрыОбработки.ОбъектДокумента;
	НаборЗаписей 		= ПараметрыОбработки.НаборЗаписей;
	ВидСубконтоГФУДоходовРасходов 	= ПараметрыОбработки.ВидСубконтоГФУДоходовРасходов;
	ВидСубконтоЦенныеБумаги			= ПараметрыОбработки.ВидСубконтоЦенныеБумаги;
	СтрокаОстатков 		= ПараметрыОбработки.СтрокаОстатков;
	Запись 				= ПараметрыОбработки.Запись;
	УвеличениеОстатка 	= ПараметрыОбработки.УвеличениеОстатка;
	ПостфиксСчета 		= ПараметрыОбработки.ПостфиксСчета;
	ПостфиксОстатка 	= ПараметрыОбработки.ПостфиксОстатка;
	ПостфиксПарногоСчета 	= ПараметрыОбработки.ПостфиксПарногоСчета;
	ПостфиксПарногоОстатка 	= ПараметрыОбработки.ПостфиксПарногоОстатка;
	
	ЭтоЗакрытие7огоРаздела = (Запись["Счет" + ПостфиксПарногоСчета] = ПланыСчетов.Единый.АктивыВДУ03);
	
	Если УвеличениеОстатка Тогда
		// Счет на своем месте
		Если (СтрокаОстатков.СуммаОстатокА = 0 И СтрокаОстатков.СуммаОстатокП = 0)
			Или СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] > 0 Тогда
	        //	Остатков нет или есть остаток своего счета
			// 		проводка - ничего не делаем
			//		строка остатков - увеличиваем остаток на совем счете
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] + Запись.Сумма;
			
			РезультатРаботы.НичегоНеДелали = Истина;
			
		ИначеЕсли СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] >= Запись.Сумма Тогда
			//	Сумма остатка парного больше или равна сумме проводки
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем счет
				Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ИзменилиСчет = Истина;
				
			Иначе
				//		проводка - не меняем счет
				//		добавляем проводку перекидки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, Запись.Сумма, "Перенос начисленной переоценки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;				
				//Проводка["ДополнительнаяАналитика" + ПостфиксСчета] = СтрокаОстатков["ДополнительнаяАналитика" + ПостфиксОстатка];
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			//		строка остатков - уменьшаем остаток парного на сумму проводки
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] - Запись.Сумма;
		Иначе
			//	Сумма остатка парного меньше суммы проводки
			//		СуммаВторойПроводки = исходная сумма проводки - остаток парного
			СуммаВторойПроводки = Запись.Сумма - СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка];
			
			//		проводка - меняем счет, меняем сумму на сумму остатка парного
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем счет, меняем сумму на сумму остатка парного
				Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ИзменилиСчет = Истина;
				
			Иначе
				//		проводка - не меняем счет
				//		добавляем проводку перекидки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, Запись.Сумма, "Перенос начисленной корректировки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			
			//		строка остатков - остаток парного = 0
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = 0;
			
			//		доп. проводка - обратная проводка между парными счетами, сумма = СуммаВторойПроводки
			//		строка остатков - остаток текущего = СуммаВторойПроводки
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, "Закрытие парных счетов");
			ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма, Содержание, ВалютаДт, ВалютаКт, ВалютнаяСуммаДт, ВалютнаяСуммаКт");
			Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
			Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
			Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
			
			Проводка["Счет" + ПостфиксПарногоСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
			Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
			Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
			Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютнаяСуммаДт = СуммаВторойПроводки;
			КонецЕсли; 
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютнаяСуммаКт = СуммаВторойПроводки;
			КонецЕсли;
			
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СуммаВторойПроводки;
			
			РезультатРаботы.ДобавилиПроводкуЗакрытия = Истина;
			
		КонецЕсли
	Иначе
		// Счет не на своем месте
		Если (СтрокаОстатков.СуммаОстатокА = 0 И СтрокаОстатков.СуммаОстатокП = 0)
			Или СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] > 0 Тогда
			//	Остатков нет или есть остаток парного
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - меняем счет
				Запись["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				
				РезультатРаботы.ИзменилиСчет = Истина;
				
			Иначе
				//		проводка - не меняем счет
				//		добавляем проводку перекидки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, Запись.Сумма, "Перенос начисленной корректировки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксПарногоСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = 0;
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;				
				Проводка["Валюта" + ПостфиксСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			//	    строка остатков - увеличиваем остаток парного
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] + Запись.Сумма;
		ИначеЕсли СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] >= Запись.Сумма Тогда	
			//	Сумма остатка своего больше или равна сумме прводки
			//		проводка - ничего не делаем
			//		строка остатков - уменьшаем остаток на совем счете	
			СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] - Запись.Сумма;
			
			РезультатРаботы.НичегоНеДелали = Истина;
			
		Иначе
			//	Сумма остатка своего меньше суммы прводки
			//		СуммаВторойПроводки = исходная сумма проводки - остаток своего
			СуммаВторойПроводки = Запись.Сумма - СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка];
			
			Если НЕ ЭтоЗакрытие7огоРаздела Тогда
				//		проводка - ничего не делаем
				//		строка остатков - остаток тек счета = 0
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = 0;
			
				//		доп. проводка - обратная проводка между парными счетами, сумма = СуммаВторойПроводки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, "Закрытие парных счетов");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма, Содержание, ВалютаДт, ВалютаКт, ВалютнаяСуммаДт, ВалютнаяСуммаКт");
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				
				Проводка["Счет" + ПостфиксПарногоСчета] = СтрокаОстатков["Счет" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксОстатка];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["ДополнительнаяАналитика" + ПостфиксПарногоСчета] = Запись["ДополнительнаяАналитика" + ПостфиксСчета];
				
				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = СуммаВторойПроводки;
				КонецЕсли; 
				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = СуммаВторойПроводки;
				КонецЕсли;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			Иначе
				СтрокаОстатков["СуммаОстаток" + ПостфиксОстатка] = 0;
				//		доп. проводка - прекидка на парный счет, сумма = СуммаВторойПроводки
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, НаборЗаписей, СуммаВторойПроводки, "Перенос начисленной корректировки перед закрытием 7 раздела");
				ЗаполнитьЗначенияСвойств(Проводка, Запись,, "Сумма,Содержание");
				
				Проводка["Счет" + ПостфиксПарногоСчета] = Запись["Счет" + ПостфиксСчета];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоГФУДоходовРасходов] = Запись["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов];
				Проводка["Субконто" + ПостфиксПарногоСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксПарногоСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксПарногоСчета] = 0;
				
				Проводка["Счет" + ПостфиксСчета] = СтрокаОстатков["Счет" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоГФУДоходовРасходов] = СтрокаОстатков["Аналитика" + ПостфиксПарногоОстатка];
				Проводка["Субконто" + ПостфиксСчета][ВидСубконтоЦенныеБумаги] = СтрокаОстатков.ЦеннаяБумага;
				Проводка["Валюта" + ПостфиксСчета] = Null;
				Проводка["ВалютнаяСумма" + ПостфиксСчета] = 0;
				
				РезультатРаботы.ДобавилиПроводку = Истина;
				
			КонецЕсли;
			
			//		строка остатков - остаток парного = СуммаВторойПроводки
			СтрокаОстатков["СуммаОстаток" + ПостфиксПарногоОстатка] = СуммаВторойПроводки;	
		КонецЕсли;
	КонецЕсли;

	Возврат РезультатРаботы;	
	
КонецФункции

Процедура ПровестиКорректировкуЭСП(ЭтотОбъект, КредитныйИнструмент, СтоимостьВклада, СтоимостьВкладаПоЭСП, ПереоценкаПослеВводаНачальныхОстатков = Ложь) Экспорт
	
	ТипИнструмента = ТипЗнч(КредитныйИнструмент);
	Если ТипИнструмента = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		БанковскийСчет = КредитныйИнструмент.БанковскийСчет;
		УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС;
	ИначеЕсли ТипИнструмента = Тип("ДокументСсылка.МНО") Тогда
		БанковскийСчет = КредитныйИнструмент.РасчетныйСчет;
		УчетныйАктив = Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настоящий момент не поддерживается начисление корректировок ЭСП по виду кредитного инструмента: " + Строка(ТипИнструмента));
		Возврат;
	КонецЕсли;
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
	
	ПроцентыЭСП = СтоимостьВкладаПоЭСП - СтоимостьВклада;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК ОстатокКорректировки,
	|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаКорректировкиА,
	|	0 КАК СуммаКорректировкиП
	|ПОМЕСТИТЬ ОстаткиКорректировки
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&Период,
	|			Счет = &СчетУчетаКорректировокА,
	|			&ВидыСубконто,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Субконто1 = &БанковскиеСчета
	|				И Субконто2 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-БухгалтерскийУчетОстатки.СуммаОстатокКт,
	|	0,
	|	БухгалтерскийУчетОстатки.СуммаОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|			&Период,
	|			Счет = &СчетУчетаКорректировокП,
	|			&ВидыСубконто,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Субконто1 = &БанковскиеСчета
	|				И Субконто2 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОстаткиКорректировки.ОстатокКорректировки) КАК ОстатокКорректировки,
	|	СУММА(ОстаткиКорректировки.СуммаКорректировкиА) КАК СуммаКорректировкиА,
	|	СУММА(ОстаткиКорректировки.СуммаКорректировкиП) КАК СуммаКорректировкиП,
	|	ЕСТЬNULL(УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив, &УчетныйАктив) КАК УчетныйАктив
	|ИЗ
	|	ОстаткиКорректировки КАК ОстаткиКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|			УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив КАК УчетныйАктив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
	|			ИЗ
	|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
	|						&ПериодУсловий,
	|						ДатаНачалаДействияУсловий <= &ПериодУсловий
	|							И КредитныйИнструмент = &КредитныйИнструмент) КАК УсловияКредитныхИнструментовСрезПоследних
	|			ГДЕ
	|				УсловияКредитныхИнструментовСрезПоследних.Действует
	|			
	|			СГРУППИРОВАТЬ ПО
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
	|						&ПериодУсловий,
	|						ДатаНачалаДействияУсловий <= &ПериодУсловий
	|							И КредитныйИнструмент = &КредитныйИнструмент) КАК УсловияКредитныхИнструментовСрезПоследних
	|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив, &УчетныйАктив)";
	
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период"						, Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВидыСубконто"				, ВидыСубконто);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокА"		, ПланыСчетов.Единый.Депозиты09);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокП"		, ПланыСчетов.Единый.Депозиты11);
	Запрос.УстановитьПараметр("БанковскиеСчета"				, БанковскийСчет);
	Запрос.УстановитьПараметр("КредитныйИнструмент"			, КредитныйИнструмент);
	Запрос.УстановитьПараметр("ПериодУсловий"				, ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("УчетныйАктив"				, УчетныйАктив);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ПроцентыЭСП >= 0 Тогда // положительная корректировка
			
			Если ВыборкаДетальныеЗаписи.ОстатокКорректировки >= 0 Тогда // уже была положительная или никакая
				
				СуммаКорректировкиА = ПроцентыЭСП - ВыборкаДетальныеЗаписи.СуммаКорректировкиА; // сделаем положительную
				СуммаКорректировкиП = 0;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокКорректировки < 0 Тогда // уже была отрицательная
				
				СуммаКорректировкиА = ПроцентыЭСП; // начислим положительную
				СуммаКорректировкиП = ВыборкаДетальныеЗаписи.СуммаКорректировкиП; // уберем всю отрицательную
				
			КонецЕсли;
				
		ИначеЕсли ПроцентыЭСП < 0 Тогда // отрицательная корректировка
			
			Если ВыборкаДетальныеЗаписи.ОстатокКорректировки <= 0 Тогда // уже была отрицательная или никакая
				
				СуммаКорректировкиА = 0;
				СуммаКорректировкиП = ПроцентыЭСП + ВыборкаДетальныеЗаписи.СуммаКорректировкиП; // сделаем отрицательную
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокКорректировки > 0 Тогда // уже была положительная
				
				СуммаКорректировкиА = -ВыборкаДетальныеЗаписи.СуммаКорректировкиА; // уберем всю положительную
				СуммаКорректировкиП = ПроцентыЭСП; // начислим отрицательную
				
			КонецЕсли;
				
		КонецЕсли;
		
		УчетныйАктивДепозита = ВыборкаДетальныеЗаписи.УчетныйАктив;
		
		СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктивДепозита.АналитикаДоходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
		СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктивДепозита.АналитикаРасходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
		
		Если СуммаКорректировкиА > 0 Тогда
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКорректировкиА, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ЭСП");
			
			Проводка.СчетДт = УчетныйАктивДепозита.СчетУчетаКорректировокА;
			Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаДт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = СуммаКорректировкиА;
			
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетКт = СчетУчетаДоходов;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивДепозита.АналитикаДоходовОтКорректировки;
				Проводка.СубконтоКт.ЦенныеБумаги = КредитныйИнструмент;
			КонецЕсли;
			
		ИначеЕсли СуммаКорректировкиА < 0 Тогда 
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(-СуммаКорректировкиА, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ЭСП");
			
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетДт = СчетУчетаРасходов;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивДепозита.АналитикаРасходовОтКорректировки;
				Проводка.СубконтоДт.ЦенныеБумаги = КредитныйИнструмент;
			КонецЕсли;
		
			Проводка.СчетКт = УчетныйАктивДепозита.СчетУчетаКорректировокА;
			Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаКт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаКт = - СуммаКорректировкиА;
			
		КонецЕсли;
		
		Если СуммаКорректировкиП > 0 Тогда 
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКорректировкиП, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ЭСП");
			
			Проводка.СчетДт = УчетныйАктивДепозита.СчетУчетаКорректировокП;
			Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаДт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = СуммаКорректировкиП;
			
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетКт = СчетУчетаДоходов;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивДепозита.АналитикаДоходовОтКорректировки;
				Проводка.СубконтоКт.ЦенныеБумаги = КредитныйИнструмент;
			КонецЕсли;
			
		ИначеЕсли СуммаКорректировкиП < 0 Тогда 
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(-СуммаКорректировкиП, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ЭСП");
			
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетДт = СчетУчетаРасходов;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивДепозита.АналитикаРасходовОтКорректировки;
				Проводка.СубконтоДт.ЦенныеБумаги = КредитныйИнструмент;
			КонецЕсли;
			
			Проводка.СчетКт = УчетныйАктивДепозита.СчетУчетаКорректировокП;
			Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
			Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
			Проводка.ВалютаКт  = БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаКт = -СуммаКорректировкиП;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПровестиКорректировкуПП(ЭтотОбъект, КредитныйИнструмент, СтоимостьВклада, СтоимостьВкладаПриПП) Экспорт
	
	ТипИнструмента = ТипЗнч(КредитныйИнструмент);
	Если ТипИнструмента = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		БанковскийСчет = КредитныйИнструмент.БанковскийСчет;
		УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(КредитныйИнструмент, ЭтотОбъект.Дата);
	ИначеЕсли ТипИнструмента = Тип("ДокументСсылка.МНО") Тогда
		БанковскийСчет = КредитныйИнструмент.РасчетныйСчет;
		УчетныйАктив = Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настоящий момент не поддерживается начисление корректировок ПП по виду кредитного инструмента: " + Строка(ТипИнструмента));
		Возврат;
	КонецЕсли;
	
	СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаДоходовПервоначальногоПризнания.НомерСчетаБухгалтерскогоУчета);
	СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаРасходовПервоначальногоПризнания.НомерСчетаБухгалтерскогоУчета);
	
	КорректировкаПП = СтоимостьВкладаПриПП - СтоимостьВклада;
	
	Если КорректировкаПП > 0 Тогда
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(КорректировкаПП, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ПП");
		
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокА;
		Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
		Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
		Проводка.ВалютаДт  = БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = КорректировкаПП;
		
		Проводка.СчетКт = СчетУчетаДоходов;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовПервоначальногоПризнания;
		Проводка.СубконтоКт.ЦенныеБумаги = КредитныйИнструмент;
		
	ИначеЕсли КорректировкаПП < 0 Тогда 
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(-КорректировкаПП, БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка ПП");
		
		Проводка.СчетДт = СчетУчетаРасходов;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовПервоначальногоПризнания;
		Проводка.СубконтоДт.ЦенныеБумаги = КредитныйИнструмент;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокП;
		Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
		Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
		Проводка.ВалютаКт  = БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = -КорректировкаПП;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтнесениеНачисленныхДоходовНаАктивыВДУ(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ВалютаДоходов, Содержание, НаДату = "", Аналитика = Неопределено, ДоходЗаТекущийГод = 0, ГруппаФинансовогоУчетаДоходовРасходов = Неопределено, КоэффициентЗакрытия = 0, УчитыватьПартииНаСчетахУчета = Ложь) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И ЭтотОбъект.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.ДополнительныеСвойства.Вставить("ЗаписьВСоставеФБУ", Истина);
	КонецЕсли;
	
	ЭтотОбъект.Движения.Записать();
	
 	ВидыСубконто = Новый Массив;
 	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов);
 	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	
 	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ЭтотОбъект.Дата;
 	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток КАК ДоходЗаТекущийГод,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ГруппаФинансовогоУчетаДоходовРасходов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоГода,
		|			&Период,
		|			Период,
		|			,
		|			Счет = &СчетУчетаДоходов,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто2 = &ЦеннаяБумага
		|				И (&Аналитика = НЕОПРЕДЕЛЕНО
		|					ИЛИ ЛицевойСчет.ДополнительнаяАналитика = &Аналитика)
		|				И (&ГруппаФинансовогоУчетаДоходовРасходов = НЕОПРЕДЕЛЕНО
		|					ИЛИ Субконто1 = &ГруппаФинансовогоУчетаДоходовРасходов)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты";
		
	Запрос.УстановитьПараметр("Организация"								, ЭтотОбъект.Организация);
 	Запрос.УстановитьПараметр("СчетДоверительногоУправления"			, УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоГода"								, Новый Граница(НачалоГода(НаДату), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период"									, Новый Граница(НаДату, ВидГраницы.Включая));
 	Запрос.УстановитьПараметр("СчетУчетаДоходов"						, СчетУчетаДоходов);
	Запрос.УстановитьПараметр("ВидыСубконто"							, ВидыСубконто);
 	Запрос.УстановитьПараметр("ЦеннаяБумага"							, ЦеннаяБумага);
 	Запрос.УстановитьПараметр("Аналитика"								, Аналитика);
 	Запрос.УстановитьПараметр("ГруппаФинансовогоУчетаДоходовРасходов"	, ГруппаФинансовогоУчетаДоходовРасходов);
	
	Если УчитыватьПартииНаСчетахУчета Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ГруппаФинансовогоУчетаДоходовРасходов", 
			"ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК ГруппаФинансовогоУчетаДоходовРасходов,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет");
	
	КонецЕсли;
	
  	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ДоходЗаТекущийГод = 0 Тогда
			
			ДоходВПроводку = ВыборкаДетальныеЗаписи.ДоходЗаТекущийГод;
			
			Если КоэффициентЗакрытия <> 0  Тогда
			
				ДоходВПроводку = ДоходВПроводку * КоэффициентЗакрытия;
			
			КонецЕсли;
			
		Иначе
			
			ДоходВПроводку = ДоходЗаТекущийГод;
			
		КонецЕсли;
		

		Если ДоходВПроводку > 0 Тогда
	
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ДоходВПроводку, Содержание);
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			
			Проводка.СчетКт = СчетУчетаДоходов;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.ГруппаФинансовогоУчетаДоходовРасходов;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаКт = Аналитика;
			
			Если УчитыватьПартииНаСчетахУчета Тогда
			
				Проводка.Партия = ВыборкаДетальныеЗаписи.ЛицевойСчет.Партия;	
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.ЛицевойСчет.СтрокаПартии;	
			
			КонецЕсли;
			
		ИначеЕсли ДоходВПроводку < 0 Тогда
	
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, - ДоходВПроводку, Содержание);
			
			Проводка.СчетДт = СчетУчетаДоходов;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.ГруппаФинансовогоУчетаДоходовРасходов;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаДт = Аналитика;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			
			Если УчитыватьПартииНаСчетахУчета Тогда
			
				Проводка.Партия = ВыборкаДетальныеЗаписи.ЛицевойСчет.Партия;	
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.ЛицевойСчет.СтрокаПартии;	
			
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

 	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
КонецПроцедуры

Процедура ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДоходов, Содержание, Аналитика, ДоходЗаТекущийГод, Партия = Неопределено, СтрокаПартии = Неопределено) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	Если ДоходЗаТекущийГод > 0 Тогда

		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ДоходЗаТекущийГод, ВалютаДоходов, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, Содержание);
		
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
		
		Проводка.СчетКт = СчетУчетаДоходов;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.ДополнительнаяАналитикаКт = Аналитика;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
	ИначеЕсли ДоходЗаТекущийГод < 0 Тогда

		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета( - ДоходЗаТекущийГод, ВалютаДоходов, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, Содержание);
		
		Проводка.СчетДт = СчетУчетаДоходов;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.ДополнительнаяАналитикаДт = Аналитика;
		
		Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОтнесениеНачисленныхДоходовНаАктивыВДУПоЦеннымБумагам(ЭтотОбъект, ТЧ_ЦенныеБумаги, Рынок, ДоляЗакрытия = 1) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки = БухгалтерскийУчет.ОпределитьНастройкуУчета(
																ЭтотОбъект.Дата,
																ЭтотОбъект.Организация,
																УчетныйСчетДоверительногоУправления,
																"НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки");
																
	ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме = (ЭтотОбъект.Дата < '20221001') И НЕ НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки; // тем, кто не сворачивает новая схема не нужна
																
	СуммаРассчитана = Ложь;
	Если ДоляЗакрытия <> 1 ИЛИ ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.Оплата") Тогда
		ЭтотОбъект.Движения.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.Записывать = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("ДокументСсылка.Сделка") 
		И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") 
		И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") 
		И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("ДокументСсылка.ПоставкаЦенныхБумаг") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	-БухПартииЦенныхБумаг.ПереоценкаКупонаСНачалаГода КАК ПереоценкаКупонаСНачалаГода,
	|	-БухПартииЦенныхБумаг.КорректировкаЭСПСНачалаГода КАК КорректировкаЭСПСНачалаГода,
	|	-БухПартииЦенныхБумаг.ДисконтПремияНачисленныйСНачалаГода КАК ДисконтПремияНачисленныйСНачалаГода,
	|	-БухПартииЦенныхБумаг.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
	|	-БухПартииЦенныхБумаг.ПереоценкаСНачалаГодаПоложительная КАК ПереоценкаСНачалаГодаПоложительная,
	|	-БухПартииЦенныхБумаг.РасходыПриПокупкеСНачалаГода КАК РасходыПриПокупкеСНачалаГода,
	|	-БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияСНачалаГода КАК РазницаПервоначальногоПризнанияСНачалаГода,
	|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС
	|ПОМЕСТИТЬ _ЧистыеЗакрытияДоходовРасходов
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|ГДЕ
	|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
	|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ПереоценкаКупонаСНачалаГода) КАК ПереоценкаКупона,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.КорректировкаЭСПСНачалаГода) КАК КорректировкаЭСП,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ДисконтПремияНачисленныйСНачалаГода) КАК ДисконтПремияНачисленный,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.РасходыПриПокупкеСНачалаГода) КАК РасходыПриПокупкеСНачалаГода,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.РазницаПервоначальногоПризнанияСНачалаГода) КАК РазницаПервоначальногоПризнанияСНачалаГода,
	|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГода) КАК Переоценка,
	|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГодаПоложительная) КАК ПереоценкаПоложительная
	|ИЗ
	|	_ЧистыеЗакрытияДоходовРасходов КАК _ЧистыеЗакрытияДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага,
	|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	ЦенныеБумаги = Запрос.Выполнить().Выгрузить();
	
	//Все суммы с начала года в валюте учета и их пересчитывать не надо
	ВалютаДохода  = ЭтотОбъект.Организация.ВалютаУчета;
	
	Для Каждого СтрокаЦенныеБумаги Из ЦенныеБумаги Цикл
		ЦеннаяБумага = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Попытка
			УчетныйАктив = СтрокаЦенныеБумаги.УчетныйАктивЕПС;	
		Исключение
			УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтотОбъект, Рынок, ЦеннаяБумага, УчетныйСчетДоверительногоУправления);
		КонецПопытки;
		
		КорректировкаЭСП = 0;
		ПереоценкаКупона = 0;
		ДисконтПремияНачисленный = 0;
		
		
		Если Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			ДисконтПремияНачисленный = Окр(СтрокаЦенныеБумаги.ДисконтПремияНачисленный * ДоляЗакрытия, 2);
			
			ПереоценкаКупона = Окр(СтрокаЦенныеБумаги.ПереоценкаКупона * ДоляЗакрытия, 2);
			Если СтрокаЦенныеБумаги.ПереоценкаКупона <> 0 Тогда
				СчетУчетаДоходов = ПланыСчетов.Единый.ПроцентныеДоходы01;
				ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
				Если ПереоценкаКупона <> 0 Тогда
					БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по погашению купона", Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный, ПереоценкаКупона);
				КонецЕсли;
			КонецЕсли;
			
			КорректировкаЭСП = Окр(СтрокаЦенныеБумаги.КорректировкаЭСП * ДоляЗакрытия, 2);
			Если СтрокаЦенныеБумаги.КорректировкаЭСП > 0 Тогда
				СчетУчетаДоходов = ПланыСчетов.Единый.ПроцентныеДоходы06;
				ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтКорректировки;
				Если КорректировкаЭСП <> 0 Тогда
			    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по корректировке ЭСП", Неопределено, КорректировкаЭСП);
				КонецЕсли;
			ИначеЕсли СтрокаЦенныеБумаги.КорректировкаЭСП < 0 Тогда
				СчетУчетаДоходов = ПланыСчетов.Единый.ПроцентныеДоходы05;
				ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтКорректировки;
				Если КорректировкаЭСП <> 0 Тогда
					БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по корректировке ЭСП", Неопределено, КорректировкаЭСП);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки Тогда
			
			ПереоценкаПоложительная = Окр(СтрокаЦенныеБумаги.ПереоценкаПоложительная * ДоляЗакрытия, 2);
			
			Если ПереоценкаПоложительная < 0 Тогда
				
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
					
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, ПереоценкаПоложительная);// и только потом со счетов 7ХХ (аналитика операции) на 47903
					
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив);
				КонецЕсли;
				
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
											ЭтотОбъект,
											СчетУчетаДоходов,
											ЦеннаяБумага,
											ГруппаФинансовогоУчетаДоходовРасходов,
											ВалютаДохода,
											"Закрытие доначисления по доходам от операций",
											Неопределено,
											ПереоценкаПоложительная);
			КонецЕсли;
			
			
			ПереоценкаОтрицательная = Окр((СтрокаЦенныеБумаги.Переоценка - СтрокаЦенныеБумаги.ПереоценкаПоложительная) * ДоляЗакрытия, 2);
			
			Если ПереоценкаОтрицательная > 0 Тогда
				
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
				
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, ПереоценкаПоложительная);// и только потом со счетов 7ХХ (аналитика операции) на 47903
				
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, Ложь);
				КонецЕсли;
				
		    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
											ЭтотОбъект,
											СчетУчетаДоходов,
											ЦеннаяБумага,
											ГруппаФинансовогоУчетаДоходовРасходов,
											ВалютаДохода,
											"Закрытие доначисления по расходам от операций",
											Неопределено,
											ПереоценкаОтрицательная);
				
										КонецЕсли;
										
		ИначеЕсли ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме Тогда
			
			Переоценка = Окр(СтрокаЦенныеБумаги.Переоценка * ДоляЗакрытия, 2);
			Если СтрокаЦенныеБумаги.Переоценка > 0 Тогда
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
				
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, Переоценка);// и только потом со счетов 7ХХ (аналитика операции) на 47903
				
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, Ложь);
				КонецЕсли;
				Если Переоценка <> 0 Тогда
			    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по расходам от операций", Неопределено, Переоценка);
				КонецЕсли;
			ИначеЕсли СтрокаЦенныеБумаги.Переоценка < 0 Тогда
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
					
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, Переоценка);// и только потом со счетов 7ХХ (аналитика операции) на 47903
					
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив);
				КонецЕсли;
				Если Переоценка <> 0 Тогда
					БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по доходам от операций", Неопределено, Переоценка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		РазницаПервоначальногоПризнанияСНачалаГода = Окр(СтрокаЦенныеБумаги.РазницаПервоначальногоПризнанияСНачалаГода * ДоляЗакрытия, 2);
		Если СтрокаЦенныеБумаги.РазницаПервоначальногоПризнанияСНачалаГода > 0 Тогда
			СчетУчетаДоходов = УчетныйАктив.СчетУчетаРасходовОтОпераций;
			ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовПервоначальногоПризнания;
			Если РазницаПервоначальногоПризнанияСНачалаГода <> 0 Тогда
		    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по разнице первоначального признания", Неопределено, РазницаПервоначальногоПризнанияСНачалаГода);
			КонецЕсли;
		ИначеЕсли СтрокаЦенныеБумаги.РазницаПервоначальногоПризнанияСНачалаГода < 0 Тогда
			СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
			ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовПервоначальногоПризнания;
			Если РазницаПервоначальногоПризнанияСНачалаГода <> 0 Тогда
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по разнице первоначального признания", Неопределено, РазницаПервоначальногоПризнанияСНачалаГода);
			КонецЕсли;
		КонецЕсли;
		
		
		РасходыПриПокупкеСНачалаГода = Окр(СтрокаЦенныеБумаги.РасходыПриПокупкеСНачалаГода * ДоляЗакрытия, 2);
		Если СтрокаЦенныеБумаги.РасходыПриПокупкеСНачалаГода < 0 Тогда
			СчетУчетаДоходов = УчетныйАктив.СчетУчетаРасходовОтОпераций;
			ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
			Если РасходыПриПокупкеСНачалаГода <> 0 Тогда
		    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие комиссии покупки", Неопределено, - РасходыПриПокупкеСНачалаГода);
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") 
			И ДоляЗакрытия <> 1 И 
				(СтрокаЦенныеБумаги.РасходыПриПокупкеСНачалаГода - РасходыПриПокупкеСНачалаГода <> 0 
				ИЛИ (СтрокаЦенныеБумаги.Переоценка - Переоценка <> 0 И ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме)
				ИЛИ СтрокаЦенныеБумаги.КорректировкаЭСП - КорректировкаЭСП <> 0
				ИЛИ СтрокаЦенныеБумаги.ПереоценкаКупона - ПереоценкаКупона <> 0
				ИЛИ СтрокаЦенныеБумаги.ДисконтПремияНачисленный - ДисконтПремияНачисленный <> 0) Тогда
			ДвижениеНакопления = ЭтотОбъект.Движения.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.Добавить();
			ДвижениеНакопления.ВидДвижения                  = ВидДвиженияНакопления.Приход;
			ДвижениеНакопления.Период                       = ЭтотОбъект.Дата;
			ДвижениеНакопления.Организация                  = ЭтотОбъект.Организация;
			ДвижениеНакопления.СчетДоверительногоУправления = УчетныйСчетДоверительногоУправления;
			ДвижениеНакопления.Продажа						= ЭтотОбъект.Основание;
			ДвижениеНакопления.УчетныйАктивЕПС		        = УчетныйАктив;
			ДвижениеНакопления.ЦеннаяБумага		        	= ЦеннаяБумага;
			ДвижениеНакопления.ДисконтПремия                = -(СтрокаЦенныеБумаги.ДисконтПремияНачисленный - ДисконтПремияНачисленный);
			ДвижениеНакопления.ПереоценкаКупона             = -(СтрокаЦенныеБумаги.ПереоценкаКупона - ПереоценкаКупона);
			ДвижениеНакопления.КорректировкаЭСП             = -(СтрокаЦенныеБумаги.КорректировкаЭСП - КорректировкаЭСП);
			Если ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме Тогда
				ДвижениеНакопления.Переоценка                   = -(СтрокаЦенныеБумаги.Переоценка - Переоценка);
			КонецЕсли;
			
			ДвижениеНакопления.РазницаПервоначальногоПризнанияСНачалаГода = -(СтрокаЦенныеБумаги.РазницаПервоначальногоПризнанияСНачалаГода - РазницаПервоначальногоПризнанияСНачалаГода);
			ДвижениеНакопления.РасходыПриПокупкеСНачалаГода = -(СтрокаЦенныеБумаги.РасходыПриПокупкеСНачалаГода - РасходыПриПокупкеСНачалаГода);
		КонецЕсли;
		
    КонецЦикла;
		
	// отдельная тема
	Если НЕ ЗакрытиеДоходовРасходовОтПереоценкиПоСтаройСхеме Тогда
	
		ЗапросПереоценки = Новый Запрос;
		
		ЗапросПереоценки.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		
		ЗапросПереоценки.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГода) КАК ПереоценкаПоложительная
			|ПОМЕСТИТЬ _Положительная
			|ИЗ
			|	_ЧистыеЗакрытияДоходовРасходов КАК _ЧистыеЗакрытияДоходовРасходов
			|ГДЕ
			|	_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГода < 0
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага,
			|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	СУММА(_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГода) КАК ПереоценкаОтрицательная
			|ПОМЕСТИТЬ _Отрицательная
			|ИЗ
			|	_ЧистыеЗакрытияДоходовРасходов КАК _ЧистыеЗакрытияДоходовРасходов
			|ГДЕ
			|	_ЧистыеЗакрытияДоходовРасходов.ПереоценкаСНачалаГода > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	_ЧистыеЗакрытияДоходовРасходов.ЦеннаяБумага,
			|	_ЧистыеЗакрытияДоходовРасходов.УчетныйАктивЕПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_Отрицательная.ЦеннаяБумага, _Положительная.ЦеннаяБумага) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_Отрицательная.УчетныйАктивЕПС, _Положительная.УчетныйАктивЕПС) КАК УчетныйАктивЕПС,
			|	ЕСТЬNULL(_Положительная.ПереоценкаПоложительная, 0) КАК ПереоценкаПоложительная,
			|	ЕСТЬNULL(_Отрицательная.ПереоценкаОтрицательная, 0) КАК ПереоценкаОтрицательная
			|ИЗ
			|	_Положительная КАК _Положительная
			|		ПОЛНОЕ СОЕДИНЕНИЕ _Отрицательная КАК _Отрицательная
			|		ПО _Положительная.ЦеннаяБумага = _Отрицательная.ЦеннаяБумага
			|			И _Положительная.УчетныйАктивЕПС = _Отрицательная.УчетныйАктивЕПС";
		
		РезультатЗапроса = ЗапросПереоценки.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			УчетныйАктив = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;	
			
			ПереоценкаПоложительная = Окр(ВыборкаДетальныеЗаписи.ПереоценкаПоложительная * ДоляЗакрытия, 2);
			Если ПереоценкаПоложительная <> 0 Тогда
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
				
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, ПереоценкаПоложительная);// и только потом со счетов 7ХХ (аналитика операции) на 47903
				
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив);
				КонецЕсли;
		    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по расходам от операций", Неопределено, ПереоценкаПоложительная);
			КонецЕсли;
			
			ПереоценкаОтрицательная = Окр(ВыборкаДетальныеЗаписи.ПереоценкаОтрицательная * ДоляЗакрытия, 2);
			Если ПереоценкаОтрицательная <> 0 Тогда
				Если УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда // у них сначала идет перенос с со счетов 106ХХ (аналитика переоценки)на счета 7ХХ (аналитика операции)
					
					ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаДохода, ПереоценкаОтрицательная);// и только потом со счетов 7ХХ (аналитика операции) на 47903
					
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
					СчетУчетаДоходов = УчетныйАктив.СчетУчетаДоходовОтОпераций;
				Иначе
					ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтПереоценки;
					СчетУчетаДоходов = БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, Ложь);
				КонецЕсли;
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по доходам от операций", Неопределено, ПереоценкаОтрицательная);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(-БухПартииЦенныхБумаг.ДисконтПремияНачисленныйСНачалаГода) КАК ДисконтПремияНачисленный,
	|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки >= 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДисконтИлиПремия
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|ГДЕ
	|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
	|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
	|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	БухПартииЦенныхБумаг.ЦеннаяБумага,
	|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумаг.ДисконтПремияПокупки >= 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	ЦенныеБумаги = Запрос.Выполнить().Выгрузить();
	
	//Все суммы с начала года в валюте учета и их пересчитывать не надо
	ВалютаДохода  = ЭтотОбъект.Организация.ВалютаУчета;
	
	Для Каждого СтрокаЦенныеБумаги Из ЦенныеБумаги Цикл
		ЦеннаяБумага = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Попытка
			УчетныйАктив = СтрокаЦенныеБумаги.УчетныйАктивЕПС;	
		Исключение
			УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ЭтотОбъект, Рынок, ЦеннаяБумага, УчетныйСчетДоверительногоУправления);
		КонецПопытки;
		
		ДисконтПремияНачисленный = 0;
		
		Если Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
			ДисконтПремияНачисленный = Окр(СтрокаЦенныеБумаги.ДисконтПремияНачисленный * ДоляЗакрытия, 2);
			
			// у тут делаем закрытия по дисконту/премии, тут они не смешиваются
			Если СтрокаЦенныеБумаги.ДисконтПремияНачисленный < 0 Тогда
				СчетУчетаДоходов = ПланыСчетов.Единый.ПроцентныеДоходы01;
				ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
				Если ДисконтПремияНачисленный <> 0 Тогда
					БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по дисконту", Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт, ДисконтПремияНачисленный);
				КонецЕсли;
			ИначеЕсли СтрокаЦенныеБумаги.ДисконтПремияНачисленный > 0 Тогда
				СчетУчетаДоходов = ПланыСчетов.Единый.ПроцентныеДоходы04;
				ГруппаФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаСписанияПремии;
				Если ДисконтПремияНачисленный <> 0 Тогда
					БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по премии", Неопределено, ДисконтПремияНачисленный);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
    КонецЦикла;
	
	// к сожалению для резервов у нас нет ресурса "...СНачалаГода" 
	// и вдобавок они могут гулять туда сюда произвольно, 
	// приходится просто считать по выводимому коэффициенту - увы, но лучше ничего нет

	// приходится записывать движения документа т.к. он сам еще начисляет резерв
	Движения = ЭтотОбъект.Движения;
	НаборЗаписей = Движения.ЕдиныйБухгалтерскийУчет;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И ЭтотОбъект.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьВСоставеФБУ", Истина);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество
		|ПОМЕСТИТЬ _ВыводБумагПоАС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииЦенныхБумагОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиВыводимыхБумаг
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыводБумагПоАС.ЦеннаяБумага
		|					ИЗ
		|						_ВыводБумагПоАС КАК _ВыводБумагПоАС)) КАК БухПартииЦенныхБумагОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВыводБумагПоАС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВыводБумагПоАС.Количество КАК Количество,
		|	_ОстаткиВыводимыхБумаг.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕдиныйБухгалтерскийУчетОстаткиДоход.Субконто1 КАК ГФУДоход,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиДоход.СуммаОстатокКт, 0) КАК СуммаОстатокДоход,
		|	ЕдиныйБухгалтерскийУчетОстаткиРасход.Субконто1 КАК ГФУРасход,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиРасход.СуммаОстатокДт, 0) КАК СуммаОстатокРасход
		|ИЗ
		|	_ВыводБумагПоАС КАК _ВыводБумагПоАС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиВыводимыхБумаг КАК _ОстаткиВыводимыхБумаг
		|		ПО _ВыводБумагПоАС.ЦеннаяБумага = _ОстаткиВыводимыхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&ПериодВключая,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам01),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Субконто2 В
		|						(ВЫБРАТЬ
		|							_ВыводБумагПоАС.ЦеннаяБумага
		|						ИЗ
		|							_ВыводБумагПоАС КАК _ВыводБумагПоАС)) КАК ЕдиныйБухгалтерскийУчетОстаткиДоход
		|		ПО _ВыводБумагПоАС.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстаткиДоход.Субконто2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&ПериодВключая,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам02),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Субконто2 В
		|						(ВЫБРАТЬ
		|							_ВыводБумагПоАС.ЦеннаяБумага
		|						ИЗ
		|							_ВыводБумагПоАС КАК _ВыводБумагПоАС)) КАК ЕдиныйБухгалтерскийУчетОстаткиРасход
		|		ПО _ВыводБумагПоАС.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстаткиРасход.Субконто2";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",	Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодВключая",	Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КоэффициентЗакрытияРезерва = ВыборкаДетальныеЗаписи.Количество / ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		Если ВыборкаДетальныеЗаписи.СуммаОстатокДоход > 0 Тогда
	    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
				ЭтотОбъект,
				ПланыСчетов.Единый.ДоходыРасходыПоРезервам01,
				ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
				ВыборкаДетальныеЗаписи.ГФУДоход,
				ВалютаДохода, 
				"Закрытие доначисления по резервам",
				Неопределено,
				- ВыборкаДетальныеЗаписи.СуммаОстатокДоход * КоэффициентЗакрытияРезерва);
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.СуммаОстатокРасход > 0 Тогда
	    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
				ЭтотОбъект,
				ПланыСчетов.Единый.ДоходыРасходыПоРезервам02,
				ВыборкаДетальныеЗаписи.ЦеннаяБумага, 
				ВыборкаДетальныеЗаписи.ГФУРасход,
				ВалютаДохода, 
				"Закрытие доначисления по резервам",
				Неопределено,
				ВыборкаДетальныеЗаписи.СуммаОстатокРасход * КоэффициентЗакрытияРезерва);
		КонецЕсли;
		
	КонецЦикла;
	
	ОтнесениеНачисленныхДоходовНаАктивыВДУПоКурсовымРазницамЦенныхБумаг(ЭтотОбъект, ДоляЗакрытия);
	
КонецПроцедуры

Процедура ОтнесениеНачисленныхДоходовНаАктивыВДУПоКурсовымРазницамЦенныхБумаг(ЭтотОбъект, ДоляЗакрытия = 1, Регистратор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Организация КАК Организация,
		|	БухПартииЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Количество КАК Количество,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ТаблицаПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&ПериодОстатков,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ПО БухПартииЦенныхБумаг.Организация = БухПартииЦенныхБумагОстатки.Организация
		|			И БухПартииЦенныхБумаг.СчетДоверительногоУправления = БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления
		|			И БухПартииЦенныхБумаг.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
		|			И БухПартииЦенныхБумаг.УчетныйАктивЕПС = БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|			И БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.КурсовыеРазницыСНачалаГода <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.СтоимостьВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.СтоимостьВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета < 0
		|					ТОГДА 0
		|				ИНАЧЕ БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета
		|			КОНЕЦ, 0)) КАК ПоложительныеРазницы,
		|	СУММА(ЕСТЬNULL(ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.СтоимостьВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.СтоимостьВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета
		|			КОНЕЦ + ВЫБОР
		|				КОГДА БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета > 0
		|					ТОГДА 0
		|				ИНАЧЕ -БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета
		|			КОНЕЦ, 0)) КАК ОтрицательныеРазницы,
		|	ТаблицаПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаПартий.Партия КАК Партия,
		|	ТаблицаПартий.СтрокаПартии КАК СтрокаПартии,
		|	ТаблицаПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТаблицаПартий.Количество КАК Количество,
		|	ТаблицаПартий.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	ТаблицаПартий КАК ТаблицаПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ПО ТаблицаПартий.Организация = БухПартииЦенныхБумаг.Организация
		|			И ТаблицаПартий.СчетДоверительногоУправления = БухПартииЦенныхБумаг.СчетДоверительногоУправления
		|			И ТаблицаПартий.ЦеннаяБумага = БухПартииЦенныхБумаг.ЦеннаяБумага
		|			И ТаблицаПартий.Партия = БухПартииЦенныхБумаг.Партия
		|			И ТаблицаПартий.ЦеннаяБумага = БухПартииЦенныхБумаг.ЦеннаяБумага
		|			И ТаблицаПартий.СтрокаПартии = БухПартииЦенныхБумаг.СтрокаПартии
		|			И ТаблицаПартий.УчетныйАктивЕПС = БухПартииЦенныхБумаг.УчетныйАктивЕПС
		|			И (БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И (БухПартииЦенныхБумаг.КурсовыеРазницыСНачалаГода <> 0)
		|			И (БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПартий.ЦеннаяБумага,
		|	ТаблицаПартий.Партия,
		|	ТаблицаПартий.СтрокаПартии,
		|	ТаблицаПартий.УчетныйАктивЕПС,
		|	ТаблицаПартий.Количество,
		|	ТаблицаПартий.КоличествоОстаток";
	
	Запрос.УстановитьПараметр("НачалоПериода", ОпределитьДатуНачалаБухгалтерскогоПериода(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ЭтотОбъект.Дата);
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Если Регистратор = Неопределено Тогда
	
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ПериодОстатков", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		
	Иначе // погашение
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("ПериодОстатков", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));
		
	КонецЕсли;
	
	ВалютаДохода  = ЭтотОбъект.Организация.ВалютаУчета;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Регистратор <> Неопределено И ВыборкаДетальныеЗаписи.Количество = 0 Тогда // погашение, гасим все
			ДоляЗакрытия = 1;	
		Иначе
			ДоляЗакрытия = ВыборкаДетальныеЗаписи.КоличествоОстаток / ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
		
		КурсовыеРазницыСНачалаГода = Окр(ВыборкаДетальныеЗаписи.ПоложительныеРазницы * ДоляЗакрытия, 2);
		Если КурсовыеРазницыСНачалаГода <> 0 Тогда
			СчетУчетаДоходов = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			ГруппаФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(СчетУчетаДоходов, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
	    	БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ВыборкаДетальныеЗаписи.ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по курсовым разницам", Неопределено, -КурсовыеРазницыСНачалаГода);
		КонецЕсли;
		
		КурсовыеРазницыСНачалаГода = Окр(ВыборкаДетальныеЗаписи.ОтрицательныеРазницы * ДоляЗакрытия, 2);
		Если КурсовыеРазницыСНачалаГода <> 0 Тогда
			СчетУчетаДоходов = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			ГруппаФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(СчетУчетаДоходов, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
			БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(ЭтотОбъект, СчетУчетаДоходов, ВыборкаДетальныеЗаписи.ЦеннаяБумага, ГруппаФинансовогоУчетаДоходовРасходов, ВалютаДохода, "Закрытие доначисления по курсовым разницам", Неопределено, КурсовыеРазницыСНачалаГода);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗакрытьКорректировки710(ЭтотОбъект, ЦеннаяБумага, НаДату = "", УчетныйАктивВходящий = Неопределено, УчитыватьПартииНаСчетахУчета = Ложь, ЗакрыватьКорректировкуЭСП = Истина) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И ЭтотОбъект.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.ДополнительныеСвойства.Вставить("ЗаписьВСоставеФБУ", Истина);
	КонецЕсли;
	
	ЭтотОбъект.Движения.Записать();
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ЭтотОбъект.Дата;
	КонецЕсли;
	
	Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ЦеннаяБумага, НаДату);
		Валюта = ЦеннаяБумага.БанковскийСчет.Валюта;
	Иначе
		УчетныйАктив = УчетныйАктивВходящий;
		Валюта = ЦеннаяБумага.ВалютаНоминала;
	КонецЕсли;
	
	Если ЗакрыватьКорректировкуЭСП Тогда
	
		АналитикаДоходов = УчетныйАктив.АналитикаДоходовОтКорректировки;
		АналитикаРасходов = УчетныйАктив.АналитикаРасходовОтКорректировки;
		
	Иначе // закрываем корректировку ПП
		
		АналитикаДоходов = УчетныйАктив.АналитикаДоходовПервоначальногоПризнания;
		АналитикаРасходов = УчетныйАктив.АналитикаРасходовПервоначальногоПризнания;
		
	КонецЕсли;
	
	СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(АналитикаДоходов.НомерСчетаБухгалтерскогоУчета);
	СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(АналитикаРасходов.НомерСчетаБухгалтерскогоУчета);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаКорректировкиА,
		|	0 КАК СуммаКорректировкиП
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоГода,
		|			&Период,
		|			Период,
		|			,
		|			Счет = &СчетУчетаКорректировокА,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &АналитикаРасходов
		|				И Субконто2 = &ЦеннаяБумага) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоГода,
		|			&Период,
		|			Период,
		|			,
		|			Счет = &СчетУчетаКорректировокП,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &АналитикаДоходов
		|				И Субконто2 = &ЦеннаяБумага) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты";
	
	
	Запрос.УстановитьПараметр("Организация"						, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления"	, УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоГода"						, Новый Граница(НачалоГода(НаДату), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период"							, Новый Граница(НаДату, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидыСубконто"					, ВидыСубконто);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокА"			, СчетУчетаРасходов);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокП"			, СчетУчетаДоходов);
	Запрос.УстановитьПараметр("АналитикаРасходов"				, АналитикаРасходов);
	Запрос.УстановитьПараметр("АналитикаДоходов"				, АналитикаДоходов);
	Запрос.УстановитьПараметр("ЦеннаяБумага"					, ЦеннаяБумага);
	
	Если УчитыватьПартииНаСчетахУчета Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"0 КАК СуммаКорректировкиП",
			"0 КАК СуммаКорректировкиП,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт",
			"ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт,
			|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет");
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Проводка = Неопределено;
		
		Если ВыборкаДетальныеЗаписи.СуммаКорректировкиА > 0 Тогда

			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СуммаКорректировкиА, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка");
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
		
			Проводка.СчетКт = СчетУчетаРасходов;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаРасходов;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.СуммаКорректировкиА < 0 Тогда
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(- ВыборкаДетальныеЗаписи.СуммаКорректировкиА, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка");
			
			Проводка.СчетДт = СчетУчетаРасходов;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаРасходов;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаКорректировкиП > 0 Тогда
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВыборкаДетальныеЗаписи.СуммаКорректировкиП, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка");
			
			Проводка.СчетДт = СчетУчетаДоходов;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаДоходов;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.СуммаКорректировкиП < 0 Тогда
			
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(- ВыборкаДетальныеЗаписи.СуммаКорректировкиП, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка");
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			
			Проводка.СчетКт = СчетУчетаДоходов;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаДоходов;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
	    КонецЕсли;
		
		Если Проводка <> Неопределено И УчитыватьПартииНаСчетахУчета Тогда
		
			Проводка.Партия = ВыборкаДетальныеЗаписи.ЛицевойСчет.Партия;	
			Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.ЛицевойСчет.СтрокаПартии;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗакрытьКорректировки206(ЭтотОбъект, КредитныйИнструмент) Экспорт
	
	// эта процедура предназначена для "заметания под коврик" корректировок ЭСП по депозитам по АС
	// дело в том, что из-за больших номиналов часто вылезают погрешности расчета ЭСП + депозиты закрываются не точно в день закрытия
	// эта процедура и списывает их на доходы/расходы
	//
	// так же прикрутил эту процедуру к МНО - т.к. там в принципе никогда не выйдет корректировка ЭСП в ноль
	// поэтому, эта процедура самое то для списания корректировок по ЭСП по МНО
	
	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И ЭтотОбъект.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.ДополнительныеСвойства.Вставить("ЗаписьВСоставеФБУ", Истина);
	КонецЕсли;
	
	ЭтотОбъект.Движения.Записать();

	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	ТипИнструмента = ТипЗнч(КредитныйИнструмент);
	Если ТипИнструмента = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		БанковскийСчет	= КредитныйИнструмент.БанковскийСчет;
		УчетныйАктив	= Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(КредитныйИнструмент, ЭтотОбъект.Дата);
		ВерхнийЛимит	= 1;
		НижнийЛимит		= -1;
	ИначеЕсли ТипИнструмента = Тип("ДокументСсылка.МНО") Тогда
		БанковскийСчет	= КредитныйИнструмент.РасчетныйСчет;
		УчетныйАктив	= Справочники.УчетныеАктивыЕПС.ПроцентыНаМНО;
		ВерхнийЛимит	= КредитныйИнструмент.Сумма;
		НижнийЛимит		= -КредитныйИнструмент.Сумма;
	Иначе
		ВызватьИсключение "В настоящий момент не поддерживается начисление корректировок ЭСП по виду кредитного инструмента: " + Строка(ТипИнструмента);
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настоящий момент не поддерживается начисление корректировок ЭСП по виду кредитного инструмента: " + Строка(ТипИнструмента));
		Возврат;
	КонецЕсли;
	
	СчетУчетаДоходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаДоходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
	СчетУчетаРасходов = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаРасходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК ОстатокКорректировки,
		|	БухгалтерскийУчетОстатки.Субконто2 КАК КредитныйИнструмент,
		|	""КорректировкаА"" КАК ВидКорректировки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаКорректировокА,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &БанковскиеСчета
		|				И Субконто2 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки
		|ГДЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт < &ВерхнийЛимит
		|	И БухгалтерскийУчетОстатки.СуммаОстатокДт > &НижнийЛимит
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстатки.СуммаОстатокКт,
		|	БухгалтерскийУчетОстатки.Субконто2,
		|	""КорректировкаП""
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаКорректировокП,
		|			&ВидыСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &БанковскиеСчета
		|				И Субконто2 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки
		|ГДЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокКт < &ВерхнийЛимит
		|	И БухгалтерскийУчетОстатки.СуммаОстатокКт > &НижнийЛимит";
		
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период"						, Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидыСубконто"				, ВидыСубконто);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокА"		, УчетныйАктив.СчетУчетаКорректировокА);
	Запрос.УстановитьПараметр("СчетУчетаКорректировокП"		, УчетныйАктив.СчетУчетаКорректировокП);
	Запрос.УстановитьПараметр("БанковскиеСчета"				, БанковскийСчет);
	Запрос.УстановитьПараметр("КредитныйИнструмент"			, КредитныйИнструмент);
	Запрос.УстановитьПараметр("ВерхнийЛимит"				, ВерхнийЛимит);
	Запрос.УстановитьПараметр("НижнийЛимит"					, НижнийЛимит);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидКорректировки = "КорректировкаА" Тогда
			
			Если ВыборкаДетальныеЗаписи.ОстатокКорректировки > 0 Тогда
				СуммаКорректировки = ВыборкаДетальныеЗаписи.ОстатокКорректировки;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
				
				Проводка.СчетДт = СчетУчетаРасходов;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтКорректировки;
				Проводка.СубконтоДт.ЦенныеБумаги = КредитныйИнструмент;
				
				Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокА;
				Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
				Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
				Проводка.ВалютаКт  = БанковскийСчет.Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаКорректировки;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокКорректировки < 0 Тогда
				
				СуммаКорректировки = - ВыборкаДетальныеЗаписи.ОстатокКорректировки;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
				
				Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокА;
				Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
				Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
				Проводка.ВалютаДт  = БанковскийСчет.Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаКорректировки;
				
				Проводка.СчетКт = СчетУчетаДоходов;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтКорректировки;
				Проводка.СубконтоКт.ЦенныеБумаги = КредитныйИнструмент;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидКорректировки = "КорректировкаП" Тогда
			
			Если ВыборкаДетальныеЗаписи.ОстатокКорректировки > 0 Тогда
				СуммаКорректировки = ВыборкаДетальныеЗаписи.ОстатокКорректировки;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
				
				Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокП;
				Проводка.СубконтоДт.БанковскиеСчета = БанковскийСчет;
				Проводка.СубконтоДт.ДепозитныеВклады = КредитныйИнструмент;
				Проводка.ВалютаДт  = БанковскийСчет.Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаКорректировки;
				
				Проводка.СчетКт = СчетУчетаДоходов;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтКорректировки;
				Проводка.СубконтоКт.ЦенныеБумаги = КредитныйИнструмент;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОстатокКорректировки < 0 Тогда
				
				СуммаКорректировки = - ВыборкаДетальныеЗаписи.ОстатокКорректировки;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаКорректировки, "Корректировка");
				
				Проводка.СчетДт = СчетУчетаРасходов;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтКорректировки;
				Проводка.СубконтоДт.ЦенныеБумаги = КредитныйИнструмент;
				
				Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокП;
				Проводка.СубконтоКт.БанковскиеСчета = БанковскийСчет;
				Проводка.СубконтоКт.ДепозитныеВклады = КредитныйИнструмент;
				Проводка.ВалютаКт  = БанковскийСчет.Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаКорректировки;
				
			КонецЕсли;
			
		КонецЕсли
	
	КонецЦикла;
	
	ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
КонецПроцедуры

Процедура Закрыть7ойРазделПоПартии(ОбъектДокумента, УчетныйРегистр, ПараметрыЗакрытия) Экспорт

	//закрыть 7 раздел
	Если ПараметрыЗакрытия.ДоходРасход > 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыЗакрытия.ДоходРасход, "Закрытие дохода");
		
		// дебет
		Проводка.СчетДт = ПараметрыЗакрытия.СчетДоходов;
		
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыЗакрытия.АналитикаДоходов;
		Проводка.СубконтоДт.ЦенныеБумаги         = ПараметрыЗакрытия.ЦеннаяБумага;
		
		Если ПараметрыЗакрытия.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт
			ИЛИ ПараметрыЗакрытия.Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный Тогда
		
			Проводка.ДополнительнаяАналитикаДт = ПараметрыЗакрытия.Аналитика;
		
		КонецЕсли;
		
		Если Проводка.СчетДт.Валютный Тогда
			Проводка.ВалютаДт = ПараметрыЗакрытия.ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = ПараметрыЗакрытия.ДоходРасход;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоКт.Договоры = ПараметрыЗакрытия.СчетДоверительногоУправления;
		
		Проводка.Партия = ПараметрыЗакрытия.Партия;
		Проводка.СтрокаПартии = ПараметрыЗакрытия.СтрокаПартии;
	
	ИначеЕсли ПараметрыЗакрытия.ДоходРасход < 0 Тогда
						
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], -ПараметрыЗакрытия.ДоходРасход, "Закрытие расхода");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоДт.Договоры = ПараметрыЗакрытия.СчетДоверительногоУправления;
		
		// кредит
		Проводка.СчетКт = ПараметрыЗакрытия.СчетРасходов;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПараметрыЗакрытия.АналитикаРасходов;
		Проводка.СубконтоКт.ЦенныеБумаги         = ПараметрыЗакрытия.ЦеннаяБумага;
		
		Проводка.Партия = ПараметрыЗакрытия.Партия;
		Проводка.СтрокаПартии = ПараметрыЗакрытия.СтрокаПартии;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт = ПараметрыЗакрытия.ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = -ПараметрыЗакрытия.ДоходРасход;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗакрытьРасходы(ОбъектДокумента, ПараметрыСписания, Отказ) Экспорт

	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	ТаблицаДоговоров = ПараметрыСписания.ТаблицаДоговоров;
	ВидЗадолженности = ПараметрыСписания.ВидЗадолженности;
	ВалютаОперации 	 = ?(ПараметрыСписания.Свойство("ВалютаОперации"), ПараметрыСписания.ВалютаОперации, Неопределено);
	
	ПараметрыСписания.Вставить("ОбъектДокумента", ОбъектДокумента);
	ПараметрыСписания.Вставить("ВалютаОперации", ВалютаОперации);
	
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимДоходам Тогда
		СодержаниеОперации = "Закрытие доходов";
	Иначе
		СодержаниеОперации = "Закрытие расходов";
	КонецЕсли; 
	
	Выборка = ПолучитьВыборкуДляЗакрытияРасходов(ПараметрыСписания);
	
	Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда
		
		ГруппаФинансовогоУчетаДоходовРасходов = ПараметрыСписания.ГруппаФинансовогоУчетаДоходовРасходов;
		
		Пока Выборка.Следующий() Цикл
			
			ВалютнаяСумма = Мин(Выборка.Сумма, Выборка.ВалютнаяСуммаОстаток);
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВалютнаяСумма, ВалютаОперации, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
			
			Если СуммаОперации <= 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, СодержаниеОперации);
			
			//дебет
			Проводка.СчетДт 				= ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры 	= УчетныйСчетДоверительногоУправления;
			
			// кредит
			Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии ИЛИ ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия) Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ГруппаФинансовогоУчетаДоходовРасходов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана группа финансового учета доходов и расходов!", ОбъектДокумента.Ссылка, "ГруппыФинансовогоУчетаДоходовРасходов",, Отказ);
				Возврат;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(ГруппаФинансовогоУчетаДоходовРасходов.НомерСчетаБухгалтерскогоУчета);
			КонецЕсли; 
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
			
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата") Тогда	
		
		Пока Выборка.Следующий() Цикл
			
			ГруппаФинансовогоУчетаДоходовРасходов = Выборка.ГруппаФинансовогоУчетаДоходовРасходов;
			
			Если Не ЗначениеЗаполнено(ГруппаФинансовогоУчетаДоходовРасходов) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана группа финансового учета доходов и расходов!", ОбъектДокумента.Ссылка, "ГруппыФинансовогоУчетаДоходовРасходов",, Отказ);
				Возврат;	
			КонецЕсли; 
			
			СчетДоходовРасходов = ПланыСчетов.Единый.НайтиПоКоду(ГруппаФинансовогоУчетаДоходовРасходов.НомерСчетаБухгалтерскогоУчета);
			
			ВалютнаяСумма = Мин(Выборка.Сумма, Выборка.ВалютнаяСуммаОстаток);
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВалютнаяСумма, Выборка.Валюта, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
			
			Если СуммаОперации <= 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, СодержаниеОперации);
			
			Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимДоходам Тогда
				//дебет
				Проводка.СчетДт 				= СчетДоходовРасходов;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
				
				// кредит
				Проводка.СчетКт 				= ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры 	= УчетныйСчетДоверительногоУправления;
			Иначе
				//дебет
				Проводка.СчетДт 				= ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры 	= УчетныйСчетДоверительногоУправления;
				
				Проводка.СчетКт					 = СчетДоходовРасходов;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗакрытьПарныеСчетаДоходовРасходов(ОбъектДокумента, МассивУчетныхАктивов, ЗакрыватьПереоценки, ЗакрыватьКорректировкиЭСП, МассивЦенныхБумаг = Неопределено, Отказ) Экспорт

	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ОбъектДокумента.Дата, ОбъектДокумента.Организация, УчетныйСчетДоверительногоУправления);
	
	Если НастройкиУчета.НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОстатков = Неопределено;
	ЕстьСвойствоТаблицаОстатков = ОбъектДокумента.ДополнительныеСвойства.Свойство("ТаблицаОстатковПоПарнымСчетамДоходовРасходов", ТаблицаОстатков);
	Если НЕ ЕстьСвойствоТаблицаОстатков Тогда
		ТаблицаОстатков = ПолучитьТаблицуОстатковПоПарнымСчетамДоходовРасходов(Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая),
																				ОбъектДокумента.Организация, 
																				УчетныйСчетДоверительногоУправления,
																				ЗакрыватьПереоценки,
																				ЗакрыватьКорректировкиЭСП,
																				МассивУчетныхАктивов,
																				МассивЦенныхБумаг,
																				ОбъектДокумента.Ссылка);
		Если ТаблицаОстатков = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ВидСубконтоГФУДоходовРасходов = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов;
	ВидСубконтоЦенныеБумаги = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;
	
	Движения = ОбъектДокумента.Движения;
	НаборЗаписей = Движения.ЕдиныйБухгалтерскийУчет;
	
	Если ОбъектДокумента.ДополнительныеСвойства.Свойство("ЗаписьВСоставеФБУ") И ОбъектДокумента.ДополнительныеСвойства.ЗаписьВСоставеФБУ Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьВСоставеФБУ", Истина);
	КонецЕсли;
	
	НаборЗаписей.Записать();
		
	ВсегоЗаписей = НаборЗаписей.Количество();
	ТекИндекс = 0;
	
	ПараметрыОбработки = Новый Структура;
		
	ПараметрыОбработки.Вставить("ОбъектДокумента", 	ОбъектДокумента);
	ПараметрыОбработки.Вставить("НаборЗаписей", 	НаборЗаписей);
	ПараметрыОбработки.Вставить("ВидСубконтоГФУДоходовРасходов", 	ВидСубконтоГФУДоходовРасходов);
	ПараметрыОбработки.Вставить("ВидСубконтоЦенныеБумаги", 			ВидСубконтоЦенныеБумаги);
	
	// заглушка для валютных операций
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	
	Пока ТекИндекс < ВсегоЗаписей Цикл
	
		Запись = НаборЗаписей[ТекИндекс];
		
		// дебет
		УвеличениеОстатка 		= (Запись.СчетДт.Вид = ВидСчета.Активный);
		ПостфиксОстатка 		= ?(УвеличениеОстатка, "А", "П");
		ПостфиксПарногоОстатка 	= ?(УвеличениеОстатка, "П", "А");
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Счет" + ПостфиксОстатка, 		Запись.СчетДт);
		СтруктураОтбора.Вставить("Аналитика" + ПостфиксОстатка, Запись.СубконтоДт[ВидСубконтоГФУДоходовРасходов]);
		СтруктураОтбора.Вставить("ЦеннаяБумага", 				Запись.СубконтоДт[ВидСубконтоЦенныеБумаги]);
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтруктураОтбора.Вставить("ЦеннаяБумага", Неопределено);
			НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 1 Тогда
				НоваяСтрока = ТаблицаОстатков.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
				НайденныеСтроки[0].ЦеннаяБумага = Запись.СубконтоДт[ВидСубконтоЦенныеБумаги];
			КонецЕсли; 
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			// заглушка для валютных операций
			Если Запись.СчетДт.Валютный И Запись.ВалютаДт <> ВалютаУчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В проводке №" + Строка(ТекИндекс + 1) + " валюта дебета отличается от валюты учета. Обработка парных счетов доходов/расходов для этой проводки не выполнена", ОбъектДокумента.Ссылка);
				Продолжить;
			КонецЕсли; 
		
			СтрокаОстатков = НайденныеСтроки[0];
			ПараметрыОбработки.Вставить("СтрокаОстатков", 		СтрокаОстатков);
			ПараметрыОбработки.Вставить("Запись", 				Запись);
			ПараметрыОбработки.Вставить("УвеличениеОстатка", 	УвеличениеОстатка);
			ПараметрыОбработки.Вставить("ПостфиксСчета", 		"Дт");
			ПараметрыОбработки.Вставить("ПостфиксОстатка", 		ПостфиксОстатка);
			ПараметрыОбработки.Вставить("ПостфиксПарногоСчета", "Кт");
			ПараметрыОбработки.Вставить("ПостфиксПарногоОстатка", ПостфиксПарногоОстатка);
			
			Если СтрокаОстатков.ЭтоКорректировка Тогда
				РезультатРаботы	= ОбработатьЗаписьПоСчетамКорректировок(ПараметрыОбработки);
			Иначе
				РезультатРаботы	= ОбработатьЗаписьПоСчетамПереоценки(ПараметрыОбработки);			
			КонецЕсли; 

			// если добавляли проводку, то:
			// 	сдвигаем ее назад, чтобы была после текущей
			// 	увеличиваем ВсегоЗаписей
			//	встаем на нее - увеличиваем ТекИндекс
			//
			// Мы делаем это потому, что нам очень ВАЖЕН ПОРЯДОК ПРОВОДОК 
			// и процедура ОбработатьДвиженияДокументаПоПарнымСчетам, которую мы вызываем после этой может отработать неправильно
			
			Если РезультатРаботы.ДобавилиПроводку Тогда
				НаборЗаписей.Сдвинуть(НаборЗаписей[ВсегоЗаписей], ТекИндекс - ВсегоЗаписей + 1);
				
				ВсегоЗаписей = ВсегоЗаписей + 1; 
				ТекИндекс = ТекИндекс + 1;
			КонецЕсли;

			Если РезультатРаботы.ДобавилиПроводкуЗакрытия Тогда
				НаборЗаписей.Сдвинуть(НаборЗаписей[ВсегоЗаписей], ТекИндекс - ВсегоЗаписей + 1);
				
				ВсегоЗаписей = ВсегоЗаписей + 1;
				ТекИндекс = ТекИндекс + 1;
			КонецЕсли;
			
		ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
			ВызватьИсключение "Ошибка при определении остатков по счетам доходов и расходов.";
		КонецЕсли;
		
		
		// кредит
		УвеличениеОстатка 		= (Запись.СчетКт.Вид = ВидСчета.Пассивный);
		ПостфиксОстатка 		= ?(УвеличениеОстатка, "П", "А");
		ПостфиксПарногоОстатка 	= ?(УвеличениеОстатка, "А", "П");
				
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Счет" + ПостфиксОстатка, 		Запись.СчетКт);
		СтруктураОтбора.Вставить("Аналитика" + ПостфиксОстатка, Запись.СубконтоКт[ВидСубконтоГФУДоходовРасходов]);
		СтруктураОтбора.Вставить("ЦеннаяБумага", 				Запись.СубконтоКт[ВидСубконтоЦенныеБумаги]);
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтруктураОтбора.Вставить("ЦеннаяБумага", Неопределено);
			НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 1 Тогда
				НоваяСтрока = ТаблицаОстатков.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
				НайденныеСтроки[0].ЦеннаяБумага = Запись.СубконтоКт[ВидСубконтоЦенныеБумаги];
			КонецЕсли; 
		КонецЕсли;
		
		РезультатРаботы	= Неопределено;
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			// заглушка для валютных операций
			Если Запись.СчетКт.Валютный И Запись.ВалютаКт <> ВалютаУчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В проводке №" + ТекИндекс + " валюта кредита отличается от валюты учета. Обработка парных счетов доходов/расходов для этой проводки не выполнена", ОбъектДокумента.Ссылка);
				Продолжить;
			КонецЕсли;
			
			СтрокаОстатков = НайденныеСтроки[0];
			ПараметрыОбработки.Вставить("СтрокаОстатков", 		СтрокаОстатков);
			ПараметрыОбработки.Вставить("Запись", 				Запись);
			ПараметрыОбработки.Вставить("УвеличениеОстатка", 	УвеличениеОстатка);
			ПараметрыОбработки.Вставить("ПостфиксСчета", 		"Кт");
			ПараметрыОбработки.Вставить("ПостфиксОстатка", 		ПостфиксОстатка);
			ПараметрыОбработки.Вставить("ПостфиксПарногоСчета", "Дт");
			ПараметрыОбработки.Вставить("ПостфиксПарногоОстатка", ПостфиксПарногоОстатка);
			
			Если СтрокаОстатков.ЭтоКорректировка Тогда
				// обрабатываем как парные: если требуется - меняем счет в проводке,
				// если после этого ушли в минус - добавляем проводку по перебросу минуса на парный счет 
				// например 71005 был кр. остаток 90, документ пришел сюда с проводкой 71006-50156 на сумму 110
				// меняем счет на парный в исходной проводке, получаем 71005-50156 (110), в результате на 71005 оразуется дт. остаток 20
				// добавляем проводку 71006-71005 (20)
				РезультатРаботы	= ОбработатьЗаписьПоСчетамКорректировок(ПараметрыОбработки);
			Иначе
				// обрабатываем иначе: если требуется - меняем счет в проводке,
				// если после этого ушли в минус - корректируем сумму в этой проводке и добавляем такую же с парным счетом на разность
				// например 71503 был кр. остаток 90, документ пришел сюда с проводкой 71504-50131 на сумму 110
				// меняем счет на парный в исходной проводке, получаем 71503-50131, чтобы не уйти в минус меняем сумму на 90
				// добавляем проводку 71504-50131 (20)
				РезультатРаботы	= ОбработатьЗаписьПоСчетамПереоценки(ПараметрыОбработки);			
			КонецЕсли;
			
			// если добавляли проводку, то:
			// 	сдвигаем ее назад, чтобы была после текущей
			// 	увеличиваем ВсегоЗаписей
			//	встаем на нее - увеличиваем ТекИндекс
			//
			// Мы делаем это потому, что нам очень ВАЖЕН ПОРЯДОК ПРОВОДОК 
			// и процедура ОбработатьДвиженияДокументаПоПарнымСчетам, которую мы вызываем после этой может отработать неправильно
			
			Если РезультатРаботы.ДобавилиПроводку Тогда
				НаборЗаписей.Сдвинуть(НаборЗаписей[ВсегоЗаписей], ТекИндекс - ВсегоЗаписей + 1);
				
				ВсегоЗаписей = ВсегоЗаписей + 1;
				ТекИндекс = ТекИндекс + 1;
			КонецЕсли;
			
			Если РезультатРаботы.ДобавилиПроводкуЗакрытия Тогда
				НаборЗаписей.Сдвинуть(НаборЗаписей[ВсегоЗаписей], ТекИндекс - ВсегоЗаписей + 1);
				
				ВсегоЗаписей = ВсегоЗаписей + 1;
				ТекИндекс = ТекИндекс + 1;
			КонецЕсли;
			
		ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
			ВызватьИсключение "Ошибка при определении остатков по счетам доходов и расходов.";
		КонецЕсли;
		
		ТекИндекс = ТекИндекс + 1;		
		
	КонецЦикла; 
	
	Если ЕстьСвойствоТаблицаОстатков Тогда
		ОбъектДокумента.ДополнительныеСвойства.Вставить("ТаблицаОстатковПоПарнымСчетамДоходовРасходов", ТаблицаОстатков);
	КонецЕсли;
	
КонецПроцедуры

Процедура СписатьКурсовыеРазницы(ОбъектДокумента, Отказ) Экспорт
	
	//Возврат;
	ТаблицаСчетовИСубконто = Новый ТаблицаЗначений;
	
	
	СписокТиповСубконто = РаботаСМетаданнымиПовтИсп.ПолучитьСписокТиповСубконто();	
	
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	МассивДопАналитикиПоЦБ = Новый Массив;
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК Счет
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаРезервов
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКупона
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСчетовУчетаБумаг = РезультатЗапроса.Выгрузить();
	
	ТаблицаСчетовИСубконто.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Единый"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто1", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто2", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто3", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("ДополнительнаяАналитика", Новый ОписаниеТипов("СправочникСсылка.ДополнительныеАналитикиЛицевыхСчетов"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("СуммаВВалютеУчета", Новый ОписаниеТипов("Число"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	ВидыСубконто = Новый Массив;
	
	ДтКт = Новый Массив;
	ДтКт.Добавить("Дт");
	ДтКт.Добавить("Кт");
	
	Для Каждого Проводка из ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет Цикл
		Для Инд = 0 По ДтКт.ВГраница() Цикл
		
			// балансовые счета должны быть заполнены
			ТекДтКт = ДтКт[Инд];
			ТекСчет = Проводка["Счет" + ТекДтКт];
			ТекДопАналитика = Проводка["ДополнительнаяАналитика" + ТекДтКт];
			ТекВалюта = Проводка["Валюта" + ТекДтКт];
			//убираем счета учета ЦБ, курсовые по ним - на партиях
			Если НЕ ТекСчет.Валютный Тогда
				Продолжить;
			КонецЕсли;
			Если ТекВалюта = ВалютаУчета Тогда 
				Продолжить;
			КонецЕсли;
			Если ТаблицаСчетовУчетаБумаг.Найти(ТекСчет, "Счет") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если МассивДопАналитикиПоЦБ.Найти(ТекДопАналитика) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы = ТаблицаСчетовИСубконто.Добавить();
			СтрокаТаблицы.Счет = ТекСчет;
			
			СтрокаТаблицы.Субконто1 = Неопределено;
			СтрокаТаблицы.Субконто2 = Неопределено;
			СтрокаТаблицы.Субконто3 = Неопределено;
			
			// проверим заполнение субконто
			Для каждого СтрокаВидыСубконто Из ТекСчет.ВидыСубконто Цикл
				
				Если СтрокаВидыСубконто.ТолькоОбороты 
					Тогда Продолжить; 
				КонецЕсли;
				
				Если СтрокаВидыСубконто.НомерСтроки = 1 Тогда
					СтрокаТаблицы.Субконто1 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 2 Тогда
					СтрокаТаблицы.Субконто2 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 3 Тогда
					СтрокаТаблицы.Субконто3 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаТаблицы.ДополнительнаяАналитика = ТекДопАналитика;
			СтрокаТаблицы.СуммаВВалютеУчета = ?(ТекДтКт = "Кт", -1, 1) * Проводка.Сумма;
			СтрокаТаблицы.Сумма = ?(ТекДтКт = "Кт", -1, 1) * Проводка["ВалютнаяСумма" + ТекДтКт];
			СтрокаТаблицы.Валюта = ТекВалюта;

		КонецЦикла;		
	КонецЦикла;
	
	ТаблицаСчетовИСубконто.Свернуть("Счет,Субконто1,Субконто2,Субконто3,ДополнительнаяАналитика,Валюта", "СуммаВВалютеУчета,Сумма");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДвижений.Счет КАК Счет,
		|	ТаблицаДвижений.Субконто1 КАК Субконто1,
		|	ТаблицаДвижений.Субконто2 КАК Субконто2,
		|	ТаблицаДвижений.Субконто3 КАК Субконто3,
		|	ТаблицаДвижений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаДвижений.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	ТаблицаДвижений.Сумма КАК Сумма,
		|	ТаблицаДвижений.Валюта КАК Валюта
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	&ТаблицаДвижений КАК ТаблицаДвижений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДоДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, ЛицевойСчет.ДополнительнаяАналитика, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ТаблицаДвижений.Субконто2 = НЕОПРЕДЕЛЕНО
		|						И ТаблицаДвижений.Субконто3 = НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 <> НЕОПРЕДЕЛЕНО
		|	И (ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ЕСТЬ NULL
		|			ИЛИ ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = НЕОПРЕДЕЛЕНО)
		|	И (ЕдиныйБухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
		|			ИЛИ ЕдиныйБухгалтерскийУчетОстатки.Субконто3 = НЕОПРЕДЕЛЕНО)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО),
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДоДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, ЛицевойСчет.ДополнительнаяАналитика, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ТаблицаДвижений.Субконто2 <> НЕОПРЕДЕЛЕНО
		|						И ТаблицаДвижений.Субконто3 = НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 <> НЕОПРЕДЕЛЕНО
		|	И НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто2 <> НЕОПРЕДЕЛЕНО
		|	И (ЕдиныйБухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
		|			ИЛИ ЕдиныйБухгалтерскийУчетОстатки.Субконто3 = НЕОПРЕДЕЛЕНО)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО),
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДоДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, ЛицевойСчет.ДополнительнаяАналитика, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ТаблицаДвижений.Субконто2 <> НЕОПРЕДЕЛЕНО
		|						И ТаблицаДвижений.Субконто3 <> НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто1 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто1 <> НЕОПРЕДЕЛЕНО
		|	И НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто2 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто2 <> НЕОПРЕДЕЛЕНО
		|	И НЕ ЕдиныйБухгалтерскийУчетОстатки.Субконто3 ЕСТЬ NULL
		|	И ЕдиныйБухгалтерскийУчетОстатки.Субконто3 <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Остатки.Счет КАК Счет,
		|	Остатки.Счет.Вид КАК ВидСчета,
		|	Остатки.Субконто1 КАК Субконто1,
		|	Остатки.Субконто2 КАК Субконто2,
		|	Остатки.Субконто3 КАК Субконто3,
		|	Остатки.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ТаблицаДвижений.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	ТаблицаДвижений.Сумма КАК Сумма
		|ИЗ
		|	Остатки КАК Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДвижений КАК ТаблицаДвижений
		|		ПО Остатки.Счет = ТаблицаДвижений.Счет
		|			И Остатки.Субконто1 = ТаблицаДвижений.Субконто1
		|			И Остатки.Субконто2 = ТаблицаДвижений.Субконто2
		|			И Остатки.Субконто3 = ТаблицаДвижений.Субконто3
		|			И Остатки.ДополнительнаяАналитика = ТаблицаДвижений.ДополнительнаяАналитика
		|			И Остатки.Валюта = ТаблицаДвижений.Валюта";
	
	
	Запрос.Параметры.Вставить("Организация", ОбъектДокумента.Организация);
	Запрос.Параметры.Вставить("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	Запрос.Параметры.Вставить("ДоДокумента", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.Параметры.Вставить("ТаблицаДвижений", ТаблицаСчетовИСубконто);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидСубконтоЦеннаяБумага = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;
	
	//в результирующей таблице должно быть:
	//Дебетовые остатки остатки по активным счетам > 0, кредитовые остатки не обрабатываем. Кредитовый оборот по активному счету <0, 
	//Кредитовые остатки по пассивынм счетам >0, дебетовые остатки не обрабатываем
	//Процедура списывает курсовые разницы по счетам с остаткамив случае расхода (кредитовый оборот по активному счету и дебетовый - по пассивному).
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаКурсовойРазницы = 0;
		Если ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.Активный И ВыборкаДетальныеЗаписи.СуммаОстаток > 0 И ВыборкаДетальныеЗаписи.Сумма < 0
			ИЛИ ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.Пассивный И ВыборкаДетальныеЗаписи.СуммаОстаток < 0 И ВыборкаДетальныеЗаписи.Сумма > 0 Тогда
			СуммаКурсовойРазницы = ВыборкаДетальныеЗаписи.Сумма * ВыборкаДетальныеЗаписи.СуммаОстаток / ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток - ВыборкаДетальныеЗаписи.СуммаВВалютеУчета;
		КонецЕсли;
		
		Если СуммаКурсовойРазницы <> 0 ТОгда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ?(СуммаКурсовойРазницы<0,-1,1) * СуммаКурсовойРазницы, "Курсовая разница");
			
			ВалютаКурсовойРазницы 	= ВыборкаДетальныеЗаписи.Валюта;
			СчетКурсовойРазницы 	= ВыборкаДетальныеЗаписи.Счет;
			Субконто1				= ВыборкаДетальныеЗаписи.Субконто1;
			Субконто2				= ВыборкаДетальныеЗаписи.Субконто2;
			Субконто3				= ВыборкаДетальныеЗаписи.Субконто3;
			
			УчетКурсовойРазницы = ПолучитьСчетДоходаРасходаПоКурсовойРазнице(ОбъектДокумента, СчетКурсовойРазницы, Субконто1, Субконто2, Субконто3, ВыборкаДетальныеЗаписи.ДополнительнаяАналитика, ВалютаКурсовойРазницы, СуммаКурсовойРазницы, Отказ);			
			
			ВидСубконто1 = Неопределено;
			ВидСубконто2 = Неопределено;
			ВидСубконто3 = Неопределено;
			
			Для каждого СтрокаВидыСубконто Из СчетКурсовойРазницы.ВидыСубконто Цикл
				Если СтрокаВидыСубконто.НомерСтроки = 1 Тогда
					ВидСубконто1 = СтрокаВидыСубконто.ВидСубконто;
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 2 Тогда
					ВидСубконто2 = СтрокаВидыСубконто.ВидСубконто;
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 3 Тогда
					ВидСубконто3 = СтрокаВидыСубконто.ВидСубконто;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаКурсовойРазницы > 0 Тогда
				Если ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.Активный Тогда
					Проводка.СчетДт = СчетКурсовойРазницы;
					Если ЗначениеЗаполнено(Субконто1) Тогда
						Проводка.СубконтоДт[ВидСубконто1] = Субконто1;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто2) Тогда
						Проводка.СубконтоДт[ВидСубконто2] = Субконто2;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто3) Тогда
						Проводка.СубконтоДт[ВидСубконто3] = Субконто3;
					КонецЕсли;
					Проводка.ВалютаДт = ВалютаКурсовойРазницы;
					Проводка.ДополнительнаяАналитикаДт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитика;
					
					Проводка.СчетКт = УчетКурсовойРазницы.Счет;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
						Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаКурсовойРазницы);
					КонецЕсли;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
						Проводка.СубконтоКт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано списание курсовых разниц для пассивных счетов", ОбъектДокумента.Ссылка,,,Отказ);
				КонецЕсли;
			Иначе
				Если ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.Активный Тогда
					Проводка.СчетДт = УчетКурсовойРазницы.Счет;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
						Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаКурсовойРазницы);
					КонецЕсли;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
						Проводка.СубконтоДт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
					КонецЕсли;
					
					Проводка.СчетКт = СчетКурсовойРазницы;
					Если ЗначениеЗаполнено(Субконто1) Тогда
						Проводка.СубконтоКт[ВидСубконто1] = Субконто1;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто2) Тогда
						Проводка.СубконтоКт[ВидСубконто2] = Субконто2;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто3) Тогда
						Проводка.СубконтоКт[ВидСубконто3] = Субконто3;
					КонецЕсли;
					Проводка.ВалютаКт = ВалютаКурсовойРазницы;
					Проводка.ДополнительнаяАналитикаКт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитика;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано списание курсовых разниц для пассивных счетов", ОбъектДокумента.Ссылка,,,Отказ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УчестьПредварительныеЗатраты(ОбъектДокумента, Сделка, ВидСделки, УчетныйАктив, ЦеннаяБумага, КонтрагентПоКомиссии, ВалютаУчета, ТаблицаПредварительныхЗатрат, Отказ) 
	
	Для каждого СтрокаПредварительныеЗатраты Из ТаблицаПредварительныхЗатрат Цикл
	
		КПогашению 			= СтрокаПредварительныеЗатраты.Сумма;
		КПогашениюВал 		= СтрокаПредварительныеЗатраты.ВалютнаяСумма;
		
		Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, КПогашению, "Списание предварительных затрат");
			
			// дебет
			Если УчетныйАктив.ВключатьРасходыПоПокупкеВСтоимость Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
				
				Проводка.ВалютаДт  = СтрокаПредварительныеЗатраты.Валюта;
				Проводка.ВалютнаяСуммаДт = КПогашениюВал;
			Иначе
				Проводка.СчетДт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
				Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
			
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт        = СтрокаПредварительныеЗатраты.Валюта;
			Проводка.ВалютнаяСуммаКт = КПогашениюВал;
			
		ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, КПогашению, "Списание предварительных затрат");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
			
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт        = СтрокаПредварительныеЗатраты.Валюта;
			Проводка.ВалютнаяСуммаКт = КПогашениюВал;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ПереносПереоценкиСоСчетовДобавочногоКапиталаНаСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, ЦеннаяБумага, ВалютаУчета, ДоходРасход, Партия = Неопределено, СтрокаПартии = Неопределено) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления);
	
	// все наоборот из-за запроса с минусами в функции ОтнесениеНачисленныхДоходовНаАктивыВДУПоЦеннымБумагам
	// кто-то когда-то так сделал, с тех пор и живем, хотя его мотивы вполне понятны - он хотел, чтобы суммы на 715ХХ совпадали с партиями по знаку, но все равно путаюсь
	
	// ДоходРасход > 0 означает ОТРИЦАТЕЛЬНУЮ переоценку, которая отражается по ДЕБЕТУ на счете 106ХХ и мы делаем Дт:715ХХ - Кт:106ХХ - везде аналитики РАСХОДОВ
	Если ДоходРасход > 0 Тогда 

		СчетУчетаДоходовРасходовОтПереоценки = ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, Ложь);
		АналитикаПереноса = ОпределитьАналитикуПереноса(УчетныйАктив.АналитикаРасходовОтПереоценки);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ДоходРасход, "Перенос переоценки со счета добавочного капитала на счет доходов/расходов");
		
		Проводка.СчетДт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаПереноса;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаДт  = ВалютаУчета;
		Проводка.ВалютнаяСуммаДт = ДоходРасход;
		
		Проводка.СчетКт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтПереоценки;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаКт  = ВалютаУчета;
		Проводка.ВалютнаяСуммаКт = ДоходРасход;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ДоходРасход, "Перенос переоценки со счета добавочного капитала на счет доходов/расходов");
		
		Проводка.СчетДт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.СчетКт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаПереноса;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаКт  = ВалютаУчета;
		Проводка.ВалютнаяСуммаКт = ДоходРасход;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
	// ДоходРасход < 0 означает ПОЛОЖИТЕЛЬНУЮ переоценку, которая отражается по КРЕДИТУ на счете 106ХХ и мы делаем Дт:106ХХ - Кт:715ХХ - везде аналитики ДОХОДОВ
	ИначеЕсли ДоходРасход < 0 Тогда

		СчетУчетаДоходовРасходовОтПереоценки = ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив);
		АналитикаПереноса = ОпределитьАналитикуПереноса(УчетныйАктив.АналитикаДоходовОтПереоценки);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -ДоходРасход, "Перенос переоценки со счета добавочного капитала на счет доходов/расходов");
		
		Проводка.СчетДт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтПереоценки;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаДт = ВалютаУчета;
		Проводка.ВалютнаяСуммаДт = -ДоходРасход;
		
		Проводка.СчетКт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаПереноса;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаКт = ВалютаУчета;
		Проводка.ВалютнаяСуммаКт = -ДоходРасход;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -ДоходРасход, "Перенос переоценки со счета добавочного капитала на счет доходов/расходов");
		
		Проводка.СчетДт = СчетУчетаДоходовРасходовОтПереоценки;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаПереноса;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаДт = ВалютаУчета;
		Проводка.ВалютнаяСуммаДт = -ДоходРасход;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаДоходовОтОпераций;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		
		Если Партия <> Неопределено Тогда
		
			Проводка.Партия = Партия;	
			Проводка.СтрокаПартии = СтрокаПартии;	
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура НачислитьКомиссию(ОбъектДокумента, ПараметрыНачисления, Отказ) Экспорт
	
	ЦБ 										= ПараметрыНачисления.ЦБ;
	УчетныйАктив							= ПараметрыНачисления.УчетныйАктив;
	ВидСделки								= ПараметрыНачисления.ВидСделки;
	СуммаКомисии 							= ПараметрыНачисления.СуммаКомисии;
	ВалютаКомиссии 							= ПараметрыНачисления.ВалютаКомиссии;
	СуммаОперации 							= ПараметрыНачисления.СуммаОперации;
	ВидКомиссии 							= ПараметрыНачисления.ВидКомиссии;
	КонтрагентПоКомиссии					= ПараметрыНачисления.КонтрагентПоКомиссии;
	Контрагент								= ?(ПараметрыНачисления.Свойство("Контрагент"), ПараметрыНачисления.Контрагент, КонтрагентПоКомиссии);
	ДоговорПоКомиссии						= ?(ПараметрыНачисления.Свойство("ДоговорПоКомиссии"), ПараметрыНачисления.ДоговорПоКомиссии, Неопределено);
	ВключатьРасходыПоПокупкеВСтоимость 		= ?(ПараметрыНачисления.Свойство("ВключатьРасходыПоПокупкеВСтоимость", ВключатьРасходыПоПокупкеВСтоимость), ВключатьРасходыПоПокупкеВСтоимость, Ложь);
	ГруппаФинансовогоУчетаДоходовРасходов	= ?(ПараметрыНачисления.Свойство("ГруппаФинансовогоУчетаДоходовРасходов",ГруппаФинансовогоУчетаДоходовРасходов),ГруппаФинансовогоУчетаДоходовРасходов,Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка());
	Сделка									= ?(ПараметрыНачисления.Свойство("Сделка"), ПараметрыНачисления.Сделка, Неопределено);
	ПроводитьЧерезРасчеты					= ?(ПараметрыНачисления.Свойство("ПроводитьЧерезРасчеты"), ПараметрыНачисления.ПроводитьЧерезРасчеты, Истина);
	ПредварительныеЗатратыПоСделке 			= ?(ПараметрыНачисления.Свойство("ПредварительныеЗатратыПоСделке"), ПараметрыНачисления.ПредварительныеЗатратыПоСделке, Ложь);
	СуммаЧерезРасчеты						= ?(ПараметрыНачисления.Свойство("СуммаЧерезРасчеты"), ПараметрыНачисления.СуммаЧерезРасчеты, 0);
	СуммаЧерезРасчетыВал					= ?(ПараметрыНачисления.Свойство("СуммаЧерезРасчетыВал"), ПараметрыНачисления.СуммаЧерезРасчетыВал, 0);
	
	Если ЦБ = Неопределено и Сделка = Неопределено Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Поступление услуг");
		
		Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии ИЛИ ВидКомиссии.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия) Тогда
			Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГруппаФинансовогоУчетаДоходовРасходов) Тогда
			
			Проводка.СчетДт = ПланыСчетов.Единый.НайтиПоКоду(ГруппаФинансовогоУчетаДоходовРасходов.НомерСчетаБухгалтерскогоУчета);
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана группа финансового учета доходов и расходов!", ОбъектДокумента, "ГруппыФинансовогоУчетаДоходовРасходов",, Отказ);
			Возврат;
		
		КонецЕсли; 
		
		// кредит
		ДопАналитика = Неопределено;
		
		Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего
			ИЛИ ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда
			СчетУчетаЗадолженности 	= ПланыСчетов.Единый.АктивыВДУ03;
			СчетУчетаАвансов 		= ПланыСчетов.Единый.АктивыВДУ02; 			
			Если ОбъектДокумента.Дата > Дата(2020,5,1) Тогда
				Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
					ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего;
				ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда		
					ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего;
				КонецЕсли;
			Иначе 
				Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
					ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего;
				КонецЕсли;
			КонецЕсли;	
		Иначе
			СчетУчетаЗадолженности 			= ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами11;
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
			СчетУчетаАвансов 				= ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами12;
			
			Если ВидКомиссии = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария Тогда
				ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария;
			КонецЕсли;
			
			СчетУчетаКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(ОбъектДокумента.Дата, 
																					ОбъектДокумента.Организация, 
																					ОбъектДокумента.СчетДоверительногоУправления, 
																					ВидКомиссии, 
																					Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, 
																					"СчетУчета");
																					
			Если ЗначениеЗаполнено(СчетУчетаКомиссии) Тогда
			
				СчетУчетаЗадолженности = СчетУчетаКомиссии;	
				
				ЕстьСубконтоОснованиеРасчетов = (СчетУчетаЗадолженности.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
				
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОбъектДокумента.Ссылка;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЕстьСубконтоКонтрагенты 			= (СчетУчетаЗадолженности.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
		ЕстьСубконтоКонтрагентыАванс 		= (СчетУчетаАвансов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);

		Проводка.СчетКт  					= СчетУчетаЗадолженности;
		Проводка.ДополнительнаяАналитикаКт 	= ДопАналитика;
		
		Если (Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено) Тогда
			Проводка.СубконтоКт.Договоры 		= ДоговорПоКомиссии;
		КонецЕсли;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт  					= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт 			= СуммаКомисии;
		КонецЕсли;
		
		//Проверим на аванс. Пока только для вознаграждения.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаАвансов,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &ДоговорПоКомиссии
		|				И ЛицевойСчет.ДополнительнаяАналитика = &ДопАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки";
		
		Запрос.УстановитьПараметр("Организация", 					ОбъектДокумента.Организация);
		Запрос.УстановитьПараметр("Период", 						Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("СчетУчетаАвансов", 				СчетУчетаАвансов);
		Запрос.УстановитьПараметр("ДоговорПоКомиссии", 				ДоговорПоКомиссии);
		Запрос.УстановитьПараметр("ДопАналитика", 					ДопАналитика);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СуммаАвансаВВалюте = 0;
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			СуммаАвансаВВалюте 	= ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстатокДт;
		КонецЕсли;
			
		Если СуммаАвансаВВалюте > 0  Тогда
			
			Проводка 							= РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, Мин(СуммаАвансаВВалюте, СуммаКомисии), "Зачет аванса");
			Проводка.СчетДт 					= СчетУчетаЗадолженности;
			Проводка.ДополнительнаяАналитикаДт 	= ДопАналитика;
			Проводка.СубконтоДт.Договоры 		= ДоговорПоКомиссии;
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт  					= ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт 			= Мин(СуммаАвансаВВалюте, СуммаКомисии);
			КонецЕсли;
			Проводка.СчетКт 					= СчетУчетаАвансов;
			Проводка.ДополнительнаяАналитикаКт 	= ДопАналитика;
			Проводка.СубконтоКт.Договоры 		= ДоговорПоКомиссии;
			Если Проводка.СчетКт.Валютный Тогда
				Проводка.ВалютаКт  					= ВалютаКомиссии;
				Проводка.ВалютнаяСуммаКт 			= Мин(СуммаАвансаВВалюте, СуммаКомисии);
			КонецЕсли;
			Если ЕстьСубконтоКонтрагенты Тогда
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
			КонецЕсли;
			Если ЕстьСубконтоКонтрагентыАванс Тогда
				Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;		
			КонецЕсли; 
		ИначеЕсли ЕстьСубконтоКонтрагенты Тогда
			Проводка.СубконтоКт.Контрагенты 	= КонтрагентПоКомиссии;		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаСПФИ") Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Комиссия брокера");
		
		Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53105");
		Проводка.СубконтоДт.ЦенныеБумаги = ОбъектДокумента.Ссылка;
		
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты22;
		Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт = ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт = СуммаКомисии;
		
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаСВалютой") Тогда
		
		ВалютаСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сделка, "Валюта");
		
		КлиентДУ = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ОбъектДокумента.СчетДоверительногоУправления, ОбъектДокумента.Дата);
		
		Если КлиентДУ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ППА") И ОбъектДокумента.Дата < '20240731' Тогда
			
			ГФУ = Кэширование.ПолучитьГФУ_РасходовСделкамСВалютой(ВалютаСделки);
			
		ИначеЕсли ЗначениеЗаполнено(ГруппаФинансовогоУчетаДоходовРасходов) Тогда
			
			ГФУ = ГруппаФинансовогоУчетаДоходовРасходов;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана группа финансового учета доходов и расходов!", ОбъектДокумента, "ГруппыФинансовогоУчетаДоходовРасходов",, Отказ);
			Возврат;
		
		КонецЕсли; 
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Поступление услуг");
		
		Проводка.СчетДт = ПланыСчетов.Единый.НайтиПоКоду(ГФУ.НомерСчетаБухгалтерскогоУчета);
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
		
		// кредит
		Проводка.СчетКт  					= ПланыСчетов.Единый.Расчеты22;
		
		Проводка.СубконтоКт.Контрагенты 		= КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов 	= Сделка;
		
		Проводка.ВалютаКт  					= ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт 			= СуммаКомисии;
		
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		
		Если БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
									ОбъектДокумента.Дата, 
									ОбъектДокумента.Организация,
									ОбъектДокумента.СчетДоверительногоУправления,
									Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
									"МетодПризнанияРасходовПоСделкамРЕПО") = Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытииРЕПО Тогда
									
			// Методика Перечисления.МетодыПризнанияРасходовПоСделкам.ПриОткрытииРЕПО была сделана для счетов ДУ
			// "ГСК Югория АО" и "НПФ Достойное БУДУЩЕЕ  АО РОПС" 
			// клиенты были недовольны, что по торговой комиссии комиссии по РЕПО используются ОФР кредитных организаций (т.к. контрагент НЦК)
			// а по брокерской комиссии по РЕПО используются ОФР некредитных организаций (т.к. берется брокер БК)
			// и написали письма чтобы ОФРы были единые, поэтому теперь по сделкам РЕПО для этой методики берем контрагента по сделке РЕПО, а не брокера
			ГФУ = БухгалтерскийУчетЕПС.ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(Контрагент, ОбъектДокумента.Дата);
									
			// ПРИЗНАНИЕ КОМИССИИ
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Начисление брокерской комиссия");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы03;
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦБ;
			
			// кредит
			Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства18;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
			КонецЕсли;	
			
			
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт = ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаКомисии;
			
			// СВЕРНЕМ 18 и 19
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Признание брокерской комиссия");
			
			// дебет
			Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства18;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг18;
			КонецЕсли;	
			
			
			Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
			Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаДт = ВалютаКомиссии;
			Проводка.ВалютнаяСуммаДт = СуммаКомисии;
			
			// кредит
			Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСредства19;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19;
			КонецЕсли;	
			
			
			Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт = ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаКомисии;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера;
		
		КонецЕсли;
		
		// Новое веяние от Ани: неоплаченную комиссию все же проводим через предварительные расчеты
		Если ПроводитьЧерезРасчеты И НЕ ПредварительныеЗатратыПоСделке Тогда
			
			Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоТорговойКомиссии Тогда
				ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТорговаяКомиссия;
			ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
				ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера;
				
				// Хардкорд для ППА, еще 1 хардкод в модуле БухгалтерскийУчетЕПС
				ПризнаватьКомиссию = Ложь;
				
				МассивСчетовППА = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																							ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ППА"),
																							ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
																							ОбъектДокумента.Дата);
				
				ЭтоКлиентППА = (МассивСчетовППА.Найти(ОбъектДокумента.СчетДоверительногоУправления) <> Неопределено);
				
				Если ЭтоКлиентППА И ОбъектДокумента.Дата >= '20200622' И ОбъектДокумента.Дата < '20200701' Тогда
					ПризнаватьКомиссию = Истина;
				КонецЕсли;
				
				Если ПризнаватьКомиссию Тогда
				
					БухгалтерскийУчетЕПС.ПроводкиПризнанияКомиссииПоРЕПО(ОбъектДокумента, 
						Сделка,
						СуммаЧерезРасчеты,
						СуммаЧерезРасчетыВал,
						ВалютаКомиссии,
						Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО,
						ЦБ,
						Сделка.Контрагент,
						КонтрагентПоКомиссии,
						ДополнительнаяАналитика,
						Ложь);
						
				КонецЕсли;
				// конец хардкода
				
			Иначе
				ДополнительнаяАналитика = "";
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаЧерезРасчеты, ВидКомиссии.Наименование + " начисление");
			// дебет
			Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства19;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19;
			КонецЕсли;	
			
			
			Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
			Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			
			Проводка.ВалютаДт						= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаДт 				= СуммаЧерезРасчетыВал;
			
			Если ДополнительнаяАналитика <> "" Тогда
				Проводка.ДополнительнаяАналитикаДт = ДополнительнаяАналитика;
			КонецЕсли;
			
			// кредит
	 		Проводка.СчетКт 						= ПланыСчетов.Единый.Расчеты22;
			Проводка.СубконтоКт.Контрагенты 		= КонтрагентПоКомиссии;
			Проводка.СубконтоКт.ОснованиеРасчетов 	= Сделка;
			
			Проводка.ВалютаКт  						= ВалютаКомиссии;		
			Проводка.ВалютнаяСуммаКт 				= СуммаЧерезРасчетыВал;
			
			Если ДополнительнаяАналитика <> "" Тогда
				Проводка.ДополнительнаяАналитикаКт = ДополнительнаяАналитика;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Покупка и ПроводитьЧерезРасчеты Тогда
		
		Если ПредварительныеЗатратыПоСделке Тогда
			Проводка 	= РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ВидКомиссии.Наименование + " начисление");
			Проводка.СчетДт 						= ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
			Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
			Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			Проводка.ВалютнаяСуммаДт 				= СуммаКомисии;	
			Проводка.ВалютаДт  		 				= ВалютаКомиссии;
			
			ВалютнаяСуммаКт 						= СуммаКомисии;	
		Иначе
			
			Проводка 	= РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаЧерезРасчеты, ВидКомиссии.Наименование + " начисление");
			
			// дебет
			Если ВключатьРасходыПоПокупкеВСтоимость Тогда // это бумаги по а/с и в стоимость пойдет позднее
			
		 		Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
				
				Проводка.ВалютнаяСуммаДт		= СуммаЧерезРасчетыВал;
				Проводка.ВалютаДт				= ВалютаКомиссии;
				
			Иначе
				
				Проводка.СчетДт 					= УчетныйАктив.СчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ЦенныеБумаги 	= Цб;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
				
			КонецЕсли;
			
			ВалютнаяСуммаКт = СуммаЧерезРасчетыВал;
			
		КонецЕсли;
		
		// кредит
 		Проводка.СчетКт 						= ПланыСчетов.Единый.Расчеты22;
		Проводка.СубконтоКт.Контрагенты 		= КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов 	= Сделка;
		Проводка.ВалютаКт  						= ВалютаКомиссии;		
		Проводка.ВалютнаяСуммаКт 				= ВалютнаяСуммаКт;	
		
	ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Продажа и ПроводитьЧерезРасчеты Тогда
		//начисление комиссии
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации,  ВидКомиссии.Наименование + " начисление");
		
		// дебет
		Если ПредварительныеЗатратыПоСделке Тогда
			Проводка.СчетДт 					= ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
			Проводка.СубконтоДт.Контрагенты 	= КонтрагентПоКомиссии;
		Иначе
			Проводка.СчетДт 					= ПланыСчетов.Единый.ВыбытиеИРеализация10;
			Проводка.СубконтоДт.ЦенныеБумаги 	= ЦБ;
		КонецЕсли; 
		Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
		
		Если Проводка.СчетДт.Валютный Тогда
			Проводка.ВалютаДт  					= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаДт 			= СуммаКомисии;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт 						= ПланыСчетов.Единый.Расчеты22;
		Проводка.СубконтоКт.Контрагенты 		= КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов 	= Сделка;
		
		Проводка.ВалютаКт  			= ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт 	= СуммаКомисии;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОплатитьКомиссиюНаЦБ(ОбъектДокумента, ПараметрыСписания, Отказ) Экспорт
	
	ЦБ 						= ПараметрыСписания.ЦБ;
	УчетныйАктив			= ПараметрыСписания.УчетныйАктив;
	ВидСделки				= ПараметрыСписания.ВидСделки;
	СуммаКомисии 			= ПараметрыСписания.СуммаКомисии;
	ВалютаКомиссии 			= ПараметрыСписания.ВалютаКомиссии;
	СуммаОперации 			= ПараметрыСписания.СуммаОперации;
	ВидКомиссии 			= ПараметрыСписания.ВидКомиссии;
	КонтрагентПоКомиссии	= ПараметрыСписания.КонтрагентПоКомиссии;
	ДоговорПоКомиссии		= ?(ПараметрыСписания.Свойство("ДоговорПоКомиссии"), ПараметрыСписания.ДоговорПоКомиссии, Неопределено);
	НачислениеДокумент		= ?(ПараметрыСписания.Свойство("НачислениеДокумент"), ПараметрыСписания.НачислениеДокумент, Неопределено);
	СчетДС					= ПараметрыСписания.СчетДС;
	СубконтоДС				= ПараметрыСписания.СубконтоДС;
	ВидСубконтоДС 			= ПараметрыСписания.ВидСубконтоДС;
	ОплатаВДеньПокупки		= ?(ВидСделки = Перечисления.ВидыСделок.Покупка, ПараметрыСписания.ОплатаВДеньПокупки, Неопределено);
	Сделка					= ?(ПараметрыСписания.Свойство("Сделка"), ПараметрыСписания.Сделка, Неопределено);
	ОплатаВДеньПокупки		= ?(ПараметрыСписания.Свойство("ОплатаВДеньПокупки"), ПараметрыСписания.ОплатаВДеньПокупки, Ложь);
	ПроводитьЧерезРасчеты	= ?(ПараметрыСписания.Свойство("ПроводитьЧерезРасчеты"), ПараметрыСписания.ПроводитьЧерезРасчеты, Ложь);
	НачислениеВПрошломГоду  = ?(ПараметрыСписания.Свойство("НачислениеВПрошломГоду"), ПараметрыСписания.НачислениеВПрошломГоду, Ложь);
	ВключатьРасходыПоПокупкеВСтоимость		= ?(ПараметрыСписания.Свойство("ВключатьРасходыПоПокупкеВСтоимость", ВключатьРасходыПоПокупкеВСтоимость), ВключатьРасходыПоПокупкеВСтоимость, Ложь);
	ГруппаФинансовогоУчетаДоходовРасходов 	= ?(ПараметрыСписания.Свойство("ГруппаФинансовогоУчетаДоходовРасходов",ГруппаФинансовогоУчетаДоходовРасходов),ГруппаФинансовогоУчетаДоходовРасходов,Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка());
	ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты = ?(ПараметрыСписания.Свойство("ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты"), ПараметрыСписания.ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты, Ложь);
	НеОтражатьЗадолженностьПоБанковскойКомиссии	= ?(ПараметрыСписания.Свойство("НеОтражатьЗадолженностьПоБанковскойКомиссии"), ПараметрыСписания.НеОтражатьЗадолженностьПоБанковскойКомиссии, Ложь);
	ОтражатьПартииНаЛицевыхСчетах = ?(ПараметрыСписания.Свойство("ОтражатьПартииНаЛицевыхСчетах"), ПараметрыСписания.ОтражатьПартииНаЛицевыхСчетах, Ложь);
	Закрывать7ойРазделПриПоступленииДенежныхСредств = ?(ПараметрыСписания.Свойство("Закрывать7ойРазделПриПоступленииДенежныхСредств"), ПараметрыСписания.Закрывать7ойРазделПриПоступленииДенежныхСредств, Ложь);
	
	Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда 
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ОплатаВознагражденияУК;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего
		ИЛИ ВидКомиссии = Справочники.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ОплатаВозмещенияРасходовУК;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии
		ИЛИ ВидКомиссии.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия) Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.БанковскаяКомиссия;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоТорговойКомиссии Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия;
		Если Сделка <> Неопределено Тогда
			Если ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияРЕПО;
			ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Покупка Тогда	
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка;
			Иначе
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссия;
		Если Сделка <> Неопределено Тогда
			Если ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияРЕПО;
			ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Покупка Тогда	
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка;
			Иначе
				ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии  Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ДепозитарнаяКомиссия;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария  Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.НеобходимыеРасходыСпецДепозитария;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария  Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.РасходыПоВознаграждениюСпецДепозитария;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария  Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.РасходыПоУслугамДепозитария;
	ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария  Тогда
		ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.РасходыПоУслугамСпецДепозитария;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить вид движения денежных средств для вида задолженности """ + ВидКомиссии + """ в документе " + ОбъектДокумента);
	КонецЕсли;
	
	Если ЦБ = Неопределено Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Поступление услуг");
		//дебет
		ДопАналитика = Неопределено;
		
		Если (ВидКомиссии = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии 
				ИЛИ ВидКомиссии.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия))
			И НеОтражатьЗадолженностьПоБанковскойКомиссии Тогда
			
			Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГруппаФинансовогоУчетаДоходовРасходов;
			
		ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаСВалютой") Тогда
			
			Проводка.СчетДт  					= ПланыСчетов.Единый.Расчеты22;
			
			Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
			Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			
			Проводка.ВалютаДт  					= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаДт 			= СуммаКомисии;
			
		Иначе
			Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего 
				ИЛИ ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда		
				Проводка.СчетДт 		= ПланыСчетов.Единый.АктивыВДУ03;								
				Если ОбъектДокумента.Дата > Дата(2020,5,1) Тогда
					Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
						ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего;
					ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда		
						ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего;
					КонецЕсли;
				Иначе 
					Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
						ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего;
					КонецЕсли;
				КонецЕсли;	
				Проводка.ДополнительнаяАналитикаДт	= ДопАналитика;
			Иначе
				Проводка.СчетДт 				= ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами11;//АктивыВДУ03;//Расчеты07; - без привязки к ЦБ счет д.б. 47903 ?
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
				Проводка.ДополнительнаяАналитикаДт	= ДопАналитика;
				
				Если ВидКомиссии = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария Тогда
					ДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеСпецдепозитария;
					Проводка.ДополнительнаяАналитикаДт	= ДопАналитика;
				КонецЕсли;
				
				
				СчетУчетаКомиссии = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(ОбъектДокумента.Дата, 
																						ОбъектДокумента.Организация, 
																						ОбъектДокумента.СчетДоверительногоУправления, 
																						ВидКомиссии, 
																						Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, 
																						"СчетУчета");
																						
				Если ЗначениеЗаполнено(СчетУчетаКомиссии) Тогда
				
					Проводка.СчетДт = СчетУчетаКомиссии;	
					
					ЕстьСубконтоОснованиеРасчетов = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
					
					Если ЕстьСубконтоОснованиеРасчетов И НачислениеДокумент <> Неопределено Тогда
						
						Проводка.СубконтоДт.ОснованиеРасчетов = НачислениеДокумент;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если (Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено) Тогда
				Проводка.СубконтоДт.Договоры = ДоговорПоКомиссии;
			КонецЕсли;
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт  			= ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт 	= СуммаКомисии;
			КонецЕсли;
			
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт 					= СчетДС;
		Проводка.СубконтоКт[ВидСубконтоДС] 	= СубконтоДС;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств	= ВидДвиженияДенежныхСредств;
		
		Проводка.ВалютаКт  			= ВалютаКомиссии;
		Проводка.ВалютнаяСуммаКт 	= СуммаКомисии;
		
		Если НачислениеВПрошломГоду Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
			
			Если ВидКомиссии = Справочники.ВидыЗадолженности.ПоТорговойКомиссии Тогда
				ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТорговаяКомиссия;
			ИначеЕсли ВидКомиссии = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии Тогда
				ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КомиссияБрокера;
			Иначе
				ДополнительнаяАналитика = "";
			КонецЕсли;
			
			// ОПЛАТИТЬ
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ВидКомиссии.Наименование + " списание");
			
			// дебет
			Если ПроводитьЧерезРасчеты Тогда
				
				Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты22;
				
				Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
				
			Иначе			
				
				Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеСредства19;
				Иначе
					Проводка.СчетДт = ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг19;
				КонецЕсли;	
				
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
				
			КонецЕсли;
			
			Проводка.ВалютаДт = ВалютаКомиссии;
			Проводка.ВалютнаяСуммаДт = СуммаКомисии;
			
			Если ДополнительнаяАналитика <> "" Тогда
				Проводка.ДополнительнаяАналитикаДт = ДополнительнаяАналитика;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт 					= СчетДС;
			Проводка.СубконтоКт[ВидСубконтоДС] 	= СубконтоДС;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= ВидДвиженияДенежныхСредств;
			
			Проводка.ВалютаКт  			= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт 	= СуммаКомисии;
			
		ИначеЕсли ТипЗнч(ЦБ) = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты")
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦБ, "ТипПроизводногоФинансовогоИнструмента") = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Фьючерс Тогда // по этим по-другому
			
			// #381119 хардкод для Сафмара по фьючерсам т.к. непонятно пока какую делать настройку
			МассивСчетовСАФМАР = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
				ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"),
				ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
				ОбъектДокумента.Дата);

			ЭтоКлиентСАФМАР = (МассивСчетовСАФМАР.Найти(ОбъектДокумента.СчетДоверительногоУправления) <> Неопределено);
			
			
			Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				АналитикаКомиссии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
				АналитикаСделки = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
			Иначе
				АналитикаКомиссии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
				АналитикаСделки = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
			КонецЕсли;
			
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Поступление услуг");
			
			Если ЭтоКлиентСАФМАР Тогда // нормальные клиенты делают 2 проводки через Расчеты22, а Сафмар - 1, напрямую и по другим аналитикам
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.ПрочиеДоходыРасходы02;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ЦБ;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("53803");
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКомиссии;
				
			Иначе
				
				// дебет
				Проводка.СчетДт = УчетныйАктив.СчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ЦБ;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаКомиссии;
			
				// кредит
		 		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты22;
				
				Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
				Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
				
				Проводка.ВалютаКт = ВалютаКомиссии;		
				Проводка.ВалютнаяСуммаКт = СуммаКомисии;
				
					
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Брокерская комиссия списание");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты22;
				
				Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
				
				Проводка.ВалютаДт = ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт = СуммаКомисии;
				
			КонецЕсли;
		
			// кредит
			Проводка.СчетКт 					= СчетДС;
			
			Проводка.СубконтоКт[ВидСубконтоДС] 	= СубконтоДС;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= ВидДвиженияДенежныхСредств;
			
			Проводка.ВалютаКт = ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт = СуммаКомисии;
			
			
			Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
				
				// если мы этой сделкой только закрываем чужие сделки и не открываем новых то мы сразу же и закроем 7ой раздел 
				// ибо других прибылей/убытков по сделке не предполагается
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
					|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество
					|ПОМЕСТИТЬ ОткрытияКонтрактов
					|ИЗ
					|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
					|ГДЕ
					|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
					|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
					|
					|СГРУППИРОВАТЬ ПО
					|	БухПартииСрочныхКонтрактов.ЦеннаяБумага
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
					|	СделкаЦенныеБумаги.Количество КАК КоличествоСделка,
					|	РасходыПоСделкеОбороты.СуммаОборот КАК БрокерскаяКомиссия,
					|	ЕСТЬNULL(ОткрытияКонтрактов.Количество, 0) КАК Количество
					|ИЗ
					|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
					|		ЛЕВОЕ СОЕДИНЕНИЕ ОткрытияКонтрактов КАК ОткрытияКонтрактов
					|		ПО (ОткрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага),
					|	РегистрНакопления.РасходыПоСделке.Обороты(
					|			,
					|			&ОкончаниеПериода,
					|			Период,
					|			СчетДоверительногоУправления = &СчетДоверительногоУправления
					|				И Сделка = &Регистратор
					|				И Организация = &Организация
					|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоСделкеОбороты
					|ГДЕ
					|	СделкаЦенныеБумаги.Ссылка = &Регистратор";
				
				Запрос.УстановитьПараметр("Регистратор", Сделка);
				Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
				
				Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
				Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
				
				
				Создания = Запрос.Выполнить().Выгрузить();
				Для каждого СтрокаСоздания Из Создания Цикл
					
					Если СтрокаСоздания.Количество = 0 Тогда // мы не создавали новых партий
						
						УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаСоздания.ЦеннаяБумага, ОбъектДокумента.СчетДоверительногоУправления);
						
						//Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
						//	МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
						//КонецЕсли;
						
						// закроем 7ой раздел в части начисленной комиссии
						БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
							ОбъектДокумента,
							УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
							СтрокаСоздания.ЦеннаяБумага,
							УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
							ВалютаКомиссии,
							"Закрытие доначисления по переоценке фьючерса",
							АналитикаКомиссии,
							СтрокаСоздания.БрокерскаяКомиссия);
					
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЕсли;
			
		ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			Если ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты И ТипЗнч(Сделка) = Тип("ДокументСсылка.Сделка") Тогда // пошли сложности
				
				ПроводитьЧерезРасчеты = Ложь;
				
				Если Сделка.ОтложенноеИсполнение Тогда
					
					Если Сделка.РаздельноеИсполнение Тогда
						ДатаПоставки = Сделка.ДатаПоставки;
					Иначе
						ДатаПоставки = Сделка.ДатаИсполнения;
					КонецЕсли;
					
					Если ОплатаВДеньПокупки Тогда
						
						ПроводитьЧерезРасчеты = Ложь; // В день сделки - на предварительные
						ОплатаВДеньПокупки = Ложь;
						
					ИначеЕсли НачалоДня(ОбъектДокумента.Дата) < ДатаПоставки Тогда
						
						ПроводитьЧерезРасчеты = Ложь; // Между сделкой и исполнением - на предварительные
						
					ИначеЕсли НачалоДня(ОбъектДокумента.Дата) = ДатаПоставки Тогда
						
						ОплатаВДеньПокупки = Истина; // В день исполнения - на расходы
						//ВключатьРасходыПоПокупкеВСтоимость = Ложь; - это лишняя штука, ее быть не должно, я проверил: случаев Т+ + АС + "ОтражатьПре.." + Оплата в день исполнения не было до 25.1.23 где это вылезло по СНГ
						
					Иначе
						
						ПроводитьЧерезРасчеты = Истина; // После исполнения - на расчеты
						
					КонецЕсли;
					
				ИначеЕсли НЕ ОплатаВДеньПокупки Тогда // сделка Т0 и исполнение не в момент сделки т.е. позднее - значит нужно через расчеты
					
					ПроводитьЧерезРасчеты = Истина;
					
				КонецЕсли;
			
			КонецЕсли;
			
			//оплата комиссии
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ВидКомиссии.Наименование + " списание");
			// дебет
			Если ПроводитьЧерезРасчеты Тогда
				Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты22;
				Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			ИначеЕсли ОплатаВДеньПокупки Тогда
				Если ВключатьРасходыПоПокупкеВСтоимость Тогда
					Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты08;
					Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
					Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
				Иначе
					Проводка.СчетДт 											= УчетныйАктив.СчетУчетаРасходовОтОпераций;
					Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов 	= УчетныйАктив.АналитикаРасходовОтОпераций;
					Проводка.СубконтоДт.ЦенныеБумаги 							= ЦБ;
					
					Если ОтражатьПартииНаЛицевыхСчетах Тогда
					
						Проводка.Партия = Сделка;
						Проводка.СтрокаПартии = 1; // я понимаю, что это не совсем правильно, но у меня цейтнот - позже исправлю
					
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Проводка.СчетДт 						= ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
				Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			КонецЕсли;
			
			Если  ВключатьРасходыПоПокупкеВСтоимость ИЛИ НЕ ОплатаВДеньПокупки Тогда
				Проводка.ВалютаДт  			= ЦБ.ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт 	= РаботаСВалютами.ПересчетСуммыВВалюте(СуммаКомисии, ВалютаКомиссии, ОбъектДокумента.Дата, ЦБ.ВалютаНоминала, ОбъектДокумента.Дата, Отказ);
			ИначеЕсли ПроводитьЧерезРасчеты Тогда
				Проводка.ВалютаДт  			= ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт 	= СуммаКомисии;
			ИначеЕсли ОплатаВДеньПокупки И ВключатьРасходыПоПокупкеВСтоимость Тогда
				Проводка.ВалютаДт  = ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт = СуммаКомисии;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт 					= СчетДС;
			Проводка.СубконтоКт[ВидСубконтоДС] 	= СубконтоДС;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= ВидДвиженияДенежныхСредств;
			
			Проводка.ВалютаКт  			= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт 	= СуммаКомисии;
			
		ИначеЕсли ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			
			ВключатьРасходыПоПокупкеВСтоимость = Ложь; // у нас же продажа, какие расчеты?
			
			Если ОтражатьПредварительныеЗатратыПоСделкамТПлюсПоФактуОплаты И ТипЗнч(Сделка) = Тип("ДокументСсылка.Сделка") Тогда // пошли сложности
				
				ПроводитьЧерезРасчеты = Ложь;
				
				Если Сделка.ОтложенноеИсполнение Тогда
					
					Если Сделка.РаздельноеИсполнение Тогда
						ДатаПоставки = Сделка.ДатаПоставки;
					Иначе
						ДатаПоставки = Сделка.ДатаИсполнения;
					КонецЕсли;
					
					Если ОплатаВДеньПокупки Тогда
						
						ПроводитьЧерезРасчеты = Ложь; // В день сделки - на предварительные
						ОплатаВДеньПокупки = Ложь;
						
					ИначеЕсли НачалоДня(ОбъектДокумента.Дата) < ДатаПоставки Тогда 
						
						ПроводитьЧерезРасчеты = Ложь; // Между сделкой и исполнением - на предварительные
						ОплатаВДеньПокупки = Ложь;
						
					ИначеЕсли НачалоДня(ОбъектДокумента.Дата) = ДатаПоставки Тогда 
						
						ОплатаВДеньПокупки = Истина; // В день исполнения - на расходы
						ВключатьРасходыПоПокупкеВСтоимость = Истина;
						
					Иначе
						
						ПроводитьЧерезРасчеты = Истина; // После исполнения - на расчеты
						
					КонецЕсли;
					
				ИначеЕсли НЕ ОплатаВДеньПокупки Тогда // сделка Т0 и исполнение не в момент сделки т.е. позднее - значит нужно через расчеты
					
					ПроводитьЧерезРасчеты = Истина;
					
				КонецЕсли;
			
			КонецЕсли;
			
			//списание комиссии
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, ВидКомиссии.Наименование + " списание");
			
			// дебет
			Если ПроводитьЧерезРасчеты Тогда
				Проводка.СчетДт 						= ПланыСчетов.Единый.Расчеты22;
				Проводка.СубконтоДт.Контрагенты 		= КонтрагентПоКомиссии;
			Иначе
				Если ОплатаВДеньПокупки Тогда
					Проводка.СчетДт 					= ПланыСчетов.Единый.ВыбытиеИРеализация10;
					Проводка.СубконтоДт.Ценныебумаги 	= ЦБ;
				Иначе
					Проводка.СчетДт 					= ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
					Проводка.СубконтоДт.Контрагенты 	= КонтрагентПоКомиссии;
				КонецЕсли;
			КонецЕсли;
			
			Проводка.СубконтоДт.ОснованиеРасчетов 	= Сделка;
			
			Если Проводка.СчетДт.Валютный Тогда
				Проводка.ВалютаДт  			= ВалютаКомиссии;
				Проводка.ВалютнаяСуммаДт 	= СуммаКомисии;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт 					= СчетДС;
			Проводка.СубконтоКт[ВидСубконтоДС] 	= СубконтоДС;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= ВидДвиженияДенежныхСредств;
			
			Проводка.ВалютаКт  			= ВалютаКомиссии;
			Проводка.ВалютнаяСуммаКт 	= СуммаКомисии;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкиПокупкиПродажиЦеннойБумаги(ОбъектДокумента, Сделка, УчетныйРегистр, Отказ) Экспорт

	ЭтоСделка = (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Сделка"));
	ЭтоИсполнение = (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ИсполнениеОбязательствПоСделке"));
	ЭтоПоставка = (ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ПоставкаЦенныхБумаг"));
	
	РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сделка, "ВидСделки, Дата, Брокер, Контрагент, РасчетныйСчет, ВалютаСделки");
	
	НастройкиУчетаОбщие = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
		ОбъектДокумента.Дата,
		ОбъектДокумента.Организация,
		ОбъектДокумента.СчетДоверительногоУправления);

	Если ЭтоПоставка Тогда // никогда не закрывает 7ой раздел - это делает оплата
		Закрывать7ойРазделПриПоступленииДенежныхСредств = Ложь;
	Иначе
		Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления);
	КонецЕсли;

	ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектДокумента.Организация, "ВалютаУчета"); 
	
	НужнаТаблицаОстатков = Ложь;
	Если РеквизитыСделки.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		Для каждого СтрокаЦенныеБумаги Из ОбъектДокумента.ЦенныеБумаги Цикл
			Если СтрокаЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала <> ВалютаУчета  Тогда
				НужнаТаблицаОстатков = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыСделки.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		Контрагент 				= РеквизитыСделки.Брокер.ЮрФизЛицо;
		КонтрагентПоКомиссии	= РеквизитыСделки.Брокер.ЮрФизЛицо;
		СчетДС 					= ПланыСчетов.Единый.РасчетыСБрокерами02;
		
		ВидСубконтоДС	= ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоДС 		= БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ОбъектДокумента.СчетДоверительногоУправления, РеквизитыСделки.Брокер, РеквизитыСделки.Дата);
	Иначе
		Контрагент 				= РеквизитыСделки.Контрагент;
		КонтрагентПоКомиссии 	= РеквизитыСделки.Контрагент;
		Если Справочники.Банки.ЯвляетсяРезидентом(РеквизитыСделки.РасчетныйСчет.Банк, РеквизитыСделки.Дата) Тогда
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		
		ВидСубконтоДС 	= ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоДС		= РеквизитыСделки.РасчетныйСчет;
	КонецЕсли;
	
	Если ЭтоИсполнение ИЛИ ЭтоПоставка Тогда
		
		НужнаТаблицаПредварительныхЗатрат = Истина;
		НужнаТаблицаДвиженийПоГлавеГ = Истина;
		ПереоценкаБумагПриПродажеНаСчетахГлавыГ = НастройкиУчетаОбщие.ПереоцениватьБумагиПриПродажеНаСчетахГлавыГ И РеквизитыСделки.ВидСделки = Перечисления.ВидыСделок.Продажа;	
		
		КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ОбъектДокумента.Организация);
		Если РеквизитыСделки.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			СчетДСГлаваГ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
			СчетЦБГлаваГ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
		Иначе
			СчетДСГлаваГ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
			СчетЦБГлаваГ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ02);
		КонецЕсли;
		
		ПараметрыДляГлавыГ = Новый Структура("ПереоценкаБумагПриПродажеНаСчетахГлавыГ, СчетДСГлаваГ, СчетЦБГлаваГ", ПереоценкаБумагПриПродажеНаСчетахГлавыГ, СчетДСГлаваГ, СчетЦБГлаваГ);
		
	Иначе
		
		НужнаТаблицаПредварительныхЗатрат = Ложь;
		ПараметрыДляГлавыГ = Неопределено;
		
	КонецЕсли;
	
	// все запросы к данным строго тут!!! это нужно для дальнейших оптимизаций
	// в остальных местах строго формирование проводок и более ничего!
	ДанныеПартий = ПолучитьДвиженияДляФормированияПроводокПоТорговымОперациям(ОбъектДокумента, Сделка, Перечисления.ВидыУчета[УчетныйРегистр], НужнаТаблицаОстатков, НужнаТаблицаПредварительныхЗатрат, ПараметрыДляГлавыГ);
	
	ДвиженияПартий					= ДанныеПартий.ДвиженияПартий;
	ОстаткиПартий					= ДанныеПартий.ОстаткиПартий;
	ТаблицаНакладныхРасходов		= ДанныеПартий.ТаблицаНакладныхРасходов;
	ТаблицаДвиженийПоГлавеГ			= ДанныеПартий.ТаблицаДвиженийПоГлавеГ;
	ТаблицаПредварительныхЗатрат	= ДанныеПартий.ТаблицаПредварительныхЗатрат;
	АналитикаРезервов	= ДанныеПартий.АналитикаРезервов;
	
	Если ДвиженияПартий.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для документа не расчитаны партии!", ОбъектДокумента, "ДатаИсполнения",, Отказ);
		Возврат;
	КонецЕсли; 	

	ОбщаяСумма = ОбъектДокумента.ЦенныеБумаги.Итог("Сумма");
	ОбщаяСуммаКупона = ОбъектДокумента.ЦенныеБумаги.Итог("СуммаКупона");
	ОбщаяСуммаСделки = ОбщаяСумма + ОбщаяСуммаКупона;
	
	// внутри данной функции есть запрос, но он только для документа поставка, а их в ЕПСе практически нет
	СформироватьПроводкиНачалаСделки(ОбъектДокумента, Сделка, Контрагент, РеквизитыСделки.Дата, РеквизитыСделки.ВалютаСделки, ОбщаяСуммаСделки, ЭтоПоставка, ДвиженияПартий.Скопировать(, "ВалютаНоминала, СтоимостьПокупки, СтоимостьКупона"), Отказ);
	
	Если ЭтоИсполнение ИЛИ ЭтоПоставка Тогда
		СформироватьПроводкиПоГлавеГДляИсполненияИПоставки(ОбъектДокумента, РеквизитыСделки.ВалютаСделки, ОбщаяСумма, ПараметрыДляГлавыГ, ДвиженияПартий, ТаблицаДвиженийПоГлавеГ, Отказ)
	КонецЕсли;
	
	Если ЭтоСделка ИЛИ ЭтоИсполнение Тогда

		ПараметрыОплаты = Новый Структура;
		ПараметрыОплаты.Вставить("Сделка",			Сделка);
		ПараметрыОплаты.Вставить("СуммаТела",		ОбщаяСумма);
		ПараметрыОплаты.Вставить("СуммаКупона",		ОбщаяСуммаКупона);
		ПараметрыОплаты.Вставить("ВалютаСделки",	ОбъектДокумента.ВалютаСделки);
		ПараметрыОплаты.Вставить("СуммаТелаДС",		ПараметрыОплаты.СуммаТела);
		ПараметрыОплаты.Вставить("СуммаКупонаДС",	ПараметрыОплаты.СуммаКупона);
		ПараметрыОплаты.Вставить("ВалютаОплаты",	ОбъектДокумента.ВалютаСделки);
		ПараметрыОплаты.Вставить("Контрагент",		Контрагент);
		ПараметрыОплаты.Вставить("СчетДС",			СчетДС);
		ПараметрыОплаты.Вставить("СубконтоДС",		СубконтоДС);
		ПараметрыОплаты.Вставить("ВидСубконтоДС",	ВидСубконтоДС);
		СформироватьПроводкиОплатыПоСделке(ОбъектДокумента, ПараметрыОплаты, Отказ);
		
		Если ЭтоСделка Тогда
		
			ПараметрыКомиссии = Новый Структура("ВидСделки", РеквизитыСделки.ВидСделки);
			ПараметрыКомиссии.Вставить("ВалютаКомиссии", 		ОбъектДокумента.ВалютаТорговойКомиссии);
			ПараметрыКомиссии.Вставить("ВидКомиссии", 			Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
			ПараметрыКомиссии.Вставить("КонтрагентПоКомиссии", 	КонтрагентПоКомиссии);
			ПараметрыКомиссии.Вставить("ОплатаВДеньПокупки",	Истина);
			ПараметрыКомиссии.Вставить("Сделка",				Сделка);
			Если Не ОбъектДокумента.ОтложеннаяОплатаТорговойКомиссии Тогда
				ПараметрыКомиссии.Вставить("СчетДС", 		СчетДС);
				ПараметрыКомиссии.Вставить("СубконтоДС", 	СубконтоДС);
				ПараметрыКомиссии.Вставить("ВидСубконтоДС",	ВидСубконтоДС);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;

	БылаКорректировкаПППриПокупке = Ложь;
	
	МассивУчетныхАктивов = Новый Массив;
	МассивЦенныхБумаг = Новый Массив;
	
	Для Каждого СтрокаЦенныеБумаги Из ОбъектДокумента.ЦенныеБумаги Цикл
		
		ЦеннаяБумага = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Если МассивЦенныхБумаг.Найти(ЦеннаяБумага) = Неопределено Тогда
			МассивЦенныхБумаг.Добавить(ЦеннаяБумага);
		КонецЕсли;
		
		ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
		
		Если ЭтоСделка Тогда
			ТорговаяКомиссия	= СтрокаЦенныеБумаги.ТорговаяКомиссия;
		КонецЕсли;
		
		Сумма				= СтрокаЦенныеБумаги.Сумма;
		СуммаКупона			= СтрокаЦенныеБумаги.СуммаКупона;
		Количество			= СтрокаЦенныеБумаги.Количество;
		
		СуммаНакладныхРасходов				= 0;
		СуммаНакладныхРасходовВВалютеУчета	= 0;
		Для Каждого СтрокаНакладныхРасходов Из ТаблицаНакладныхРасходов Цикл
			СуммаСписанияРасходов = Окр(СтрокаНакладныхРасходов.Сумма * (Сумма + СуммаКупона) / ОбщаяСуммаСделки,2);
			СтрокаНакладныхРасходов.Сумма = СтрокаНакладныхРасходов.Сумма - СуммаСписанияРасходов;
			ДатаНачисления = СтрокаНакладныхРасходов.Период;
			СуммаНакладныхРасходов = СуммаНакладныхРасходов
										+ РаботаСВалютами.ПересчетСуммыВВалюте(
															СуммаСписанияРасходов,
															СтрокаНакладныхРасходов.Валюта,
															ДатаНачисления,
															ВалютаНоминала,
															ДатаНачисления,
															Отказ);
			СуммаНакладныхРасходовВВалютеУчета = СуммаНакладныхРасходовВВалютеУчета
										+ РаботаСВалютами.ПересчетСуммыВВалюте(
															СуммаСписанияРасходов,
															СтрокаНакладныхРасходов.Валюта,
															ДатаНачисления,
															ВалютаУчета,
															ДатаНачисления,
															Отказ);
		КонецЦикла;
		
		СтрокиВыборки = ДвиженияПартий.НайтиСтроки(Новый Структура("СтрокаКорзиныЦенныхБумаг", СтрокаЦенныеБумаги.СтрокаПартии));
		Для Каждого Выборка из СтрокиВыборки Цикл
			
			УчетныйАктив = Выборка.УчетныйАктивЕПС;
			Если МассивУчетныхАктивов.Найти(УчетныйАктив) = Неопределено Тогда
				МассивУчетныхАктивов.Добавить(УчетныйАктив);
			КонецЕсли;
			
			Если Выборка.Количество = 0 Тогда // движение перекурсовки или переоценки и начисления процентов перед покупкой или продажей
				СформироватьПроводкиПереоценки(ОбъектДокумента, Выборка, УчетныйАктив, ВалютаНоминала, ВалютаУчета, ОстаткиПартий, Отказ);
			Иначе				
				СуммаПартии				= Окр(Сумма				* Выборка.Количество / Количество,2);
				СуммаКупонаПартии		= Окр(СуммаКупона		* Выборка.Количество / Количество,2);
				
				СуммаНакладныхРасходовПартии				= Окр(СуммаНакладныхРасходов				* Выборка.Количество / Количество,2);
				СуммаНакладныхРасходовПартииВВалютеУчета	= Окр(СуммаНакладныхРасходовВВалютеУчета	* Выборка.Количество / Количество,2);
				
				Если ЭтоСделка Тогда
					ТорговаяКомиссияПартии	= Окр(ТорговаяКомиссия	* Выборка.Количество / Количество,2);
					ТорговаяКомиссия	= ТорговаяКомиссия - ТорговаяКомиссияПартии;
					СуммаТорговойКомиссии = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТорговаяКомиссияПартии, ОбъектДокумента.ВалютаТорговойКомиссии, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
					ПараметрыКомиссии.Вставить("ЦБ", 									ЦеннаяБумага);
					ПараметрыКомиссии.Вставить("УчетныйАктив", 							УчетныйАктив);
					ПараметрыКомиссии.Вставить("СуммаКомисии", 							ТорговаяКомиссияПартии);
					ПараметрыКомиссии.Вставить("ВалютаКомиссии", 						ОбъектДокумента.ВалютаТорговойКомиссии);
					ПараметрыКомиссии.Вставить("СуммаОперации", 						СуммаТорговойКомиссии);
					ПараметрыКомиссии.Вставить("ВключатьРасходыПоПокупкеВСтоимость", 	УчетныйАктив.ВключатьРасходыПоПокупкеВСтоимость);
				
					// начисляем комиссию если оплата отложенная или по настройке всегда начислять
					Если ОбъектДокумента.ОтложеннаяОплатаТорговойКомиссии ИЛИ НастройкиУчетаОбщие.ПроводитьКомиссиюПоСделкамЧерезСчетаРасчетов Тогда
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчеты", 		СуммаТорговойКомиссии);
						ПараметрыКомиссии.Вставить("СуммаЧерезРасчетыВал", 		ТорговаяКомиссияПартии);
						ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты", 	Истина);
						НачислитьКомиссию(ОбъектДокумента, ПараметрыКомиссии, Отказ);
					КонецЕсли;
					
					// оплачиваем если надо
					Если НЕ ОбъектДокумента.ОтложеннаяОплатаТорговойКомиссии Тогда
						ПараметрыКомиссии.Вставить("ПроводитьЧерезРасчеты", НастройкиУчетаОбщие.ПроводитьКомиссиюПоСделкамЧерезСчетаРасчетов);
						ПараметрыКомиссии.Вставить("Закрывать7ойРазделПриПоступленииДенежныхСредств",	Закрывать7ойРазделПриПоступленииДенежныхСредств);
						ОплатитьКомиссиюНаЦБ(ОбъектДокумента,ПараметрыКомиссии, Отказ);
					КонецЕсли;
				КонецЕсли;
				
				Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
						НастройкиУчетаОбщие,
						ЦеннаяБумага,
						УчетныйАктив,
						Выборка.Партия,
						Выборка.СтрокаПартии);
					СформироватьПроводкиПокупки(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Выборка, УчетныйАктив, ВалютаНоминала, НастройкиУчетаЦеннойБумаги, Сделка, Контрагент);
					Если Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета <> 0 Тогда
						БылаКорректировкаПППриПокупке = Истина;
					КонецЕсли;
				Иначе
					СформироватьПроводкиПродажи(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], Выборка, УчетныйАктив, ВалютаНоминала, ВалютаУчета, 
						Сделка, Контрагент, СуммаПартии, СуммаКупонаПартии, СуммаНакладныхРасходовПартии, СуммаНакладныхРасходовПартииВВалютеУчета, 
						Закрывать7ойРазделПриПоступленииДенежныхСредств, НастройкиУчетаОбщие.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов, АналитикаРезервов, Отказ);
				КонецЕсли;
				
				Сумма				= Сумма - СуммаПартии;
				СуммаКупона			= СуммаКупона - СуммаКупонаПартии;
				Количество			= Количество - Выборка.Количество;
				
				СуммаНакладныхРасходов				= СуммаНакладныхРасходов - СуммаНакладныхРасходовПартии;
				СуммаНакладныхРасходовВВалютеУчета	= СуммаНакладныхРасходовВВалютеУчета - СуммаНакладныхРасходовПартииВВалютеУчета;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоИсполнение ИЛИ ЭтоПоставка Тогда
			УчестьПредварительныеЗатраты(ОбъектДокумента, Сделка, РеквизитыСделки.ВидСделки, УчетныйАктив, ЦеннаяБумага, КонтрагентПоКомиссии, ВалютаУчета, ТаблицаПредварительныхЗатрат, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыСделки.ВидСделки = Перечисления.ВидыСделок.Продажа ИЛИ БылаКорректировкаПППриПокупке Тогда
		
		ОбработатьДвиженияДокументаПоПарнымСчетам(ОбъектДокумента, Отказ);	

		Если Закрывать7ойРазделПриПоступленииДенежныхСредств И НЕ БылаКорректировкаПППриПокупке Тогда
			ОтнесениеНачисленныхДоходовНаАктивыВДУПоЦеннымБумагам(ОбъектДокумента, ОбъектДокумента.ЦенныеБумаги, ОбъектДокумента.Рынок);
		КонецЕсли;
		
		ЗакрытьПарныеСчетаДоходовРасходов(ОбъектДокумента, МассивУчетныхАктивов, Истина, Истина, МассивЦенныхБумаг, Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьПроводкиПоГлавеГДляИсполненияИПоставки(ОбъектДокумента, ВалютаСделки, СуммаСделки, ПараметрыДляГлавыГ, ДвиженияПартий, ТаблицаДвиженийПоГлавеГ, Отказ)
	
	Если ПараметрыДляГлавыГ.ПереоценкаБумагПриПродажеНаСчетахГлавыГ Тогда
		
		СуммаСделкиРуб = Окр(РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата, Отказ), 2);
		
		СтоимостьСС = 0;
		СтоимостьССВВалютеУчета = 0;
		
		Для каждого СтрокаДвиженияПартий Из ДвиженияПартий Цикл
			
			Если СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			
				СтоимостьСС = СтоимостьСС
								+ СтрокаДвиженияПартий.Стоимость
								+ СтрокаДвиженияПартий.Переоценка
								+ СтрокаДвиженияПартий.ДисконтПремияНачисленный
								+ СтрокаДвиженияПартий.КорректировкаЭСП
								+ СтрокаДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
				СтоимостьССВВалютеУчета = СтоимостьССВВалютеУчета
								+ СтрокаДвиженияПартий.СтоимостьВВалютеУчета
								+ СтрокаДвиженияПартий.ПереоценкаВВалютеУчета
								+ СтрокаДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчета
								+ СтрокаДвиженияПартий.КорректировкаЭСПВВалютеУчета
								+ СтрокаДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
			
			КонецЕсли;
		
		КонецЦикла;
		
		СуммаДооценкиДоСуммыСделки = СуммаСделки - СтоимостьСС;
		СуммаДооценкиДоСуммыСделкиВВалютеУчета = СуммаСделкиРуб - СтоимостьССВВалютеУчета;
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицаДвиженийПоГлавеГ Из ТаблицаДвиженийПоГлавеГ Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СтрокаТаблицаДвиженийПоГлавеГ.Сумма, "Исполнение сделки");
		
		Проводка.СчетКт = СтрокаТаблицаДвиженийПоГлавеГ.СчетДт;
		Проводка.СчетДт = СтрокаТаблицаДвиженийПоГлавеГ.СчетКт;
		
		Если СтрокаТаблицаДвиженийПоГлавеГ.СчетДт = ПараметрыДляГлавыГ.СчетДСГлаваГ ИЛИ СтрокаТаблицаДвиженийПоГлавеГ.СчетДт = ПараметрыДляГлавыГ.СчетЦБГлаваГ Тогда
			
			// дебет
			Проводка.СчетКт = СтрокаТаблицаДвиженийПоГлавеГ.СчетДт;
			Проводка.СубконтоКт.ОснованиеРасчетов = СтрокаТаблицаДвиженийПоГлавеГ.СубконтоДт1;
			Если ЗначениеЗаполнено(СтрокаТаблицаДвиженийПоГлавеГ.СубконтоДт2) Тогда
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаТаблицаДвиженийПоГлавеГ.СубконтоДт2;
				Проводка.КоличествоКт = СтрокаТаблицаДвиженийПоГлавеГ.КоличествоДт;
			КонецЕсли;
			
			Проводка.ВалютаКт = СтрокаТаблицаДвиженийПоГлавеГ.ВалютаДт;
			Проводка.ВалютнаяСуммаКт = СтрокаТаблицаДвиженийПоГлавеГ.ВалютнаяСуммаДт;
			Проводка.ДополнительнаяАналитикаКт = СтрокаТаблицаДвиженийПоГлавеГ.ДополнительнаяАналитикаДт;
			
		Иначе
			
			// кредит
			Проводка.СчетДт = СтрокаТаблицаДвиженийПоГлавеГ.СчетКт;
			Проводка.СубконтоДт.ОснованиеРасчетов = СтрокаТаблицаДвиженийПоГлавеГ.СубконтоКт1;
			Если ЗначениеЗаполнено(СтрокаТаблицаДвиженийПоГлавеГ.СубконтоКт2) Тогда
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаТаблицаДвиженийПоГлавеГ.СубконтоКт2;
				Проводка.КоличествоДт = СтрокаТаблицаДвиженийПоГлавеГ.КоличествоКт;
			КонецЕсли;
			
			Проводка.ВалютаДт = СтрокаТаблицаДвиженийПоГлавеГ.ВалютаКт;
			Проводка.ВалютнаяСуммаДт = СтрокаТаблицаДвиженийПоГлавеГ.ВалютнаяСуммаКт;
			Проводка.ДополнительнаяАналитикаДт = СтрокаТаблицаДвиженийПоГлавеГ.ДополнительнаяАналитикаКт;
			
		КонецЕсли;
		
		Если ПараметрыДляГлавыГ.ПереоценкаБумагПриПродажеНаСчетахГлавыГ
			И СтрокаТаблицаДвиженийПоГлавеГ.Сумма <> СуммаСделкиРуб
			И (СтрокаТаблицаДвиженийПоГлавеГ.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги	
				ИЛИ СтрокаТаблицаДвиженийПоГлавеГ.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги) Тогда // это проводка сторнирования переоценки
			
				
			Если Проводка.СчетКт = ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01 Тогда 
			
				ОснованиеРасчетов = Проводка.СубконтоКт.ОснованиеРасчетов;
				ЦеннаяБумага = Проводка.СубконтоКт.ЦенныеБумаги;
				
				Проводка.Сумма = Проводка.Сумма - СуммаДооценкиДоСуммыСделкиВВалютеУчета;
				Проводка.ВалютнаяСуммаКт = Проводка.ВалютнаяСуммаКт - СуммаДооценкиДоСуммыСделки;
				
			Иначе
				
				ОснованиеРасчетов = Проводка.СубконтоДт.ОснованиеРасчетов;
				ЦеннаяБумага = Проводка.СубконтоДт.ЦенныеБумаги;
				
				Проводка.Сумма = Проводка.Сумма + СуммаДооценкиДоСуммыСделкиВВалютеУчета;
				Проводка.ВалютнаяСуммаДт = Проводка.ВалютнаяСуммаДт + СуммаДооценкиДоСуммыСделки;
				
			КонецЕсли;					
				
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, МатематическиеФункции.МодульЧисла(СуммаДооценкиДоСуммыСделкиВВалютеУчета), "Исполнение сделки");
			
			Если СуммаДооценкиДоСуммыСделкиВВалютеУчета > 0 Тогда
			
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				Проводка.СчетКт = ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01;
				Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
				Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
				
				Проводка.ВалютаКт = ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = СуммаДооценкиДоСуммыСделки;
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			
			Иначе
			
				Проводка.СчетДт = ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01;
				Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
				Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
				
				Проводка.ВалютаДт = ВалютаСделки;
				Проводка.ВалютнаяСуммаДт = -СуммаДооценкиДоСуммыСделки;
				Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
				
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьПроводкиОплатыПоСделке(ОбъектДокумента, ПараметрыОплаты, Отказ) Экспорт
	
	Сделка 			= ПараметрыОплаты.Сделка;
	СуммаТела 		= ПараметрыОплаты.СуммаТела;
	СуммаКупона 	= ПараметрыОплаты.СуммаКупона;
	ВалютаСделки 	= ПараметрыОплаты.ВалютаСделки;
	ВалютаОплаты 	= ПараметрыОплаты.ВалютаОплаты;
	Контрагент 		= ПараметрыОплаты.Контрагент;
	СчетДС 			= ПараметрыОплаты.СчетДС;
	СубконтоДС 		= ПараметрыОплаты.СубконтоДС;
	ВидСубконтоДС 	= ПараметрыОплаты.ВидСубконтоДС;
	
	СуммаОперацииТело = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаТела, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
	СуммаОперацииКупон = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупона, ВалютаСделки, ОбъектДокумента.Организация, ОбъектДокумента.Дата);
	
	Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперацииТело, "Оплата покупки");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
		
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаДт  = ВалютаСделки;
		Проводка.ВалютнаяСуммаДт = СуммаТела;
		
		// кредит
		Проводка.СчетКт = СчетДС;
		
		Проводка.СубконтоКт[ВидСубконтоДС] = СубконтоДС;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.Покупка;
		
		Проводка.ВалютаКт  = ВалютаОплаты;
		Проводка.ВалютнаяСуммаКт = СуммаТела;
		
		Если СуммаКупона <> 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперацииКупон, "Оплата покупки (купон)");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
			
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаДт  = ВалютаСделки;
			Проводка.ВалютнаяСуммаДт = СуммаКупона;
			
			// кредит
			Проводка.СчетКт = СчетДС;
			
			Проводка.СубконтоКт[ВидСубконтоДС] = СубконтоДС;
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.Покупка;
			
			Проводка.ВалютаКт  = ВалютаОплаты;
			Проводка.ВалютнаяСуммаКт = СуммаКупона;
			
		КонецЕсли;
		
	Иначе
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперацииТело, "Оплата продажи");
		
		// дебет
		Проводка.СчетДт = СчетДС;
		
		Проводка.СубконтоДт[ВидСубконтоДС] = СубконтоДС;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.Продажа;
		
		Проводка.ВалютаДт  = ВалютаОплаты;
		Проводка.ВалютнаяСуммаДт = СуммаТела;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
		
		Проводка.ВалютаКт  = ВалютаСделки;
		Проводка.ВалютнаяСуммаКт = СуммаТела;
		
		Если СуммаКупона <> 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаОперацииКупон, "Оплата продажи (купон)");
			
			// дебет
			Проводка.СчетДт = СчетДС;
			
			Проводка.СубконтоДт[ВидСубконтоДС] = СубконтоДС;
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.Продажа;
			
			Проводка.ВалютаДт  = ВалютаОплаты;
			Проводка.ВалютнаяСуммаДт = СуммаКупона;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
			
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
			
			Проводка.ВалютаКт  = ВалютаСделки;
			Проводка.ВалютнаяСуммаКт = СуммаКупона;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПроводкуКурсовойРазницы(ОбъектДокумента, ПараметрыКурсовойРазницы, Отказ) Экспорт
	
	СуммаКурсовойРазницы 	= ПараметрыКурсовойРазницы.СуммаКурсовойРазницы;
	Валюта 					= ПараметрыКурсовойРазницы.Валюта;
	Счет 					= ПараметрыКурсовойРазницы.Счет;
	ВидСчетаУчета			= ПараметрыКурсовойРазницы.ВидСчетаУчета;
	Субконто1				= ПараметрыКурсовойРазницы.Субконто1;
	Субконто2				= ПараметрыКурсовойРазницы.Субконто2;
	Субконто3				= ПараметрыКурсовойРазницы.Субконто3;
	ДополнительнаяАналитика = ПараметрыКурсовойРазницы.ДополнительнаяАналитика;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ?(СуммаКурсовойРазницы<0,-1,1) * СуммаКурсовойРазницы, "Курсовая разница");
	
	УчетКурсовойРазницы = БухгалтерскийУчетЕПС.ПолучитьСчетДоходаРасходаПоКурсовойРазнице(ОбъектДокумента, Счет, Субконто1, Субконто2, Субконто3, ДополнительнаяАналитика, Валюта, СуммаКурсовойРазницы, Отказ);			
	
	ВидСубконто1 = Неопределено;
	ВидСубконто2 = Неопределено;
	ВидСубконто3 = Неопределено;
	
	Для каждого СтрокаВидыСубконто Из Счет.ВидыСубконто Цикл
		Если СтрокаВидыСубконто.НомерСтроки = 1 Тогда
			ВидСубконто1 = СтрокаВидыСубконто.ВидСубконто;
		ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 2 Тогда
			ВидСубконто2 = СтрокаВидыСубконто.ВидСубконто;
		ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 3 Тогда
			ВидСубконто3 = СтрокаВидыСубконто.ВидСубконто;
		КонецЕсли;
	КонецЦикла;
	Если СуммаКурсовойРазницы > 0 И ВидСчетаУчета = ВидСчета.Активный
		ИЛИ СуммаКурсовойРазницы > 0 И ВидСчетаУчета = ВидСчета.Пассивный Тогда
		
			Проводка.СчетДт = Счет;
			Если ЗначениеЗаполнено(Субконто1) Тогда
				Проводка.СубконтоДт[ВидСубконто1] = Субконто1;
			ИначеЕсли ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоДт[ВидСубконто1] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			Если ЗначениеЗаполнено(Субконто2) Тогда
				Проводка.СубконтоДт[ВидСубконто2] = Субконто2;
			ИначеЕсли ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоДт[ВидСубконто2] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			Если ЗначениеЗаполнено(Субконто3) Тогда
				Проводка.СубконтоДт[ВидСубконто3] = Субконто3;
			ИначеЕсли ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоДт[ВидСубконто3] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			
			Проводка.ВалютаДт = Валюта;
			Проводка.ДополнительнаяАналитикаДт = ДополнительнаяАналитика;
			
			Проводка.СчетКт = УчетКурсовойРазницы.Счет;
			Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаКурсовойРазницы);
			КонецЕсли;
			Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
				Проводка.СубконтоКт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
			КонецЕсли;
			
	ИначеЕсли СуммаКурсовойРазницы < 0 И ВидСчетаУчета = ВидСчета.Активный 
		ИЛИ СуммаКурсовойРазницы < 0 И ВидСчетаУчета = ВидСчета.Пассивный Тогда
		
			Проводка.СчетДт = УчетКурсовойРазницы.Счет;
			Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаКурсовойРазницы);
			КонецЕсли;
			Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
				Проводка.СубконтоДт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
			КонецЕсли;
			
			Проводка.СчетКт = Счет;
			Если ЗначениеЗаполнено(Субконто1) Тогда
				Проводка.СубконтоКт[ВидСубконто1] = Субконто1;
			ИначеЕсли ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоКт[ВидСубконто1] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			Если ЗначениеЗаполнено(Субконто2) Тогда
				Проводка.СубконтоКт[ВидСубконто2] = Субконто2;
			ИначеЕсли ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоКт[ВидСубконто2] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			Если ЗначениеЗаполнено(Субконто3) Тогда
				Проводка.СубконтоКт[ВидСубконто3] = Субконто3;
			ИначеЕсли ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
				Проводка.СубконтоКт[ВидСубконто3] = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
			КонецЕсли;
			Проводка.ВалютаКт = Валюта;
			Проводка.ДополнительнаяАналитикаКт = ДополнительнаяАналитика;
			
	КонецЕсли;
		
	Если ПараметрыКурсовойРазницы.Свойство("Партия") Тогда
	
		Проводка.Партия = ПараметрыКурсовойРазницы.Партия;
		Проводка.СтрокаПартии = ПараметрыКурсовойРазницы.СтрокаПартии;
	
	КонецЕсли;	
		
		
КонецПроцедуры

Процедура ПереоценитьВалютныеАктивы(ОбъектДокумента, Отказ, ИсключитьЗабалансовуюЗадолженностьПоЦБПоРЕПО = Ложь) Экспорт
	
	МетодикаПерекурсовкиВалютныхАктивовИОбязательств = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "МетодикаПерекурсовкиВалютныхАктивовИОбязательств");
	
	Если МетодикаПерекурсовкиВалютныхАктивовИОбязательств = Перечисления.МетодикиПерекурсовкиВалютныхАктивовИОбязательств.ПереоцениватьВНачалеИКонцеДня Тогда
		Возврат;	
	КонецЕсли;
	
	Если ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Записывать Тогда
		ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Записать();
		ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Прочитать();
		ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	КонецЕсли;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления);
	
	ТаблицаСчетовИСубконто = Новый ТаблицаЗначений;
	
	СписокТиповСубконто = Новый Массив;
	
	Выборка = ПланыВидовХарактеристик.ВидыСубконто.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивТипов = Выборка.ТипЗначения.Типы();
		Для Каждого ТипИзМассива из МассивТипов Цикл
			Переменная = Новый(ТипИзМассива);
			ИмяТипа = Переменная.Метаданные().ПолноеИмя();
			ИмяТипа = СтрЗаменить(ИмяТипа, ".", "Ссылка.");
			Если СписокТиповСубконто.Найти(ИмяТипа) = Неопределено Тогда
				СписокТиповСубконто.Добавить(Тип(ИмяТипа));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ВалютаУчета = ОбъектДокумента.Организация.ВалютаУчета;
	МассивДопАналитикиПоЦБ = Новый Массив;
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
	МассивДопАналитикиПоЦБ.Добавить(Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК Счет
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаРезервов
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКупона
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСчетовУчетаБумаг = РезультатЗапроса.Выгрузить();
	
	ТаблицаСчетовИСубконто.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Единый"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто1", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто2", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Субконто3", Новый ОписаниеТипов(СписокТиповСубконто));
	ТаблицаСчетовИСубконто.Колонки.Добавить("ДополнительнаяАналитика", Новый ОписаниеТипов("СправочникСсылка.ДополнительныеАналитикиЛицевыхСчетов"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("СуммаВВалютеУчета", Новый ОписаниеТипов("Число"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаСчетовИСубконто.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	
	ТаблицаИсключаемыхСчетов = НеПерекурсовыватьСчета();
	ВидыСубконто = Новый Массив;
	
	ДтКт = Новый Массив;
	ДтКт.Добавить("Дт");
	ДтКт.Добавить("Кт");
	
	Для Каждого Проводка из ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет Цикл
		Для Инд = 0 По ДтКт.ВГраница() Цикл
		
			// балансовые счета должны быть заполнены
			ТекДтКт = ДтКт[Инд];
			ТекСчет = Проводка["Счет" + ТекДтКт];
			ТекДопАналитика = Проводка["ДополнительнаяАналитика" + ТекДтКт];
			ТекВалюта = Проводка["Валюта" + ТекДтКт];
			ТекЛицевойСчет = Проводка["ЛицевойСчет" + ТекДтКт];
			//убираем счета учета ЦБ, курсовые по ним - на партиях
			Если НЕ ТекСчет.Валютный Тогда
				Продолжить;
			КонецЕсли;
			Если ТекВалюта = ВалютаУчета Тогда 
				Продолжить;
			КонецЕсли;
			Если ТаблицаСчетовУчетаБумаг.Найти(ТекСчет, "Счет") <> Неопределено Тогда
				Если ЗначениеЗаполнено(ТекДопАналитика) Тогда
					Если МассивДопАналитикиПоЦБ.Найти(ТекДопАналитика) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СтрокиТаблицыИсключаемыхСчетов = ТаблицаИсключаемыхСчетов.НайтиСтроки(Новый Структура("Счет, ДополнительнаяАналитика", ТекСчет, ?(ЗначениеЗаполнено(ТекДопАналитика), ТекДопАналитика, Неопределено)));
			Если СтрокиТаблицыИсключаемыхСчетов.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСчет = ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами12 Тогда
				//это аванс				
				Если ТипЗнч(Проводка.Проводка["Субконто" + ТекДтКт].Договоры) = Тип("СправочникСсылка.Договоры") Тогда
					ВидДоговора = Проводка.Проводка["Субконто" + ТекДтКт].Договоры.ВидДоговора;
					Если ВидДоговора = Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания
						ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ОтветственногоХранения
						ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.ВеденияРеестра
						ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания
						ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ИсключитьЗабалансовуюЗадолженностьПоЦБПоРЕПО И ТекСчет = ПланыСчетов.Единый.ЦенныеБумагиПоРЕПО Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы = ТаблицаСчетовИСубконто.Добавить();
			СтрокаТаблицы.Счет = ТекСчет;
			
			СтрокаТаблицы.Субконто1 = Неопределено;
			СтрокаТаблицы.Субконто2 = Неопределено;
			СтрокаТаблицы.Субконто3 = Неопределено;
			
			// проверим заполнение субконто
			Для каждого СтрокаВидыСубконто Из ТекСчет.ВидыСубконто Цикл
				
				Если СтрокаВидыСубконто.ТолькоОбороты 
					Тогда Продолжить; 
				КонецЕсли;
				
				Если СтрокаВидыСубконто.НомерСтроки = 1 Тогда
					СтрокаТаблицы.Субконто1 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 2 Тогда
					СтрокаТаблицы.Субконто2 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 3 Тогда
					СтрокаТаблицы.Субконто3 = Проводка["Субконто" + ТекДтКт][СтрокаВидыСубконто.ВидСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаТаблицы.ДополнительнаяАналитика = ТекДопАналитика;
			СтрокаТаблицы.СуммаВВалютеУчета = ?(ТекДтКт = "Кт", -1, 1) * Проводка.Сумма;
			СтрокаТаблицы.Сумма = ?(ТекДтКт = "Кт", -1, 1) * Проводка["ВалютнаяСумма" + ТекДтКт];
			СтрокаТаблицы.Валюта = ТекВалюта;
			СтрокаТаблицы.ЛицевойСчет = ТекЛицевойСчет;

		КонецЦикла;		
	КонецЦикла;
	
	ТаблицаСчетовИСубконто.Свернуть("Счет,Субконто1,Субконто2,Субконто3,ДополнительнаяАналитика,Валюта,ЛицевойСчет", "СуммаВВалютеУчета,Сумма");
	Если ТаблицаСчетовИСубконто.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДвижений.Счет КАК Счет,
		|	ТаблицаДвижений.Субконто1 КАК Субконто1,
		|	ТаблицаДвижений.Субконто2 КАК Субконто2,
		|	ТаблицаДвижений.Субконто3 КАК Субконто3,
		|	ТаблицаДвижений.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ТаблицаДвижений.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	ТаблицаДвижений.Сумма КАК Сумма,
		|	ТаблицаДвижений.Валюта КАК Валюта,
		|	ТаблицаДвижений.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	&ТаблицаДвижений КАК ТаблицаДвижений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия КАК Партия,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии КАК СтрокаПартии,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ПослеДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, ЛицевойСчет, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.ЛицевойСчет КАК ЛицевойСчет,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ЕСТЬNULL(ТаблицаДвижений.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто2, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто3, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО),
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ПослеДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, Субконто2, ЛицевойСчет, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.Субконто2 КАК Субконто2,
		|						ТаблицаДвижений.ЛицевойСчет КАК ЛицевойСчет,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ЕСТЬNULL(ТаблицаДвижений.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто2, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто3, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО),
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ПослеДокумента,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ТаблицаДвижений.Счет КАК Счет
		|				ИЗ
		|					ТаблицаДвижений КАК ТаблицаДвижений),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И (Субконто1, Субконто2, Субконто3, ЛицевойСчет, Валюта) В
		|					(ВЫБРАТЬ
		|						ТаблицаДвижений.Субконто1 КАК Субконто1,
		|						ТаблицаДвижений.Субконто2 КАК Субконто2,
		|						ТаблицаДвижений.Субконто3 КАК Субконто3,
		|						ТаблицаДвижений.ЛицевойСчет КАК ЛицевойСчет,
		|						ТаблицаДвижений.Валюта КАК Валюта
		|					ИЗ
		|						ТаблицаДвижений КАК ТаблицаДвижений
		|					ГДЕ
		|						ЕСТЬNULL(ТаблицаДвижений.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто2, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|						И ЕСТЬNULL(ТаблицаДвижений.Субконто3, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО)) КАК ЕдиныйБухгалтерскийУчетОстатки
		|ГДЕ
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто1, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто2, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.Субконто3, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Остатки.Счет КАК Счет,
		|	Остатки.Счет.Вид КАК ВидСчета,
		|	Остатки.Субконто1 КАК Субконто1,
		|	Остатки.Субконто2 КАК Субконто2,
		|	Остатки.Субконто3 КАК Субконто3,
		|	Остатки.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
		|	Остатки.Партия КАК Партия,
		|	Остатки.СтрокаПартии КАК СтрокаПартии,
		|	Остатки.ЛицевойСчет КАК ЛицевойСчет,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаОстаток КАК СуммаОстаток,
		|	Остатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|	ТаблицаДвижений.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	ТаблицаДвижений.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(Остатки.ВалютнаяСуммаОстаток * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(19, 2)) КАК СуммаОстатокРасчетная
		|ИЗ
		|	Остатки КАК Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО Остатки.Валюта = КурсыВалют.Валюта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДвижений КАК ТаблицаДвижений
		|		ПО Остатки.Счет = ТаблицаДвижений.Счет
		|			И (ЕСТЬNULL(Остатки.Субконто1, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(ТаблицаДвижений.Субконто1, НЕОПРЕДЕЛЕНО))
		|			И (ЕСТЬNULL(Остатки.Субконто2, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(ТаблицаДвижений.Субконто2, НЕОПРЕДЕЛЕНО))
		|			И (ЕСТЬNULL(Остатки.Субконто3, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(ТаблицаДвижений.Субконто3, НЕОПРЕДЕЛЕНО))
		|			И Остатки.ЛицевойСчет = ТаблицаДвижений.ЛицевойСчет
		|			И Остатки.Валюта = ТаблицаДвижений.Валюта
		|ГДЕ
		|	КурсыВалют.Период = &Период
		|	И (ВЫРАЗИТЬ(Остатки.ВалютнаяСуммаОстаток * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЧИСЛО(19, 2))) <> Остатки.СуммаОстаток";
	
	
	Запрос.Параметры.Вставить("Организация", ОбъектДокумента.Организация);
	Запрос.Параметры.Вставить("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	Запрос.Параметры.Вставить("ПослеДокумента", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.Параметры.Вставить("Период", НачалоДня(ОбъектДокумента.Дата));
	Запрос.Параметры.Вставить("ТаблицаДвижений", ТаблицаСчетовИСубконто);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидСубконтоЦеннаяБумага = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;
	
	//в результирующей таблице должно быть:
	//Дебетовые остатки остатки по активным счетам > 0, кредитовые остатки не обрабатываем. Кредитовый оборот по активному счету <0, 
	//Кредитовые остатки по пассивынм счетам >0, дебетовые остатки не обрабатываем
	//Процедура списывает курсовые разницы по счетам с остаткамив случае расхода (кредитовый оборот по активному счету и дебетовый - по пассивному).
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаКурсовойРазницы = ВыборкаДетальныеЗаписи.СуммаОстатокРасчетная - ВыборкаДетальныеЗаписи.СуммаОстаток;
		
		Если (ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.Активный) 
			ИЛИ (ВыборкаДетальныеЗаписи.ВидСчета = ВидСчета.АктивноПассивный И ВыборкаДетальныеЗаписи.СуммаОстаток>0) ТОгда
			ВидСчетаУчета = ВидСчета.Активный;
		Иначе
			ВидСчетаУчета = ВидСчета.Пассивный;
		КонецЕсли;
		
		Если СуммаКурсовойРазницы <> 0 ТОгда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ?(СуммаКурсовойРазницы<0,-1,1) * СуммаКурсовойРазницы, "Курсовая разница");
			
			ВалютаКурсовойРазницы 	= ВыборкаДетальныеЗаписи.Валюта;
			СчетКурсовойРазницы 	= ВыборкаДетальныеЗаписи.Счет;
			Субконто1				= ВыборкаДетальныеЗаписи.Субконто1;
			Субконто2				= ВыборкаДетальныеЗаписи.Субконто2;
			Субконто3				= ВыборкаДетальныеЗаписи.Субконто3;
			
			УчетКурсовойРазницы = ПолучитьСчетДоходаРасходаПоКурсовойРазнице(ОбъектДокумента, СчетКурсовойРазницы, Субконто1, Субконто2, Субконто3, ВыборкаДетальныеЗаписи.ДополнительнаяАналитика, ВалютаКурсовойРазницы, СуммаКурсовойРазницы, Отказ);			
			
			ВидСубконто1 = Неопределено;
			ВидСубконто2 = Неопределено;
			ВидСубконто3 = Неопределено;
			
			Для каждого СтрокаВидыСубконто Из СчетКурсовойРазницы.ВидыСубконто Цикл
				Если СтрокаВидыСубконто.НомерСтроки = 1 Тогда
					ВидСубконто1 = СтрокаВидыСубконто.ВидСубконто;
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 2 Тогда
					ВидСубконто2 = СтрокаВидыСубконто.ВидСубконто;
					Если ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств Тогда
						Субконто2 = Справочники.ВидыДвиженияДенежныхСредств.КурсоваяРазница;
					КонецЕсли;
				ИначеЕсли СтрокаВидыСубконто.НомерСтроки = 3 Тогда
					ВидСубконто3 = СтрокаВидыСубконто.ВидСубконто;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаКурсовойРазницы > 0 Тогда
				//Если ВидСчетаУчета = ВидСчета.Активный Тогда
					Проводка.СчетДт = СчетКурсовойРазницы;
					Если ЗначениеЗаполнено(Субконто1) Тогда
						Проводка.СубконтоДт[ВидСубконто1] = Субконто1;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто2) Тогда
						Проводка.СубконтоДт[ВидСубконто2] = Субконто2;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто3) Тогда
						Проводка.СубконтоДт[ВидСубконто3] = Субконто3;
					КонецЕсли;
					Проводка.ВалютаДт = ВалютаКурсовойРазницы;
					Проводка.ДополнительнаяАналитикаДт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитика;
					
					Проводка.СчетКт = УчетКурсовойРазницы.Счет;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
						Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаКурсовойРазницы);
					КонецЕсли;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
						Проводка.СубконтоКт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
					КонецЕсли;
				//Иначе
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано списание курсовых разниц для пассивных счетов", ОбъектДокумента.Ссылка,,,Отказ);
				//КонецЕсли;
			Иначе
				//Если ВидСчетаУчета = ВидСчета.Активный Тогда
					Проводка.СчетДт = УчетКурсовойРазницы.Счет;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
						Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетКурсовойРазницы.ГруппаФинансовогоУчетаДоходовРасходов;//ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаКурсовойРазницы);
					КонецЕсли;
					Если ЗначениеЗаполнено(УчетКурсовойРазницы.ЦеннаяБумага) Тогда
						Проводка.СубконтоДт.ЦенныеБумаги = УчетКурсовойРазницы.ЦеннаяБумага;
					КонецЕсли;
					
					Проводка.СчетКт = СчетКурсовойРазницы;
					Если ЗначениеЗаполнено(Субконто1) Тогда
						Проводка.СубконтоКт[ВидСубконто1] = Субконто1;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто2) Тогда
						Проводка.СубконтоКт[ВидСубконто2] = Субконто2;
					КонецЕсли;
					Если ЗначениеЗаполнено(Субконто3) Тогда
						Проводка.СубконтоКт[ВидСубконто3] = Субконто3;
					КонецЕсли;
					Проводка.ВалютаКт = ВалютаКурсовойРазницы;
					Проводка.ДополнительнаяАналитикаКт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитика;
				//Иначе
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано списание курсовых разниц для пассивных счетов", ОбъектДокумента.Ссылка,,,Отказ);
				//КонецЕсли;
			КонецЕсли;
			
			Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
			
				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
			
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвижениеПерекурсовки(ОбъектДокумента, Параметры, Отказ) Экспорт 
	
	ЦеннаяБумага = Параметры.ЦеннаяБумага;
	
	Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Акции") Тогда
		//по акциям пересчет по курсу не производится (ПБУ 3 п.7)
		Возврат;
	КонецЕсли;
	
	ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
	УчетныйАктивЕПС = Параметры.УчетныйАктивЕПС;
	
	СтоимостьВВалютеУчета = Параметры.СтоимостьВВалютеУчета;
	СтоимостьКупонаВВалютеУчета = Параметры.СтоимостьКупонаВВалютеУчета;
	ПереоценкаВВалютеУчета = Параметры.ПереоценкаВВалютеУчета;
	ПереоценкаКупонаВВалютеУчета = Параметры.ПереоценкаКупонаВВалютеУчета;
	ДисконтНачисленныйВВалютеУчета 	= ?(Параметры.Свойство("ДисконтНачисленныйВВалютеУчета"), Параметры.ДисконтНачисленныйВВалютеУчета, 0);
	ПремияНачисленнаяВВалютеУчета 	= ?(Параметры.Свойство("ПремияНачисленнаяВВалютеУчета"), Параметры.ПремияНачисленнаяВВалютеУчета, 0);;
	КорректировкаЭСПВВалютеУчета = Параметры.КорректировкаЭСПВВалютеУчета;
	РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета = Параметры.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета;
	
	ПереоценкаПоФиксированномуКурсу	= ?(Параметры.Свойство("ПереоценкаПоФиксированномуКурсу"), Параметры.ПереоценкаПоФиксированномуКурсу, Ложь);
	
	ОтражатьПартииНаЛицевыхСчетах = Параметры.Свойство("ОтражатьПартииНаЛицевыхСчетах");
	
	//остатки
	Если ДисконтНачисленныйВВалютеУчета <> 0 ИЛИ ПремияНачисленнаяВВалютеУчета <> 0 Тогда
		ДисконтПремияНачисленныйВВалютеУчета = 0;
	Иначе
		ДисконтПремияНачисленныйВВалютеУчета = Параметры.ДисконтПремияНачисленныйВВалютеУчета;
	КонецЕсли;
	
	ДисконтПремияНачисленныйОстаток = Параметры.ДисконтПремияНачисленныйОстаток;
	ПереоценкаОстаток = Параметры.ПереоценкаОстаток;
	КорректировкаЭСПОстаток = Параметры.КорректировкаЭСПОстаток;
	РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток = Параметры.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток;
	
	Если СтоимостьВВалютеУчета <> 0 Тогда
		
		СтоимостьВВалютеУчетаМодуль = Макс(СтоимостьВВалютеУчета, -СтоимостьВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СтоимостьВВалютеУчетаМодуль, "Перекурсовка стоимости");
		
		Если СтоимостьВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтоимостьКупонаВВалютеУчета <> 0 Тогда
		
		СтоимостьКупонаВВалютеУчетаМодуль = Макс(СтоимостьКупонаВВалютеУчета, -СтоимостьКупонаВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СтоимостьКупонаВВалютеУчетаМодуль, "Перекурсовка купона");
		
		Если СтоимостьКупонаВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаКупона;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаКупона;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПереоценкаВВалютеУчета <> 0 Тогда
		
		ПереоценкаВВалютеУчетаМодуль = Макс(ПереоценкаВВалютеУчета, -ПереоценкаВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ПереоценкаВВалютеУчетаМодуль, "Перекурсовка переоценки");
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Проводка.Период, Проводка.Организация, Проводка.СчетДоверительногоУправления);
		
		ПоложительнаяПереоценкаНаБалансе = (ПереоценкаОстаток > 0);
		Если ПереоценкаВВалютеУчета > 0 Тогда
			Проводка.СчетДт = ?(ПоложительнаяПереоценкаНаБалансе, УчетныйАктивЕПС.СчетУчетаПереоценкиА, УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
			
			Если ПереоценкаПоФиксированномуКурсу ИЛИ НастройкиУчета.ОтражатьДоходыРасходыОтПерекурсовкиПереоценкиКакПереоценку Тогда
				АналитикаДляПерекурсовки = ?(ПоложительнаяПереоценкаНаБалансе, УчетныйАктивЕПС.АналитикаДоходовОтПереоценки, УчетныйАктивЕПС.АналитикаРасходовОтПереоценки);
				Проводка.СчетКт = ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктивЕПС, ПоложительнаяПереоценкаНаБалансе);
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаДляПерекурсовки;
				Если Проводка.СчетКт.Валютный Тогда
					Проводка.ВалютаКт = ВалютаНоминала;
				КонецЕсли;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			КонецЕсли;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Если ПереоценкаПоФиксированномуКурсу ИЛИ НастройкиУчета.ОтражатьДоходыРасходыОтПерекурсовкиПереоценкиКакПереоценку Тогда
				АналитикаДляПерекурсовки = ?(ПоложительнаяПереоценкаНаБалансе, УчетныйАктивЕПС.АналитикаДоходовОтПереоценки, УчетныйАктивЕПС.АналитикаРасходовОтПереоценки);
				Проводка.СчетДт = ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктивЕПС, ПоложительнаяПереоценкаНаБалансе);
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = АналитикаДляПерекурсовки;
				Если Проводка.СчетДт.Валютный Тогда
					Проводка.ВалютаДт = ВалютаНоминала;
				КонецЕсли;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			КонецЕсли;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = ?(ПоложительнаяПереоценкаНаБалансе, УчетныйАктивЕПС.СчетУчетаПереоценкиА, УчетныйАктивЕПС.СчетУчетаПереоценкиП);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПереоценкаКупонаВВалютеУчета <> 0 Тогда
		
		ПереоценкаКупонаВВалютеУчетаМодуль = Макс(ПереоценкаКупонаВВалютеУчета, -ПереоценкаКупонаВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ПереоценкаКупонаВВалютеУчетаМодуль, "Перекурсовка переоценки купона");
		
		Если ПереоценкаКупонаВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаКупона;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаКупона;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДисконтПремияНачисленныйВВалютеУчета <> 0 Тогда
		
		ДисконтПремияНачисленныйВВалютеУчетаМодуль = Макс(ДисконтПремияНачисленныйВВалютеУчета, -ДисконтПремияНачисленныйВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ДисконтПремияНачисленныйВВалютеУчетаМодуль, "Перекурсовка дисконта/премии");
		
		Если ДисконтПремияНачисленныйВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = ?(ДисконтПремияНачисленныйОстаток<0, Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт, Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = ?(ДисконтПремияНачисленныйОстаток<0, Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт, Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия);
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДисконтНачисленныйВВалютеУчета <> 0 Тогда
		
		ДисконтНачисленныйВВалютеУчетаМодуль = Макс(ДисконтНачисленныйВВалютеУчета, -ДисконтНачисленныйВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ДисконтНачисленныйВВалютеУчетаМодуль, "Перекурсовка дисконта/премии");
		
		Если ДисконтНачисленныйВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;

	Если ПремияНачисленнаяВВалютеУчета <> 0 Тогда
		
		ПремияНачисленнаяВВалютеУчетаМодуль = Макс(ПремияНачисленнаяВВалютеУчета, -ПремияНачисленнаяВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ПремияНачисленнаяВВалютеУчетаМодуль, "Перекурсовка дисконта/премии");
		
		Если ПремияНачисленнаяВВалютеУчета > 0 Тогда
			Проводка.СчетДт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = УчетныйАктивЕПС.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;

	
	Если КорректировкаЭСПВВалютеУчета <> 0 Тогда
		
		КорректировкаЭСПВВалютеУчетаМодуль = Макс(КорректировкаЭСПВВалютеУчета, -КорректировкаЭСПВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, КорректировкаЭСПВВалютеУчетаМодуль, "Перекурсовка корректировки ЭСП");
		
		Если КорректировкаЭСПВВалютеУчета > 0 Тогда
			Проводка.СчетДт = ?(КорректировкаЭСПОстаток<0, УчетныйАктивЕПС.СчетУчетаКорректировокП, УчетныйАктивЕПС.СчетУчетаКорректировокА);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = ?(КорректировкаЭСПОстаток<0, УчетныйАктивЕПС.СчетУчетаКорректировокП, УчетныйАктивЕПС.СчетУчетаКорректировокА);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета <> 0 Тогда
		
		РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаМодуль = Макс(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, -РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета);
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаМодуль, "Перекурсовка разницы первоначального признания");
		
		Если РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета > 0 Тогда
			Проводка.СчетДт = ?(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток<0, УчетныйАктивЕПС.УчетныйАктив.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт, УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаДт = ВалютаНоминала;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетКт, ВалютаНоминала);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ПолучитьГФУПоВалюте(Проводка.СчетДт, ВалютаНоминала);
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.СчетКт = ?(РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток<0, УчетныйАктивЕПС.УчетныйАктив.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт, УчетныйАктивЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт);
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
		Если ОтражатьПартииНаЛицевыхСчетах Тогда
		
			Проводка.Партия			= Параметры.Партия;
			Проводка.СтрокаПартии	= Параметры.СтрокаПартии;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвижениеКорректировки(ОбъектДокумента, ПараметрыСписания, Отказ) Экспорт 
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	СуммаВал 		= ПараметрыСписания.СуммаВал; // Это сумма в валюте номинала
	Если СуммаВал = 0 Тогда // немного странное условие, но мы все эти годы жили с ним - вытащил его в начало
		Возврат;
	КонецЕсли;
	
	СуммаУчета 		= ПараметрыСписания.СуммаУчета;
	УчетныйАктив 	= ПараметрыСписания.УчетныйАктив;
	ЦеннаяБумага 	= ПараметрыСписания.ЦеннаяБумага;
	Сделка			= ПараметрыСписания.Сделка;
	
	Партия			= ?(ПараметрыСписания.Свойство("Партия"), ПараметрыСписания.Партия, Неопределено);	
	СтрокаПартии	= ?(ПараметрыСписания.Свойство("СтрокаПартии"), ПараметрыСписания.СтрокаПартии, Неопределено);	
	
	АналитикаЦБ = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка();
	
	ЭтоРасход = (СуммаУчета < 0);
	
	Показатель		= ПараметрыСписания.Показатель;
	Если Показатель = "КорректировкаЭСП" Тогда
		СчетУчета	= ?(ЭтоРасход, УчетныйАктив.СчетУчетаКорректировокП, УчетныйАктив.СчетУчетаКорректировокА);
		Аналитика	= ?(ЭтоРасход, УчетныйАктив.АналитикаРасходовОтКорректировки, УчетныйАктив.АналитикаДоходовОтКорректировки);
		Счет700		= ?(ЭтоРасход, ПланыСчетов.Единый.ПроцентныеДоходы06, ПланыСчетов.Единый.ПроцентныеДоходы05);
	ИначеЕсли Показатель = "Переоценка" Тогда
		СчетУчета	= ?(ЭтоРасход, УчетныйАктив.СчетУчетаПереоценкиП, УчетныйАктив.СчетУчетаПереоценкиА);
		Аналитика	= ?(ЭтоРасход, УчетныйАктив.АналитикаРасходовОтПереоценки, УчетныйАктив.АналитикаДоходовОтПереоценки);
		АналитикаЦБ = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
		Счет700		= БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, НЕ ЭтоРасход);
	ИначеЕсли Показатель = "ИндексацияНоминала" Тогда
		СчетУчета	= ?(ЭтоРасход, УчетныйАктив.СчетУчетаПереоценкиП, УчетныйАктив.СчетУчетаПереоценкиА);
		Аналитика	= ?(ЭтоРасход, УчетныйАктив.АналитикаРасходовОтПереоценки, УчетныйАктив.АналитикаДоходовОтПереоценки);
		АналитикаЦБ	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
		Счет700		= ?(ЭтоРасход, УчетныйАктив.СчетУчетаРасходовОтОпераций, УчетныйАктив.СчетУчетаДоходовОтОпераций);
	ИначеЕсли Показатель = "РазницаПервоначальногоПризнания" Тогда
		
		// пока, увы, затыка потом разберусь - бывают ситуации списания отрицательной корректировки ПП + и зачисления
		// позже сделаю именно по виду движения
		НастройкиУчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиУчета(
									ОбъектДокумента.Дата,
									ОбъектДокумента.Организация,
									ОбъектДокумента.СчетДоверительногоУправления);
									
		НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
			НастройкиУчета,
			ЦеннаяБумага,
			УчетныйАктив,
			Партия,
			СтрокаПартии);
		
		Если Не НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнанияДляКорректировок
			И ТипЗнч(ПараметрыСписания.Сделка) <> Тип("ДокументСсылка.ВыводЦенныхБумаг")
			И ТипЗнч(ПараметрыСписания.Сделка) <> Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда 
			ЭтоРасход = НЕ ЭтоРасход;
		КонецЕсли;
		
		СчетУчета	= ?(ЭтоРасход, УчетныйАктив.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт, УчетныйАктив.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт);
		Аналитика	= ?(ЭтоРасход, УчетныйАктив.АналитикаРасходовПервоначальногоПризнания, УчетныйАктив.АналитикаДоходовПервоначальногоПризнания);
		Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") ИЛИ ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Векселя") Тогда
			АналитикаЦБ = Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания;
		КонецЕсли;
		Счет700		= ?(ЭтоРасход, УчетныйАктив.СчетУчетаРасходовОтОпераций, УчетныйАктив.СчетУчетаДоходовОтОпераций);
		
		Если ТипЗнч(Сделка) <> Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
			Сделка = Неопределено; //всегда списываем на доходы/расходы, см. положение 494-П п.3.13, 3.14
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счетов учета показателя " + Показатель, ,,, Отказ);
		Возврат;
	КонецЕсли;
	
	СторонаЦБ	= ?(ЭтоРасход, "Кт", "Дт");
	СторонаНеЦБ = ?(ЭтоРасход, "Дт", "Кт");
	
	МеняемЗнак = (СуммаУчета <> МатематическиеФункции.МодульЧисла(СуммаУчета));
	Если МеняемЗнак Тогда
		СуммаВал 	= -СуммаВал;
		СуммаУчета 	= -СуммаУчета;
	КонецЕсли;
	
	Если Сделка = Неопределено Тогда // это переоценка бумаги
		Корреспонденция = "Доходы/расходы";
		
		ПереоценкаПослеВводаНачальныхОстатков = ?(ПараметрыСписания.Свойство("ПереоценкаПослеВводаНачальныхОстатков", ПереоценкаПослеВводаНачальныхОстатков), ПереоценкаПослеВводаНачальныхОстатков, Ложь);
		НачисленоВПрошломГоду = ?(ПараметрыСписания.Свойство("НачисленоВПрошломГоду", НачисленоВПрошломГоду), НачисленоВПрошломГоду, Ложь);
		Если ПереоценкаПослеВводаНачальныхОстатков ИЛИ НачисленоВПрошломГоду Тогда // прошлогодняя переоценка
			Корреспонденция = "Активы в ДУ";
		КонецЕсли;
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
		Корреспонденция = "Активы в ДУ";
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Корреспонденция = "Активы в РЕПО";
		
		СторонаЦБ	= ?(ЭтоРасход, "Дт", "Кт");
		СторонаНеЦБ = ?(ЭтоРасход, "Кт", "Дт");
		
	Иначе // продажа/погашение
		Корреспонденция = "Реализация";
	КонецЕсли;
	
	Содержание = ?(Сделка <> Неопределено, "Списание по ЦБ(" + Показатель + ")", Показатель);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаУчета, Содержание);
	
	// со стороны бумаги (счета 5ХХ)
	Проводка["Счет" + СторонаЦБ] = СчетУчета;	
	Проводка["Субконто" + СторонаЦБ].ЦенныеБумаги = ЦеннаяБумага;
	
	Проводка["Количество" + СторонаЦБ] = 0;
	Проводка["Валюта" + СторонаЦБ] = ПараметрыСписания.ВалютаНоминала;
	Проводка["ВалютнаяСумма" + СторонаЦБ] = СуммаВал;
	
	Проводка["ДополнительнаяАналитика" + СторонаЦБ] = АналитикаЦБ;
	
	// Корреспонденция
	Если Корреспонденция = "Активы в ДУ" Тогда
		Проводка["Счет" + СторонаНеЦБ] = ПланыСчетов.Единый.АктивыВДУ03;
		Проводка["Субконто" + СторонаНеЦБ].Договоры = УчетныйСчетДоверительногоУправления;
	ИначеЕсли Корреспонденция = "Реализация" Тогда
		Проводка["Счет" + СторонаНеЦБ] = ПланыСчетов.Единый.ВыбытиеИРеализация10;
		Проводка["Субконто" + СторонаНеЦБ].ЦенныеБумаги = ЦеннаяБумага;
		Проводка["Субконто" + СторонаНеЦБ].ОснованиеРасчетов = Сделка;
		Проводка["Количество" + СторонаНеЦБ] = 0;
	ИначеЕсли Корреспонденция = "Доходы/расходы" Тогда
		Проводка["Счет" + СторонаНеЦБ] = Счет700;
		Проводка["Субконто" + СторонаНеЦБ].ГруппыФинансовогоУчетаДоходовРасходов = Аналитика;
		Проводка["Субконто" + СторонаНеЦБ].ЦенныеБумаги = ЦеннаяБумага;
		Если Проводка["Счет" + СторонаНеЦБ].Валютный Тогда // для счетов 106ХХ
			Проводка["Валюта" + СторонаНеЦБ] = ПараметрыСписания.ВалютаУчета;
			Проводка["ВалютнаяСумма" + СторонаНеЦБ] = СуммаУчета;
		КонецЕсли;
	ИначеЕсли Корреспонденция = "Активы в РЕПО" Тогда
		АналитикаУчетногоАктиваВРЕПО = Справочники.УчетныеАктивыЕПС.ПолучитьДанныеУчетногоАктиваЕПСДляБумагВРЕПО(УчетныйАктив, Отказ);
		
		Если Показатель = "КорректировкаЭСП" Тогда
			СчетУчетаСторонаНеЦБ	= ?(ЭтоРасход, АналитикаУчетногоАктиваВРЕПО.СчетУчетаКорректировокП, АналитикаУчетногоАктиваВРЕПО.СчетУчетаКорректировокА);
		ИначеЕсли Показатель = "Переоценка" Тогда
			СчетУчетаСторонаНеЦБ	= ?(ЭтоРасход, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиП, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиА);
		ИначеЕсли Показатель = "ИндексацияНоминала" Тогда
			СчетУчетаСторонаНеЦБ	= ?(ЭтоРасход, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиП, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиА);
		ИначеЕсли Показатель = "РазницаПервоначальногоПризнания" Тогда
			СчетУчетаСторонаНеЦБ	= ?(ЭтоРасход, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиП, АналитикаУчетногоАктиваВРЕПО.СчетУчетаПереоценкиА);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счетов учета показателя " + Показатель, ,,, Отказ);
			Возврат;
		КонецЕсли;
		
		Проводка["Счет" + СторонаНеЦБ] = СчетУчетаСторонаНеЦБ;
		Проводка["Субконто" + СторонаНеЦБ].ЦенныеБумаги = ЦеннаяБумага;
		Проводка["ДополнительнаяАналитика" + СторонаНеЦБ] = АналитикаЦБ;
		Проводка["Количество" + СторонаНеЦБ] = 0;
		Если Проводка["Счет" + СторонаНеЦБ].Валютный Тогда
			Проводка["Валюта" + СторонаНеЦБ] = ПараметрыСписания.ВалютаУчета;
			Проводка["ВалютнаяСумма" + СторонаНеЦБ] = СуммаУчета;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Партия <> Неопределено Тогда
		Проводка.Партия = Партия;
		Проводка.СтрокаПартии = СтрокаПартии;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачислитьДисконтПремию(ОбъектДокумента, ПараметрыНачисления, Отказ) Экспорт
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	СуммаУчета = ПараметрыНачисления.СуммаУчета;//обычное движения начисления для дисконта - >0, для премии - <0
	СуммаВал	= ПараметрыНачисления.СуммаВал;
	ВалютаУчета		= ПараметрыНачисления.ВалютаУчета;
	УчетныйАктив = ПараметрыНачисления.УчетныйАктив;
	ЦеннаяБумага = ПараметрыНачисления.ЦеннаяБумага;
	ВалютаНоминала = ПараметрыНачисления.ВалютаНоминала;
	ПереоценкаПослеВводаНачальныхОстатков = ?(ПараметрыНачисления.Свойство("ПереоценкаПослеВводаНачальныхОстатков",ПереоценкаПослеВводаНачальныхОстатков),ПереоценкаПослеВводаНачальныхОстатков,Ложь);
	Аналитика = ПараметрыНачисления.Аналитика;
	
	Если Аналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия Тогда
		Если СуммаУчета > 0 Тогда //не обычно - списываем ранее ошибочно начисленный?
			//на доходы
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаУчета, "Списание премии");
			
			// дебет
			Проводка.СчетДт = УчетныйАктив.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаДт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаДт = СуммаВал;
			
			Проводка.ДополнительнаяАналитикаДт = Аналитика;
			
			// кредит
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
				Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
			КонецЕсли;
			
		ИначеЕсли СуммаУчета < 0 Тогда //как обычно - начисляем 
			//на расходы
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, -СуммаУчета, "Начисление премии");
			
			// дебет
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы04;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаСписанияПремии;
				Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаКт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = -СуммаВал;
			
			Проводка.ДополнительнаяАналитикаКт = Аналитика;
			
		КонецЕсли;
	Иначе    //дисконт
		Если СуммаУчета > 0 Тогда //как обычно - начисляем
			//дисконт
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаУчета, "Начисление дисконта");
			
			// дебет
			Проводка.СчетДт = УчетныйАктив.СчетУчета;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаДт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаДт = СуммаВал;
			
			Проводка.ДополнительнаяАналитикаДт = Аналитика;
			
			// кредит
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
				Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
				Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
			КонецЕсли;
			
		ИначеЕсли СуммаУчета < 0 Тогда //не обычно - возвращаем излишне начисленное?
			//премия
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, -СуммаУчета, "Начисление премии");
			
			// дебет
			Если ПереоценкаПослеВводаНачальныхОстатков Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка.СубконтоДт.Договоры = УчетныйСчетДоверительногоУправления;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы04;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаСписанияПремии;
				Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчета;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаКт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = -СуммаВал;
			
			Проводка.ДополнительнаяАналитикаКт = Аналитика;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачислитьНКД(ОбъектДокумента, ПараметрыНачисления, Отказ) Экспорт 
	
	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления);
	
	СуммаУчета = ПараметрыНачисления.СуммаУчета;
	СуммаВал	= ПараметрыНачисления.СуммаВал;
	ВалютаУчета		= ПараметрыНачисления.ВалютаУчета;
	УчетныйАктив = ПараметрыНачисления.УчетныйАктив;
	ЦеннаяБумага = ПараметрыНачисления.ЦеннаяБумага;
	ВалютаНоминала = ПараметрыНачисления.ВалютаНоминала;
	ПереоценкаПослеВводаНачальныхОстатков = ?(ПараметрыНачисления.Свойство("ПереоценкаПослеВводаНачальныхОстатков",ПереоценкаПослеВводаНачальныхОстатков),ПереоценкаПослеВводаНачальныхОстатков,Ложь);
	АналитикаКупонНачисленный = ?(ПараметрыНачисления.Свойство("Аналитика",АналитикаКупонНачисленный),АналитикаКупонНачисленный,Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный); 
	
	Если СуммаВал > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаУчета, "Переоценка купона");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаВал;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
		
		// кредит
		Если ПереоценкаПослеВводаНачальныхОстатков Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
			Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
		КонецЕсли;
		
	ИначеЕсли СуммаВал < 0 Тогда
		
		//Так не бывает!!!
		// увы, но бывает
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, СуммаУчета, "Переоценка купона");
		
		// дебет
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		
		Проводка.ВалютаДт  = ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаВал;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаКупонНачисленный;
		
		// кредит
		Если ПереоценкаПослеВводаНачальныхОстатков Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = УчетныйСчетДоверительногоУправления;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
			Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет было ли до конца дня погашения ЦБ списание бумаг со счета ДЕПО и оплата задолженности.
// Используется для переноса аналитики НКД по счетам 501-504
Функция НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности(ДокументПогашения) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПогашения, "Дата, Ссылка, Организация, СчетДоверительногоУправления, ЦеннаяБумага");
	
	// действовать должно с 01.11.25, были случаи и ранее, но их уже править не станем, так оговорено в задаче #696814
	// а для того чтобы не разыменовывать ДокументПогашения для получения даты в общем модуле проверяем уже тут, когда получили запросом необходимые реквизиты.
	Если РеквизитыДокумента.Дата >= '20251101' Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(ЗадолженностиПоДенежнымСредствам.Сумма), 0) КАК ЗадолженностиПоДенежнымСредствамСумма
		|ПОМЕСТИТЬ _ДвиженияЗадолженностиПоДенежнымСредствам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Активность
		|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.Основание = &Основание
		|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(ОстаткиЦенныхБумагЗаблокированные.Количество), 0) КАК ОстаткиЦенныхБумагЗаблокированныеКоличество
		|ПОМЕСТИТЬ _ДвиженияОстаткиЦенныхБумагЗаблокированные
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные КАК ОстаткиЦенныхБумагЗаблокированные
		|ГДЕ
		|	ОстаткиЦенныхБумагЗаблокированные.Активность
		|	И ОстаткиЦенныхБумагЗаблокированные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ОстаткиЦенныхБумагЗаблокированные.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ОстаткиЦенныхБумагЗаблокированные.Организация = &Организация
		|	И ОстаткиЦенныхБумагЗаблокированные.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиЦенныхБумагЗаблокированные.ЦеннаяБумага = &ЦеннаяБумага
		|	И ОстаткиЦенныхБумагЗаблокированные.ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияЗадолженностиПоДенежнымСредствам.ЗадолженностиПоДенежнымСредствамСумма > 0 КАК ЕстьОплатаЗадолженности,
		|	_ДвиженияОстаткиЦенныхБумагЗаблокированные.ОстаткиЦенныхБумагЗаблокированныеКоличество > 0 КАК ЕстьПогашениеЦенныхБумаг
		|ИЗ
		|	_ДвиженияЗадолженностиПоДенежнымСредствам КАК _ДвиженияЗадолженностиПоДенежнымСредствам,
		|	_ДвиженияОстаткиЦенныхБумагЗаблокированные КАК _ДвиженияОстаткиЦенныхБумагЗаблокированные";
		
		Запрос.УстановитьПараметр("Организация", РеквизитыДокумента.Организация);
		Запрос.УстановитьПараметр("Период", РеквизитыДокумента.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", РеквизитыДокумента.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ЦеннаяБумага", РеквизитыДокумента.ЦеннаяБумага);
		Запрос.УстановитьПараметр("Основание", ДокументПогашения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если ВыборкаДетальныеЗаписи.ЕстьОплатаЗадолженности Или ВыборкаДетальныеЗаписи.ЕстьПогашениеЦенныхБумаг Тогда	
				
				Возврат Ложь;
				
			Иначе	
				// Не погашалась задолженность и бумаги не списывали со счета ДЕПО
				
				Возврат Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

Процедура ЗакрытьДоходыРасходыпоРезервамСПартиямиНаЛицевыхСчетах(ОбъектДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаНачисленияРезервов КАК АналитикаНачисленияРезервов,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаСписанияРезервов КАК АналитикаСписанияРезервов
		|ПОМЕСТИТЬ _ВыбытиеПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаНачисленияРезервов,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС.АналитикаСписанияРезервов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВыбытиеПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВыбытиеПартий.Партия КАК Партия,
		|	_ВыбытиеПартий.СтрокаПартии КАК СтрокаПартии,
		|	_ВыбытиеПартий.АналитикаНачисленияРезервов КАК АналитикаНачисленияРезервов,
		|	_ВыбытиеПартий.АналитикаСписанияРезервов КАК АналитикаСписанияРезервов,
		|	_ВыбытиеПартий.Количество КАК КоличествоСписано,
		|	ВЫБОР
		|		КОГДА &РезервВыводится
		|			ТОГДА 0
		|		ИНАЧЕ _ВыбытиеПартий.СуммаРезервовПодОбесценение
		|	КОНЕЦ КАК ВосстановленоРезервовПриПродаже,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиДоход.СуммаОстатокКт, 0) КАК ВосстановленоРезервовВсего,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстаткиРасход.СуммаОстатокДт, 0) КАК НачисленоРезервовВсего
		|ИЗ
		|	_ВыбытиеПартий КАК _ВыбытиеПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость) КАК БухПартииЦенныхБумагОстатки
		|		ПО _ВыбытиеПартий.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
		|			И _ВыбытиеПартий.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И _ВыбытиеПартий.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам01),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиДоход
		|		ПО _ВыбытиеПартий.АналитикаСписанияРезервов = ЕдиныйБухгалтерскийУчетОстаткиДоход.Субконто1
		|			И _ВыбытиеПартий.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстаткиДоход.Субконто2
		|			И _ВыбытиеПартий.Партия = ЕдиныйБухгалтерскийУчетОстаткиДоход.ЛицевойСчет.Партия
		|			И _ВыбытиеПартий.СтрокаПартии = ЕдиныйБухгалтерскийУчетОстаткиДоход.ЛицевойСчет.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&Период,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыПоРезервам02),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиРасход
		|		ПО _ВыбытиеПартий.АналитикаНачисленияРезервов = ЕдиныйБухгалтерскийУчетОстаткиРасход.Субконто1
		|			И _ВыбытиеПартий.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстаткиРасход.Субконто2
		|			И _ВыбытиеПартий.Партия = ЕдиныйБухгалтерскийУчетОстаткиРасход.ЛицевойСчет.Партия
		|			И _ВыбытиеПартий.СтрокаПартии = ЕдиныйБухгалтерскийУчетОстаткиРасход.ЛицевойСчет.СтрокаПартии";
	
	Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", ОбъектДокумента.Ссылка);
	// при продаже и пр. резерв восстанавливается, а при выводе - выводится (ВосстановленоРезервовПриПродаже = 0)
	Запрос.УстановитьПараметр("РезервВыводится", ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.ВыводЦенныхБумаг")); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.НачисленоРезервовВсего > 0 Тогда
			
			Если ВыборкаДетальныеЗаписи.КоличествоСписано = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда // списали все
				ЗакрытьНачислениеРезервов = ВыборкаДетальныеЗаписи.НачисленоРезервовВсего;
			Иначе // списали часть партии
				ЗакрытьНачислениеРезервов = ВыборкаДетальныеЗаписи.НачисленоРезервовВсего * ВыборкаДетальныеЗаписи.КоличествоСписано / ВыборкаДетальныеЗаписи.КоличествоОстаток;
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ЗакрытьНачислениеРезервов, "Закрытие резервов");
			
			Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоДт.Договоры = ОбъектДокумента.СчетДоверительногоУправления;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыПоРезервам02;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.АналитикаНачисленияРезервов;
			Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			
			Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
			Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;

		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ВосстановленоРезервовВсего > 0 ИЛИ ВыборкаДетальныеЗаписи.ВосстановленоРезервовПриПродаже > 0 Тогда
			
			Если ВыборкаДетальныеЗаписи.КоличествоСписано = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда // списали все
				ЗакрытьВосстановлениеРезервов = ВыборкаДетальныеЗаписи.ВосстановленоРезервовВсего;
			Иначе // списали часть партии
				ЗакрытьВосстановлениеРезервов = ВыборкаДетальныеЗаписи.ВосстановленоРезервовВсего * ВыборкаДетальныеЗаписи.КоличествоСписано / ВыборкаДетальныеЗаписи.КоличествоОстаток;
			КонецЕсли;
			ЗакрытьВосстановлениеРезервов = ЗакрытьВосстановлениеРезервов + ВыборкаДетальныеЗаписи.ВосстановленоРезервовПриПродаже; 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения.ЕдиныйБухгалтерскийУчет, ЗакрытьВосстановлениеРезервов, "Закрытие резервов");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыПоРезервам01;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.АналитикаСписанияРезервов;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = ОбъектДокумента.СчетДоверительногоУправления;
			
			Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
			Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
			
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

Процедура ОтнесениеНачисленныхДоходовНаАктивыВДУПоКурсовымРазницамЦенныхБумагСПартиямиНаЛицевыхСчетах(ЭтотОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Организация КАК Организация,
		|	БухПартииЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Количество КАК Количество,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ТаблицаПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&ПериодОстатковПартии,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ПО БухПартииЦенныхБумаг.Организация = БухПартииЦенныхБумагОстатки.Организация
		|			И БухПартииЦенныхБумаг.СчетДоверительногоУправления = БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления
		|			И БухПартииЦенныхБумаг.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
		|			И БухПартииЦенныхБумаг.УчетныйАктивЕПС = БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|			И БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.КурсовыеРазницыСНачалаГода <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаПартий.Партия КАК Партия,
		|	ТаблицаПартий.СтрокаПартии КАК СтрокаПартии,
		|	ТаблицаПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТаблицаПартий.Количество КАК Количество,
		|	ТаблицаПартий.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	ТаблицаПартий КАК ТаблицаПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|				&ПериодОстатковСчета,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций11), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций12)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ПО ТаблицаПартий.ЦеннаяБумага = ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ЦеннаяБумага
		|			И ТаблицаПартий.Партия = ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.Партия
		|			И ТаблицаПартий.СтрокаПартии = ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.СтрокаПартии";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);

	Запрос.УстановитьПараметр("ПериодОстатковПартии", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодОстатковСчета", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	
	ВалютаДохода  = ЭтотОбъект.Организация.ВалютаУчета;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДоляЗакрытия = ВыборкаДетальныеЗаписи.КоличествоОстаток / ВыборкаДетальныеЗаписи.Количество;
		КурсовыеРазницыСНачалаГода = Окр(ВыборкаДетальныеЗаписи.СуммаОстаток * ДоляЗакрытия, 2);
		
		Если КурсовыеРазницыСНачалаГода <> 0 Тогда
			
			СчетУчетаДоходов = ВыборкаДетальныеЗаписи.ЛицевойСчет.СчетУчета;
			
			БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
				ЭтотОбъект,
				СчетУчетаДоходов,
				ВыборкаДетальныеЗаписи.ЦеннаяБумага,
				ПолучитьГФУПоВалюте(СчетУчетаДоходов, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала),
				ВалютаДохода,
				"Закрытие доначисления по курсовым разницам",
				ВыборкаДетальныеЗаписи.ЛицевойСчет.ДополнительнаяАналитика,
				КурсовыеРазницыСНачалаГода,
				ВыборкаДетальныеЗаписи.Партия,
				ВыборкаДетальныеЗаписи.СтрокаПартии);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаПогашения) Экспорт

	ТаблицаАмортизаций = Новый ТаблицаЗначений;
	
	ТаблицаАмортизаций.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаАмортизаций.Колонки.Добавить("Поток", Новый ОписаниеТипов("Число"));
	ТаблицаАмортизаций.Колонки.Добавить("Номинал", Новый ОписаниеТипов("Число"));
	
	ЗапросАмортизации = Новый Запрос;
	ЗапросАмортизации.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.Период КАК Дата,
		|	НоминалыЦенныхБумаг.СуммаИзменения КАК Поток,
		|	НоминалыЦенныхБумаг.Номинал КАК Номинал
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	ЗапросАмортизации.УстановитьПараметр("ЦеннаяБумага", Облигация);
	
	ТекущийНоминал = 0;
	
	ВыборкаДетальныеЗаписи = ЗапросАмортизации.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Дата <= НачалоДня(ДатаПокупки) Тогда
		
			ТекущийНоминал = ВыборкаДетальныеЗаписи.Номинал;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Дата >= НачалоДня(ДатаПокупки)
			И ВыборкаДетальныеЗаписи.Дата < НачалоДня(ДатаПогашения) Тогда
		
			НоваяСтрока = ТаблицаАмортизаций.Добавить();
			НоваяСтрока.Дата = ВыборкаДетальныеЗаписи.Дата;
			НоваяСтрока.Поток = ВыборкаДетальныеЗаписи.Поток;
			НоваяСтрока.Номинал = ВыборкаДетальныеЗаписи.Номинал;
			
			ТекущийНоминал = ТекущийНоминал - ВыборкаДетальныеЗаписи.Поток;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущийНоминал <> 0 Тогда // нет последнего (окончательного) погашения - добавим
	
		НоваяСтрока = ТаблицаАмортизаций.Добавить();
		НоваяСтрока.Дата = ДатаПогашения;
		НоваяСтрока.Поток = ТекущийНоминал;
		НоваяСтрока.Номинал = 0;
	
	КонецЕсли;
	
	Возврат ТаблицаАмортизаций;
	
КонецФункции

Функция ОпределитьНоминалИДатуПогашения(Облигация, ДатаПереоценки, ДатаПокупки, СчетДоверительногоУправления, НастройкиУчета, ОпределенияКлиентов, ДанныеПереоценки)

	// разберемся до какого момента считаем и какой номинал будет НА ЭТОТ МОМЕНТ
	ДатаОпределенияПогашения = НачалоДня(ДатаПереоценки);
	Если НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения Тогда
	
		ДатаПогашения = Облигация.ДатаПогашения;
		Номинал = Справочники.Облигации.ПолучитьНоминал(Облигация, ДатаПогашения);
		
		// #Хардкоды по письмам клиентов
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_ПраймФБО2") Тогда
			ДатаПогашения = '20260202';
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Роснефть_004") И НачалоДня(ДатаПокупки) = '20190424' Тогда
			ДатаПогашения = '20230214';
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПочтаРФ_009") Тогда
			
			Если ОпределенияКлиентов.ЭтоКлиентБудущее ИЛИ ОпределенияКлиентов.ЭтоКлиентТелеком
				ИЛИ ДатаПереоценки >= '20250801' И (ОпределенияКлиентов.ЭтоКлиентБольшой ИЛИ ОпределенияКлиентов.ЭтоКлиентСАФМАР) Тогда // с 1.8.25 бумага может оказаться у Большого или ДБ
				ДатаПогашения = '20271122';
			КонецЕсли;
		ИначеЕсли Облигация.ДатаПогашения = '00010101' Тогда // бессрочная бумага - у УГМК до оферты #362218, #465058 - вся группа Будущее перешла на расчет до погашения и стрельнуло
			
			// небольшой трюк: в ДатеПереоценки лежит конец дня (для СЧА и переоценки ЕПС) и время документа (для расчета партий). Если конец дня, то берем уже со следующего дня
			ДатаОпределенияПогашения = НачалоДня(ДатаПереоценки + 1); 
			
			ДатаИЦенаВыкупа = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(Облигация, НачалоДня(ДатаОпределенияПогашения), ДатаПокупки, СчетДоверительногоУправления,
									НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении);
			
			ДатаПогашения = ДатаИЦенаВыкупа.ДатаВыкупа;
			Номинал = ДатаИЦенаВыкупа.ЦенаВыкупа;
			
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АФКСистема_022") // #392732 - будущее и телеком и федерация решили 2 бумаги до оферты считать
				ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НГКСлавнефть_02")
				ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СегежаГрупп_002") Тогда // #404611 - и еще 1 бумагу решили
				
			Если НЕ НастройкиУчета.Свойство("РассчитыватьДисконтПремиюДо_Переопределена")
				И (ОпределенияКлиентов.ЭтоКлиентБудущее ИЛИ ОпределенияКлиентов.ЭтоКлиентТелеком ИЛИ ОпределенияКлиентов.ЭтоКлиентФедерация) Тогда
				
				// небольшой трюк: в ДатеПереоценки лежит конец дня (для СЧА и переоценки ЕПС) и время документа (для расчета партий). Если конец дня, то берем уже со следующего дня
				ДатаОпределенияПогашения = НачалоДня(ДатаПереоценки + 1);
				
				ДатаИЦенаВыкупа = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(Облигация, НачалоДня(ДатаОпределенияПогашения), ДатаПокупки, СчетДоверительногоУправления,
									НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении);
				
				ДатаПогашения = ДатаИЦенаВыкупа.ДатаВыкупа;
				Номинал = ДатаИЦенаВыкупа.ЦенаВыкупа;
				
			КонецЕсли;
			
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ИНГРАДПАО_003") Тогда // #431578 - профсуждение от Будущего
			
			Если НЕ НастройкиУчета.Свойство("РассчитыватьДисконтПремиюДо_Переопределена") И ОпределенияКлиентов.ЭтоКлиентБудущее Тогда
				ДатаПогашения = '20230531';
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении
			ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_431")
				И ОпределенияКлиентов.ЭтоКлиентСАФМАР
				И НЕ НастройкиУчета.Свойство("РассчитыватьДисконтПремиюДо_Переопределена") Тогда
			
			ПараметрыОферты = Справочники.Облигации.ОбъявленаОбязательнаяДосрочнаяОферта(Облигация, ДатаПереоценки);
			Если ПараметрыОферты.Объявлена Тогда
			
				ДатаПогашения = ПараметрыОферты.ДатаВыкупа;
				Номинал = ПараметрыОферты.Цена;
			
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты Тогда
		
		// по задаче #384775 - все клиенты считают со следующего дня после публикации
		
		ДатаОпределенияПогашения = НачалоДня(ДатаПереоценки) - 86400; // предыдущий день, т.е. чтобы оферту объявленую 16го начать учитывать 17го
		Если НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении Тогда // для этих клиентов начинаем учитывать оферту только в день когда она случится
			ДатаОпределенияПогашения = НачалоДня(ДатаПереоценки);
		КонецЕсли;
		
		ДатаИЦенаВыкупа = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(Облигация, НачалоДня(ДатаОпределенияПогашения), ДатаПокупки, СчетДоверительногоУправления,
									НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении);
		
		ДатаПогашения = ДатаИЦенаВыкупа.ДатаВыкупа;
		Номинал = ДатаИЦенаВыкупа.ЦенаВыкупа;
		
		// #411671 -  хардкодом "отключить" оферту по санкт-петербургу для транснефти
		Если ОпределенияКлиентов.ЭтоКлиентТранснефть 
			И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СПетербург_003")
			И НачалоДня(ДатаПереоценки) >= '20211221' // объявили
		Тогда
		
			ДатаПогашения = '20270413';
			Номинал = 300;
		
		КонецЕсли;
		
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Свердл_Обл_005") // тут реально тяжелый случай
			И ОпределенияКлиентов.ЭтоКлиентБольшой 
			И НачалоДня(ДатаПереоценки) = '20211223' Тогда
		
			ДатаПогашения = '20261023';
			Номинал = 50;
		
		КонецЕсли;
		
	КонецЕсли;

	// #Хардкод - другого варианта не вижу
	Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_Роснфт2P7")
		И СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084")
		И ДатаПереоценки < '20240331' Тогда
		Если ДатаПереоценки >= '20190704' // В бэк-офисе так только после 04.07.2019
			ИЛИ Не ДанныеПереоценки.Свойство("ЦельРасчета")
			ИЛИ ДанныеПереоценки.ЦельРасчета <> Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении 
		Тогда
			ДатаПогашения = Дата(2024, 3, 29);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("ДатаПогашения, Номинал, ДатаОпределенияПогашения", ДатаПогашения, Номинал, ДатаОпределенияПогашения);
	
КонецФункции 

Функция РассчитатьАмортизациюДисконтаПремии(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, Отказ,  РасшифровкаРасчета = Неопределено) Экспорт

	//ПараметрыРасчета
	СчетДоверительногоУправления	= ДанныеПереоценки.СчетДоверительногоУправления;
	ДатаПереоценки					= ДанныеПереоценки.ДатаПереоценки;
	Количество						= ДанныеПереоценки.Количество;
	УчетныйАктивЕПС					= ДанныеПереоценки.УчетныйАктивЕПС; 

	ДатаПокупки						= ДанныеПокупки.ДатаПокупки; 
	ЦенаПокупки						= ДанныеПокупки.ЦенаПокупки; 
	НачальныйДисконт				= ДанныеПокупки.НачальныйДисконт;
			
	#Область Проверка_входящих_параметров
	
	Если ТипЗнч(Облигация) <> Тип("СправочникСсылка.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет дисконта/премии возможен только по облигациям!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
			
	Если ТипЗнч(НачальныйДисконт) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан начальный дисконт!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДатаПереоценки) <> Тип("Дата") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата переоценки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДатаПокупки) <> Тип("Дата") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата покупки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТребуетсяЦенаПокупки = НачальныйДисконт <> 0 И (Облигация.Амортизационная 
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке 
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ВЗависимостиОтКритерияСущественности);	
			
	Если ТребуетсяЦенаПокупки И (ТипЗнч(ЦенаПокупки) <> Тип("Число") ИЛИ ЦенаПокупки = 0) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана цена покупки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НастройкиУчета.РассчитыватьДисконтПремиюДо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках не указан вариант расчета доходности по облигациям",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;	
	
	#КонецОбласти
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеПереоценки", ДанныеПереоценки, "Данные переоценки", Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеПокупки", ДанныеПокупки, "Данные покупки", Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "НастройкиУчета", НастройкиУчета, "Настройки учета", Истина, Истина);
		
	КонецЕсли;
	
	#Область Определения_Клиентов
	
	Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки);
	
	ОпределенияКлиентов = Новый Структура();
	
	ОпределенияКлиентов.Вставить("ЭтоКлиентСАФМАР", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентЮгория", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ГСКЮгория")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентБольшой", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентОПФ", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФОПФ")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентТелеком", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентБудущее", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентТранснефть", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Транснефть")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентФедерация", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Федерация")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентСНГ", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФ_СНГ")));
	ОпределенияКлиентов.Вставить("ЭтоКлиентНациональный", (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Национальный")));
	
	#КонецОбласти
	
	ДанныеПогашения = ОпределитьНоминалИДатуПогашения(Облигация, ДатаПереоценки, ДатаПокупки, СчетДоверительногоУправления, НастройкиУчета, ОпределенияКлиентов, ДанныеПереоценки);
	
	ДатаПогашения = ДанныеПогашения.ДатаПогашения;
	Номинал = ДанныеПогашения.Номинал;
	ДатаОпределенияПогашения = ДанныеПогашения.ДатаОпределенияПогашения;

	Если НЕ (ОпределенияКлиентов.ЭтоКлиентЮгория И ДатаПереоценки = ДатаПогашения) Тогда
		НачальныйДисконт = ПереопределениеНачальногоДисконта(НачальныйДисконт, Облигация, Количество, ДатаПереоценки, ДатаПокупки, ОпределенияКлиентов);
	КонецЕсли;
	
	ДнейОтПереоценкиДоПогашения = (НачалоДня(ДатаПогашения) - НачалоДня(ДатаПереоценки)) / 86400;
	ДнейОтПокупкиДоПогашения = (НачалоДня(ДатаПогашения) - НачалоДня(ДатаПокупки)) / 86400;
	ДнейОтПокупкиДоПереоценки = (НачалоДня(ДатаПереоценки) - НачалоДня(ДатаПокупки)) / 86400;
	
	Если НачалоДня(ДатаПокупки) = НачалоДня(ДатаПереоценки) ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.НеУчитывать Тогда 
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииВДеньПокупки(НачальныйДисконт, Количество, НастройкиУчета);
		
	ИначеЕсли КонецДня(ДатаПогашения) = ДатаПереоценки Тогда 
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииПослеПогашенияИлиОферты(НачальныйДисконт, Количество, НастройкиУчета);
		
	ИначеЕсли ОпределенияКлиентов.ЭтоКлиентСНГ Тогда	// СНГ отдельная ветка - у них линейный расчет ведется на партию целиком 
		
		// проверим вдруг нелинейный
		Если НастройкиУчета.ВариантУчетаДисконтаПремии <> Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейПремии Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СчетДоверительногоУправления + " метод расчета дисконта/премии не соответствует 'Линейный метод с амортизацией премии (Сбербанк)'!",,,, Отказ);
			Возврат Неопределено;
		
		КонецЕсли;
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииСНГ(Облигация, НачальныйДисконт, Количество, ДнейОтПокупкиДоПереоценки, ДнейОтПокупкиДоПогашения, ДнейОтПереоценкиДоПогашения, ДатаПереоценки, ДатаПокупки, ДатаПогашения, РасшифровкаРасчета);
		
	ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСПолнымСписаниемПриАмортизациИПересчетомПриОфертах Тогда
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииАтом(Облигация, СчетДоверительногоУправления, НастройкиУчета, НачальныйДисконт, Количество, ДатаПокупки, ДатаПереоценки, РасшифровкаРасчета);
		
	ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетод
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейПремии
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейДисконта
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСЕжедневнойПроцентнойСтавкой
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСПолнымСписаниемПриАмортизаци
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодПлюсМетодикаСафмараДляАмортизационныхОблигаций
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейДисконтаОтНационального Тогда
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииЛинейно(НачальныйДисконт, ДнейОтПереоценкиДоПогашения, ДнейОтПокупкиДоПогашения);
		
		// списываем/доначисляем остаточек премии/дисконта если оферта прошла
		ДатаОфертыПослеПокупки = Облигация.ДатаПогашения;
		
		ОфертаПройденаИСтоимостьРавнаНоминальной = Ложь;
		
		Если НастройкиУчета.ДоводитьСтоимостьДоНоминалаВДеньОферты                                  						// это делать надо
			И НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты Тогда // это делать можно
			
			ДатаОфертыПослеПокупки = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(
				Облигация,
				ДатаПокупки,
				ДатаПокупки,
				СчетДоверительногоУправления,
				НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, 
				НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении,
				Неопределено,
				Ложь
			).ДатаВыкупа;
			
			// оферта была, пусть и сегодня, но это не дата погашения! 
			// если это дата погашения, то мы не переоцениваем, а гасим! 
			// и обнуения нет - мы выходим ровно на тело+дисконт=номинал!
			Если ДатаОфертыПослеПокупки <= НачалоДня(ДатаПереоценки) И ДатаОфертыПослеПокупки <> Облигация.ДатаПогашения Тогда 
			
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
				ОфертаПройденаИСтоимостьРавнаНоминальной = Истина;
				
			КонецЕсли;
			
			// #411671 -  хардкодом "отключить" оферту по санкт-петербургу для транснефти + #697836 у Национального тоже самое
			Если (ОпределенияКлиентов.ЭтоКлиентТранснефть ИЛИ ОпределенияКлиентов.ЭтоКлиентНациональный)
				И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СПетербург_003")
				И НачалоДня(ДатаПереоценки) >= '20211221' // объявили
			Тогда
			
				РезультатРасчетаДисконтаПремии.ТекущийДисконт = НачальныйДисконт * ДнейОтПереоценкиДоПогашения / ДнейОтПокупкиДоПогашения;
				ОфертаПройденаИСтоимостьРавнаНоминальной = Ложь;
			
			КонецЕсли;
			
			// #411066 - у Стройкомплекса переоценка ежемесячно поэтому пока так, позже подумаю как красивее сделать
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СТРОЙКОМПЛЕКС_ПН") Тогда
				ОфертыЗаПериод = Справочники.Облигации.ПолучитьОфертыЗаПериод(Облигация, ДатаПокупки, ДатаОпределенияПогашения);
				Если ОфертыЗаПериод.Количество() > 0 Тогда
				
					РезультатРасчетаДисконтаПремии.ТекущийДисконт = 0;
					ОфертаПройденаИСтоимостьРавнаНоминальной = Истина;
				
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
		
			РасшифровкаЛинейныйМетод = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расшифровка расчета по линейному методу", , , Истина);	
			
			РасчетЛинейныйМетод = Новый Структура;
			РасчетЛинейныйМетод.Вставить("НачальныйДисконт", НачальныйДисконт);
			РасчетЛинейныйМетод.Вставить("ДнейОтПокупкиДоПогашения", ДнейОтПокупкиДоПогашения);
			РасчетЛинейныйМетод.Вставить("ДнейОтПокупкиДоПереоценки", ДнейОтПокупкиДоПереоценки);
			РасчетЛинейныйМетод.Вставить("ОфертаПройденаИСтоимостьРавнаНоминальной", ОфертаПройденаИСтоимостьРавнаНоминальной);
			
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаЛинейныйМетод, "РасчетЛинейныйМетод", РасчетЛинейныйМетод, "Расчет линейный метод", Истина, Истина);
			
		КонецЕсли;
		
		Если (Облигация.Амортизационная                           // с этими постоянно сложности
			И НЕ НастройкиУчета.СтоимостьТелаРавнаНоминалу)		  // и кроме тех, у которых прошла оферта и стоимость стала равна номинальной 
			ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодПлюсМетодикаСафмараДляАмортизационныхОблигаций // эти все облигации по своей методике пускают
			И НЕ Облигация.ИндексируемыйНоминал                   // кроме индексируемых
			Тогда 
			
			Если НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетод // считаем линейно
				 И НачальныйДисконт < 0                                                                                 // купили с дисконтом
				 //И ТекущийДисконт <> 0 Тогда // чтобы в день погашения списать в 0! 
				 Тогда // чтобы в день погашения списать в 0! 
				 
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииДляАмортизационнойЛинейно(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, ЦенаПокупки, ДатаПереоценки, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета); 
				 
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейПремии
				ИЛИ (НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейДисконта И НачальныйДисконт < 0) Тогда
				
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииСАмортизациейПремииИлиДисконта(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, ДатаПереоценки, НачальныйДисконт, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета);
				
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСАмортизациейДисконтаОтНационального И НачальныйДисконт < 0 Тогда
				
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииМетодомНационального(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, ДатаПереоценки, НачальныйДисконт, Количество, ОфертаПройденаИСтоимостьРавнаНоминальной, РасшифровкаРасчета);
				
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСЕжедневнойПроцентнойСтавкой Тогда
				
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииЛинейнымМетодомСЕжедневнойПроцентнойСтавкой(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, Номинал, ДатаПереоценки, ЦенаПокупки, РасшифровкаРасчета);
				
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСПолнымСписаниемПриАмортизаци Тогда
				
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииЛинейнымМетодомСПолнымСписаниемПриАмортизаци(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, ДатаПереоценки, ДатаОфертыПослеПокупки, РасшифровкаРасчета);
				
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодПлюсМетодикаСафмараДляАмортизационныхОблигаций Тогда
				
				РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииЛинейнымМетодомПлюсМетодикаСафмараДляАмортизационныхОблигаций(Облигация, РезультатРасчетаДисконтаПремии.ТекущийДисконт, ДатаПокупки, ДатаПогашения, НачальныйДисконт, ДатаПереоценки, РасшифровкаРасчета);
				
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		РезультатРасчетаДисконтаПремии = РасчетДисконтаПремииЧерезЭСП(Облигация, ДатаПокупки, ДатаПогашения, Номинал, ЦенаПокупки, НачальныйДисконт, ДатаПереоценки, ДнейОтПокупкиДоПогашения, ДнейОтПереоценкиДоПогашения, НастройкиУчета, РасшифровкаРасчета);
		
	КонецЕсли;
	
	Если НачальныйДисконт < 0 Тогда // купили с дисконтом
		
		Если НЕ НастройкиУчета.СтоимостьТелаРавнаНоминалу Тогда // обычный варант расчета - дисконт начисленный движется от 0 к -НачальныйДисконт (всегда положительный)
		
			ОценочныеДисконтПремия = (РезультатРасчетаДисконтаПремии.ТекущийДисконт - НачальныйДисконт) * Количество;
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
			
			Если ОпределенияКлиентов.ЭтоКлиентСНГ Тогда
			
				ОценочныеДисконтПремия = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет - Окр(НачальныйДисконт * Количество, 2);
				ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				
			ИначеЕсли ОпределенияКлиентов.ЭтоКлиентСАФМАР Тогда
			
				ОценочныеДисконтПремия = Окр(РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество, 2) - Окр(НачальныйДисконт * Количество, 2);
				ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				
			ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСПолнымСписаниемПриАмортизациИПересчетомПриОфертах Тогда
				
				ОценочныеДисконтПремия = - РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет;
				ИзменениеДисконтаПремии = РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет;
				
			КонецЕсли;
			
		Иначе // варианта расчет УГМК - дисконт начисленный движется от НачальныйДисконт к 0 (всегда отрицательный)
			
			ОценочныеДисконтПремия = Окр(РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество, 2);
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия - Окр(НачальныйДисконт * Количество,2);
			
		КонецЕсли;
		
	ИначеЕсли НачальныйДисконт > 0 Тогда  // купили с премией
		
		ОценочныеДисконтПремия = Окр(РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество, 2);
		ИзменениеДисконтаПремии = ОценочныеДисконтПремия - Окр(НачальныйДисконт * Количество,2);
		
		Если ОпределенияКлиентов.ЭтоКлиентСНГ Тогда
		
			ОценочныеДисконтПремия = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет;
			ИзменениеДисконтаПремии = РезультатРасчетаДисконтаПремии.ТекущийДисконтНаПакет - Окр(НачальныйДисконт * Количество, 2);
		
		ИначеЕсли ОпределенияКлиентов.ЭтоКлиентСАФМАР Тогда
			
			ОценочныеДисконтПремия = Окр(РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество, 2);
			ИзменениеДисконтаПремии = Окр(РезультатРасчетаДисконтаПремии.ТекущийДисконт * Количество, 2) - Окр(НачальныйДисконт * Количество, 2);
			
		ИначеЕсли НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетодСПолнымСписаниемПриАмортизациИПересчетомПриОфертах Тогда
			
			ОценочныеДисконтПремия = РезультатРасчетаДисконтаПремии.ОценочныйДисконтНаПакет;
			ИзменениеДисконтаПремии = РезультатРасчетаДисконтаПремии.ИзменениеДисконтаНаПакет;
			
		КонецЕсли;
		
	Иначе // купили по номиналу - сделал эту ветку, чтобы копейки из-за округления не лезли
	
		ОценочныеДисконтПремия = 0;
		ИзменениеДисконтаПремии = 0;
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		ДанныеРасчета = Новый Структура;
		ДанныеРасчета.Вставить("НачальныйДисконт",				НачальныйДисконт);
		ДанныеРасчета.Вставить("ДатаПогашения",					ДатаПогашения);
		ДанныеРасчета.Вставить("Номинал",						Номинал);
		ДанныеРасчета.Вставить("ДнейОтПереоценкиДоПогашения",	ДнейОтПереоценкиДоПогашения);
		ДанныеРасчета.Вставить("ДнейОтПокупкиДоПогашения",		ДнейОтПокупкиДоПогашения);
		ДанныеРасчета.Вставить("ДнейОтПокупкиДоПереоценки",		ДнейОтПокупкиДоПереоценки);
		ДанныеРасчета.Вставить("ЭтоДеньПокупки",				НачалоДня(ДатаПокупки) = НачалоДня(ДатаПереоценки));
		ДанныеРасчета.Вставить("ЭтоДеньПогашения",				НачалоДня(ДатаПогашения) = НачалоДня(ДатаПереоценки));
		ДанныеРасчета.Вставить("ВариантУчетаДисконтаПремии",	НастройкиУчета.ВариантУчетаДисконтаПремии);
		ДанныеРасчета.Вставить("ТекущийДисконт",				РезультатРасчетаДисконтаПремии.ТекущийДисконт);
		ДанныеРасчета.Вставить("ПогашенияДисконтов",			РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
		ДанныеРасчета.Вставить("ОценочныеДисконтПремия",		ОценочныеДисконтПремия);
		ДанныеРасчета.Вставить("ИзменениеДисконтаПремии",		ИзменениеДисконтаПремии);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеРасчета", ДанныеРасчета, "Данные расчета", Истина, Истина);
		
	КонецЕсли;
	
	//Дополнительные данные, которые понадобятся при расчете корректировки ЭСП
	ДанныеРасчетаДисконтаПремии = Новый Структура;
	
	ДанныеРасчетаДисконтаПремии.Вставить("ОценочныеДисконтПремия",		ОценочныеДисконтПремия);
	ДанныеРасчетаДисконтаПремии.Вставить("ИзменениеДисконтаПремии",		ИзменениеДисконтаПремии);
	ДанныеРасчетаДисконтаПремии.Вставить("ДнейОтПокупкиДоПогашения",	ДнейОтПокупкиДоПогашения);
	ДанныеРасчетаДисконтаПремии.Вставить("ПогашенияДисконтов",			РезультатРасчетаДисконтаПремии.ПогашенияДисконтов);
	ДанныеРасчетаДисконтаПремии.Вставить("ДатаПогашения",				ДатаПогашения);
	ДанныеРасчетаДисконтаПремии.Вставить("Номинал",						Номинал);
	ДанныеРасчетаДисконтаПремии.Вставить("ДнейОтПереоценкиДоПогашения",	ДнейОтПереоценкиДоПогашения);
	
	Возврат ДанныеРасчетаДисконтаПремии;

КонецФункции 

Функция ПолучитьДниНачисленияКорректировкиЭСП(ПервыйДень, ПоследнийДень, Облигация, СчетДоверительногоУправления, НастройкиУчета, НастройкиУчетаАктива)

	Если НастройкиУчетаАктива.ПериодичностьНачисленияКорректировкиЭСП = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
		Возврат	Новый Массив;
	КонецЕсли;
	
	МассивДнейОпераций = Новый Массив;
	Если НастройкиУчетаАктива.НачислятьКорректировкуЭСПВДеньОперации Тогда // получим операции за период
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Период, ДЕНЬ) КАК День
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	БухПартииЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумаг.Период >= &ПервыйДень
			|	И БухПартииЦенныхБумаг.Период <= &ПоследнийДень
			|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И БухПартииЦенныхБумаг.Активность
			|	И (БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
			|				И НЕ &НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
			|				И НЕ &НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ПогашениеКупона
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ПогашениеЦеннойБумаги
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.Сделка
			|			ИЛИ БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.СделкаРЕПО)
			|
			|УПОРЯДОЧИТЬ ПО
			|	День";
		
		Запрос.УстановитьПараметр("ПервыйДень", ПервыйДень);
		Запрос.УстановитьПараметр("ПоследнийДень", ПоследнийДень);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
		Запрос.УстановитьПараметр("НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода", НастройкиУчета.НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода);
		
		МассивДнейОпераций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("День");
		
	КонецЕсли;
	
	МассивНерабочихДней = Новый Массив;
	Если НастройкиУчетаАктива.ПериодичностьНачисленияКорректировкиЭСП = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно
		И НЕ НастройкиУчетаАктива.НачислятьПроцентныеДоходыВНерабочиеДни Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеКалендаря.Дата КАК День
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|	И ДанныеКалендаря.ВидДня <> ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
			|	И ДанныеКалендаря.Дата >= &ПервыйДень
			|	И ДанныеКалендаря.Дата <= &ПоследнийДень
			|	И НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ) <> ДанныеКалендаря.Дата"; // конец месяца не может быть нерабочим днем
		
		Запрос.УстановитьПараметр("ПервыйДень", ПервыйДень);
		Запрос.УстановитьПараметр("ПоследнийДень", ПоследнийДень);
		
		МассивНерабочихДней = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("День");
			
	КонецЕсли;
	
	МассивДнейПереоценки = Новый Массив;
	ТекущаяДата = ПоследнийДеньПериода(ПервыйДень, НастройкиУчетаАктива.ПериодичностьНачисленияКорректировкиЭСП);
	Пока ТекущаяДата <= ПоследнийДень Цикл
		
		Если МассивНерабочихДней.Найти(ТекущаяДата) = Неопределено Тогда 
			МассивДнейПереоценки.Добавить(ТекущаяДата);
		КонецЕсли;
		
		ТекущаяДата = ПоследнийДеньПериода(ТекущаяДата + 86400, НастройкиУчетаАктива.ПериодичностьНачисленияКорректировкиЭСП);
		
	КонецЦикла;
	
	Если НастройкиУчетаАктива.НачислятьКорректировкуЭСПВДеньОперации Тогда
		Возврат СлитьУпорядоченныеМассивы(МассивДнейОпераций, МассивДнейПереоценки);	
	Иначе
		Возврат МассивДнейПереоценки;
	КонецЕсли;

КонецФункции 

Функция ПолучитьСтоимостьСУчетомАмортизацииНоминала(Цена, Облигация, ДатаНачальная, ДатаКонечная, НеАмортизироватьПремию = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК НоминалНачальный,
		|	НоминалыЦенныхБумагСрезПоследних1.Номинал КАК НоминалКонечный
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаНачальная, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних,
		|	РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаКонечная, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалыЦенныхБумагСрезПоследних1";
	
	Запрос.УстановитьПараметр("ДатаКонечная", ДатаКонечная);
	Запрос.УстановитьПараметр("ДатаНачальная", ДатаНачальная);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если НеАмортизироватьПремию И Цена > ВыборкаДетальныеЗаписи.НоминалНачальный Тогда
			
			Возврат ВыборкаДетальныеЗаписи.НоминалКонечный + (Цена - ВыборкаДетальныеЗаписи.НоминалНачальный);
			
		Иначе
			
			Возврат Цена / ВыборкаДетальныеЗаписи.НоминалНачальный * ВыборкаДетальныеЗаписи.НоминалКонечный;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Цена;
		
	КонецЕсли;

КонецФункции  

Функция НайтиДатыИзмененияПотоковПоРешениюКлиента(СчетДоверительногоУправления, Облигация, ДатаПокупки, ДатаПереоценки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумаг.Период КАК Дата
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг КАК ЗначенияНастроекУчетаЦенныхБумаг
		|ГДЕ
		|	ЗначенияНастроекУчетаЦенныхБумаг.Организация = &Организация
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Клиент = &Клиент
		|	И ЗначенияНастроекУчетаЦенныхБумаг.ЦеннаяБумага = &Облигация
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Период >= &ДатаПокупки
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Период <= &ДатаПереоценки
		|	И ЗначенияНастроекУчетаЦенныхБумаг.Настройка = &Настройка";
	
	Запрос.УстановитьПараметр("ДатаПереоценки", ДатаПереоценки);
	Запрос.УстановитьПараметр("ДатаПокупки", ДатаПокупки);
	Запрос.УстановитьПараметр("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки));
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации);
	Запрос.УстановитьПараметр("Организация", СчетДоверительногоУправления.Организация);
	Запрос.УстановитьПараметр("Облигация", Облигация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОпределитьНеобходимостьИспользованияМетодикиЦБПриРасчетеЭСПДоОферты(НастройкиУчета, Облигация, ДатаПокупки, ДатаПереоценки, СчетДоверительногоУправления, ДатыИзмененийИнформацииОДенежныхПотоках)

	ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты = Ложь;
	
	Если НастройкиУчета.ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты Тогда
		
		ДатыИзмененийИнформацииОДенежныхПотоках = НайтиДатыИзмененияПотоковПоРешениюКлиента(СчетДоверительногоУправления, Облигация, ДатаПокупки, ДатаПереоценки);
		
		Если ДатыИзмененийИнформацииОДенежныхПотоках.Количество() = 0 Тогда
		
			Если НастройкиУчета.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты Тогда
			
				ДатыИзмененийИнформацииОДенежныхПотоках = Справочники.Облигации.ПолучитьОфертыЗаПериод(Облигация, НачалоДня(ДатаПокупки), КонецДня(ДатаПереоценки));
				
			Иначе // если до погашения, то так 
				
				ДатыИзмененийИнформацииОДенежныхПотоках = Справочники.Облигации.ПолучитьДатыИзмененийИнформацииОДенежныхПотоках(Облигация, НачалоДня(ДатаПокупки), КонецДня(ДатаПереоценки));	
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если ДатыИзмененийИнформацииОДенежныхПотоках.Количество() > 0 Тогда
			
			ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты = Истина;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты;

КонецФункции

Функция РассчитатьКорректировкуПоЭСП(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, ДанныеРасчетаДисконтаПремии, Биржа, Отказ, РасшифровкаРасчета = Неопределено)  
	
	СчетДоверительногоУправления									= ДанныеПереоценки.СчетДоверительногоУправления;
	ДатаПереоценки													= ДанныеПереоценки.ДатаПереоценки;
	Количество														= ДанныеПереоценки.Количество;
	ОценочнаяСуммаКупона											= ДанныеПереоценки.ОценочнаяСуммаКупона;
	УчетныйАктивЕПС													= ДанныеПереоценки.УчетныйАктивЕПС; 
	Партия															= ДанныеПереоценки.Партия;
	СтрокаПартии													= ДанныеПереоценки.СтрокаПартии;
	Стоимость														= ДанныеПереоценки.Стоимость;
	
	РешенияКлиентовПоЗначениямЭСП									= Неопределено;
	ДанныеПереоценки.Свойство("РешенияКлиентовПоЗначениямЭСП", РешенияКлиентовПоЗначениямЭСП);

	КэшированныйДенежныйПоток										= Неопределено;
	ДанныеПереоценки.Свойство("ДенежныйПоток", КэшированныйДенежныйПоток);
	Если КэшированныйДенежныйПоток = Неопределено Тогда
		ДенежныйПоток = Неопределено;
	Иначе
		ДенежныйПоток = КэшированныйДенежныйПоток.Скопировать();
	КонецЕсли;
	
	НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные		= ДанныеПокупки.НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные; 
	ДатаПокупки														= ДанныеПокупки.ДатаПокупки; 
	ЦенаПокупки														= ДанныеПокупки.ЦенаПокупки; 
	ЦенаПокупкиКупона												= ДанныеПокупки.ЦенаПокупкиКупона; 
			
	ОценочныеДисконтПремия											= ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия;
	ИзменениеДисконтаПремии											= ДанныеРасчетаДисконтаПремии.ИзменениеДисконтаПремии;
	ПогашенияДисконтов												= ДанныеРасчетаДисконтаПремии.ПогашенияДисконтов;
	ДнейОтПокупкиДоПогашения										= ДанныеРасчетаДисконтаПремии.ДнейОтПокупкиДоПогашения;
	ДатаПогашения													= ДанныеРасчетаДисконтаПремии.ДатаПогашения;
	Номинал															= ДанныеРасчетаДисконтаПремии.Номинал;
	
	ДанныеПереоценки.Вставить("ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона", НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона);
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеПереоценки", ДанныеПереоценки, "Данные переоценки", Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеПокупки", ДанныеПокупки, "Данные покупки", Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеРасчетаДисконтаПремии", ДанныеРасчетаДисконтаПремии, "Данные расчета дисконта/премии", Истина);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "НастройкиУчета", НастройкиУчета, "Настройки учета", Истина, Истина);
		
	КонецЕсли;
	
	// завели в конце 2021 по просьбе Достойного Будущего (Сафмара) по больщей части для успокояния совести т.к. никогда не было такого большого пакета бумаг, чтобы сказалась 15ая цифра после запятой, и не будет, я думаю
	ТочностьОкругленияДисконтируемыхСуммДенежныхПотоковПриРасчетеАС = 14;

	МассивСчетовРОСТЕХа = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Ростех"),
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
																				ДатаПереоценки);
	ЭтоКлиентРОСТЕХ = (МассивСчетовРОСТЕХа.Найти(СчетДоверительногоУправления) <> Неопределено);
	
	Если ЭтоКлиентРОСТЕХ Тогда
		ТочностьОкругленияДисконтируемыхСуммДенежныхПотоковПриРасчетеАС = 2; // 2!!! Карл!!! 
		                                                                     // Эта штука используется в расчете РасчетСтоимостиПоЭСПМетодомЧИСТНЗ 
																			 // И там для этого случая есть хардкод т.к. РОСТЕХ "тут округляем, а тут нет"
																			 // Поэтому, если менять тут, то нужно не забыть поменять еще и в РасчетСтоимостиПоЭСПМетодомЧИСТНЗ
	КонецЕсли;
	
	
	// отрабатываем ситуацию: переоценка в день покупки + если только не нужна визуализация
	Если НачалоДня(ДатаПокупки) = НачалоДня(ДатаПереоценки) И РасшифровкаРасчета = Неопределено Тогда
		Возврат Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП", 0, 0, 0);
	КонецЕсли;
	
	Если НастройкиУчета.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ЛинейныйМетод Тогда 
		Возврат Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП", 0, 0, 0);
	КонецЕсли;
	
	// исходим из предположения, что если клиент однажды отказался от использования ЭСП, то он к ней уже не вернется
	// а то РешенияКлиентовПоЗначениямЭСП входло в конфликт с ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты
	Если РешенияКлиентовПоЗначениямЭСП = Неопределено Тогда
		РешениеКлиентаПоЭСП = РегистрыСведений.РешенияКлиентовПоЗначениямЭСП.ПолучитьПоПартии(Облигация, Партия, СтрокаПартии, ДатаПереоценки);
	Иначе
		СтрокиРешений = РешенияКлиентовПоЗначениямЭСП.НайтиСтроки(Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", Облигация, Партия, СтрокаПартии));
		Если СтрокиРешений.Количество() > 0 Тогда
			РешениеКлиентаПоЭСП = Новый Структура("Используется, ЭСП", СтрокиРешений[0].Используется, СтрокиРешений[0].ЭСП);
		Иначе	
			РешениеКлиентаПоЭСП = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если РешениеКлиентаПоЭСП <> Неопределено И НЕ РешениеКлиентаПоЭСП.Используется Тогда
		Возврат Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП", 0, 0, 0);
	КонецЕсли;			
	
	// нам нужно понять, до какого момента мы ищем - до оферты или до погашения
	Если НастройкиУчета.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения Тогда
		СчитаемДоПогашения = Истина;
	Иначе
		СчитаемДоПогашения = Ложь;
	КонецЕсли;
	
	МассивСчетовБудущего = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_БУДУЩЕЕ"),
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
																				ДатаПереоценки);
	ЭтоКлиентБудущее = (МассивСчетовБудущего.Найти(СчетДоверительногоУправления) <> Неопределено);
				
		
	// #Хардкод №3 - т.к. уже 3й то пишем #ТехническийДолг и ставим задачу на общую схему
	Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПочтаРФ_009") Тогда
		
		МассивСчетовТелеком = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																					ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ТелекомСоюз"),
																					ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
																					ДатаПереоценки);
		ЭтоКлиентТелеком = (МассивСчетовТелеком.Найти(СчетДоверительногоУправления) <> Неопределено);
		
		// #ОбъединениеБудущего. Тут при объединении Будущего проблем не возникнет. На данный момент эта бумага только у Будущего, Телекома и Эволюции. Будущее и Телеком объединятся, а Эволюция сама по себе.
		Если ЭтоКлиентБудущее ИЛИ ЭтоКлиентТелеком Тогда
		
			СчитаемДоПогашения = Ложь;
		
		КонецЕсли;
	
	КонецЕсли;
	
	ЭтоАвтодорУОПФ = Ложь;
	Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002")
		И ДатаПереоценки >= '20220707' 
		И ДатаПереоценки <= '20220831' Тогда
	
		МассивСчетовОПФ = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФОПФ"),
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
																				ДатаПереоценки);
		ЭтоКлиентОПФ = (МассивСчетовОПФ.Найти(СчетДоверительногоУправления) <> Неопределено);
		
		ЭтоАвтодорУОПФ = ЭтоКлиентОПФ;
		
	КонецЕсли;
	
	// Точность расчета ЭСП может быть увеличена клиентом
	
	ТочностьРасчетаЭСП = Неопределено;
	ЭтоКлиентСАФМАР = Ложь;
	
	Если ДатаПереоценки >= '20230101' И ЭтоКлиентГруппыБудущее(СчетДоверительногоУправления, ДатаПереоценки) Тогда
		ТочностьРасчетаЭСП = 0.0000000001; // #462467 группа Будущее стандартизировали все
	ИначеЕсли ДатаПереоценки >= '20210412' Тогда // #Хардкод #371436
	
		МассивСчетовСАФМАР = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"),
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
			ДатаПереоценки);
	
		ЭтоКлиентСАФМАР = (МассивСчетовСАФМАР.Найти(СчетДоверительногоУправления) <> Неопределено);

		Если ЭтоКлиентСАФМАР Тогда
			ТочностьРасчетаЭСП = 0.000000001;
		КонецЕсли;

	КонецЕсли;
	
	ДатыИзмененийИнформацииОДенежныхПотоках = Новый ТаблицаЗначений;
	
	// если в данный момент используется решение клиента по ЭСП,
	// или же по бумаге пришел денежный поток (а он приходит только для бумаг с постоянной ставкой без оферт и настроек)
	// то и нет никакого смысла считать по методике	ЦБ
	Если ДенежныйПоток <> Неопределено ИЛИ РешениеКлиентаПоЭСП <> Неопределено Тогда
	    ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты = Ложь;
	Иначе		
		ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты = ОпределитьНеобходимостьИспользованияМетодикиЦБПриРасчетеЭСПДоОферты(
			НастройкиУчета, Облигация, ДатаПокупки, ДатаПереоценки, СчетДоверительногоУправления, ДатыИзмененийИнформацииОДенежныхПотоках);
	КонецЕсли;
	
	
	Если ДенежныйПоток <> Неопределено Тогда
		// убрать потоки ранее даты покупки т.к. брали от ДатаНачалаРазмещения
		КоличествоПотоков = ДенежныйПоток.Количество();
		Для Инд = 0 По КоличествоПотоков - 1 Цикл
			СтрокаПотока = ДенежныйПоток[КоличествоПотоков - 1 - Инд];
			Если СтрокаПотока.Дата <= НачалоДня(ДатаПокупки) Тогда
				ДенежныйПоток.Удалить(СтрокаПотока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяДатаПокупки			= НачалоДня(ДатаПокупки);
	ТекущаяЦенаПокупки			= ЦенаПокупки;
	ТекущаяЦенаПокупкиКупона	= ЦенаПокупкиКупона;
	
	ТекущаяДатаПереоценки		= НачалоДня(ДатаПокупки);	
	
	Если ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты Тогда
		
		#Область Методика_ЦБ_при_расчете_ЭСП_до_оферты
		
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ЭСП", Новый ОписаниеТипов("Число"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ТекущаяЦенаПокупки", Новый ОписаниеТипов("Число"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ТекущаяЦенаПокупкиКупона", Новый ОписаниеТипов("Число"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("СтоимостьПоЭСП", Новый ОписаниеТипов("Число"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ТекущаяДатаПокупки", Новый ОписаниеТипов("Дата"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ТекущаяДатаПереоценки", Новый ОписаниеТипов("Дата"));
		ДатыИзмененийИнформацииОДенежныхПотоках.Колонки.Добавить("ТекущаяДатаНачалаДенежныхПотоков", Новый ОписаниеТипов("Дата"));
		
		ТекущаяДатаНачалаДенежныхПотоков = НачалоДня(ДатаПокупки);
		ДатаОпределенияЭСП = НачалоДня(Партия.Дата);
		
		Для каждого ДатаИзмененийИнформации Из ДатыИзмененийИнформацииОДенежныхПотоках Цикл
			
			РезультатыРасчета = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
				Облигация, СчитаемДоПогашения, ТекущаяДатаПокупки, ТекущаяЦенаПокупки, СчетДоверительногоУправления, Биржа, ТекущаяДатаПереоценки,
				НастройкиУчета.УчитыватьКупонКОферте, ТекущаяЦенаПокупкиКупона, ТочностьРасчетаЭСП, ДанныеПереоценки);
			ЭСП = РезультатыРасчета.Доходность;
			ДенежныйПоток = РезультатыРасчета.ДенежныйПоток;
			
			ИсторическаяРазрядностьОкругленияЭСП = БухгалтерскийУчет.ОпределитьНастройкуУчета(
				ДатаИзмененийИнформации.Дата,
				СчетДоверительногоУправления.Организация,
				СчетДоверительногоУправления,
				"РазрядностьОкругленияЭСП");
				
			Если ИсторическаяРазрядностьОкругленияЭСП > 0 Тогда
				ЭСП = Окр(ЭСП, ИсторическаяРазрядностьОкругленияЭСП);
			КонецЕсли;
			
			СтоимостьПоЭСП = РасчетСтоимостиПоЭСПМетодомЧИСТНЗ(
									Облигация,
									НачалоДня(ДатаИзмененийИнформации.Дата),
									ТекущаяДатаНачалаДенежныхПотоков,
									СчитаемДоПогашения,
									ЭСП,
									СчетДоверительногоУправления,
									НастройкиУчета,
									ДанныеПереоценки,
									ТочностьОкругленияДисконтируемыхСуммДенежныхПотоковПриРасчетеАС,
									ДенежныйПоток,
									Отказ,
									РасшифровкаРасчета);
			
			ТекущаяДатаПокупки = ДатаИзмененийИнформации.Дата;
			ТекущаяЦенаПокупки = СтоимостьПоЭСП;
			ТекущаяЦенаПокупкиКупона = Справочники.Облигации.ПолучитьКупон(Облигация, ДатаИзмененийИнформации.Дата, , Биржа);
			ТекущаяЦенаПокупки = ТекущаяЦенаПокупки - ТекущаяЦенаПокупкиКупона;
			
			ТекущаяДатаПереоценки = НачалоДня(ДатаИзмененийИнформации.Дата);
			ТекущаяДатаНачалаДенежныхПотоков = НачалоДня(ДатаИзмененийИнформации.Дата);
			
			 // При расчете до оферты в датах изменения будут даты оферт,
			 // а при расчете до погашения - даты публикации купонов. Это неочевидно.
			 // #Техдолг
			
			Если НастройкиУчета.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты Тогда
				ТекущаяДатаНачалаДенежныхПотоков = ТекущаяДатаНачалаДенежныхПотоков - 86400; // связано с тем, что в этот день может быть оферта и мы должны ее взять
			КонецЕсли;	
			
			ДатаИзмененийИнформации.ЭСП = ЭСП;
			ДатаИзмененийИнформации.ТекущаяЦенаПокупки = ТекущаяЦенаПокупки;
			ДатаИзмененийИнформации.ТекущаяЦенаПокупкиКупона = ТекущаяЦенаПокупкиКупона;
			ДатаИзмененийИнформации.СтоимостьПоЭСП = СтоимостьПоЭСП;
			ДатаИзмененийИнформации.ТекущаяДатаПокупки = ТекущаяДатаПокупки;
			ДатаИзмененийИнформации.ТекущаяДатаПереоценки = ТекущаяДатаПереоценки;
			ДатаИзмененийИнформации.ТекущаяДатаНачалаДенежныхПотоков = ТекущаяДатаНачалаДенежныхПотоков;
			
		КонецЦикла;
		
		ДенежныйПоток = Неопределено;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
		
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(
					РасшифровкаРасчета,
					"МетодикаЦБ",
					Новый Структура("ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты", ИспользоватьМетодикуЦБПриРасчетеЭСПДоОферты),
					"Использовать методику ЦБ при расчете ЭСП до оферты",
					Ложь);
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДатыИзмененийИнформацииОДенежныхПотоках", ДатыИзмененийИнформацииОДенежныхПотоках, "Даты изменений информации о денежных потоках", Истина);
			
		КонецЕсли;
		
		#КонецОбласти
		
	Иначе
		// иначе неправильно опеределяются решения клиентов при вводе бумаг - их вводят датой ввода, а не датой покупки
		ТекущаяДатаПереоценки = ДатаПереоценки;
		
	КонецЕсли;
	
	Если ТекущаяДатаПереоценки <> ДатаПереоценки Тогда
		РешениеКлиентаПоЭСП = РегистрыСведений.РешенияКлиентовПоЗначениямЭСП.ПолучитьПоПартии(Облигация, Партия, СтрокаПартии, ТекущаяДатаПереоценки);
	КонецЕсли;	
	
	// Нам нужно понять, начиная с какой даты мы ищем ближайшую оферту (погашение) 
	
	ДатаОпределенияПогашения = НачалоДня(ТекущаяДатаПереоценки);
	Если НастройкиУчета.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты Тогда
		ДатаОпределенияПогашения = КонецДня(ТекущаяДатаПереоценки); // мы переоцениваем вечером, после не прошедшей оферты
	КонецЕсли;
	
	// Получим ЭСП
	Если РешениеКлиентаПоЭСП = Неопределено Тогда
		
		ДанныеРасчета = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
			Облигация, СчитаемДоПогашения, ТекущаяДатаПокупки, ТекущаяЦенаПокупки, СчетДоверительногоУправления, Биржа, ДатаОпределенияПогашения,
			НастройкиУчета.УчитыватьКупонКОферте, ТекущаяЦенаПокупкиКупона, ТочностьРасчетаЭСП, ДанныеПереоценки, ДенежныйПоток);
			
		ЭСП = ДанныеРасчета.Доходность;
		Если ДенежныйПоток = Неопределено Тогда
			ДенежныйПоток = ДанныеРасчета.ДенежныйПоток;
		КонецЕсли;
		
			
		// возник прецедент: согласованная НКСД и клиентом ЭСП имеет точность 10 знаков, а по УП точность 7 знаков
		// решено применять РазрядностьОкругленияЭСП только для расчетной ЭСП
		Если ТекущаяДатаПокупки	= НачалоДня(ДатаПокупки) Тогда
			ДатаОпределенияРазрядностиОкругленияЭСП = НачалоДня(Партия.Дата); // если вводили
		Иначе
			ДатаОпределенияРазрядностиОкругленияЭСП = НачалоДня(ТекущаяДатаПокупки);
		КонецЕсли;
		ИсторическаяРазрядностьОкругленияЭСП = БухгалтерскийУчет.ОпределитьНастройкуУчета(
			ДатаОпределенияРазрядностиОкругленияЭСП,
			СчетДоверительногоУправления.Организация,
			СчетДоверительногоУправления,
			"РазрядностьОкругленияЭСП");
		
		Если ИсторическаяРазрядностьОкругленияЭСП > 0 Тогда
			ЭСП = Окр(ЭСП, ИсторическаяРазрядностьОкругленияЭСП);
		КонецЕсли;
		
	ИначеЕсли РешениеКлиентаПоЭСП.Используется Тогда
		
		// для ЭСП, предоставленной клиентом настройку РазрядностьОкругленияЭСП не применяем
		ЭСП = РешениеКлиентаПоЭСП.ЭСП;
		
	Иначе
		Возврат Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП", 0, 0, 0);
	КонецЕсли;
	
	НачальнаяСтоимость = ЦенаПокупки + ЦенаПокупкиКупона;
	
	// считаем линейные проценты 
	ЛинейныеПроценты = - ЦенаПокупкиКупона;
	
	Если НЕ НастройкиУчета.РасчетКорректировкиЭСПМетодомОтНСД Тогда
		ПогашенияКупонов = Справочники.Облигации.ПолучитьПогашенияКупонов(Облигация, СчитаемДоПогашения, ДатаПокупки, НачалоДня(ДатаПереоценки));
		Для каждого СтрокаПогашенияКупонов Из ПогашенияКупонов Цикл
			Если СтрокаПогашенияКупонов.Дата <= НачалоДня(ДатаПереоценки) Тогда
				ЛинейныеПроценты = ЛинейныеПроценты + СтрокаПогашенияКупонов.Поток;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
		НастройкиУчета,
		Облигация,
		УчетныйАктивЕПС,
		Партия,
		СтрокаПартии);
	
	// считаем стоимость по ЭСП тем или иным методом
	Если НЕ НастройкиУчета.РасчетСтоимостиМетодомЧИСТНЗ И НЕ ЭтоАвтодорУОПФ Тогда
		
		// #ТехДолг #371436
		// Впервые столкнулись с необходимостью расчета стоимости по ЭСП итерационным методом с учетом разницы ПП,
		// нужно будет проверить для остальных вариантов учета ПП
		
		НачальнаяСтоимостьСУчетомРазницыПП = НачальнаяСтоимость + НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;  
		
		ДанныеРасчета = РасчетСтоимостиПоЭСПИтерационнымМетодом(
								Облигация, 
								УчетныйАктивЕПС, 
								ТекущаяДатаПокупки, 
								НачальнаяСтоимостьСУчетомРазницыПП, 
								ДатаПереоценки, 
								СчитаемДоПогашения, 
								ЭСП, 
								СчетДоверительногоУправления, 
								НастройкиУчета, 
								ДанныеПереоценки, 
								Количество, 
								РасшифровкаРасчета);
								
		СтоимостьПоЭСП = ДанныеРасчета.СтоимостьПоЭСП;
		ПроцентыПоЭСП = ДанныеРасчета.ПроцентыПоЭСП - ПогашенияДисконтов;
		ПроцентыПоЭСПНаПакет = Окр(ПроцентыПоЭСП * Количество, 2);
		
	Иначе
		
		Если ЗначениеЗаполнено(НастройкиУчета.ДенежныйПотокПоОблигации) Тогда
			ДенежныйПоток = НастройкиУчета.ДенежныйПотокПоОблигации.Поток.Выгрузить();
			ДенежныйПоток.Колонки.Сумма.Имя = "Поток";
		КонецЕсли;
		
		// убираем из денежного потока уже прошедшие выплаты купонов - они уже не участвуют в расчете АС (а для ЭСП были нужны)
		Если ДенежныйПоток <> Неопределено Тогда
			КоличествоПотоков = ДенежныйПоток.Количество();
			Для Инд = 0 По КоличествоПотоков - 1 Цикл
				СтрокаПотока = ДенежныйПоток[КоличествоПотоков - 1 - Инд];
				Если СтрокаПотока.Дата <= НачалоДня(ДатаПереоценки) Тогда
					ДенежныйПоток.Удалить(СтрокаПотока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтоимостьПоЭСП = РасчетСтоимостиПоЭСПМетодомЧИСТНЗ(
								Облигация, 
								ДатаПереоценки, 
								ДатаПереоценки, 
								СчитаемДоПогашения, 
								ЭСП, 
								СчетДоверительногоУправления, 
								НастройкиУчета, 
								ДанныеПереоценки, 
								ТочностьОкругленияДисконтируемыхСуммДенежныхПотоковПриРасчетеАС,
								ДенежныйПоток,
								Отказ,
								РасшифровкаРасчета);
		
		// воткнул вот такое условие т.к. надо быстро
		// вообще мы с Сашей Т. это момент еще обсудим
		// ситуация такая: идет расчет АС для полного погашения
		// в данном случае АС = Номинал
		Если СтоимостьПоЭСП = 0 И НачалоДня(ДатаПогашения) = НачалоДня(ДатаПереоценки + 1) Тогда
			СтоимостьПоЭСП = Номинал;
		КонецЕсли;
		
		НеАмортизироватьПремию = Истина; // вынес на случай если у кого-то все же амортизировать
		НачальнаяСтоимость = ПолучитьСтоимостьСУчетомАмортизацииНоминала(ЦенаПокупки, Облигация, ДатаПокупки, ДатаПереоценки, НеАмортизироватьПремию) + ЦенаПокупкиКупона;		
		
		#Область Многочисленные_хардкоды_по_изменению_НачальнаяСтоимость_или_ИзменениеДисконтаПремии
		
		МассивСчетовЮгория = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ГСКЮгория"),
			ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
			ДатаПереоценки);

		ЭтоКлиентЮгория = (МассивСчетовЮгория.Найти(СчетДоверительногоУправления) <> Неопределено);
		
		// хардкод для бумаг прошедших реклассификацию, увы, но по-другому никак
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс") Тогда
			// #ОбъединениеБудущего. Эта бумага есть только у Будущего и Эволюции
			НачальнаяСтоимость = 863.929274101238;
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
			
			УчестьРеструктуризациюКупона = Ложь;
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PR116") 
				Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Телеком-Союз_ПР") //#698380
				Тогда
				НачальнаяСтоимость = 871.501393974676;
				УчестьРеструктуризациюКупона = Истина;
			ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN118")
				Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084") //#698380
				Тогда
				НачальнаяСтоимость = 881.35;
				ИзменениеДисконтаПремии = 0; // этот клиент включил дисконт в тело
				УчестьРеструктуризациюКупона = Истина;
			КонецЕсли;
			
			// вот эта добавка связано с особенностями бумаги Вейл Финанс, и его учета у Будущего 
			// вейл провел реструктуризацию купонов и по каждому погашению из 46,86 выплачивает лишь 14,96
			// а разница 34,9 зависает ввиде задолженности
			// но на партиях этой 34,9 нигде нет! Поэтому прилось захардкодить все "зависшие" задолженности
			Если УчестьРеструктуризациюКупона И ДатаПереоценки >= '20210310' Тогда
				НачальнаяСтоимость = НачальнаяСтоимость + 34.9;
				Если ДатаПереоценки >= '20210908' Тогда
					НачальнаяСтоимость = НачальнаяСтоимость + 34.9;
					Если ДатаПереоценки >= '20220309' Тогда
						НачальнаяСтоимость = НачальнаяСтоимость + 34.9;
						Если ДатаПереоценки >= '20220907' Тогда
							НачальнаяСтоимость = НачальнаяСтоимость + 34.9;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Магистраль_002") Тогда	
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN112")
				Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084") //#698380
				Тогда //НПФ Телеком-Союз АО ПН 250219-11 или НПФ БУДУЩЕЕ АО ПН 030518-2
				НачальнаяСтоимость = 928.806422303991;
				ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
			ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN118")
				Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084") //#698380
				Тогда //НПФ БУДУЩЕЕ АО ПН 040319-4 или НПФ БУДУЩЕЕ АО ПН 030518-2
				Если Количество = 1000000 Тогда
					НачальнаяСтоимость = 929.2432738100;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				ИначеЕсли Количество = 1499294 Тогда
					НачальнаяСтоимость = 929.3433012805;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				ИначеЕсли Количество = 351138 Тогда
					НачальнаяСтоимость = 929.3766437697;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				ИначеЕсли Количество = 167732 Тогда
					НачальнаяСтоимость = 929.3766437531;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				ИначеЕсли Количество = 226432 Тогда
					НачальнаяСтоимость = 928.5987226187;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				ИначеЕсли Количество = 226434 Тогда
					НачальнаяСтоимость = 928.5987226742;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				// #ОбъединениеБудущего. Из //НПФ Телеком-Союз АО ПН 250219-11	
				ИначеЕсли Количество = 28264 И ДатаПереоценки >= ДатаНачалаОбъединенияПортфелейГруппыБудущее() Тогда
					НачальнаяСтоимость = 928.806422303991;
					ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Пересвет") Тогда	
			НачальнаяСтоимость = 1.302094295;
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финстоун") Тогда	
			НачальнаяСтоимость = 566.03;
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
			Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PR116") Тогда 
				// #ОбъединениеБудущего. Финстоуна больше нет.	
				ИзменениеДисконтаПремии = 0; // этот клиент включил дисконт в тело
			КонецЕсли;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_291") И НачалоДня(ДатаПокупки) = '20201117' Тогда
			МассивСчетовФедерации = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																						ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Федерация"),
																						ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"),
																						ДатаПереоценки);
			ЭтоКлиентФедерация = (МассивСчетовФедерации.Найти(СчетДоверительногоУправления) <> Неопределено);
				
			Если ЭтоКлиентФедерация Тогда
				НачальнаяСтоимость = 1019.52;
				Если НЕ НастройкиУчета.РасчетКорректировкиЭСПМетодомОтНСД Тогда
					НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
				КонецЕсли;
			ИначеЕсли ЭтоКлиентБудущее И ДатаПереоценки >= ДатаНачалаОбъединенияПортфелейГруппыБудущее() Тогда
				// #ОбъединениеБудущего. Понаехалы из Федерации	
				Если Количество = 400 Или Количество = 1300 Или Количество = 600 Или Количество = 200000 Тогда
					НачальнаяСтоимость = 1019.52;
					Если НЕ НастройкиУчета.РасчетКорректировкиЭСПМетодомОтНСД Тогда
						НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		// #Техдолг #Хардкод #348229 Начальную стоимость Финконсалт, прошедшего реклассификацию, считаем по данным на 01.12.2020
		ИначеЕсли ДатаПереоценки >= '20201201'
			И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финконсалт")				// ООО Финконсалт, 4B02-02-00342-R-001P, 1000.00 RUB
			И СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN110")	// Эволюция  НПФ АО  ПН 250219-9(Образование 250219-9)
		Тогда	
			НачальнаяСтоимость = (364844000.00 - 36120.31 - 1240000.00 + 36432120.31) / 400000; // СС - Дисконт - Купон, взятые на 01.12.2020
			ИзменениеДисконтаПремии = ОценочныеДисконтПремия;
			
		// в процессе нескольких частичных переводов из этого портфеля этих бумаг
		// произошла потеря копейки из начальной стоимости, приходится корректировать
		// #561740
		ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Перспектива_ПР")
			И (Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26221") И НачалоДня(ДатаПереоценки) >= '20240930' И НачалоДня(ДатаПереоценки) < '20241101'
				ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26225") И Количество = 8588
				ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26236") И Количество = 113035 И НачалоДня(ДатаПереоценки) >= '20241031')
		Тогда
			 НачальнаяСтоимость = (Окр(НачальнаяСтоимость * Количество, 2) - 0.01) / Количество;
			 
		ИначеЕсли (СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Перспектива_ПР")
			И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26233") И Количество = 16377 И НачалоДня(ДатаПереоценки) >= '20241031')
			Или (СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Телеком-Союз_ПР")
			И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26233") И Количество = 16377 И НачалоДня(ДатаПереоценки) >= ДатаНачалаОбъединенияПортфелейГруппыБудущее())
		Тогда
			// #ОбъединениеБудущего. А это поедит в НПФ Телеком-Союз АО ПР
			 НачальнаяСтоимость = (Окр(НачальнаяСтоимость * Количество, 2) + 0.01) / Количество;
			
		// не нужно амортизировать начальную стоимость т.к. Югория амортизацию считает ЛИНЕЙНО(!!!) и период не учитывает 
		ИначеЕсли ЭтоКлиентЮгория Тогда 
			
			НачальнаяСтоимость = ЦенаПокупки + ЦенаПокупкиКупона;
			
			Если ДатаПереоценки >= '20230223' И ДатаПереоценки < '20240223' Тогда
				ДатаОкончанияВзятияАмортизаций = ДатаПереоценки; // на этом промежутке работал неправильный вариант
			Иначе
				ДатаОкончанияВзятияАмортизаций = ДатаПогашения;
			КонецЕсли;
			
			ТаблицаАмортизаций = ПолучитьТаблицуАмортизаций(Облигация, ДатаПокупки, ДатаОкончанияВзятияАмортизаций);
			Для каждого СтрокаТаблицыАмортизаций Из ТаблицаАмортизаций Цикл
				Если СтрокаТаблицыАмортизаций.Дата < ДатаПереоценки Тогда
					НачальнаяСтоимость = НачальнаяСтоимость - СтрокаТаблицыАмортизаций.Поток;
				КонецЕсли;
			КонецЦикла;
			
			ОценочнаяСуммаКупона = Справочники.Облигации.ПолучитьКупон(Облигация, НачалоДня(ДатаПереоценки), СчетДоверительногоУправления, Биржа) * Количество;
			
		КонецЕсли;
		
		#КонецОбласти
		
		ПроцентыПоЭСП			= СтоимостьПоЭСП - НачальнаяСтоимость + ЛинейныеПроценты + ЦенаПокупкиКупона;
		ПроцентыПоЭСПНаПакет	= Окр(СтоимостьПоЭСП * Количество, 2) - Окр(НачальнаяСтоимость * Количество, 2) + (ЛинейныеПроценты + ЦенаПокупкиКупона) * Количество;
		
		Если Не НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнания ИЛИ ДатаПереоценки < '20200401' Тогда // 31.03.2020 я (коля) сделал корректировку, чтобы ПП стало правильно
			ПроцентыПоЭСП		 = ПроцентыПоЭСП		- НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
			ПроцентыПоЭСПНаПакет = ПроцентыПоЭСПНаПакет - НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * Количество;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002") Тогда
			ПроцентыПоЭСП		 = ПроцентыПоЭСП		- МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
			ПроцентыПоЭСПНаПакет = ПроцентыПоЭСПНаПакет - МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) * Количество;
		Иначе
			ПроцентыПоЭСП		 = ПроцентыПоЭСП		+ МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные);
			ПроцентыПоЭСПНаПакет = ПроцентыПоЭСПНаПакет + МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) * Количество;
		КонецЕсли;

	КонецЕсли;
	

	Если НастройкиУчета.РасчетКорректировкиЭСПМетодомОтНСД Тогда
		
		АСНаПакет = Окр(СтоимостьПоЭСП * Количество, 2);
		
		ТелоНаПакет = Окр(Стоимость, 2);
		
		ОценочнаяКорректировкаЭСП = АСНаПакет - ТелоНаПакет - Окр(ОценочныеДисконтПремия, 2) - Окр(ОценочнаяСуммаКупона, 2);

		//Если СчетаДУСПравильнымУчетомПП.Найти(Партия.СчетДоверительногоУправления) = Неопределено ИЛИ ДатаПереоценки < '20200401' Тогда
		Если Не НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнания ИЛИ ДатаПереоценки < '20200401' Тогда
			// 31.03.2020 я (коля) сделал корректировку, чтобы ПП стало правильно
			ОценочнаяКорректировкаЭСП = ОценочнаяКорректировкаЭСП - Окр(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * Количество, 2);
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002")
			ИЛИ Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_291")
				И НачалоДня(ДатаПокупки) = '20201117'
				И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки) = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Федерация") 
			// #ОбъединениеБудущего. Понаехалы из Федерации	
			Или Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВЭБ.РФ_291")
				И НачалоДня(ДатаПокупки) = '20201117'
				И ЭтоКлиентБудущее И ДатаПереоценки >= ДатаНачалаОбъединенияПортфелейГруппыБудущее() И (Количество = 400 Или Количество = 1300 Или Количество = 600 Или Количество = 200000)
		Тогда
			ОценочнаяКорректировкаЭСП = ОценочнаяКорректировкаЭСП - Окр(МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) * Количество, 2);
		Иначе
			ОценочнаяКорректировкаЭСП = ОценочнаяКорректировкаЭСП + Окр(МатематическиеФункции.МодульЧисла(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) * Количество, 2);
		КонецЕсли;
	
	ИначеЕсли НастройкиУчета.РасчетСтоимостиИтерационноЕжедневноСПромежуточнымОкруглением Тогда 
		// методика УГМК: не округляем дисконт/премию, округляем всю корректировку (см. #363141)
		ОценочнаяКорректировкаЭСП = Окр(ПроцентыПоЭСП * Количество - (ИзменениеДисконтаПремии + ОценочнаяСуммаКупона + ЛинейныеПроценты * Количество), 2);
	Иначе
		// нормальные клиенты: округляем дисконт/премию (остальные части стоимости уже округлены) - собираем корректировку из сумм, округленных до 2х знаков
		ОценочнаяКорректировкаЭСП = ПроцентыПоЭСПНаПакет - (Окр(ИзменениеДисконтаПремии, 2) + ОценочнаяСуммаКупона + ЛинейныеПроценты * Количество);
		
		// #423823 - многострадальная бумага в портфелях Эволюции - купили за 1000.125, затем перевели 28.01.22 в другой портфель нечетное количество и т.к. фонд и СД считают "на пакет", а наш расчет на бумагу не совпадает сделал "как у фонда и СД"
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ПочтаРФ_009") И ДатаПереоценки >= '20220128' Тогда
		
			ПроцентыПоЭСПНаПакет = Окр(СтоимостьПоЭСП * Количество, 2) + (- НачальнаяСтоимость + ЛинейныеПроценты + ЦенаПокупкиКупона) * Количество;
			ОценочнаяКорректировкаЭСП = ПроцентыПоЭСПНаПакет - (Окр(ИзменениеДисконтаПремии, 2) + ОценочнаяСуммаКупона + ЛинейныеПроценты * Количество);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		РасчетКорректировкиЭСП = Новый Структура;
		
		РасчетКорректировкиЭСП.Вставить("СчитаемДоПогашения", СчитаемДоПогашения);
		РасчетКорректировкиЭСП.Вставить("ЭСП", ЭСП);
		РасчетКорректировкиЭСП.Вставить("ВидЭСП", ?(РешениеКлиентаПоЭСП = Неопределено, "Расчетная", "От клиента"));
		РасчетКорректировкиЭСП.Вставить("НачальнаяСтоимость", НачальнаяСтоимость);
		РасчетКорректировкиЭСП.Вставить("ЛинейныеПроценты", ЛинейныеПроценты);
		РасчетКорректировкиЭСП.Вставить("ПроцентыПоЭСП", ПроцентыПоЭСП);
		РасчетКорректировкиЭСП.Вставить("ПроцентыПоЭСПНаПакет", ПроцентыПоЭСПНаПакет);
		РасчетКорректировкиЭСП.Вставить("ИзменениеДисконтаПремии", ИзменениеДисконтаПремии);
		РасчетКорректировкиЭСП.Вставить("ОценочнаяСуммаКупона", ОценочнаяСуммаКупона);
		РасчетКорректировкиЭСП.Вставить("ОценочнаяСуммаКупонаНа1шт", Окр(ОценочнаяСуммаКупона / Количество, 4));
		РасчетКорректировкиЭСП.Вставить("ОценочнаяКорректировкаЭСП", ОценочнаяКорректировкаЭСП);
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РасчетКорректировкиЭСП", РасчетКорректировкиЭСП, "РасчетКорректировкиЭСП", Ложь, Истина);
		
	КонецЕсли;
	
	Возврат Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП", ОценочнаяКорректировкаЭСП, ЭСП, СтоимостьПоЭСП);

КонецФункции

// Считаем жуткие показатели по ЭСП
//
// Параметры:
//  Облигация															- Справочник.Облигации			- облигация по которой считаем
//	ДанныеПереоценки													- Любая коллекция с именованными реквизитами
//		ДатаПереоценки													- Дата							- для СЧА и переоценки нужно передавать конец дня, для остальных - дату и время расчета
//  	Количество														- Число							- количество облигаций
//  	ОценочнаяСуммаКупона											- Число							- стоимость купона на расчетную дату
//  	БалансовыйДисконт												- Число							- начисленный дисконт/премия на расчетную дату
//  	БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные	- Число							- начисленная корректировка ПП на расчетную дату
//  	УчетныйАктивЕПС													- Справочник.УчетныеАктивыЕПС	- на каком активе облигация на расчетную дату
//		Партия															- ДокументСсылка				- по некоторым видам документов проверяем отклонение от рыночной, по другим - нет
//	ДанныеПокупки   													- Любая коллекция с именованными реквизитами
//  	НачальныйДисконт												- Число							- дисконт/премия при покупке
//  	НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные		- Число							- корректировка ПП при покупке
//  	ДатаПокупки														- Дата							- дата покупки
//  	ЦенаПокупки														- Число							- цена покупки
//  	ЦенаПокупкиКупона												- Число							- цена покупки купона
//  НастройкиУчета														- Структура						- НастройкиУчетаОбщие
//  РасшифровкаРасчета													- Структура						- возвращаемый параметр для вывода на печать
//
// Возвращаемое значение:
//   Структура							- Содержит два ключа ОценочныеДисконтПремия и ОценочнаяКорректировкаЭСП
//
Функция РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(Облигация, ДанныеПереоценки, ДанныеПокупки, НастройкиУчета, Отказ, РасшифровкаРасчета = Неопределено) Экспорт
	
	ДатаПереоценки													= ДанныеПереоценки.ДатаПереоценки;
	Количество														= ДанныеПереоценки.Количество;
	ОценочнаяСуммаКупона											= ДанныеПереоценки.ОценочнаяСуммаКупона;
	БалансовыйДисконт												= ДанныеПереоценки.БалансовыйДисконт; 
	БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные	= ДанныеПереоценки.БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные; 
	УчетныйАктивЕПС													= ДанныеПереоценки.УчетныйАктивЕПС; 
	Партия															= ДанныеПереоценки.Партия;
	СтрокаПартии													= ДанныеПереоценки.СтрокаПартии;
	СчетДоверительногоУправления									= ДанныеПереоценки.СчетДоверительногоУправления;
	
	НачальныйДисконт												= ДанныеПокупки.НачальныйДисконт; 
	НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные		= ДанныеПокупки.НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные; 
	ДатаПокупки														= ДанныеПокупки.ДатаПокупки; 
	ДатаПокупкиНачальная											= ДанныеПокупки.ДатаПокупкиНачальная;
	КорректировкаЭСПНачальная										= ДанныеПокупки.КорректировкаЭСПНачальная;
	ЦенаПокупки														= ДанныеПокупки.ЦенаПокупки; 
	ЦенаПокупкиКупона												= ДанныеПокупки.ЦенаПокупкиКупона; 
	ЦенаПокупкиНачальная											= ДанныеПокупки.ЦенаПокупкиНачальная; 
	
	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	
	// Проверка входящих параметров
	Если ТипЗнч(Облигация) <> Тип("СправочникСсылка.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет процентных показателей возможен только по облигациям!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
			
	Если ТипЗнч(НачальныйДисконт) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан начальный дисконт!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(БалансовыйДисконт) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан балансовый дисконт!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана начальная разница первоначального признания!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана балансовая разница первоначального признания!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДатаПереоценки) <> Тип("Дата") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата переоценки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДатаПокупки) <> Тип("Дата") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата покупки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Количество) <> Тип("Число") ИЛИ Количество = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано количество ценных бумаг!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТребуетсяЦенаПокупки = (Облигация.Амортизационная 
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке 
		ИЛИ НастройкиУчета.ВариантУчетаДисконтаПремии = Перечисления.ВариантыУчетаПроцентныхДоходов.ВЗависимостиОтКритерияСущественности);	
			
	Если ТребуетсяЦенаПокупки И (ТипЗнч(ЦенаПокупки) <> Тип("Число") ИЛИ ЦенаПокупки = 0) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана цена покупки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
			
	Если ТребуетсяЦенаПокупки И ТипЗнч(ЦенаПокупкиКупона) <> Тип("Число") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана цена покупки!",,,, Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	
	Если РасшифровкаРасчета <> Неопределено Тогда
	
		РасшифровкаВходныеДанные = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Исходные данные", , , Истина);	
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаВходныеДанные, "Облигация", Новый Структура("Облигация, Амортизационная", Облигация, Облигация.Амортизационная), "Данные облигации");
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаВходныеДанные, "ДанныеПереоценки", ДанныеПереоценки, "Данные переоценки");
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаВходныеДанные, "ДанныеПокупки", ДанныеПокупки, "Данные покупки");
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаВходныеДанные, "НастройкиУчета", НастройкиУчета, "Настройки учета", Истина, Истина);
		
		
		РасшифровкаРазницыПервоначальногоПризнания = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расчет разницы первоначального признания", , , Истина);
		РасшифровкаДисконтаПремии = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расчет дисконта/премии", , , Истина);
		РасшифровкаКорректировкиЭСП = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расчет корректировки ЭСП", , , Истина);
		
	КонецЕсли;
	
	
	//разница первоначального признания. как будто премия
	ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
	ИзменениеРазницыПервоначальногоПризнанияНеНаблюдаемыеДанные = 0;
	
	ЗнакНачальнойРазницыПервоначальногоПризнания = ?(НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные > 0, 1, -1);
	
	НачальнаяРазницаПервоначальногоПризнанияПлюс 	= НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * ЗнакНачальнойРазницыПервоначальногоПризнания;
	БалансоваяРазницаПервоначальногоПризнанияПлюс	= БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * ЗнакНачальнойРазницыПервоначальногоПризнания;
	
	ДатаНачалаРасчетаРазницыПП = ДатаПокупки;
	
	НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
		НастройкиУчета,
		Облигация,
		УчетныйАктивЕПС,
		Партия,
		СтрокаПартии);
	
	Если Не НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнания 
		ИЛИ (Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Финконсалт") И СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN118")) Тогда
	 	// теперь такая хрень только для БУДУЩЕЕ ПН, которое пока по-старому
		// плясать надо не от начальной, а от балансовой. пишу это потому, что не уверен до конца, но будущее утверждает так
		// #ОбъединениеБудущего. Финконсалта больше нет.	
		НачальнаяРазницаПервоначальногоПризнанияПлюс = БалансоваяРазницаПервоначальногоПризнанияПлюс / Количество;
		
		НачалоРасчета = НачалоКвартала(ДатаПереоценки);
		Если ДатаПереоценки >= '20210101' Тогда // с 01.01.2021 будущее перешли на ежемесячный расчет корректировки ПП
			НачалоРасчета = НачалоМесяца(ДатаПереоценки);
		КонецЕсли;
		
		Если ДатаНачалаРасчетаРазницыПП < НачалоРасчета Тогда
			ДатаНачалаРасчетаРазницыПП = НачалоДня(НачалоРасчета - 1); // считаем с конца прошлого отчетного периода (месяца или квартала)
		КонецЕсли;
		
	КонецЕсли;
	
	НеРасчитыватьРазностьПП = ОтключенаОценкаРазницыПервоначальногоПризнания(НастройкиУчетаЦеннойБумаги, Партия, СтрокаПартии, Облигация, УчетныйАктивЕПС, ДатаПереоценки);
	
	Если НеРасчитыватьРазностьПП ИЛИ НачальнаяРазницаПервоначальногоПризнанияПлюс = 0 Тогда
		ДанныеРасчетаРазницыПервоначальногоПризнания = Новый Структура("ОценочныеДисконтПремия, ИзменениеДисконтаПремии", БалансоваяРазницаПервоначальногоПризнанияПлюс, 0);
	Иначе
		ДанныеПокупки.НачальныйДисконт = НачальнаяРазницаПервоначальногоПризнанияПлюс;
		ДанныеПокупки.ДатаПокупки = ДатаНачалаРасчетаРазницыПП;
		ДанныеРасчетаРазницыПервоначальногоПризнания = РассчитатьАмортизациюДисконтаПремии(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, Отказ,  РасшифровкаРазницыПервоначальногоПризнания);
		Если ДанныеРасчетаРазницыПервоначальногоПризнания = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеРасчетаРазницыПервоначальногоПризнания.ОценочныеДисконтПремия > БалансоваяРазницаПервоначальногоПризнанияПлюс Тогда
	
		ДанныеРасчетаРазницыПервоначальногоПризнания.ОценочныеДисконтПремия = БалансоваяРазницаПервоначальногоПризнанияПлюс;
		ДанныеРасчетаРазницыПервоначальногоПризнания.ИзменениеДисконтаПремии =  БалансоваяРазницаПервоначальногоПризнанияПлюс - НачальнаяРазницаПервоначальногоПризнанияПлюс * Количество;
		
		ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = ДанныеРасчетаРазницыПервоначальногоПризнания.ОценочныеДисконтПремия * ЗнакНачальнойРазницыПервоначальногоПризнания;
		ИзменениеРазницыПервоначальногоПризнанияНеНаблюдаемыеДанные = ДанныеРасчетаРазницыПервоначальногоПризнания.ИзменениеДисконтаПремии * ЗнакНачальнойРазницыПервоначальногоПризнания;
	
	КонецЕсли;
	
	ОценочнаяРазницаПервоначальногоПризнания = ДанныеРасчетаРазницыПервоначальногоПризнания.ОценочныеДисконтПремия * ЗнакНачальнойРазницыПервоначальногоПризнания;
	
	// #ТехническийДолг
	//
	// Проблема: бумаги были заведены вводом из другой УК, где их считали "до оферты"
	// причем ППА у нас всегда считает "до погашения"
	// было оф. письмо с просьбой именно эти бумаги считать "до оферты"
	// сделал хардкод т.к. они вот-вот погясятся (оферта обязательная) и лепить настройки не вижу смысла
	//
	Если СокрЛП(СчетДоверительногоУправления.КодСчета) = "DU_NPF232" Тогда // НПФ Первый промышленный альянс ПН АО
		Если СокрЛП(Облигация.ГосударственныйРегистрационныйНомер) = "4B02-01-32432-H" // ГТЛК ПАО, 4B02-01-32432-H, 1000.00 RUB
			ИЛИ СокрЛП(Облигация.ГосударственныйРегистрационныйНомер) = "4B02-02-32432-H" Тогда // ГТЛК ПАО, 4B02-02-32432-H, 1000.00 RUB 
			
			НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты;
			
		Иначе
			
			НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения;
			
		КонецЕсли;
	ИначеЕсли СокрЛП(СчетДоверительногоУправления.КодСчета) = "DU_NPF276" Тогда // НПФ Первый промышленный альянс
		Если СокрЛП(Облигация) = "ФПК, 4-01-55465-E, 1000.00 RUB" И НачалоДня(ДатаПереоценки) = '20190613' Тогда 
		
			НастройкиУчета.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоОферты;
		
		КонецЕсли;
	КонецЕсли;
	// #ТехническийДолг
	
	ДанныеПокупки.НачальныйДисконт = НачальныйДисконт;
	Если НастройкиУчета.РассчитыватьДисконтПремиюОтДатыРеклассификации Тогда
		ДанныеПокупки.ДатаПокупки = ДатаПокупки;
		ДанныеПокупки.ЦенаПокупки = ЦенаПокупки;
	Иначе
		ДанныеПокупки.ДатаПокупки = ДатаПокупкиНачальная;
		ДанныеПокупки.ЦенаПокупки = ЦенаПокупкиНачальная;
	КонецЕсли;
	ДанныеРасчетаДисконтаПремии = РассчитатьАмортизациюДисконтаПремии(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, Отказ, РасшифровкаДисконтаПремии);
	
	ДанныеПокупки.ДатаПокупки = ДатаПокупки;
	ДанныеПокупки.ЦенаПокупки = ЦенаПокупки;
	
	Если ДанныеРасчетаДисконтаПремии = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаПогашенияПройдена = (НачалоДня(ДанныеРасчетаДисконтаПремии.ДатаПогашения) < НачалоДня(ДатаПереоценки));
			
	Если НачальныйДисконт > 0 Тогда
		
		Если Окр(ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия, 2) > БалансовыйДисконт            // недосписали премии
			ИЛИ ДатаПогашенияПройдена Тогда
			
			ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия = БалансовыйДисконт;
			ДанныеРасчетаДисконтаПремии.ИзменениеДисконтаПремии = БалансовыйДисконт - НачальныйДисконт * Количество;
			
		КонецЕсли;
		
	ИначеЕсли НачальныйДисконт < 0 Тогда
		
		Если (Окр(ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия, 2) < БалансовыйДисконт            // недоначислили дисконта
			ИЛИ ДатаПогашенияПройдена) И
			Не (СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ГСК_ЮГОРИЯ") 
				И ДатаПереоценки = НачалоДня(ДанныеРасчетаДисконтаПремии.ДатаПогашения) 
				И Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ТрансНефть_0081"))
			// Югория передала эту облигацию с кривым дисконтом. Анна сказала что править ввод нельзя, в день погашения добивать до номинала.
			Тогда
			
			ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия = БалансовыйДисконт;
			ДанныеРасчетаДисконтаПремии.ИзменениеДисконтаПремии = БалансовыйДисконт;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// для реклассифицированных амортизационных бумаг может вылезти погрешность раздельной амортизации изменения дисконта/премии и корректировки  
	ПогрешностьРаздельнойАмортизации = 0;
	Если ТипЗнч(Партия) = Тип("ДокументСсылка.РеклассификацияАктивовЕПС") Тогда
	
		// у нас есть расчет 2х показателей: ОценочныеДисконтПремия и ИзменениеДисконтаПремии
		// связь этих показателей можно записать формулой ОценочныеДисконтПремия = НачальныйДисконтПремия + ИзменениеДисконтаПремии
		// оба этих показателя (ОценочныеДисконтПремия и ИзменениеДисконтаПремии) считаются линейно с даты покупки (и реклассификация ничего не меняет)
		// показатель ИзменениеДисконтаПремии используется при расчете корректировки ЭСП
		// но вот в чем фишка для реклассифицированных бумаг - для расчета корректировки ЭСП они не должны использовать ИзменениеДисконтаПремии с даты покупки
		// им нужно ИзменениеДисконтаПремии только с даты реклассификации!
		// поэтому мы делаем еще 1 расчет на ДатаПокупки (в ней лежит дата рекласса)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленный / РеклассификацияАктивовЕПСПартии.Количество * &Количество КАК ЧИСЛО(21, 2)) КАК ДисконтПремияНачисленный,
			|	ВЫРАЗИТЬ(РеклассификацияАктивовЕПСПартии.ДисконтПремия / РеклассификацияАктивовЕПСПартии.Количество * &Количество КАК ЧИСЛО(21, 2)) КАК ДисконтПремия
			|ИЗ
			|	Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
			|ГДЕ
			|	РеклассификацияАктивовЕПСПартии.Ссылка = &Партия
			|	И РеклассификацияАктивовЕПСПартии.НомерСтроки = &СтрокаПартии";
		
		Запрос.УстановитьПараметр("СтрокаПартии", СтрокаПартии);
		Запрос.УстановитьПараметр("Партия", Партия);
		Запрос.УстановитьПараметр("Количество", Количество);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если НастройкиУчета.СтоимостьТелаРавнаНоминалу Тогда // УГМК - они не такие как все
				ДисконтПремияВНачальнойСтоимости = ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный;
			Иначе
				ДисконтПремияВНачальнойСтоимости = ПолучитьСтоимостьСУчетомАмортизацииНоминала(ВыборкаДетальныеЗаписи.ДисконтПремияНачисленный, Облигация, ДатаПокупки, ДатаПереоценки);
			КонецЕсли;
			
			Если НачальныйДисконт <= 0 И ДатаПереоценки >= '20230101' И ДатаПокупки < '20230101'
				И (Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки)
					= ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_УГМК")) // УГМК перенесли дисконт в тело, поэтому для них изменение еще меньше
			Тогда
				ДисконтПремияВНачальнойСтоимости = ДисконтПремияВНачальнойСтоимости - ВыборкаДетальныеЗаписи.ДисконтПремия;
			КонецЕсли;
			
			ПогрешностьРаздельнойАмортизации = Окр(ДисконтПремияВНачальнойСтоимости, 2) - ДисконтПремияВНачальнойСтоимости;
			ДанныеРасчетаДисконтаПремии.ИзменениеДисконтаПремии = ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия - Окр(ДисконтПремияВНачальнойСтоимости, 2);
		
		КонецЕсли;
	
	КонецЕсли;		
	
	ОценочныеДисконтПремия = ДанныеРасчетаДисконтаПремии.ОценочныеДисконтПремия;
	ИзменениеДисконтаПремии = ДанныеРасчетаДисконтаПремии.ИзменениеДисконтаПремии;
	ПогашенияДисконтов = ДанныеРасчетаДисконтаПремии.ПогашенияДисконтов;
	
	Если НастройкиУчета.РассчитыватьДисконтПремиюОтДатыРеклассификации Тогда
		ПереоценкаВДеньПокупки = (НачалоДня(ДатаПокупки) = НачалоДня(ДатаПереоценки));
	Иначе
		ПереоценкаВДеньПокупки = (НачалоДня(ДатаПокупкиНачальная) = НачалоДня(ДатаПереоценки));
	КонецЕсли;
	
	ДатаПогашенияПройдена = (НачалоДня(ДанныеРасчетаДисконтаПремии.ДатаПогашения) <= ДатаПереоценки);
	
	Если ДатаПогашенияПройдена ИЛИ ПереоценкаВДеньПокупки Тогда
		
		Если ПереоценкаВДеньПокупки И РасшифровкаРасчета <> Неопределено Тогда // в день покупки делаем расчет если нужна визуализация
			ДанныеРасчета = РассчитатьКорректировкуПоЭСП(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, ДанныеРасчетаДисконтаПремии, Биржа, Отказ, РасшифровкаКорректировкиЭСП);
		КонецЕсли;
		
		ОценочнаяКорректировкаЭСП	= 0;
		ЭСПКорректировка			= 0;
		Если ДатаПогашенияПройдена Тогда
			СтоимостьПоЭСП			= ДанныеРасчетаДисконтаПремии.Номинал + Окр(ОценочнаяСуммаКупона / Количество, 2);
		Иначе
		    СтоимостьПоЭСП			= ЦенаПокупки;
		КонецЕсли;
		
		// если погашаем бумагу по АС, которая был приобретена с корректировкой ПП
		Если ДатаПогашенияПройдена И ДанныеПокупки.НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0 Тогда
			// И по этой бумаге у нас 'Правильный учет' (на языке закона это 'наличие наблюдаемых данных при ПП')
			// то КорректировкаЭСП должна стать равной КорректировкеПП с обратным знаком, что бы их сумма стала равна 0 и мы вышли на номинал
			
			// старый хардкод, облигация Роснефти покупалась очень давно
			ПриравнятьЭСПкППсОбратнымЗнаком = (Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДП_Роснфт2P7")
												И (ДатаПереоценки = '20240329235959' ИЛИ ДатаПереоценки = '20240403235959'));
												
			// у Национального 15.11.2024 было погашение бумаги с ПП
			ПриравнятьЭСПкППсОбратнымЗнаком = ПриравнятьЭСПкППсОбратнымЗнаком
				ИЛИ	(СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF375"));
			
			// а с 01.11.25 все бумаги идут по этой схеме
			ПриравнятьЭСПкППсОбратнымЗнаком = ПриравнятьЭСПкППсОбратнымЗнаком
				ИЛИ (НастройкиУчета.ПравильныйУчетПервоначальногоПризнания И ДатаПереоценки >= '20251101');
				
			Если ПриравнятьЭСПкППсОбратнымЗнаком Тогда
				ОценочнаяКорректировкаЭСП = - ДанныеПокупки.НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные * Количество;	
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		ДанныеРасчета = РассчитатьКорректировкуПоЭСП(Облигация, НастройкиУчета, ДанныеПереоценки, ДанныеПокупки, ДанныеРасчетаДисконтаПремии, Биржа, Отказ, РасшифровкаКорректировкиЭСП);
		
		ОценочнаяКорректировкаЭСП	= ДанныеРасчета.ОценочнаяКорректировкаЭСП;
		ЭСПКорректировка			= ДанныеРасчета.ЭСПКорректировка;
		СтоимостьПоЭСП				= ДанныеРасчета.СтоимостьПоЭСП;
				
		Если ТипЗнч(Партия) = Тип("ДокументСсылка.РеклассификацияАктивовЕПС")
			И НЕ НастройкиУчета.РасчетКорректировкиЭСПМетодомОтНСД Тогда
			
			Если НастройкиУчета.СтоимостьТелаРавнаНоминалу Тогда // УГМК - они не такие как все
				КорректировкаВНачальнойСтоимости = КорректировкаЭСПНачальная;
			Иначе
				КорректировкаВНачальнойСтоимости = ПолучитьСтоимостьСУчетомАмортизацииНоминала(КорректировкаЭСПНачальная, Облигация, ДатаПокупки, ДатаПереоценки);
			КонецЕсли;
			
			ОценочнаяКорректировкаЭСП = ОценочнаяКорректировкаЭСП + КорректировкаВНачальнойСтоимости - ПогрешностьРаздельнойАмортизации;
		КонецЕсли;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(
			РасшифровкаВходныеДанные, 
			"ДополнительныеДанные", 
			Новый Структура("ДатаПогашенияПройдена, ПереоценкаВДеньПокупки, НеРасчитыватьРазностьПП", ДатаПогашенияПройдена, ПереоценкаВДеньПокупки, НеРасчитыватьРазностьПП),
			"Дополнительные данные");
		
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(
			РасшифровкаРазницыПервоначальногоПризнания,
			"РезультатРасчета",
			Новый Структура("ОценочнаяРазницаПП, ИзменениеРазницыПП", ОценочнаяРазницаПервоначальногоПризнания, ИзменениеРазницыПервоначальногоПризнанияНеНаблюдаемыеДанные),
			"Результат расчета первоначального признания");
			
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(
			РасшифровкаДисконтаПремии,
			"РезультатРасчета",
			Новый Структура("ОценочныеДисконтПремия, ИзменениеДисконтаПремии, ПогашенияДисконтов", ОценочныеДисконтПремия, ИзменениеДисконтаПремии, ПогашенияДисконтов),
			"Результат расчета дисконта/премии");
			
		Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084") И Облигация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Автодор_002") Тогда
			ЦенаПП = - ОценочнаяРазницаПервоначальногоПризнания / Количество;
		Иначе
			ЦенаПП = ОценочнаяРазницаПервоначальногоПризнания / Количество;
		КонецЕсли;
			
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(
			РасшифровкаКорректировкиЭСП,
			"РезультатРасчета",
			Новый Структура("ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП, СтоимостьПоЭСПБезНКД, СтоимостьПоЭСПсУчетомКорректировкиПП", 
				ОценочнаяКорректировкаЭСП, ЭСПКорректировка, СтоимостьПоЭСП, СтоимостьПоЭСП - Окр(ОценочнаяСуммаКупона / Количество, 4), СтоимостьПоЭСП + ЦенаПП),
			"Результат расчета корректировки ЭСП");
			
	КонецЕсли;
	
	РезультатыРасчета = Новый Структура;
	РезультатыРасчета.Вставить("ОценочныеДисконтПремия",										Окр(ОценочныеДисконтПремия, 2));
	РезультатыРасчета.Вставить("ОценочнаяКорректировкаЭСП",										Окр(ОценочнаяКорректировкаЭСП, 2));
	РезультатыРасчета.Вставить("ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные",	Окр(ОценочнаяРазницаПервоначальногоПризнания, 2));
	
	РезультатыРасчета.Вставить("СтоимостьПоЭСП",												СтоимостьПоЭСП);
	РезультатыРасчета.Вставить("ЭСПКорректировка",												ЭСПКорректировка);
	
	Возврат РезультатыРасчета;

КонецФункции

Функция ПолучитьДатыИЦеныПокупки(ЦенныеБумаги, СчетДоверительногоУправления, ДатаПереоценки, ВключатьКомиссиюВСтоимость = Неопределено, РассчитанныеНастройкиДляПартии = Неопределено) Экспорт

	#Область Текст_запроса	
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравильныеПремииНачальные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПравильныеПремииНачальные.Партия КАК Партия,
		|	ПравильныеПремииНачальные.СтрокаПартии КАК СтрокаПартии,
		|	ПравильныеПремииНачальные.НачальныйДисконт КАК НачальныйДисконт
		|ПОМЕСТИТЬ ПравильныеПремииНачальные
		|ИЗ
		|	&ПравильныеПремииНачальные КАК ПравильныеПремииНачальные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенныеБумаги.НомерСтроки КАК НомерСтроки,
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЦенныеБумаги.Партия КАК Партия,
		|	ЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЦенныеБумаги.Количество КАК Количество
		|ПОМЕСТИТЬ ПереоценкаЦенныхБумагЦенныеБумаги
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|ГДЕ
		|	ЦенныеБумаги.Количество > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОблигацииПДпоАС
		|ИЗ
		|	ПереоценкаЦенныхБумагЦенныеБумаги КАК ПереоценкаЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага = Облигации.Ссылка
		|			И (Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПД))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС = УчетныеАктивыЕПС.Ссылка
		|			И (УчетныеАктивыЕПС.ВключатьРасходыПоПокупкеВСтоимость)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОблигацииПДпоАС.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОблигацииПоКоторымМожноИНужноКэшироватьДенежныйПоток
		|ИЗ
		|	_ОблигацииПДпоАС КАК _ОблигацииПДпоАС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ОблигацииПДпоАС.ЦеннаяБумага = УсловияОферт.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг КАК ЗначенияНастроекУчетаЦенныхБумаг
		|		ПО _ОблигацииПДпоАС.ЦеннаяБумага = ЗначенияНастроекУчетаЦенныхБумаг.ЦеннаяБумага
		|			И (ЗначенияНастроекУчетаЦенныхБумаг.Организация = &Организация)
		|			И (ЗначенияНастроекУчетаЦенныхБумаг.Клиент = &Клиент)
		|			И (ЗначенияНастроекУчетаЦенныхБумаг.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ДенежныйПотокПоОблигации))
		|ГДЕ
		|	УсловияОферт.Облигация ЕСТЬ NULL
		|	И ЗначенияНастроекУчетаЦенныхБумаг.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводЦенныхБумаг.Ссылка КАК Ссылка,
		|	ВводЦенныхБумагЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ВводЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВводЦенныхБумагЦенныеБумаги.Сумма КАК Сумма,
		|	ВводЦенныхБумагЦенныеБумаги.Количество КАК Количество,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаПокупки КАК СуммаПокупки,
		|	ВводЦенныхБумагЦенныеБумаги.ДисконтПремия КАК ДисконтПремия,
		|	ВводЦенныхБумаг.Дата КАК Дата,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаПокупкиКупона КАК СуммаПокупкиКупона,
		|	ВводЦенныхБумагЦенныеБумаги.СуммаКупонаРынок КАК СуммаКупонаРынок,
		|	ВводЦенныхБумагЦенныеБумаги.ДатаПокупки КАК ДатаПокупки,
		|	ВводЦенныхБумагЦенныеБумаги.ДатаРеклассификации КАК ДатаРеклассификации,
		|	ВводЦенныхБумагЦенныеБумаги.ДисконтПремияПокупки КАК ДисконтПремияПокупки,
		|	ВводЦенныхБумагЦенныеБумаги.КорректировкаЭСППриРеклассификации КАК КорректировкаЭСППриРеклассификации,
		|	ВводЦенныхБумагЦенныеБумаги.ЦенаРеклассификации КАК ЦенаРеклассификации
		|ПОМЕСТИТЬ _ВВодыЦенныхБумаг
		|ИЗ
		|	Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО ВводЦенныхБумаг.Ссылка = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|ГДЕ
		|	ВводЦенныхБумаг.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.ВводЦенныхБумаг))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВводЦенныхБумаг.Ссылка,
		|	ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеклассификацияАктивовЕПС.Ссылка КАК Ссылка,
		|	РеклассификацияАктивовЕПС.Дата КАК Дата,
		|	РеклассификацияАктивовЕПСПартии.НомерСтроки КАК НомерСтроки,
		|	РеклассификацияАктивовЕПСПартии.КорректировкаЭСП КАК КорректировкаЭСП,
		|	РеклассификацияАктивовЕПСПартии.Количество КАК Количество,
		|	РеклассификацияАктивовЕПСПартии.СуммаПокупки КАК СуммаПокупки,
		|	РеклассификацияАктивовЕПСПартии.ДатаПокупки КАК ДатаПокупки,
		|	РеклассификацияАктивовЕПСПартии.Стоимость КАК Стоимость,
		|	РеклассификацияАктивовЕПСПартии.Переоценка КАК Переоценка,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	РеклассификацияАктивовЕПСПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	РеклассификацияАктивовЕПСПартии.СтоимостьКупона КАК СтоимостьКупона,
		|	РеклассификацияАктивовЕПСПартии.ПереоценкаКупона КАК ПереоценкаКупона,
		|	РеклассификацияАктивовЕПСПартии.ДисконтПремияПокупки КАК ДисконтПремияПокупки
		|ПОМЕСТИТЬ _РеклассификацииАктивовЕПС
		|ИЗ
		|	Документ.РеклассификацияАктивовЕПС КАК РеклассификацияАктивовЕПС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО РеклассификацияАктивовЕПС.Ссылка = РеклассификацияАктивовЕПСПартии.Ссылка
		|ГДЕ
		|	РеклассификацияАктивовЕПС.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РеклассификацияАктивовЕПС.Ссылка,
		|	РеклассификацияАктивовЕПСПартии.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПО.Ссылка КАК Ссылка,
		|	СделкаРЕПО.Дата КАК Дата,
		|	СделкаРЕПОЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	СделкаРЕПОЦенныеБумаги.Цена КАК Цена,
		|	СделкаРЕПОЦенныеБумаги.ЦенаКупона КАК ЦенаКупона
		|ПОМЕСТИТЬ _СделкиРЕПО
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка
		|ГДЕ
		|	СделкаРЕПО.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.СделкаРЕПО))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СделкаРЕПО.Ссылка,
		|	СделкаРЕПОЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КоличествоБумагВСделках.Сделка КАК Сделка,
		|	КоличествоБумагВСделках.Количество КАК Количество
		|ПОМЕСТИТЬ _КоличествоБумагВСделках
		|ИЗ
		|	&КоличествоБумагВСделках КАК КоличествоБумагВСделках
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка КАК Партия,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИсполнениеОбязательствПоСделке.Основание КАК Сделка,
		|	ИсполнениеОбязательствПоСделке.Дата КАК Дата,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Цена КАК Цена,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦенаКупона КАК ЦенаКупона,
		|	ИсполнениеОбязательствПоСделке.ВалютаСделки КАК ВалютаСделки,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ВЫБОР
		|		КОГДА &БратьКурсНаДатуСделки
		|			ТОГДА Сделка.Дата
		|		ИНАЧЕ ИсполнениеОбязательствПоСделке.Дата
		|	КОНЕЦ КАК ДатаКурса
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО ИсполнениеОбязательствПоСделке.Ссылка = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО ИсполнениеОбязательствПоСделке.Основание = Сделка.Ссылка
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоставкаЦенныхБумаг.Ссылка,
		|	ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПоставкаЦенныхБумаг.Основание,
		|	ПоставкаЦенныхБумаг.Дата,
		|	ПоставкаЦенныхБумагЦенныеБумаги.Цена,
		|	ПоставкаЦенныхБумагЦенныеБумаги.ЦенаКупона,
		|	ПоставкаЦенныхБумаг.ВалютаСделки,
		|	ПоставкаЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ВЫБОР
		|		КОГДА &БратьКурсНаДатуСделки
		|			ТОГДА Сделка.Дата
		|		ИНАЧЕ ПоставкаЦенныхБумаг.Дата
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ПО ПоставкаЦенныхБумаг.Ссылка = ПоставкаЦенныхБумагЦенныеБумаги.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО ПоставкаЦенныхБумаг.Основание = Сделка.Ссылка
		|ГДЕ
		|	ПоставкаЦенныхБумаг.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.ПоставкаЦенныхБумаг))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сделка.Ссылка,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	Сделка.Ссылка,
		|	Сделка.Дата,
		|	СделкаЦенныеБумаги.Цена,
		|	СделкаЦенныеБумаги.ЦенаКупона,
		|	Сделка.ВалютаСделки,
		|	СделкаЦенныеБумаги.СтрокаПартии,
		|	Сделка.Дата
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО Сделка.Ссылка = СделкаЦенныеБумаги.Ссылка
		|ГДЕ
		|	Сделка.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ТИПЗНАЧЕНИЯ(ПереоценкаЦенныхБумагЦенныеБумаги.Партия) = ТИП(Документ.Сделка))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.Партия КАК Партия,
		|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Сделки.Сделка КАК Сделка,
		|	_Сделки.Дата КАК Дата,
		|	_Сделки.Цена КАК Цена,
		|	_Сделки.ЦенаКупона КАК ЦенаКупона,
		|	_Сделки.ВалютаСделки КАК ВалютаСделки,
		|	ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _СделкиСВалютнымиОблигациямиВРублях
		|ИЗ
		|	_Сделки КАК _Сделки
		|ГДЕ
		|	_Сделки.ВалютаСделки = &ВалютаУчета
		|	И ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала <> &ВалютаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.Партия КАК Партия,
		|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Сделки.Сделка КАК Сделка,
		|	_Сделки.Дата КАК Дата,
		|	_Сделки.Цена КАК Цена,
		|	_Сделки.ЦенаКупона КАК ЦенаКупона,
		|	_Сделки.ВалютаСделки КАК ВалютаСделки
		|ПОМЕСТИТЬ _СделкиСРублевымиБумагами
		|ИЗ
		|	_Сделки КАК _Сделки
		|ГДЕ
		|	НЕ _Сделки.Сделка В
		|				(ВЫБРАТЬ
		|					_СделкиСВалютнымиОблигациямиВРублях.Сделка
		|				ИЗ
		|					_СделкиСВалютнымиОблигациямиВРублях)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоСделке.Сделка КАК Сделка,
		|	РасходыПоСделке.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РасходыПоСделке.СуммаОборот КАК СуммаОборот
		|ПОМЕСТИТЬ _РасходыПоСделке
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			,
		|			&КонДата,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И (Организация, Сделка, ЦеннаяБумага) В
		|					(ВЫБРАТЬ
		|						&Организация КАК Организация,
		|						_СделкиСРублевымиБумагами.Сделка КАК Сделка,
		|						_СделкиСРублевымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага
		|					ИЗ
		|						_СделкиСРублевымиБумагами)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|				И Валюта = &ВалютаУчета) КАК РасходыПоСделке
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходыПоСделкеОбороты.Сделка,
		|	РасходыПоСделкеОбороты.ЦеннаяБумага,
		|	СУММА(РасходыПоСделкеОбороты.СуммаОборот * КурсыВалют.Кратность / КурсыВалют.Курс)
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			,
		|			&КонДата,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И (Сделка, ЦеннаяБумага) В
		|					(ВЫБРАТЬ
		|						_СделкиСВалютнымиОблигациямиВРублях.Сделка КАК Сделка,
		|						_СделкиСВалютнымиОблигациямиВРублях.ЦеннаяБумага КАК ЦеннаяБумага
		|					ИЗ
		|						_СделкиСВалютнымиОблигациямиВРублях)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|				И Валюта = &ВалютаУчета) КАК РасходыПоСделкеОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО РасходыПоСделкеОбороты.Период = КурсыВалют.Период
		|			И (ВЫРАЗИТЬ(РасходыПоСделкеОбороты.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = КурсыВалют.Валюта)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыПоСделкеОбороты.Сделка,
		|	РасходыПоСделкеОбороты.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.Количество КАК Количество
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(
		|			&КонДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СписокСтратегий)
		|				И (Сделка, ЦеннаяБумага) В
		|					(ВЫБРАТЬ
		|						_Сделки.Сделка КАК Сделка,
		|						_Сделки.ЦеннаяБумага КАК ЦеннаяБумага
		|					ИЗ
		|						_Сделки)) КАК УсловияСделокСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.Количество КАК Количество
		|ПОМЕСТИТЬ _НачальнаяКлассификация
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия
		|			ИЗ
		|				ПереоценкаЦенныхБумагЦенныеБумаги
		|			ГДЕ
		|				ПереоценкаЦенныхБумагЦенныеБумаги.Партия В
		|					(ВЫБРАТЬ
		|						ЗначенияДополнительныхСведений.Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|					ГДЕ
		|						ЗначенияДополнительныхСведений.Значение = ИСТИНА
		|						И ЗначенияДополнительныхСведений.Свойство = &ДополнительноеСвойствоПартий))
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления В(&СписокСтратегий)
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.Количество <> 0
		|	И БухПартииЦенныхБумаг.Активность
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаЦенныхБумагЦенныеБумаги.НомерСтроки КАК НомерСтроки,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.Партия КАК Партия,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЕСТЬNULL(_ВВодыЦенныхБумаг.УчетныйАктивЕПС, ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС) КАК УчетныйАктивЕПСНачальный,
		|	ВЫБОР
		|		КОГДА _ВВодыЦенныхБумаг.Дата < &ДатаЕПС
		|			ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ВВодыЦенныхБумаг.СуммаПокупки > 0
		|					ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.СуммаПокупки КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|				КОГДА _ВВодыЦенныхБумаг.ДисконтПремия > 0
		|					ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма + _ВВодыЦенныхБумаг.ДисконтПремия КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|				ИНАЧЕ (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА _ВВодыЦенныхБумаг.Дата < &ДатаЕПС
		|			ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.СуммаКупонаРынок КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|		ИНАЧЕ (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.СуммаПокупкиКупона КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|	КОНЕЦ КАК ЦенаКупона,
		|	ВЫБОР
		|		КОГДА _ВВодыЦенныхБумаг.Дата < &ДатаЕПС
		|			ТОГДА _ВВодыЦенныхБумаг.Дата
		|		КОГДА _ВВодыЦенныхБумаг.ДатаРеклассификации <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _ВВодыЦенныхБумаг.ДатаРеклассификации
		|		ИНАЧЕ _ВВодыЦенныхБумаг.ДатаПокупки
		|	КОНЕЦ КАК ДатаПокупки,
		|	ВЫБОР
		|		КОГДА _ВВодыЦенныхБумаг.Дата < &ДатаЕПС
		|			ТОГДА _ВВодыЦенныхБумаг.Дата
		|		ИНАЧЕ _ВВодыЦенныхБумаг.ДатаПокупки
		|	КОНЕЦ КАК ДатаПокупкиНачальная,
		|	0 КАК ДопРасходы,
		|	(ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.ДисконтПремияПокупки КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество КАК ДисконтПремияПокупкиНаОднуБумагу,
		|	_ВВодыЦенныхБумаг.КорректировкаЭСППриРеклассификации КАК КорректировкаЭСПНачальная,
		|	ВЫБОР
		|		КОГДА _ВВодыЦенныхБумаг.Дата < &ДатаЕПС
		|			ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ВВодыЦенныхБумаг.ЦенаРеклассификации > 0
		|					ТОГДА ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.ЦенаРеклассификации КАК ЧИСЛО(1, 0))
		|				КОГДА _ВВодыЦенныхБумаг.СуммаПокупки > 0
		|					ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.СуммаПокупки КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|				КОГДА _ВВодыЦенныхБумаг.ДисконтПремия > 0
		|					ТОГДА (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма + _ВВодыЦенныхБумаг.ДисконтПремия КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|				ИНАЧЕ (ВЫРАЗИТЬ(_ВВодыЦенныхБумаг.Сумма КАК ЧИСЛО(1, 0))) / _ВВодыЦенныхБумаг.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаПокупки
		|ПОМЕСТИТЬ ЦенныеБумагиДанныеПокупки
		|ИЗ
		|	ПереоценкаЦенныхБумагЦенныеБумаги КАК ПереоценкаЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВВодыЦенныхБумаг КАК _ВВодыЦенныхБумаг
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _ВВодыЦенныхБумаг.Ссылка
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _ВВодыЦенныхБумаг.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереоценкаЦенныхБумагЦенныеБумаги.НомерСтроки,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.Партия,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	(ВЫРАЗИТЬ(_РеклассификацииАктивовЕПС.Стоимость + _РеклассификацииАктивовЕПС.Переоценка + _РеклассификацииАктивовЕПС.ДисконтПремияНачисленный + _РеклассификацииАктивовЕПС.КорректировкаЭСП + _РеклассификацииАктивовЕПС.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК ЧИСЛО(1, 0))) / _РеклассификацииАктивовЕПС.Количество,
		|	(_РеклассификацииАктивовЕПС.СтоимостьКупона + _РеклассификацииАктивовЕПС.ПереоценкаКупона) / _РеклассификацииАктивовЕПС.Количество,
		|	_РеклассификацииАктивовЕПС.Ссылка.Дата,
		|	_РеклассификацииАктивовЕПС.ДатаПокупки,
		|	0,
		|	_РеклассификацииАктивовЕПС.ДисконтПремияПокупки / _РеклассификацииАктивовЕПС.Количество,
		|	ВЫРАЗИТЬ(_РеклассификацииАктивовЕПС.КорректировкаЭСП / _РеклассификацииАктивовЕПС.Количество * ПереоценкаЦенныхБумагЦенныеБумаги.Количество КАК ЧИСЛО(21, 2)),
		|	(ВЫРАЗИТЬ(_РеклассификацииАктивовЕПС.СуммаПокупки КАК ЧИСЛО(1, 0))) / _РеклассификацииАктивовЕПС.Количество
		|ИЗ
		|	ПереоценкаЦенныхБумагЦенныеБумаги КАК ПереоценкаЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РеклассификацииАктивовЕПС КАК _РеклассификацииАктивовЕПС
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _РеклассификацииАктивовЕПС.Ссылка
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _РеклассификацииАктивовЕПС.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереоценкаЦенныхБумагЦенныеБумаги.НомерСтроки,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.Партия,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	ЕСТЬNULL(_НачальнаяКлассификация.УчетныйАктивЕПС, ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС),
		|	ВЫРАЗИТЬ(_Сделки.Цена * ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = &ВалютаУчета
		|					ИЛИ _Сделки.ВалютаСделки <> &ВалютаУчета
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(КурсыВалют.Кратность, 1) / ЕСТЬNULL(КурсыВалют.Курс, 1)
		|		КОНЕЦ КАК ЧИСЛО(1, 0)),
		|	ВЫРАЗИТЬ(_Сделки.ЦенаКупона * ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = &ВалютаУчета
		|					ИЛИ _Сделки.ВалютаСделки <> &ВалютаУчета
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(КурсыВалют.Кратность, 1) / ЕСТЬNULL(КурсыВалют.Курс, 1)
		|		КОНЕЦ КАК ЧИСЛО(1, 0)),
		|	_Сделки.Дата,
		|	_Сделки.Дата,
		|	ЕСТЬNULL(ВЫРАЗИТЬ((ВЫРАЗИТЬ(РасходыПоСделке.СуммаОборот КАК ЧИСЛО(19, 2))) / ЕСТЬNULL(_КоличествоБумагВСделках.Количество, УсловияСделокСрезПоследних.Количество) КАК ЧИСЛО(1, 0)), 0),
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(_Сделки.Цена * ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = &ВалютаУчета
		|					ИЛИ _Сделки.ВалютаСделки <> &ВалютаУчета
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(КурсыВалют.Кратность, 1) / ЕСТЬNULL(КурсыВалют.Курс, 1)
		|		КОНЕЦ КАК ЧИСЛО(1, 0))
		|ИЗ
		|	ПереоценкаЦенныхБумагЦенныеБумаги КАК ПереоценкаЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Сделки КАК _Сделки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО (НАЧАЛОПЕРИОДА(_Сделки.ДатаКурса, ДЕНЬ) = КурсыВалют.Период)
		|				И (ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала = КурсыВалют.Валюта)
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _Сделки.Партия
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _Сделки.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоСделке
		|		ПО (_Сделки.Сделка = РасходыПоСделке.Сделка)
		|			И (_Сделки.ЦеннаяБумага = РасходыПоСделке.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК УсловияСделокСрезПоследних
		|		ПО (_Сделки.Сделка = УсловияСделокСрезПоследних.Сделка)
		|			И (_Сделки.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачальнаяКлассификация КАК _НачальнаяКлассификация
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага = _НачальнаяКлассификация.ЦеннаяБумага
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _НачальнаяКлассификация.Партия
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _НачальнаяКлассификация.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоБумагВСделках КАК _КоличествоБумагВСделках
		|		ПО (_Сделки.Сделка = _КоличествоБумагВСделках.Сделка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереоценкаЦенныхБумагЦенныеБумаги.НомерСтроки,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.Партия,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии,
		|	ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС,
		|	ЕСТЬNULL(_НачальнаяКлассификация.УчетныйАктивЕПС, ПереоценкаЦенныхБумагЦенныеБумаги.УчетныйАктивЕПС),
		|	_СделкиРЕПО.Цена,
		|	_СделкиРЕПО.ЦенаКупона,
		|	_СделкиРЕПО.Дата,
		|	_СделкиРЕПО.Дата,
		|	0,
		|	0,
		|	0,
		|	_СделкиРЕПО.Цена
		|ИЗ
		|	ПереоценкаЦенныхБумагЦенныеБумаги КАК ПереоценкаЦенныхБумагЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СделкиРЕПО КАК _СделкиРЕПО
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _СделкиРЕПО.Ссылка
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _СделкиРЕПО.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачальнаяКлассификация КАК _НачальнаяКлассификация
		|		ПО ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага = _НачальнаяКлассификация.ЦеннаяБумага
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.Партия = _НачальнаяКлассификация.Партия
		|			И ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии = _НачальнаяКлассификация.СтрокаПартии
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Партия КАК Партия,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.СтрокаПартии КАК СтрокаПартии,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки КАК ЗначениеНастройки
		|ПОМЕСТИТЬ _НастройкиСделок
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &Клиент
		|				И Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.НеВключатьРасходыВСтоимость)) КАК ЗначенияНастроекУчетаЦенныхБумагСрезПоследних
		|ГДЕ
		|	НЕ ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Отключить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенныеБумагиДанныеПокупки.НомерСтроки КАК НомерСтроки,
		|	ЦенныеБумагиДанныеПокупки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЦенныеБумагиДанныеПокупки.Партия КАК Партия,
		|	ЦенныеБумагиДанныеПокупки.СтрокаПартии КАК СтрокаПартии,
		|	ЦенныеБумагиДанныеПокупки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ЦенныеБумагиДанныеПокупки.КорректировкаЭСПНачальная <> 0
		|			ТОГДА ЦенныеБумагиДанныеПокупки.ЦенаПокупки
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу <> 0
		|			ТОГДА НоминалыЦенныхБумаг.Номинал + ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу
		|		КОГДА НЕ _НастройкиСделок.ЗначениеНастройки ЕСТЬ NULL
		|			ТОГДА ЦенныеБумагиДанныеПокупки.Цена
		|		КОГДА &ВключатьКомиссиюВСтоимость = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА УчетныеАктивыЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|							ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|						ТОГДА ЦенныеБумагиДанныеПокупки.Цена + ЦенныеБумагиДанныеПокупки.ДопРасходы
		|					ИНАЧЕ ЦенныеБумагиДанныеПокупки.Цена
		|				КОНЕЦ
		|		КОГДА &ВключатьКомиссиюВСтоимость = ИСТИНА
		|				ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|			ТОГДА ЦенныеБумагиДанныеПокупки.Цена + ЦенныеБумагиДанныеПокупки.ДопРасходы
		|		ИНАЧЕ ЦенныеБумагиДанныеПокупки.Цена
		|	КОНЕЦ КАК ЦенаПокупки,
		|	ЦенныеБумагиДанныеПокупки.ЦенаКупона КАК ЦенаКупона,
		|	ЦенныеБумагиДанныеПокупки.ДатаПокупки КАК ДатаПокупки,
		|	ЦенныеБумагиДанныеПокупки.ДопРасходы КАК ДопРасходы,
		|	НоминалыЦенныхБумаг.Номинал КАК НоминалПриПокупке,
		|	НоминалыЦенныхБумагСрезПоследних.Номинал КАК НоминалТекущий,
		|	Облигации.ДатаПогашения КАК ДатаПогашения,
		|	Облигации.ДатаНачалаРазмещения КАК ДатаНачалаРазмещения,
		|	РАЗНОСТЬДАТ(Облигации.ДатаПогашения, ЦенныеБумагиДанныеПокупки.ДатаПокупки, ДЕНЬ) КАК ДнейОтПокупкиДоПогашения,
		|	РАЗНОСТЬДАТ(Облигации.ДатаПогашения, &Период, ДЕНЬ) КАК ДнейОтПереоценкиДоПогашения,
		|	РАЗНОСТЬДАТ(&Период, ЦенныеБумагиДанныеПокупки.ДатаПокупки, ДЕНЬ) КАК ДнейОтПокупкиДоПереоценки,
		|	ВЫБОР
		|		КОГДА НЕ ПравильныеПремииНачальные.НачальныйДисконт ЕСТЬ NULL
		|			ТОГДА ПравильныеПремииНачальные.НачальныйДисконт
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу <> 0
		|			ТОГДА ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу = 0
		|				И ЦенныеБумагиДанныеПокупки.Цена <> НоминалыЦенныхБумаг.Номинал
		|				И НЕ НастройкиУчетаАктивовЕПССрезПоследних.ОтноситьРасходыПриПокупкеНаПремию
		|			ТОГДА 0
		|		КОГДА НЕ _НастройкиСделок.ЗначениеНастройки ЕСТЬ NULL
		|			ТОГДА ЦенныеБумагиДанныеПокупки.Цена - НоминалыЦенныхБумаг.Номинал
		|		КОГДА &ВключатьКомиссиюВСтоимость = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА УчетныеАктивыЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|							ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|						ТОГДА ЦенныеБумагиДанныеПокупки.Цена + ЦенныеБумагиДанныеПокупки.ДопРасходы - НоминалыЦенныхБумаг.Номинал
		|					ИНАЧЕ ЦенныеБумагиДанныеПокупки.Цена - НоминалыЦенныхБумаг.Номинал
		|				КОНЕЦ
		|		КОГДА &ВключатьКомиссиюВСтоимость = ИСТИНА
		|				ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|			ТОГДА ЦенныеБумагиДанныеПокупки.Цена + ЦенныеБумагиДанныеПокупки.ДопРасходы - НоминалыЦенныхБумаг.Номинал
		|		ИНАЧЕ ЦенныеБумагиДанныеПокупки.Цена - НоминалыЦенныхБумаг.Номинал
		|	КОНЕЦ КАК НачальныйДисконт,
		|	ЦенныеБумагиДанныеПокупки.ДатаПокупкиНачальная КАК ДатаПокупкиНачальная,
		|	ЦенныеБумагиДанныеПокупки.КорректировкаЭСПНачальная КАК КорректировкаЭСПНачальная,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|				И ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу <> 0
		|			ТОГДА НоминалыЦенныхБумаг.Номинал + ЦенныеБумагиДанныеПокупки.ДисконтПремияПокупкиНаОднуБумагу
		|		КОГДА НЕ _НастройкиСделок.ЗначениеНастройки ЕСТЬ NULL
		|			ТОГДА ЦенныеБумагиДанныеПокупки.ЦенаПокупки
		|		КОГДА &ВключатьКомиссиюВСтоимость = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВЫБОР
		|					КОГДА УчетныеАктивыЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|							ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|						ТОГДА ЦенныеБумагиДанныеПокупки.ЦенаПокупки + ЦенныеБумагиДанныеПокупки.ДопРасходы
		|					ИНАЧЕ ЦенныеБумагиДанныеПокупки.ЦенаПокупки
		|				КОНЕЦ
		|		КОГДА &ВключатьКомиссиюВСтоимость = ИСТИНА
		|				ИЛИ ЦенныеБумагиДанныеПокупки.ДатаПокупки < &ДатаУчетаРасходов
		|			ТОГДА ЦенныеБумагиДанныеПокупки.ЦенаПокупки + ЦенныеБумагиДанныеПокупки.ДопРасходы
		|		ИНАЧЕ ЦенныеБумагиДанныеПокупки.ЦенаПокупки
		|	КОНЕЦ КАК ЦенаПокупкиНачальная,
		|	НЕ _ОблигацииПоКоторымМожноИНужноКэшироватьДенежныйПоток.ЦеннаяБумага ЕСТЬ NULL КАК МожноИНужноКэшироватьДенежныйПоток
		|ИЗ
		|	ЦенныеБумагиДанныеПокупки КАК ЦенныеБумагиДанныеПокупки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦенныеБумагиДанныеПокупки.ЦеннаяБумага КАК ЦеннаяБумага,
		|			ЦенныеБумагиДанныеПокупки.ДатаПокупки КАК ДатаПокупки,
		|			МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ДатаИзменения
		|		ИЗ
		|			ЦенныеБумагиДанныеПокупки КАК ЦенныеБумагиДанныеПокупки
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|				ПО ЦенныеБумагиДанныеПокупки.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|					И ЦенныеБумагиДанныеПокупки.ДатаПокупки >= НоминалыЦенныхБумаг.Период
		|		ГДЕ
		|			ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЦенныеБумагиДанныеПокупки.ЦеннаяБумага,
		|			ЦенныеБумагиДанныеПокупки.ДатаПокупки) КАК ДатаИзмененияНоминала
		|		ПО (ДатаИзмененияНоминала.ЦеннаяБумага = ЦенныеБумагиДанныеПокупки.ЦеннаяБумага)
		|			И (ДатаИзмененияНоминала.ДатаПокупки = ЦенныеБумагиДанныеПокупки.ДатаПокупки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО (ДатаИзмененияНоминала.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага)
		|			И (ДатаИзмененияНоминала.ДатаИзменения = НоминалыЦенныхБумаг.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|				&Период,
		|				ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						ЦенныеБумагиДанныеПокупки.ЦеннаяБумага
		|					ИЗ
		|						ЦенныеБумагиДанныеПокупки КАК ЦенныеБумагиДанныеПокупки
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(ЦенныеБумагиДанныеПокупки.ЦеннаяБумага) = ТИП(Справочник.Облигации))) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО ЦенныеБумагиДанныеПокупки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|		ПО (УчетныеАктивыЕПС.Ссылка = ЦенныеБумагиДанныеПокупки.УчетныйАктивЕПСНачальный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (Облигации.Ссылка = ЦенныеБумагиДанныеПокупки.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаАктивовЕПС.СрезПоследних(
		|				&КонДата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета) КАК НастройкиУчетаАктивовЕПССрезПоследних
		|		ПО ЦенныеБумагиДанныеПокупки.УчетныйАктивЕПС = НастройкиУчетаАктивовЕПССрезПоследних.УчетныйАктив
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПравильныеПремииНачальные КАК ПравильныеПремииНачальные
		|		ПО ЦенныеБумагиДанныеПокупки.ЦеннаяБумага = ПравильныеПремииНачальные.ЦеннаяБумага
		|			И ЦенныеБумагиДанныеПокупки.Партия = ПравильныеПремииНачальные.Партия
		|			И ЦенныеБумагиДанныеПокупки.СтрокаПартии = ПравильныеПремииНачальные.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОблигацииПоКоторымМожноИНужноКэшироватьДенежныйПоток КАК _ОблигацииПоКоторымМожноИНужноКэшироватьДенежныйПоток
		|		ПО ЦенныеБумагиДанныеПокупки.ЦеннаяБумага = _ОблигацииПоКоторымМожноИНужноКэшироватьДенежныйПоток.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиСделок КАК _НастройкиСделок
		|		ПО ЦенныеБумагиДанныеПокупки.Партия = _НастройкиСделок.Партия
		|			И ЦенныеБумагиДанныеПокупки.СтрокаПартии = _НастройкиСделок.СтрокаПартии
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");	
	
	#КонецОбласти
	
	МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(СчетДоверительногоУправления);
	
	Если СокрЛП(СчетДоверительногоУправления.КодСчета) = "DU_NPF072" ИЛИ СокрЛП(СчетДоверительногоУправления.КодСчета) = "DU_NPF235" Тогда // НПФ Сбербанка АО, НПФ Сбербанка ПН АО
		ДатаУчетаРасходов = Дата(2016, 12, 31);
	Иначе	
		ДатаУчетаРасходов = Дата(1980, 1, 1);
	КонецЕсли;
	
	ПараметрыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетДоверительногоУправления, Новый Структура("Организация, ВалютаУчета", "Организация", "Организация.ВалютаУчета"));	
	
	#Область Хардкод_первоначального_количества_бумаг_по_сделке
	
	// #415421 #Хардкод: сделка иногда не джойнится, из-за чего некорректно считается цена покупки
	
	КоличествоБумагВСделках = Новый ТаблицаЗначений;
	КоличествоБумагВСделках.Колонки.Добавить("Сделка",		Метаданные.ОпределяемыеТипы.Сделки.Тип);
	КоличествоБумагВСделках.Колонки.Добавить("Количество",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
	
	Если ПараметрыОрганизации.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		СтрокаТаблицы = КоличествоБумагВСделках.Добавить();
		СтрокаТаблицы.Сделка	 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Покупка_РТ_260122_53_1012"); // Покупка РТ-260122/53-1012 от 26.01.2022 17:56:49
		СтрокаТаблицы.Количество = 956431;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Хардкод_неправильная_начальная_премия_по_ГТЛК_у_БудущугоПН_в_далеком_2018_а_также_у_ДБПН_в_не_очень_далеком_21
	
	// #436749 #Хардкод: поздно поняли, что ввод был косячный. с 30.06.2022 будем его считать правильно
	ПравильныеПремииНачальные = Новый ТаблицаЗначений;
	ПравильныеПремииНачальные.Колонки.Добавить("ЦеннаяБумага",		Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	ПравильныеПремииНачальные.Колонки.Добавить("Партия",			Метаданные.ОпределяемыеТипы.Партия.Тип);
	ПравильныеПремииНачальные.Колонки.Добавить("СтрокаПартии",		Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
	ПравильныеПремииНачальные.Колонки.Добавить("НачальныйДисконт",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
	
	Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_RT_PN084") И ДатаПереоценки >= '20220630' Тогда
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_006");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_БудущееПН_29062018");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 19;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 49.5;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_006");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_БудущееПН_29062018");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 20;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 52.5;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_006");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_БудущееПН_29062018");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 24;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 59.5;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_006");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_БудущееПН_29062018");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 25;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 60;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ГТЛК_006");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_БудущееПН_29062018");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 26;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 61;
		
	ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СафмарПН") И ДатаПереоценки >= '20230101' Тогда
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Красноярский край_012");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_ДБ_ПН_120821");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 167;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 67;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Красноярский край_012");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_ДБ_ПН_120821");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 168;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 67.7;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Красноярский край_012");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_ДБ_ПН_120821");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 169;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 67.7;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Красноярский край_012");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_ДБ_ПН_120821");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 170;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 67.6;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_МинФинМО_010");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("ВводЦБ_ДБ_ПН_120821");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 171;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 81.1;

	ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Национальный_ПН") И ДатаПереоценки >= '20251209' Тогда
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("Исполнение_НациональныйПН_RAM_081225_1666_1");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 161;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("Исполнение_НациональныйПН_RAM_081225_1666_2");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 161;
		
	ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_NPF375") И ДатаПереоценки >= '20250922' Тогда

		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("Исполнение_НациональныйПР_RAM_220925_375_1");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 235.1;
		
	ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Национальный_140225_1") И ДатаПереоценки >= '20250922' Тогда

		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("Исполнение_Национальный_140225_1_RAM_220925_1669_1");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 235.1;
		
	ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Национальный_РОПС") И ДатаПереоценки >= '20251209' Тогда
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Национальный_РОПС_RAM_081225_1643_1");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 161;
		
		СтрокаПравильныеПремииНачальные = ПравильныеПремииНачальные.Добавить();
		СтрокаПравильныеПремииНачальные.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V");
		СтрокаПравильныеПремииНачальные.Партия = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Национальный_РОПС_RAM_081225_1643_2");
		СтрокаПравильныеПремииНачальные.СтрокаПартии = 1;
		СтрокаПравильныеПремииНачальные.НачальныйДисконт = 161;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПравильныеПремииНачальные",				ПравильныеПремииНачальные);
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",					ПараметрыОрганизации.Организация);
	Запрос.УстановитьПараметр("ВидУчета",						Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Клиент",							Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки));
	Запрос.УстановитьПараметр("ВалютаУчета",					ПараметрыОрганизации.ВалютаУчета);
	Запрос.УстановитьПараметр("Период",							ДатаПереоценки);
	Запрос.УстановитьПараметр("КонДата",						КонецДня(ДатаПереоценки));
	Запрос.УстановитьПараметр("СписокСтратегий",				Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ВключатьКомиссиюВСтоимость",		ВключатьКомиссиюВСтоимость);
	Запрос.УстановитьПараметр("ЦенныеБумаги",					ЦенныеБумаги);
	Запрос.УстановитьПараметр("ДатаЕПС",						МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ);
	Запрос.УстановитьПараметр("ДатаУчетаРасходов",				ДатаУчетаРасходов);
	Запрос.УстановитьПараметр("КоличествоБумагВСделках",		КоличествоБумагВСделках);
	Запрос.УстановитьПараметр("ДополнительноеСвойствоПартий",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Партии по которым требуется УчетныйАктивЕПС Изнача"));
	
	ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		ДатаПереоценки,
		ПараметрыОрганизации.Организация,
		СчетДоверительногоУправления,
		Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет,
		"ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости");
		
	Запрос.УстановитьПараметр("БратьКурсНаДатуСделки",			ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости = Перечисления.ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости.НаДатуСделки);
	
	// Боремся с округлением SQL
	ТипЧислаЦена = Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип.КвалификаторыЧисла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(1, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаЦена.Разрядность, ТипЧислаЦена.РазрядностьДробнойЧасти));
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПартииПродававшиесяЗаДень(День, Организация, СчетДоверительногоУправления, НастройкиУчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И БухПартииЦенныхБумаг.Организация = &Организация
		|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.Количество <> 0
		|	И (ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Регистратор) <> ТИП(Документ.ВыводЦенныхБумаг)
		|			ИЛИ &БратьВыводы)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(День));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(День));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("БратьВыводы", НЕ НастройкиУчета.НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода);
	
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПДляПереоценки(ОбъектДокумента, ТабличнаяЧастьЦенныеБумаги, СообщенияОбОценочнойСтоимости = Неопределено, Отказ = Ложь) Экспорт 
	
	// это чисто ЕПСная процедура, СЧА ее не использует, она вызывается только для переоценки
	
	ДатаПереоценки = НачалоДня(ОбъектДокумента.Дата);
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления);
	
	НастройкиПереоценкиЦенныхБумаг = БухгалтерскийУчет.ОпределитьНастройкиУчетаЦенныхБумаг(ДатаПереоценки, 
		ОбъектДокумента.Организация,
		ОбъектДокумента.СчетДоверительногоУправления,
		"ПолучитьСписокНастроекДляПереоценки");
	
	//Если это первая переоценка до начала ведения учета
	Если НЕ ЗначениеЗаполнено(НастройкиУчетаОбщие.ВестиЕдиныйБухгалтерскийУчет) Тогда
		НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки + 86400, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления);
		Если НЕ ЗначениеЗаполнено(НастройкиУчетаОбщие.ВестиЕдиныйБухгалтерскийУчет) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату переоценки не ведется единый бухгалтерский учет!", ОбъектДокумента.Ссылка,,,);
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");

	Если НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии Тогда // у этих товарищей не нужно начислять дисконт/премию по тем бумагам и партиям, которые сегодня продавались - все уже начислено до нас
		ПартииПродававшиесяСегодня = ПолучитьПартииПродававшиесяЗаДень(ДатаПереоценки, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления, НастройкиУчетаОбщие);
	КонецЕсли;
	
	//Если ТипЗнч(ОбъектДокумента) = Тип("Структура") Тогда
		ЦенныеБумаги = ТабличнаяЧастьЦенныеБумаги.Скопировать(
				ТабличнаяЧастьЦенныеБумаги.НайтиСтроки(Новый Структура("Рынок", Перечисления.РынкиЦенныхБумаг.Облигации)));
	//Иначе
	//	ЦенныеБумаги = ОбъектДокумента.ЦенныеБумаги.Выгрузить(
	//			Новый Структура("Рынок", Перечисления.РынкиЦенныхБумаг.Облигации), "НомерСтроки,ЦеннаяБумага,Партия,СтрокаПартии,УчетныйАктивЕПС,Количество");
	//КонецЕсли;
	
	РешенияКлиентовПоЗначениямЭСП = РегистрыСведений.РешенияКлиентовПоЗначениямЭСП.ПолучитьПоСчету(ДатаПереоценки, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления);
	
	РезультатЗапроса = ПолучитьДатыИЦеныПокупки(ЦенныеБумаги, ОбъектДокумента.СчетДоверительногоУправления, ДатаПереоценки);
	
	КэшДенежныхПотоковПоОблигациям = Новый Соответствие();
	
	ОблигацииНаБалансеСПрошедшимПогашением = ПолучитьОблигацииНаБалансеСПрошедшимПогашением();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаЦенныеБумаги = ТабличнаяЧастьЦенныеБумаги[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		
		НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
			НастройкиУчетаОбщие,
			ВыборкаДетальныеЗаписи.ЦеннаяБумага,
			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС,
			ВыборкаДетальныеЗаписи.Партия,
			ВыборкаДетальныеЗаписи.СтрокаПартии);
		
		Если ВыборкаДетальныеЗаписи.ДатаПогашения = NULL Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату погашения для ЦБ " + ВыборкаДетальныеЗаписи.ЦеннаяБумага + " (" + ВыборкаДетальныеЗаписи.Партия + "/" + ВыборкаДетальныеЗаписи.СтрокаПартии + "). Возможно, дата покупки заполнена некорректно",,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаЦенныеБумаги.Партия) = Тип("ДокументСсылка.РеклассификацияАктивовЕПС")		// в день реклассификации ничего делать не нужно!
			И НачалоДня(СтрокаЦенныеБумаги.ДатаПартии) = НачалоДня(ДатаПереоценки)
			И НачалоДня(ДатаПереоценки) <> '20250101' Тогда 											// исключая 1.1.25 - это день перехода на МСФО9
		
			СтрокаЦенныеБумаги.ОценочныеДисконтПремия = СтрокаЦенныеБумаги.БалансовыеДисконтПремия;
			СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП = СтрокаЦенныеБумаги.БалансоваяКорректировкаЭСП;
			СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные = СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанные;
			
			Продолжить;
		
		КонецЕсли;
		
		
		// в день реформации баланса не работает ПрименитьПолитикуУчетаЕПС, поэтому еще тут контроль
		ОтборПоНастройке = Новый Структура("УчетныйАктивЕПС, Рынок, ЦеннаяБумага, Настройка, ЗначениеНастройки",
			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС,
			Перечисления.РынкиЦенныхБумаг.Облигации,
			ВыборкаДетальныеЗаписи.ЦеннаяБумага,
			ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ПериодичностьНачисленияПроцентныхДоходов,
			Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать);
		
		СтрокиНастроек = НастройкиПереоценкиЦенныхБумаг.НайтиСтроки(ОтборПоНастройке);
		
		Если СтрокиНастроек.Количество() > 0 Тогда // есть настройка, запрещающая начисление
			
			СтрокаЦенныеБумаги.ОценочнаяЦенаКупона  = СтрокаЦенныеБумаги.БалансоваяЦенаКупона;
			СтрокаЦенныеБумаги.ОценочнаяСуммаКупона = СтрокаЦенныеБумаги.БалансоваяСуммаКупона;
			СтрокаЦенныеБумаги.ОценочнаяСуммаКупонаВВалютеУчета = СтрокаЦенныеБумаги.БалансоваяСуммаКупонаВВалютеУчета;

			СтрокаЦенныеБумаги.ОценочныеДисконтПремия = СтрокаЦенныеБумаги.БалансовыеДисконтПремия;
			СтрокаЦенныеБумаги.ОценочныеДисконтПремияВВалютеУчета = СтрокаЦенныеБумаги.БалансовыеДисконтПремияВВалютеУчета;

			СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП = СтрокаЦенныеБумаги.БалансоваяКорректировкаЭСП;
			СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСПВВалютеУчета = СтрокаЦенныеБумаги.БалансоваяКорректировкаЭСПВВалютеУчета;
			СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные = СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанные;
			СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанныеВВалютеУчета = СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанныеВВалютеУчета;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДатаПогашения <= ДатаПереоценки														// бумага погашена, партии списаны, все по нулям, ничего не считаем
			И (ОблигацииНаБалансеСПрошедшимПогашением.Найти(ВыборкаДетальныеЗаписи.ЦеннаяБумага) = Неопределено)		// и не в списке исключений
			И ВыборкаДетальныеЗаписи.ДатаПогашения <> '00010101'														// и не бессрочная бумага
			И ДатаПереоценки < '20230715' Тогда																			// с 15.07.23 эта проверка не актуальна - дисконт/премия считаются нормально и так + суммы уходят при списании и погашении
			СтрокаЦенныеБумаги.ОценочныеДисконтПремия = 0;
			СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные = 0;
			Продолжить;
		КонецЕсли;
		
		// у клиента не считается ЭСП
		Если НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода <> Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке Тогда
			// по всем, кроме "через прибыль/убыток" считаем Корректировку ЭСП независимо от настроек
			Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.Родитель <> Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток
				И ВыборкаДетальныеЗаписи.УчетныйАктивЕПС <> Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО Тогда
				НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;
			КонецЕсли;
		КонецЕсли;
		
		ДенежныйПоток = Неопределено;
		Если НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке // нужно считать корректировку по ЭСП
			И ВыборкаДетальныеЗаписи.МожноИНужноКэшироватьДенежныйПоток Тогда // можно использовать кэш
			
			ДенежныйПоток = КэшДенежныхПотоковПоОблигациям[ВыборкаДетальныеЗаписи.ЦеннаяБумага];
			Если ДенежныйПоток = Неопределено Тогда
			
				ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(
					ВыборкаДетальныеЗаписи.ЦеннаяБумага,
					Новый Структура("ДоДатыПогашения, Дата, ДатаПереоценки", Истина, ВыборкаДетальныеЗаписи.ДатаНачалаРазмещения, ДатаПереоценки));
					
				КэшДенежныхПотоковПоОблигациям.Вставить(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ДенежныйПоток);
					
			КонецЕсли;
		
		КонецЕсли;
		
		ДанныеПереоценки = Новый Структура("Количество, ОценочнаяСуммаКупона, УчетныйАктивЕПС, Партия, СтрокаПартии");
		ЗаполнитьЗначенияСвойств(ДанныеПереоценки, СтрокаЦенныеБумаги, "Количество, ОценочнаяСуммаКупона, УчетныйАктивЕПС, Партия, СтрокаПартии");
		ДанныеПереоценки.Вставить("ДатаПереоценки", КонецДня(ДатаПереоценки)); // все расчеты у вечерней переоценки идут на конец дня
		ДанныеПереоценки.Вставить("БалансовыйДисконт", СтрокаЦенныеБумаги.БалансовыеДисконтПремия);
		ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаЦенныеБумаги.БалансоваяРазницаППНеНаблюдаемыеДанные);
		ДанныеПереоценки.Вставить("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
		ДанныеПереоценки.Вставить("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ОбъектДокумента.СчетДоверительногоУправления, ДатаПереоценки));
		ДанныеПереоценки.Вставить("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
		ДанныеПереоценки.Вставить("ЦельРасчета", БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет));
		НастройкиЦелиРасчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления, ДанныеПереоценки.ЦельРасчета);
		ДанныеПереоценки.Вставить("ВариантРасчетаОценочнойСтоимости" ,НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
		ДанныеПереоценки.Вставить("Стоимость", СтрокаЦенныеБумаги.Стоимость);
		ДанныеПереоценки.Вставить("РешенияКлиентовПоЗначениямЭСП", РешенияКлиентовПоЗначениямЭСП);
		ДанныеПереоценки.Вставить("ДенежныйПоток", ДенежныйПоток);
		
		ДанныеПокупки = Новый Структура("НачальныйДисконт,ДатаПокупки,ДатаПокупкиНачальная,КорректировкаЭСПНачальная,ЦенаПокупки,ЦенаПокупкиНачальная");
		ЗаполнитьЗначенияСвойств(ДанныеПокупки, ВыборкаДетальныеЗаписи, "НачальныйДисконт,ДатаПокупки,ДатаПокупкиНачальная,КорректировкаЭСПНачальная,ЦенаПокупки,ЦенаПокупкиНачальная");
		ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", СтрокаЦенныеБумаги.НачальнаяРазницаППНеНаблюдаемыеДанные / СтрокаЦенныеБумаги.Количество);
		ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ВыборкаДетальныеЗаписи.ЦенаКупона);
		
		ДанныеРасчета = РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(ВыборкаДетальныеЗаписи.ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ);
													
		Если ДанныеРасчета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаЦенныеБумаги.ОценочныеДисконтПремия = ДанныеРасчета.ОценочныеДисконтПремия;
		СтрокаЦенныеБумаги.ОценочнаяКорректировкаЭСП = ДанныеРасчета.ОценочнаяКорректировкаЭСП;
		СтрокаЦенныеБумаги.ОценочнаяРазницаППНеНаблюдаемыеДанные = ДанныеРасчета.ОценочнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные;
		
		Если ВыборкаДетальныеЗаписи.НачальныйДисконт > 0 Тогда
			
			Если СтрокаЦенныеБумаги.ОценочныеДисконтПремия > СтрокаЦенныеБумаги.БалансовыеДисконтПремия Тогда
			
				СтрокаЦенныеБумаги.ОценочныеДисконтПремия = СтрокаЦенныеБумаги.БалансовыеДисконтПремия;
			
			КонецЕсли;
		
		КонецЕсли;
		
		Если НастройкиУчетаЦеннойБумаги.УтреннееНачислениеДисконтаПремии Тогда
		
			СтрокиПродаж = ПартииПродававшиесяСегодня.НайтиСтроки(Новый Структура("ЦеннаяБумага,Партия,СтрокаПартии", СтрокаЦенныеБумаги.ЦеннаяБумага, СтрокаЦенныеБумаги.Партия, СтрокаЦенныеБумаги.СтрокаПартии));
			Если СтрокиПродаж.Количество() > 0 Тогда // продавали - не начисляем
				СтрокаЦенныеБумаги.ОценочныеДисконтПремия = СтрокаЦенныеБумаги.БалансовыеДисконтПремия;	
			КонецЕсли;
		КонецЕсли;
		
		Если СообщенияОбОценочнойСтоимости <> Неопределено Тогда 
			Если СтрокаЦенныеБумаги.НачальныеДисконтПремия < 0 Тогда
				// Купили с дисконтом, поэтому ОценочныеДисконтПремия сравниваем с НачальныеДисконтПремия для проверки не превысили ли мы его
				Если СтрокаЦенныеБумаги.ОценочныеДисконтПремия > -СтрокаЦенныеБумаги.НачальныеДисконтПремия Тогда
					ТекстСообщения = "Оповещение о переначислении дисконта/премии: По ценной бумаге " + Строка(СтрокаЦенныеБумаги.ЦеннаяБумага) + " при переоценке ЦБ рассчитанная сумма оценочного дисконта " + Строка(СтрокаЦенныеБумаги.ОценочныеДисконтПремия) + " превысила первоначальную сумму " + Строка(-СтрокаЦенныеБумаги.НачальныеДисконтПремия);
					
					Если СообщенияОбОценочнойСтоимости.НайтиПоЗначению(ТекстСообщения) = Неопределено Тогда
						СообщенияОбОценочнойСтоимости.Добавить(ТекстСообщения);
					КонецЕсли; 
				КонецЕсли;	
			ИначеЕсли СтрокаЦенныеБумаги.НачальныеДисконтПремия > 0 Тогда
				// Купили с премией, и тут просто проверяем не ушла ли премия в минус
				Если СтрокаЦенныеБумаги.ОценочныеДисконтПремия < 0 Тогда
					ТекстСообщения = "Оповещение о переначислении дисконта/премии: По ценной бумаге " + Строка(СтрокаЦенныеБумаги.ЦеннаяБумага) + " при переоценке ЦБ рассчитанная сумма оценочной премии " + Строка(СтрокаЦенныеБумаги.ОценочныеДисконтПремия) + " превысила первоначальную и ушла в минус.";
					
					Если СообщенияОбОценочнойСтоимости.НайтиПоЗначению(ТекстСообщения) = Неопределено Тогда
						СообщенияОбОценочнойСтоимости.Добавить(ТекстСообщения);
					КонецЕсли; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьПравильностьСписанияЦеннойБумаги(Облигация, ЭтотОбъект, Погашение, ДанныеПогашения, ВыборкаДетальныеЗаписи, НастройкиУчетаЦеннойБумаги, Отказ)

	Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Облигация) <> Тип("СправочникСсылка.Облигации") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьРаспределениеПоПартиям = Истина;
	
	Если ТипЗнч(Погашение) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги")
		И НастройкиУчетаЦеннойБумаги.РассчитыватьДисконтПремиюДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения Тогда
		Если Погашение.ВидПогашения = Перечисления.ВидыПогашения.Оферта Тогда
			ПроверятьРаспределениеПоПартиям = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// #Хардкод - по этой бумаге был давным-давно неправильный ввод
	Если ТипЗнч(Погашение) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") Тогда
		Если Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Белгородская007")
			И ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_БУДУЩЕЕ_ПР030518-1") Тогда
		
		    ПроверятьРаспределениеПоПартиям = Ложь;
			
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_МФ_и_НП_НСО") Тогда
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_НижгорОбл9") Тогда 
			// Коля:
			// тут скорее всего мой косяк - там сложный метод расчета и он где-то сбоит поэтому произошло переначисление дисконта
			// но клиент с этом было согласен, поэтому единственный вариант - погасить как есть, а потом разобраться с расчетом
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин26205")
			И ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СафмарПН") Тогда
			// Коля:
			// СОРЯН!!!
			// иначе никак с этим САФМАРОМ
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Белгородская008")
			И ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СафмарПН") Тогда
			// Коля: она пришла к нам "косая" из "УК Управление инвестициями ООО" и к погашению выровнять никак не смогли
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ХМЮгра_002")
			И ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СафмарПН") Тогда
			// Коля: она пришла к нам "косая" из "УК Управление инвестициями ООО" и к погашению выровнять никак не смогли
			// это последняя из косых сафмаровских - еще и с амортизацией
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_СамарОбл010")
			И ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_СТРОЙКОМПЛЕКС_ПН") Тогда
			// Коля: у СТРОЙКОМПЛЕКСа на ходу 1го июня 21го поменяли метод расчета дисконта и к погашению не сошлось
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ДОМ.РФ_016")
			И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ХантыМансийский") Тогда
			// Коля: Ханты еще в 19м году завели криво бумагу, так и не дошли руки исправить
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_РЖД_11") Тогда
			// Коля: это облигация трудной судьбы - её вместе со Сбер 045 и ГПБ 002 купили еще в 18 году и по ним первым была сделана корректировка ПП
			// и изменена ЭСП. Тогда еще никто не знал как это делать и оформлять, плюс еще корректировали ЭСП и ПП дважды и оба раза по расчету Ани и бухгалтерии фонда
			// в итоге к погашению немного не сошлись, но все с этим согласны
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_АльфаБанк_15")
			И Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_УГМК") Тогда
			// УГМК перспектива давала свои ЭСП с меньшей точностью, при этом корректировки ПП не делалось
			// естественно, к погашению КорректировкаЭСП на 0 не вышла, остались копейки
			ПроверятьРаспределениеПоПартиям = Ложь;
		ИначеЕсли Облигация.ВалютаНоминала <> ЭтотОбъект.Организация.ВалютаУчета Тогда
			// на текущий момент пока не ясно как проверять распределение - оплаты приходят в рублях причем, дата курса может быть выбрана по-разному
			ПроверятьРаспределениеПоПартиям = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СуммаСписания = ВыборкаДетальныеЗаписи.Стоимость + ВыборкаДетальныеЗаписи.ПремияНачисленная + ВыборкаДетальныеЗаписи.ДисконтНачисленный + ВыборкаДетальныеЗаписи.КорректировкаЭСП;
	Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда
		// когда-то (в 2019м) году мы не умели правильно вести корректировку ПП и отражали ее в теле - это случай ненаблюдаемых данных (хотя такие на бирже не возможны!)
		// потом мы сделали правильно, но по тем счетам, где она уже была, ничего менять было нельзя и мы оставили по ним как есть
		// для этого была введена функция ПолучитьМассивСчетовСПравильнымУчетомПП чтобы отделить Счета ДУ с учетом по-старому (неправильно) и по-новому (правильно)
		ВключатьВСуммуСписанияНачальнуюПП = Не НастройкиУчетаЦеннойБумаги.ПравильныйУчетПервоначальногоПризнания; // Клиенты с неправильным учетом включают ее в стоимость
		Если ВключатьВСуммуСписанияНачальнуюПП Тогда
			СуммаСписания = СуммаСписания + ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеНачальная; // начальную корректировку ПП - в тело!	
		КонецЕсли;
		
		// все остальные клиенты должны включать в стоимость корректироку ПП (не начальную! обычную!)
		СуммаСписания = СуммаСписания + ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные; // начальную корректировку ПП - в тело!	
		
	КонецЕсли;
	
	Если Облигация.ИндексируемыйНоминал Тогда
		НоминалПриПокупке = Справочники.Облигации.ПолучитьНоминал(Облигация, ВыборкаДетальныеЗаписи.ДатаПокупки);
		СуммаПогашения = НоминалПриПокупке * ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		ВариантУчетаИндексацииНоминала = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "ВариантУчетаИндексацииНоминала");
		Если ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала
			ИЛИ ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНоминалаПриПокупке Тогда
			
			Если ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНачальногоНоминала
					И ВыборкаДетальныеЗаписи.ИндексацияНоминала <> (ВыборкаДетальныеЗаписи.Номинал - Облигация.Номинал) * ВыборкаДетальныеЗаписи.КоличествоОстаток
				ИЛИ ВариантУчетаИндексацииНоминала = Перечисления.ВариантыУчетаИндексированногоНоминала.ОтНоминалаПриПокупке
					И ВыборкаДетальныеЗаписи.ИндексацияНоминала <> (ВыборкаДетальныеЗаписи.Номинал - НоминалПриПокупке) * ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма списываемой индексации номинала не совпадает с расчетной суммой индексации номинала " + Погашение,,,, Отказ);
			КонецЕсли;
				
		КонецЕсли;
	Иначе
		СуммаПогашения = ДанныеПогашения.Сумма / ДанныеПогашения.Количество * ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЕсли;
	
	Если ПроверятьРаспределениеПоПартиям И СуммаСписания <> СуммаПогашения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма распределения по партиям не совпадает с суммой погашения " + Погашение,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуОстатковПоПарнымСчетамДоходовРасходов(Граница, Организация, СчетДоверительногоУправления, ЗакрыватьПереоценки, ЗакрыватьКорректировкиЭСП, МассивУчетныхАктивов = Неопределено, МассивЦенныхБумаг = Неопределено, Ссылка = Неопределено) Экспорт

	// Формируем таблицу парных счетов по данным справочника Учетные активы ЕПС, присоединяем соответствующие остатки
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаДоходовОтОпераций КАК СчетП,
		|	УчетныеАктивыЕПС.СчетУчетаРасходовОтОпераций КАК СчетА,
		|	УчетныеАктивыЕПС.АналитикаДоходовОтПереоценки КАК АналитикаП,
		|	УчетныеАктивыЕПС.АналитикаРасходовОтПереоценки КАК АналитикаА,
		|	ЛОЖЬ КАК ЭтоКорректировка
		|ПОМЕСТИТЬ _ПарныеСчета
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	&ЗакрыватьПереоценки
		|	И УчетныеАктивыЕПС.Ссылка В(&МассивУчетныхАктивов)
		|	И УчетныеАктивыЕПС.АналитикаДоходовОтПереоценки <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.АналитикаРасходовОтПереоценки <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаДоходовОтОпераций <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаРасходовОтОпераций <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы05),
		|	ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы06),
		|	УчетныеАктивыЕПС.АналитикаДоходовОтКорректировки,
		|	УчетныеАктивыЕПС.АналитикаРасходовОтКорректировки,
		|	ИСТИНА
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	&ЗакрыватьКорректировкиЭСП
		|	И УчетныеАктивыЕПС.Ссылка В(&МассивУчетныхАктивов)
		|	И УчетныеАктивыЕПС.АналитикаДоходовОтКорректировки <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.АналитикаРасходовОтКорректировки <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Аналитика,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ОстаткиНаНачалоДокумента
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ДоДокумента,
		|			,
		|			&МассивСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И &МассивЦБ) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПарныеСчета КАК ПарныеСчета
		|		ПО (ПарныеСчета.АналитикаП = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
		|				ИЛИ ПарныеСчета.АналитикаА = ЕдиныйБухгалтерскийУчетОстатки.Субконто1)
		|			И (ПарныеСчета.СчетП = ЕдиныйБухгалтерскийУчетОстатки.Счет
		|				ИЛИ ПарныеСчета.СчетА = ЕдиныйБухгалтерскийУчетОстатки.Счет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПарныеСчета.СчетП КАК СчетП,
		|	_ПарныеСчета.СчетА КАК СчетА,
		|	_ПарныеСчета.АналитикаП КАК АналитикаП,
		|	_ПарныеСчета.АналитикаА КАК АналитикаА,
		|	_ОстаткиНаНачалоДокумента.ЦеннаяБумага КАК ЦеннаяБумага,
		|	-ЕСТЬNULL(_ОстаткиНаНачалоДокументаП.СуммаОстаток, 0) КАК СуммаОстатокП,
		|	ЕСТЬNULL(_ОстаткиНаНачалоДокументаА.СуммаОстаток, 0) КАК СуммаОстатокА
		|ИЗ
		|	_ПарныеСчета КАК _ПарныеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокумента
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокументаА
		|		ПО _ПарныеСчета.СчетА = _ОстаткиНаНачалоДокументаА.Счет
		|			И _ПарныеСчета.АналитикаА = _ОстаткиНаНачалоДокументаА.Аналитика
		|			И (_ОстаткиНаНачалоДокумента.ЦеннаяБумага = _ОстаткиНаНачалоДокументаА.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокументаП
		|		ПО _ПарныеСчета.СчетП = _ОстаткиНаНачалоДокументаП.Счет
		|			И _ПарныеСчета.АналитикаП = _ОстаткиНаНачалоДокументаП.Аналитика
		|			И (_ОстаткиНаНачалоДокумента.ЦеннаяБумага = _ОстаткиНаНачалоДокументаП.ЦеннаяБумага)
		|ГДЕ
		|	(ЕСТЬNULL(_ОстаткиНаНачалоДокументаП.СуммаОстаток, 0) <> 0
		|				И ЕСТЬNULL(_ОстаткиНаНачалоДокументаА.СуммаОстаток, 0) <> 0
		|			ИЛИ ЕСТЬNULL(_ОстаткиНаНачалоДокументаП.СуммаОстаток, 0) > 0
		|			ИЛИ ЕСТЬNULL(_ОстаткиНаНачалоДокументаА.СуммаОстаток, 0) < 0)";

	ВидСубконтоГФУДоходовРасходов = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов;
	ВидСубконтоЦенныеБумаги = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ВидСубконтоГФУДоходовРасходов);
	МассивСубконто.Добавить(ВидСубконтоЦенныеБумаги);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МассивЦБ", ?(ЗначениеЗаполнено(МассивЦенныхБумаг), "Субконто2 В (&МассивЦБ)", "ИСТИНА"));
	Если НЕ ЗначениеЗаполнено(МассивУчетныхАктивов) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И УчетныеАктивыЕПС.Ссылка В(&МассивУчетныхАктивов)", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСубконто",					МассивСубконто);
	Запрос.УстановитьПараметр("МассивУчетныхАктивов",			МассивУчетныхАктивов);
	Запрос.УстановитьПараметр("МассивЦБ", 						МассивЦенныхБумаг);
	Запрос.УстановитьПараметр("ДоДокумента",					Граница);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЗакрыватьПереоценки",			ЗакрыватьПереоценки);
	Запрос.УстановитьПараметр("ЗакрыватьКорректировкиЭСП",		ЗакрыватьКорректировкиЭСП);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		ТаблицаОстатковДо = Результат.Выгрузить();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректные остатки доходов и расходов: ", Ссылка);
		
		Для Каждого СтрокаОстатковДо из ТаблицаОстатковДо Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" " + СтрокаОстатковДо.ЦеннаяБумага 
			+ " (активный счет " + СтрокаОстатковДо.СчетА + ", ОФР " + СтрокаОстатковДо.АналитикаА + ": " + Формат(СтрокаОстатковДо.СуммаОстатокА, "ЧДЦ=2; ЧРД=.; ЧРГ=' '") 
			+ ", пассивный счет" + СтрокаОстатковДо.СчетП + ", ОФР " + СтрокаОстатковДо.АналитикаП + ": " + Формат(СтрокаОстатковДо.СуммаОстатокП, "ЧДЦ=2; ЧРД=.; ЧРГ=' '") +")", Ссылка);
		КонецЦикла;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПарныеСчета.СчетП КАК СчетП,
		|	_ПарныеСчета.СчетА КАК СчетА,
		|	_ПарныеСчета.АналитикаП КАК АналитикаП,
		|	_ПарныеСчета.АналитикаА КАК АналитикаА,
		|	ЕСТЬNULL(_ОстаткиНаНачалоДокумента.ЦеннаяБумага, НЕОПРЕДЕЛЕНО) КАК ЦеннаяБумага,
		|	-ЕСТЬNULL(_ОстаткиНаНачалоДокументаП.СуммаОстаток, 0) КАК СуммаОстатокП,
		|	ЕСТЬNULL(_ОстаткиНаНачалоДокументаА.СуммаОстаток, 0) КАК СуммаОстатокА,
		|	_ПарныеСчета.ЭтоКорректировка КАК ЭтоКорректировка
		|ПОМЕСТИТЬ _ОстаткиРазвернуто
		|ИЗ
		|	_ПарныеСчета КАК _ПарныеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокумента
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокументаА
		|		ПО _ПарныеСчета.СчетА = _ОстаткиНаНачалоДокументаА.Счет
		|			И _ПарныеСчета.АналитикаА = _ОстаткиНаНачалоДокументаА.Аналитика
		|			И (_ОстаткиНаНачалоДокумента.ЦеннаяБумага = _ОстаткиНаНачалоДокументаА.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиНаНачалоДокумента КАК _ОстаткиНаНачалоДокументаП
		|		ПО _ПарныеСчета.СчетП = _ОстаткиНаНачалоДокументаП.Счет
		|			И _ПарныеСчета.АналитикаП = _ОстаткиНаНачалоДокументаП.Аналитика
		|			И (_ОстаткиНаНачалоДокумента.ЦеннаяБумага = _ОстаткиНаНачалоДокументаП.ЦеннаяБумага)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ПарныеСчета.СчетП,
		|	_ПарныеСчета.СчетА,
		|	_ПарныеСчета.АналитикаП,
		|	_ПарныеСчета.АналитикаА,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	0,
		|	_ПарныеСчета.ЭтоКорректировка
		|ИЗ
		|	_ПарныеСчета КАК _ПарныеСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиРазвернуто.СчетП КАК СчетП,
		|	_ОстаткиРазвернуто.СчетА КАК СчетА,
		|	_ОстаткиРазвернуто.АналитикаП КАК АналитикаП,
		|	_ОстаткиРазвернуто.АналитикаА КАК АналитикаА,
		|	_ОстаткиРазвернуто.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиРазвернуто.СуммаОстатокП КАК СуммаОстатокП,
		|	_ОстаткиРазвернуто.СуммаОстатокА КАК СуммаОстатокА,
		|	_ОстаткиРазвернуто.ЭтоКорректировка КАК ЭтоКорректировка
		|ИЗ
		|	_ОстаткиРазвернуто КАК _ОстаткиРазвернуто";
		
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции 

Функция ОпределитьДатуНачалаБухгалтерскогоПериода(ДатаОпределения, Организация, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеформацииБалансов.ДатаРеформации КАК ДатаРеформации
		|ИЗ
		|	РегистрСведений.РеформацииБалансов КАК РеформацииБалансов
		|ГДЕ
		|	РеформацииБалансов.Организация = &Организация
		|	И РеформацииБалансов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РеформацииБалансов.ДатаРеформации < &ДатаОпределения
		|	И РеформацииБалансов.ДатаРеформации >= &ДатаНачалаГода
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРеформации УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(ДатаОпределения));
	Запрос.УстановитьПараметр("ДатаОпределения", ДатаОпределения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
		Возврат ВыборкаДетальныеЗаписи.ДатаРеформации + 24 * 60 * 60; // начало следующего дня
	
	КонецЕсли;
	
	Возврат	НачалоГода(ДатаОпределения);

КонецФункции

Функция ПолучитьВыборкуДляЗакрытияРасходов(ПараметрыЗапроса)

	ОбъектДокумента  = ПараметрыЗапроса.ОбъектДокумента;
	ВидЗадолженности = ПараметрыЗапроса.ВидЗадолженности;
	ТаблицаДоговоров = ПараметрыЗапроса.ТаблицаДоговоров;
	ВалютаОперации   = ПараметрыЗапроса.ВалютаОперации;
	
	МассивСубконто = Новый Массив;
	
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимДоходам Тогда
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	Иначе
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	КонецЕсли; 
	
	Если Не ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего
		И НЕ ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда
		МассивСубконто.Вставить(0, ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.НачислениеЗадолженности") Тогда
		
		Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего
			ИЛИ ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда
	
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДоговоров.Контрагент,
			|	ТаблицаДоговоров.Договор,
			|	ТаблицаДоговоров.Сумма
			|ПОМЕСТИТЬ _ТаблицаДоговоров
			|ИЗ
			|	&ТаблицаДоговоров КАК ТаблицаДоговоров
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДоговоров.Договор,
			|	СУММА(_ТаблицаДоговоров.Сумма) КАК Сумма,
			|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстаток,
			|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстаток
			|ИЗ
			|	_ТаблицаДоговоров КАК _ТаблицаДоговоров,
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&МоментДокумента,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02),
			|			&МассивСубконто,
			|			(Организация, СчетДоверительногоУправления, Валюта, Субконто1) В
			|					(ВЫБРАТЬ
			|						&Организация,
			|						&СчетДоверительногоУправления,
			|						&Валюта,
			|						&СчетДоверительногоУправления
			|					ИЗ
			|						_ТаблицаДоговоров КАК _ТаблицаДоговоров)
			|				И ЛицевойСчет.ДополнительнаяАналитика = &ДопАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДоговоров.Договор";
		
		Иначе
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДоговоров.Контрагент,
			|	ТаблицаДоговоров.Договор,
			|	ТаблицаДоговоров.Сумма
			|ПОМЕСТИТЬ _ТаблицаДоговоров
			|ИЗ
			|	&ТаблицаДоговоров КАК ТаблицаДоговоров
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДоговоров.Договор,
			|	СУММА(_ТаблицаДоговоров.Сумма) КАК Сумма,
			|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстаток,
			|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт) КАК СуммаОстаток
			|ИЗ
			|	_ТаблицаДоговоров КАК _ТаблицаДоговоров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|				&МоментДокумента,
			|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами12),
			|				&МассивСубконто,
			|				(Организация, СчетДоверительногоУправления, Валюта, Субконто1, Субконто2) В
			|					(ВЫБРАТЬ
			|						&Организация,
			|						&СчетДоверительногоУправления,
			|						&Валюта,
			|						_ТаблицаДоговоров.Контрагент,
			|						_ТаблицаДоговоров.Договор
			|					ИЗ
			|						_ТаблицаДоговоров КАК _ТаблицаДоговоров)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|		ПО _ТаблицаДоговоров.Контрагент = ЕдиныйБухгалтерскийУчетОстатки.Субконто1
			|			И _ТаблицаДоговоров.Договор = ЕдиныйБухгалтерскийУчетОстатки.Субконто2
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДоговоров.Договор";
		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата") Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДоговоров.Контрагент,
			|	ТаблицаДоговоров.Договор,
			|	ТаблицаДоговоров.Валюта,
			|	ТаблицаДоговоров.Сумма,
			|	ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов
			|ПОМЕСТИТЬ _ТаблицаДоговоров
			|ИЗ
			|	&ТаблицаДоговоров КАК ТаблицаДоговоров
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
		
		Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего
			ИЛИ ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда
	
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДоговоров.Договор КАК Договор,
			|	_ТаблицаДоговоров.Валюта КАК Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов КАК ГруппаФинансовогоУчетаДоходовРасходов,
			|	СУММА(_ТаблицаДоговоров.Сумма) КАК Сумма,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт)
			|		КОНЕЦ) КАК СуммаОстаток,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт)
			|		КОНЕЦ) КАК ВалютнаяСуммаОстаток
			|ИЗ
			|	_ТаблицаДоговоров КАК _ТаблицаДоговоров,
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
			|			&НачалоГода,
			|			&МоментДокумента,
			|			,
			|			,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03),
			|			&МассивСубконто,
			|			(Организация, СчетДоверительногоУправления, Субконто1) В
			|					(ВЫБРАТЬ
			|						&Организация,
			|						&СчетДоверительногоУправления,
			|						&СчетДоверительногоУправления
			|					ИЗ
			|						_ТаблицаДоговоров КАК _ТаблицаДоговоров)
			|				И ЛицевойСчет.ДополнительнаяАналитика = &ДопАналитика) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДоговоров.Договор,
			|	_ТаблицаДоговоров.Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов";
			
		ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимДоходам Тогда
			
			// #413910 - для прочих доходов не проставляется договор
			
			ТекстЗапроса =ТекстЗапроса + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДоговоров.Договор,
			|	_ТаблицаДоговоров.Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов,
			|	СУММА(_ТаблицаДоговоров.Сумма) КАК Сумма,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотКт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокДт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт)
			|		КОНЕЦ) КАК СуммаОстаток,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотКт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотКт)
			|		КОНЕЦ) КАК ВалютнаяСуммаОстаток
			|ИЗ
			|	_ТаблицаДоговоров КАК _ТаблицаДоговоров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
			|				&НачалоГода,
			|				&МоментДокумента,
			|				,
			|				,
			|				Счет = &СчетУчетаРасчетов,
			|				&МассивСубконто,
			|				(Организация, СчетДоверительногоУправления, Валюта, Субконто1) В
			|					(ВЫБРАТЬ
			|						&Организация,
			|						&СчетДоверительногоУправления,
			|						_ТаблицаДоговоров.Валюта,
			|						_ТаблицаДоговоров.Контрагент
			|					ИЗ
			|						_ТаблицаДоговоров КАК _ТаблицаДоговоров)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
			|		ПО _ТаблицаДоговоров.Контрагент = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1
			|			И _ТаблицаДоговоров.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДоговоров.Договор,
			|	_ТаблицаДоговоров.Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов";
			Запрос.УстановитьПараметр("СчетУчетаРасчетов", ПланыСчетов.Единый.Расчеты23);
			
		Иначе
						
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаДоговоров.Договор,
			|	_ТаблицаДоговоров.Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов,
			|	СУММА(_ТаблицаДоговоров.Сумма) КАК Сумма,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотДт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстатокКт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт)
			|		КОНЕЦ) КАК СуммаОстаток,
			|	СУММА(ВЫБОР
			|			КОГДА _ТаблицаДоговоров.Сумма <= ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотДт
			|					ИЛИ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт - (ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт - ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ВалютнаяСуммаОборотДт)
			|		КОНЕЦ) КАК ВалютнаяСуммаОстаток
			|ИЗ
			|	_ТаблицаДоговоров КАК _ТаблицаДоговоров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
			|				&НачалоГода,
			|				&МоментДокумента,
			|				,
			|				,
			|				Счет = &СчетУчетаРасчетов,
			|				&МассивСубконто,
			|				(Организация, СчетДоверительногоУправления, Валюта, Субконто1, Субконто2) В
			|					(ВЫБРАТЬ
			|						&Организация,
			|						&СчетДоверительногоУправления,
			|						_ТаблицаДоговоров.Валюта,
			|						_ТаблицаДоговоров.Контрагент,
			|						_ТаблицаДоговоров.Договор
			|					ИЗ
			|						_ТаблицаДоговоров КАК _ТаблицаДоговоров)) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты
			|		ПО _ТаблицаДоговоров.Контрагент = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто1
			|			И _ТаблицаДоговоров.Договор = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Субконто2
			|			И _ТаблицаДоговоров.Валюта = ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТаблицаДоговоров.Договор,
			|	_ТаблицаДоговоров.Валюта,
			|	_ТаблицаДоговоров.ГруппаФинансовогоУчетаДоходовРасходов";
			
			Запрос.УстановитьПараметр("СчетУчетаРасчетов", ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами11);
						
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Если ОбъектДокумента.Дата > Дата(2020,5,1) Тогда // для оплаты нужно получить дату основания
		Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
			Запрос.УстановитьПараметр("ДопАналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
		ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыУправляющего Тогда 
			Запрос.УстановитьПараметр("ДопАналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.НеобходимыеРасходыУправляющего);
		КонецЕсли;	
	Иначе 
		Запрос.УстановитьПараметр("ДопАналитика", Справочники.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТаблицаДоговоров", ТаблицаДоговоров);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("Валюта", ВалютаОперации);
	Запрос.УстановитьПараметр("НачалоГода", ОпределитьДатуНачалаБухгалтерскогоПериода(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления));
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ОпределитьДатуПокупкиПартии(Партия, СтрокаПартии, БратьДатуИзВводов = Ложь, МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = Неопределено) Экспорт

	УчетныйСчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(Партия.СчетДоверительногоУправления);
	
	Если МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = Неопределено Тогда
		МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(УчетныйСчетДоверительногоУправления);
	КонецЕсли;
	
	Если Партия.Дата < МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ Тогда
		
		Если БратьДатуИзВводов И ТипЗнч(Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
			
			СтрокаТаблицыПартий = Партия.ЦенныеБумаги.Найти(СтрокаПартии, "СтрокаПартии");
			Если СтрокаТаблицыПартий = Неопределено Тогда
				Возврат Неопределено;
			Иначе
				Возврат СтрокаТаблицыПартий.ДатаПокупки;
			КонецЕсли;
			
		Иначе
			Возврат Партия.Дата;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Партия) <> Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
		
		Возврат Партия.Дата;
		
	Иначе
		
		СтрокаТаблицыПартий = Партия.ЦенныеБумаги.Найти(СтрокаПартии, "СтрокаПартии");
		Если СтрокаТаблицыПартий = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Возврат СтрокаТаблицыПартий.ДатаПокупки;
		КонецЕсли;	
		
	КонецЕсли;

КонецФункции

Функция ПолучитьРаспределениеУчетныхАктивовЕПСПоДивидендам(Основание, ТаблицаРаспределенияАктивовЕПС) Экспорт
	
	УчетныйСчетДоверительногоУправления			 = Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(Основание.СчетДоверительногоУправления);
	МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ = РегистрыСведений.НастройкиУчетаОбщие.ПолучитьДатуНачалаНеобходимостиДанныхЕПСВоВводахЦБ(УчетныйСчетДоверительногоУправления);
	
	Если ТаблицаРаспределенияАктивовЕПС = Неопределено Тогда
		ТаблицаРаспределенияАктивовЕПС = Новый ТаблицаЗначений;
		ТаблицаРаспределенияАктивовЕПС.Колонки.Добавить("Основание");
		ТаблицаРаспределенияАктивовЕПС.Колонки.Добавить("УчетныйАктивЕПС");
		ТаблицаРаспределенияАктивовЕПС.Колонки.Добавить("Количество");
	КонецЕсли;
		
	ДатаРеестраДляПроверки = Основание.ДатаРеестра;
	Если НЕ БухгалтерскийУчет.ВедетсяУчетЕПС(Основание.ДатаРеестра, Основание.Организация, УчетныйСчетДоверительногоУправления) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиУчетаОбщиеСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
			|			&ДатаДокумента,
			|			ВестиЕдиныйБухгалтерскийУчет
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних";
		
		Запрос.УстановитьПараметр("ДатаДокумента", Основание.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаРеестраДляПроверки = ВыборкаДетальныеЗаписи.Период;
		КонецЦикла;
	
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии,
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ) КАК Дата
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаРеестра,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии,
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаДокумента,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И ВидУчета = &ВидУчета
		|				И (ВЫРАЗИТЬ(Партия КАК Документ.ВводЦенныхБумаг).Дата МЕЖДУ &ДатаРеестра И &ДатаДокумента)) КАК БухПартииЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Запрос.УстановитьПараметр("ДатаРеестра", НачалоДня(ДатаРеестраДляПроверки) + 86400);  //на утро
	Запрос.УстановитьПараметр("ДатаДокумента", Основание.Дата);  //получим вводы
	Запрос.УстановитьПараметр("Рынок", Основание.Рынок);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", УчетныйСчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Основание.ЦеннаяБумага);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПартий = РезультатЗапроса.Выгрузить();
	
	КоличествоОстаток = 0;
	КоличествоСтрокПартий = ТаблицаПартий.Количество();
	Для сц = -КоличествоСтрокПартий По -1 Цикл
		ТекущаяСтрокаПартий = ТаблицаПартий.Получить(-сц-1);
		ДатаПокупкиПартии = ТекущаяСтрокаПартий.Дата;
		Если ТипЗнч(ТекущаяСтрокаПартий.Партия) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
			ДатаПокупкиПартии = НачалоДня(БухгалтерскийУчетЕПС.ОпределитьДатуПокупкиПартии(ТекущаяСтрокаПартий.Партия, ТекущаяСтрокаПартий.СтрокаПартии, Истина, МоментНачалаНеобходимостиДанныхЕПСВоВводахЦБ));
		КонецЕсли;
		Если ДатаПокупкиПартии <= Основание.ДатаРеестра Тогда
			КоличествоОстаток = КоличествоОстаток + ТекущаяСтрокаПартий.КоличествоОстаток;
		Иначе 
			ТаблицаПартий.Удалить(ТекущаяСтрокаПартий);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПартий.Свернуть("УчетныйАктивЕПС","КоличествоОстаток");
	
	Для Каждого СтрокаТаблицыПартий Из ТаблицаПартий Цикл
		СтрокаТаблицыРаспределениеАктивовЕПС = ТаблицаРаспределенияАктивовЕПС.Добавить();
		СтрокаТаблицыРаспределениеАктивовЕПС.Основание = Основание;
		СтрокаТаблицыРаспределениеАктивовЕПС.УчетныйАктивЕПС = СтрокаТаблицыПартий.УчетныйАктивЕПС;
		СтрокаТаблицыРаспределениеАктивовЕПС.Количество = СтрокаТаблицыПартий.КоличествоОстаток;
		
	КонецЦикла;
		
КонецФункции

Функция ПолучитьГФУПоВалюте(Счет, Валюта, ДляСделокСВалютой = Ложь) Экспорт
	
	Если ДляСделокСВалютой Тогда
		Если Счет = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11 Тогда //доходы
			Если Валюта.Код = "840" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37101");
			ИначеЕсли Валюта.Код = "978" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37102");
			ИначеЕсли Валюта.Код = "826" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37103");
			ИначеЕсли Валюта.Код = "756" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37104");
			ИначеЕсли Валюта.Код = "392" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37105");
			Иначе 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37106");
			КонецЕсли;
		ИначеЕсли Счет = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12 Тогда //расходы
			
			Если Валюта.Код = "840" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47101");
			ИначеЕсли Валюта.Код = "978" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47102");
			ИначеЕсли Валюта.Код = "826" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47103");
			ИначеЕсли Валюта.Код = "756" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47104");
			ИначеЕсли Валюта.Код = "392" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47105");
			Иначе 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47106");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Счет = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11 Тогда //доходы
			Если Валюта.Код = "840" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37201");
			ИначеЕсли Валюта.Код = "978" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37202");
			ИначеЕсли Валюта.Код = "826" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37203");
			ИначеЕсли Валюта.Код = "756" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37204");
			ИначеЕсли Валюта.Код = "392" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37205");
			Иначе 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37206");
			КонецЕсли;
		ИначеЕсли Счет = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12 Тогда //расходы
			
			Если Валюта.Код = "840" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47201");
			ИначеЕсли Валюта.Код = "978" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47202");
			ИначеЕсли Валюта.Код = "826" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47203");
			ИначеЕсли Валюта.Код = "756" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47204");
			ИначеЕсли Валюта.Код = "392" Тогда 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47205");
			Иначе 
				Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47206");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСчетДоходаРасходаПоКурсовойРазнице(ОбъектДокумента, Счет, Субконто1, Субконто2, Субконто3, ДополнительнаяАналитика, Валюта, КурсоваяРазница, Отказ) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ЦеннаяБумага", Неопределено);
	
	СчетГлавыВ = (Счет.ГлаваПланаСчетовНФО = Перечисления.ГлавыПланаСчетовНФО.ГлаваВ);
	СчетГлавыГ = (Счет.ГлаваПланаСчетовНФО = Перечисления.ГлавыПланаСчетовНФО.ГлаваГ);
	
	Если КурсоваяРазница > 0 Тогда
		Если Счет.Вид = ВидСчета.Активный Тогда
			Если СчетГлавыВ Тогда
			    СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСАктивом9;
			ИначеЕсли СчетГлавыГ Тогда
				СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			Иначе
				СчетДоходаРасхода = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			КонецЕсли;
		Иначе 						
			Если СчетГлавыВ Тогда
			    СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
			ИначеЕсли СчетГлавыГ Тогда
				СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			Иначе
				СчетДоходаРасхода = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Счет.Вид = ВидСчета.Активный Тогда
			Если СчетГлавыВ Тогда
			    СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСАктивом9;
			ИначеЕсли СчетГлавыГ Тогда
				СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСАктивом;
			Иначе
				СчетДоходаРасхода = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
			КонецЕсли;
		Иначе 						
			Если СчетГлавыВ Тогда
			    СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСПассивом8;
			ИначеЕсли СчетГлавыГ Тогда
				СчетДоходаРасхода = ПланыСчетов.Единый.КорреспонденцияСПассивом;
			Иначе
				СчетДоходаРасхода = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если (Счет = ПланыСчетов.Единый.Расчеты23 ИЛИ Счет = ПланыСчетов.Единый.Расчеты23) И ЗначениеЗаполнено(Субконто1) И ЗначениеЗаполнено(Субконто2)
		ИЛИ ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона 
		ИЛИ ДополнительнаяАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела Тогда
		
		СтруктураРезультата.Вставить("Счет", СчетДоходаРасхода);
		СтруктураРезультата.Вставить("ГруппаФинансовогоУчетаДоходовРасходов", БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходаРасхода, Валюта));
		Если ТипЗнч(Субконто2) = Тип("ДокументСсылка.ВводЦенныхБумаг") Тогда
			Если ТипЗНч(ОбъектДокумента) = Тип("ДокументОбъект.Оплата") ТОгда
				ВидЗадолженности = ОбъектДокумента.ВидЗадолженности;
			Иначе 
				//задлженность м.б. по купону или по телу бумаги
				ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка();
			КонецЕсли;
			СтруктураРезультата.ЦеннаяБумага = ПолучитьЦеннуюБумагуПриОплатеПогашенияПоВводу(Субконто2, Субконто1, ВидЗадолженности, Отказ); 
		ИначеЕсли ТипЗнч(Субконто1) = Тип("СправочникСсылка.Облигации") Тогда
			СтруктураРезультата.ЦеннаяБумага = Субконто1; 
		ИначеЕсли ТипЗнч(Субконто2) = Тип("ДокументСсылка.ПогашениеКупона") Тогда
			СтруктураРезультата.ЦеннаяБумага = Субконто2.Облигация; 
		Иначе	
			//погашение
			СтруктураРезультата.ЦеннаяБумага = Субконто2.ЦеннаяБумага; 
		КонецЕсли;
		
		Возврат СтруктураРезультата;
		
	ИначеЕсли СчетГлавыВ ИЛИ СчетГлавыГ Тогда
		
		СтруктураРезультата.Вставить("Счет", СчетДоходаРасхода);
		СтруктураРезультата.Вставить("ГруппаФинансовогоУчетаДоходовРасходов", Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка());
		Возврат СтруктураРезультата;
		
	ИначеЕсли 
		Счет = ПланыСчетов.Единый.ДенежныеСредстваВПути 
			ИЛИ Счет = ПланыСчетов.Единый.Расчеты07
			ИЛИ Счет = ПланыСчетов.Единый.Расчеты08
			ИЛИ Счет = ПланыСчетов.Единый.Расчеты23
			ИЛИ Счет = ПланыСчетов.Единый.РасчетныеСчета01   
			ИЛИ Счет = ПланыСчетов.Единый.РасчетыСБрокерами01
			ИЛИ Счет = ПланыСчетов.Единый.РасчетыСБрокерами02
			ИЛИ Счет = ПланыСчетов.Единый.Депозиты01   
			ИЛИ Счет = ПланыСчетов.Единый.АктивыВДУ03
			ИЛИ Счет.Родитель = ПланыСчетов.Единый.ПрочиеСредства
			ИЛИ Счет.Родитель = ПланыСчетов.Единый.ПрочиеСредстваКоммерческим

	Тогда
		
		СтруктураРезультата.Вставить("Счет", СчетДоходаРасхода);
		СтруктураРезультата.Вставить("ГруппаФинансовогоУчетаДоходовРасходов", БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходаРасхода, Валюта));
		Возврат СтруктураРезультата;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен счет доходов/расходов курсовой разницы для счета "+Счет+"("+Субконто1+","+Субконто2+","+Субконто3+","+ДополнительнаяАналитика+") по документу " + ОбъектДокумента.Ссылка,ОбъектДокумента,,,Отказ);
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьЦеннуюБумагуПриОплатеПогашенияПоВводу(ВводЦБ, Контрагент, ВидЗадолженности, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженность) КАК ДебиторскаяЗадолженность,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженностьКупон) КАК ДебиторскаяЗадолженностьКупон
		|ИЗ
		|	Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|ГДЕ
		|	(ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженностьКупон > 0
		|			ИЛИ ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженность > 0)
		|	И ВводЦенныхБумагЦенныеБумаги.Ссылка = &ВводЦБ
		|	И ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо = &Контрагент
		|	И ВЫБОР
		|			КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|				ТОГДА ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженностьКупон > 0
		|			КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|				ТОГДА ВводЦенныхБумагЦенныеБумаги.ДебиторскаяЗадолженность > 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("ВводЦБ", ВводЦБ);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По документу " + ВводЦБ + " введена задолженность по нескольким бумагам эмитента " + Контрагент + ". Необходимо разделить вводы ценных бумаг",,,,Отказ);
		Возврат Неопределено;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.ЦеннаяБумага;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОпределитьПостфиксГФУ(Контрагент, НаДату) 

	//0	По прочим средствам, предоставленным негосударственным финансовым организациям
	//1	По прочим средствам, предоставленным негосударственным коммерческим организациям
	//2	По прочим средствам, предоставленным негосударственным некоммерческим организациям
	//3	По прочим средствам, предоставленным юридическим лицам - нерезидентам
	//4	По прочим средствам, предоставленным кредитным организациям
	//5	По прочим средствам, предоставленным банкам-нерезидентам
	
	//6	По прочим средствам, предоставленным физическим лицам
	//7	По прочим средствам, предоставленным физическим лицам - нерезидентам
	
	Если Контрагент.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		ВызватьИсключение Контрагент + " является физическим лицом";	
	Иначе
		
		ДатаПеречня = КонсолидированнаяОтчетность.ПолучитьДатуПеречняФинансовыхОрганизаций(НаДату);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ПеречниОбъектов.ВидПеречня КАК ВидПеречня
			|ИЗ
			|	РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
			|ГДЕ
			|	ПеречниОбъектов.Включен
			|	И ПеречниОбъектов.Период = &ДатаПеречня
			|	И ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ)
			|	И ПеречниОбъектов.ВидПеречня.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ЦБРФ_ПереченьОрганизацийФинансовогоСектора)
			|	И ПеречниОбъектов.Объект = &Контрагент";
		
		Запрос.УстановитьПараметр("ДатаПеречня", ДатаПеречня);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если ВыборкаДетальныеЗаписи.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ЦБРФ_Нерезиденты Тогда
				Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Контрагент, "Банки") = Неопределено Тогда
					Возврат "3";	
				Иначе
					Возврат "5";	
				КонецЕсли;
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ЦБРФ_КредитныеОрганизации Тогда
				Возврат "4";	
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ЦБРФ_НекоммерческиеОрганизацииОбслуживающиеНаселение Тогда
				Возврат "2";	
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидПеречня = Справочники.ВидыПеречнейОбъектов.ЦБРФ_НефинансовыеОрганизации Тогда
				Возврат "1";	
			Иначе
				Возврат "0";	
			КонецЕсли;
		КонецЕсли;
		Возврат "0";	
	КонецЕсли;

КонецФункции

Функция ОпределитьПостфиксГФУДляРасходов(Контрагент, НаДату) 
	
	//2	Процентные расходы: по привлеченным средствам негосударственных финансовых организаций
	//3	Процентные расходы: по привлеченным средствам негосударственных коммерческих организаций
	//4	Процентные расходы: по привлеченным средствам негосударственных некоммерческих организаций
	//5	Процентные расходы: по привлеченным средствам юридических лиц - нерезидентов
	//6	Процентные расходы: по привлеченным средствам кредитных организаций
	//7	Процентные расходы: по привлеченным средствам банков-нерезидентов
	
	//8	Процентные расходы: по привлеченным средствам физических лиц
	//9	Процентные расходы: по привлеченным средствам физических лиц - нерезидентов
	
	ПостфиксГФУДоходов = ОпределитьПостфиксГФУ(Контрагент, НаДату);
	
	Возврат Строка(Число(ПостфиксГФУДоходов) + 2);
	
КонецФункции

Функция ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(Контрагент, НаДату) Экспорт

	//31110	Процентные доходы: По прочим средствам, предоставленным негосударственным финансовым организациям
	//31111	Процентные доходы: По прочим средствам, предоставленным негосударственным коммерческим организациям
	//31112	Процентные доходы: По прочим средствам, предоставленным негосударственным некоммерческим организациям
	//31113	Процентные доходы: По прочим средствам, предоставленным юридическим лицам - нерезидентам
	//31114	Процентные доходы: По прочим средствам, предоставленным кредитным организациям
	//31115	Процентные доходы: По прочим средствам, предоставленным банкам-нерезидентам
	
	//31116	Процентные доходы: По прочим средствам, предоставленным физическим лицам
	//31117	Процентные доходы: По прочим средствам, предоставленным физическим лицам - нерезидентам
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("3111" + ОпределитьПостфиксГФУ(Контрагент, НаДату));

КонецФункции // ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту

Функция ОпределитьГФУПоложительнойКорректировкиПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(Контрагент, НаДату) Экспорт

	//31510	---: по прочим средствам, предоставленным негосударственным финансовым организациям
	//31511	---: по прочим средствам, предоставленным негосударственным коммерческим организациям
	//31512	---: по прочим средствам, предоставленным негосударственным некоммерческим организациям
	//31513	---: по прочим средствам, предоставленным юридическим лицам - нерезидентам
	//31514	---: по прочим средствам, предоставленным кредитным организациям
	//31515	---: по прочим средствам, предоставленным банкам-нерезидентам
	
	//31516	---: по прочим средствам, предоставленным физическим лицам
	//31517	---: по прочим средствам, предоставленным физическим лицам - нерезидентам
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("3151" + ОпределитьПостфиксГФУ(Контрагент, НаДату));

КонецФункции // ОпределитьГФУПоложительнойКорректировкиПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту

Функция ОпределитьГФУОтрицательнойКорректировкиПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(Контрагент, НаДату) Экспорт

	//31610	---: по прочим средствам, предоставленным негосударственным финансовым организациям
	//31611	---: по прочим средствам, предоставленным негосударственным коммерческим организациям
	//31612	---: по прочим средствам, предоставленным негосударственным некоммерческим организациям
	//31613	---: по прочим средствам, предоставленным юридическим лицам - нерезидентам
	//31614	---: по прочим средствам, предоставленным кредитным организациям
	//31615	---: по прочим средствам, предоставленным банкам-нерезидентам
	
	//31616	---: по прочим средствам, предоставленным физическим лицам
	//31617	---: по прочим средствам, предоставленным физическим лицам - нерезидентам
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("3161" + ОпределитьПостфиксГФУ(Контрагент, НаДату));

КонецФункции // ОпределитьГФУОтрицательнойКорректировкиПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту

Функция ОпределитьГФУПроцентныхРасходовПоПривлеченнымСредствам(Контрагент, НаДату) Экспорт

	//44112	Процентные расходы: по привлеченным средствам негосударственных финансовых организаций
	//44113	Процентные расходы: по привлеченным средствам негосударственных коммерческих организаций
	//44114	Процентные расходы: по привлеченным средствам негосударственных некоммерческих организаций
	//44115	Процентные расходы: по привлеченным средствам юридических лиц - нерезидентов
	//44116	Процентные расходы: по привлеченным средствам кредитных организаций
	//44117	Процентные расходы: по привлеченным средствам банков-нерезидентов
	
	//44118	Процентные расходы: по привлеченным средствам физических лиц
	//44119	Процентные расходы: по привлеченным средствам физических лиц - нерезидентов
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("4411" + ОпределитьПостфиксГФУДляРасходов(Контрагент, НаДату));

КонецФункции // ОпределитьГФУПроцентныхРасходовПоПривлеченнымСредствам

Функция ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту(Контрагент, НаДату) Экспорт

	//31310	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным негосударственным финансовым организациям
	//31311	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным негосударственным коммерческим организациям
	//31312	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным негосударственным некоммерческим организациям
	//31313	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным юридическим лицам - нерезидентам
	//31314	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным кредитным организациям
	//31315	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным банкам-нерезидентам
	
	//31316	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным физическим лицам
	//31317	Комиссионные расходы и затраты по сделке, уменьшающие процентные доходы: По прочим средствам, предоставленным физическим лицам - нерезидентам
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("3131" + ОпределитьПостфиксГФУ(Контрагент, НаДату));

КонецФункции // ОпределитьГФУКомиссионныхРасходовПоСредствамПредоставленнымКонтрагенту

Функция ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам(Контрагент, НаДату) Экспорт

	//44212	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам негосударственных финансовых организаций
	//44213	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам негосударственных коммерческих организаций
	//44214	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам негосударственных некоммерческих организаций
	//44215	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам юридических лиц - нерезидентов
	//44216	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам (кроме кредитов) кредитных организаций
	//44217	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам (кроме кредитов) банков-нерезидентов
	
	//44218	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам физических лиц
	//44219	Комиссионные расходы и затраты по сделке, увеличивающие процентные расходы: по привлеченным средствам физических лиц - нерезидентов
	
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("4421" + ОпределитьПостфиксГФУДляРасходов(Контрагент, НаДату));

КонецФункции // ОпределитьГФУКомиссионныхРасходовПоПривлеченнымСредствам

Функция ПолучитьЦенныеБумагиЯвляющиесяДефолтнымиПоМнениюКлиента(Дата, Организация, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки КАК ПризнатьВыпускДефолтным
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиУчетаЦенныхБумаг.ПризнатьДефолтной)
		|				И Клиент В
		|					(ВЫБРАТЬ
		|						КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|					ИЗ
		|						РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних)) КАК ЗначенияНастроекУчетаЦенныхБумагСрезПоследних
		|ГДЕ
		|	ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.ЗначениеНастройки = ИСТИНА
		|	И НЕ ЗначенияНастроекУчетаЦенныхБумагСрезПоследних.Отключить";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага");
	
КонецФункции

Функция ПолучитьСчетГФУУчетногоАктиваЕПСИзПартии(Дата,Организация, СчетДоверительногоУправления, ЦеннаяБумага) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
	|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций КАК СчетУчетаРасходовОтОпераций,
	|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.АналитикаРасходовОтОпераций КАК АналитикаРасходовОтОпераций,
	|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ЦеннаяБумага = &ЦеннаяБумага
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	
	Результат =  Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьРыночнуюЭСПиОтклонениеПоМетодикеСНГ(Облигация, ДатаПереоценки, РасшифровкаРасчета, СчетДоверительногоУправления, НастройкиУчета)

	Если Облигация.ДатаПогашения = '00010101' Тогда // бессрочная бумага
		ДатаПогашения = Справочники.Облигации.ПолучитьДатуИЦенуВыкупа(Облигация, НачалоДня(ДатаПереоценки), НачалоДня(ДатаПереоценки), СчетДоверительногоУправления,
			НастройкиУчета.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона, НастройкиУчета.ИгнорироватьИнформациюОбОбязательномДосрочномПогашении).ДатаВыкупа;
	Иначе
		ДатаПогашения = Облигация.ДатаПогашения;
	КонецЕсли;

	ПолныхЛетДоПогашения = Цел((ДатаПогашения - ДатаПереоценки) / (365 * 86400));
	
	Если Облигация.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
		Если ПолныхЛетДоПогашения = 0 Тогда
			КодИндекса = "RUGBITR1Y";
		ИначеЕсли ПолныхЛетДоПогашения < 3 Тогда
			КодИндекса = "RUGBITR3Y";
		ИначеЕсли ПолныхЛетДоПогашения < 5 Тогда
			КодИндекса = "RUGBITR5Y";
		ИначеЕсли ПолныхЛетДоПогашения < 10 Тогда
			КодИндекса = "RUGBITR10Y";
		Иначе
			КодИндекса = "RUGBITR5+";
		КонецЕсли;
	Иначе
		Если ПолныхЛетДоПогашения = 0 Тогда
			Если Облигация.Категория = Перечисления.КатегорииОблигаций.Муниципальная ИЛИ Облигация.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
				КодИндекса = "RUMBITR1Y";
			Иначе // корп, евро и проч.
				КодИндекса = "RUCBITR1Y";
			КонецЕсли;
		Иначе
			// Определим уровень рейтинга актива
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МИНИМУМ(ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5)) КАК СтрокаСопоставления
				|ИЗ
				|	РегистрСведений.Рейтинги.СрезПоследних(
				|			&Период,
				|			Субъект = &Субъект
				|				ИЛИ Субъект = &СубъектЭмитент) КАК РейтингиСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&Период, Источник = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПереченьЦБ_РФДляОтчетности)) КАК СопоставлениеРейтинговыхШкалСрезПоследних
				|		ПО РейтингиСрезПоследних.Шкала = СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная
				|			И (РейтингиСрезПоследних.ЗначениеРейтинга.Оценка МЕЖДУ СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное.Оценка И СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка)";
			
			Запрос.УстановитьПараметр("Период", НачалоДня(ДатаПереоценки));
			Запрос.УстановитьПараметр("Субъект", Облигация);
			Запрос.УстановитьПараметр("СубъектЭмитент", Облигация.Эмитент);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			    УровеньРейтинга = ВыборкаДетальныеЗаписи.СтрокаСопоставления;
			Иначе
				УровеньРейтинга = 5;
			КонецЕсли;

			Если Облигация.Категория = Перечисления.КатегорииОблигаций.Муниципальная ИЛИ Облигация.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
				Если ПолныхЛетДоПогашения < 3 Тогда
					Если УровеньРейтинга < 3 Тогда
						КодИндекса = "RUMBITRBBB3Y";
					Иначе
						КодИндекса = "RUMBITRBB3Y";
					КонецЕсли;
				Иначе
					КодИндекса = "RUMBITRBBB3+";
				КонецЕсли;
			Иначе // корп
				Если ПолныхЛетДоПогашения < 3 Тогда
					Если УровеньРейтинга < 3 Тогда
						КодИндекса = "RUCBITRBBB3Y";
					ИначеЕсли УровеньРейтинга = 3 Тогда
						КодИндекса = "RUCBITRBB3Y";
					Иначе
						КодИндекса = "RUCBITRB3Y";
					КонецЕсли;
				ИначеЕсли ПолныхЛетДоПогашения < 5 Тогда
					Если УровеньРейтинга < 3 Тогда
						КодИндекса = "RUCBITRBBB5Y";
					Иначе
						КодИндекса = "RUCBITRBB5Y";
					КонецЕсли;
				Иначе
					Если УровеньРейтинга < 3 Тогда
						КодИндекса = "RUCBITRBBB3+";
					Иначе
						КодИндекса = "RUCBITRBB3+";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	БиржевойИндекс = Справочники.БиржевыеИндексы.НайтиПоКоду(КодИндекса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияБиржевыхИндексовСрезПоследних.YIELD КАК Доходность
		|ПОМЕСТИТЬ _Доходность
		|ИЗ
		|	РегистрСведений.ЗначенияБиржевыхИндексов.СрезПоследних(&Период, БиржевойИндекс = &БиржевойИндекс) КАК ЗначенияБиржевыхИндексовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Количество,
		|	ЗначенияБиржевыхИндексов.YIELD КАК Доходность
		|ПОМЕСТИТЬ _ЗначенияИндексов
		|ИЗ
		|	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|ГДЕ
		|	ЗначенияБиржевыхИндексов.БиржевойИндекс = &БиржевойИндекс
		|	И ЗначенияБиржевыхИндексов.Период >= &НачалоПериода
		|	И ЗначенияБиржевыхИндексов.Период <= &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Итог.РазмерВыборки КАК РазмерВыборки,
		|	_Итог.СуммаВыборки / _Итог.РазмерВыборки КАК СреднееЗначение
		|ПОМЕСТИТЬ _Итоги
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(_ЗначенияИндексов.Количество) КАК РазмерВыборки,
		|		СУММА(_ЗначенияИндексов.Доходность) КАК СуммаВыборки
		|	ИЗ
		|		_ЗначенияИндексов КАК _ЗначенияИндексов) КАК _Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетОтклонения.КвадратичноеОтклонение / (_Итоги.РазмерВыборки - 1) КАК СреднееКвадратичноеОтклонение,
		|	_Доходность.Доходность КАК Доходность
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА((_ЗначенияИндексов.Доходность - _Итоги.СреднееЗначение) * (_ЗначенияИндексов.Доходность - _Итоги.СреднееЗначение)) КАК КвадратичноеОтклонение
		|	ИЗ
		|		_ЗначенияИндексов КАК _ЗначенияИндексов,
		|		_Итоги КАК _Итоги) КАК _РасчетОтклонения,
		|	_Итоги КАК _Итоги,
		|	_Доходность КАК _Доходность";
	
	ГлубинаВзятияДоходностиИндексовЛет = 1;
	Если ДатаПереоценки >= '20230420' Тогда
		ГлубинаВзятияДоходностиИндексовЛет = 3;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("БиржевойИндекс", БиржевойИндекс);
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоДня(ДатаПереоценки), -12 * ГлубинаВзятияДоходностиИндексовЛет));
	Запрос.УстановитьПараметр("Период", НачалоДня(ДатаПереоценки));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Новый Структура("БезрисковаяСтавкаДоходности, СтандартноеОтклонение", ВыборкаДетальныеЗаписи.Доходность, SQRT(ВыборкаДетальныеЗаписи.СреднееКвадратичноеОтклонение));
	Иначе
	     Возврат Неопределено
	КонецЕсли;
	
КонецФункции

// Функция - Проверить ЭСПНа рыночность
//
// Параметры:
//  Облигация					 - Справочник.Облигации 
//  ЭСП							 - ОпределяемыеТипы.ЭффективнаяПроцентнаяСтавка -
//  ДатаПереоценки				 - Дата (начало дня) 
//  СчетДоверительногоУправления - Справочник.СчетаДоверительногоУправления 
//  Расшифровка					 - Структура	 
//  ПараметрыПроверки			 - Структура
//   НомерСтроки - Число - всегда 1
//   ЦеннаяБумага - Справочник.Облигации - совпадается с параметром Облигация
//   Партия - ОпределяемыеТипы.Партия - партия покупки ценной бумаги, если нет исполнения допустимо использовать сделку
//   СтрокаПартии - ОпределяемыеТипы.СтрокаПартии - строка партии покупки ценной бумаги, почти всегда 1 
//  Отказ						 - Булево
// 
// Возвращаемое значение:
//  Истина		 - ЭСП соответствует критерию рыночности
//  Ложь		 - ЭСП не соответствует критерию рыночности
//  Неопределено - Не удалось провести проверку ЭСП на рыночность
//
Функция ПроверитьЭСПНаРыночность(Облигация, ЭСП, ДатаПереоценки, СчетДоверительногоУправления, Расшифровка = Неопределено, ПараметрыПроверки, Отказ) Экспорт

	Организация = СчетДоверительногоУправления.Организация;
	ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета);
	НастройкиЦелиРасчета = БухгалтерскийУчетПовтИсп.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, Организация, СчетДоверительногоУправления, ЦельРасчета);
	ВариантРасчетаОценочнойСтоимости = НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости;
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, Организация, СчетДоверительногоУправления);
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							Организация);
	ПараметрыОценки.Вставить("Клиент",								Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, ДатаПереоценки));
	ПараметрыОценки.Вставить("СчетДоверительногоУправления",		СчетДоверительногоУправления);
	ПараметрыОценки.Вставить("ВидУчета",							ВидУчета);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("ПараметрыПолученияПартий",			РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(ЦельРасчета, ВидУчета, ВариантРасчетаОценочнойСтоимости, ДатаПереоценки));
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("Операции",						Новый Массив);
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",					Облигация);
	РасшифровкаРасчета.Вставить("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	РасшифровкаРасчета.Вставить("ДатаРасчета",					ДатаПереоценки);
	
	ПараметрыМетодики = РаботаСКоллекциями.СкопироватьСтруктуру(ПараметрыОценки,,, "ПараметрыПолученияПартий");
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ПараметрыМетодики", ПараметрыМетодики, "Параметры методики",, Истина);
	
	Отказ = Ложь;
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, ДатаПереоценки, Облигация, Отказ);
	Если Отказ Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	ОшибкаРасчета = Ложь;
	
	ДенежныеПотоки = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ПараметрыОценки, ОшибкаРасчета, РасшифровкаРасчета);
					
	Если ОшибкаРасчета Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Если ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Сургутнефтегаз2020 Тогда // все по-своему
		
		ДанныеРасчетаРыночнойЭСП = ПолучитьРыночнуюЭСПиОтклонениеПоМетодикеСНГ(Облигация, ДатаПереоценки, РасшифровкаРасчета, СчетДоверительногоУправления, НастройкиУчета);
		
		БезрисковаяСтавкаДоходности	= ДанныеРасчетаРыночнойЭСП.БезрисковаяСтавкаДоходности;
		
		НижняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности - ДанныеРасчетаРыночнойЭСП.СтандартноеОтклонение;
		ВерхняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности + ДанныеРасчетаРыночнойЭСП.СтандартноеОтклонение;
		
		Если ЭСП >= НижняяГраницаКоридораЭСП И ЭСП <= ВерхняяГраницаКоридораЭСП Тогда
			РезультатПроверкиСтавкиЭСП = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
		Иначе
			РезультатПроверкиСтавкиЭСП = "ЭСП нерыночная";
			ПринимаемаяЭСП = ?(ЭСП < НижняяГраницаКоридораЭСП, НижняяГраницаКоридораЭСП, ВерхняяГраницаКоридораЭСП);
		КонецЕсли;
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Югория2022
		 ИЛИ ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Югория Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент не предоставил методику проверки ЭСП на рыночность",,,, Отказ);
		Возврат Неопределено;
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Перспектива2020 Тогда // у них не используется кредитный спред для поределения корридора
		
		БезрисковаяСтавкаДоходности	= РаботаСПоказателямиФинансовыхИнструментов.РассчитатьБезрисковуюСтавкуДоходности(Облигация, ДатаПереоценки, ДенежныеПотоки, ОшибкаРасчета, РасшифровкаРасчета);
		Если ОшибкаРасчета Тогда
			Возврат Неопределено;
		КонецЕсли;		
		
		НижняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности * 0.8;
		ВерхняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности * 1.2;
		
		Если ЭСП >= НижняяГраницаКоридораЭСП И ЭСП <= ВерхняяГраницаКоридораЭСП Тогда
			РезультатПроверкиСтавкиЭСП = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
		Иначе
			РезультатПроверкиСтавкиЭСП = "ЭСП нерыночная";
			ПринимаемаяЭСП = ?(ЭСП < НижняяГраницаКоридораЭСП, НижняяГраницаКоридораЭСП, ВерхняяГраницаКоридораЭСП);
		КонецЕсли;
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда
		
		Партия = ПараметрыПроверки.Партия;
		
		Если ТипЗнч(Партия) = Тип("ДокументСсылка.Сделка") Тогда
			МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "МестоХранения");
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") ИЛИ ТипЗнч(Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "Основание");
			МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "МестоХранения");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для методики Атомов не предусмотрен расчет для вводов бумаг",,,, Отказ);
			Возврат Неопределено;
		КонецЕсли;
			
		ЦенныеБумаги = Новый ТаблицаЗначений();
		ЦенныеБумаги.Колонки.Добавить("НомерСтроки",					Новый ОписаниеТипов("Число"));
		ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ЦенныеБумаги.Колонки.Добавить("Партия",							Метаданные.ОпределяемыеТипы.Партия.Тип);
		ЦенныеБумаги.Колонки.Добавить("СтрокаПартии",					Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
		ЦенныеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ЦенныеБумаги.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ЦенныеБумаги.Колонки.Добавить("Рынок",							Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ЦенныеБумаги.Колонки.Добавить("ВидДвижения",					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
		ЦенныеБумаги.Колонки.Добавить("ТипЗадолженности",				Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		ЦенныеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		
		СтрокаЦенныеБумаги = ЦенныеБумаги.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЦенныеБумаги, ПараметрыПроверки);
		
		СтрокаЦенныеБумаги.Количество = 1;
		СтрокаЦенныеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
		СтрокаЦенныеБумаги.ВидДвижения = Перечисления.ВидыДвижений.Приход;
		
		Попытка
			ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
			ПереоценкаЦБ.Организация					= Организация;
			ПереоценкаЦБ.СчетДоверительногоУправления	= СчетДоверительногоУправления;
			ПереоценкаЦБ.ЦельРасчета					= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
			ПереоценкаЦБ.Дата							= КонецДня(ДатаПереоценки);
			ПереоценкаЦБ.ВидУчета						= ВидУчета;
			ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
			ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ЦенныеБумаги, Истина);
			ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
			
			СтрокиСтоимостей = ТаблицаСтоимостей.НайтиСтроки(Новый Структура("Рынок,ЦеннаяБумага", Перечисления.РынкиЦенныхБумаг.Облигации, Облигация));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют права на расчет справделивой стоимости",,,, Отказ);
			Возврат Неопределено;
		КонецПопытки;
		
		ПокупнаяСтоимость = ПараметрыПроверки.ЦенаПокупки;
		СправедливаяСтоимость = СтрокиСтоимостей[0].Цена;
		БезрисковаяСтавкаДоходности = "<Не используется>";		
		НижняяГраницаКоридораЭСП			= "не проверяется";
		ВерхняяГраницаКоридораЭСП			= "не проверяется";
		
		Если МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда // внебиржа
			МинимумДиапазонаСС = СправедливаяСтоимость * 0.95;
			МаксимумДиапазонаСС = СправедливаяСтоимость * 1.05;
			Если ПокупнаяСтоимость >= МинимумДиапазонаСС И ПокупнаяСтоимость <= МаксимумДиапазонаСС Тогда
				РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
				РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
				ПринимаемаяЭСП = ЭСП;
			Иначе
				Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
				РезультатПроверкиПокупнойСтоимости	= "покупная <> справедливая";
				РезультатПроверкиСтавкиЭСП			 = "ЭСП не рыночная";
				ПринимаемаяЭСП = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
					Облигация,
					ПараметрыДенежногоПотока.ДоДатыПогашения,
					ДатаПереоценки,
					СправедливаяСтоимость,
					СчетДоверительногоУправления,
					Биржа).Доходность;
			КонецЕсли;
		Иначе // биржа
			МинимумДиапазонаСС					= "не проверяется";
			МаксимумДиапазонаСС					= "не проверяется";
		    РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
			
			РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
		КонецЕсли;
		
		РасшифровкаРасчета.Вставить("КритерийРыночностиЭСП",				"ЭСП признается рыночной, если покупная стоимость является справедливой: для сделок на бирже - всегда, для внебиржевых при попадании в 5% коридор от СС");
		РасшифровкаРасчета.Вставить("МестоСовершенияСделки",				МестоХранения);
		РасшифровкаРасчета.Вставить("ПокупнаяСтоимость",					ПокупнаяСтоимость);
		РасшифровкаРасчета.Вставить("СправедливаяСтоимость",				СправедливаяСтоимость);
		РасшифровкаРасчета.Вставить("МинимумДиапазонаСС",					МинимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("МаксимумДиапазонаСС",					МинимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("РезультатПроверкиПокупнойСтоимости",	РезультатПроверкиПокупнойСтоимости);
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020 Тогда
		
		Партия = ПараметрыПроверки.Партия;
		
		Если ТипЗнч(Партия) = Тип("ДокументСсылка.Сделка") Тогда
			РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партия, "РежимПереговорныхСделок, ПервичноеРазмещение, МестоХранения, ВалютаСделки, РежимБиржевыхТоргов");
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") ИЛИ ТипЗнч(Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "Основание");
			РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "РежимПереговорныхСделок, ПервичноеРазмещение, МестоХранения, ВалютаСделки, РежимБиржевыхТоргов");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для методики Ханты-Мансийский НПФ не предусмотрен расчет для документов " + ТипЗнч(Партия),,,, Отказ);
			Возврат Неопределено;
		КонецЕсли;
		
		МестоХранения = Строка(РеквизитыСделки.МестоХранения) + ", " + Строка(РеквизитыСделки.РежимБиржевыхТоргов);
		
		ЦенныеБумаги = Новый ТаблицаЗначений();
		ЦенныеБумаги.Колонки.Добавить("НомерСтроки",					Новый ОписаниеТипов("Число"));
		ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ЦенныеБумаги.Колонки.Добавить("Партия",							Метаданные.ОпределяемыеТипы.Партия.Тип);
		ЦенныеБумаги.Колонки.Добавить("СтрокаПартии",					Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
		ЦенныеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ЦенныеБумаги.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ЦенныеБумаги.Колонки.Добавить("Рынок",							Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ЦенныеБумаги.Колонки.Добавить("ВидДвижения",					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
		ЦенныеБумаги.Колонки.Добавить("ТипЗадолженности",				Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		ЦенныеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		
		СтрокаЦенныеБумаги = ЦенныеБумаги.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЦенныеБумаги, ПараметрыПроверки);
		
		СтрокаЦенныеБумаги.Количество = 1;
		СтрокаЦенныеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
		СтрокаЦенныеБумаги.ВидДвижения = Перечисления.ВидыДвижений.Приход;
		
		Попытка
			ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
			ПереоценкаЦБ.Организация					= Организация;
			ПереоценкаЦБ.СчетДоверительногоУправления	= СчетДоверительногоУправления;
			ПереоценкаЦБ.ЦельРасчета					= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
			ПереоценкаЦБ.Дата							= КонецДня(ДатаПереоценки);
			ПереоценкаЦБ.ВидУчета						= ВидУчета;
			ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
			ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ЦенныеБумаги, Истина);
			ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
			
			СтрокиСтоимостей = ТаблицаСтоимостей.НайтиСтроки(Новый Структура("Рынок,ЦеннаяБумага", Перечисления.РынкиЦенныхБумаг.Облигации, Облигация));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить стоимость переоценки",,,, Отказ);
			Возврат Неопределено;
		КонецПопытки;
		
		ПокупнаяСтоимость = ПараметрыПроверки.ЦенаПокупки;
		СправедливаяСтоимость = СтрокиСтоимостей[0].Цена;
		БезрисковаяСтавкаДоходности = "<Не используется>";		
		НижняяГраницаКоридораЭСП			= "не проверяется";
		ВерхняяГраницаКоридораЭСП			= "не проверяется";
		
		Если Не РеквизитыСделки.РежимПереговорныхСделок И Не РеквизитыСделки.ПервичноеРазмещение Тогда
			//Тогда это сделка в безадресном режиме и по методике Ханты-Мансийский НПФ её стоимость приобретения соотвествует Справедливой Стоимости, а ЭСП признается рыночной
			
			МинимумДиапазонаСС					= "не проверяется";
			МаксимумДиапазонаСС					= "не проверяется";
		    РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
			РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
		Иначе
			
			МосковскаяБиржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
			
			// Проверяем High и Low
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВЫБОР
			|		КОГДА КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|			ТОГДА &НоминалТекущий * КотировкиТорговыхПлощадок.HIGH / 100
			|		ИНАЧЕ КотировкиТорговыхПлощадок.HIGH
			|	КОНЕЦ КАК HIGH,
			|	ВЫБОР
			|		КОГДА КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|			ТОГДА &НоминалТекущий * КотировкиТорговыхПлощадок.LOW / 100
			|		ИНАЧЕ КотировкиТорговыхПлощадок.LOW
			|	КОНЕЦ КАК LOW
			|ИЗ
			|	РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|ГДЕ
			|	КотировкиТорговыхПлощадок.Период = &ДатаПереоценки
			|	И КотировкиТорговыхПлощадок.ЦеннаяБумага = &Облигация
			|	И КотировкиТорговыхПлощадок.Биржа = &МосковскаяБиржа
			|	И КотировкиТорговыхПлощадок.Валюта = &ВалютаСделки
			|	И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим";
			
			Запрос.УстановитьПараметр("ВалютаСделки", РеквизитыСделки.ВалютаСделки);
			Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ДатаПереоценки));
			Запрос.УстановитьПараметр("МосковскаяБиржа", МосковскаяБиржа);
			Запрос.УстановитьПараметр("Облигация", Облигация);
			Запрос.УстановитьПараметр("НоминалТекущий", ПараметрыПроверки.НоминалТекущий);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				МинимумДиапазонаСС					= ВыборкаДетальныеЗаписи.LOW;
				МаксимумДиапазонаСС					= ВыборкаДетальныеЗаписи.HIGH;
				
				Если ПокупнаяСтоимость >= МинимумДиапазонаСС И ПокупнаяСтоимость <= МаксимумДиапазонаСС Тогда
					РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
					РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
					ПринимаемаяЭСП = ЭСП;
				Иначе
					РезультатПроверкиПокупнойСтоимости	= "покупная <> справедливая";
					РезультатПроверкиСтавкиЭСП			 = "ЭСП не рыночная";
					ПринимаемаяЭСП = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
						Облигация,
						ПараметрыДенежногоПотока.ДоДатыПогашения,
						ДатаПереоценки,
						СправедливаяСтоимость,
						СчетДоверительногоУправления,
						МосковскаяБиржа).Доходность;
				КонецЕсли;	
			Иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют котировки для определения справедливой стоимости по адресной сделке",,,, Отказ);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;	
		
		РасшифровкаРасчета.Вставить("КритерийРыночностиЭСП",				"ЭСП признается рыночной, если покупная стоимость является справедливой: для сделок на бирже в безадресном режиме торгов - всегда, а в иных случаях если она попадает в диапазон между High и Low безадресного режима торгов Московской биржы на дату признания.");
		РасшифровкаРасчета.Вставить("МестоСовершенияСделки",				МестоХранения);
		РасшифровкаРасчета.Вставить("ПокупнаяСтоимость",					ПокупнаяСтоимость);
		РасшифровкаРасчета.Вставить("СправедливаяСтоимость",				СправедливаяСтоимость);
		РасшифровкаРасчета.Вставить("МинимумДиапазонаСС",					МинимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("МаксимумДиапазонаСС",					МинимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("РезультатПроверкиПокупнойСтоимости",	РезультатПроверкиПокупнойСтоимости);
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Ростех Тогда
		
		Партия = ПараметрыПроверки.Партия;
		
		Если ТипЗнч(Партия) = Тип("ДокументСсылка.Сделка") Тогда
			РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партия, "РежимПереговорныхСделок, ПервичноеРазмещение, МестоХранения, ВалютаСделки, РежимБиржевыхТоргов");
		ИначеЕсли ТипЗнч(Партия) = Тип("ДокументСсылка.ПоставкаЦенныхБумаг") ИЛИ ТипЗнч(Партия) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "Основание");
			РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "РежимПереговорныхСделок, ПервичноеРазмещение, МестоХранения, ВалютаСделки, РежимБиржевыхТоргов");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для методики НПФ Ростех не предусмотрен расчет для документов " + ТипЗнч(Партия),,,, Отказ);
			Возврат Неопределено;
		КонецЕсли;
		
		МестоХранения = Строка(РеквизитыСделки.МестоХранения) + ", " + Строка(РеквизитыСделки.РежимБиржевыхТоргов);
		
		ЦенныеБумаги = Новый ТаблицаЗначений();
		ЦенныеБумаги.Колонки.Добавить("НомерСтроки",					Новый ОписаниеТипов("Число"));
		ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
		ЦенныеБумаги.Колонки.Добавить("Партия",							Метаданные.ОпределяемыеТипы.Партия.Тип);
		ЦенныеБумаги.Колонки.Добавить("СтрокаПартии",					Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
		ЦенныеБумаги.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		ЦенныеБумаги.Колонки.Добавить("Количество",						Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		ЦенныеБумаги.Колонки.Добавить("Рынок",							Новый ОписаниеТипов("ПеречислениеСсылка.РынкиЦенныхБумаг"));
		ЦенныеБумаги.Колонки.Добавить("ВидДвижения",					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвижений"));
		ЦенныеБумаги.Колонки.Добавить("ТипЗадолженности",				Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		ЦенныеБумаги.Колонки.Добавить("СуммаРезервовПодОбесценение",	Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		
		СтрокаЦенныеБумаги = ЦенныеБумаги.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЦенныеБумаги, ПараметрыПроверки);
		
		СтрокаЦенныеБумаги.Количество = 1;
		СтрокаЦенныеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
		СтрокаЦенныеБумаги.ВидДвижения = Перечисления.ВидыДвижений.Приход;
		
		Попытка
			ПереоценкаЦБ = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
			ПереоценкаЦБ.Организация					= Организация;
			ПереоценкаЦБ.СчетДоверительногоУправления	= СчетДоверительногоУправления;
			ПереоценкаЦБ.ЦельРасчета					= Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
			ПереоценкаЦБ.Дата							= КонецДня(ДатаПереоценки);
			ПереоценкаЦБ.ВидУчета						= ВидУчета;
			ПереоценкаЦБ.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
			ПереоценкаЦБ.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, ЦенныеБумаги, Истина);
			ТаблицаСтоимостей = ПереоценкаЦБ.СтоимостиПереоценки.Выгрузить();
			
			СтрокиСтоимостей = ТаблицаСтоимостей.НайтиСтроки(Новый Структура("Рынок,ЦеннаяБумага", Перечисления.РынкиЦенныхБумаг.Облигации, Облигация));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить стоимость переоценки",,,, Отказ);
			Возврат Неопределено;
		КонецПопытки;
		
		ПокупнаяСтоимость = ПараметрыПроверки.ЦенаПокупки;
		СправедливаяСтоимость = СтрокиСтоимостей[0].Цена;
		БезрисковаяСтавкаДоходности = "<Не используется>";		
		НижняяГраницаКоридораЭСП			= "не проверяется";
		ВерхняяГраницаКоридораЭСП			= "не проверяется";
		КритерийРыночностиЭСП 	 			= "Фактическая ЭСП, рассчитанная в момент первоначального признания, считается соотвествующей рыночным условиям, если справедливая стоимость соответствует стоимости приобретения.";
		
		РасчетнаяЭСП = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
			Облигация,
			ПараметрыДенежногоПотока.ДоДатыПогашения,
			ДатаПереоценки,
			СправедливаяСтоимость,
			СчетДоверительногоУправления,
			МосковскаяБиржа).Доходность;
		
		ИсторическаяРазрядностьОкругленияЭСП = БухгалтерскийУчет.ОпределитьНастройкуУчета(
			НачалоДня(ДатаПереоценки),
			Организация,
			СчетДоверительногоУправления,
			"РазрядностьОкругленияЭСП");
			
		Если ИсторическаяРазрядностьОкругленияЭСП > 0 Тогда
			РасчетнаяЭСП = Окр(РасчетнаяЭСП, ИсторическаяРазрядностьОкругленияЭСП);
		КонецЕсли;
		
		//ПСЧА 2025. Приложение 12. Методы тестирования ЭСП на соответсвие рыночным условиям.
		//Для долговых ценных бумаг.
		//Фактическая ЭСП, рассчитанная в момент первоначального признания, считается соотвествующей рыночным условиям, если справедливая стоимость соответствует стоимости приобретения.
		Если Не РеквизитыСделки.РежимПереговорныхСделок И Не РеквизитыСделки.ПервичноеРазмещение Тогда
			//Стоимость приобретения признается справедливой в случае приобретения ценных бумаг на биржевом рынке в режиме анонимных торгов.
			
			МинимумДиапазонаСС					= "не проверяется";
			МаксимумДиапазонаСС					= "не проверяется";
		    РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
			РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
			КритерийРыночностиЭСП = КритерийРыночностиЭСП + Символы.ПС + "Стоимость приобретения признается справедливой в случае приобретения ценных бумаг на биржевом рынке в режиме анонимных торгов.";
			
		ИначеЕсли РеквизитыСделки.РежимПереговорныхСделок Тогда
			//В случае совершения адресных сделок фактическая цена признается рыночной, если цена приобретения находится внутри спреда между максимальной и минимальной ценами безадресных сделок на соотвествующей бирже на день сделки.
			
			КритерийРыночностиЭСП = КритерийРыночностиЭСП + Символы.ПС + "В случае совершения адресных сделок фактическая цена признается рыночной, если цена приобретения находится внутри спреда между максимальной и минимальной ценами безадресных сделок на соотвествующей бирже на день сделки.";
			
			// Проверяем High и Low
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВЫБОР
			|		КОГДА КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|			ТОГДА &НоминалТекущий * КотировкиТорговыхПлощадок.HIGH / 100
			|		ИНАЧЕ КотировкиТорговыхПлощадок.HIGH
			|	КОНЕЦ КАК HIGH,
			|	ВЫБОР
			|		КОГДА КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|			ТОГДА &НоминалТекущий * КотировкиТорговыхПлощадок.LOW / 100
			|		ИНАЧЕ КотировкиТорговыхПлощадок.LOW
			|	КОНЕЦ КАК LOW
			|ИЗ
			|	РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|ГДЕ
			|	КотировкиТорговыхПлощадок.Период = &ДатаПереоценки
			|	И КотировкиТорговыхПлощадок.ЦеннаяБумага = &Облигация
			|	И КотировкиТорговыхПлощадок.Биржа = &Биржа
			|	И КотировкиТорговыхПлощадок.Валюта = &ВалютаСделки
			|	И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим";
			
			Запрос.УстановитьПараметр("ВалютаСделки", РеквизитыСделки.ВалютаСделки);
			Запрос.УстановитьПараметр("ДатаПереоценки", НачалоДня(ДатаПереоценки));
			Запрос.УстановитьПараметр("Биржа", РеквизитыСделки.МестоХранения.Биржа);
			Запрос.УстановитьПараметр("Облигация", Облигация);
			Запрос.УстановитьПараметр("НоминалТекущий", ПараметрыПроверки.НоминалТекущий);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				МинимумДиапазонаСС					= ВыборкаДетальныеЗаписи.LOW;
				МаксимумДиапазонаСС					= ВыборкаДетальныеЗаписи.HIGH;
				
				Если ПокупнаяСтоимость >= МинимумДиапазонаСС И ПокупнаяСтоимость <= МаксимумДиапазонаСС Тогда
					РезультатПроверкиПокупнойСтоимости	= "покупная = справедливая";
					РезультатПроверкиСтавкиЭСП			 = "ЭСП рыночная";
					ПринимаемаяЭСП = ЭСП;
				Иначе
					РезультатПроверкиПокупнойСтоимости	= "покупная <> справедливая";
					РезультатПроверкиСтавкиЭСП			 = "ЭСП не рыночная";
					ПринимаемаяЭСП = РасчетнаяЭСП;
				КонецЕсли;	
			Иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют котировки для определения справедливой стоимости по адресной сделке",,,, Отказ);
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если РезультатПроверкиСтавкиЭСП	= "ЭСП не рыночная" Тогда
		
			//В иных случаях ЭСП признается соответсвующей рыночным условиям в случае, если ее значение не выходит за диапазон рыночных ставок.
			
			КритерийРыночностиЭСП = КритерийРыночностиЭСП + Символы.ПС + "В иных случаях ЭСП признается соответсвующей рыночным условиям в случае, если ее значение не выходит за диапазон рыночных ставок.";
			
			БезрисковаяСтавкаДоходности	= РаботаСПоказателямиФинансовыхИнструментов.РассчитатьБезрисковуюСтавкуДоходности(Облигация, ДатаПереоценки, ДенежныеПотоки, ОшибкаРасчета, РасшифровкаРасчета);
			Если ОшибкаРасчета Тогда
				Возврат Неопределено;
			КонецЕсли;		
			
			ПараметрыРасчетаРейтинга			= РаботаСПереоценкой.ПолучитьПараметрыРасчетаРейтинга(ПараметрыОценки, ДатаПереоценки, Отказ);
			ПараметрыРасчетаРейтинга.Вставить("ИсключатьДляРублевыхОблигацийРейтингВИностраннойВалюте", Ложь);
			
			ПараметрыРасчетаКредитногоСпреда	= РаботаСПереоценкой.ПолучитьПараметрыРасчетаКредитногоСпреда(ПараметрыОценки, ДатаПереоценки, Отказ);
			ПараметрыРасчетаКредитногоСпреда.Вставить("РассчитыватьКредитныйСпредДляГосударственныхОблигаций", Истина);
			
			//МассивРейтинговыхГрупп = Новый Массив;
			//МассивРейтинговыхГрупп.Добавить(1);
			//МассивРейтинговыхГрупп.Добавить(2);
			//МассивРейтинговыхГрупп.Добавить(3);
			//МассивРейтинговыхГрупп.Добавить(4);
			//
			//ПараметрыРасчетаРейтинга.Вставить("РейтинговаяГруппа", МассивРейтинговыхГрупп);
			
			КредитныйСпред = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьКредитныйСпред(Облигация, ДатаПереоценки, ПараметрыРасчетаРейтинга, ПараметрыРасчетаКредитногоСпреда, ОшибкаРасчета, РасшифровкаРасчета);				
			
			Если ОшибкаРасчета ИЛИ ТипЗнч(КредитныйСпред) <> Тип("ТаблицаЗначений") ИЛИ КредитныйСпред.Количество() = 0 Тогда
				Возврат Неопределено;
			КонецЕсли;		
			
			МедианаКредитногоСпреда		= КредитныйСпред[0].Медиана;
			МинимумКредитногоСпреда		= КредитныйСпред[0].МинимумКредитногоСпреда;
			МаксимумКредитногоСпреда	= КредитныйСпред[0].МаксимумКредитногоСпреда;
			
			Если МинимумКредитногоСпреда = Неопределено ИЛИ МаксимумКредитногоСпреда = Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для " + Строка(СчетДоверительногоУправления) + " не описано получение диапазона кредитного спреда",,,, Отказ);
				Возврат Неопределено;
				
			КонецЕсли;
			
			РасшифровкаРасчета.Вставить("МинимумКредитногоСпреда",		МинимумКредитногоСпреда);
			РасшифровкаРасчета.Вставить("МаксимумКредитногоСпреда",		МаксимумКредитногоСпреда);
			РасшифровкаРасчета.Вставить("МедианаКредитногоСпреда",		МедианаКредитногоСпреда);
			
			НижняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности + МинимумКредитногоСпреда / 100;
			ВерхняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности + МаксимумКредитногоСпреда / 100;
			
			Если ЭСП >= НижняяГраницаКоридораЭСП И ЭСП <= ВерхняяГраницаКоридораЭСП Тогда
				РезультатПроверкиСтавкиЭСП = "ЭСП рыночная";
				ПринимаемаяЭСП = ЭСП;
			Иначе
				РезультатПроверкиСтавкиЭСП = "ЭСП нерыночная";
				ПринимаемаяЭСП = ?(ЭСП < НижняяГраницаКоридораЭСП, НижняяГраницаКоридораЭСП, ВерхняяГраницаКоридораЭСП);
			КонецЕсли;
			
		КонецЕсли;
		
		РасшифровкаРасчета.Вставить("КритерийРыночностиЭСП",				КритерийРыночностиЭСП);
		РасшифровкаРасчета.Вставить("МестоСовершенияСделки",				МестоХранения);
		РасшифровкаРасчета.Вставить("ПокупнаяСтоимость",					ПокупнаяСтоимость);
		РасшифровкаРасчета.Вставить("СправедливаяСтоимость",				СправедливаяСтоимость);
		РасшифровкаРасчета.Вставить("РасчетнаяЭСП",							РасчетнаяЭСП);
		РасшифровкаРасчета.Вставить("МинимумДиапазонаСС",					МинимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("МаксимумДиапазонаСС",					МаксимумДиапазонаСС);
		РасшифровкаРасчета.Вставить("РезультатПроверкиПокупнойСтоимости",	РезультатПроверкиПокупнойСтоимости);
		
	Иначе
		
		БезрисковаяСтавкаДоходности	= РаботаСПоказателямиФинансовыхИнструментов.РассчитатьБезрисковуюСтавкуДоходности(Облигация, ДатаПереоценки, ДенежныеПотоки, ОшибкаРасчета, РасшифровкаРасчета);
		Если ОшибкаРасчета Тогда
			Возврат Неопределено;
		КонецЕсли;		
		
		ПараметрыРасчетаРейтинга			= РаботаСПереоценкой.ПолучитьПараметрыРасчетаРейтинга(ПараметрыОценки, ДатаПереоценки, Отказ);
		ПараметрыРасчетаКредитногоСпреда	= РаботаСПереоценкой.ПолучитьПараметрыРасчетаКредитногоСпреда(ПараметрыОценки, ДатаПереоценки, Отказ);
		
		ПараметрыРасчетаКредитногоСпреда.Вставить("РассчитыватьКредитныйСпредДляГосударственныхОблигаций", Истина);
		
		КредитныйСпред = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьКредитныйСпред(Облигация, ДатаПереоценки, ПараметрыРасчетаРейтинга, ПараметрыРасчетаКредитногоСпреда, ОшибкаРасчета, РасшифровкаРасчета);				
			
		Если ОшибкаРасчета ИЛИ ТипЗнч(КредитныйСпред) <> Тип("ТаблицаЗначений") ИЛИ КредитныйСпред.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;		
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпреда = "ПоИндексамСовокупногоДоходаГосударственныхИКорпоративныхОблигаций"
			И Облигация.Категория <> Перечисления.КатегорииОблигаций.Государственная
			И КредитныйСпред[0].НомерГруппы = 4
			И (КредитныйСпред[0].МинимумКредитногоСпреда = Неопределено ИЛИ КредитныйСпред[0].МаксимумКредитногоСпреда = Неопределено) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для IV рейтинговой группы не предусмотрен расчет спреда",,,, Отказ);
			Возврат Неопределено;
		
		КонецЕсли;
		
		МедианаКредитногоСпреда		= КредитныйСпред[0].Медиана;
		МинимумКредитногоСпреда		= КредитныйСпред[0].МинимумКредитногоСпреда;
		МаксимумКредитногоСпреда	= КредитныйСпред[0].МаксимумКредитногоСпреда;
		
		Если МинимумКредитногоСпреда = Неопределено ИЛИ МаксимумКредитногоСпреда = Неопределено Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не описано получение диапазона кредитного спреда",,,, Отказ);
			Возврат Неопределено;
		
		КонецЕсли;
		
		РасшифровкаРасчета.Вставить("МинимумКредитногоСпреда",		МинимумКредитногоСпреда);
		РасшифровкаРасчета.Вставить("МаксимумКредитногоСпреда",		МаксимумКредитногоСпреда);
		РасшифровкаРасчета.Вставить("МедианаКредитногоСпреда",		МедианаКредитногоСпреда);
		
		НижняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности + МинимумКредитногоСпреда / 100;
		ВерхняяГраницаКоридораЭСП	= БезрисковаяСтавкаДоходности + МаксимумКредитногоСпреда / 100;
		
		Если ЭСП >= НижняяГраницаКоридораЭСП И ЭСП <= ВерхняяГраницаКоридораЭСП Тогда
			РезультатПроверкиСтавкиЭСП = "ЭСП рыночная";
			ПринимаемаяЭСП = ЭСП;
		Иначе
			РезультатПроверкиСтавкиЭСП = "ЭСП нерыночная";
			ПринимаемаяЭСП = ?(ЭСП < НижняяГраницаКоридораЭСП, НижняяГраницаКоридораЭСП, ВерхняяГраницаКоридораЭСП);
		КонецЕсли;
		
	КонецЕсли;
	
	РасшифровкаРасчета.Вставить("БезрисковаяСтавкаДоходности",	БезрисковаяСтавкаДоходности);
	РасшифровкаРасчета.Вставить("НижняяГраницаКоридораЭСП",		НижняяГраницаКоридораЭСП);
	РасшифровкаРасчета.Вставить("ВерхняяГраницаКоридораЭСП",	ВерхняяГраницаКоридораЭСП);
	РасшифровкаРасчета.Вставить("РасчетнаяЭСП",					ЭСП);
	РасшифровкаРасчета.Вставить("РезультатПроверкиСтавкиЭСП",	РезультатПроверкиСтавкиЭСП);
	РасшифровкаРасчета.Вставить("СтавкаПрименяемаяДляРасчета",	ПринимаемаяЭСП);
	
	ИтогиПроверки = Новый ТаблицаЗначений;
	ИтогиПроверки.Колонки.Добавить("Параметр");
	ИтогиПроверки.Колонки.Добавить("Значение");
	
	Для Каждого Параметр Из РасшифровкаРасчета Цикл
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") ИЛИ ТипЗнч(Параметр.Значение) = Тип("Структура") ИЛИ ТипЗнч(Параметр.Значение) = Тип("ТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		
		Итог = ИтогиПроверки.Добавить();
		Итог.Параметр = Параметр.Ключ;
		Итог.Значение = Параметр.Значение;
		
	КонецЦикла;
	
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ИтогиПроверки", ИтогиПроверки, "Итоги проверки");
	
	Если Расшифровка <> Неопределено Тогда
	
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("ПроверкаЭСП",,, Расшифровка);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
		
		Область = Расшифровка.НайтиТекст("ЭСП нерыночная");
		Если Область <> Неопределено Тогда
			Область.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
		Область = Расшифровка.НайтиТекст("СтавкаПрименяемаяДляРасчета");
		Расшифровка.Область(Область.Верх, Область.Лево + 1, Область.Низ, Область.Право + 1).ЦветТекста = WebЦвета.Синий;
		
		Область = Расшифровка.НайтиТекст("КритерийРыночностиЭСП");
		Если Область <> Неопределено Тогда
			Расшифровка.Область(Область.Верх, Область.Лево + 1, Область.Низ, Область.Право + 1).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		КонецЕсли;	
	
	КонецЕсли;
	
	ПараметрыПроверки.Вставить("СтавкаПрименяемаяДляРасчета",	ПринимаемаяЭСП);
	
	Возврат (ПринимаемаяЭСП = ЭСП);

КонецФункции 

Функция ПолучитьОфертыИАмортизации(Облигация, ДатаПокупки, ДатаПереоценки, ВключатьАмортизации = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияОферт.ДатаОбъявления КАК Дата,
		|	""Оферта"" КАК ТипДействия,
		|	УсловияОферт.ДатаВыкупа КАК ДатаВыкупа
		|ПОМЕСТИТЬ _ВсеДаты
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.Облигация = &ЦеннаяБумага
		|	И УсловияОферт.ДатаОбъявления > &НачальнаяДата
		|	И УсловияОферт.ДатаОбъявления <= &КонечнаяДата
		|	И НЕ УсловияОферт.ТолькоДляФизическихЛиц
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоминалыЦенныхБумаг.Период,
		|	""Амортизация"",
		|	НоминалыЦенныхБумаг.Период
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	&ВключатьАмортизации
		|	И НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И НоминалыЦенныхБумаг.Период > &НачальнаяДата
		|	И НоминалыЦенныхБумаг.Период <= &КонечнаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ВсеДаты.Дата КАК Дата,
		|	_ВсеДаты.ТипДействия КАК ТипДействия,
		|	_ВсеДаты.ДатаВыкупа КАК ДатаВыкупа
		|ИЗ
		|	_ВсеДаты КАК _ВсеДаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
	Запрос.УстановитьПараметр("НачальнаяДата", КонецДня(ДатаПокупки));
	Запрос.УстановитьПараметр("КонечнаяДата", НачалоДня(ДатаПереоценки));
	Запрос.УстановитьПараметр("ВключатьАмортизации", ВключатьАмортизации);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РассчитатьЕжедневноеПриращениеПоПотокуСафмар(ТаблицаПотока, МинЗнач, МаксЗнач, ДисконтПремия) Экспорт
	
	//Расчет дисконта и премии по амортизационным облигациям у Сафмара (задача 387776)

	//Основы:
	//	амортизационная облигация - когда номинал гасится частями
	//	дисконт - когда купили ниже номинала и он НАЧИСЛЯЕТСЯ с 0 до Номинал - ЦенаПокупки
	//	премия - когда купили выше номинала и она СПИСЫВАЕТСЯ с ЦенаПокупки - Номинал до 0
	//	погашение – ниже в тексте понимается как финальное погашение	

	//Ежедневная процентная ставка:
	//	Сафмар вводит некое "ежедневное приращение" (она же "ежедневная процентная ставка")
	//	Это очень небольшая величина (значащие разряды далеко после запятой)
	//	Она определяется из формулы:
	//		  n      t_i * N_i * d
	//		Сумма ------------------ = D
	//		 i=1      1 + t_i * d
	//	Как видно, тут идет суммирование всех амортизаций (которые относятся к периоду между покупкой и погашением, разумеется)
	//		t – Количество дней от покупки до этой амортизации
	//		N – Сумма амортизации
	//		d – Наше «ежедневное приращение»
	//		D – дисконт/премия при покупке
	//		
	//Разберем на примере:
	//	1го купили облигацию с дисконтом 21,2
	//	Номинал при покупке 200
	//	Есть 2 амортизации: 2го и 3го по 100 (1 день от покупки до первой и 2 дня до второй)
	//	Формула получается:
	//		1*100*d   2*100*d
	//		------- + ------- = 21,2
	//		 1+1*d     1+2*d
	//	И d получился около 0,08
	//	Рассчитывается d числено
	//	Сафмар считал итерационно (капец!) я сделал расчет дихотомией (лень было хорды делать)
	//	
	//Расчет текущего дисконта/премии:
	//	Зная d, расчет текущего дисконта/премии идет по формуле:
	//		n      N_i * k_i * d
	//		Сумма ------------------
	//		i=1      1 + t_i * d
	//	k –количество дней от переоценки до амортизации (t – от покупки до амортизации)

	//	Важный момент: 
	//		когда мы считали d, мы брали амортизации от покупки до погашения, 
	//	а когда считаем текущий дисконт/премию берем уже от переоценки до погашения т.к. часть амортизаций уже прошли и не учитываются

	//Действия при амортизации:
	//	Когда идет амортизация бумаги, купленной с премией, 
	//		сумма оставшейся премии не меняется – вся сумма амортизации списывается с тела бумаги 
	//		т.к. на теле полная номинальная стоимость
	//	А когда идет амортизация бумаги, купленной с дисконтом, то списание идет и с тела, и с дисконта. 
	//	С дисконта списывается сумма: 
	//		N_i / (1 + t_i * d)
	//	В формуле идет речь о i-той амортизации
	//	
	
	ПриращениеМин = МинЗнач;
	ПриращениеМакс = МаксЗнач;
	Точность = 0.000000000000000000001;
	
	ТаблицаПотока.Колонки.Добавить("НпвМин", Новый ОписаниеТипов("Число"));
	ТаблицаПотока.Колонки.Добавить("НпвМакс", Новый ОписаниеТипов("Число"));
	ТаблицаПотока.Колонки.Добавить("НпвСред", Новый ОписаниеТипов("Число"));
	
	Для Итерация = 1 По 100 Цикл
	
		ПриращениеСред = ПриращениеМин + (ПриращениеМакс - ПриращениеМин) / 2;
		
		Для каждого СтрокаПотока Из ТаблицаПотока Цикл
			
			ДнейНаПриращениеМин = СтрокаПотока.Период * ПриращениеМин;
			ДнейНаПриращениеМакс = СтрокаПотока.Период * ПриращениеМакс;
			ДнейНаПриращениеСред = СтрокаПотока.Период * ПриращениеСред;
			
			СтрокаПотока.НпвМин = СтрокаПотока.Поток * ДнейНаПриращениеМин / (1 + ДнейНаПриращениеМин);
			СтрокаПотока.НпвМакс = СтрокаПотока.Поток * ДнейНаПриращениеМакс / (1 + ДнейНаПриращениеМакс);
			СтрокаПотока.НпвСред = СтрокаПотока.Поток * ДнейНаПриращениеСред / (1 + ДнейНаПриращениеСред);
		
		КонецЦикла; 
		
		НпвМин = ТаблицаПотока.Итог("НпвМин") - ДисконтПремия;
		НпвМакс = ТаблицаПотока.Итог("НпвМакс") - ДисконтПремия;
		НпвСред = ТаблицаПотока.Итог("НпвСред") - ДисконтПремия;

		Если МатематическиеФункции.МодульЧисла(НпвСред) < Точность Тогда
			Прервать;
		КонецЕсли; 
		
		Если МатематическиеФункции.ЗнакЧисла(НпвМин) = МатематическиеФункции.ЗнакЧисла(НпвСред) Тогда
			ПриращениеМин = ПриращениеСред;	
		ИначеЕсли МатематическиеФункции.ЗнакЧисла(НпвМакс) = МатематическиеФункции.ЗнакЧисла(НпвСред) Тогда
			ПриращениеМакс = ПриращениеСред;	
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ПриращениеСред;
	
КонецФункции

Функция ОпределитьСчетУчетаДоходовРасходовОтПереоценки(УчетныйАктив, Доход = Истина) Экспорт
	
	// В справочнике учетных активов явно не заданы счета учета доходов/расходов от ПЕРЕОЦЕНКИ
	// Это было связано с тем, что они до последнего случая совпадали со счетами учета доходов/расходов от ОПЕРАЦИЙ (от продажи, например)
	// И на это заложились в разных местах - это все меняю
	
	// Правильно определять счет через аналитику ГФУ, которая всегда заполнена и в которой указан НомерСчетаБухгалтерскогоУчета
	Аналитика = ?(Доход, УчетныйАктив.АналитикаДоходовОтПереоценки, УчетныйАктив.АналитикаРасходовОтПереоценки);
	СчетУчета = ПланыСчетов.Единый.НайтиПоКоду(Аналитика.НомерСчетаБухгалтерскогоУчета);
	
	// Это сделал для страховки - есть сложности с ГФУ у паев и векселей
	Если СчетУчета = Неопределено Тогда
		СчетУчета = ?(Доход, УчетныйАктив.СчетУчетаДоходовОтОпераций, УчетныйАктив.СчетУчетаРасходовОтОпераций);
	КонецЕсли;
	
	Возврат СчетУчета;
	
КонецФункции

Функция ПолучитьЭСПИДенежныйПотокДляОблигации(Облигация, ДанныеПереоценки, ДанныеПокупки) Экспорт

	РассчитыватьЭСПДо = БухгалтерскийУчет.ОпределитьНастройкуУчета(ДанныеПереоценки.Дата, ДанныеПереоценки.Организация, ДанныеПереоценки.СчетДоверительногоУправления, "РассчитыватьЭСПДо");
	
	ДоПогашения = (РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения);
	
	ПараметрыДенежногоПотока = Новый Структура;
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения", ДоПогашения);
	ПараметрыДенежногоПотока.Вставить("Дата",			 НачалоДня(ДанныеПереоценки.Дата));
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",	 НачалоДня(ДанныеПереоценки.Дата));
	
	ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ДанныеПереоценки);
	
	ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
							Облигация,
							ДоПогашения,
							ДанныеПокупки.ДатаПокупки,
							ДанныеПокупки.ЦенаПокупки,
							ДанныеПереоценки.СчетДоверительногоУправления,
							ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
							
	ЭСП = 0;
	Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
		ЭСП = ДоходностьДюрация.Доходность;
	КонецЕсли; 

	Возврат Новый Структура("ЭСП, Поток", ЭСП, РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ДенежныйПоток, "Дата, Поток"));
	
КонецФункции

Функция ОпределитьСуммуРасходовПопадающуюВСтоимостьБумаги(Документ) Экспорт

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
		Сделка = Документ.Основание;	
	Иначе
		Сделка = Документ;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспределенияАктивовЕПС.Сделка КАК Сделка
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|ГДЕ
		|	РаспределенияАктивовЕПС.Организация = &Организация
		|	И РаспределенияАктивовЕПС.Сделка = &Сделка
		|	И РаспределенияАктивовЕПС.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость";
	
	Запрос.УстановитьПараметр("Организация", Сделка.Организация);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоСделкеОбороты.СуммаОборот КАК СуммаОборот,
		|	РасходыПоСделкеОбороты.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Сделка = &Сделка
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Сделка.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Документ.Дата));
	Запрос.УстановитьПараметр("Организация", Сделка.Организация);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Сделка.СчетДоверительногоУправления);
	
	РасходыПоСделке = 0;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Валюта = Сделка.ВалютаСделки Тогда
			СуммаКомиссии = ВыборкаДетальныеЗаписи.СуммаОборот;
		Иначе
			СуммаКомиссии = РаботаСВалютами.ПересчетСуммыВВалюте(ВыборкаДетальныеЗаписи.СуммаОборот, ВыборкаДетальныеЗаписи.Валюта, НачалоДня(Сделка.Дата), Сделка.ВалютаСделки, НачалоДня(Сделка.Дата));
		КонецЕсли;
		РасходыПоСделке = РасходыПоСделке + СуммаКомиссии;
	КонецЦикла;
	
	Возврат РасходыПоСделке;
	
КонецФункции

Функция ПолучитьТаблицуНеправильныхОстатковПоСчетамБухгалтерскогоУчета(Период, Организация, СчетДоверительногоУправления, ВидУчета, ПолучатьОтрицательноеСальдо = Истина, ПолучатьЗависшееСальдоПоВалютеИКоличеству = Ложь) Экспорт

	Если НЕ ПолучатьОтрицательноеСальдо И НЕ ПолучатьЗависшееСальдоПоВалютеИКоличеству Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(СтоимостьПереоценки.Цена) КАК Цена
		|ПОМЕСТИТЬ _ЦенныеБумагиОценкаНоль
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.Период = &ПериодПереоценки
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага
		|
		|ИМЕЮЩИЕ
		|	СУММА(СтоимостьПереоценки.Цена) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто3 КАК Субконто3,
		|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация,
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 3) = ""612""
		|			ТОГДА ""Остаток на 612 счете""
		|		КОГДА &ПолучатьОтрицательноеСальдо
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокДт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт < 0)
		|			ТОГДА ""Отрицательное сальдо по активному счету""
		|		КОГДА &ПолучатьОтрицательноеСальдо
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт < 0)
		|			ТОГДА ""Положительное сальдо по пассивному счету""
		|		КОГДА &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт < 0)
		|			ТОГДА ""Положительное сальдо по пассивному счету""
		|		КОГДА &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт < 0)
		|			ТОГДА ""Положительное сальдо по пассивному счету""
		|		КОГДА &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|					И ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт = 0
		|					И ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокДт <> 0
		|				ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт = 0
		|					И ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт <> 0
		|			ТОГДА ""Зависло количество""
		|		КОГДА &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|					И ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт = 0
		|					И ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт <> 0
		|				ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт = 0
		|					И ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт <> 0
		|			ТОГДА ""Зависла валютная сумма""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Ошибка
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет.Вид <> ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|				И ВЫБОР
		|					КОГДА Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03)
		|						ТОГДА &ПроверятьСчет47903
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиОценкаНоль КАК _ЦенныеБумагиОценкаНоль
		|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто2 = _ЦенныеБумагиОценкаНоль.ЦеннаяБумага
		|			И (ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 3) = ""971"")
		|ГДЕ
		|	(&ПолучатьОтрицательноеСальдо
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокДт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт < 0)
		|			ИЛИ &ПолучатьОтрицательноеСальдо
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|				И ЕдиныйБухгалтерскийУчетОстатки.Счет <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ДобавочныйКапитал30)
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт < 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт < 0)
		|			ИЛИ &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|				И ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт = 0
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокДт <> 0
		|						И ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 2) <> ""58""
		|						И ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 2) <> ""50""
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт <> 0)
		|			ИЛИ &ПолучатьЗависшееСальдоПоВалютеИКоличеству
		|				И ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт = 0
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстатокКт <> 0
		|						И ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 2) <> ""58""
		|						И ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 2) <> ""50""
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт <> 0)
		|				И _ЦенныеБумагиОценкаНоль.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ ПОДСТРОКА(ЕдиныйБухгалтерскийУчетОстатки.Счет.Код, 1, 3) = ""612""
		|				И (ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток <> 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток <> 0
		|					ИЛИ ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток <> 0))";
	
	Если ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет ИЛИ ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет,", "");
		
		Если ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
			СтрокаЗамены = "БухгалтерскийУчет";
		Иначе
			СтрокаЗамены = "НалоговыйУчет";
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчет", СтрокаЗамены);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодПереоценки", НачалоДня(Период));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПолучатьОтрицательноеСальдо", ПолучатьОтрицательноеСальдо);
	Запрос.УстановитьПараметр("ПолучатьЗависшееСальдоПоВалютеИКоличеству", ПолучатьЗависшееСальдоПоВалютеИКоличеству);
	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		Запрос.УстановитьПараметр("ПроверятьСчет47903", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ПроверятьСчет47903", Истина);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область Служебные_и_вспомогательные_функции

Функция ПоложительноеЧисло(Сумма)

	Если ТипЗнч(Сумма) <> Тип("Число") Тогда
		Возврат Неопределено;
	Иначе
		Возврат (Сумма >= 0);
	КонецЕсли;

КонецФункции

Функция ПоследнийДеньПериода(День, Периодичность) Экспорт

	Если Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежегодно Тогда
		Возврат НачалоДня(КонецГода(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.ЕжегодноИПослеПриобретенийИРеализаций Тогда
		Возврат НачалоДня(КонецГода(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежемесячно Тогда
		Возврат НачалоДня(КонецМесяца(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.ЕжемесячноИПослеПриобретенийИРеализаций Тогда
		Возврат НачалоДня(КонецМесяца(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежеквартально Тогда
		Возврат НачалоДня(КонецКвартала(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.ЕжеквартальноИПослеПриобретенийИРеализаций Тогда
		Возврат НачалоДня(КонецКвартала(День));
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
		Возврат НачалоДня(День);
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
		Возврат Неопределено;
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.ПустаяСсылка() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции 

Функция СлитьУпорядоченныеМассивы(Массив1, Массив2) Экспорт

	МассивРезультат = Новый Массив;
	
	Количество1 = Массив1.Количество();
	Количество2 = Массив2.Количество();
	
	Индекс1 = 0;
	Индекс2 = 0;
	
	Пока Индекс1 < Количество1 ИЛИ Индекс2 < Количество2 Цикл
	
		Если Индекс1 = Количество1 Тогда
		
			МассивРезультат.Добавить(Массив2[Индекс2]);
			Индекс2 = Индекс2 + 1;
		
		ИначеЕсли Индекс2 = Количество2 Тогда
		
			МассивРезультат.Добавить(Массив1[Индекс1]);
			Индекс1 = Индекс1 + 1;
			
		ИначеЕсли Массив1[Индекс1] = Массив2[Индекс2] Тогда
			
			МассивРезультат.Добавить(Массив1[Индекс1]);	
			Индекс1 = Индекс1 + 1;
			Индекс2 = Индекс2 + 1;
			
		ИначеЕсли Массив1[Индекс1] < Массив2[Индекс2] Тогда
			
			МассивРезультат.Добавить(Массив1[Индекс1]);	
			Индекс1 = Индекс1 + 1;
			
		Иначе
			
			МассивРезультат.Добавить(Массив2[Индекс2]);
			Индекс2 = Индекс2 + 1;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивРезультат;

КонецФункции 

Функция ОпределитьАналитикуПереноса(АналитикаПереоценки)
	
	// очень так себе, но пока эту аналитику не вынесли в справочник УчетныеАктивыЕПС придется сделать так
	// схема такая: 8140Х(доход от переоценки) - 8150Х(перенос в составе прибыли)
	// схема такая: 8540Х(расход от переоценки) - 8550Х(перенос в составе убытка)
	КодАналитикиПереноса = Лев(СокрЛП(АналитикаПереоценки), 2) + "5" + Прав(СокрЛП(АналитикаПереоценки), 2);
	Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду(КодАналитикиПереноса);
	
КонецФункции

Функция ПервыйДеньПериода(День, Периодичность) Экспорт

	Если Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежегодно Тогда
		Возврат НачалоГода(День);
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежемесячно Тогда
		Возврат НачалоМесяца(День);
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежеквартально Тогда
		Возврат НачалоКвартала(День);
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.Ежедневно Тогда
		Возврат НачалоДня(День);
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
		Возврат Неопределено;
	ИначеЕсли Периодичность = Перечисления.ПериодичностьПереоценкиАктивов.ПустаяСсылка() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПроверкаНеобходимостиПереоценки(НастройкаУчета, ДатаСобытия, КалендарьДУ = Неопределено) Экспорт
	
	Если НастройкаУчета = Перечисления.ПериодичностьПереоценкиАктивов.ЕжемесячноВПоследнийРабочийДень Тогда
		Если ЗначениеЗаполнено(КалендарьДУ) Тогда
			ПериодичностьПоследнийРабочийДеньМесяца = НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(КалендарьДУ, НачалоДня(КонецМесяца(ДатаСобытия)))) = НачалоДня(ДатаСобытия);
		Иначе
			ВызватьИсключение "Ошибка определения настроек. Для настройки учета " + НастройкаУчета + " должен быть передан Календарь. Обратитесь к разработчику.";
		КонецЕсли;	
		
		Возврат ПериодичностьПоследнийРабочийДеньМесяца;
	КонецЕсли;	
	
	Возврат (ПоследнийДеньПериода(ДатаСобытия, НастройкаУчета) = НачалоДня(ДатаСобытия));
	
КонецФункции	

Функция ПолучитьПериодичностиДаты(Дата) Экспорт
	
	ДатаПроверки = КонецДня(Дата);
	
	ПериодичностиДаты = Новый Структура("ПериодичностьДень, ПериодичностьМесяц, ПериодичностьКвартал, ПериодичностьГод", Ложь, Ложь, Ложь, Ложь);
	
	// В коде модулей документов, который сюда собрали, было вот такое равенство, но оно излишне - всегда Истина же.
	//ПериодичностиДаты.ПериодичностьДень   	= (КонецДня(ДатаПроверки) = ДатаПроверки);
	ПериодичностиДаты.ПериодичностьДень		= Истина;
	ПериодичностиДаты.ПериодичностьМесяц   	= (КонецМесяца(ДатаПроверки) = ДатаПроверки);
	ПериодичностиДаты.ПериодичностьКвартал 	= (КонецКвартала(ДатаПроверки) = ДатаПроверки);
	ПериодичностиДаты.ПериодичностьГод     	= (КонецГода(ДатаПроверки) = ДатаПроверки);
	
	Возврат ПериодичностиДаты;
	
КонецФункции	

#КонецОбласти

Функция НеПерекурсовыватьСчета() Экспорт
	РезультатТаблица = Новый ТаблицаЗначений;
	РезультатТаблица.Колонки.Добавить("Счет");
	РезультатТаблица.Колонки.Добавить("ДополнительнаяАналитика");
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.АктивыВДУ02;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.АктивыВДУ03;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.Расчеты25; //резервы под обесценение
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ТребованияПоПоставкеДС01;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ТребованияПоПоставкеДС02;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;

	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ОбязательстваПоПоставкеДенежныхСредствПоПроизводнымФинансовымИнструментамПоРезидентам;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ТребованияПоПоставкеДенежныхСредствПоПроизводнымФинансовымИнструментамОтРезидентов;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ДобавочныйКапитал03;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ДобавочныйКапитал05;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ДобавочныйКапитал30;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ДолговыеДляПродажи50;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	ИсключитьСчет = РезультатТаблица.Добавить();
	ИсключитьСчет.Счет = ПланыСчетов.Единый.ДолговыеДляПродажи51;
	ИсключитьСчет.ДополнительнаяАналитика = Неопределено;
	
	Возврат РезультатТаблица;
	
КонецФункции

Функция ПолучитьДвиженияДляФормированияПроводокПоТорговымОперациям(ДокументОбъект, Сделка, ВидУчета, НужнаТаблицаОстатков, НужнаТаблицаПредварительныхЗатрат,ПараметрыДляГлавыГ)
	
	МенеджерВременныхТаблиц = Неопределено;
	ЕстьМенеджерВременныхТаблицДвиженияПартийЗаПериод = ДокументОбъект.ДополнительныеСвойства.Свойство("МенеджерВременныхТаблицДвиженияПартийЗаПериод", МенеджерВременныхТаблиц);

	СубконтоЦБ_Р = Новый Массив;
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	СубконтоЦБ_Р.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Резервы);
	
	Запрос = Новый Запрос;
	Если ЕстьМенеджерВременныхТаблицДвиженияПартийЗаПериод Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДвиженияПартий") <> Неопределено Тогда 
			
			ТекущиеВременныеТаблицы = Новый Массив;
			ТекущиеВременныеТаблицы.Добавить("_ДвиженияПартийЗаПериод");
			ТекущиеВременныеТаблицы.Добавить("_АналитикаРезервовПолный");
			ТекущиеВременныеТаблицы.Добавить("_ТаблицаПредварительныхЗатратПолная");
			
			СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос, , ТекущиеВременныеТаблицы);	
	
		КонецЕсли;	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДвиженияПартийЗаПериод.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
			|	_ДвиженияПартийЗаПериод.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ДвиженияПартийЗаПериод.ВидДвижения КАК ВидДвижения,
			|	_ДвиженияПартийЗаПериод.Количество КАК Количество,
			|	_ДвиженияПартийЗаПериод.Стоимость КАК Стоимость,
			|	_ДвиженияПартийЗаПериод.СтоимостьКупона КАК СтоимостьКупона,
			|	_ДвиженияПартийЗаПериод.Переоценка КАК Переоценка,
			|	_ДвиженияПартийЗаПериод.ИндексацияНоминала КАК ИндексацияНоминала,
			|	_ДвиженияПартийЗаПериод.ПереоценкаКупона КАК ПереоценкаКупона,
			|	_ДвиженияПартийЗаПериод.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
			|	_ДвиженияПартийЗаПериод.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	_ДвиженияПартийЗаПериод.ДисконтПремия КАК ДисконтПремия,
			|	_ДвиженияПартийЗаПериод.СтоимостьПокупки КАК СтоимостьПокупки,
			|	_ДвиженияПартийЗаПериод.Партия КАК Партия,
			|	_ДвиженияПартийЗаПериод.СтрокаПартии КАК СтрокаПартии,
			|	_ДвиженияПартийЗаПериод.КорректировкаЭСП КАК КорректировкаЭСП,
			|	_ДвиженияПартийЗаПериод.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
			|	_ДвиженияПартийЗаПериод.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
			|	_ДвиженияПартийЗаПериод.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
			|	_ДвиженияПартийЗаПериод.Перекурсовка КАК Перекурсовка,
			|	_ДвиженияПартийЗаПериод.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
			|	_ДвиженияПартийЗаПериод.ВалютаНоминала КАК ВалютаНоминала
			|ПОМЕСТИТЬ _ДвиженияПартий
			|ИЗ
			|	_ДвиженияПартийЗаПериод КАК _ДвиженияПартийЗаПериод
			|ГДЕ
			|	_ДвиженияПартийЗаПериод.Регистратор = &Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_АналитикаРезервовПолный.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_АналитикаРезервовПолный.АналитикаРезерва КАК АналитикаРезерва,
			|	_АналитикаРезервовПолный.СчетУчетаРезерва КАК СчетУчетаРезерва,
			|	_АналитикаРезервовПолный.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_АналитикаРезервовПолный.Организация КАК Организация
			|ПОМЕСТИТЬ _АналитикаРезервов
			|ИЗ
			|	_АналитикаРезервовПолный КАК _АналитикаРезервовПолный
			|ГДЕ
			|	_АналитикаРезервовПолный.СчетУчетаРезерва В
			|			(ВЫБРАТЬ
			|				_ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов
			|			ИЗ
			|				_ДвиженияПартийЗаПериод КАК _ДвиженияПартий
			|			ГДЕ
			|				_ДвиженияПартий.СуммаРезервовПодОбесценение > 0)
			|	И _АналитикаРезервовПолный.СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|	И _АналитикаРезервовПолный.ЦеннаяБумага В
			|			(ВЫБРАТЬ
			|				_ДвиженияПартий.ЦеннаяБумага
			|			ИЗ
			|				_ДвиженияПартийЗаПериод КАК _ДвиженияПартий
			|			ГДЕ
			|				_ДвиженияПартий.СуммаРезервовПодОбесценение > 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЗадолженностиПоДенежнымСредствам.Сумма) КАК Сумма,
			|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта
			|ПОМЕСТИТЬ _ТаблицаНакладныхРасходов
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Основание = &Сделка
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления В(&СписокСтратегий)
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.поСделке)
			|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ &ДатаСделки И &ДатаДокумента
			|	И ЗадолженностиПоДенежнымСредствам.Активность
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствам.Период,
			|	ЗадолженностиПоДенежнымСредствам.Валюта";
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
			|	БухПартииЦенныхБумаг.Количество КАК Количество,
			|	БухПартииЦенныхБумаг.Стоимость КАК Стоимость,
			|	БухПартииЦенныхБумаг.СтоимостьКупона КАК СтоимостьКупона,
			|	БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
			|	БухПартииЦенныхБумаг.ИндексацияНоминала КАК ИндексацияНоминала,
			|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
			|	БухПартииЦенныхБумаг.СуммаЧастичногоПогашения КАК СуммаЧастичногоПогашения,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	БухПартииЦенныхБумаг.ДисконтПремия КАК ДисконтПремия,
			|	БухПартииЦенныхБумаг.СтоимостьПокупки КАК СтоимостьПокупки,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
			|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
			|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
			|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
			|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
			|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
			|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
			|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
			|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
			|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
			|	ВЫБОР
			|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И БухПартииЦенныхБумаг.Количество = 0
			|				И БухПартииЦенныхБумаг.Стоимость = 0
			|				И БухПартииЦенныхБумаг.СтоимостьКупона = 0
			|				И БухПартииЦенныхБумаг.Переоценка = 0
			|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
			|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
			|				И БухПартииЦенныхБумаг.ДисконтПремияНачисленный = 0
			|				И БухПартииЦенныхБумаг.КорректировкаЭСП = 0
			|				И БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости = 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Перекурсовка,
			|	БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
			|	БухПартииЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала
			|ПОМЕСТИТЬ _ДвиженияПартий
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
			|	МАКСИМУМ(ЕдиныйБухгалтерскийУчетОстатки.Субконто2) КАК АналитикаРезерва,
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетУчетаРезерва,
			|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация
			|ПОМЕСТИТЬ _АналитикаРезервов
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет В
			|				(ВЫБРАТЬ
			|					_ДвиженияПартий.УчетныйАктивЕПС.СчетУчетаРезервов
			|				ИЗ
			|					_ДвиженияПартий КАК _ДвиженияПартий
			|				ГДЕ
			|					_ДвиженияПартий.СуммаРезервовПодОбесценение > 0),
			|			&СубконтоЦБ_Р,
			|			СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ
			|						_ДвиженияПартий.ЦеннаяБумага
			|					ИЗ
			|						_ДвиженияПартий КАК _ДвиженияПартий
			|					ГДЕ
			|						_ДвиженияПартий.СуммаРезервовПодОбесценение > 0)) КАК ЕдиныйБухгалтерскийУчетОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
			|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления,
			|	ЕдиныйБухгалтерскийУчетОстатки.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЗадолженностиПоДенежнымСредствам.Сумма) КАК Сумма,
			|	ЗадолженностиПоДенежнымСредствам.Период КАК Период,
			|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта
			|ПОМЕСТИТЬ _ТаблицаНакладныхРасходов
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Основание = &Сделка
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления В(&СписокСтратегий)
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.поСделке)
			|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И ЗадолженностиПоДенежнымСредствам.Период МЕЖДУ &ДатаСделки И &ДатаДокумента
			|	И ЗадолженностиПоДенежнымСредствам.Активность
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствам.Период,
			|	ЗадолженностиПоДенежнымСредствам.Валюта";
	КонецЕсли;	

	Запрос.УстановитьПараметр("Регистратор",	ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",		ВидУчета);
	
	Запрос.УстановитьПараметр("Сделка",							Сделка);
	Запрос.УстановитьПараметр("ДатаДокумента",					КонецДня(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаСделки",						НачалоДня(Сделка.Дата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ДокументОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СписокСтратегий",				Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ДокументОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("СубконтоЦБ_Р", СубконтоЦБ_Р);
	Запрос.УстановитьПараметр("АналитикаРезерваПоУмолчанию", Справочники.Резервы.РезервОбесценениеУбытки12Месяцев);
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ДокументОбъект.СчетДоверительногоУправления));
	
	Запрос.Выполнить();
	
	ДвиженияПартий				= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДвиженияПартий"].ПолучитьДанные().Выгрузить();
	АналитикаРезервов			= Запрос.МенеджерВременныхТаблиц.Таблицы["_АналитикаРезервов"].ПолучитьДанные().Выгрузить();
	ТаблицаНакладныхРасходов	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ТаблицаНакладныхРасходов"].ПолучитьДанные().Выгрузить();
	
	ОстаткиПартий = Неопределено;
	Если НужнаТаблицаОстатков Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
			|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
			|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
			|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
			|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
			|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток
			|ПОМЕСТИТЬ _ОстаткиПартий
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&ДоДокумента,
			|			ВидУчета = &ВидУчета
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И (УчетныйАктивЕПС, ЦеннаяБумага, Партия, СтрокаПартии) В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|						ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
			|						ДвиженияПартий.Партия КАК Партия,
			|						ДвиженияПартий.СтрокаПартии КАК СтрокаПартии
			|					ИЗ
			|						_ДвиженияПартий КАК ДвиженияПартий)) КАК БухПартииЦенныхБумагОстатки";
		
		Запрос.УстановитьПараметр("ДоДокумента",    Новый Граница(ДокументОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация",    ДокументОбъект.Организация);
		
		Запрос.Выполнить();
		
		ОстаткиПартий = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОстаткиПартий"].ПолучитьДанные().Выгрузить();
	КонецЕсли;
	
	ТаблицаПредварительныхЗатрат = Неопределено;
	Если НужнаТаблицаПредварительныхЗатрат Тогда
		
		Если ЕстьМенеджерВременныхТаблицДвиженияПартийЗаПериод Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ТаблицаПредварительныхЗатратПолная.Валюта КАК Валюта,
				|	_ТаблицаПредварительныхЗатратПолная.Сумма КАК Сумма,
				|	_ТаблицаПредварительныхЗатратПолная.ВалютнаяСумма КАК ВалютнаяСумма,
				|	_ТаблицаПредварительныхЗатратПолная.ДатаСделки КАК ДатаСделки,
				|	_ТаблицаПредварительныхЗатратПолная.ВалютаСделки КАК ВалютаСделки
				|ПОМЕСТИТЬ _ТаблицаПредварительныхЗатрат
				|ИЗ
				|	_ТаблицаПредварительныхЗатратПолная КАК _ТаблицаПредварительныхЗатратПолная
				|ГДЕ
				|	_ТаблицаПредварительныхЗатратПолная.Сделка = &Сделка";
		Иначе
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСумма,
				|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Документ.Сделка).Дата КАК ДатаСделки,
				|	ВЫРАЗИТЬ(ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Документ.Сделка).ВалютаСделки КАК ВалютаСделки
				|ПОМЕСТИТЬ _ТаблицаПредварительныхЗатрат
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
				|			&НачалоДня,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов),
				|			Субконто1 = &Сделка
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("НачалоДня",	Новый Граница(НачалоДня(ДокументОбъект.Дата), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Сделка",		Сделка);
		
		Запрос.Выполнить();
		
		ТаблицаПредварительныхЗатрат = Запрос.МенеджерВременныхТаблиц.Таблицы["_ТаблицаПредварительныхЗатрат"].ПолучитьДанные().Выгрузить();
	
	КонецЕсли;
	
	ТаблицаДвиженийПоГлавеГ = Неопределено;
	Если ПараметрыДляГлавыГ <> Неопределено Тогда
			
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетДт КАК СчетДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
			|	NULL КАК СубконтоДт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетКт КАК СчетКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
			|	NULL КАК СубконтоКт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаДт КАК ВалютаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаКт КАК ВалютаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоДт КАК КоличествоДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоКт КАК КоличествоКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.Сумма КАК Сумма,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаДт КАК ДополнительнаяАналитикаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаКт КАК ДополнительнаяАналитикаКт,
			|	ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетДвиженияССубконто.Регистратор) КАК ТипРегистратора
			|ПОМЕСТИТЬ Движения
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ДвиженияССубконто(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Счет = &СчетДС
			|				И Субконто1 = &ОснованиеРасчетов
			|				И Активность,
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетДвиженияССубконто
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт1,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт1,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.Сумма,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаКт,
			|	ТИПЗНАЧЕНИЯ(ЕдиныйБухгалтерскийУчетДвиженияССубконто.Регистратор)
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ДвиженияССубконто(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Счет = &СчетЦБ
			|				И Субконто1 = &ОснованиеРасчетов
			|				И Активность,
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетДвиженияССубконто
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Движения.СчетДт КАК СчетДт,
			|	Движения.СубконтоДт1 КАК СубконтоДт1,
			|	Движения.СубконтоДт2 КАК СубконтоДт2,
			|	Движения.СчетКт КАК СчетКт,
			|	Движения.СубконтоКт1 КАК СубконтоКт1,
			|	Движения.СубконтоКт2 КАК СубконтоКт2,
			|	Движения.ВалютаДт КАК ВалютаДт,
			|	Движения.ВалютаКт КАК ВалютаКт,
			|	СУММА(Движения.КоличествоДт) КАК КоличествоДт,
			|	СУММА(Движения.КоличествоКт) КАК КоличествоКт,
			|	СУММА(Движения.Сумма) КАК Сумма,
			|	СУММА(Движения.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
			|	СУММА(Движения.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
			|	Движения.ДополнительнаяАналитикаДт КАК ДополнительнаяАналитикаДт,
			|	Движения.ДополнительнаяАналитикаКт КАК ДополнительнаяАналитикаКт
			|ПОМЕСТИТЬ _ТаблицаДвиженийПоГлавеГ
			|ИЗ
			|	Движения КАК Движения
			|
			|СГРУППИРОВАТЬ ПО
			|	Движения.СчетДт,
			|	Движения.СубконтоДт1,
			|	Движения.СубконтоДт2,
			|	Движения.СчетКт,
			|	Движения.СубконтоКт1,
			|	Движения.СубконтоКт2,
			|	Движения.ВалютаДт,
			|	Движения.ВалютаКт,
			|	Движения.ДополнительнаяАналитикаДт,
			|	Движения.ДополнительнаяАналитикаКт";
		
		Если ПараметрыДляГлавыГ.ПереоценкаБумагПриПродажеНаСчетахГлавыГ Тогда // для данной настройки нужно разбивать отдельно сделку и переоценку
			Запрос.Текст = Запрос.Текст + ", ТипРегистратора";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Сделка.Дата));
		Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(ДокументОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
		Запрос.УстановитьПараметр("ОснованиеРасчетов", Сделка);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ДокументОбъект.СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("СчетДС", ПараметрыДляГлавыГ.СчетДСГлаваГ);
		Запрос.УстановитьПараметр("СчетЦБ", ПараметрыДляГлавыГ.СчетЦБГлаваГ);
		
		Запрос.Выполнить();
		
		ТаблицаДвиженийПоГлавеГ = Запрос.МенеджерВременныхТаблиц.Таблицы["_ТаблицаДвиженийПоГлавеГ"].ПолучитьДанные().Выгрузить();
	
	КонецЕсли;
	
	Возврат Новый Структура("ДвиженияПартий, ОстаткиПартий, ТаблицаНакладныхРасходов, ТаблицаДвиженийПоГлавеГ, ТаблицаПредварительныхЗатрат, АналитикаРезервов", 
							ДвиженияПартий, ОстаткиПартий, ТаблицаНакладныхРасходов, ТаблицаДвиженийПоГлавеГ, ТаблицаПредварительныхЗатрат, АналитикаРезервов);
	
КонецФункции

Функция ПолучитьЗадолженностьПоКомиссииНаГраницу(ОбъектДокумента, СписокСделок, ВидЗадолженности, Граница, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Основание КАК Сделка
		|ПОМЕСТИТЬ ТаблицаСделок
		|ИЗ
		|	&ТаблицаСделок КАК Сделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Сделка
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&Граница,
		|			СчетДоверительногоУправления В(&СписокСтратегий)
		|				И ВидЗадолженности = &ВидЗадолженности
		|				И Основание В
		|					(ВЫБРАТЬ
		|						ТаблицаСделок.Сделка
		|					ИЗ
		|						ТаблицаСделок КАК ТаблицаСделок)) КАК ЗадолженностиПоДенежнымСредствамОстатки";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("ТаблицаСделок", СписокСделок);
	Запрос.УстановитьПараметр("Граница", Граница);
	Запрос.УстановитьПараметр("СписокСтратегий", Справочники.СчетаДоверительногоУправления.ПолучитьМассивСчетовПоДоговоруДУ(ОбъектДокумента.СчетДоверительногоУправления));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьОстаткиПоказателейПартий(ОбъектДокумента, ТаблицаЦБ, ВидУчета) Экспорт
	//ТаблицаЦБ содержит колонки: ЦеннаяБумага, Рынок, УчетныйАктивЕПС
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦБ1.ЦеннаяБумага,
		|	ТаблицаЦБ1.УчетныйАктивЕПС
		|ПОМЕСТИТЬ ТаблицаЦБ
		|ИЗ
		|	&ТаблицаЦБ КАК ТаблицаЦБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦБ.ЦеннаяБумага,
		|	ТаблицаЦБ.УчетныйАктивЕПС,
		|	СУММА(ЕСТЬNULL(БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток, 0)) КАК КорректировкаЭСПОстаток,
		|	СУММА(ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток, 0)) КАК ДисконтПремияНачисленныйОстаток,
		|	СУММА(ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаОстаток, 0)) КАК ПереоценкаОстаток
		|ИЗ
		|	ТаблицаЦБ КАК ТаблицаЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&ДоДокумента,
		|				СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = &ВидУчета
		|					И (ЦеннаяБумага, УчетныйАктивЕПС) В
		|						(ВЫБРАТЬ
		|							ТаблицаЦБ.ЦеннаяБумага,
		|							ТаблицаЦБ.УчетныйАктивЕПС
		|						ИЗ
		|							ТаблицаЦБ КАК ТаблицаЦБ)) КАК БухПартииЦенныхБумагОстатки
		|		ПО ТаблицаЦБ.ЦеннаяБумага = БухПартииЦенныхБумагОстатки.ЦеннаяБумага
		|			И ТаблицаЦБ.УчетныйАктивЕПС = БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЦБ.ЦеннаяБумага,
		|	ТаблицаЦБ.УчетныйАктивЕПС";
	
	Запрос.УстановитьПараметр("ВидУчета", ВидУчета);
	Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ТаблицаЦБ", ТаблицаЦБ);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ОбъектДокумента.СчетДоверительногоУправления));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

Функция ОпределитьУчетныеАктивыЕПСДляСделки(Сделка) Экспорт
	
	Сделки = Новый ТаблицаЗначений;
	Сделки.Колонки.Добавить("Основание", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	Сделки.Добавить().Основание = Сделка;
	
	Возврат ПолучитьРаспределениеПоВидуАктива(Сделки).ВыгрузитьКолонку("УчетныйАктивЕПС");
	
КонецФункции

Функция ПолучитьРаспределениеПоВидуАктива(Сделки) Экспорт
	//На входе Таблица значений с колонками: Основание, ЦеннаяБумага (необязательно).
	//на выходе таблица в колонками: Сделка, ЦеннаяБумага, УчетныйАктивЕПС, Количество, КоличествоСделки
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	ПустаяТаблица.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов("СправочникСсылка.Акции"));
	ПустаяТаблица.Колонки.Добавить("УчетныйАктивЕПС", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ПустаяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("КоличествоСделки", Новый ОписаниеТипов("Число"));
	
	Если Сделки.Колонки.Найти("ЦеннаяБумага") = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сделки.Основание КАК Сделка
			|ПОМЕСТИТЬ СделкиЦБ
			|ИЗ
			|	&Сделки КАК Сделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаЦенныеБумаги.Ссылка КАК Основание,
			|	СделкаЦенныеБумаги.ЦеннаяБумага,
			|	СделкаЦенныеБумаги.Ссылка.ВидСделки
			|ИЗ
			|	СделкиЦБ КАК СделкиЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
			|		ПО СделкиЦБ.Сделка = СделкаЦенныеБумаги.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СделкаРЕПОЦенныеБумаги.Ссылка,
			|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
			|	СделкаРЕПОЦенныеБумаги.Ссылка.ВидСделки
			|ИЗ
			|	СделкиЦБ КАК СделкиЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
			|		ПО СделкиЦБ.Сделка = СделкаРЕПОЦенныеБумаги.Ссылка";
		
		Запрос.УстановитьПараметр("Сделки", Сделки);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат ПустаяТаблица;
		КонецЕсли;
		
		Сделки = РезультатЗапроса.Выгрузить();
		
	КонецЕсли;
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Основание КАК Сделка,
		|	Сделки.ЦеннаяБумага,
		|	Сделки.ВидСделки
		|ПОМЕСТИТЬ СделкиЦБ
		|ИЗ
		|	&Сделки КАК Сделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиЦБ.Сделка,
		|	СделкиЦБ.ЦеннаяБумага,
		|	СделкиЦБ.ВидСделки,
		|	СУММА(ЕСТЬNULL(СделкаЦенныеБумаги.Количество, СделкаРЕПОЦенныеБумаги.Количество)) КАК КоличествоСделки,
		|	ЕСТЬNULL(СделкаЦенныеБумаги.Ссылка.Рынок, СделкаРЕПОЦенныеБумаги.Ссылка.Рынок) КАК Рынок,
		|	ЕСТЬNULL(СделкаЦенныеБумаги.Ссылка.Дата, СделкаРЕПОЦенныеБумаги.Ссылка.Дата) КАК Дата
		|ПОМЕСТИТЬ СделкиЦБСКоличеством
		|ИЗ
		|	СделкиЦБ КАК СделкиЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО СделкиЦБ.Сделка = СделкаЦенныеБумаги.Ссылка
		|			И СделкиЦБ.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ПО СделкиЦБ.Сделка = СделкаРЕПОЦенныеБумаги.Ссылка
		|			И СделкиЦБ.ЦеннаяБумага = СделкаРЕПОЦенныеБумаги.ЦеннаяБумага
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкиЦБ.Сделка,
		|	СделкиЦБ.ЦеннаяБумага,
		|	СделкиЦБ.ВидСделки,
		|	ЕСТЬNULL(СделкаЦенныеБумаги.Ссылка.Рынок, СделкаРЕПОЦенныеБумаги.Ссылка.Рынок),
		|	ЕСТЬNULL(СделкаЦенныеБумаги.Ссылка.Дата, СделкаРЕПОЦенныеБумаги.Ссылка.Дата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(РаспределенияАктивовЕПС.Количество) КАК Количество,
		|	СделкиЦБ.Сделка,
		|	СделкиЦБ.ЦеннаяБумага,
		|	СделкиЦБ.ВидСделки
		|ПОМЕСТИТЬ РаспределеноЦБ
		|ИЗ
		|	СделкиЦБ КАК СделкиЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ПО СделкиЦБ.Сделка = РаспределенияАктивовЕПС.Сделка
		|			И СделкиЦБ.ЦеннаяБумага = РаспределенияАктивовЕПС.ЦеннаяБумага
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкиЦБ.Сделка,
		|	СделкиЦБ.ЦеннаяБумага,
		|	СделкиЦБ.ВидСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиЦБСКоличеством.Сделка,
		|	СделкиЦБСКоличеством.ЦеннаяБумага,
		|	СделкиЦБСКоличеством.ВидСделки,
		|	СделкиЦБСКоличеством.КоличествоСделки - ЕСТЬNULL(РаспределеноЦБ.Количество, 0) КАК Количество,
		|	ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка) КАК УчетныйАктивЕПС,
		|	СделкиЦБСКоличеством.Рынок,
		|	СделкиЦБСКоличеством.Дата,
		|	СделкиЦБСКоличеством.КоличествоСделки
		|ИЗ
		|	СделкиЦБСКоличеством КАК СделкиЦБСКоличеством
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределеноЦБ КАК РаспределеноЦБ
		|		ПО СделкиЦБСКоличеством.Сделка = РаспределеноЦБ.Сделка
		|			И СделкиЦБСКоличеством.ЦеннаяБумага = РаспределеноЦБ.ЦеннаяБумага
		|ГДЕ
		|	СделкиЦБСКоличеством.КоличествоСделки - ЕСТЬNULL(РаспределеноЦБ.Количество, 0) > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспределеноЦБ.Сделка,
		|	РаспределеноЦБ.ЦеннаяБумага,
		|	РаспределеноЦБ.ВидСделки,
		|	РаспределенияАктивовЕПС.Количество,
		|	РаспределенияАктивовЕПС.УчетныйАктивЕПС,
		|	СделкиЦБСКоличеством.Рынок,
		|	СделкиЦБСКоличеством.Дата,
		|	СделкиЦБСКоличеством.КоличествоСделки
		|ИЗ
		|	РаспределеноЦБ КАК РаспределеноЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|		ПО РаспределеноЦБ.Сделка = РаспределенияАктивовЕПС.Сделка
		|			И РаспределеноЦБ.ЦеннаяБумага = РаспределенияАктивовЕПС.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ СделкиЦБСКоличеством КАК СделкиЦБСКоличеством
		|		ПО РаспределеноЦБ.Сделка = СделкиЦБСКоличеством.Сделка
		|			И РаспределеноЦБ.ЦеннаяБумага = СделкиЦБСКоличеством.ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("Сделки", Сделки);
	
	ТаблицаАктивовПоСделкам = Запрос.Выполнить().Выгрузить();
	
	Если Сделки.Количество() > 0 Тогда
		СчетДоверительногоУправления = Сделки[0].Основание.СчетДоверительногоУправления;
	Иначе
		СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	//СтрокиБезАктиваКУдалению = Новый Массив;
	СтрокиБезАктива = ТаблицаАктивовПоСделкам.НайтиСтроки(Новый Структура("УчетныйАктивЕПС",Справочники.УчетныеАктивыЕПС.ПустаяСсылка()));
	Для Каждого СтрокаТаблицыАктивов из СтрокиБезАктива Цикл
		Если СтрокаТаблицыАктивов.ВидСделки = Перечисления.ВидыСделок.Покупка
			ИЛИ СтрокаТаблицыАктивов.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
			СтрокаТаблицыАктивов.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(СтрокаТаблицыАктивов.Дата, СтрокаТаблицыАктивов.Рынок, СтрокаТаблицыАктивов.ЦеннаяБумага, СчетДоверительногоУправления);
		//Иначе
		//	СтрокиБезАктиваКУдалению.Добавить(СтрокаТаблицыАктивов);
		КонецЕсли;
	КонецЦикла;
	
	//Для каждого СтрокаБезАктиваКУдалению Из СтрокиБезАктиваКУдалению Цикл
	//	ТаблицаАктивовПоСделкам.Удалить(СтрокаБезАктиваКУдалению);
	//КонецЦикла;
	
	Возврат ТаблицаАктивовПоСделкам;
	
КонецФункции

Функция ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423(ОбъектДокумента, Операция = "") Экспорт

	ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 = Истина;
	
	// эта настройка, согласно задаче #517624 с 1.1.24 у группы будущее работает по-другому:
	// настройка должна срабатывать если "ценная бумага списана в один день, а денежные средства от эмитента поступили позже в последующие дни"
	// или другими словами:
	// для операции оплаты настройка должна срабатывать, если оплата идет позднее дня погашения и на утро дня оплаты бумаги уже списаны
	// для операции списание настройка должна срабатывать, если списание идет именно документом списания(не оплатой) и на вечер дня списания погашение еще не оплачено
	Если Операция = "Оплата" Тогда
		
		// оплата идет позднее дня погашения
		Для каждого СтрокаОснования Из ОбъектДокумента.Основания Цикл
			Если НачалоДня(ОбъектДокумента.Дата) = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОснования.Основание, "Дата")) Тогда
				ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// на утро дня оплаты бумаги уже списаны
		Если ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК ЦеннаяБумага
				|ПОМЕСТИТЬ _ЦенныеБумаги
				|ИЗ
				|	Документ.Оплата.Основания КАК ОплатаОснования
				|ГДЕ
				|	ОплатаОснования.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток КАК КоличествоОстаток
				|ИЗ
				|	РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
				|			&Период,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ЦеннаяБумага В
				|					(ВЫБРАТЬ
				|						_ЦенныеБумаги.ЦеннаяБумага
				|					ИЗ
				|						_ЦенныеБумаги)) КАК ОстаткиЦенныхБумагЗаблокированныеОстатки
				|ГДЕ
				|	ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток > 0";
			
			Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
			Запрос.УстановитьПараметр("Период", НачалоДня(ОбъектДокумента.Дата));
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("Ссылка", ОбъектДокумента.Ссылка);
			
			Если НЕ Запрос.Выполнить().Пустой() Тогда
				ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 = Ложь;
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли Операция = "Списание" Тогда
		
		// списание идет именно документом списания(не оплатой)
		Если ТипЗнч(ОбъектДокумента) <> Тип("ДокументОбъект.СписаниеЦеннойБумаги") Тогда
			ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 = Ложь;
		Иначе // вечер дня списания погашение еще не оплачено
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
				|ИЗ
				|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
				|			&Период,
				|			Организация = &Организация      
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И Основание = &Основание) КАК ЗадолженностиПоДенежнымСредствамОстатки
				|ГДЕ
				|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток > 0";
			
			Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
			Запрос.УстановитьПараметр("Период", КонецДня(ОбъектДокумента.Дата));
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("Основание", ОбъектДокумента.ПогашениеЦеннойБумаги);
			
			Если Запрос.Выполнить().Пустой() Тогда
				ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423 = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	Возврат ОтражатьЗадолженностьПриПолномПогашенииОблигацийНаСчете47423;
	
КонецФункции

// #техдолг - переделать процедуру полностью
// сейчас по погашениям некрасиво сделано
Процедура СформироватьДвиженияПоЗакрытиюРезервовОКУ(ОбъектДокумента, СчетРезерва, ВидСубконто, СчетДоходов, АналитикаСписанияРезервов, Движения_ЕдиныйБухгалтерскийУчет, ЦеннаяБумага = Неопределено) Экспорт
	// Для закрытия резервов ОКУ в МНО, Депозитах, РЕПО, оплатах по погашениям
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ВидСубконто);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Резервы);
	
	ОтборДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка();
	
	Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады Тогда
		СсылкаДляОтбора = ОбъектДокумента.КредитныйИнструмент;
	ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов Тогда
		Если СчетРезерва = ПланыСчетов.Единый.Расчеты25 Тогда
			СсылкаДляОтбора = ОбъектДокумента.Основания[0].Основание; // не страшно т.к. нет оплат по 2м и более погашениям, но не красиво капец
		Иначе
			СсылкаДляОтбора = ОбъектДокумента.ПерваяЧастьРЕПО;
		КонецЕсли;
	ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов Тогда
		СсылкаДляОтбора = ОбъектДокумента.МНО;
	ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги Тогда
		СсылкаДляОтбора = ЦеннаяБумага;
		ОтборДопАналитика = Справочники.ДополнительныеАналитикиЛицевыхСчетов.РезервПоЗадолженностиПоПогашениюКупона;
	Иначе
		СсылкаДляОтбора = Неопределено;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Резерв,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Актив,
		|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт, 0)) КАК СуммаОстатокЕПС,
		|	СУММА(ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт, 0)) КАК ВалютнаяСуммаОстатокЕПС,
		|	ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета КАК ОрганизацияВалютаУчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетРезерва,
		|			&ВидСубконто,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &Ссылка
		|				И ЛицевойСчет.ДополнительнаяАналитика = &ОтборДопАналитика) КАК ЕдиныйБухгалтерскийУчетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
		|	ЕдиныйБухгалтерскийУчетОстатки.Организация.ВалютаУчета";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаДляОтбора);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетРезерва", СчетРезерва);
	Запрос.УстановитьПараметр("ВидСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ОтборДопАналитика", ОтборДопАналитика);
	
	Движение = Запрос.Выполнить().Выбрать();
	
	Пока Движение.Следующий() Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, Движения_ЕдиныйБухгалтерскийУчет, Движение.СуммаОстатокЕПС, "Списание резерва");	
		
		Проводка.СчетДт	= СчетРезерва;
		Проводка.СубконтоДт.Резервы	= Движение.Резерв;
		
		Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады Тогда
			Проводка.СубконтоДт.ДепозитныеВклады = ОбъектДокумента.КредитныйИнструмент;
		ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов Тогда
			Если СчетРезерва = ПланыСчетов.Единый.Расчеты25 Тогда
				Проводка.СубконтоДт.Контрагенты	= ОбъектДокумента.Контрагент;
			Иначе
				Проводка.СубконтоДт.Контрагенты	= Движение.Актив.Контрагент;
			КонецЕсли;
			Проводка.СубконтоДт.ОснованиеРасчетов	= Движение.Актив;
		ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов Тогда
			Проводка.СубконтоДт.БанковскиеСчета	= Движение.Актив.РасчетныйСчет;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = Движение.Актив;
		ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги Тогда
			Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.РезервПоЗадолженностиПоПогашениюКупона;
		КонецЕсли;	
		
		Если Проводка.СчетДт.Валютный Тогда
			Проводка.ВалютаДт	= Движение.ОрганизацияВалютаУчета;
			Проводка.ВалютнаяСуммаДт	= Движение.СуммаОстатокЕПС;
		КонецЕсли;
		
		Проводка.СчетКт	= СчетДоходов;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов	= АналитикаСписанияРезервов;
		
		Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов Или ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов Тогда
			// СделкаРЕПО и ПриходПроцентовМНО
			Проводка.СубконтоКт.ЦенныеБумаги	= Движение.Актив;
		ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады Тогда
			// ЗакрытиеКредитногоИнструмента
			Проводка.СубконтоКт.ЦенныеБумаги = ОбъектДокумента.КредитныйИнструмент;
		ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги Тогда
			// Оплата по погашению купона
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		КонецЕсли;	
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт	= Движение.ОрганизацияВалютаУчета;
			Проводка.ВалютнаяСуммаКт	= Движение.СуммаОстатокЕПС;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры	

// Возвращает ГФУ для списания резервов. Используется в СделкаРЕПО, ПриходПроцентовМНО, ЗакрытиеКредитногоИнструмента 
Функция ПолучитьГФУСписанияРезервов(ОбъектДокумента, УчетныйАктив) Экспорт
	
	АналитикиСписанияРезервов = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "АналитикаСписанияРезервов");
	
	АналитикаСписанияРезервов = АналитикиСписанияРезервов[УчетныйАктив.ИмяПредопределенныхДанных];
	Если Не ЗначениеЗаполнено(АналитикаСписанияРезервов) Тогда
		АналитикаСписанияРезервов = УчетныйАктив.АналитикаСписанияРезервов;
	КонецЕсли;
	
	Возврат АналитикаСписанияРезервов;
	
КонецФункции

Функция ОпределитьГФУРезервовДляБумагДляПродажиНаСчете106(УчетныйАктивЕПС, ДляНачисления = Истина) Экспорт

	Если ДляНачисления Тогда
		
		Если УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83501");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83502");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83503");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83504");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83506");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("83507");
			
		Иначе
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка();
			
		КонецЕсли;
		
	Иначе // списание резервов

		
		Если УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87501");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87502");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87503");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87504");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87505");
			
		ИначеЕсли УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов Тогда
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("87507");
			
		Иначе
			
			Возврат Справочники.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции
