// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Выгрузка сообщений об открытии (закрытии) ИИС",
		"0.30",
		"",
		Истина);
		
	// команды
	
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, 
		"ОтчетОПросроченныхСообщенияхУдаленныхСообщенияхПропускахНомеровРЭМ", 
		"Отчет о просроченных сообщениях, удаленных сообщениях, пропусках/дублировании номеров",
		, Ложь,
		"ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "ОтчетОПросроченныхСообщенияхУдаленныхСообщенияхПропускахНомеров") Тогда
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата())) Тогда
			ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;
			ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
			
			ОтправитьОтчет(ПолучателиОповещения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьОтчет(ПолучателиОповещения) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	СформироватьОтчет(Результат);
	
	Если Результат.ВысотаТаблицы > 0 Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = Строка(ЭтотОбъект.Организация.Наименование) + ". Отчет о просроченных сообщениях, удаленных сообщениях, пропусках/дублировании номеров на " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	КонецЕсли;
	
КонецПроцедуры	

Функция СформироватьОтчет(Результат) Экспорт
	
	Если Ложь Тогда
		Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат.Очистить();
	
	Макет = ПолучитьМакет("Отчет");
	
	ОбластьШапкаТребуютОтправки		= Макет.ПолучитьОбласть("ШапкаТребуютОтправки");
	ОбластьСтрокаТребуютОтправки	= Макет.ПолучитьОбласть("СтрокаТребуютОтправки");
	
	ОбластьШапкаПомеченыНаУдаление	= Макет.ПолучитьОбласть("ШапкаПомеченыНаУдаление");
	ОбластьСтрокаПомеченыНаУдаление	= Макет.ПолучитьОбласть("СтрокаПомеченыНаУдаление");
	
	ОбластьСтрокаПропускиНомеров	= Макет.ПолучитьОбласть("СтрокаПропускиНомеров");
	
	ОбластьПустаяСтрока				= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("ДатаНачала"		, Дата(2019, 10, 1));
	Запрос.УстановитьПараметр("ДатаОкончания"	, ТекущаяДата());
	Запрос.УстановитьПараметр("Организация"		, ЭтотОбъект.Организация);
	
	#Область ТекстЗапроса	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводДенежныхСредств.Дата КАК Дата,
		|	ВводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводДенежныхСредств.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Вводы
		|ИЗ
		|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|ГДЕ
		|	ВводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВводДенежныхСредств.Проведен
		|	И ВводДенежныхСредств.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВводЦенныхБумаг.Дата,
		|	ВводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВводЦенныхБумаг.Ссылка
		|ИЗ
		|	Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|ГДЕ
		|	ВводЦенныхБумаг.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВводЦенныхБумаг.Проведен
		|	И ВводЦенныхБумаг.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводДенежныхСредств.Дата КАК Дата,
		|	ВыводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВыводДенежныхСредств.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Выводы
		|ИЗ
		|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|ГДЕ
		|	ВыводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВыводДенежныхСредств.Проведен
		|	И ВыводДенежныхСредств.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыводЦенныхБумаг.Дата,
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Ссылка
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|ГДЕ
		|	ВыводЦенныхБумаг.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И ВыводЦенныхБумаг.Проведен
		|	И ВыводЦенныхБумаг.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АнкетаФизическогоЛица.Дата,
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления,
		|	АнкетаФизическогоЛица.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнкетаФизическогоЛица.Организация КАК Организация,
		|		АнкетаФизическогоЛица.Ссылка КАК Ссылка,
		|		АнкетаФизическогоЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|		АнкетаФизическогоЛица.Дата КАК Дата,
		|		МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ПериодКлиентаДУ
		|	ИЗ
		|		Документ.АнкетаФизическогоЛица КАК АнкетаФизическогоЛица
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|			ПО АнкетаФизическогоЛица.Организация = КлиентыДоверительногоУправления.Организация
		|				И АнкетаФизическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправления.Клиент
		|				И АнкетаФизическогоЛица.Дата >= КлиентыДоверительногоУправления.Период
		|				И (КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		АнкетаФизическогоЛица.Проведен
		|		И АнкетаФизическогоЛица.Организация = &Организация
		|		И НЕ АнкетаФизическогоЛица.ДатаСмерти = ДАТАВРЕМЯ(1, 1, 1)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнкетаФизическогоЛица.Ссылка,
		|		АнкетаФизическогоЛица.ЮрФизЛицо,
		|		АнкетаФизическогоЛица.Дата,
		|		АнкетаФизическогоЛица.Организация) КАК АнкетаФизическогоЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО АнкетаФизическогоЛица.Организация = КлиентыДоверительногоУправления.Организация
		|			И АнкетаФизическогоЛица.ЮрФизЛицо = КлиентыДоверительногоУправления.Клиент
		|			И АнкетаФизическогоЛица.ПериодКлиентаДУ = КлиентыДоверительногоУправления.Период
		|			И (КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Вводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МИНИМУМ(ВТ_Вводы.Ссылка) КАК Ссылка,
		|	ДатыПервыхВводов.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ПервыеВводыВыводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Вводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(ВТ_Вводы.Дата) КАК Дата
		|	ИЗ
		|		ВТ_Вводы КАК ВТ_Вводы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Вводы.СчетДоверительногоУправления) КАК ДатыПервыхВводов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Вводы КАК ВТ_Вводы
		|		ПО ДатыПервыхВводов.СчетДоверительногоУправления = ВТ_Вводы.СчетДоверительногоУправления
		|			И ДатыПервыхВводов.Дата = ВТ_Вводы.Дата
		|ГДЕ
		|	ДатыПервыхВводов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Вводы.СчетДоверительногоУправления,
		|	ДатыПервыхВводов.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Выводы.СчетДоверительногоУправления,
		|	МИНИМУМ(ВТ_Выводы.Ссылка),
		|	ДатаПервыхВыводов.Дата
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Выводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(ВТ_Выводы.Дата) КАК Дата
		|	ИЗ
		|		ВТ_Выводы КАК ВТ_Выводы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Выводы.СчетДоверительногоУправления) КАК ДатаПервыхВыводов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Выводы КАК ВТ_Выводы
		|		ПО ДатаПервыхВыводов.СчетДоверительногоУправления = ВТ_Выводы.СчетДоверительногоУправления
		|			И ДатаПервыхВыводов.Дата = ВТ_Выводы.Дата
		|ГДЕ
		|	ДатаПервыхВыводов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Выводы.СчетДоверительногоУправления,
		|	ДатаПервыхВыводов.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 3
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ПоследниеТриРабочих
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(МИНИМУМ(_ПоследниеТриРабочих.Дата), ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _ПоследнийРабочийДень
		|ИЗ
		|	_ПоследниеТриРабочих КАК _ПоследниеТриРабочих
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПервыеВводыВыводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.ВводДенежныхСредств
		|				ИЛИ ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ""Открытие""
		|		КОГДА ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.ВыводДенежныхСредств
		|				И ВТ_ПервыеВводыВыводы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС)
		|			ТОГДА ""Перевод""
		|		КОГДА ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.ВыводДенежныхСредств
		|				ИЛИ ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.ВыводЦенныхБумаг
		|				ИЛИ ВТ_ПервыеВводыВыводы.Ссылка ССЫЛКА Документ.АнкетаФизическогоЛица
		|			ТОГДА ""Закрытие""
		|	КОНЕЦ КАК ВидСообщения,
		|	ВТ_ПервыеВводыВыводы.Ссылка КАК Документ,
		|	ВТ_ПервыеВводыВыводы.Дата КАК Дата,
		|	НАЧАЛОПЕРИОДА(ВТ_ПервыеВводыВыводы.Дата, ДЕНЬ) <> НАЧАЛОПЕРИОДА(_ПоследнийРабочийДень.Дата, ДЕНЬ) КАК Просрочен
		|ПОМЕСТИТЬ _ТребуютОтправки
		|ИЗ
		|	ВТ_ПервыеВводыВыводы КАК ВТ_ПервыеВводыВыводы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследнийРабочийДень КАК _ПоследнийРабочийДень
		|		ПО ВТ_ПервыеВводыВыводы.Дата <= _ПоследнийРабочийДень.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО (НомераОбъектов.Организация = &Организация)
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС))
		|			И ВТ_ПервыеВводыВыводы.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВводДенежныхСредств), ТИП(Документ.ВводЦенныхБумаг))
		|					ТОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) В (ТИП(Документ.ВводДенежныхСредств), ТИП(Документ.ВводЦенныхБумаг))
		|				КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПервыеВводыВыводы.Ссылка) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|					ТОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) В (ТИП(Документ.ВыводДенежныхСредств), ТИП(Документ.ВыводЦенныхБумаг), ТИП(Документ.АнкетаФизическогоЛица))
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	НомераОбъектов.Номер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НомераОбъектов.СчетДоверительногоУправления КАК Субъект,
		|	НомераОбъектов.Объект КАК Документ
		|ПОМЕСТИТЬ _ПомеченыНаУдаление
		|ИЗ
		|	РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|ГДЕ
		|	НомераОбъектов.Организация = &Организация
		|	И НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС)
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) = ТИП(Документ.ВводДенежныхСредств)
		|				ТОГДА ВЫРАЗИТЬ(НомераОбъектов.Объект КАК Документ.ВводДенежныхСредств).ПометкаУдаления
		|			КОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) = ТИП(Документ.ВводЦенныхБумаг)
		|				ТОГДА ВЫРАЗИТЬ(НомераОбъектов.Объект КАК Документ.ВводЦенныхБумаг).ПометкаУдаления
		|			КОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) = ТИП(Документ.ВыводДенежныхСредств)
		|				ТОГДА ВЫРАЗИТЬ(НомераОбъектов.Объект КАК Документ.ВыводДенежныхСредств).ПометкаУдаления
		|			КОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) = ТИП(Документ.ВыводЦенныхБумаг)
		|				ТОГДА ВЫРАЗИТЬ(НомераОбъектов.Объект КАК Документ.ВыводЦенныхБумаг).ПометкаУдаления
		|			КОГДА ТИПЗНАЧЕНИЯ(НомераОбъектов.Объект) = ТИП(Документ.АнкетаФизическогоЛица)
		|				ТОГДА ВЫРАЗИТЬ(НомераОбъектов.Объект КАК Документ.АнкетаФизическогоЛица).ПометкаУдаления
		|		КОНЕЦ = ИСТИНА";
#КонецОбласти
	
	Запрос.Выполнить();
	
	ТребуютОтправки		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ТребуютОтправки").ПолучитьДанные().Выгрузить();
	ПомеченыНаУдаление	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ПомеченыНаУдаление").ПолучитьДанные().Выгрузить();
	
	ТребуютОтправки.Сортировать("Дата");
	
#Область ИстёкСрокОтправки
	ПараметрыПоиска = Новый Структура("Просрочен", Истина);
	НайденныеСтроки = ТребуютОтправки.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьШапкаТребуютОтправки.Параметры.Заголовок = "Сообщения, по которым истёк срок отправки";
		Результат.Вывести(ОбластьШапкаТребуютОтправки);
		
		Результат.Область(Результат.ВысотаТаблицы - 1, 1, Результат.ВысотаТаблицы - 1, 1).ЦветТекста = Новый Цвет(255, 0, 0);
		
		Для Каждого СтрокаТребуютОтправки Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТребуютОтправки.Параметры, СтрокаТребуютОтправки);
			Результат.Вывести(ОбластьСтрокаТребуютОтправки);
		КонецЦикла;
		
		Результат.Вывести(ОбластьПустаяСтрока);
	КонецЕсли;
#КонецОбласти

#Область ИстекаетСрокОтправки
	ПараметрыПоиска = Новый Структура("Просрочен", Ложь);
	НайденныеСтроки = ТребуютОтправки.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ОбластьШапкаТребуютОтправки.Параметры.Заголовок = "Сообщения, по которым завтра истекает срок отправки";
		Результат.Вывести(ОбластьШапкаТребуютОтправки);
		
		Для Каждого СтрокаТребуютОтправки Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТребуютОтправки.Параметры, СтрокаТребуютОтправки);
			Результат.Вывести(ОбластьСтрокаТребуютОтправки);
		КонецЦикла;
		
		Результат.Вывести(ОбластьПустаяСтрока);
	КонецЕсли;
#КонецОбласти	
	
#Область ПомеченыНаУдаление
	Если ПомеченыНаУдаление.Количество() > 0 Тогда
		
		Результат.Вывести(ОбластьШапкаПомеченыНаУдаление);
		
		Для Каждого СтрокаПомеченыНаУдаление Из ПомеченыНаУдаление Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаПомеченыНаУдаление.Параметры, СтрокаПомеченыНаУдаление);
			Результат.Вывести(ОбластьСтрокаПомеченыНаУдаление);
		КонецЦикла;
		
		Результат.Вывести(ОбластьПустаяСтрока);
	
	КонецЕсли;
#КонецОбласти	

#Область ПропускиИДублированиеНомеров

	ПропускиНомеров = ПолучитьПропуски();
	Если ПропускиНомеров.Количество() > 0 Тогда
		МассивДублей		= Новый Массив;
		МассивПропущенных	= Новый Массив;
		
		Для Каждого СтрокаПропусков Из ПропускиНомеров Цикл
			Если СтрокаПропусков.Дублирование Тогда
				МассивДублей.Добавить(Формат(СтрокаПропусков.Номер, "ЧГ=0"));
			Иначе
				МассивПропущенных.Добавить(Формат(СтрокаПропусков.Номер, "ЧГ=0"));
			КонецЕсли;
		КонецЦикла;
		
		Если МассивДублей.Количество() > 0 Тогда
			ОбластьСтрокаПропускиНомеров.Параметры.Заголовок = "Дублируются номера: " + СтрСоединить(МассивДублей, ",");
			Результат.Вывести(ОбластьСтрокаПропускиНомеров);
			Результат.Вывести(ОбластьПустаяСтрока);
		КонецЕсли;
		
		Если МассивПропущенных.Количество() > 0 Тогда
			ОбластьСтрокаПропускиНомеров.Параметры.Заголовок = "Пропущены номера: " + СтрСоединить(МассивПропущенных, ",");
			Результат.Вывести(ОбластьСтрокаПропускиНомеров);
		КонецЕсли;
		
	КонецЕсли;

#КонецОбласти

	Результат.ТолькоПросмотр		= Истина;
	Результат.ОтображатьСетку		= Ложь;
	Результат.ОтображатьЗаголовки	= Ложь;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьПропуски()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НомераОбъектов.Номер КАК Номер,
		|	1 КАК Количество
		|ИЗ
		|	РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|ГДЕ
		|	НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.СообщенияОбОткрытииЗакрытииИИС)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	НомераОбъектов = Новый ТаблицаЗначений;
	НомераОбъектов.Колонки.Добавить("Номер"		, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 0)));
	НомераОбъектов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 0)));
	
	КоличествоИндексов = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найти(Выборка.Номер, ".") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НомераОбъектов.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КоличествоИндексов = МАКС(НоваяСтрока.Номер, КоличествоИндексов);
		
	КонецЦикла;
	
	ТаблицаИндексов = Новый ТаблицаЗначений;
	ТаблицаИндексов.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 0)));
	
	Для Индекс = 1 По КоличествоИндексов Цикл
		НоваяСтрока = ТаблицаИндексов.Добавить();
		НоваяСтрока.Индекс = Индекс;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("НомераОбъектов"	, НомераОбъектов);
	Запрос.УстановитьПараметр("ТаблицаИндексов"	, ТаблицаИндексов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НомераОбъектов.Номер КАК Номер,
		|	НомераОбъектов.Количество КАК Количество
		|ПОМЕСТИТЬ _НомераОбъектов
		|ИЗ
		|	&НомераОбъектов КАК НомераОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НомераОбъектов.Номер КАК Номер,
		|	СУММА(НомераОбъектов.Количество) КАК Количество
		|ПОМЕСТИТЬ _НомераОбъектовСвернуто
		|ИЗ
		|	_НомераОбъектов КАК НомераОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	НомераОбъектов.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИндексов.Индекс КАК Индекс
		|ПОМЕСТИТЬ _ТаблицаИндексов
		|ИЗ
		|	&ТаблицаИндексов КАК ТаблицаИндексов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаИндексов.Индекс КАК Номер,
		|	ЕСТЬNULL(НомераОбъектов.Количество, 0) > 1 КАК Дублирование
		|ИЗ
		|	_ТаблицаИндексов КАК _ТаблицаИндексов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераОбъектовСвернуто КАК НомераОбъектов
		|		ПО _ТаблицаИндексов.Индекс = НомераОбъектов.Номер
		|ГДЕ
		|	(НомераОбъектов.Номер ЕСТЬ NULL
		|			ИЛИ ЕСТЬNULL(НомераОбъектов.Количество, 0) > 1)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
























