
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Возврат "БизнесПроцесс.ЗачислениеПаев.Форма.ФормаЗадачи";
	
КонецФункции

Процедура ЗагрузитьДанныеОтДКРегион(Организация, Дата, ПаевойИнвестиционныйФонд, Задача, Отказ) Экспорт
	
	ОбменДаннымиСДК = Обработки.ОбменДаннымиПИФ_С_ДК_Регион.Создать();
	
	ОбменДаннымиСДК.Дата						= Дата;
	ОбменДаннымиСДК.Организация					= Организация;                                                   
	ОбменДаннымиСДК.ПаевойИнвестиционныйФонд	= ПаевойИнвестиционныйФонд;	
	ОбменДаннымиСДК.Задача						= Задача;
		
	ОбменДаннымиСДК.ЗагрузитьДанные(Отказ);
			
КонецПроцедуры
