
&НаСервереБезКонтекста
Функция ОпределитьМинимальнуюДатуДействующихМНОПодОжидаемоеПоступлениеДенежныхСредств()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(МИНИМУМ(ДокументМНО.Дата), ДЕНЬ), &ТекущаяДата) КАК Дата
		|ИЗ
		|	Документ.МНО КАК ДокументМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеМНО КАК СторнированиеМНО
		|		ПО ДокументМНО.Ссылка = СторнированиеМНО.МНО
		|			И (СторнированиеМНО.Проведен)
		|ГДЕ
		|	ДокументМНО.Основание.ПодОжидаемоеПоступлениеДенежныхСредств = ИСТИНА
		|	И СторнированиеМНО.Ссылка ЕСТЬ NULL
		|	И ДокументМНО.ДатаВозврата >= &ТекущаяДата
		|	И ДокументМНО.Проведен";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	// нас интересуют только МНО предыдущего и текущего рабочих дней,
	// т.к. остальные либо сработали, либо должны были быть сторнированы,
	// но на всякий случай дадим небольшой запас -- 10 календарных дней
	Возврат Макс(Выборка.Дата, НачалоДня(ТекущаяДатаСеанса()) - 10*86400);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("МинимальнаяДатаДействующихМНОПодОжидаемоеПоступлениеДенежныхСредств", ОпределитьМинимальнуюДатуДействующихМНОПодОжидаемоеПоступлениеДенежныхСредств());
	
КонецПроцедуры
