
Функция ПолучитьТекстЗапросаДляКонтроляКоличестваРегистраторов() Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Регистратор КАК Регистратор,
		|	НАЧАЛОПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодНачало,
		|	КОНЕЦПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодКонец,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НаборЗаписей.Организация КАК Организация
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период МЕЖДУ _НаборЗаписей.ПериодНачало И _НаборЗаписей.ПериодКонец)
		|			И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = _НаборЗаписей.Организация
		|			И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = _НаборЗаписей.СчетДоверительногоУправления
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор <> _НаборЗаписей.Регистратор";
	
	Возврат ТекстЗапроса

КонецФункции

