
////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбработкаПроверкиЗаполненияОтказ", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ДоговорБрокерскогоОбслуживания = ПолучитьДоговорБрокерскогоОбслуживания(Запись.Организация, Запись.СчетДоверительногоУправления, Запись.Брокер);
		
		Если Не ЗначениеЗаполнено(ДоговорБрокерскогоОбслуживания) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета д/у «" + Строка(Запись.СчетДоверительногоУправления) + "» не зарегистрирован договор с брокером «" + Строка(Запись.Брокер) + "»",,,, Отказ);
			
		Иначе
			
			// проверим дату расторжения договора 
			// #ТехническийДолг Был неявный запрос в цикле, стал явный. Проверку дат вынести в отдельную процедуру, пример в УсловияДоговоровОбщие
			РеквизитыДоговора = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ДоговорБрокерскогоОбслуживания, "ДатаРасторжения");
			Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаРасторжения)
				И (Запись.ДатаЗакрытия > РеквизитыДоговора.ДатаРасторжения ИЛИ Не ЗначениеЗаполнено(Запись.ДатаЗакрытия))
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия исполнителя «" + Строка(Запись.СчетДоверительногоУправления) + "» по счету брокера «" + Строка(Запись.РасчетныйСчет) + "» не должна быть позднее даты расторжения договора.", ЭтотОбъект, "ДатаЗакрытия",, Отказ);
			КонецЕсли;
		
		КонецЕсли;
		
		// т.к. нам глубоко до лампочки, когда там брокер закрывает свои счета,
		// проверять дату их закрытия нам не интересно
		
		// т.к. брокер может учитывать активы не на собственных счетах (например, Т+
		// на ММВБ у БК РЕГИОН), то проверять владельца р/счета бессмысленно
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ПолучитьДоговорБрокерскогоОбслуживания(Организация, СчетДоверительногоУправления, Брокер)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеров");

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер", Брокер);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].ДоговорБрокерскогоОбслуживания; 	
	
КонецФункции
