
Процедура СформироватьДвижения(Сделка) Экспорт

	Сделка.Движения.УсловияСделок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Дата КАК Период,
		|	Сделка.Организация КАК Организация,
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.Рынок КАК Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЛОЖЬ КАК Отменено,
		|	СделкаЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА Сделка.ДатаИсполнения
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаИсполнения,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаОплаты
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.РаздельноеИсполнение
		|						ТОГДА Сделка.ДатаПоставки
		|					ИНАЧЕ Сделка.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаПоставки,
		|	Сделка.ВалютаОплаты КАК ВалютаОплаты,
		|	Сделка.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	Сделка.КурсОплаты КАК КурсОплаты,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.ЦенаПроцент КАК ЦенаПроцент,
		|	СделкаЦенныеБумаги.ЦенаКупона КАК ЦенаКупона,
		|	СделкаЦенныеБумаги.Сумма КАК Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|	Сделка.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	Сделка.РаздельноеИсполнение КАК РаздельноеИсполнение,
		|	Сделка.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка
		|ГДЕ
		|	Сделка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СделкаЦенныеБумаги.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Сделка.Движения.УсловияСделок.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвижения
