
#Область Регистрационные_данные

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Оповещения о средствах на транзитных счетах ПИФ",
		"0.5",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещенияОСредствахНаТранзитныхСчетахПИФРЭМ",	"Оповещения о средствах на транзитных счетах ПИФ (РЭМ)",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещенияОСредствахНаТранзитныхСчетахПИФТраст",	"Оповещения о средствах на транзитных счетах ПИФ (Траст)",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещенияОСредствахНаТранзитныхСчетахПИФУКПИ",	"Оповещения о средствах на транзитных счетах ПИФ (УКПИ)",,	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Интерфейс_для_выполнения_регламентных_заданий

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ЭтотОбъект.Дата			= ТекущаяДатаСеанса();	
	ЭтотОбъект.Организация	= ПараметрыКоманды.Организация;	
	
	Если Найти(ИдентификаторКоманды, "ОповещенияОСредствахНаТранзитныхСчетахПИФ") > 0 Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		ПроверитьТранзитныеСчетаПИФ();
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

#КонецОбласти

#Область Выполнение_обработки

Процедура ПроверитьТранзитныеСчетаПИФ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	#Область Текст_запроса
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваПереданныеВОплатуПаевОстатки.Пайщик КАК Пайщик,
		|	ДенежныеСредстваПереданныеВОплатуПаевОстатки.РасчетныйСчет КАК РасчетныйСчет,
		|	ДенежныеСредстваПереданныеВОплатуПаевОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваПереданныеВОплатуПаевОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ОстаткиНаТранзитныхСчетах
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.Остатки(
		|			&КонецПериодаГраница,
		|			Организация = &Организация
		|				И РасчетныйСчет.ТранзитныйПИФ) КАК ДенежныеСредстваПереданныеВОплатуПаевОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор.Дата, ДЕНЬ) КАК Период,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
		|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор КАК Документ.ВводДенежныхСредств).Основание
		|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор) = ТИП(Документ.ПереводДенежныхСредств)
		|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор КАК Документ.ПереводДенежныхСредств).Основание
		|	КОНЕЦ КАК ЗаявкаПайщика,
		|	СУММА(ДенежныеСредстваПереданныеВОплатуПаевОбороты.СуммаПриход) КАК СуммаПриход,
		|	СУММА(ДенежныеСредстваПереданныеВОплатуПаевОбороты.СуммаОборот) КАК СуммаОборот,
		|	_ОстаткиНаТранзитныхСчетах.Пайщик КАК Пайщик
		|ПОМЕСТИТЬ _ОборотыПоЗаявкам
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.Обороты(&ПятьРабочихДнейНазад, &КонецПериода, Регистратор, Организация = &Организация) КАК ДенежныеСредстваПереданныеВОплатуПаевОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиНаТранзитныхСчетах КАК _ОстаткиНаТранзитныхСчетах
		|		ПО ДенежныеСредстваПереданныеВОплатуПаевОбороты.СчетДоверительногоУправления = _ОстаткиНаТранзитныхСчетах.СчетДоверительногоУправления
		|			И ДенежныеСредстваПереданныеВОплатуПаевОбороты.РасчетныйСчет = _ОстаткиНаТранзитныхСчетах.РасчетныйСчет
		|			И ДенежныеСредстваПереданныеВОплатуПаевОбороты.Пайщик = _ОстаткиНаТранзитныхСчетах.Пайщик
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор.Дата, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор) = ТИП(Документ.ВводДенежныхСредств)
		|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор КАК Документ.ВводДенежныхСредств).Основание
		|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор) = ТИП(Документ.ПереводДенежныхСредств)
		|			ТОГДА ВЫРАЗИТЬ(ДенежныеСредстваПереданныеВОплатуПаевОбороты.Регистратор КАК Документ.ПереводДенежныхСредств).Основание
		|	КОНЕЦ,
		|	_ОстаткиНаТранзитныхСчетах.Пайщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.МинимальнаяСуммаЗачисления, НЕОПРЕДЕЛЕНО) КАК МинимальнаяСуммаЗачисления,
		|	ЕСТЬNULL(УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.МинимальнаяСуммаЗачисленияЧерезАгента, НЕОПРЕДЕЛЕНО) КАК МинимальнаяСуммаЗачисленияЧерезАгента
		|ПОМЕСТИТЬ _УсловияПравилПИФ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ОстаткиНаТранзитныхСчетах.СчетДоверительногоУправления
		|					ИЗ
		|						_ОстаткиНаТранзитныхСчетах)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПаевойИнвестиционныйФонд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОборотыПоЗаявкам.Период КАК Период,
		|	_ОборотыПоЗаявкам.ЗаявкаПайщика КАК ЗаявкаПайщика,
		|	_ОборотыПоЗаявкам.Пайщик КАК Пайщик,
		|	СУММА(_ОборотыПоЗаявкам.СуммаПриход) КАК СуммаПриход,
		|	СУММА(_ОборотыПоЗаявкам.СуммаОборот) КАК СуммаОборот,
		|	ЛОЖЬ КАК ЕстьВОстатках
		|ПОМЕСТИТЬ _ДатыИСуммыВводовПоЗаявкам
		|ИЗ
		|	_ОборотыПоЗаявкам КАК _ОборотыПоЗаявкам
		|ГДЕ
		|	_ОборотыПоЗаявкам.СуммаПриход <> 0
		|	И _ОборотыПоЗаявкам.ЗаявкаПайщика В
		|			(ВЫБРАТЬ
		|				_ОборотыПоЗаявкам.ЗаявкаПайщика КАК ЗаявкаПайщика
		|			ИЗ
		|				_ОборотыПоЗаявкам КАК _ОборотыПоЗаявкам
		|			СГРУППИРОВАТЬ ПО
		|				_ОборотыПоЗаявкам.ЗаявкаПайщика
		|			ИМЕЮЩИЕ
		|				СУММА(_ОборотыПоЗаявкам.СуммаОборот) > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОборотыПоЗаявкам.Период,
		|	_ОборотыПоЗаявкам.ЗаявкаПайщика,
		|	_ОборотыПоЗаявкам.Пайщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыИСуммыВводовПоЗаявкам.ЗаявкаПайщика КАК ЗаявкаПайщика,
		|	СУММА(_ДатыИСуммыВводовПоЗаявкам.СуммаОборот) КАК Сумма,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(_ДатыИСуммыВводовПоЗаявкам.ЗаявкаПайщика КАК Документ.ЗаявкаПайщика).ИсточникЗаявки, ЗНАЧЕНИЕ(Перечисление.ИсточникиАнкетИЗаявок.ПустаяСсылка)) КАК ИсточникЗаявки
		|ПОМЕСТИТЬ _ОбщиеСуммыВводовПоЗаявкам
		|ИЗ
		|	_ДатыИСуммыВводовПоЗаявкам КАК _ДатыИСуммыВводовПоЗаявкам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыИСуммыВводовПоЗаявкам.ЗаявкаПайщика,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(_ДатыИСуммыВводовПоЗаявкам.ЗаявкаПайщика КАК Документ.ЗаявкаПайщика).ИсточникЗаявки, ЗНАЧЕНИЕ(Перечисление.ИсточникиАнкетИЗаявок.ПустаяСсылка))";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КонецПериодаГраница",	Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",			КонецДня(ЭтотОбъект.Дата));
	
	ПятьРабочихДнейНазад	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -6);
	ЧетыреРабочихДняназад	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -5);
	ТриРабочихДняНазад		= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Дата, -4);
	
	Запрос.УстановитьПараметр("ПятьРабочихДнейНазад",	ПятьРабочихДнейНазад);	
	
	Запрос.Выполнить();
	
	ОстаткиНаТранзитныхСчетах = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ОстаткиНаТранзитныхСчетах").ПолучитьДанные().Выгрузить();
	ДатыИСуммыВводовПоЗаявкам = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ДатыИСуммыВводовПоЗаявкам").ПолучитьДанные().Выгрузить();		
	ДатыИСуммыВводовПоЗаявкам.Сортировать("Период");
	
	КопияДатыИСуммыВводовПоЗаявкам = ДатыИСуммыВводовПоЗаявкам.Скопировать();
	
	ОбщиеСуммыВводовПоЗаявкам	= Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_ОбщиеСуммыВводовПоЗаявкам").ПолучитьДанные().Выгрузить();	
	УсловияПравилПИФ 			= Запрос.МенеджерВременныхТаблиц.Таблицы.Получить("_УсловияПравилПИФ").ПолучитьДанные().Выгрузить();
	
	РеквизитыОповещения = Новый Структура;	
	РеквизитыОповещения.Вставить("Организация",		ЭтотОбъект.Организация);
	РеквизитыОповещения.Вставить("Дата",			ЭтотОбъект.Дата);
	
	ИмяИсточника = "_ВнешняяОбработка.ОповещениеОДСНаТранзитныхСчетахПИФ.";
	
	// Описание
	// Проверяем остатки денежных средств, переданных в оплату паев, на выбранную дату (Т).
	// 1. Остатки, в которых нет пайщика - ошибочные платежи. Их необходимо вернуть плательщикам - оповещаем бэк и контролеров 
	// 2. По пайщикам, у которых есть остатки, проверяем обороты по этому регистру с Т-5 по Т:
	// 		- если средства по заявке пайщика висят с Т-5 дня, их необходимо вернуть - оповещаем бэк. 
	//		  К сообщению добавляем поступления по этой заявке, начиная с Т-5
	// 		- если средства по заявке пайщика висят с Т-4 дня и пайщик не достиг минимальной суммы зачисления - оповещаем бэк и клиентский отдел
	//		  К сообщению добавляем поступления по этой заявке, начиная с Т-4
	// 		- если средства по заявке пайщика висят с Т-3 дня, необходимо с ними разобраться (например, пайщик не достиг минимальной суммы зачисления) - оповещаем бэк и контролеров
	//		  К сообщению добавляем поступления по этой заявке, начиная с Т-3
	
	// В Т+3
	СообщенияБэкуИКонтролерам 		= Новый Массив;
	// В Т+4
	СообщенияБэкуИКлиентскомуОтделу = Новый Массив;
	// В Т+5
	СообщенияБэку 					= Новый Массив;
	
	//Сообщим о незаполненных правилах ПИФ отдельно
	НайдСтрокиСНезаполненнымиПравилами = УсловияПравилПИФ.НайтиСтроки(Новый Структура("МинимальнаяСуммаЗачисления", Неопределено));
	Для Каждого СтрокаСНезаполненнымиПравилами Из НайдСтрокиСНезаполненнымиПравилами Цикл
		СообщенияБэкуИКонтролерам.Добавить(СтрШаблон("Для '%1' не указаны условия правил паевого инвестиционного фонда", СтрокаСНезаполненнымиПравилами.СчетДоверительногоУправления));
	КонецЦикла;
		
	Для Каждого СтрокаОстатка Из ОстаткиНаТранзитныхСчетах Цикл 
		
		НайдСтрокиПравилПИФ = УсловияПравилПИФ.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", СтрокаОстатка.СчетДоверительногоУправления));
				
		//Неидентифицированный пайщик - сообщаем общую сумму пришедших 
		Если Не ЗначениеЗаполнено(СтрокаОстатка.Пайщик) Тогда			
			
			СообщенияБэкуИКонтролерам.Добавить(СтрШаблон("На транзитном счете %1 %2 остались ошибочно зачисленные денежные средства в размере %3 руб., их необходимо вернуть", 
								СтрокаОстатка.РасчетныйСчет, 
								СтрокаОстатка.СчетДоверительногоУправления, 								
								Формат(СтрокаОстатка.СуммаОстаток, "ЧДЦ=2; ЧРД=,")));
			Продолжить;
			
		КонецЕсли;
									
		НайдСтрокиПайщика = ДатыИСуммыВводовПоЗаявкам.НайтиСтроки(Новый Структура("Пайщик", СтрокаОстатка.Пайщик));								          		
		Если НайдСтрокиПайщика.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
				
		ДобавитьЗаголовокСообщенияБэку 						= Истина;
		ДобавитьЗаголовокСообщенияБэкуИКлиентскомуОтделу	= Истина;
		ДобавитьЗаголовокСообщенияБэкуИКонтролерам			= Истина;
		
		// Отсекаем суммы, которых нет в остатках
		ИндексСтрокиПайщика = НайдСтрокиПайщика.Количество() - 1;
		
		ТекСумма = 0;
		Пока ИндексСтрокиПайщика >= 0 Цикл
			
			СтрокаПайщика = НайдСтрокиПайщика.Получить(ИндексСтрокиПайщика);
			ТекСумма = ТекСумма + СтрокаПайщика.СуммаПриход;
			
			Если СтрокаОстатка.СуммаОстаток >= ТекСумма Тогда
				СтрокаПайщика.ЕстьВОстатках = Истина;
			КонецЕсли; 
			
			ИндексСтрокиПайщика = ИндексСтрокиПайщика - 1;
			
		КонецЦикла;
		
		Для Каждого СтрокаПайщика Из НайдСтрокиПайщика Цикл			
			
			Если СтрокаПайщика.ЕстьВОстатках Тогда
							
				НайдСтрокиЗаявки = ОбщиеСуммыВводовПоЗаявкам.НайтиСтроки(Новый Структура("ЗаявкаПайщика", СтрокаПайщика.ЗаявкаПайщика));
				СуммаМеньшеМинимальнойСуммыЗачисления = Ложь;
				ЧерезАгента = Ложь;
				Если НайдСтрокиЗаявки.Количество() > 0 Тогда
					ЧерезАгента = (НайдСтрокиЗаявки[0].ИсточникЗаявки = Перечисления.ИсточникиАнкетИЗаявок.Агент);
					Если ЧерезАгента Тогда
						МинимальнаяСуммаЗачисления = НайдСтрокиПравилПИФ[0].МинимальнаяСуммаЗачисленияЧерезАгента;
					Иначе
						МинимальнаяСуммаЗачисления = НайдСтрокиПравилПИФ[0].МинимальнаяСуммаЗачисления;
					КонецЕсли;
					СуммаМеньшеМинимальнойСуммыЗачисления = МинимальнаяСуммаЗачисления <> Неопределено
						И МинимальнаяСуммаЗачисления > НайдСтрокиЗаявки[0].Сумма;
				КонецЕсли;
					
				Если СтрокаПайщика.Период = ПятьРабочихДнейНазад Тогда
					ДобавитьСообщениеВМассив(СообщенияБэку, СтрокаПайщика, СтрокаОстатка, ДобавитьЗаголовокСообщенияБэку);
					ДобавитьСообщенияОПоступленияхЗаПериодВМассив(КопияДатыИСуммыВводовПоЗаявкам, СообщенияБэку, СтрокаПайщика);
				ИначеЕсли СтрокаПайщика.Период = ЧетыреРабочихДняназад И СуммаМеньшеМинимальнойСуммыЗачисления Тогда
					ДобавитьСообщениеВМассив(СообщенияБэкуИКлиентскомуОтделу, СтрокаПайщика, СтрокаОстатка, ДобавитьЗаголовокСообщенияБэкуИКлиентскомуОтделу);
					ДобавитьСообщенияОПоступленияхЗаПериодВМассив(КопияДатыИСуммыВводовПоЗаявкам, СообщенияБэкуИКлиентскомуОтделу, СтрокаПайщика);
				ИначеЕсли СтрокаПайщика.Период = ТриРабочихДняНазад Тогда				
					Причина = ?(СуммаМеньшеМинимальнойСуммыЗачисления, ?(ЧерезАгента, "сумма поступлений по заявке меньше минимальной суммы зачисления через агента", "сумма поступлений по заявке меньше минимальной суммы зачисления"), "отсутствует зачисление паев"); 				
					ДобавитьСообщениеВМассив(СообщенияБэкуИКонтролерам, СтрокаПайщика, СтрокаОстатка, ДобавитьЗаголовокСообщенияБэкуИКонтролерам, Причина);
					ДобавитьСообщенияОПоступленияхЗаПериодВМассив(КопияДатыИСуммыВводовПоЗаявкам, СообщенияБэкуИКонтролерам, СтрокаПайщика);
				КонецЕсли;			
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	//Формируем общее оповещение для каждого массива
	Если СообщенияБэку.Количество() > 0 Тогда
		РеквизитыОповещения.Вставить("Текст", СтрСоединить(СообщенияБэку, Символы.ПС) + "
					|Необходимо вернуть эти денежные средства");
		Справочники.Оповещения.СформироватьОповещения(ИмяИсточника + "БэкуЧерезПятьДней", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	КонецЕсли;	
	
	Если СообщенияБэкуИКлиентскомуОтделу.Количество() > 0 Тогда
		РеквизитыОповещения.Вставить("Текст", СтрСоединить(СообщенияБэкуИКлиентскомуОтделу, Символы.ПС) + "
					|Необходимо оповестить клиентов о недостаточной сумме для зачисления паев");
		Справочники.Оповещения.СформироватьОповещения(ИмяИсточника + "БэкуИКлиентскомуОтделуЧерезЧетыреДня", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	КонецЕсли;	
	
	Если СообщенияБэкуИКонтролерам.Количество() > 0 Тогда
		РеквизитыОповещения.Вставить("Текст", СтрСоединить(СообщенияБэкуИКонтролерам, Символы.ПС));
		Справочники.Оповещения.СформироватьОповещения(ИмяИсточника + "БэкуИКонтролерамЧерезТриДня", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

Процедура ДобавитьСообщениеВМассив(МассивСообщений, СтрокаДанных, СтрокаОстатка, ДобавитьЗаголовок, Причина = "")
	
	Если ДобавитьЗаголовок Тогда
		МассивСообщений.Добавить(СтрШаблон("На транзитном счете %1 %2 остались денежные средства пайщика %3 в размере %4 руб. Поступления за эти дни:", 
							СтрокаОстатка.РасчетныйСчет, 
							СтрокаОстатка.СчетДоверительногоУправления, 
							СтрокаОстатка.Пайщик,
							Формат(СтрокаОстатка.СуммаОстаток, "ЧДЦ=2; ЧРД=,")));
		ДобавитьЗаголовок = Ложь;							
	КонецЕсли;
	
	МассивСообщений.Добавить(СтрШаблон("	- %1 по заявке %2 на сумму %3 руб. %4", 
	                            Формат(СтрокаДанных.Период, "ДФ=dd.MM.yyyy"), 
								СтрокаДанных.ЗаявкаПайщика, 
								Формат(СтрокаДанных.СуммаПриход, "ЧДЦ=2; ЧРД=,"),
								?(Причина = "", "", "(" + Причина + ")")));	
	
КонецПроцедуры
								
Процедура ДобавитьСообщенияОПоступленияхЗаПериодВМассив(ВводыДенежныхСредств, МассивСообщений, СтрокаДанных)
	
	НайдСтрокиПоЗаявке = ВводыДенежныхСредств.НайтиСтроки(Новый Структура("ЗаявкаПайщика", СтрокаДанных.ЗаявкаПайщика));
	Для Каждого СтрокаПоЗаявке Из НайдСтрокиПоЗаявке Цикл
	    Если СтрокаПоЗаявке.Период > СтрокаДанных.Период Тогда
			ДобавитьСообщениеВМассив(МассивСообщений, СтрокаПоЗаявке, СтрокаДанных, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(ЭтотОбъект, ИмяКоманды);
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
КонецПроцедуры

#КонецОбласти