
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОтчетОСверке = ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц();
	
	Если ОтчетОСверке = Неопределено Тогда
		ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Возврат;	
	КонецЕсли;
	ОтчетОСверке.Показать("Результат сверки со списком дисквалифицированных лиц");	
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЖурналСверкиСоСписками"));
КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц()
	ОтчетОСверке = Новый ТабличныйДокумент;
	
	Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");

	РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомДисквалифицированныхЛиц(Организация,, ТекущаяДата(),, ОтчетОСверке);

	Возврат ОтчетОСверке;
КонецФункции