
Функция КонтрольныеСимволыИНН(ИНН) Экспорт
	
	Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
		ВызватьИсключение "ИНН содержит недопустимые символы: " + ИНН;	
	КонецЕсли;
	
	ДлинаИНН = СтрДлина(ИНН);
	
	Если ДлинаИНН = 10 Тогда
		
		КонтрольнаяСумма = 0;
		СтрокиМножителей = СтрРазделить("2 4 10 3 5 9 4 6 8", " ", Ложь);
		
		Для Сч = 0 по СтрокиМножителей.ВГраница() Цикл
			КонтрольнаяСумма = КонтрольнаяСумма + Число(СтрокиМножителей[Сч]) * Число(Сред(ИНН, Сч + 1, 1));	
		КонецЦикла;
		
		КонтрольныеСимволы = Формат(КонтрольнаяСумма % 11 % 10);
		
	ИначеЕсли ДлинаИНН = 12 Тогда
		
		КонтрольнаяСумма1 = 0;
		СтрокиМножителей  = СтрРазделить("3 7 2 4 10 3 5 9 4 6 8", " ", Ложь);
		
		Для Сч = 0 по СтрокиМножителей.ВГраница() Цикл
			КонтрольнаяСумма1 = КонтрольнаяСумма1 + Число(СтрокиМножителей[Сч]) * Число(Сред(ИНН, Сч + 1, 1));	
		КонецЦикла;
		
		КонтрольнаяСумма2 = 0;
		СтрокиМножителей  = СтрРазделить("7 2 4 10 3 5 9 4 6 8", " ", Ложь);
		
		Для Сч = 0 по СтрокиМножителей.ВГраница() Цикл
			КонтрольнаяСумма2 = КонтрольнаяСумма2 + Число(СтрокиМножителей[Сч]) * Число(Сред(ИНН, Сч + 1, 1));	
		КонецЦикла;

		КонтрольныеСимволы = Формат(КонтрольнаяСумма2 % 11 % 10, "ЧН=0") + Формат(КонтрольнаяСумма1 % 11 % 10, "ЧН=0");
		
	Иначе
		ВызватьИсключение "Неверная длина ИНН: " + ИНН;
	КонецЕсли;
	
	Возврат КонтрольныеСимволы;
	
КонецФункции

Функция КонтрольныеСимволыСНИЛС(СНИЛС) Экспорт
	
	Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(СтрЗаменить(СНИЛС, " ",""), "-","")) Тогда
		ВызватьИсключение "СНИЛС содержит недопустимые символы: " + СНИЛС;	
	КонецЕсли;
	
	ДлинаСНИЛС = СтрДлина(СНИЛС);
	
	Если ДлинаСНИЛС = 14 Тогда
		
		МассивПодстрок = СтрРазделить(СНИЛС, "- ", Истина);
		
		Если МассивПодстрок.Количество() <> 4 Тогда
			ВызватьИсключение "Неправильный формат СНИЛС: " + СНИЛС;	
		КонецЕсли;
		
		Если Лев(СНИЛС, 11) <= "001-001-998" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		КонтрольнаяСумма = 0;
		Множитель = 9;
		Для Сч = 0 по 2 Цикл
			
			Для СчСимвола = 1 по 3 Цикл
				КонтрольнаяСумма = КонтрольнаяСумма + Множитель * Число(Сред(МассивПодстрок[Сч], СчСимвола, 1));
				Множитель = Множитель - 1;
			КонецЦикла;
			
		КонецЦикла;
		
		Если КонтрольнаяСумма = 100 или КонтрольнаяСумма = 101 Тогда
			КонтрольныеСимволы = "00";	
		Иначе
			КонтрольныеСимволы = Формат(КонтрольнаяСумма % 101, "ЧЦ=2; ЧН=00; ЧВН=");
		КонецЕсли;
				
	Иначе
		ВызватьИсключение "Неверная длина СНИЛС: " + СНИЛС;
	КонецЕсли;
	
	Возврат КонтрольныеСимволы;
	
КонецФункции

Функция КонтрольныеСимволыОГРНИП(ОГРНИП) Экспорт
	
	Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ОГРНИП) Тогда
		ВызватьИсключение "ОГРНИП содержит недопустимые символы: " + ОГРНИП;	
	КонецЕсли;
	
	ДлинаОГРНИП = СтрДлина(ОГРНИП);
	
	Если ДлинаОГРНИП = 15 Тогда
		
		КонтрольнаяСумма   = Число(Лев(ОГРНИП,14)) % 13 % 10;	
		КонтрольныеСимволы = Формат(КонтрольнаяСумма, "ЧН=0");

	Иначе
		ВызватьИсключение "Неверная длина ОГРНИП: " + ОГРНИП;
	КонецЕсли;
	
	Возврат КонтрольныеСимволы;

КонецФункции

Функция КонтрольныеСимволыОГРН(ОГРН) Экспорт
	
	Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ОГРН) Тогда
		ВызватьИсключение "ОГРН содержит недопустимые символы: " + ОГРН;	
	КонецЕсли;
	
	ДлинаОГРН = СтрДлина(ОГРН);
	
	Если ДлинаОГРН = 13 Тогда
		
		КонтрольнаяСумма   = Число(Лев(ОГРН,12)) % 11 % 10;	
		КонтрольныеСимволы = Формат(КонтрольнаяСумма, "ЧН=0");

	Иначе
		ВызватьИсключение "Неверная длина ОГРН: " + ОГРН;
	КонецЕсли;
	
	Возврат КонтрольныеСимволы;

КонецФункции

Функция ПроверитьИНН(ИНН) Экспорт
	
	ТекстСообщения = "";
	
	ДлинаИНН = СтрДлина(СокрЛП(ИНН));
	
	Если ДлинаИНН = 0 Тогда
		// Пустое ИНН считаем корректным
	ИначеЕсли ДлинаИНН = 12 Тогда
		ТекстСообщения = ПроверитьИННФизЛица(ИНН);	
	ИначеЕсли ДлинаИНН = 10 Тогда
		ТекстСообщения = ПроверитьИННЮрЛица(ИНН);
	Иначе
		ТекстСообщения = "ИНН состоит из 10 или 12 цифр";
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПроверитьИННФизЛица(ИНН) Экспорт
	
	ТекстСообщения = "";
	
	ДлинаИНН = СтрДлина(СокрЛП(ИНН));
	
	Если ДлинаИНН = 0 Тогда
		// Пустое ИНН считаем корректным
	ИначеЕсли ДлинаИНН <> 12 Тогда
		ТекстСообщения = "ИНН физического лица состоит из 12 цифр";	
	Иначе
		
		Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
			ТекстСообщения = "ИНН физического лица состоит только из цифр";
		Иначе
			
			Попытка
				
				КонтрольныеСимволы = КонтрольныеСимволыИНН(ИНН);
				Если КонтрольныеСимволы <> Прав(ИНН, 2) Тогда
					ТекстСообщения = "ИНН указан с ошибками. Проверьте правильность ввода";	
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = ИнформацияОбОшибке().Описание;
				
			КонецПопытки;				

		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПроверитьИННЮрЛица(ИНН) Экспорт
	
	ТекстСообщения = "";
	
	ДлинаИНН = СтрДлина(СокрЛП(ИНН));
	
	Если ДлинаИНН = 0 Тогда
		// Пустое ИНН считаем корректным
	ИначеЕсли ДлинаИНН <> 10 Тогда
		ТекстСообщения = "ИНН юридического лица состоит из 10 цифр";	
	Иначе
		
		Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
			ТекстСообщения = "ИНН юридического лица состоит только из цифр";
		Иначе
			
			Попытка
				
				КонтрольныеСимволы = КонтрольныеСимволыИНН(ИНН);
				Если КонтрольныеСимволы <> Прав(ИНН, СтрДлина(КонтрольныеСимволы)) Тогда
					ТекстСообщения = "ИНН указан с ошибками. Проверьте правильность ввода";	
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = ИнформацияОбОшибке().Описание;
				
			КонецПопытки;				

		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПроверитьСНИЛС(СНИЛС) Экспорт
	
	ТекстСообщения = "";
	
	СНИЛСПроверки = СокрЛП(СтрЗаменить(СтрЗаменить(СНИЛС, " ",""), "-",""));
	
	ДлинаСНИЛС = СтрДлина(СНИЛСПроверки);
	
	Если ДлинаСНИЛС = 0 Тогда
		// Пустой СНИЛС считаем корректным
	ИначеЕсли ДлинаСНИЛС <> 11 Тогда
		ТекстСообщения = "СНИЛС состоит из 11 цифр";	
	Иначе
		
		Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(СНИЛСПроверки) Тогда
			ТекстСообщения = "СНИЛС состоит только из цифр";
		Иначе
			
			Попытка
				
				КонтрольныеСимволы = КонтрольныеСимволыСНИЛС(СНИЛС);
				Если КонтрольныеСимволы <> Прав(СНИЛС, 2) Тогда
					ТекстСообщения = "СНИЛС указан с ошибками. Проверьте правильность ввода";	
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = ИнформацияОбОшибке().Описание;
				
			КонецПопытки;				
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПроверитьОГРНИП(ОГРНИП) Экспорт
	
	ТекстСообщения = "";
	
	ДлинаОГРНИП = СтрДлина(ОГРНИП);
	
	Если ДлинаОГРНИП = 0 Тогда
		// Пустой ОГРНИП считаем корректным
	ИначеЕсли ДлинаОГРНИП <> 15 Тогда
		ТекстСообщения = "ОГРНИП состоит из 15 цифр";	
	Иначе
		
		Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ОГРНИП) Тогда
			ТекстСообщения = "ОГРНИП состоит только из цифр";
		Иначе
			
			Попытка
				
				КонтрольныеСимволы = КонтрольныеСимволыОГРНИП(ОГРНИП);
				Если КонтрольныеСимволы <> Прав(ОГРНИП, 1) Тогда
					ТекстСообщения = "ОГРНИП указан с ошибками. Проверьте правильность ввода";	
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = ИнформацияОбОшибке().Описание;
				
			КонецПопытки;				
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПроверитьОГРН(ОГРН) Экспорт
	
	ТекстСообщения = "";
	
	ДлинаОГРН = СтрДлина(ОГРН);
	
	Если ДлинаОГРН = 0 Тогда
		// Пустой ОГРН считаем корректным
	ИначеЕсли ДлинаОГРН <> 13 Тогда
		ТекстСообщения = "ОГРН состоит из 13 цифр";	
	Иначе
		
		Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(ОГРН) Тогда
			ТекстСообщения = "ОГРН состоит только из цифр";
		Иначе
			
			Попытка
				
				КонтрольныеСимволы = КонтрольныеСимволыОГРН(ОГРН);
				Если КонтрольныеСимволы <> Прав(ОГРН, 1) Тогда
					ТекстСообщения = "ОГРН указан с ошибками. Проверьте правильность ввода";	
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = ИнформацияОбОшибке().Описание;
				
			КонецПопытки;				

		КонецЕсли;
				
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции
