
Процедура СформироватьСводныеДвиженияПоСделке(Сделка, ВидыЗадолженности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		КОГДА Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Сделка.Дата КАК Период,
		|	Сделка.Организация КАК Организация,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделка.Брокер КАК Брокер,
		|	Сделка.МестоХранения КАК МестоХранения,
		|	Сделка.РасчетныйСчет КАК РасчетныйСчет,
		|	Сделка.ВалютаСделки КАК Валюта,
		|	СуммыОплаты.Сумма КАК Сумма,
		|	СуммыОплаты.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
		|	&ВидыЗадолженности КАК ВариантДвиженияДенежныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата) КАК ВидДвиженияДенежныхСредств,
		|		СделкаЦенныеБумаги.Ссылка КАК Ссылка,
		|		СУММА(СделкаЦенныеБумаги.Сумма) КАК Сумма
		|	ИЗ
		|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|	ГДЕ
		|		СделкаЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СделкаЦенныеБумаги.Ссылка
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СделкаЦенныеБумаги.Сумма) > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаКупона),
		|		СделкаЦенныеБумаги.Ссылка,
		|		СУММА(СделкаЦенныеБумаги.СуммаКупона)
		|	ИЗ
		|		Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|	ГДЕ
		|		СделкаЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СделкаЦенныеБумаги.Ссылка
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(СделкаЦенныеБумаги.СуммаКупона) > 0) КАК СуммыОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (Сделка.Ссылка = СуммыОплаты.Ссылка)";
		
	Запрос.УстановитьПараметр("Ссылка",            Сделка.Ссылка);
	Запрос.УстановитьПараметр("ВидыЗадолженности", ВидыЗадолженности);

	ИмяДокумента = Сделка.Метаданные().Имя;
	
	Если ИмяДокумента <> "Сделка" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделка", ИмяДокумента);
	КонецЕсли;	

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Сделка.Движения.ОстаткиДенежныхСредств.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьСводныеДвиженияПоСделке
