
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении
		И Не (ДополнительныеСвойства.Свойство("ЗаписьВСоставеРегистрацииСтоимостиАктивов") Или ДополнительныеСвойства.Свойство("НумерацияДокументов"))
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение документа доступно только из регистрации стоимости активов", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки Тогда
		
		#Область Проверка_отсутствия_нулевых_цен_и_ошибок_расчета
		
		СтрокиДляПроверки = Новый Массив;
		
		РаботаСКоллекциями.ДополнитьМассив(СтрокиДляПроверки, ЭтотОбъект.СтоимостиПереоценки.НайтиСтроки(Новый Структура("Цена", 0)));
		РаботаСКоллекциями.ДополнитьМассив(СтрокиДляПроверки, ЭтотОбъект.СтоимостиПрочихЦенныхБумаг.НайтиСтроки(Новый Структура("Цена", 0)));
		
		РаботаСКоллекциями.ДополнитьМассив(СтрокиДляПроверки, ЭтотОбъект.СтоимостиПереоценки.НайтиСтроки(Новый Структура("ВидЦены", Перечисления.ИсточникиЦеныДляПереоценки.ОшибкаРасчета)), Истина);
		РаботаСКоллекциями.ДополнитьМассив(СтрокиДляПроверки, ЭтотОбъект.СтоимостиПрочихЦенныхБумаг.НайтиСтроки(Новый Структура("ВидЦены", Перечисления.ИсточникиЦеныДляПереоценки.ОшибкаРасчета)), Истина);
		
		Для Каждого ПроверяемаяСтрока Из СтрокиДляПроверки Цикл
			
			Если ПроверяемаяСтрока.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.ОшибкаРасчета
				ИЛИ Не Документы.РегистрацияСтоимостиПереоценки.ДопустимаНулеваяЦена(ПроверяемаяСтрока)
			Тогда
				
				ТекстОшибки			= "Не определена цена по бумаге " + ПроверяемаяСтрока.ЦеннаяБумага + ", строка " + ПроверяемаяСтрока.НомерСтроки;
				ТабличнаяЧастьЦены	= ?(ТипЗнч(ПроверяемаяСтрока) = Тип("ДокументТабличнаяЧастьСтрока.РегистрацияСтоимостиПереоценки.СтоимостиПереоценки"), "СтоимостиПереоценки", "СтоимостиПрочихЦенныхБумаг"); 
				ПолеОшибки			= ТабличнаяЧастьЦены + "[" + (ПроверяемаяСтрока.НомерСтроки - 1) + "].Цена";
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПолеОшибки, , Отказ);
				
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ОшибкаОпределенияЦены", Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВедетсяУчетПоТекущемуВиду = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВидУчета);
		
	МетодОценкиСтоимости = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, "МетодОценкиСтоимости");	
		
	// Вдруг это переоценка датой ввода остатков?
	
	Если Не ВедетсяУчетПоТекущемуВиду Тогда
		
		ВедетсяУчетПоТекущемуВиду = РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(
			ЭтотОбъект.Дата + 24 * 60 * 60,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			ЭтотОбъект.ВидУчета);
			
		МетодОценкиСтоимости = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
			ЭтотОбъект.Дата + 24 * 60 * 60, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, "МетодОценкиСтоимости");	
			
	КонецЕсли;
	
	Если Не ВедетсяУчетПоТекущемуВиду Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("На %1 у %2 не ведется %3", Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"), ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета),
			ЭтотОбъект, "ВидУчета", , Отказ);
		Возврат;
	КонецЕсли;
	
	НастройкиОценки		 = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ЦельРасчета, Истина);
	ВестиРасчетПоПартиям = НастройкиОценки.ВестиРасчетПоПартиям;		
	
	Если ВестиРасчетПоПартиям = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не настроена цель расчета %1 на %2 у %3", ЭтотОбъект.ЦельРасчета, Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"), ЭтотОбъект.СчетДоверительногоУправления), ЭтотОбъект, "ВидУчета");
		ВестиРасчетПоПартиям = Ложь;		
	КонецЕсли;
	
	Если ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки Тогда
		
		Если ВестиРасчетПоПартиям Тогда
			
			Для Каждого СтрокаДок из ЭтотОбъект.СтоимостиПереоценки Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаДок.Партия) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						"Не указана партия в строке " + СтрокаДок.НомерСтроки, ЭтотОбъект, "СтоимостиПереоценки[" + (СтрокаДок.НомерСтроки - 1) + "].Партия", , Отказ);
				ИначеЕсли СтрокаДок.СтрокаПартии = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						"Не указана строка партии в строке " + СтрокаДок.НомерСтроки, ЭтотОбъект, "СтоимостиПереоценки[" + (СтрокаДок.НомерСтроки - 1) + "].СтрокаПартии", , Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе // балансовое цены недопустимы
		
		Для Каждого СтрокаДок из ЭтотОбъект.СтоимостиПереоценки Цикл
			Если СтрокаДок.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.БалансоваяЦена Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"Цена не может быть балансовой. Балансовая цена будет определена в переоценке", ЭтотОбъект, "СтоимостиПереоценки[" + (СтрокаДок.НомерСтроки - 1) + "].ВидЦены",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Если ведется учет по партиям, то нужно проверить, что зафиксированное в переоценке количество соответствует остаткам на партиях.
	// Оценка объектов в управлении всегда проводится раньше расчета партий, поэтому возникает необходимость в их динамическом расчете,
	// результаты которого могут и не соответствовать текущим остаткам, следовательно для нее проверку не выполняем
	
	ПроверитьКоличествоНаСоответствиеПартиям =
		ВестиРасчетПоПартиям
		И Не ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки
		И МетодОценкиСтоимости <> Перечисления.МетодыОценкиСтоимости.ПоСреднему;

	Если ПроверитьКоличествоНаСоответствиеПартиям Тогда
		
		#Область Проверка_количества_на_соответствие_партиям
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Рынок КАК Рынок,
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Партия КАК Партия,
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Количество КАК Количество
			|ПОМЕСТИТЬ _ПереоценкаЦенныхБумагЦенныеБумаги
			|ИЗ
			|	Документ.РегистрацияСтоимостиПереоценки.СтоимостиПереоценки КАК РегистрацияСтоимостиПереоценкиСтоимостиПереоценки
			|ГДЕ
			|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Ссылка = &Ссылка
			|	И РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Партия <> НЕОПРЕДЕЛЕНО
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
			|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
			|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ПОМЕСТИТЬ _ОстаткиПартий
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидУчета = &ВидУчета
			|				И Партия В
			|					(ВЫБРАТЬ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги.Партия КАК Партия
			|					ИЗ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги КАК _ПереоценкаЦенныхБумагЦенныеБумаги)) КАК БухПартииЦенныхБумагОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
			|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок,
			|	БухПартииЦенныхБумагКПолучениюОстатки.Партия,
			|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии,
			|	БухПартииЦенныхБумагКПолучениюОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидУчета = &ВидУчета
			|				И Партия В
			|					(ВЫБРАТЬ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги.Партия КАК Партия
			|					ИЗ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги КАК _ПереоценкаЦенныхБумагЦенныеБумаги)) КАК БухПартииЦенныхБумагКПолучениюОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага,
			|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Рынок,
			|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия,
			|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтрокаПартии,
			|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидУчета = &ВидУчета
			|				И Партия В
			|					(ВЫБРАТЬ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги.Партия КАК Партия
			|					ИЗ
			|						_ПереоценкаЦенныхБумагЦенныеБумаги КАК _ПереоценкаЦенныхБумагЦенныеБумаги)) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(_ОстаткиПартий.ЦеннаяБумага, _ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(_ОстаткиПартий.Рынок, _ПереоценкаЦенныхБумагЦенныеБумаги.Рынок) КАК Рынок,
			|	ЕСТЬNULL(_ОстаткиПартий.Партия, _ПереоценкаЦенныхБумагЦенныеБумаги.Партия) КАК Партия,
			|	ЕСТЬNULL(_ОстаткиПартий.СтрокаПартии, _ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии) КАК СтрокаПартии,
			|	ЕСТЬNULL(_ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
			|	ЕСТЬNULL(_ПереоценкаЦенныхБумагЦенныеБумаги.Количество, 0) КАК Количество
			|ИЗ
			|	_ПереоценкаЦенныхБумагЦенныеБумаги КАК _ПереоценкаЦенныхБумагЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
			|		ПО (_ОстаткиПартий.Рынок = _ПереоценкаЦенныхБумагЦенныеБумаги.Рынок)
			|			И (_ОстаткиПартий.ЦеннаяБумага = _ПереоценкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага)
			|			И (_ОстаткиПартий.Партия = _ПереоценкаЦенныхБумагЦенныеБумаги.Партия)
			|			И (_ОстаткиПартий.СтрокаПартии = _ПереоценкаЦенныхБумагЦенныеБумаги.СтрокаПартии)
			|ГДЕ
			|	_ПереоценкаЦенныхБумагЦенныеБумаги.Партия <> НЕОПРЕДЕЛЕНО
			|	И _ОстаткиПартий.Партия ЕСТЬ NULL";
			
		Запрос.УстановитьПараметр("Период",                       Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ВидУчета",                     ЭтотОбъект.ВидУчета);
		Запрос.УстановитьПараметр("Ссылка",                       ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены партии, отсутствующие на остатках:", ЭтотОбъект.Ссылка,,, Отказ);
			
			Пока Выборка.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Символы.Таб + Выборка.ЦеннаяБумага + " / " + Выборка.Партия + " / " + Выборка.СтрокаПартии, ЭтотОбъект.Ссылка,,, Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;		
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОчиститьДвижения") Тогда
		ЭтотОбъект.Движения.СтоимостьПереоценки.Очистить(); 
		ЭтотОбъект.Движения.СтоимостьПереоценки.Записать();
	КонецЕсли; 
	
	Движения.СтоимостьПереоценки.Записывать = Истина;
	
	Для Каждого ТекСтрокаСтоимостиПереоценки Из ЭтотОбъект.СтоимостиПереоценки Цикл
		Движение = ЭтотОбъект.Движения.СтоимостьПереоценки.Добавить();
		Движение.Период 						= ЭтотОбъект.Дата;
		Движение.Организация 					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.ЦеннаяБумага 					= ТекСтрокаСтоимостиПереоценки.ЦеннаяБумага;
		Движение.Партия		 					= ТекСтрокаСтоимостиПереоценки.Партия;
		Движение.СтрокаПартии 					= ТекСтрокаСтоимостиПереоценки.СтрокаПартии;
		Движение.ВидУчета 						= ЭтотОбъект.ВидУчета;
		Движение.ЦельРасчета					= ЭтотОбъект.ЦельРасчета;
		Движение.ВидЦеныОценки					= Перечисления.ВидыЦенОценки.ЦенаОценки;
		Движение.Рынок 							= ТекСтрокаСтоимостиПереоценки.Рынок;
		Движение.Цена 							= ТекСтрокаСтоимостиПереоценки.Цена;
		Движение.ЦенаКотировки					= ТекСтрокаСтоимостиПереоценки.ЦенаКотировки;
		Движение.Количество						= ТекСтрокаСтоимостиПереоценки.Количество;
		Движение.Сумма							= ТекСтрокаСтоимостиПереоценки.Сумма;
		Движение.ЦенаКупона		 				= ТекСтрокаСтоимостиПереоценки.ЦенаКупона;
		Движение.ЦенаКотировкиКупона			= ТекСтрокаСтоимостиПереоценки.ЦенаКотировкиКупона;
		Движение.ВидЦены 						= ТекСтрокаСтоимостиПереоценки.ВидЦены;
		Движение.УровеньОценки 					= ТекСтрокаСтоимостиПереоценки.УровеньОценки;
		Движение.ДатаЦены 						= ТекСтрокаСтоимостиПереоценки.ДатаЦены;
		Движение.ДатаЦеныКупона					= ТекСтрокаСтоимостиПереоценки.ДатаЦеныКупона;
		Движение.Источник 						= ТекСтрокаСтоимостиПереоценки.Источник;
		Движение.РучнойВвод 					= ТекСтрокаСтоимостиПереоценки.РучнойВвод;
		Движение.ВалютаКотировкиКупона			= ТекСтрокаСтоимостиПереоценки.ВалютаКотировкиКупона;
		Движение.ВалютаКотировки				= ТекСтрокаСтоимостиПереоценки.ВалютаКотировки;
		Движение.СуммаВВалютеУчета 				= ТекСтрокаСтоимостиПереоценки.СуммаВВалютеУчета;
		Движение.СуммаКупонаВВалютеУчета		= ТекСтрокаСтоимостиПереоценки.СуммаКупонаВВалютеУчета;
		Движение.СуммаКупона					= ТекСтрокаСтоимостиПереоценки.СуммаКупона;
		Движение.Примечание						= ТекСтрокаСтоимостиПереоценки.Примечание;
		Движение.КурсВалютыНоминала				= ТекСтрокаСтоимостиПереоценки.КурсВалютыНоминала;
	КонецЦикла;
	
	Если ЭтотОбъект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Тогда
	
		Для Каждого ТекСтрокаСтоимостиПрочихЦенныхБумаг Из ЭтотОбъект.СтоимостиПрочихЦенныхБумаг Цикл
			Движение = ЭтотОбъект.Движения.СтоимостьПереоценки.Добавить();
			Движение.Период 						= ЭтотОбъект.Дата;
			Движение.Организация 					= ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ЦеннаяБумага 					= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ЦеннаяБумага;
			Движение.Партия		 					= ТекСтрокаСтоимостиПрочихЦенныхБумаг.Партия;
			Движение.СтрокаПартии 					= ТекСтрокаСтоимостиПрочихЦенныхБумаг.СтрокаПартии;
			Движение.ВидУчета 						= ЭтотОбъект.ВидУчета;
			Движение.ЦельРасчета					= Справочники.ЦелиРасчета.КонтрольИнвестиционнойДекларации;
			Движение.ВидЦеныОценки					= Перечисления.ВидыЦенОценки.ЦенаОценки;
			Движение.Рынок 							= ТекСтрокаСтоимостиПрочихЦенныхБумаг.Рынок;
			Движение.Цена 							= ТекСтрокаСтоимостиПрочихЦенныхБумаг.Цена;
			Движение.ЦенаКотировки					= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ЦенаКотировки;
			Движение.ЦенаКупона		 				= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ЦенаКупона;
			Движение.ЦенаКотировкиКупона			= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ЦенаКотировкиКупона;
			Движение.ВидЦены 						= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ВидЦены;
			Движение.УровеньОценки 					= ТекСтрокаСтоимостиПрочихЦенныхБумаг.УровеньОценки;
			Движение.ДатаЦены 						= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ДатаЦены;
			Движение.Источник 						= ТекСтрокаСтоимостиПрочихЦенныхБумаг.Источник;
			Движение.ВалютаКотировкиКупона			= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ВалютаКотировкиКупона;
			Движение.ВалютаКотировки				= ТекСтрокаСтоимостиПрочихЦенныхБумаг.ВалютаКотировки;
			Движение.Примечание						= ТекСтрокаСтоимостиПрочихЦенныхБумаг.Примечание;
			Движение.КурсВалютыНоминала				= ТекСтрокаСтоимостиПрочихЦенныхБумаг.КурсВалютыНоминала;
		КонецЦикла;		
	
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьСтоимостьПереоценки(ЗаменитьТекущиеСтоимости, ПредупредитьОРазличиях, Отказ, ТаблицаСтоимостей = Неопределено, ПровестиДокумент = Ложь, РасшифровкаРасчета = Неопределено, ТаблицаЦенныхБумаг = Неопределено, ОценкаПрочихЦенныхБумаг = Ложь, РасчетПартий = Неопределено) Экспорт

	// Определяем настройки оценки	
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ЦельРасчета, Истина);
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + ЭтотОбъект.ЦельРасчета + "' для клиента " + ЭтотОбъект.СчетДоверительногоУправления,ЭтотОбъект.Ссылка,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ВариантРасчетаСправедливойСтоимости	  = НастройкиОценки.ВариантРасчетаОценочнойСтоимости;
	ВыполнятьРасчетПоУказаниюЦБ			  = (НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 И Не ОценкаПрочихЦенныхБумаг) ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316; // прочие ц/б (не из портфеля) оцениваем как обычно
	ВестиРасчетПоПартиям				  = НастройкиОценки.ВестиРасчетПоПартиям ИЛИ ВыполнятьРасчетПоУказаниюЦБ;
	ПараметрыПолученияПартий			  = РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(ЦельРасчета, ВидУчета, ВариантРасчетаСправедливойСтоимости, Дата, РасшифровкаРасчета, ЭтотОбъект.СчетДоверительногоУправления);	
	ОчиститьКупоныСуммыИКоличество		  = Не ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки ИЛИ ОценкаПрочихЦенныхБумаг; // Если нужна только цена бумаги, то купоны, суммы и количество очищаем	
											
	Если ДополнительныеСвойства.Свойство("ОчиститьКупоныСуммыИКоличество") Тогда
		ОчиститьКупоныСуммыИКоличество = ДополнительныеСвойства.ОчиститьКупоныСуммыИКоличество;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ВыполнятьРасчетПоУказаниюЦБ") Тогда  // легальная возможность отключить подмену цен
		ВыполнятьРасчетПоУказаниюЦБ = ДополнительныеСвойства.ВыполнятьРасчетПоУказаниюЦБ;
	КонецЕсли;
	
	ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета = РаботаСПереоценкой.ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета(
		ВариантРасчетаСправедливойСтоимости, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата); 
	
	#Область Чтение_таблицы_стоимостей_из_файла
	
	// Таблица стоимостей может быть передана в файле 
	
	Если ЗначениеЗаполнено(ТаблицаСтоимостей) И ТипЗнч(ТаблицаСтоимостей) = Тип("Строка") Тогда
		
		ТаблицаСтоимостей = ПолучитьТаблицуСтоимостейИзФайла(ТаблицаСтоимостей);
		
		Если ТаблицаСтоимостей = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ТаблицаСтоимостейИзФайла", ТаблицаСтоимостей);
		
	КонецЕсли;	
	
	// Если оценка "заморожена", то актуальные цены от клиента не нужны 
	
	Если ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом Тогда		
	
		Если Не ЗначениеЗаполнено(ТаблицаСтоимостей) Тогда
			
			Если ВыполнятьРасчетПоУказаниюЦБ Тогда
				ТаблицаСтоимостей = ПустаяТаблицаСтоимостей();	
			Иначе
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;

	#КонецОбласти
	
	// Новая схема расчета - это оценка ц/б по остаткам, а старая - по партиям
	
	ИспользованаМетодикаРасчетаПоНовойСхеме =
		Не ВестиРасчетПоПартиям
		И Не ВыполнятьРасчетПоУказаниюЦБ
		И Справочники.ВариантыРасчетаОценочнойСтоимости.ИспользованаМетодикаРасчетаПоНовойСхеме(ЦельРасчета, ВариантРасчетаСправедливойСтоимости)
		И НЕ (БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ЕстьВозможностьУчитыватьЦенныеБумагиПоАмортизированнойСтоимости")
			И ЕстьАктивыПоАС());
	
	Если ИспользованаМетодикаРасчетаПоНовойСхеме Тогда
		
		#Область Расчет_по_остаткам
		
		ПараметрыПолученияОстатков = Неопределено;
		
		Если ОценкаПрочихЦенныхБумаг Или РасшифровкаРасчета <> Неопределено Тогда
		
			ТипыЗадолженностейПоЦеннымБумагам = Новый Массив;
			ТипыЗадолженностейПоЦеннымБумагам.Добавить(Перечисления.ТипыЗадолженности.Дебиторская);
			ТипыЗадолженностейПоЦеннымБумагам.Добавить(Перечисления.ТипыЗадолженности.Кредиторская);
			
			ПараметрыПолученияОстатков = Новый Структура;
			ПараметрыПолученияОстатков.Вставить("ОстаткиЦенныхБумаг",					Истина);
			ПараметрыПолученияОстатков.Вставить("ТипыЗадолженностейПоЦеннымБумагам",	ТипыЗадолженностейПоЦеннымБумагам);
			ПараметрыПолученияОстатков.Вставить("ЗадолженностиПоВторойЧастиРЕПО",		Истина);
			ПараметрыПолученияОстатков.Вставить("НеУчитыватьЦБКупленныеПоРЕПО",			Ложь);
		    ПараметрыПолученияОстатков.Вставить("УчитыватьЦБПроданныеВРЕПО",			Истина);
		КонецЕсли; 
		
		ТаблицаСтоимостейЦБ = Справочники.ВариантыРасчетаОценочнойСтоимости.ПолучитьСтоимостиЦенныхБумаг(ВариантРасчетаСправедливойСтоимости, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, НачалоДня(ЭтотОбъект.Дата), Отказ, ПараметрыПолученияОстатков, ПараметрыПолученияПартий, , , РасшифровкаРасчета, ТаблицаЦенныхБумаг, , ЭтотОбъект.ДополнительныеСвойства);
		
		Если ТаблицаСтоимостейЦБ = Неопределено Тогда
		    Возврат;		
		КонецЕсли;
		
		ТаблицаСтоимостейЦБ.Колонки.Добавить("ДатаЦеныКупона", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТаблицаСтоимостейЦБ.ЗаполнитьЗначения(ЭтотОбъект.Дата, "ДатаЦеныКупона");
		
		ТаблицаСтоимостейЦББезПартий = ТаблицаСтоимостейЦБ; 
		
		#КонецОбласти
		
	Иначе
		
		#Область Расчет_по_партиям

		Если Не Справочники.ВариантыРасчетаОценочнойСтоимости.ПроверитьКотировки(ВариантРасчетаСправедливойСтоимости, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ) Тогда
			Возврат;
		КонецЕсли;
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		#Область Получение_партий_ценных_бумаг_и_помещение_в_ВТ
		
		Если ТаблицаЦенныхБумаг = Неопределено Тогда
			
			РаботаСПереоценкой.ПолучитьЦенныеБумаги(ЭтотОбъект, МенеджерВременныхТаблиц, "ТаблицаПартийЦБ", ПараметрыПолученияПартий, РасчетПартий, , РасшифровкаРасчета);
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ТаблицаПартийЦБ.Рынок КАК Рынок,
				|	ТаблицаПартийЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
				|	СУММА(ТаблицаПартийЦБ.Количество) КАК Количество
				|ИЗ
				|	ТаблицаПартийЦБ КАК ТаблицаПартийЦБ
				|
				|СГРУППИРОВАТЬ ПО
				|	ТаблицаПартийЦБ.Рынок,
				|	ТаблицаПартийЦБ.ЦеннаяБумага";
			
			ТаблицаЦБ = Запрос.Выполнить().Выгрузить();
			
			СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(МенеджерВременныхТаблиц, , "_КонечныеОстаткиПартий");
			
		Иначе
			
			ТаблицаЦБ = ТаблицаЦенныхБумаг.Скопировать(, "Рынок, ЦеннаяБумага, Количество");
			ТаблицаЦБ.Свернуть("Рынок, ЦеннаяБумага", "Количество");
			
			СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаЦенныхБумаг, "_КонечныеОстаткиПартий", МенеджерВременныхТаблиц); 
			
		КонецЕсли;
		
		#КонецОбласти
		
		РеквизитыПереоценки = Новый Структура;
		
		РеквизитыПереоценки.Вставить("Дата",									НачалоДня(ЭтотОбъект.Дата));
		РеквизитыПереоценки.Вставить("Организация",								ЭтотОбъект.Организация);
	    РеквизитыПереоценки.Вставить("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);
	    РеквизитыПереоценки.Вставить("ЦельРасчета",								ЭтотОбъект.ЦельРасчета);
	    РеквизитыПереоценки.Вставить("ВидУчета",								ЭтотОбъект.ВидУчета);
	    РеквизитыПереоценки.Вставить("ПереоцениватьНаОснованииНастроекУчета",	Ложь);
	    РеквизитыПереоценки.Вставить("ВариантРасчетаОценочнойСтоимости",		ВариантРасчетаСправедливойСтоимости);
	    РеквизитыПереоценки.Вставить("ВариантРасчетаСправедливойСтоимости",		ВариантРасчетаСправедливойСтоимости);
	    РеквизитыПереоценки.Вставить("ЦенныеБумаги",							Новый ТаблицаЗначений);
	    РеквизитыПереоценки.Вставить("ПараметрыПолученияПартий",				Неопределено);
		РеквизитыПереоценки.Вставить("Клиент",									Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(РеквизитыПереоценки.СчетДоверительногоУправления, РеквизитыПереоценки.Дата));
		РеквизитыПереоценки.Вставить("ДополнительныеСвойства",					ЭтотОбъект.ДополнительныеСвойства);  
		РеквизитыПереоценки.Вставить("ОценкаПрочихЦенныхБумаг", 				ОценкаПрочихЦенныхБумаг);
		
		Если МенеджерВременныхТаблиц.Таблицы.Найти("_КонечныеОстаткиПартий") <> Неопределено Тогда
			РеквизитыПереоценки.Вставить("ТаблицаПартийЦБ", МенеджерВременныхТаблиц.Таблицы["_КонечныеОстаткиПартий"].ПолучитьДанные().Выгрузить()); // см. РаботаСПереоценкой.ПоместитьБумагиОцениваемыеПоАмортизированнойСтоимостиВМенеджерВременныхТаблиц
		КонецЕсли;		
		
		Если ВариантРасчетаСправедливойСтоимости.ПринадлежитЭлементу(Справочники.ВариантыРасчетаОценочнойСтоимости.ЕПС) Тогда
			
			#Область Получение_таблицы_стоимостей_и_помещение_в_ВТ
			
			ТаблицаСтоимостейЦБ = РаботаСПереоценкой.РассчитатьСтоимостьПереоценкиЕПС(РеквизитыПереоценки, НачалоДня(ЭтотОбъект.Дата), ТаблицаЦБ, ТаблицаСтоимостей, Отказ, РасшифровкаРасчета);
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Период КАК Период,
				|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	&ВидУчета КАК ВидУчета,
				|	&ЦельРасчета КАК ЦельРасчета,
				|	 ТаблицаСтоимостейЦБ.*				
				|ПОМЕСТИТЬ СтоимостьПереоценки
				|ИЗ
				|	&ТаблицаСтоимостейЦБ КАК ТаблицаСтоимостейЦБ
				|ГДЕ
				|	(ТаблицаСтоимостейЦБ.ЦенаКотировки > 0
				|			ИЛИ ТаблицаСтоимостейЦБ.ВидЦены <> 0)";
			
			Запрос.УстановитьПараметр("ТаблицаСтоимостейЦБ",			ТаблицаСтоимостейЦБ);
			Запрос.УстановитьПараметр("Период",							НачалоДня(ЭтотОбъект.Дата));
			Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("ВидУчета",						ЭтотОбъект.ВидУчета);
			Запрос.УстановитьПараметр("ЦельРасчета",					ЭтотОбъект.ЦельРасчета);
			
			Запрос.Выполнить();
			
			#КонецОбласти
			
		КонецЕсли;		
				
		РаботаСПереоценкой.ПолучитьТабличнуюЧастьПереоценки(РеквизитыПереоценки, МенеджерВременныхТаблиц, Отказ, РасшифровкаРасчета);
		
		Если Отказ = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить таблицу бумаг", ЭтотОбъект.Ссылка);
			Возврат;
		КонецЕсли;
		
		ТаблицаСтоимостейЦББезПартий = ТаблицаСтоимостейЦБ;
		ТаблицаСтоимостейЦБ = РеквизитыПереоценки.ЦенныеБумаги;
		
		Документы.РегистрацияСтоимостиПереоценки.ЗаменитьКолонкиПереоценки(ТаблицаСтоимостейЦБ);
		
		#КонецОбласти
		
	КонецЕсли;

	Если ВыполнятьРасчетПоУказаниюЦБ Тогда
	
		#Область Подмена_цен_в_соответствии_с_указаниями_ЦБ

		Если НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 Тогда
			
			ОбновитьСтоимостиВСоответствииСУказаниемЦБРФ5419У(ТаблицаСтоимостейЦБ, Не ОчиститьКупоныСуммыИКоличество, ПараметрыПолученияПартий, Отказ, РасшифровкаРасчета);				
			
		ИначеЕсли НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
			
			РеквизитыПереоценки.Вставить("НастройкиОценки",											 НастройкиОценки);
			РеквизитыПереоценки.Вставить("ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета", ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета);
			
			ОбновитьСтоимостиВСоответствииСУказаниемЦБРФ6073У(ТаблицаСтоимостейЦБ, Не ОчиститьКупоныСуммыИКоличество, РеквизитыПереоценки, Отказ, РасшифровкаРасчета);				
			
		КонецЕсли;
		
		ТаблицаСтоимостейЦББезПартий = Новый ТаблицаЗначений; // таблица без партий в данном случае некорректна

		#КонецОбласти
	
	КонецЕсли;
			
	// Обновление стоимости погашенных бумаг 
	
	Если Не ОценкаПрочихЦенныхБумаг Тогда
		
		ПараметрыОценки = Новый Структура("Дата, Организация, СчетДоверительногоУправления, ЦельРасчета");
		ЗаполнитьЗначенияСвойств(ПараметрыОценки, ЭтотОбъект);
		ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости", ВариантРасчетаСправедливойСтоимости);
		  		
		ОбновитьСтоимостиПогашенныхБумаг(ТаблицаСтоимостейЦБ, РаботаСПереоценкой.СпособОценкиПогашенныхЦенныхБумаг(ПараметрыОценки), ВестиРасчетПоПартиям, Отказ, РасшифровкаРасчета, ТаблицаЦенныхБумаг <> Неопределено);

	КонецЕсли;
	
	// 1. Если оценка прочих ц/б, то удаляем партии с одинаковой ценой.	
	// 2. Если ВыполнятьРасчетПоУказаниюЦБ5419, то партии оставляем.
	// 3. Если оценка объектов управлении:
	//    3.1. Если ВестиРасчетПоПартиям, тогда партии оставляем.
	//    3.2. Иначе удаляем партии с одинаковой ценой
	// 4. Иначе удаляем партии с одинаковой ценой.
	
	СвернутьПартииСОдинаковойЦеной = Ложь;
	Если ОценкаПрочихЦенныхБумаг Тогда
		СвернутьПартииСОдинаковойЦеной = Истина;
	ИначеЕсли Не ВыполнятьРасчетПоУказаниюЦБ Тогда
		СвернутьПартииСОдинаковойЦеной = Не (ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки И ВестиРасчетПоПартиям);
	КонецЕсли;
	
	Если СвернутьПартииСОдинаковойЦеной Тогда
	
		#Область Удаление_партий_с_ценой_определенной_по_всей_бумаге
		
		Если ОценкаПрочихЦенныхБумаг И ВыполнятьРасчетПоУказаниюЦБ Тогда
			
			// в этом случае берем средневзвешенную цену покупки
			
			ТаблицаСвернуто = ТаблицаСтоимостейЦБ.Скопировать(, "ЦеннаяБумага, Цена, ЦенаКотировки, Количество");
			ТаблицаСвернуто.Колонки.Добавить("СуммаВВалютеУчета", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
			ТаблицаСвернуто.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
			
			Для каждого СтрокаСвернуто Из ТаблицаСвернуто Цикл
			    СтрокаСвернуто.СуммаВВалютеУчета = СтрокаСвернуто.Цена * СтрокаСвернуто.Количество;				
				СтрокаСвернуто.Сумма = СтрокаСвернуто.ЦенаКотировки * СтрокаСвернуто.Количество;				
			КонецЦикла; 
			
			ТаблицаСвернуто.Свернуть("ЦеннаяБумага", "СуммаВВалютеУчета, Сумма, Количество");
			ТаблицаСтоимостейЦБ.Сортировать("ЦеннаяБумага, ДатаЦены Убыв");
			
			Для каждого СтрокаСвернуто Из ТаблицаСвернуто Цикл
			
				СтрокиПоЦеннойБумаге = ТаблицаСтоимостейЦБ.НайтиСтроки(Новый Структура("ЦеннаяБумага", СтрокаСвернуто.ЦеннаяБумага));
				ПерваяСтрока = Неопределено;
				
				Для каждого СтрокаПоЦеннойБумаге Из СтрокиПоЦеннойБумаге Цикл
				
					Если ПерваяСтрока = Неопределено Тогда
						ПерваяСтрока = СтрокаПоЦеннойБумаге;
						ПерваяСтрока.Цена = СтрокаСвернуто.СуммаВВалютеУчета / СтрокаСвернуто.Количество;
						ПерваяСтрока.ЦенаКотировки = СтрокаСвернуто.Сумма / СтрокаСвернуто.Количество;
					Иначе
						ТаблицаСтоимостейЦБ.Удалить(СтрокаПоЦеннойБумаге);
					КонецЕсли; 
				
				КонецЦикла; 
			
			КонецЦикла; 
			
		КонецЕсли;
		
		ПоляУникальностиЦены = "ЦеннаяБумага, ЦенаКотировки, ДатаЦены, ВалютаКотировки, ВидЦены, УровеньОценки, Источник";
		
		УникальныеЦены = ТаблицаСтоимостейЦБ.Скопировать(Неопределено, ПоляУникальностиЦены);
		УникальныеЦены.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
		УникальныеЦены.ЗаполнитьЗначения(1, "КоличествоСтрок");
		УникальныеЦены.Свернуть(ПоляУникальностиЦены, "КоличествоСтрок");
		УникальныеЦены.Индексы.Добавить("ЦеннаяБумага");
		
		УникальныеЦенныеБумаги = УникальныеЦены.Скопировать(Неопределено, "ЦеннаяБумага");
		УникальныеЦенныеБумаги.Колонки.Добавить("КоличествоЦен", Новый ОписаниеТипов("Число"));
		УникальныеЦенныеБумаги.ЗаполнитьЗначения(1, "КоличествоЦен");
		УникальныеЦенныеБумаги.Свернуть("ЦеннаяБумага", "КоличествоЦен");
		
		// Если цена одна для бумаги, то очищаем партию у всех
		// Если несколько цен для бумаги, то очищаем партию только там, где больше всего строк
		
		УникальныеЦеныДляОчисткиПартий = Новый Массив;
		
		Для Каждого СтрокаЦенныеБумаги Из УникальныеЦенныеБумаги Цикл
			Если СтрокаЦенныеБумаги.КоличествоЦен = 1 Тогда
				УникальныеЦеныДляОчисткиПартий.Добавить(УникальныеЦены.Найти(СтрокаЦенныеБумаги.ЦеннаяБумага, "ЦеннаяБумага"));
			Иначе
				СтрокиСЦенами = УникальныеЦены.Скопировать(Новый Структура("ЦеннаяБумага", СтрокаЦенныеБумаги.ЦеннаяБумага));
				СтрокиСЦенами.Сортировать("КоличествоСтрок Убыв");
				УникальныеЦеныДляОчисткиПартий.Добавить(СтрокиСЦенами[0]);
			КонецЕсли;
		КонецЦикла;
		
		// Непосредственно зачистка партий
		
		СтруктураОтбораЦен = Новый Структура(ПоляУникальностиЦены);
		ТаблицаСтоимостейЦБ.Индексы.Добавить(ПоляУникальностиЦены);
		
		Для Каждого УникальнаяЦена Из УникальныеЦеныДляОчисткиПартий Цикл
			Если УникальнаяЦена.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.АмортизированнаяСтоимость Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбораЦен, УникальнаяЦена);
			
			СтрокиСЦенами		= ТаблицаСтоимостейЦБ.НайтиСтроки(СтруктураОтбораЦен);
			СтрокаСТекущейЦеной	= Неопределено;
			
			Для Каждого СтрокаСЦеной Из СтрокиСЦенами Цикл
				Если СтрокаСТекущейЦеной = Неопределено Тогда
					СтрокаСТекущейЦеной = СтрокаСЦеной;
					СтрокаСТекущейЦеной.Партия			= Неопределено;
					СтрокаСТекущейЦеной.СтрокаПартии	= 0;
				Иначе
					Если Не ОчиститьКупоныСуммыИКоличество Тогда
						СтрокаСТекущейЦеной.Количество				= СтрокаСТекущейЦеной.Количество			  + СтрокаСЦеной.Количество;
						СтрокаСТекущейЦеной.Сумма					= СтрокаСТекущейЦеной.Сумма					  + СтрокаСЦеной.Сумма;
						СтрокаСТекущейЦеной.СуммаКупона				= СтрокаСТекущейЦеной.СуммаКупона			  + СтрокаСЦеной.СуммаКупона;
						СтрокаСТекущейЦеной.СуммаВВалютеУчета		= СтрокаСТекущейЦеной.СуммаВВалютеУчета		  + СтрокаСЦеной.СуммаВВалютеУчета;						
						СтрокаСТекущейЦеной.СуммаКупонаВВалютеУчета	= СтрокаСТекущейЦеной.СуммаКупонаВВалютеУчета + СтрокаСЦеной.СуммаКупонаВВалютеУчета;
					КонецЕсли;
					
					ТаблицаСтоимостейЦБ.Удалить(СтрокаСЦеной);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		#КонецОбласти
		
	КонецЕсли;	
	
	// Удаление балансовых цен
	Если НЕ ЭтотОбъект.ЦельРасчета.ТолькоДляФиксацииСтоимостиОценки Тогда
		СтрокиБалансовые = ТаблицаСтоимостейЦБ.НайтиСтроки(Новый Структура("ВидЦены", Перечисления.ИсточникиЦеныДляПереоценки.БалансоваяЦена));
		Для Каждого СтрокаБалансовая Из СтрокиБалансовые Цикл
			ТаблицаСтоимостейЦБ.Удалить(СтрокаБалансовая);
		КонецЦикла;
	КонецЕсли;

	// Удаление купонов, сумм и количества
	
	Если ОчиститьКупоныСуммыИКоличество Тогда
		
		ТаблицаСтоимостейЦБ.ЗаполнитьЗначения(0, "Сумма, СуммаКупона, СуммаВВалютеУчета, СуммаКупонаВВалютеУчета, Количество");
		
	КонецЕсли;
	
	// Если ТаблицаСтоимостейЦБ была получена с разбивкой по партиям, а затем свернута в этом модуле,
	// то все суммы нужно перерассчитать по ценам и курсам заново, иначе возникнут расхождения.
	// Также пересчет необходим, если валютные суммы при пересчете в рубли следует предварительно округлять.  
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область Пересчет_сумм
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСтоимостейЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаСтоимостейЦБ.Партия КАК Партия,
		|	ТаблицаСтоимостейЦБ.СтрокаПартии КАК СтрокаПартии,
		|	ТаблицаСтоимостейЦБ.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ТаблицаСтоимостейЦБ.Рынок КАК Рынок,
		|	ТаблицаСтоимостейЦБ.Цена КАК Цена,
		|	ТаблицаСтоимостейЦБ.ЦенаКотировки КАК ЦенаКотировки,
		|	ТаблицаСтоимостейЦБ.Сумма КАК Сумма,
		|	ТаблицаСтоимостейЦБ.Количество КАК Количество,
		|	ТаблицаСтоимостейЦБ.ЦенаКупона КАК ЦенаКупона,
		|	ТаблицаСтоимостейЦБ.ЦенаКотировкиКупона КАК ЦенаКотировкиКупона,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.ВидЦены = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.ВидЦены
		|	КОНЕЦ КАК ВидЦены,
		|	ТаблицаСтоимостейЦБ.УровеньОценки КАК УровеньОценки,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.ДатаЦены = 0
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.ДатаЦены
		|	КОНЕЦ КАК ДатаЦены,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.ДатаЦеныКупона = 0
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.ДатаЦеныКупона
		|	КОНЕЦ КАК ДатаЦеныКупона,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.Источник = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.Источник
		|	КОНЕЦ КАК Источник,
		|	ТаблицаСтоимостейЦБ.СуммаКупона КАК СуммаКупона,
		|	ТаблицаСтоимостейЦБ.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
		|	ТаблицаСтоимостейЦБ.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.ВалютаКотировкиКупона = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.ВалютаКотировкиКупона
		|	КОНЕЦ КАК ВалютаКотировкиКупона,
		|	ТаблицаСтоимостейЦБ.Примечание КАК Примечание,
		|	ВЫБОР
		|		КОГДА ТаблицаСтоимостейЦБ.ВалютаКотировки = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаСтоимостейЦБ.ВалютаКотировки
		|	КОНЕЦ КАК ВалютаКотировки,
		|	&ЦельРасчета КАК ЦельРасчета,
		|	ТаблицаСтоимостейЦБ.КурсВалютыНоминала КАК КурсВалютыНоминала
		|ПОМЕСТИТЬ _ИсходнаяТаблица
		|ИЗ
		|	&ТаблицаСтоимостейЦБ КАК ТаблицаСтоимостейЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИсходнаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ВалютыНоминалов
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ИсходнаяТаблица.ЦеннаяБумага = Акции.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	ВалютаНоминала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИсходнаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ИсходнаяТаблица.Рынок КАК Рынок,
		|	_ИсходнаяТаблица.Партия КАК Партия,
		|	_ИсходнаяТаблица.СтрокаПартии КАК СтрокаПартии,
		|	_ИсходнаяТаблица.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ИсходнаяТаблица.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКотировки КАК ЧИСЛО(2, 0))
		|	КОНЕЦ КАК ЦенаКотировки,
		|	_ИсходнаяТаблица.ВалютаКотировки КАК ВалютаКотировки,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))
		|	КОНЕЦ КАК Цена,
		|	_ИсходнаяТаблица.ВидЦены КАК ВидЦены,
		|	_ИсходнаяТаблица.УровеньОценки КАК УровеньОценки,
		|	_ИсходнаяТаблица.ДатаЦены КАК ДатаЦены,
		|	_ИсходнаяТаблица.Источник КАК Источник,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))
		|		КОГДА &ПересчитатьСуммы
		|			ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(3, 0))
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.Сумма КАК ЧИСЛО(3, 0))
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))
		|		КОГДА &ПересчитатьСуммы
		|				И _ИсходнаяТаблица.СуммаВВалютеУчета <> 0
		|			ТОГДА ВЫБОР
		|					КОГДА _ИсходнаяТаблица.КурсВалютыНоминала > 0
		|							И &РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(4, 0))) * _ИсходнаяТаблица.КурсВалютыНоминала / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					КОГДА _ИсходнаяТаблица.КурсВалютыНоминала > 0
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))) * _ИсходнаяТаблица.Количество * _ИсходнаяТаблица.КурсВалютыНоминала / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					КОГДА &РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(4, 0))) * КурсыВалютыНоминалаНаДатуОценки.Курс / КурсыВалютыНоминалаНаДатуОценки.Кратность / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.Цена КАК ЧИСЛО(2, 0))) * _ИсходнаяТаблица.Количество * КурсыВалютыНоминалаНаДатуОценки.Курс / КурсыВалютыНоминалаНаДатуОценки.Кратность / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.СуммаВВалютеУчета КАК ЧИСЛО(3, 0))
		|	КОНЕЦ КАК СуммаВВалютеУчета,
		|	ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКотировкиКупона КАК ЧИСЛО(2, 0)) КАК ЦенаКотировкиКупона,
		|	_ИсходнаяТаблица.ВалютаКотировкиКупона КАК ВалютаКотировкиКупона,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.ЦеннаяБумага В (&ЦенныеБумагиСОкруглениемВалютногоКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(6, 0))
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(2, 0))
		|	КОНЕЦ КАК ЦенаКупона,
		|	_ИсходнаяТаблица.ДатаЦеныКупона КАК ДатаЦеныКупона,
		|	ВЫБОР
		|		КОГДА &ПересчитатьСуммы
		|				И _ИсходнаяТаблица.ЦеннаяБумага В (&ЦенныеБумагиСОкруглениемВалютногоКупона)
		|			ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(6, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(3, 0))
		|		КОГДА &ПересчитатьСуммы
		|			ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(1, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(3, 0))
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.СуммаКупона КАК ЧИСЛО(3, 0))
		|	КОНЕЦ КАК СуммаКупона,
		|	ВЫБОР
		|		КОГДА &ПересчитатьСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА _ИсходнаяТаблица.КурсВалютыНоминала > 0
		|							И &РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(1, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(5, 0))) * _ИсходнаяТаблица.КурсВалютыНоминала / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					КОГДА _ИсходнаяТаблица.КурсВалютыНоминала > 0
		|							И _ИсходнаяТаблица.ЦеннаяБумага В (&ЦенныеБумагиСОкруглениемВалютногоКупона)
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(6, 0))) * _ИсходнаяТаблица.Количество * _ИсходнаяТаблица.КурсВалютыНоминала / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					КОГДА _ИсходнаяТаблица.КурсВалютыНоминала > 0
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(1, 0))) * _ИсходнаяТаблица.Количество * _ИсходнаяТаблица.КурсВалютыНоминала / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					КОГДА &РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(1, 0))) * _ИсходнаяТаблица.Количество КАК ЧИСЛО(5, 0))) * КурсыВалютыНоминалаНаДатуОценки.Курс / КурсыВалютыНоминалаНаДатуОценки.Кратность / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|					ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(_ИсходнаяТаблица.ЦенаКупона КАК ЧИСЛО(1, 0))) * _ИсходнаяТаблица.Количество * КурсыВалютыНоминалаНаДатуОценки.Курс / КурсыВалютыНоминалаНаДатуОценки.Кратность / КурсВалютУчетаНаДатуОценки.Курс * КурсВалютУчетаНаДатуОценки.Кратность КАК ЧИСЛО(3, 0))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫРАЗИТЬ(_ИсходнаяТаблица.СуммаКупонаВВалютеУчета КАК ЧИСЛО(3, 0))
		|	КОНЕЦ КАК СуммаКупонаВВалютеУчета,
		|	_ИсходнаяТаблица.КурсВалютыНоминала КАК КурсВалютыНоминала,
		|	_ИсходнаяТаблица.Примечание КАК Примечание,
		|	&РучнойВвод КАК РучнойВвод
		|ПОМЕСТИТЬ НоваяТаблицаСтоимостейЦБ
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВалютыНоминалов КАК _ВалютыНоминалов
		|		ПО (_ВалютыНоминалов.ЦеннаяБумага = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютыНоминалаНаДатуОценки
		|		ПО (_ВалютыНоминалов.ВалютаНоминала = КурсыВалютыНоминалаНаДатуОценки.Валюта)
		|			И (КурсыВалютыНоминалаНаДатуОценки.Период = &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсВалютУчетаНаДатуОценки
		|		ПО (&ВалютаУчета = КурсВалютУчетаНаДатуОценки.Валюта)
		|			И (КурсВалютУчетаНаДатуОценки.Период = &Период)";
	
	// Если для колонки явно не задана точность, то в SQL она урезается до 9 знаков после запятой
	
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(ТаблицаСтоимостейЦБ, "ЦенаКотировки", Метаданные.РегистрыСведений.СтоимостьПереоценки.Ресурсы.Цена.Тип);
	
	// Возникают ситуации, когда превышается допустимая длина числа в SQL, поэтому в запросе приводим числа к точности, необходимой для данного счета ДУ
	
	ТипЧислаЦенаПроцент	= Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦенаПроцент.Тип.КвалификаторыЧисла;
	ДлинаЦелойЧасти		= Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип.КвалификаторыЧисла.Разрядность;
	ТочностьЦены		= РаботаСПереоценкой.ПолучитьТочностьРасчетаОценочнойСтоимости(НастройкиОценки);
	ТипЧислаСумма		= Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип.КвалификаторыЧисла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(1, 0)", "ЧИСЛО(" + Строка(ТипЧислаЦенаПроцент.Разрядность) + ", " +  Строка(ТипЧислаЦенаПроцент.РазрядностьДробнойЧасти) + ")");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(2, 0)", "ЧИСЛО(" + Строка(ДлинаЦелойЧасти) + ", " +  Строка(ТочностьЦены) + ")");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(3, 0)", "ЧИСЛО(" + Строка(ТипЧислаСумма.Разрядность) + ", " +  Строка(ТипЧислаСумма.РазрядностьДробнойЧасти) + ")");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(6, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаСумма.Разрядность, 2));
	
	
	#Область Варианты_округления_валютных_сумм_при_расчете_сумм_в_валюте_учета
	
	РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы = (ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму <> "НеОкруглять");	
		
	Если РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы Тогда
		Если ТипЗнч(ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму) = Тип("Число") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(4, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаСумма.Разрядность, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неизвестный вариант округления валютной суммы '%1'", ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму), , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы = (ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона <> "НеОкруглять");	
	
	Если РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы Тогда
		Если ТипЗнч(ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона) = Тип("Число") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(5, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаСумма.Разрядность, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неизвестный вариант округления валютной суммы купона '%1'", ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона), , , , Отказ);
		КонецЕсли;
	КонецЕсли;
		
	Запрос.УстановитьПараметр("РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы",		РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы);
	Запрос.УстановитьПараметр("РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы",	РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы);	
	
	#КонецОбласти
	
	ПересчитатьСуммы =
		Не ОчиститьКупоныСуммыИКоличество
			И (Не ИспользованаМетодикаРасчетаПоНовойСхеме И Не НастройкиОценки.ВестиРасчетПоПартиям И СвернутьПартииСОдинаковойЦеной
				ИЛИ РассчитыватьРыночнуюСуммуВВалютеУчетаОтОкругленнойВалютнойСуммы
				ИЛИ РассчитыватьРыночнуюСуммуКупонаВВалютеУчетаОтОкругленнойВалютнойСуммы);
				
	Если ЭтотОбъект.Дата < '20220218' Тогда // #Техдолг
		
		#Область ПересчитатьСуммы_до_28_02_2022
		
		// ТаблицаСтоимостейЦБ для методик РЭМ и ПИФ сразу получена без учета партий, дополнительный расчет сумм не требуется.
		//Запрос.УстановитьПараметр("ЭтоСвернутаяТаблица", Не ИспользованаМетодикаРасчетаПоНовойСхеме(ЦельРасчета, ВариантРасчетаСправедливойСтоимости) И Не НастройкиОценки.ВестиРасчетПоПартиям);
		// Временное обходное решение, пока получение значения параметра не проверено окончательно
	
		Если ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.РЭМ
			ИЛИ ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ФондФилософии
			ИЛИ ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ФОГФ
		Тогда
			ПересчитатьСуммы = Ложь;
		Иначе
			ПересчитатьСуммы = ИспользованаМетодикаРасчетаПоНовойСхеме Или Не ВестиРасчетПоПартиям;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("ЦельРасчета",         	ЭтотОбъект.ЦельРасчета);
	Запрос.УстановитьПараметр("ТаблицаСтоимостейЦБ", 	ТаблицаСтоимостейЦБ);
	Запрос.УстановитьПараметр("РучнойВвод",          	Не (ТаблицаСтоимостей = Неопределено ИЛИ ПустаяСтрока(ТаблицаСтоимостей)));
	Запрос.УстановитьПараметр("ВалютаУчета",         	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	Запрос.УстановитьПараметр("Период",        			НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПересчитатьСуммы",		ПересчитатьСуммы);
	
	ЦенныеБумагиСОкруглениемВалютногоКупона = Новый Массив; 
	
	Если ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.РЭМ И ЭтотОбъект.Дата >= '20251128'
		Или ВариантРасчетаСправедливойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Рыночная3ПоследняяЗа90КалендарныхДней И ЭтотОбъект.Дата >= '20251128'
	Тогда
		ЦенныеБумагиСОкруглениемВалютногоКупона.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин12840111V"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЦенныеБумагиСОкруглениемВалютногоКупона", ЦенныеБумагиСОкруглениемВалютногоКупона);
	
	Запрос.Выполнить();
	
	#КонецОбласти
		
	ИтоговаяТаблица = Запрос.МенеджерВременныхТаблиц.Таблицы["НоваяТаблицаСтоимостейЦБ"].ПолучитьДанные().Выгрузить();
	
	// Распределение погрешности округления сумм на партии требуется,
	// если посчитали в разрезе партий, но нужна оценка по пакету
	
	Если Не ОчиститьКупоныСуммыИКоличество И Не ИспользованаМетодикаРасчетаПоНовойСхеме И Не НастройкиОценки.ВестиРасчетПоПартиям Тогда
		
		РаспределитьПогрешностиОкругленияСуммНаПартии(ИтоговаяТаблица, НастройкиОценки, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета, Отказ);

		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос, "НоваяТаблицаСтоимостейЦБ");
		
	КонецЕсли;
	
	Если ПредупредитьОРазличиях Тогда
	
		#Область Проверка_различий
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СтоимостьПереоценки.Партия КАК Партия,
			|	СтоимостьПереоценки.СтрокаПартии КАК СтрокаПартии,
			|	СтоимостьПереоценки.Рынок КАК Рынок,
			|	СтоимостьПереоценки.Регистратор КАК Регистратор,
			|	СтоимостьПереоценки.ВидУчета КАК ВидУчета,
			|	СтоимостьПереоценки.ЦельРасчета КАК ЦельРасчета,
			|	СтоимостьПереоценки.Примечание КАК Примечание,
			|	СтоимостьПереоценки.ЦенаКотировки КАК ЦенаКотировкиТекущая,
			|	СтоимостьПереоценки.ЦенаКотировкиКупона КАК ЦенаКотировкиКупонаТекущая,
			|	СтоимостьПереоценки.Количество КАК КоличествоТекущее,
			|	СтоимостьПереоценки.Сумма КАК СуммаТекущая,
			|	СтоимостьПереоценки.СуммаКупона КАК СуммаКупонаТекущая,
			|	СтоимостьПереоценки.Цена КАК ЦенаТекущая,
			|	СтоимостьПереоценки.ЦенаКупона КАК ЦенаКупонаТекущая,
			|	СтоимостьПереоценки.ВидЦены КАК ВидЦеныТекущая,
			|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценкиТекущая,
			|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦеныТекущая,
			|	СтоимостьПереоценки.ДатаЦеныКупона КАК ДатаЦеныКупонаТекущая,
			|	СтоимостьПереоценки.Источник КАК ИсточникТекущая,
			|	СтоимостьПереоценки.ВалютаКотировки КАК ВалютаКотировкиТекущая,
			|	СтоимостьПереоценки.ВалютаКотировкиКупона КАК ВалютаКотировкиКупонаТекущая,
			|	СтоимостьПереоценки.СуммаВВалютеУчета КАК СуммаВВалютеУчетаТекущая,
			|	СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчетаТекущая
			|ПОМЕСТИТЬ ТекущиеСтоимости
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
			|ГДЕ
			|	СтоимостьПереоценки.Регистратор = &Регистратор
			|	И (СтоимостьПереоценки.ВидУчета = &ВидУчета
			|				И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ПустаяСсылка)
			|			ИЛИ СтоимостьПереоценки.ЦельРасчета = &ЦельРасчета)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Рынок,
			|	ЦеннаяБумага,
			|	Партия,
			|	СтрокаПартии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ТекущиеСтоимости.ЦеннаяБумага, НоваяТаблицаСтоимостейЦБ.ЦеннаяБумага) КАК ЦеннаяБумага,
			|	ЕСТЬNULL(ТекущиеСтоимости.Партия, НоваяТаблицаСтоимостейЦБ.Партия) КАК Партия,
			|	ЕСТЬNULL(ТекущиеСтоимости.СтрокаПартии, НоваяТаблицаСтоимостейЦБ.СтрокаПартии) КАК СтрокаПартии,
			|	ЕСТЬNULL(ТекущиеСтоимости.Рынок, НоваяТаблицаСтоимостейЦБ.Рынок) КАК Рынок,
			|	НоваяТаблицаСтоимостейЦБ.ЦенаКотировки КАК ЦенаКотировки,
			|	НоваяТаблицаСтоимостейЦБ.Цена КАК Цена,
			|	НоваяТаблицаСтоимостейЦБ.ВалютаКотировки КАК ВалютаКотировки,
			|	НоваяТаблицаСтоимостейЦБ.ВидЦены КАК ВидЦены,
			|	НоваяТаблицаСтоимостейЦБ.УровеньОценки КАК УровеньОценки,
			|	НоваяТаблицаСтоимостейЦБ.ДатаЦены КАК ДатаЦены,
			|	НоваяТаблицаСтоимостейЦБ.ДатаЦеныКупона КАК ДатаЦеныКупона,
			|	НоваяТаблицаСтоимостейЦБ.Источник КАК Источник,
			|	НоваяТаблицаСтоимостейЦБ.Количество КАК Количество,
			|	НоваяТаблицаСтоимостейЦБ.Сумма КАК Сумма,
			|	НоваяТаблицаСтоимостейЦБ.ЦенаКотировкиКупона КАК ЦенаКотировкиКупона,
			|	НоваяТаблицаСтоимостейЦБ.ЦенаКупона КАК ЦенаКупона,
			|	НоваяТаблицаСтоимостейЦБ.СуммаКупона КАК СуммаКупона,
			|	НоваяТаблицаСтоимостейЦБ.ВалютаКотировкиКупона КАК ВалютаКотировкиКупона,
			|	НоваяТаблицаСтоимостейЦБ.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
			|	НоваяТаблицаСтоимостейЦБ.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
			|	ТекущиеСтоимости.ЦенаКотировкиТекущая КАК ЦенаКотировкиТекущая,
			|	ТекущиеСтоимости.ЦенаТекущая КАК ЦенаТекущая,
			|	ТекущиеСтоимости.ВалютаКотировкиТекущая КАК ВалютаКотировкиТекущая,
			|	ТекущиеСтоимости.ВидЦеныТекущая КАК ВидЦеныТекущая,
			|	ТекущиеСтоимости.УровеньОценкиТекущая КАК УровеньОценкиТекущая,
			|	ТекущиеСтоимости.ДатаЦеныТекущая КАК ДатаЦеныТекущая,
			|	ТекущиеСтоимости.ДатаЦеныКупонаТекущая КАК ДатаЦеныКупонаТекущая,
			|	ТекущиеСтоимости.ИсточникТекущая КАК ИсточникТекущая,
			|	ТекущиеСтоимости.КоличествоТекущее КАК КоличествоТекущее,
			|	ТекущиеСтоимости.СуммаТекущая КАК СуммаТекущая,
			|	ТекущиеСтоимости.ЦенаКотировкиКупонаТекущая КАК ЦенаКотировкиКупонаТекущая,
			|	ТекущиеСтоимости.ЦенаКупонаТекущая КАК ЦенаКупонаТекущая,
			|	ТекущиеСтоимости.СуммаКупонаТекущая КАК СуммаКупоаТекущая,
			|	ТекущиеСтоимости.ВалютаКотировкиКупонаТекущая КАК ВалютаКотировкиКупонаТекущая,
			|	ТекущиеСтоимости.СуммаВВалютеУчетаТекущая КАК СуммаВВалютеУчетаТекущая,
			|	ТекущиеСтоимости.СуммаКупонаВВалютеУчетаТекущая КАК СуммаКупонаВВалютеУчетаТекущая
			|ПОМЕСТИТЬ СводнаяТаблицаОтличийСтоимостей
			|ИЗ
			|	ТекущиеСтоимости КАК ТекущиеСтоимости
			|		ПОЛНОЕ СОЕДИНЕНИЕ НоваяТаблицаСтоимостейЦБ КАК НоваяТаблицаСтоимостейЦБ
			|		ПО ТекущиеСтоимости.Рынок = НоваяТаблицаСтоимостейЦБ.Рынок
			|			И ТекущиеСтоимости.ЦеннаяБумага = НоваяТаблицаСтоимостейЦБ.ЦеннаяБумага
			|			И (ТекущиеСтоимости.Партия = НЕОПРЕДЕЛЕНО
			|					И НоваяТаблицаСтоимостейЦБ.Партия = НЕОПРЕДЕЛЕНО
			|				ИЛИ ТекущиеСтоимости.Партия = НоваяТаблицаСтоимостейЦБ.Партия
			|					И ТекущиеСтоимости.СтрокаПартии = НоваяТаблицаСтоимостейЦБ.СтрокаПартии)
			|ГДЕ
			|	(ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.Количество, 0) <> ЕСТЬNULL(ТекущиеСтоимости.КоличествоТекущее, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ЦенаКотировки, 0) <> ЕСТЬNULL(ТекущиеСтоимости.ЦенаКотировкиТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.Цена, 0) <> ЕСТЬNULL(ТекущиеСтоимости.ЦенаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ВалютаКотировки, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) <> ЕСТЬNULL(ТекущиеСтоимости.ВалютаКотировкиТекущая, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ВидЦены, ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.ПустаяСсылка)) <> ЕСТЬNULL(ТекущиеСтоимости.ВидЦеныТекущая, ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.ПустаяСсылка))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.УровеньОценки, 0) <> ЕСТЬNULL(ТекущиеСтоимости.УровеньОценкиТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ДатаЦены, ДАТАВРЕМЯ(1, 1, 1)) <> ЕСТЬNULL(ТекущиеСтоимости.ДатаЦеныТекущая, ДАТАВРЕМЯ(1, 1, 1))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ДатаЦеныКупона, ДАТАВРЕМЯ(1, 1, 1)) <> ЕСТЬNULL(ТекущиеСтоимости.ДатаЦеныКупонаТекущая, ДАТАВРЕМЯ(1, 1, 1))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.Источник, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) <> ЕСТЬNULL(ТекущиеСтоимости.ИсточникТекущая, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.Сумма, 0) <> ЕСТЬNULL(ТекущиеСтоимости.СуммаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ЦенаКотировкиКупона, 0) <> ЕСТЬNULL(ТекущиеСтоимости.ЦенаКотировкиКупонаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ЦенаКупона, 0) <> ЕСТЬNULL(ТекущиеСтоимости.ЦенаКупонаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.СуммаКупона, 0) <> ЕСТЬNULL(ТекущиеСтоимости.СуммаКупонаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(ТекущиеСтоимости.Рынок, НоваяТаблицаСтоимостейЦБ.Рынок) = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.ВалютаКотировкиКупона, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) <> ЕСТЬNULL(ТекущиеСтоимости.ВалютаКотировкиКупонаТекущая, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.СуммаВВалютеУчета, 0) <> ЕСТЬNULL(ТекущиеСтоимости.СуммаВВалютеУчетаТекущая, 0)
			|			ИЛИ ЕСТЬNULL(НоваяТаблицаСтоимостейЦБ.СуммаКупонаВВалютеУчета, 0) <> ЕСТЬNULL(ТекущиеСтоимости.СуммаКупонаВВалютеУчетаТекущая, 0))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СводнаяТаблицаСтоимостей.ЦеннаяБумага КАК ЦеннаяБумага
			|ПОМЕСТИТЬ ЕстьТекущаяСтоимость
			|ИЗ
			|	СводнаяТаблицаОтличийСтоимостей КАК СводнаяТаблицаСтоимостей
			|ГДЕ
			|	&Проведен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СводнаяТаблицаОтличийСтоимостей.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СводнаяТаблицаОтличийСтоимостей.Партия КАК Партия,
			|	СводнаяТаблицаОтличийСтоимостей.СтрокаПартии КАК СтрокаПартии,
			|	СводнаяТаблицаОтличийСтоимостей.Рынок КАК Рынок,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКотировки КАК ЦенаКотировки,
			|	СводнаяТаблицаОтличийСтоимостей.Цена КАК Цена,
			|	СводнаяТаблицаОтличийСтоимостей.ВалютаКотировки КАК ВалютаКотировки,
			|	СводнаяТаблицаОтличийСтоимостей.ВидЦены КАК ВидЦены,
			|	СводнаяТаблицаОтличийСтоимостей.УровеньОценки КАК УровеньОценки,
			|	СводнаяТаблицаОтличийСтоимостей.ДатаЦены КАК ДатаЦены,
			|	СводнаяТаблицаОтличийСтоимостей.ДатаЦеныКупона КАК ДатаЦеныКупона,
			|	СводнаяТаблицаОтличийСтоимостей.Источник КАК Источник,
			|	СводнаяТаблицаОтличийСтоимостей.Количество КАК Количество,
			|	СводнаяТаблицаОтличийСтоимостей.Сумма КАК Сумма,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКотировкиКупона КАК ЦенаКотировкиКупона,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКупона КАК ЦенаКупона,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаКупона КАК СуммаКупона,
			|	СводнаяТаблицаОтличийСтоимостей.ВалютаКотировкиКупона КАК ВалютаКотировкиКупона,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаКупонаВВалютеУчета КАК СуммаКупонаВВалютеУчета,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКотировкиТекущая КАК ЦенаКотировкиТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаТекущая КАК ЦенаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ВалютаКотировкиТекущая КАК ВалютаКотировкиТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ВидЦеныТекущая КАК ВидЦеныТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.УровеньОценкиТекущая КАК УровеньОценкиТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ДатаЦеныТекущая КАК ДатаЦеныТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ДатаЦеныКупонаТекущая КАК ДатаЦеныКупонаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ИсточникТекущая КАК ИсточникТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.КоличествоТекущее КАК КоличествоТекущее,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаТекущая КАК СуммаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКотировкиКупонаТекущая КАК ЦенаКотировкиКупонаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ЦенаКупонаТекущая КАК ЦенаКупонаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаКупоаТекущая КАК СуммаКупонаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.ВалютаКотировкиКупонаТекущая КАК ВалютаКотировкиКупонаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаВВалютеУчетаТекущая КАК СуммаВВалютеУчетаТекущая,
			|	СводнаяТаблицаОтличийСтоимостей.СуммаКупонаВВалютеУчетаТекущая КАК СуммаКупонаВВалютеУчетаТекущая
			|ПОМЕСТИТЬ ТаблицаРазличий
			|ИЗ
			|	СводнаяТаблицаОтличийСтоимостей КАК СводнаяТаблицаОтличийСтоимостей";
		
		Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("НоваяТаблицаСтоимостейЦБ") = Неопределено Тогда
			СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ИтоговаяТаблица, "НоваяТаблицаСтоимостейЦБ", Запрос.МенеджерВременныхТаблиц);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ВидУчета",	 ЭтотОбъект.ВидУчета);
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Проведен",	 ЭтотОбъект.Проведен);
		
		Запрос.Выполнить();
		
		ЕстьТекущаяСтоимость = НЕ Запрос.МенеджерВременныхТаблиц.Таблицы["ЕстьТекущаяСтоимость"].ПолучитьДанные().Пустой();
		
		Если ЕстьТекущаяСтоимость Тогда
		
			ТаблицаРазличий = Запрос.МенеджерВременныхТаблиц.Таблицы["ТаблицаРазличий"].ПолучитьДанные().Выгрузить();
			ТаблицаРазличий.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
			ТаблицаРазличий.ЗаполнитьЗначения(НачалоДня(ЭтотОбъект.Дата), "Период");
			
			ДополнительныеСвойства.Вставить("ЕстьОтличияСтоимостиПереоценки",		Истина);
			ДополнительныеСвойства.Вставить("ТаблицаРазличийСтоимостиПереоценки",	ТаблицаРазличий);
			ДополнительныеСвойства.Вставить("ТаблицаСтоимостиПереоценки",			ИтоговаяТаблица);
		
		КонецЕсли; 
		
		#КонецОбласти	
		
	ИначеЕсли ЗаменитьТекущиеСтоимости Тогда
							
		СтоимостиПереоценки.Загрузить(ИтоговаяТаблица);
		Если ПровестиДокумент Тогда
			ДополнительныеСвойства.Вставить("ОчиститьДвижения", Истина);
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДополнительныеСвойства.Вставить("ТаблицаСтоимостиПереоценки", ИтоговаяТаблица);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "Итоговая таблица стоимостей ЦБ", ИтоговаяТаблица);
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьСтоимостиПереоценкиДляОценкиОбъектовВУправлении(АдресФайлаXML, Отказ, РасчетПартий = Неопределено) Экспорт

	ТаблицыДокумента = Новый Структура("СтоимостиПереоценки, СтоимостиПрочихЦенныхБумаг");
		
	ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Строка(АдресФайлаXML),,,,, РасчетПартий);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаСтоимостиПереоценки", ТаблицыДокумента.СтоимостиПереоценки) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("ТаблицаСтоимостиПереоценки");
		Запрос.УстановитьПараметр("ТаблицаСтоимостиПереоценки", ТаблицыДокумента.СтоимостиПереоценки);
	Иначе
		ПустаяТаблица = Новый ТаблицаЗначений;
		ПустаяТаблица.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип));
		Запрос.УстановитьПараметр("ТаблицаСтоимостиПереоценки", ПустаяТаблица);
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаСтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ТаблицаСтоимостиПереоценки
		|ИЗ
		|	&ТаблицаСтоимостиПереоценки КАК ТаблицаСтоимостиПереоценки";
	Запрос.Выполнить();
		
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ЦельРасчета);
	
	Если НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
	
		ПараметрыПолученияПартий = РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(Справочники.ЦелиРасчета.КонтрольИнвестиционнойДекларации, ВидУчета, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, ЭтотОбъект.Дата, , ЭтотОбъект.СчетДоверительногоУправления);	
		ПараметрыПолученияПартий.УчестьСрочныеКонтракты = Истина;
		РаботаСПереоценкой.ПолучитьЦенныеБумаги(ЭтотОбъект, Запрос.МенеджерВременныхТаблиц, "ТаблицаПартийЦБ", ПараметрыПолученияПартий, РасчетПартий);
			
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ТаблицаПартийЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ТаблицаПартийЦБ.Рынок КАК Рынок,
			|	ТаблицаПартийЦБ.Количество КАК Количество,
			|	ТаблицаПартийЦБ.Партия КАК Партия,
			|	ТаблицаПартийЦБ.СтрокаПартии КАК СтрокаПартии
			|ИЗ
			|	ТаблицаПартийЦБ КАК ТаблицаПартийЦБ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСтоимостиПереоценки КАК _ТаблицаСтоимостиПереоценки
			|		ПО ТаблицаПартийЦБ.ЦеннаяБумага = _ТаблицаСтоимостиПереоценки.ЦеннаяБумага
			|ГДЕ
			|	_ТаблицаСтоимостиПереоценки.ЦеннаяБумага ЕСТЬ NULL";

		ТаблицаПрочихЦенныхБумаг = Запрос.Выполнить().Выгрузить();
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("ТипЗадолженности", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("УчетныйАктивЕПС",	Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));

	Иначе
		
		ТипыЗадолженностейПоЦеннымБумагам = Новый Массив;
		ТипыЗадолженностейПоЦеннымБумагам.Добавить(Перечисления.ТипыЗадолженности.Дебиторская);
		ТипыЗадолженностейПоЦеннымБумагам.Добавить(Перечисления.ТипыЗадолженности.Кредиторская);
		
		ПараметрыПолученияОстатков = Новый Структура;
		ПараметрыПолученияОстатков.Вставить("ОстаткиЦенныхБумаг",					Истина);
		ПараметрыПолученияОстатков.Вставить("ТипыЗадолженностейПоЦеннымБумагам",	ТипыЗадолженностейПоЦеннымБумагам);
		ПараметрыПолученияОстатков.Вставить("ЗадолженностиПоВторойЧастиРЕПО",		Истина);
		ПараметрыПолученияОстатков.Вставить("НеУчитыватьЦБКупленныеПоРЕПО",			Ложь);
		ПараметрыПолученияОстатков.Вставить("УчитыватьЦБПроданныеВРЕПО",			Истина); 
		
		Справочники.ВариантыРасчетаОценочнойСтоимости.ПоместитьЦенныеБумагиВМенеджерВременныхТаблиц(
			НастройкиОценки.ВариантРасчетаОценочнойСтоимости,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			ЭтотОбъект.Дата,
			Запрос.МенеджерВременныхТаблиц,
			ПараметрыПолученияОстатков);
			
		Если НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 Или ЭтотОбъект.Дата >= '20251218' Тогда
		
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
				|	_ЦенныеБумаги.Рынок КАК Рынок,
				|	_ЦенныеБумаги.Количество КАК Количество,
				|	_ЦенныеБумаги.ТипЗадолженности КАК ТипЗадолженности
				|ИЗ
				|	_ЦенныеБумаги КАК _ЦенныеБумаги
				|ГДЕ
				|	_ЦенныеБумаги.ТипЗадолженности <> Неопределено";
		
		Иначе		
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
				|	_ЦенныеБумаги.Рынок КАК Рынок,
				|	_ЦенныеБумаги.Количество КАК Количество,
				|	_ЦенныеБумаги.ТипЗадолженности КАК ТипЗадолженности
				|ИЗ
				|	_ЦенныеБумаги КАК _ЦенныеБумаги
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСтоимостиПереоценки КАК _ТаблицаСтоимостиПереоценки
				|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ТаблицаСтоимостиПереоценки.ЦеннаяБумага
				|ГДЕ
				|	_ТаблицаСтоимостиПереоценки.ЦеннаяБумага ЕСТЬ NULL";
			
		КонецЕсли;
		
		ТаблицаПрочихЦенныхБумаг = Запрос.Выполнить().Выгрузить();
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("Партия",							Метаданные.ОпределяемыеТипы.Партия.Тип);
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("СтрокаПартии",					Новый ОписаниеТипов("Число"));
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("УчетныйАктивЕПС",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
		
	КонецЕсли; 
		
	Если ТаблицаПрочихЦенныхБумаг.Количество() > 0 Тогда
	
		ТаблицаПрочихЦенныхБумаг.Колонки.Добавить("СуммаРезервовПодОбесценение",	Новый ОписаниеТипов("Число"));
		
		ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Строка(АдресФайлаXML), , , ТаблицаПрочихЦенныхБумаг, Истина);

		Если Отказ Тогда
			ТаблицаПрочихЦенныхБумаг.Свернуть("Рынок, ЦеннаяБумага");
			ТаблицыДокумента.СтоимостиПрочихЦенныхБумаг = ТаблицаПрочихЦенныхБумаг;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить оценку ценных бумаг для целей контроля ИД",,,, Отказ); 
		Иначе
			ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаСтоимостиПереоценки", ТаблицыДокумента.СтоимостиПрочихЦенныхБумаг);
		КонецЕсли;
		
	КонецЕсли; 	
	
	Возврат ТаблицыДокумента;
	
КонецФункции

#Область Служебные_и_вспомогательные_функции

#Область Подмена_цен_в_соответствии_с_указаниями_ЦБ

// Обновляет стоимости ценных бумаг согласно указанию ЦБ РФ № 5419-У:
// 1. Облигации
//   1.1 Оцениваемые по амортизированной стоимости: оцениваются как обычно
//   1.2 Прочие:
//     1.2.1 Купленные до 01.03: по последней оценочной цене (28.02 или 29.02), купон на дату оценки
//     1.2.2 Купленные после 01.03: по цене на дату приобретения, купон на дату оценки
// 2. Акции и паи
//   2.1 Купленные до 01.03: по последней оценочной цене (28.02 или 29.02)
//   2.2 Купленные после 01.03: оцениваются как обычно
// 3. Прочие ц/б: оцениваются как обычно	
//
Процедура ОбновитьСтоимостиВСоответствииСУказаниемЦБРФ5419У(ТаблицаСтоимостейЦБ, ПересчитыватьСуммы, ПараметрыПолученияПартий = Неопределено, Отказ, РасшифровкаРасчета = Неопределено)
	
	#Область Определение_даты_последней_оценки_до_1_марта_2020_года
	
	Если ЭтотОбъект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Тогда	
		
		ДатаПоследнейОценкиДо1Марта = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ЭтотОбъект.СчетДоверительногоУправления, '20200301');
		
	Иначе
		
		ЗапросДатыПоследнейОценки = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата), ДЕНЬ) КАК Период
			|ИЗ
			|	Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
			|ГДЕ
			|	ПереоценкаЦенныхБумаг.Организация = &Организация
			|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ПереоценкаЦенныхБумаг.ВидУчета = &ВидУчета
			|	И ПереоценкаЦенныхБумаг.Проведен
			|	И ПереоценкаЦенныхБумаг.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)");
		
		ЗапросДатыПоследнейОценки.УстановитьПараметр("Организация",						ЭтотОбъект.Организация);
		ЗапросДатыПоследнейОценки.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
		ЗапросДатыПоследнейОценки.УстановитьПараметр("ВидУчета",						ЭтотОбъект.ВидУчета);
		ЗапросДатыПоследнейОценки.УстановитьПараметр("Дата",							'20200229');
		
		ВыборкаДатыПоследнейОценки = ЗапросДатыПоследнейОценки.Выполнить().Выбрать();
		Если ВыборкаДатыПоследнейОценки.Следующий() Тогда
			ДатаПоследнейОценкиДо1Марта = ВыборкаДатыПоследнейОценки.Период;		
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	Если Не ЗначениеЗаполнено(ДатаПоследнейОценкиДо1Марта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату последней оценки до 01.03.2020", ЭтотОбъект, , , Отказ);
		Возврат;
	КонецЕсли;
	
	// #319555: у ВСК для Минфин 52001 за 29.02.2020 зарегистрирована некорректная цена
	
	ПриоритетнаяСтоимостьНаДатуПоследнейОценкиДо1Марта = Новый ТаблицаЗначений;
	ПриоритетнаяСтоимостьНаДатуПоследнейОценкиДо1Марта.Колонки.Добавить("ЦеннаяБумага", Метаданные.РегистрыСведений.СтоимостьПереоценки.Измерения.ЦеннаяБумага.Тип);
	ПриоритетнаяСтоимостьНаДатуПоследнейОценкиДо1Марта.Колонки.Добавить("Цена", Метаданные.РегистрыСведений.СтоимостьПереоценки.Ресурсы.Цена.Тип);

	Если ЭтотОбъект.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ВСК") Тогда
		СтрокаСтоимости = ПриоритетнаяСтоимостьНаДатуПоследнейОценкиДо1Марта.Добавить();
		СтрокаСтоимости.ЦеннаяБумага	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_Минфин52001");
		СтрокаСтоимости.Цена			= 1202.544283500000;
	КонецЕсли;	
	
	// Подмена цен в соответствии с указанием ЦБ РФ	
	
	#Область Запрос_подмены_цен	
	
	ЗапросПодмен = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостиПереоценки.НомерСтроки КАК НомерСтроки,
		|	СтоимостиПереоценки.Рынок КАК Рынок,
		|	СтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостиПереоценки.Партия КАК Партия,
		|	СтоимостиПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостиПереоценки.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ТаблицаСпискаЦБ
		|ИЗ
		|	&СтоимостиПереоценки КАК СтоимостиПереоценки
		|ГДЕ
		|	&ФильтрПодменяемыхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриоритетнаяСтоимостьНа1Марта.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПриоритетнаяСтоимостьНа1Марта.Цена КАК Цена
		|ПОМЕСТИТЬ _ПриоритетнаяСтоимостьНа1Марта
		|ИЗ
		|	&ПриоритетнаяСтоимостьНа1Марта КАК ПриоритетнаяСтоимостьНа1Марта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _БумагиОцениваемыеПоАмортизированнойСтоимости
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&КонецДняПереоценкиГраницаВключая,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ТаблицаСпискаЦБ.ЦеннаяБумага
		|					ИЗ
		|						_ТаблицаСпискаЦБ)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСпискаЦБ.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаСпискаЦБ.Рынок КАК Рынок,
		|	_ТаблицаСпискаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаСпискаЦБ.Партия КАК Партия,
		|	_ТаблицаСпискаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаСпискаЦБ.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ПроверяемыеБумаги
		|ИЗ
		|	_ТаблицаСпискаЦБ КАК _ТаблицаСпискаЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БумагиОцениваемыеПоАмортизированнойСтоимости КАК _БумагиОцениваемыеПоАмортизированнойСтоимости
		|		ПО (_БумагиОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага = _ТаблицаСпискаЦБ.ЦеннаяБумага)
		|ГДЕ
		|	_ТаблицаСпискаЦБ.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи))
		|	И _БумагиОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия КАК Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ИсполнениеОбязательствПоСделке.Основание КАК Сделка,
		|	НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО _ПроверяемыеБумаги.Партия = ИсполнениеОбязательствПоСделке.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	ПоставкаЦенныхБумаг.Основание,
		|	НАЧАЛОПЕРИОДА(ПоставкаЦенныхБумаг.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО _ПроверяемыеБумаги.Партия = ПоставкаЦенныхБумаг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ПоставкаЦенныхБумагЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ПоставкаЦенныхБумагЦенныеБумаги.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	_ПроверяемыеБумаги.Партия,
		|	НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ПроверяемыеБумаги.Партия = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = СделкаЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = СделкаЦенныеБумаги.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	_ПроверяемыеБумаги.Партия,
		|	НАЧАЛОПЕРИОДА(ВводЦенныхБумаг.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|		ПО _ПроверяемыеБумаги.Партия = ВводЦенныхБумаг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеБумаги.НомерСтроки КАК НомерСтроки,
		|	_ПроверяемыеБумаги.Рынок КАК Рынок,
		|	_ПроверяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия КАК Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	_ПроверяемыеБумаги.ВалютаНоминала КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА _ПроверяемыеБумаги.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи))
		|				И (_Сделки.Дата < ДАТАВРЕМЯ(2020, 3, 1)
		|					ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО)
		|			ТОГДА &ДатаПоследнейОценкиДо1Марта
		|		КОГДА _ПроверяемыеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И (_Сделки.Дата < ДАТАВРЕМЯ(2020, 3, 1)
		|					ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО)
		|			ТОГДА &ДатаПоследнейОценкиДо1Марта
		|		КОГДА _ПроверяемыеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И _Сделки.Дата >= ДАТАВРЕМЯ(2020, 3, 1)
		|				И _Сделки.Дата < ДАТАВРЕМЯ(2020, 10, 1)
		|				И _Сделки.Дата <> &ДатаПереоценки
		|			ТОГДА _Сделки.Дата
		|	КОНЕЦ КАК ДатаОценки
		|ПОМЕСТИТЬ _ПодменяемыеБумаги
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Сделки КАК _Сделки
		|		ПО (_Сделки.Партия = _ПроверяемыеБумаги.Партия)
		|			И (_Сделки.СтрокаПартии = _ПроверяемыеБумаги.СтрокаПартии)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПодменяемыеБумаги.НомерСтроки КАК НомерСтроки,
		|	_ПодменяемыеБумаги.Рынок КАК Рынок,
		|	_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПодменяемыеБумаги.Партия КАК Партия,
		|	_ПодменяемыеБумаги.ДатаОценки КАК ДатаОценки,
		|	_ПодменяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ЕСТЬNULL(СтоимостьПереоценкиПоПартии.ДатаЦены, СтоимостьПереоценкиПоБумаге.ДатаЦены) КАК ДатаЦены,
		|	ЕСТЬNULL(СтоимостьПереоценкиПоПартии.Источник, СтоимостьПереоценкиПоБумаге.Источник) КАК Источник,
		|	ЕСТЬNULL(СтоимостьПереоценкиПоПартии.УровеньОценки, СтоимостьПереоценкиПоБумаге.УровеньОценки) КАК УровеньОценки,
		|	ЕСТЬNULL(СтоимостьПереоценкиПоПартии.ВидЦены, СтоимостьПереоценкиПоБумаге.ВидЦены) КАК ВидЦены,
		|	ЕСТЬNULL(_ПриоритетнаяСтоимостьНа1Марта.Цена, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.Цена, СтоимостьПереоценкиПоБумаге.Цена)) КАК Цена,
		|	_ПодменяемыеБумаги.ВалютаНоминала КАК ВалютаКотировки,
		|	НоминалНаДатуЦены.Номинал КАК НоминалНаДатуЦены,
		|	НоминалНаДатуОценки.Номинал КАК НоминалНаДатуОценки
		|ИЗ
		|	_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПриоритетнаяСтоимостьНа1Марта КАК _ПриоритетнаяСтоимостьНа1Марта
		|		ПО (_ПриоритетнаяСтоимостьНа1Марта.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиПоПартии
		|		ПО (СтоимостьПереоценкиПоПартии.Организация = &Организация)
		|			И (СтоимостьПереоценкиПоПартии.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СтоимостьПереоценкиПоПартии.ЦельРасчета = &ЦельРасчета)
		|			И (СтоимостьПереоценкиПоПартии.ВидЦеныОценки = &ВидЦеныОценки)
		|			И (СтоимостьПереоценкиПоПартии.Рынок = _ПодменяемыеБумаги.Рынок)
		|			И (СтоимостьПереоценкиПоПартии.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (СтоимостьПереоценкиПоПартии.Партия = _ПодменяемыеБумаги.Партия)
		|			И (СтоимостьПереоценкиПоПартии.СтрокаПартии = _ПодменяемыеБумаги.СтрокаПартии)
		|			И (СтоимостьПереоценкиПоПартии.Период = _ПодменяемыеБумаги.ДатаОценки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиПоБумаге
		|		ПО (СтоимостьПереоценкиПоБумаге.Организация = &Организация)
		|			И (СтоимостьПереоценкиПоБумаге.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СтоимостьПереоценкиПоБумаге.ЦельРасчета = &ЦельРасчета)
		|			И (СтоимостьПереоценкиПоБумаге.ВидЦеныОценки = &ВидЦеныОценки)
		|			И (СтоимостьПереоценкиПоБумаге.Рынок = _ПодменяемыеБумаги.Рынок)
		|			И (СтоимостьПереоценкиПоБумаге.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (СтоимостьПереоценкиПоБумаге.Период = _ПодменяемыеБумаги.ДатаОценки)
		|			И (СтоимостьПереоценкиПоПартии.ЦеннаяБумага ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалНаДатуОценки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО (НоминалыЦенныхБумаг.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|						И (НоминалыЦенныхБумаг.Период <= &ДатаПереоценки)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПодменяемыеБумаги.ЦеннаяБумага) КАК ДатыИзмененийНоминалаНаДатуОценки
		|			ПО (ДатыИзмененийНоминалаНаДатуОценки.ЦеннаяБумага = НоминалНаДатуОценки.ЦеннаяБумага)
		|				И (ДатыИзмененийНоминалаНаДатуОценки.Период = НоминалНаДатуОценки.Период)
		|		ПО (НоминалНаДатуОценки.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалНаДатуЦены
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|				_ПодменяемыеБумаги.ДатаОценки КАК ДатаОценки,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО (НоминалыЦенныхБумаг.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|						И (НоминалыЦенныхБумаг.Период <= _ПодменяемыеБумаги.ДатаОценки)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПодменяемыеБумаги.ЦеннаяБумага,
		|				_ПодменяемыеБумаги.ДатаОценки) КАК ДатыИзмененийНоминалаНаДатуЦены
		|			ПО (ДатыИзмененийНоминалаНаДатуЦены.ЦеннаяБумага = НоминалНаДатуЦены.ЦеннаяБумага)
		|				И (ДатыИзмененийНоминалаНаДатуЦены.Период = НоминалНаДатуЦены.Период)
		|		ПО (НоминалНаДатуЦены.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (ДатыИзмененийНоминалаНаДатуЦены.ДатаОценки = _ПодменяемыеБумаги.ДатаОценки)
		|ГДЕ
		|	_ПодменяемыеБумаги.ДатаОценки ЕСТЬ НЕ NULL ");
	
	#КонецОбласти
	
	ПодменямыеБумаги = РаботаСПереоценкой.ЦенныеБумагиСРасчетомСтоимостиВСоответствииСУказаниемЦБРФ5419У(ЭтотОбъект.СчетДоверительногоУправления);
	
	Если ПодменямыеБумаги.Количество() = 0 Тогда
		ЗапросПодмен.Текст = СтрЗаменить(ЗапросПодмен.Текст, "&ФильтрПодменяемыхБумаг", "ИСТИНА");
	Иначе
		ЗапросПодмен.Текст = СтрЗаменить(ЗапросПодмен.Текст, "&ФильтрПодменяемыхБумаг", "ЦеннаяБумага В (&ПодменямыеБумаги)");
	КонецЕсли;
	
	Если ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Тогда
		ВидЦеныОценки = Перечисления.ВидыЦенОценки.ЦенаОценки;
	Иначе
		ВидЦеныОценки = Перечисления.ВидыЦенОценки.ЦенаПереоценки;
	КонецЕсли;
	
	ЗапросПодмен.УстановитьПараметр("КонецДняПереоценкиГраницаВключая",	Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));	
	ЗапросПодмен.УстановитьПараметр("ДатаПереоценки",					НачалоДня(ЭтотОбъект.Дата));	
	ЗапросПодмен.УстановитьПараметр("Организация",						ЭтотОбъект.Организация);
	ЗапросПодмен.УстановитьПараметр("СчетДоверительногоУправления",		ЭтотОбъект.СчетДоверительногоУправления);
	ЗапросПодмен.УстановитьПараметр("ЦельРасчета",						ЭтотОбъект.ЦельРасчета);
	ЗапросПодмен.УстановитьПараметр("ВидУчета",							ЭтотОбъект.ВидУчета);
	ЗапросПодмен.УстановитьПараметр("ВидЦеныОценки",					ВидЦеныОценки);
	ЗапросПодмен.УстановитьПараметр("СтоимостиПереоценки",				ТаблицаСтоимостейЦБ);
	ЗапросПодмен.УстановитьПараметр("ДатаПоследнейОценкиДо1Марта",		ДатаПоследнейОценкиДо1Марта);
	ЗапросПодмен.УстановитьПараметр("ПриоритетнаяСтоимостьНа1Марта",	ПриоритетнаяСтоимостьНаДатуПоследнейОценкиДо1Марта);
	ЗапросПодмен.УстановитьПараметр("ПодменямыеБумаги",					ПодменямыеБумаги);
	
	ВыборкаПодмен = ЗапросПодмен.Выполнить().Выбрать();
	
	ВыполнитьПодменуЦен(ТаблицаСтоимостейЦБ, ВыборкаПодмен, ПересчитыватьСуммы, Отказ);		
	
КонецПроцедуры

// Обновляет стоимости ценных бумаг согласно указанию ЦБ РФ № 6073-У:
// 1. Купленные до 18.02: по цене на 18.02
// 2. Купленные после 18.02: по цене приобретения
//
Процедура ОбновитьСтоимостиВСоответствииСУказаниемЦБРФ6073У(ТаблицаСтоимостейЦБ, ПересчитыватьСуммы, РеквизитыПереоценки, Отказ, РасшифровкаРасчета = Неопределено)
	
	#Область Запрос_подмены_цен	
	
	ЗапросПодмен = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостиПереоценки.НомерСтроки КАК НомерСтроки,
		|	СтоимостиПереоценки.Рынок КАК Рынок,
		|	СтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостиПереоценки.Партия КАК Партия,
		|	СтоимостиПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	СтоимостиПереоценки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СтоимостиПереоценки.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ТаблицаЦБ
		|ИЗ
		|	&СтоимостиПереоценки КАК СтоимостиПереоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЦБ.НомерСтроки КАК НомерСтроки,
		|	_ТаблицаЦБ.Рынок КАК Рынок,
		|	_ТаблицаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ТаблицаЦБ.Партия КАК Партия,
		|	_ТаблицаЦБ.СтрокаПартии КАК СтрокаПартии,
		|	_ТаблицаЦБ.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ТаблицаЦБ.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ПроверяемыеБумаги
		|ИЗ
		|	_ТаблицаЦБ КАК _ТаблицаЦБ
		|ГДЕ
		|	_ТаблицаЦБ.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи))
		|	И НЕ _ТаблицаЦБ.ЦеннаяБумага В (&ИсключаемыеБумаги)
		|	И НЕ(&ИсключатьБумагиОцениваемыеПоАС
		|				И _ТаблицаЦБ.УчетныйАктивЕПС В ИЕРАРХИИ (&УчетныеАктивыОцениваемыеПоАС))
		|	И (НЕ &ИсключатьПартииРЕПОиТПлюс
		|			ИЛИ НЕ(ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.Партия) = ТИП(Документ.СделкаРЕПО)
		|					ИЛИ ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.Партия) = ТИП(Документ.Сделка)
		|						И ВЫРАЗИТЬ(_ТаблицаЦБ.Партия КАК Документ.Сделка).ОтложенноеИсполнение))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия КАК Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	НАЧАЛОПЕРИОДА(ВводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаВвода,
		|	НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, ДЕНЬ) КАК ДатаПокупки,
		|	ВводЦенныхБумагЦенныеБумаги.ЦенаКотировки КАК Цена,
		|	ВводЦенныхБумагЦенныеБумаги.ДатаЦены КАК ДатаЦены,
		|	ВводЦенныхБумагЦенныеБумаги.ВидЦены КАК ВидЦены,
		|	ВводЦенныхБумагЦенныеБумаги.УровеньОценки КАК УровеньОценки,
		|	ВводЦенныхБумагЦенныеБумаги.Источник КАК Источник
		|ПОМЕСТИТЬ _ВведенныеБумаги
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг КАК ВводЦенныхБумаг
		|		ПО _ПроверяемыеБумаги.Партия = ВводЦенныхБумаг.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия КАК Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ИсполнениеОбязательствПоСделке.Основание КАК Сделка,
		|	НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО _ПроверяемыеБумаги.Партия = ИсполнениеОбязательствПоСделке.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	ПоставкаЦенныхБумаг.Основание,
		|	НАЧАЛОПЕРИОДА(ПоставкаЦенныхБумаг.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО _ПроверяемыеБумаги.Партия = ПоставкаЦенныхБумаг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = ПоставкаЦенныхБумагЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = ПоставкаЦенныхБумагЦенныеБумаги.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	_ПроверяемыеБумаги.Партия,
		|	НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _ПроверяемыеБумаги.Партия = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = СделкаЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = СделкаЦенныеБумаги.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПроверяемыеБумаги.ЦеннаяБумага,
		|	_ПроверяемыеБумаги.Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии,
		|	_ПроверяемыеБумаги.Партия,
		|	НАЧАЛОПЕРИОДА(СделкаРЕПО.Дата, ДЕНЬ)
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО _ПроверяемыеБумаги.Партия = СделкаРЕПО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО _ПроверяемыеБумаги.Партия = СделкаЦенныеБумаги.Ссылка
		|			И _ПроверяемыеБумаги.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|			И _ПроверяемыеБумаги.СтрокаПартии = СделкаЦенныеБумаги.СтрокаПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ВведенныеБумаги.ЦеннаяБумага,
		|	_ВведенныеБумаги.Партия,
		|	_ВведенныеБумаги.СтрокаПартии,
		|	_ВведенныеБумаги.Партия,
		|	_ВведенныеБумаги.ДатаПокупки
		|ИЗ
		|	_ВведенныеБумаги КАК _ВведенныеБумаги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыИЦеныПокупки.Партия КАК Партия,
		|	ДатыИЦеныПокупки.СтрокаПартии КАК СтрокаПартии,
		|	ДатыИЦеныПокупки.ЦенаПокупки КАК Цена,
		|	НАЧАЛОПЕРИОДА(ДатыИЦеныПокупки.ДатаПокупки, ДЕНЬ) КАК ДатаЦены,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.ЦенаПриобретения) КАК ВидЦены,
		|	1 КАК УровеньОценки,
		|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Источник
		|ПОМЕСТИТЬ _ДатыИЦеныПокупки
		|ИЗ
		|	&ДатыИЦеныПокупки КАК ДатыИЦеныПокупки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеБумаги.НомерСтроки КАК НомерСтроки,
		|	_ПроверяемыеБумаги.Рынок КАК Рынок,
		|	_ПроверяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПроверяемыеБумаги.ВалютаНоминала КАК ВалютаНоминала,
		|	_ПроверяемыеБумаги.Партия КАК Партия,
		|	_ПроверяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ВЫБОР
		|		КОГДА _Сделки.Дата < &НачалоЗаморозкиСтоимости
		|				ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК КупленоПослеНачалаЗаморозки,
		|	ВЫБОР
		|		КОГДА _Сделки.Дата < &НачалоЗаморозкиСтоимости
		|				ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА &ДатаПоследнихЦен
		|		ИНАЧЕ _Сделки.Дата
		|	КОНЕЦ КАК ДатаОценки,
		|	ВЫБОР
		|		КОГДА _Сделки.Дата < &НачалоЗаморозкиСтоимости
		|				ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЕСТЬNULL(_ВведенныеБумаги.ДатаВвода, &ДатаПоследнихЦен)
		|		ИНАЧЕ _Сделки.Дата
		|	КОНЕЦ КАК ДатаНоминала
		|ПОМЕСТИТЬ _ПодменяемыеБумаги
		|ИЗ
		|	_ПроверяемыеБумаги КАК _ПроверяемыеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Сделки КАК _Сделки
		|		ПО (_Сделки.Партия = _ПроверяемыеБумаги.Партия)
		|			И (_Сделки.СтрокаПартии = _ПроверяемыеБумаги.СтрокаПартии)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВведенныеБумаги КАК _ВведенныеБумаги
		|		ПО (_ВведенныеБумаги.Партия = _ПроверяемыеБумаги.Партия)
		|			И (_ВведенныеБумаги.СтрокаПартии = _ПроверяемыеБумаги.СтрокаПартии)
		|			И (_ВведенныеБумаги.ДатаВвода >= &НачалоЗаморозкиСтоимости)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА _Сделки.Дата < &НачалоЗаморозкиСтоимости
		|					ИЛИ _ПроверяемыеБумаги.Партия = НЕОПРЕДЕЛЕНО
		|				ТОГДА &ДатаПереоценки > &ДатаПоследнихЦен
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПодменяемыеБумаги.НомерСтроки КАК НомерСтроки,
		|	_ПодменяемыеБумаги.Рынок КАК Рынок,
		|	_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПодменяемыеБумаги.Партия КАК Партия,
		|	_ПодменяемыеБумаги.ДатаОценки КАК ДатаОценки,
		|	_ПодменяемыеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ЕСТЬNULL(_ДатыИЦеныПокупки.ДатаЦены, ЕСТЬNULL(_ВведенныеБумаги.ДатаЦены, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.ДатаЦены, СтоимостьПереоценкиПоБумаге.ДатаЦены))) КАК ДатаЦены,
		|	ЕСТЬNULL(_ДатыИЦеныПокупки.Источник, ЕСТЬNULL(_ВведенныеБумаги.Источник, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.Источник, СтоимостьПереоценкиПоБумаге.Источник))) КАК Источник,
		|	ЕСТЬNULL(_ДатыИЦеныПокупки.УровеньОценки, ЕСТЬNULL(_ВведенныеБумаги.УровеньОценки, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.УровеньОценки, СтоимостьПереоценкиПоБумаге.УровеньОценки))) КАК УровеньОценки,
		|	ЕСТЬNULL(_ДатыИЦеныПокупки.ВидЦены, ЕСТЬNULL(_ВведенныеБумаги.ВидЦены, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.ВидЦены, СтоимостьПереоценкиПоБумаге.ВидЦены))) КАК ВидЦены,
		|	ЕСТЬNULL(_ДатыИЦеныПокупки.Цена, ЕСТЬNULL(_ВведенныеБумаги.Цена, ЕСТЬNULL(СтоимостьПереоценкиПоПартии.Цена, СтоимостьПереоценкиПоБумаге.Цена))) КАК Цена,
		|	_ПодменяемыеБумаги.ВалютаНоминала КАК ВалютаКотировки,
		|	НоминалНаДатуЦены.Номинал КАК НоминалНаДатуЦены,
		|	НоминалНаДатуОценки.Номинал КАК НоминалНаДатуОценки
		|ИЗ
		|	_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыИЦеныПокупки КАК _ДатыИЦеныПокупки
		|		ПО (_ДатыИЦеныПокупки.Партия = _ПодменяемыеБумаги.Партия)
		|			И (_ДатыИЦеныПокупки.СтрокаПартии = _ПодменяемыеБумаги.СтрокаПартии)
		|			И (_ПодменяемыеБумаги.КупленоПослеНачалаЗаморозки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВведенныеБумаги КАК _ВведенныеБумаги
		|		ПО (_ВведенныеБумаги.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (_ВведенныеБумаги.Партия = _ПодменяемыеБумаги.Партия)
		|			И (_ВведенныеБумаги.СтрокаПартии = _ПодменяемыеБумаги.СтрокаПартии)
		|			И (_ВведенныеБумаги.ДатаВвода >= &НачалоЗаморозкиСтоимости)
		|			И (_ДатыИЦеныПокупки.Цена ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиПоПартии
		|		ПО (СтоимостьПереоценкиПоПартии.Организация = &Организация)
		|			И (СтоимостьПереоценкиПоПартии.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СтоимостьПереоценкиПоПартии.ЦельРасчета = &ЦельРасчета)
		|			И (СтоимостьПереоценкиПоПартии.ВидЦеныОценки = &ВидЦеныОценки)
		|			И (СтоимостьПереоценкиПоПартии.Рынок = _ПодменяемыеБумаги.Рынок)
		|			И (СтоимостьПереоценкиПоПартии.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (СтоимостьПереоценкиПоПартии.Партия = _ПодменяемыеБумаги.Партия)
		|			И (СтоимостьПереоценкиПоПартии.СтрокаПартии = _ПодменяемыеБумаги.СтрокаПартии)
		|			И (СтоимостьПереоценкиПоПартии.Период = _ПодменяемыеБумаги.ДатаОценки)
		|			И (_ВведенныеБумаги.Цена ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценкиПоБумаге
		|		ПО (СтоимостьПереоценкиПоБумаге.Организация = &Организация)
		|			И (СтоимостьПереоценкиПоБумаге.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СтоимостьПереоценкиПоБумаге.ЦельРасчета = &ЦельРасчета)
		|			И (СтоимостьПереоценкиПоБумаге.ВидЦеныОценки = &ВидЦеныОценки)
		|			И (СтоимостьПереоценкиПоБумаге.Рынок = _ПодменяемыеБумаги.Рынок)
		|			И (СтоимостьПереоценкиПоБумаге.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (СтоимостьПереоценкиПоБумаге.Период = _ПодменяемыеБумаги.ДатаОценки)
		|			И (СтоимостьПереоценкиПоБумаге.Партия = НЕОПРЕДЕЛЕНО)
		|			И (СтоимостьПереоценкиПоБумаге.СтрокаПартии = 0)
		|			И (СтоимостьПереоценкиПоПартии.Цена ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалНаДатуОценки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО (НоминалыЦенныхБумаг.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|						И (НоминалыЦенныхБумаг.Период <= &ДатаПереоценки)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПодменяемыеБумаги.ЦеннаяБумага) КАК ДатыИзмененийНоминалаНаДатуОценки
		|			ПО (ДатыИзмененийНоминалаНаДатуОценки.ЦеннаяБумага = НоминалНаДатуОценки.ЦеннаяБумага)
		|				И (ДатыИзмененийНоминалаНаДатуОценки.Период = НоминалНаДатуОценки.Период)
		|		ПО (НоминалНаДатуОценки.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалНаДатуЦены
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ПодменяемыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|				_ПодменяемыеБумаги.ДатаНоминала КАК ДатаНоминала,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_ПодменяемыеБумаги КАК _ПодменяемыеБумаги
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО (НоминалыЦенныхБумаг.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|						И (НоминалыЦенныхБумаг.Период <= _ПодменяемыеБумаги.ДатаНоминала)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПодменяемыеБумаги.ЦеннаяБумага,
		|				_ПодменяемыеБумаги.ДатаНоминала) КАК ДатыИзмененийНоминалаНаДатуЦены
		|			ПО (ДатыИзмененийНоминалаНаДатуЦены.ЦеннаяБумага = НоминалНаДатуЦены.ЦеннаяБумага)
		|				И (ДатыИзмененийНоминалаНаДатуЦены.Период = НоминалНаДатуЦены.Период)
		|		ПО (НоминалНаДатуЦены.ЦеннаяБумага = _ПодменяемыеБумаги.ЦеннаяБумага)
		|			И (ДатыИзмененийНоминалаНаДатуЦены.ДатаНоминала = _ПодменяемыеБумаги.ДатаНоминала)
		|ГДЕ
		|	_ПодменяемыеБумаги.ДатаОценки ЕСТЬ НЕ NULL ");
	
	#КонецОбласти
	
	НачалоЗаморозкиСтоимости = '20220218';
	
	#Область Дата_последних_цен	
	
	ДатаПоследнихЦен = НачалоЗаморозкиСтоимости;
	
	// По письму Волги-Капитал СС берем на 17.02 (#421991)
	
	Если РеквизитыПереоценки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФВолгаКапитал") Тогда
		ДатаПоследнихЦен = '20220217';	
	КонецЕсли;
	
    // Цены на 18.02.2022 в ЕПС у Достойного Будущего неправильные, т.к. СС дали только 28.02,
	// поэтому для него цены на 18.02 не берем

	Если НачалоДня(ЭтотОбъект.Дата) >= '20220228'
		И РеквизитыПереоценки.ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов
		И РеквизитыПереоценки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар")
	Тогда
		ДатаПоследнихЦен = '20220228';
	КонецЕсли;
	
	#КонецОбласти	
	
	// Профсуждения с повышенным приоритетом в приоритете
	
	ИсключаемыеБумаги = РеквизитыПереоценки.ДополнительныеСвойства.ОценкиСтоимости.Скопировать(Новый Структура("ОценкаЦены, ПовышенныйПриоритет", Истина, Истина));
	ИсключаемыеБумаги.Свернуть("ЦеннаяБумага");
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ТаблицаСтоимостейЦБ, ЭтотОбъект.СчетДоверительногоУправления, НачалоДня(ЭтотОбъект.Дата)).Выгрузить();   	
		
	ИспользуетсяОценкаПоАмортизированнойСтоимости = РаботаСПереоценкой.ИспользуетсяОценкаПоАмортизированнойСтоимости(РеквизитыПереоценки.ВариантРасчетаОценочнойСтоимости, ЭтотОбъект.Дата);	
	УчетныеАктивыОцениваемыеПоАС				  = ?(ИспользуетсяОценкаПоАмортизированнойСтоимости, Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости(), Неопределено);
	
	// Сургутнефтегаз не применяет послабления для бумаг по РЕПО (#424568)
	
	ИсключатьПартииРЕПОиТПлюс = 
		РеквизитыПереоценки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сургутнефтегаз")
			И РеквизитыПереоценки.ЦельРасчета <> Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
	
	ЗапросПодмен.УстановитьПараметр("НачалоЗаморозкиСтоимости",				НачалоЗаморозкиСтоимости);
	ЗапросПодмен.УстановитьПараметр("ДатаПоследнихЦен",						ДатаПоследнихЦен);
	ЗапросПодмен.УстановитьПараметр("КонецДняПереоценкиГраницаВключая",		Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));	
	ЗапросПодмен.УстановитьПараметр("ДатаПереоценки",						НачалоДня(ЭтотОбъект.Дата));	
	ЗапросПодмен.УстановитьПараметр("Организация",							ЭтотОбъект.Организация);
	ЗапросПодмен.УстановитьПараметр("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);
	ЗапросПодмен.УстановитьПараметр("ЦельРасчета",							ЭтотОбъект.ЦельРасчета);
	ЗапросПодмен.УстановитьПараметр("ВидЦеныОценки",						Перечисления.ВидыЦенОценки.ЦенаОценки);
	ЗапросПодмен.УстановитьПараметр("СтоимостиПереоценки",					ТаблицаСтоимостейЦБ);
	ЗапросПодмен.УстановитьПараметр("ДатыИЦеныПокупки",						ДатыИЦеныПокупки);
	
	ЗапросПодмен.УстановитьПараметр("ИсключатьБумагиОцениваемыеПоАС",		ИспользуетсяОценкаПоАмортизированнойСтоимости);
	ЗапросПодмен.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАС",			УчетныеАктивыОцениваемыеПоАС);
	ЗапросПодмен.УстановитьПараметр("ИсключаемыеБумаги",					ИсключаемыеБумаги);
	ЗапросПодмен.УстановитьПараметр("ИсключатьПартииРЕПОиТПлюс",			ИсключатьПартииРЕПОиТПлюс);
	
	ВыборкаПодмен = ЗапросПодмен.Выполнить().Выбрать();
	
	ВыполнитьПодменуЦен(ТаблицаСтоимостейЦБ, ВыборкаПодмен, ПересчитыватьСуммы, Отказ, РеквизитыПереоценки);
	
	#Область Учет_изменения_дисконт_премии
	
	// Цены Сургутнефтегаза нужно корректировать на изменения дисконта/премии с 09.03 (#424568)
	
	Если ПересчитыватьСуммы
		И РеквизитыПереоценки.Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сургутнефтегаз")
		И РеквизитыПереоценки.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении
	Тогда
		
		РаспределитьПогрешностиОкругленияСуммНаПартии(ТаблицаСтоимостейЦБ, РеквизитыПереоценки.НастройкиОценки, РеквизитыПереоценки.ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета, Отказ);
		
		// Проверяем дату запрета редактирования партий:
		// а) если дата запрета стоит (контроль СЧА прошлых периодов), то берем остатки на дату оценки из регистра;
		// б) иначе берем остатки на дату запрета партий, рассчитываем партии до даты оценки (полный расчет всех сумм) и корректируем полученные остатки с учетом рассчитанных движений.		
		
		НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);

		Облигации = ТаблицаСтоимостейЦБ.Скопировать(Новый Структура("Рынок", Перечисления.РынкиЦенныхБумаг.Облигации), "ЦеннаяБумага");
		Облигации.Свернуть("ЦеннаяБумага");
		Облигации = Облигации.ВыгрузитьКолонку(0);
		
		ОтборДатЗапрета = Новый Структура("Организация, СчетДоверительногоУправления, ГруппаЗапрета, ВидУчета",
			ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Перечисления.ГруппыЗапретаРедактирования.Партии, ЭтотОбъект.ВидУчета);
			
		ДатыЗапретаРедактированияПартий = РегистрыСведений.ДатыЗапретаРедактирования.ПолучитьДатыЗапретаРедактирования(ОтборДатЗапрета);
		ДатаЗапретаРедактированияПартий = ?(ДатыЗапретаРедактированияПартий.Количество() > 0, ДатыЗапретаРедактированияПартий[0].ДатаЗапретаРедактирования, '00010101');
				
		Если КонецДня(ДатаЗапретаРедактированияПартий) >= КонецДня(ЭтотОбъект.Дата) Тогда
			
			#Область Получение_остатков_партий_из_регистра	
			
			ЗапросПоследнейПереоценки = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухПартииЦенныхБумаг.Партия КАК Партия,
				|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииЦенныхБумаг.Период КАК Период,
				|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчетаКонечныйОстаток КАК СтоимостьВВалютеУчета,
				|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчетаКонечныйОстаток КАК ПереоценкаВВалютеУчета,
				|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчетаКонечныйОстаток КАК БалансовыеДисконтПремия,
				|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумаг.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ) КАК ПродававшиесяСегодня
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			ДЕНЬ,
				|			ДвиженияИГраницыПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = &ВидУчета
				|				И Рынок = &Рынок
				|				И ЦеннаяБумага В (&ЦенныеБумаги)) КАК БухПартииЦенныхБумаг
				|ГДЕ
				|	(БухПартииЦенныхБумаг.СтоимостьВВалютеУчетаОборот <> 0
				|			ИЛИ БухПартииЦенныхБумаг.ПереоценкаВВалютеУчетаОборот <> 0
				|			ИЛИ БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчетаОборот <> 0)
				|
				|УПОРЯДОЧИТЬ ПО
				|	БухПартииЦенныхБумаг.Партия,
				|	БухПартииЦенныхБумаг.СтрокаПартии,
				|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
				|	БухПартииЦенныхБумаг.Период УБЫВ");
			
			ЗапросПоследнейПереоценки.УстановитьПараметр("НачалоПериода",					'20220310');
			ЗапросПоследнейПереоценки.УстановитьПараметр("КонецПериода",					КонецДня(ЭтотОбъект.Дата));
			ЗапросПоследнейПереоценки.УстановитьПараметр("Организация",						ЭтотОбъект.Организация);
			ЗапросПоследнейПереоценки.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
			ЗапросПоследнейПереоценки.УстановитьПараметр("ВидУчета",						ЭтотОбъект.ВидУчета);
			ЗапросПоследнейПереоценки.УстановитьПараметр("Рынок",							Перечисления.РынкиЦенныхБумаг.Облигации);
			ЗапросПоследнейПереоценки.УстановитьПараметр("ЦенныеБумаги",					Облигации);
			
			ПоследниеПереоценки = ЗапросПоследнейПереоценки.Выполнить().Выгрузить();
			ПоследниеПереоценки.Индексы.Добавить("Партия, СтрокаПартии, УчетныйАктивЕПС");
			
			#КонецОбласти
			
		Иначе
			
			#Область Расчет_остатков_партий
			
			НастройкиВидаУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
				КонецДня(ЭтотОбъект.Дата), ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета, Отказ);
			
			ПараметрыРасчетаПартий = Новый Структура;
			ПараметрыРасчетаПартий.Вставить("Организация", 					ЭтотОбъект.Организация);
			ПараметрыРасчетаПартий.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			ПараметрыРасчетаПартий.Вставить("ВидУчета", 					ЭтотОбъект.ВидУчета);
			ПараметрыРасчетаПартий.Вставить("НачалоПериода", 				НачалоДня(ДатаЗапретаРедактированияПартий) + 86400);
			ПараметрыРасчетаПартий.Вставить("КонецПериода", 				КонецДня(ЭтотОбъект.Дата));
			ПараметрыРасчетаПартий.Вставить("ТаблицаПлановыхОпераций", 		Неопределено);
			ПараметрыРасчетаПартий.Вставить("ОбъектДокумента", 				ЭтотОбъект);
			ПараметрыРасчетаПартий.Вставить("НастройкиПоВидуУчета", 		НастройкиВидаУчета);
			ПараметрыРасчетаПартий.Вставить("КоличественныйРасчет", 		Ложь);		
			
			РасчетПартий = РаботаСПереоценкой.ДинамическийРасчетПартий(ПараметрыРасчетаПартий, Ложь);
			
			// Получаем конечные остатки
			
			ЗапросПоследнейПереоценки = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухПартииЦенныхБумаг.Партия КАК Партия,
				|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчетаОстаток КАК СтоимостьВВалютеУчета,
				|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета,
				|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчетаОстаток КАК БалансовыеДисконтПремия,
				|	ЛОЖЬ КАК ПродававшиесяСегодня
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = &ВидУчета
				|				И Рынок = &Рынок
				|				И ЦеннаяБумага В (&ЦенныеБумаги)) КАК БухПартииЦенныхБумаг");
			
			ЗапросПоследнейПереоценки.УстановитьПараметр("КонецПериода",					Новый Граница(КонецДня(ДатаЗапретаРедактированияПартий), ВидГраницы.Включая));
			ЗапросПоследнейПереоценки.УстановитьПараметр("Организация",						ЭтотОбъект.Организация);
			ЗапросПоследнейПереоценки.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
			ЗапросПоследнейПереоценки.УстановитьПараметр("ВидУчета",						ЭтотОбъект.ВидУчета);
			ЗапросПоследнейПереоценки.УстановитьПараметр("Рынок",							Перечисления.РынкиЦенныхБумаг.Облигации);
			ЗапросПоследнейПереоценки.УстановитьПараметр("ЦенныеБумаги",					Облигации);
			
			ПоследниеПереоценки = ЗапросПоследнейПереоценки.Выполнить().Выгрузить();
			ПоследниеПереоценки.Индексы.Добавить("Партия, СтрокаПартии, УчетныйАктивЕПС");			
			
			Для каждого ДвижениеПереоценки Из РасчетПартий.РассчитанныеПартии Цикл
			
				Если ЗначениеЗаполнено(ДвижениеПереоценки.Регистратор)
					И Не (ДвижениеПереоценки.СтоимостьВВалютеУчета = 0 И ДвижениеПереоценки.ПереоценкаВВалютеУчета = 0 И ДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета = 0)
				Тогда
					
					ПоследняяПереоценка = ПоследниеПереоценки.НайтиСтроки(Новый Структура("Партия, СтрокаПартии, УчетныйАктивЕПС", ДвижениеПереоценки.Партия, ДвижениеПереоценки.СтрокаПартии, ДвижениеПереоценки.УчетныйАктивЕПС));
					
					Если ПоследняяПереоценка.Количество() > 0 Тогда
						
						ПоследняяПереоценка = ПоследняяПереоценка[0];
						
						ЗнакДвижения = ?(ДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Расход, -1, 1);
						
						ПоследняяПереоценка.СтоимостьВВалютеУчета	= ПоследняяПереоценка.СтоимостьВВалютеУчета + ЗнакДвижения * ДвижениеПереоценки.СтоимостьВВалютеУчета;
						ПоследняяПереоценка.ПереоценкаВВалютеУчета	= ПоследняяПереоценка.ПереоценкаВВалютеУчета + ЗнакДвижения * ДвижениеПереоценки.ПереоценкаВВалютеУчета;
						ПоследняяПереоценка.БалансовыеДисконтПремия	= ПоследняяПереоценка.БалансовыеДисконтПремия + ЗнакДвижения * ДвижениеПереоценки.ДисконтПремияНачисленныйВВалютеУчета;
						
						Если НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии
							И НачалоДня(ДвижениеПереоценки.Период) = НачалоДня(ЭтотОбъект.Дата)
							И ДвижениеПереоценки.ВидДвижения = Перечисления.ВидыДвижений.Расход
							И ДвижениеПереоценки.Количество <> 0
							И Не (ТипЗнч(ДвижениеПереоценки.Регистратор) = Тип("ДокументСсылка.ВыводЦенныхБумаг")
								И НастройкиУчетаОбщие.НеСчитатьВводыВыводыЦенныхБумагОперациямиДляНачисленияПроцентногоДохода)
						Тогда
							ПоследняяПереоценка.ПродававшиесяСегодня = Истина;
						КонецЕсли;

					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла; 
			
			#КонецОбласти
			
		КонецЕсли;		
		
		// Расчет изменения дисконт/премии
		
		Для Каждого СтрокаЦенныеБумаги Из ТаблицаСтоимостейЦБ Цикл 		
			
			НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
				НастройкиУчетаОбщие,
				СтрокаЦенныеБумаги.ЦеннаяБумага,
				СтрокаЦенныеБумаги.УчетныйАктивЕПС,
				СтрокаЦенныеБумаги.Партия,
				СтрокаЦенныеБумаги.СтрокаПартии);
			
			Если ИсключаемыеБумаги.Найти(СтрокаЦенныеБумаги.ЦеннаяБумага) <> Неопределено Тогда // Профсуждения с повышенным приоритетом в приоритете
				Продолжить;
			КонецЕсли;
			
			// Строка покупки
			
			СтрокиПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("Партия, СтрокаПартии", СтрокаЦенныеБумаги.Партия, СтрокаЦенныеБумаги.СтрокаПартии));
			
			Если СтрокиПокупки.Количество() = 0 Тогда
				Продолжить;	
			Иначе
				СтрокаПокупки = СтрокиПокупки[0];		
			КонецЕсли;
			
			// Последняя переоценка
			
			ПоследняяПереоценка = ПоследниеПереоценки.НайтиСтроки(Новый Структура("Партия, СтрокаПартии, УчетныйАктивЕПС", СтрокаЦенныеБумаги.Партия, СтрокаЦенныеБумаги.СтрокаПартии, СтрокаЦенныеБумаги.УчетныйАктивЕПС));
			
			Если ПоследняяПереоценка.Количество() = 0 Тогда
				
				РасчетОтПереоценки		= Ложь;
				БалансовыеДисконтПремия	= Неопределено;
				
			Иначе
				
				РасчетОтПереоценки		= Истина;
				ПоследняяПереоценка		= ПоследняяПереоценка[0];
				БалансовыеДисконтПремия	= ПоследняяПереоценка.БалансовыеДисконтПремия;
				
				Если СтрокаЦенныеБумаги.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации И СтрокаЦенныеБумаги.ЦеннаяБумага.ИндексируемыйНоминал Тогда
					РасчетОтПереоценки = Ложь; // Не знаю, что с этим поделать
				КонецЕсли;
				
			КонецЕсли;	
				
			// Текущие дисконт/премия
			ДанныеПереоценки = Новый Структура;
			ДанныеПереоценки.Вставить("ДатаПереоценки", КонецДня(ЭтотОбъект.Дата));
			ДанныеПереоценки.Вставить("Количество", СтрокаЦенныеБумаги.Количество);
			ДанныеПереоценки.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			ДанныеПереоценки.Вставить("УчетныйАктивЕПС", СтрокаЦенныеБумаги.УчетныйАктивЕПС);
			
			ДанныеПокупки = Новый Структура;
			ДанныеПокупки.Вставить("НачальныйДисконт", СтрокаПокупки.НачальныйДисконт);
			ДанныеПокупки.Вставить("ДатаПокупки", СтрокаПокупки.ДатаПокупки);
			ДанныеПокупки.Вставить("ЦенаПокупки", СтрокаПокупки.ЦенаПокупки);
			
			РасчетДисконтПремии = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремии(СтрокаЦенныеБумаги.ЦеннаяБумага, НастройкиУчетаЦеннойБумаги, ДанныеПереоценки, ДанныеПокупки, Отказ);
				
			ОценочныеДисконтПремия = Окр(РасчетДисконтПремии.ОценочныеДисконтПремия, 2);
			
			Если БалансовыеДисконтПремия <> Неопределено И СтрокаПокупки.НачальныйДисконт > 0 И ОценочныеДисконтПремия > БалансовыеДисконтПремия	// недосписали премии
				ИЛИ БалансовыеДисконтПремия <> Неопределено И СтрокаПокупки.НачальныйДисконт < 0 И ОценочныеДисконтПремия < БалансовыеДисконтПремия	// недоначислили дисконта
			Тогда
				ОценочныеДисконтПремия = БалансовыеДисконтПремия;	
			КонецЕсли;
			
			// Учет изменения дисконт/премии
			
			Если РасчетОтПереоценки Тогда
				
				Если НастройкиУчетаОбщие.УтреннееНачислениеДисконтаПремии И ПоследняяПереоценка.ПродававшиесяСегодня Тогда
					ОценочныеДисконтПремия = БалансовыеДисконтПремия; // Не нужно начислять дисконт/премию по тем бумагам и партиям, которые сегодня продавались - все уже начислено
				КонецЕсли;
				
				СтрокаЦенныеБумаги.Сумма = ПоследняяПереоценка.СтоимостьВВалютеУчета + ПоследняяПереоценка.ПереоценкаВВалютеУчета + ОценочныеДисконтПремия;
				
			Иначе
				
				// Балансовые дисконт/премия:
				// - на 09.03.2022 для бумаг, купленных до 09.03.2022
				// - на дату покупки - для бумаг, купленных после 09.03.2022
				
				ДатаБалансовыхДисконтПремия = ?(СтрокаПокупки.ДатаПокупки < '20220309', '20220309', СтрокаПокупки.ДатаПокупки);  
				
				// Текущие дисконт/премия
				ДанныеПереоценки = Новый Структура;
				ДанныеПереоценки.Вставить("ДатаПереоценки", КонецДня(ДатаБалансовыхДисконтПремия));
				ДанныеПереоценки.Вставить("Количество", СтрокаЦенныеБумаги.Количество);
				ДанныеПереоценки.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
				ДанныеПереоценки.Вставить("УчетныйАктивЕПС", СтрокаЦенныеБумаги.УчетныйАктивЕПС);
				
				ДанныеПокупки = Новый Структура;
				ДанныеПокупки.Вставить("НачальныйДисконт", СтрокаПокупки.НачальныйДисконт);
				ДанныеПокупки.Вставить("ДатаПокупки", СтрокаПокупки.ДатаПокупки);
				ДанныеПокупки.Вставить("ЦенаПокупки", СтрокаПокупки.ЦенаПокупки);
				
				РасчетБалансовыхДисконтПремии = БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремии(СтрокаЦенныеБумаги.ЦеннаяБумага, НастройкиУчетаЦеннойБумаги, ДанныеПереоценки, ДанныеПокупки, Отказ);
				
				БалансовыеДисконтПремия	= Окр(РасчетБалансовыхДисконтПремии.ОценочныеДисконтПремия, 2);
				
				СтрокаЦенныеБумаги.Сумма = СтрокаЦенныеБумаги.Сумма + (ОценочныеДисконтПремия - БалансовыеДисконтПремия);
				
			КонецЕсли;
			
			СтрокаЦенныеБумаги.СуммаВВалютеУчета	= СтрокаЦенныеБумаги.Сумма;
			СтрокаЦенныеБумаги.Цена					= СтрокаЦенныеБумаги.Сумма / СтрокаЦенныеБумаги.Количество;
			СтрокаЦенныеБумаги.ЦенаКотировки		= СтрокаЦенныеБумаги.Цена;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	#КонецОбласти	
	
КонецПроцедуры

Процедура ВыполнитьПодменуЦен(ТаблицаСтоимостейЦБ, ВыборкаПодмен, ПересчитыватьСуммы, Отказ, РеквизитыПереоценки = Неопределено)

	// Заполняем вспомогательные при пересчете сумм реквизиты
	
	Если ПересчитыватьСуммы И РеквизитыПереоценки <> Неопределено Тогда
		ВалютаУчета = РеквизитыПереоценки.Организация.ВалютаУчета;	
	КонецЕсли;
	
	// Выполняем замену и пересчет сумм
	
	ТаблицаСтоимостейЦБ.Индексы.Добавить("НомерСтроки");
	
	Пока ВыборкаПодмен.Следующий() Цикл
		
		// Проверка, что все данные получены
		
		ОшибкаПодмены = Ложь;
		
		Если ВыборкаПодмен.Цена = NULL Тогда
		    ТекстОшибки = СтрШаблон("Не удалось определить цену '%1' на %2",
				ВыборкаПодмен.ЦеннаяБумага, Формат(ВыборкаПодмен.ДатаОценки, "ДФ=dd.MM.yyyy")); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , ОшибкаПодмены);
		КонецЕсли;
		
		Если ВыборкаПодмен.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации
			И (ВыборкаПодмен.НоминалНаДатуОценки = NULL ИЛИ ВыборкаПодмен.НоминалНаДатуЦены = NULL)
		Тогда
		    ТекстОшибки = СтрШаблон("Не удалось определить номинал '%1' на %2",
				ВыборкаПодмен.ЦеннаяБумага, Формат(?(ВыборкаПодмен.НоминалНаДатуЦены = NULL, ВыборкаПодмен.ДатаОценки, ЭтотОбъект.Дата), "ДФ=dd.MM.yyyy")); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , ОшибкаПодмены);
		КонецЕсли;
		
		// Подмена цен и перерасчет сумм
		
		СтрокаТабличнойЧасти = ТаблицаСтоимостейЦБ.Найти(ВыборкаПодмен.НомерСтроки, "НомерСтроки");
		
		Если ОшибкаПодмены Тогда
			
			РаботаСПереоценкой.ЗаполнитьСтрокуЦеннойБумагиПриОшибкеРасчетаЦены(СтрокаТабличнойЧасти);
			
		Иначе
		
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаПодмен, "ДатаЦены, Источник, УровеньОценки, ВидЦены, Цена, ВалютаКотировки"); 
			
			Если ВыборкаПодмен.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
				СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * (ВыборкаПодмен.НоминалНаДатуОценки / ВыборкаПодмен.НоминалНаДатуЦены);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ЦенаКотировки = СтрокаТабличнойЧасти.Цена;
		
		Если ПересчитыватьСуммы Тогда
			
			Если СтрокаТабличнойЧасти.ВалютаНоминала = ВалютаУчета Тогда
				
				СтрокаТабличнойЧасти.Сумма				= Окр(СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество, 2);
				СтрокаТабличнойЧасти.СуммаВВалютеУчета	= СтрокаТабличнойЧасти.Сумма;
				
			Иначе
				
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;

				СтрокаТабличнойЧасти.СуммаВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
					Новый Структура("Сумма", СтрокаТабличнойЧасти.Сумма),
					СтрокаТабличнойЧасти.ВалютаНоминала,
					ЭтотОбъект.Организация,
					ЭтотОбъект.Дата,
					?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.КурсВалютыНоминала), СтрокаТабличнойЧасти.КурсВалютыНоминала, Неопределено),
					Отказ).Сумма;

			КонецЕсли;

		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Обновляет стоимости погашенных, но еще не списанных бумаг
//
// Параметры:
//	ТаблицаСтоимостейЦБ - ТаблицаЗначений - таблица ценных бумаг
//	ВариантУчетаПогашенныхБумаг - Строка, варианты:
//  	ОцениватьПоНулевойСтоимостиСВидомЦеныПогашена 	- ЦБ с ценой 0 и видом цены Погашена		
//      ОцениватьПоОстаткуЗадолженности 				- ЦБ ценой пропорционально неоплаченной части номинала, видом цены Номинал
//      СписыватьПриПолномПогашенииВМоментПогашения 	- ЦБ не учитывается в стоимости переоценки с момента начисления задолженности по полному погашению
//      ОцениватьПоБалансовойСтоимости				 	- ЦБ удаляется из таблицы стоимостей, это для цели расчета ЕПС: бумагу не оцениваем, в переоценки идет по балансу
//	Отказ - Булево
//	РасшифровкаРасчета - Структура, Неопределено - расшифровка расчета
//
Процедура ОбновитьСтоимостиПогашенныхБумаг(ТаблицаСтоимостейЦБ, СпособОценкиПогашенныхБумаг, ВестиРасчетПоПартиям, Отказ, РасшифровкаРасчета, ОтборПоТаблицеСтоимостей)
	
	Запрос = Новый Запрос;
	
	#Область Текст_запроса_заблокированных_бумаг
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСтоимостейЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ТаблицаСтоимостейЦБ.Количество КАК Количество
		|ПОМЕСТИТЬ _ТаблицаСтоимостейЦБ
		|ИЗ
		|	&ТаблицаСтоимостейЦБ КАК ТаблицаСтоимостейЦБ
		|ГДЕ
		|	ТаблицаСтоимостейЦБ.Рынок В(&ТипыПогашаемыхЦБ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток КАК КоличествоПогашено,
		|	СУММА(ЕСТЬNULL(_ТаблицаСтоимостейЦБ.Количество, 0)) КАК КоличествоПоДокументу,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала
		|ПОМЕСТИТЬ _Заблокированные
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
		|			&Период,
		|			ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок В (&ТипыПогашаемыхЦБ)
		|				И &ФильтрПоЦеннойБумаге) КАК ОстаткиЦенныхБумагЗаблокированныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаСтоимостейЦБ КАК _ТаблицаСтоимостейЦБ
		|		ПО (_ТаблицаСтоимостейЦБ.ЦеннаяБумага = ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &СписыватьПриПолномПогашенииВМоментПогашения
		|				ТОГДА ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							_ТаблицаСтоимостейЦБ.ЦеннаяБумага
		|						ИЗ
		|							_ТаблицаСтоимостейЦБ)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
		|	КОНЕЦ" + "
		|;";
	
	ТипыПогашаемыхЦБ = Новый Массив;
	ТипыПогашаемыхЦБ.Добавить(Перечисления.РынкиЦенныхБумаг.Облигации);
	ТипыПогашаемыхЦБ.Добавить(Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия);
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоЦеннойБумаге", "ЦеннаяБумага = &ЦеннаяБумага");
		Запрос.УстановитьПараметр("ЦеннаяБумага", РасшифровкаРасчета.ЦеннаяБумага);
	ИначеЕсли ОтборПоТаблицеСтоимостей Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоЦеннойБумаге", "ЦеннаяБумага В (
			|ВЫБРАТЬ 
			|	_ТаблицаСтоимостейЦБ.ЦеннаяБумага 
			|ИЗ 
			|	_ТаблицаСтоимостейЦБ КАК _ТаблицаСтоимостейЦБ)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоЦеннойБумаге", "ИСТИНА");
	КонецЕсли;	
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Период",											Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",									ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",					ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТаблицаСтоимостейЦБ",							ТаблицаСтоимостейЦБ);
	Запрос.УстановитьПараметр("ТипыПогашаемыхЦБ",								ТипыПогашаемыхЦБ);
	Запрос.УстановитьПараметр("ПериодНачалоДня", 								НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("ПериодКонецДня",	 								КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("СписыватьПриПолномПогашенииВМоментПогашения", 	СпособОценкиПогашенныхБумаг = "СписыватьПриПолномПогашенииВМоментПогашения");
	
	Если СпособОценкиПогашенныхБумаг = "ОцениватьПоОстаткуЗадолженности" Тогда
		
		#Область Текст_запроса_оценки_по_остатку_задолженности
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Заблокированные.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Заблокированные.КоличествоПогашено КАК КоличествоПогашено,
			|	_Заблокированные.КоличествоПоДокументу КАК КоличествоПоДокументу,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ОстатокЗадолженности.Сумма, 0) / _Заблокированные.КоличествоПогашено КАК ЧИСЛО(1, 0)) КАК ЦенаКотировки,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ОстатокЗадолженности.Сумма, 0) / _Заблокированные.КоличествоПогашено КАК ЧИСЛО(1, 0)) КАК Цена,
			|	ЕСТЬNULL(ОстатокЗадолженности.Сумма, 0) КАК Сумма,
			|	ЕСТЬNULL(ОстатокЗадолженности.СуммаВВалютеУчета, 0) КАК СуммаВВалютеУчета,
			|	_Заблокированные.ВалютаНоминала КАК ВалютаКотировки,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОстатокЗадолженности.Сумма, 0) = 0
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.Погашена)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.Номинал)
			|	КОНЕЦ КАК ВидЦены,
			|	0 КАК ЦенаКотировкиКупона,
			|	0 КАК ЦенаКупона,
			|	0 КАК СуммаКупона,
			|	0 КАК СуммаКупонаВВалютеУчета,
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКотировкиКупона,
			|	0 КАК УровеньОценки,
			|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Источник,
			|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Курс,
			|	&ПериодНачалоДня КАК ДатаЦены
			|ИЗ
			|	_Заблокированные КАК _Заблокированные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО (КурсыВалют.Валюта = _Заблокированные.ВалютаНоминала)
			|			И (КурсыВалют.Период = &ПериодНачалоДня)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СУММА(ЗадолженностьПоДСОстатки.СуммаОстаток * КурсыВалютОплаты.Курс / КурсыВалютОплаты.Кратность) КАК СуммаВВалютеУчета,
			|			СУММА(ЗадолженностьПоДСОстатки.СуммаОстаток * (КурсыВалютОплаты.Курс * КурсыВалютНоминала.Кратность) / (КурсыВалютНоминала.Курс * КурсыВалютОплаты.Кратность)) КАК Сумма,
			|			ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК ЦеннаяБумага
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|					&Период,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
			|						И Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги) КАК ЗадолженностьПоДСОстатки
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютОплаты
			|				ПО (КурсыВалютОплаты.Валюта = ЗадолженностьПоДСОстатки.Валюта)
			|					И (КурсыВалютОплаты.Период = &ПериодНачалоДня)
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютНоминала
			|				ПО (КурсыВалютНоминала.Валюта = ВЫБОР
			|						КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Облигации)
			|							ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
			|						КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
			|							ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
			|					КОНЕЦ)
			|					И (КурсыВалютНоминала.Период = &ПериодНачалоДня)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ВЫРАЗИТЬ(ЗадолженностьПоДСОстатки.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) КАК ОстатокЗадолженности
			|		ПО _Заблокированные.ЦеннаяБумага = ОстатокЗадолженности.ЦеннаяБумага";
		
		
		ТипЧислаЦенаСоЗнаком = Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦенаСоЗнаком.Тип.КвалификаторыЧисла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(1, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТипЧислаЦенаСоЗнаком.Разрядность, ТипЧислаЦенаСоЗнаком.РазрядностьДробнойЧасти));
		
		#КонецОбласти
		
	Иначе
		
		#Область Текст_запроса_обнуления_стоимости_бумаг
		
		Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_Заблокированные.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_Заблокированные.КоличествоПогашено КАК КоличествоПогашено,
			|	_Заблокированные.КоличествоПоДокументу КАК КоличествоПоДокументу,
			|	0 КАК ЦенаКотировки,
			|	0 КАК Цена,
			|	0 КАК Курс,
			|	0 КАК Сумма,
			|	0 КАК СуммаВВалютеУчета,
			|	_Заблокированные.ВалютаНоминала КАК ВалютаКотировки,
			|	ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.Погашена) КАК ВидЦены,
			|	0 КАК ЦенаКотировкиКупона,
			|	0 КАК ЦенаКупона,
			|	0 КАК СуммаКупона,
			|	0 КАК СуммаКупонаВВалютеУчета,
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКотировкиКупона,
			|	0 КАК УровеньОценки,
			|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Источник,
			|	&ПериодНачалоДня КАК ДатаЦены
			|ИЗ
			|	_Заблокированные КАК _Заблокированные";
		
		#КонецОбласти
		
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ЗаменяемыеПоля = "ЦенаКотировки, Цена, ВалютаКотировки, ВидЦены, ДатаЦены, ЦенаКотировкиКупона, ЦенаКупона, СуммаКупона, СуммаКупонаВВалютеУчета, ВалютаКотировкиКупона, УровеньОценки, Источник";
		
		Если Не (СпособОценкиПогашенныхБумаг = "ОцениватьПоОстаткуЗадолженности" И ВестиРасчетПоПартиям) Тогда
			ЗаменяемыеПоля = ЗаменяемыеПоля + ", Сумма, СуммаВВалютеУчета";
		КонецЕсли;	
		
		ОблигацииНаБалансеСПрошедшимПогашением = Неопределено;
	
		КонтролироватьКоличество = (ЭтотОбъект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении
			И РасшифровкаРасчета = Неопределено); // При расшифровке расчета важна только стоимость
			
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЭтотОбъект.ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов
				И (Выборка.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_ВейлФинанс")
					ИЛИ Выборка.ЦеннаяБумага = ОбщегоНазначения.ПолучитьИменованныйОбъект("Облигация_О1Пропертиз_До2"))
			Тогда
				Продолжить; // Эволюция в ЕПС не считает погашение, продожаем оценивать бумагу по профсуждению, а в СЧА каждый день колотят руками дебиторку #464506
			КонецЕсли;
			
			Если СпособОценкиПогашенныхБумаг = "ОцениватьПоБалансовойСтоимости" Тогда
				
				Если ОблигацииНаБалансеСПрошедшимПогашением = Неопределено Тогда
					ОблигацииНаБалансеСПрошедшимПогашением = БухгалтерскийУчетЕПС.ПолучитьОблигацииНаБалансеСПрошедшимПогашением();
				КонецЕсли;
				
				Если ОблигацииНаБалансеСПрошедшимПогашением.Найти(Выборка.ЦеннаяБумага) = Неопределено Тогда
					НайденныеСтроки = ТаблицаСтоимостейЦБ.НайтиСтроки(Новый Структура("ЦеннаяБумага", Выборка.ЦеннаяБумага));
					Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
						СтрокаТЗ.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.БалансоваяЦена;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли КонтролироватьКоличество
				И (Выборка.КоличествоПогашено <> Выборка.КоличествоПоДокументу
					ИЛИ СпособОценкиПогашенныхБумаг = "СписыватьПриПолномПогашенииВМоментПогашения")
			Тогда
				
				ТекстОшибки = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
					"Ошибка при определении стоимости облигации %1. Количество по документу: %2, погашено: %3%4",
					Выборка.ЦеннаяБумага,
					Выборка.КоличествоПоДокументу,
					Выборка.КоличествоПогашено,
					?(СпособОценкиПогашенныхБумаг = "СписыватьПриПолномПогашенииВМоментПогашения", ". По настройкам учета, ЦБ должна быть списана при погашении", ""));
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,,Отказ);
				
			Иначе
				
				Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
				НайденныеСтроки = ТаблицаСтоимостейЦБ.НайтиСтроки(Новый Структура("ЦеннаяБумага", Выборка.ЦеннаяБумага));
				Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
					
					// Дефолты, установленные профсуждениями, пропускаем в любом случае. 
					// Дефолты, полученные по другим данным, пропускаем только при оценке по остатку задолженности
					Если СтрокаТЗ.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.Дефолт И (СпособОценкиПогашенныхБумаг = "ОцениватьПоОстаткуЗадолженности" 
							Или СтрокаТЗ.Источник = Клиент И ЭтотОбъект.Дата >= '20250101') Тогда
						Продолжить; 
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка, ЗаменяемыеПоля);
					Если ВестиРасчетПоПартиям Тогда
						СтрокаТЗ.Сумма 				= СтрокаТЗ.Количество * Выборка.Цена;
						СтрокаТЗ.СуммаВВалютеУчета 	= СтрокаТЗ.Количество * Выборка.Цена * Выборка.Курс;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
	 
		КонецЦикла;
		
		// Добавим расшифровку расчета
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, , "Погашенные, но еще не списанные бумаги", РезультатЗапроса.Выгрузить());	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПустаяТаблицаСтоимостей()

	МетаданныеСтоимостиПереоценки = Метаданные.Документы.РегистрацияСтоимостиПереоценки.ТабличныеЧасти.СтоимостиПереоценки.Реквизиты;
	
	ТаблицаСтоимостей = Новый ТаблицаЗначений;
	
	ТаблицаСтоимостей.Колонки.Добавить("Рынок",				МетаданныеСтоимостиПереоценки.Рынок.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("ЦеннаяБумага",		МетаданныеСтоимостиПереоценки.ЦеннаяБумага.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("ВидЦены",			МетаданныеСтоимостиПереоценки.ВидЦены.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("ВалютаКотировки",	МетаданныеСтоимостиПереоценки.ВалютаКотировки.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("Стоимость",			МетаданныеСтоимостиПереоценки.Цена.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("ДатаЦены",			МетаданныеСтоимостиПереоценки.ДатаЦены.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("УровеньОценки",		МетаданныеСтоимостиПереоценки.УровеньОценки.Тип);
	ТаблицаСтоимостей.Колонки.Добавить("Источник",			МетаданныеСтоимостиПереоценки.Источник.Тип);
	
	Возврат ТаблицаСтоимостей;
	
КонецФункции

Функция ПолучитьТаблицуСтоимостейИзФайла(АдресФайла, СообщатьПриОшибкахПоиска = Истина)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда		
		ПутьКФайлу				= ПолучитьИмяВременногоФайла("xml");
		УдалитьФайлПослеЧтения	= Истина;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
		ДвоичныеДанные.Записать(ПутьКФайлу);
	Иначе
		ПутьКФайлу				= АдресФайла;
		УдалитьФайлПослеЧтения	= Ложь;
		
		ОписаниеФайла = Новый Файл(ПутьКФайлу);
		Если Не ОписаниеФайла.Существует() ИЛИ Не ОписаниеФайла.ЭтоФайл() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при загрузке стоимостей ценных бумаг из файла клиента: некорректный путь или ошибка доступа к файлу " + ПутьКФайлу);
			Возврат Неопределено;	
		КонецЕсли;
	КонецЕсли;
	
	ДанныеФайла = Новый ТаблицаЗначений;
	ДанныеФайла.Колонки.Добавить("ISIN",			Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	ДанныеФайла.Колонки.Добавить("Стоимость",		Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦенаСоЗнаком.Тип);
	ДанныеФайла.Колонки.Добавить("УровеньОценки",	Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10)));
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);

	ПостроительDOM	= Новый ПостроительDOM;
	ДокументDOM		= ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();

	Если УдалитьФайлПослеЧтения Тогда
		УдалитьФайлы(ПутьКФайлу);
	КонецЕсли;	
	
	Элемент			= ДокументDOM.ЭлементДокумента;
	Разыменователь	= Новый РазыменовательПространствИменDOM(Элемент);
	ВыборкаXPath	= ДокументDOM.ВычислитьВыражениеXPath("//СправедливаяСтоимость[@Дата=""" + Формат(ЭтотОбъект.Дата, "ДФ=yyyy-MM-ddT00:00:00") + """]/ЦеннаяБумага", Элемент, Разыменователь);

	Пока Истина Цикл

		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		
		Если ЭлементDOM = Неопределено Тогда
			Прервать;
		КонецЕсли; 
		
		СтрокаТаблицы = ДанныеФайла.Добавить();
		
		Для Каждого Узел Из ЭлементDOM.ДочерниеУзлы Цикл
			
			Если Узел.ИмяУзла = "ISIN" Тогда
				СтрокаТаблицы.ISIN = Узел.ТекстовоеСодержимое;
			ИначеЕсли Узел.ИмяУзла = "СС" Тогда
				СтрокаТаблицы.Стоимость = Узел.ТекстовоеСодержимое;
			ИначеЕсли Узел.ИмяУзла = "Уровень" Тогда
				СтрокаТаблицы.УровеньОценки = Узел.ТекстовоеСодержимое;
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;
	
	Если ДанныеФайла.Количество() = 0 И СообщатьПриОшибкахПоиска Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при загрузке стоимостей ценных бумаг из файла клиента: не обнаружены данные на " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy"));
		Возврат Неопределено;	
	КонецЕсли;
	
	// Подготовим таблицу стоимостей
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаХМЛ.ISIN КАК ISIN,
		|	ТаблицаХМЛ.Стоимость КАК Стоимость,
		|	ТаблицаХМЛ.УровеньОценки КАК УровеньОценки
		|ПОМЕСТИТЬ _ТаблицаХМЛ
		|ИЗ
		|	&ТаблицаСтоимостей КАК ТаблицаХМЛ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ISIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КодыISIN.Объект, ЕСТЬNULL(КраткиеКодыНаММВБ.Объект, НЕОПРЕДЕЛЕНО)) КАК ЦеннаяБумага,
		|	_ТаблицаХМЛ.ISIN КАК ISIN,
		|	_ТаблицаХМЛ.Стоимость КАК Стоимость,
		|	_ТаблицаХМЛ.УровеньОценки КАК УровеньОценки
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ТаблицаХМЛ КАК _ТаблицаХМЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыISIN
		|		ПО _ТаблицаХМЛ.ISIN = КодыISIN.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)) КАК КраткиеКодыНаММВБ
		|		ПО _ТаблицаХМЛ.ISIN = КраткиеКодыНаММВБ.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.ISIN КАК ISIN,
		|	_ЦенныеБумаги.Стоимость КАК Стоимость,
		|	_ЦенныеБумаги.УровеньОценки КАК УровеньОценки,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.СредневзвешеннаяЦена) КАК ВидЦены,
		|	КлиентыДоверительногоУправления.Клиент КАК Источник,
		|	&Период КАК ДатаЦены,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|	КОНЕЦ КАК Рынок,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).Валюта
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
		|	КОНЕЦ КАК ВалютаКотировки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправления
		|		ПО (ИСТИНА)
		|ГДЕ
		|	_ЦенныеБумаги.ЦеннаяБумага <> НЕОПРЕДЕЛЕНО");
		
	Запрос.УстановитьПараметр("Период",							НачалоДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТаблицаСтоимостей",				ДанныеФайла);
	
	ТаблицаСтоимостей = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаСтоимостей;
		
КонецФункции

Функция ЕстьАктивыПоАС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспределенияАктивовЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РаспределенияАктивовЕПС.Сделка КАК Сделка,
		|	РаспределенияАктивовЕПС.Сделка.Дата КАК СделкаДата,
		|	РаспределенияАктивовЕПС.Сделка.ОтложенноеИсполнение КАК СделкаОтложенноеИсполнение,
		|	РаспределенияАктивовЕПС.Сделка.ДатаИсполнения КАК СделкаДатаИсполнения
		|ПОМЕСТИТЬ _Распределения
		|ИЗ
		|	РегистрСведений.РаспределенияАктивовЕПС КАК РаспределенияАктивовЕПС
		|ГДЕ
		|	РаспределенияАктивовЕПС.Организация = &Организация
		|	И РаспределенияАктивовЕПС.Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РаспределенияАктивовЕПС.Рынок = &Рынок
		|	И РаспределенияАктивовЕПС.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|	И РаспределенияАктивовЕПС.Сделка.Дата <= &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_Распределения.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Распределения.Сделка КАК Сделка,
		|	_Распределения.СделкаДата КАК СделкаДата,
		|	_Распределения.СделкаОтложенноеИсполнение КАК СделкаОтложенноеИсполнение,
		|	_Распределения.СделкаДатаИсполнения КАК СделкаДатаИсполнения,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	_Распределения КАК _Распределения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Рынок = &Рынок) КАК ОстаткиЦенныхБумагОстатки
		|		ПО _Распределения.ЦеннаяБумага = ОстаткиЦенныхБумагОстатки.ЦеннаяБумага
		|ГДЕ
		|	(_Распределения.СделкаОтложенноеИсполнение
		|				И _Распределения.СделкаДатаИсполнения > &Период
		|			ИЛИ НЕ ОстаткиЦенныхБумагОстатки.КоличествоОстаток ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Рынок", Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции 

Процедура РаспределитьПогрешностиОкругленияСуммНаПартии(ИтоговаяТаблица, НастройкиОценки, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета, Отказ)
	
	// Порядок определяется в РаботаСПереоценкой.ПолучитьТаблицуКотировок и больше не меняется,
	// но здесь зададим его принудительно, т.к. иногда он почему-то сбивается #438536 #Техдолг
	
	ИтоговаяТаблица.Сортировать("Рынок, ЦеннаяБумага, Партия, СтрокаПартии", Новый СравнениеЗначений);
	
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(ИтоговаяТаблица, "Цена",			Метаданные.РегистрыСведений.СтоимостьПереоценки.Ресурсы.Цена.Тип);
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(ИтоговаяТаблица, "ЦенаКупона",	Метаданные.РегистрыСведений.СтоимостьПереоценки.Ресурсы.ЦенаКупона.Тип);
	РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(ИтоговаяТаблица, "ЦенаКотировки",	Метаданные.РегистрыСведений.СтоимостьПереоценки.Ресурсы.Цена.Тип);
	
	ИтоговаяТаблица.Колонки.Источник.Имя				= "ИсточникЦены";
	ИтоговаяТаблица.Колонки.Цена.Имя					= "ОценочнаяЦена";
	ИтоговаяТаблица.Колонки.Сумма.Имя					= "ОценочнаяСумма";
	ИтоговаяТаблица.Колонки.СуммаВВалютеУчета.Имя		= "ОценочнаяСуммаВВалютеУчета";
	ИтоговаяТаблица.Колонки.ЦенаКупона.Имя				= "ОценочнаяЦенаКупона";
	ИтоговаяТаблица.Колонки.СуммаКупона.Имя				= "ОценочнаяСуммаКупона";
	ИтоговаяТаблица.Колонки.СуммаКупонаВВалютеУчета.Имя	= "ОценочнаяСуммаКупонаВВалютеУчета";

	ОбъектДляРаспределения = Новый Структура("Организация, СчетДоверительногоУправления, Дата, ЦенныеБумаги");
    ЗаполнитьЗначенияСвойств(ОбъектДляРаспределения, ЭтотОбъект, "Организация, СчетДоверительногоУправления, Дата");
    ОбъектДляРаспределения.ЦенныеБумаги = ИтоговаяТаблица;
    
    РаботаСПереоценкой.РаспределитьПогрешностьОкругленияСтоимостиЦенныхБумагНаПартии(
		ОбъектДляРаспределения, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении, НастройкиОценки, Истина, Истина, Отказ, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСумму);

    РаботаСПереоценкой.РаспределитьПогрешностьОкругленияКупонаЦенныхБумагНаПартии(
		ОбъектДляРаспределения, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении, НастройкиОценки, Истина, Истина, Отказ, ВариантыОкругленияВалютныхСуммПриРасчетеСуммВВалютеУчета.ОкруглятьСуммуКупона);
		
	ИтоговаяТаблица.Колонки.ИсточникЦены.Имя						= "Источник";
	ИтоговаяТаблица.Колонки.ОценочнаяЦена.Имя						= "Цена";
	ИтоговаяТаблица.Колонки.ОценочнаяСумма.Имя						= "Сумма";
	ИтоговаяТаблица.Колонки.ОценочнаяСуммаВВалютеУчета.Имя			= "СуммаВВалютеУчета";
	ИтоговаяТаблица.Колонки.ОценочнаяЦенаКупона.Имя					= "ЦенаКупона";
	ИтоговаяТаблица.Колонки.ОценочнаяСуммаКупона.Имя				= "СуммаКупона";
	ИтоговаяТаблица.Колонки.ОценочнаяСуммаКупонаВВалютеУчета.Имя	= "СуммаКупонаВВалютеУчета";	
	
КонецПроцедуры

#КонецОбласти
