
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ЗаполнитьПериодИмпорта();
	ЗначениеВРеквизитФормы(ОбработкаНаСервере, "Объект");
	
	Объект.ЦенныеБумаги.ТипЗначения = Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	КомандаИмпортироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаИмпортироватьНаСервере()
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ИмпортироватьРыночныеРискиНКЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦеннойБумагеПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		Объект.ЦенныеБумаги.Очистить();
	КонецЕсли; 
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(ЭтаФорма)

	ЭтаФорма.Элементы.ЦенныеБумаги.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
