
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СубъектПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоДействияПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УдостоверяющийЦентрПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);
	
КонецПроцедуры
