
Функция ПолучитьУровеньРейтинга(Агентство, Знач Рейтинг) Экспорт
	
	УровеньРейтинга = 0;
	
	ШкалаРейтинговМудис = Новый Соответствие;
	ШкалаРейтинговМудис.Вставить("Aaa",       090);
	ШкалаРейтинговМудис.Вставить("Aa",        080);
	ШкалаРейтинговМудис.Вставить("A",         070);
	ШкалаРейтинговМудис.Вставить("Baa",       060);
	ШкалаРейтинговМудис.Вставить("Ba",        050);
	ШкалаРейтинговМудис.Вставить("B",         040);
	ШкалаРейтинговМудис.Вставить("Caa",       030);
	ШкалаРейтинговМудис.Вставить("Ca",        020);
	ШкалаРейтинговМудис.Вставить("C",         010);
	ШкалаРейтинговМудис.Вставить("Withdrawn", 001);
	ШкалаРейтинговМудис.Вставить("NR",        001);
	
	ШкалаРейтинговФитч = Новый Соответствие;
	ШкалаРейтинговФитч.Вставить("AAA",        100);
	ШкалаРейтинговФитч.Вставить("AA",         090);
	ШкалаРейтинговФитч.Вставить("A",          080);
	ШкалаРейтинговФитч.Вставить("BBB",        070);
	ШкалаРейтинговФитч.Вставить("BB",         060);
	ШкалаРейтинговФитч.Вставить("B",          050);
	ШкалаРейтинговФитч.Вставить("CCC",        040);
	ШкалаРейтинговФитч.Вставить("CC",         030);
	ШкалаРейтинговФитч.Вставить("C",          020);
	ШкалаРейтинговФитч.Вставить("D",          010);
	ШкалаРейтинговФитч.Вставить("RD",         005);
	ШкалаРейтинговФитч.Вставить("Withdrawn",  001);
	ШкалаРейтинговФитч.Вставить("NR",         001);
	
	ШкалаРейтинговСНП = Новый Соответствие;
	ШкалаРейтинговСНП.Вставить("AAA",       120);
	ШкалаРейтинговСНП.Вставить("AA",        110);
	ШкалаРейтинговСНП.Вставить("A",         100);
	ШкалаРейтинговСНП.Вставить("BBB",       090);
	ШкалаРейтинговСНП.Вставить("BB",        080);
	ШкалаРейтинговСНП.Вставить("B",         070);
	ШкалаРейтинговСНП.Вставить("CCC",       060);
	ШкалаРейтинговСНП.Вставить("CC",        050);
	ШкалаРейтинговСНП.Вставить("C",         040);
	ШкалаРейтинговСНП.Вставить("R",         035);
	ШкалаРейтинговСНП.Вставить("SD",        030);
	ШкалаРейтинговСНП.Вставить("D",         020);
	ШкалаРейтинговСНП.Вставить("NR",        010);
	ШкалаРейтинговСНП.Вставить("Suspended", 001);
	ШкалаРейтинговСНП.Вставить("Withdrawn", 001);
	ШкалаРейтинговСНП.Вставить("NR",        001);
	
	ШкалаРейтинговРА = Новый Соответствие;
	ШкалаРейтинговРА.Вставить("A",         090);
	ШкалаРейтинговРА.Вставить("B",         070);
	ШкалаРейтинговРА.Вставить("C",         050);
	ШкалаРейтинговРА.Вставить("D",         030);
	ШкалаРейтинговРА.Вставить("E",         010);
	ШкалаРейтинговРА.Вставить("BBB",       001);
	ШкалаРейтинговРА.Вставить("Withdrawn", 001);
	ШкалаРейтинговРА.Вставить("NR",        001);
	
	Если Агентство = Справочники.РейтинговыеАгентства.Moodys Тогда
		// К каждой общей рейтинговой категории — от Аа до Саа включительно — агентство Moody’s добавляет цифровые модификаторы 1, 2 или 3.
		// Модификатор 1 указывает, что данное обязательство находится в верхней части своей общей рейтинговой категории; модификатор 2
		// указывает на положение в середине диапазона, модификатор 3 указывает, что обязательство находится в нижней части этой общей рейтинговой категории
		Модификатор = Прав(Рейтинг, 1);
		
		Если Модификатор = "1" Или Модификатор = "2" Или Модификатор = "3" Тогда
			Модификатор = 4 - Число(Модификатор);
			Рейтинг     = Лев(Рейтинг, СтрДлина(Рейтинг) - 1);
		Иначе
			Модификатор = 0;
		КонецЕсли;
		
		Если ШкалаРейтинговМудис[Рейтинг] <> Неопределено Тогда
			УровеньРейтинга = ШкалаРейтинговМудис[Рейтинг] + Модификатор;
		КонецЕсли;
		
	ИначеЕсли Агентство = Справочники.РейтинговыеАгентства.FitchRatings Тогда
		// К каждой общей рейтинговой категории — от AAA до С включительно — агентство Fitch добавляет цифровые модификаторы "+" или "-".
		
		//Удалим (rus)
		Рейтинг = СтрЗаменить(Рейтинг, "(rus)", "");
		
		Модификатор = Прав(Рейтинг, 1);
		
		Если Модификатор = "+" Или Модификатор = "-" Тогда
			Модификатор = ?(Модификатор = "+", +1, -1);
			Рейтинг     = Лев(Рейтинг, СтрДлина(Рейтинг) - 1);
		Иначе
			Модификатор = 0;
		КонецЕсли;
		
		Если ШкалаРейтинговФитч[Рейтинг] <> Неопределено Тогда
			УровеньРейтинга = ШкалаРейтинговФитч[Рейтинг] + Модификатор;
		КонецЕсли;
		
	ИначеЕсли Агентство = Справочники.РейтинговыеАгентства.StandardAndPoors Тогда
		// К каждой общей рейтинговой категории — от AA до CCC включительно — агентство Standard & Poor’s добавляет цифровые модификаторы "+" или "-".
		
		//Удалим ru
		Рейтинг = СтрЗаменить(Рейтинг, "ru", "");
		
		Модификатор = Прав(Рейтинг, 1);
		
		Если Модификатор = "+" Или Модификатор = "-" Тогда
			Модификатор = ?(Модификатор = "+", +1, -1);
			Рейтинг     = Лев(Рейтинг, СтрДлина(Рейтинг) - 1);
		Иначе
			Модификатор = 0;
		КонецЕсли;
		
		Если ШкалаРейтинговСНП[Рейтинг] <> Неопределено Тогда
			УровеньРейтинга = ШкалаРейтинговСНП[Рейтинг] + Модификатор;
		КонецЕсли;
		
	ИначеЕсли Агентство = Справочники.РейтинговыеАгентства.RAEX Тогда
		// К каждой общей рейтинговой категории — от A до E включительно. Агентство RAEX добавляет цифровые модификаторы "+" или "++".
		// Также возможны подуровни рейтингов (I), (II) и (III), которые применяются совместно с модификаторами.
		
		// сначала определим подуровень
		Подуровень = 0;
		Если      Прав(Рейтинг, 5) = "(III)" Тогда
			Подуровень = 3;
			Рейтинг    = СокрП(Лев(Рейтинг, СтрДлина(Рейтинг) - 5));
		ИначеЕсли Прав(Рейтинг, 4) = "(II)" Тогда
			Подуровень = 2;
			Рейтинг    = СокрП(Лев(Рейтинг, СтрДлина(Рейтинг) - 4));
		ИначеЕсли Прав(Рейтинг, 3) = "(I)" Тогда
			Подуровень = 1;
			Рейтинг    = СокрП(Лев(Рейтинг, СтрДлина(Рейтинг) - 3));
		КонецЕсли;
		
		// теперь определим модификатор
		Модификатор = 0;
		Если      Прав(Рейтинг, 2) = "++" Тогда
			Модификатор = 8;
			Рейтинг     = Лев(Рейтинг, СтрДлина(Рейтинг) - 2);
		ИначеЕсли Прав(Рейтинг, 1) = "+" Тогда
			Модификатор = 4;
			Рейтинг     = Лев(Рейтинг, СтрДлина(Рейтинг) - 1);
		КонецЕсли;
			
		Если ШкалаРейтинговРА[Рейтинг] <> Неопределено Тогда
			УровеньРейтинга = ШкалаРейтинговРА[Рейтинг] + Модификатор + Подуровень;
		КонецЕсли;		
		
	ИначеЕсли Агентство = Справочники.РейтинговыеАгентства.AMBest Тогда
		
		УровеньРейтинга = 1;
		
	КонецЕсли;
	
	Возврат УровеньРейтинга;
	
КонецФункции // ПолучитьУровеньРейтинга
