
Процедура ОбработатьЗадачи() Экспорт
	
	// Отдельные задачи выполняются не по регламентному заданию, а по событию. Их пропускаем
	МассивИсключаемыхТочекМаршрута = Новый Массив;
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ЗачислениеПаев.ТочкиМаршрута.ФормированиеВыводаДенежныхСредствПайщикуПриЗагрузкеВыписки);
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ЗачислениеПаев.ТочкиМаршрута.ФормированиеПереводаДССТранзитногоСчетаНаРасчетныйПриЗагрузкеВыписки);
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ПогашениеПаев.ТочкиМаршрута.РасчетНДФЛ);
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ПогашениеПаев.ТочкиМаршрута.ФормированиеВыводаДСПайщикуПриЗагрузкеВыписки);
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ПогашениеПаев.ТочкиМаршрута.ФормированиеОплатыНДФЛПриЗагрузкеВыписки);
	МассивИсключаемыхТочекМаршрута.Добавить(БизнесПроцессы.ОбменПаев.ТочкиМаршрута.ФормированиеВыводаДенежныхСредствВПИФПоОбмену);
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
		|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
		|	ЗадачаИсполнителя.Основание КАК Основание,
		|	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ЗадачаИсполнителя.БизнесПроцесс) В (ТИП(БизнесПроцесс.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев), ТИП(БизнесПроцесс.ЗачислениеПаев), ТИП(БизнесПроцесс.ПогашениеПаев), ТИП(БизнесПроцесс.ОбменПаев))
		|	И ЗадачаИсполнителя.ГруппаИсполнителей = &СистемныеПользователи
		|	И НЕ ЗадачаИсполнителя.ТочкаМаршрута В (&МассивИсключаемыхТочекМаршрута)
		|	И НЕ ЗадачаИсполнителя.Выполнена		
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("СистемныеПользователи",
		Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(
				ОбщегоНазначения.ПолучитьИменованныйОбъект("СистемныеПользователи"),
				ЭтотОбъект.Организация));
				
	Запрос.УстановитьПараметр("МассивИсключаемыхТочекМаршрута", МассивИсключаемыхТочекМаршрута);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ЗадачаОбъект.ВыполнитьЗадачу();
		Исключение
			//##Возможно, сформировать оповещение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
