
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьПодтверждениеОперацииНаСервере();

	Если ПараметрыЗаписи.Свойство("РаскрытыйКонтрагентВДопСведения") Тогда
		РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		ПараметрыЗаписи.Вставить("РаскрытыйКонтрагентВДопСведения");	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДекорацияРаскрытыйКонтрагентНажатие(Элемент)
	
	РазрешитьРедактирование = НЕ ЭтаФорма.ТолькоПросмотр;
	
	Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		
		СписокДействий = Новый СписокЗначений();
		СписокДействий.Добавить("Открыть");
		
		Если РазрешитьРедактирование Тогда
		
			СписокДействий.Добавить("Изменить");
			СписокДействий.Добавить("Очистить");	
		
		КонецЕсли;
				
		Действие = ЭтаФорма.ВыбратьИзМеню(СписокДействий, ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент);
		
		Если Действие = Неопределено Тогда
			
			Возврат;
			
		ИначеЕсли Действие.Значение = "Открыть" Тогда
			ОткрытьЗначение(ЭтаФорма.РаскрытыйКонтрагент);
			
		ИначеЕсли Действие.Значение = "Изменить" Тогда
			
			Если ВвестиЗначение(ЭтаФорма.РаскрытыйКонтрагент, "Раскрытый контрагент", Тип("СправочникСсылка.ЮрФизЛица")) Тогда
				
				Если Не Объект.Ссылка.Пустая() Тогда
					РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
				КонецЕсли;
												
			КонецЕсли;
						
		ИначеЕсли Действие.Значение = "Очистить" Тогда
			
			ЭтаФорма.РаскрытыйКонтрагент = Неопределено;
			
			Если Не Объект.Ссылка.Пустая() Тогда
				РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
			КонецЕсли;
	
		КонецЕсли;
		
	Иначе
			
		Если РазрешитьРедактирование И ВвестиЗначение(ЭтаФорма.РаскрытыйКонтрагент, "Раскрытый контрагент", Тип("СправочникСсылка.ЮрФизЛица")) Тогда
			
			Если Не Объект.Ссылка.Пустая() Тогда
				РаботаСФормами.ЗаписатьЗначениеДополнительногоСведенияОбъекта(Объект.Ссылка, "_РаскрытыйКонтрагент", ЭтаФорма.РаскрытыйКонтрагент);
			КонецЕсли;
								
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
		ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = ЭтаФорма.РаскрытыйКонтрагент;
	ИначеЕсли РазрешитьРедактирование Тогда
		ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Выбрать";	
	Иначе
		ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Не указан";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтавкаИсходящихПлатежейПриИзменении(Элемент)
	ОпределитьВидСделки();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ОпределитьВидСделки()

	Если ТипЗнч(Объект.СтавкаИсходящихПлатежей) <> Тип("СправочникСсылка.БазовыеСтавкиОблигаций") Тогда // т.е. мы платим фикс
		ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка;
	Иначе
		ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОпределитьВидСделки();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ЭтаФорма.РаскрытыйКонтрагент = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(Неопределено, "_РаскрытыйКонтрагент", Объект.Ссылка);
		
		Если ЗначениеЗаполнено(ЭтаФорма.РаскрытыйКонтрагент) Тогда
			ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = ЭтаФорма.РаскрытыйКонтрагент;
		ИначеЕсли ЭтаФорма.ТолькоПросмотр Тогда
			ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Не указан";
		Иначе
			ЭтаФорма.Элементы.ГиперссылкаРаскрытыйКонтрагент.Заголовок = "Выбрать";
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере()

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сделки СПФИ не могут происходить на внебирже");
		СтандартнаяОбработка = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
