Процедура ЗаполнитьНаОснованииСделкиСМО(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения.ПометкаУдаления Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Помеченный на удаление документ не может быть основанием для сделки СМО!");
		СтандартнаяОбработка = Ложь;
		Возврат;
	
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Ответственный, Комментарий");
	
	Основание = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Основание), ДанныеЗаполнения.Основание, ДанныеЗаполнения);
	Дата = ТекущаяДата();
	Номер = "";	
	
КонецПроцедуры	

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	// регистр УсловияСделокСМО
	
	Движения.УсловияСделокСМО.Записывать = Истина;
	
	Движение = Движения.УсловияСделокСМО.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	
	Движение.Период		= Дата;
	Движение.СделкаСМО	= ?(ЗначениеЗаполнено(Основание), Основание, ЭтотОбъект.Ссылка);  

КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСМО") Тогда
		ЗаполнитьНаОснованииСделкиСМО(ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ПравилоРасчетаПроцента = Перечисления.ПравилаРасчетаПроцентовСМО.ШкалаПроцентныхСтавок Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Процент"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ШкалаПроцентныхСтавок"));
	КонецЕсли;
	
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		// проверка соответствия условий распоряжения и МНО
		Если Основание.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ введен на основании помеченного на удаление документа'"), ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
	КонецЕсли;	
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти
