
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СКД	= ОбработкаОбъект.ПолучитьМакет("СКДОтчетаПоСоставуИД");
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.Параметры.ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	ЭтаФорма.Параметры.Настройки = СКД.НастройкиПоУмолчанию;
	
	ЭтаФорма.КомпоновщикНастроек.Инициализировать(ЭтаФорма.Параметры.ИсточникДоступныхНастроек);
	
	ЭтаФорма.ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СоздатьЭлементыФормыПользовательскихНастроек(,РежимОтображенияНастроекКомпоновкиДанных.Все, 3);
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры
 	
#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.ДанныеРасшифровки, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат);
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура СформироватьНаСервере()

	СКД 		= ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСКД);
	Настройки 	= ЭтаФорма.КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ЭтаФорма.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(ЭтаФорма.Период.ДатаОкончания), ЭтаФорма.Период.ДатаОкончания, '39990101'));
	
	РезультатКомпоновки = ПолучитьРезультатКомпоновки(СКД, Настройки);
	ПоместитьВоВременноеХранилище(РезультатКомпоновки.ДанныеРасшифровки, ЭтаФорма.ДанныеРасшифровки);
	ЭтаФорма.Результат = РезультатКомпоновки.Результат;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРезультатКомпоновки(СКД, Настройки)

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанных");
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки, , ТипГенератора);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Новый Структура("Результат, ДанныеРасшифровки", Результат, ДанныеРасшифровки);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРасшифровки(АдресВХарилище, Расшифровка)

	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресВХарилище);
	Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Результат, "НЕАКТУАЛЬНОСТЬ");

КонецПроцедуры
 

#КонецОбласти 









