
&НаСервере
Процедура КомандаИмпортироватьНаСервере()

	РеквизитФормыВЗначение("Объект").ИмпортироватьКотировки(ЭтаФорма.ОтчетОбИмпорте);
	
	Если Объект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Объект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
КонецПроцедуры // КомандаИмпортироватьНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.ЗаполнитьРежимыТорговПоУмолчанию();
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	
	Объект.Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	
	Объект.Период       = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	//Объект.Период       = Новый СтандартныйПериод(Дата(2020, 02, 29), Дата(2020, 02, 29));
	//Объект.ЦеннаяБумага = Справочники.Облигации.НайтиПоНаименованию("Краснодарский край, RU35001KND0, 1000.00 RUB");
	
	Если ЭтаФорма.Параметры.Свойство("ЦеннаяБумага") Тогда
		Объект.ЦеннаяБумага = ЭтаФорма.Параметры.ЦеннаяБумага;
	КонецЕсли;
	
	ЭтаФорма.ОтборПоЦеннойБумаге = ЗначениеЗаполнено(Объект.ЦеннаяБумага);
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		ПроверяемыеРеквизиты.Добавить("ЦеннаяБумага");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦеннойБумагеПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ОтборПоЦеннойБумаге Тогда
		Объект.ЦеннаяБумага = Неопределено;
	КонецЕсли;
	
	Элементы.ЦеннаяБумага.Видимость = ЭтаФорма.ОтборПоЦеннойБумаге;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
			
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаИмпортироватьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
