&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
	
	Если ДанныеОбъекта.ВидОбъектаНедвижимости = ПредопределенноеЗначение("Перечисление.ВидыОбъектовНедвижимости.Помещение") Тогда
		Элементы.Здание.Видимость = Истина;
	Иначе 
		ДанныеОбъекта.Здание = ПредопределенноеЗначение("Справочник.ОбъектыНедвижимости.ПустаяСсылка");
		Элементы.Здание.Видимость = Ложь;
	КонецЕсли;	
	
	ЭтоЗемельныйУчасток = ДанныеОбъекта.ВидОбъектаНедвижимости = ПредопределенноеЗначение("Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток");
	
	Элементы.РеквизитыОбъектаНедвижимости.Видимость = НЕ ЭтоЗемельныйУчасток;
	Элементы.РеквизитыЗемельногоУчастка.Видимость 	=  ЭтоЗемельныйУчасток;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОбъектаНедвижимости.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	РеквизитыОбъектаНедвижимости.Параметры.УстановитьЗначениеПараметра("ОбъектНедвижимости", Объект.Ссылка);
	
	РеквизитыЗемельногоУчастка.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	РеквизитыЗемельногоУчастка.Параметры.УстановитьЗначениеПараметра("ОбъектНедвижимости", Объект.Ссылка);
	
	СвязанныеДоговоры.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	СвязанныеДоговоры.Параметры.УстановитьЗначениеПараметра("ОбъектНедвижимости", Объект.Ссылка);
	
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаНедвижимостиПриИзменении(Элемент)
	НастроитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитыОбъектаНедвижимости(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать объект недвижимости");
		Возврат;
	КонецЕсли;
	
	ПараметрыРеквизитов = Новый Структура("ЗначенияЗаполнения", Новый Структура("ОбъектНедвижимости",Объект.Ссылка));
	ОткрытьФормуМодально("Документ.РегистрацияСведенийОбОбъектахНедвижимости.ФормаОбъекта",ПараметрыРеквизитов,, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		Объект.Страна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Здание, "Страна");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДоговорыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьФорму("РегистрСведений.УсловияДоговоровНедвижимости.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", Новый Структура("ОбъектНедвижимости", Объект.Ссылка)));
КонецПроцедуры
