&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	ЭтаФорма.Элементы.АП55.Видимость = ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВыгрузкуВЕгарАП91(Команда)
	ПараметрыНастройкиВыгрузки = Новый Структура("ИмяСервера", "АП91");
	ФормаНастройкиВыгрузки = ПолучитьФорму("ВнешняяОбработка._ЭкспортВЕГАР.Форма.ФормаНастроек",ПараметрыНастройкиВыгрузки);
	ФормаНастройкиВыгрузки.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВыгрузкуВЕгарАП55(Команда)
	ПараметрыНастройкиВыгрузки = Новый Структура("ИмяСервера", "АП55");
	ФормаНастройкиВыгрузки = ПолучитьФорму("ВнешняяОбработка._ЭкспортВЕГАР.Форма.ФормаНастроек", ПараметрыНастройкиВыгрузки);
	ПараметрыНастройкиВыгрузки = ФормаНастройкиВыгрузки.ОткрытьМодально();
КонецПроцедуры
