
//////////////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.НазначенныеРоли.Очистить();
	
	Для каждого СтрокаДоступныеРоли Из ЭтаФорма.ДоступныеРоли Цикл
		Если СтрокаДоступныеРоли.Пометка Тогда
			ЗаполнитьЗначенияСвойств(Объект.НазначенныеРоли.Добавить(), СтрокаДоступныеРоли, "Роль");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// События элементов формы

&НаКлиенте
Процедура ДоступныеРолиПометкаПриИзменении(Элемент)
	
	ЗаполнитьЗаголовокСтраницыРоли(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции формы

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Объект.Ссылка = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Организация.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Для каждого РольМД Из Метаданные.Роли Цикл
		НоваяСтрокаДоступныеРоли = ЭтаФорма.ДоступныеРоли.Добавить();
		НоваяСтрокаДоступныеРоли.Пометка       = (Объект.НазначенныеРоли.НайтиСтроки(Новый Структура("Роль", РольМД.Имя)).Количество() > 0);
		НоваяСтрокаДоступныеРоли.Роль          = РольМД.Имя;
		НоваяСтрокаДоступныеРоли.Представление = РольМД.Представление();
		НоваяСтрокаДоступныеРоли.Описание      = "";
	КонецЦикла;
	
	ЭтаФорма.ДоступныеРоли.Сортировать("Представление");
	
	ЗаполнитьЗаголовокСтраницыРоли(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовокСтраницыРоли(Форма)
	
	Помечено = 0;
	
	Для каждого СтрокаДоступныеРоли Из Форма.ДоступныеРоли Цикл
		Если СтрокаДоступныеРоли.Пометка Тогда
			Помечено = Помечено + 1;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Элементы.СтраницаНазначенныеРоли.Заголовок = "Роль (" + Помечено + "/" + Форма.ДоступныеРоли.Количество() + ")";
	
КонецПроцедуры // ЗаполнитьЗаголовокСтраницыРоли

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Состав.Количество() > 0
		И ЗначениеЗаполнено(Объект.Организация)
		И Объект.Организация <> ВыбранноеЗначение Тогда
		
		Если Вопрос("При изменении организации будет очищен состав пользователей. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
		Иначе
			Объект.Состав.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
