
#Область ПрограммныйИнтерфейс

//	Создает и при необходимости обрабатывает пакет данных, используя данные, переданные в параметрах
//	И создание и обработка пакета выполняется в рамках транзакции.
//	В случае ошибки транзакция отменяется и вызывается исключение.
//
//	Параметры:
//	Вид						- элемент перечисления "ВидыПакетовДанныхКОбработке", вид пакета данных
//	Данные					- структура, содержит параметры для формирования пакета данных
//		общие свойства структуры:
//			Файлы							- массив структур с описанием файлов пакета. Для вида пакета "Электронное письмо" свойство необязательное.
//				общие свойства структуры описания файла:
//					Имя						- имя файла с расширением
//				свойства структуры для файлов, находящихся в файловом хранилище:
//					ИдентификаторВерсии		- идентификатор версии файла в файловом хранилище
//				свойства структуры для файлов, которые не помещены в файловое хранилище:
//					ДанныеФайла				- двоичные данные файла или адрес временного хранилища, по которому расположены двоичные данные
//				общие свойства структуры описания файла(только для электронного письма):
//					ПривязанКТексту			- признак того, что файл привязан к тексту письма. Свойство необязательное и используется только для вида пакета "ЭлектронноеПисьмо"
//					ИдентификаторВложения	- идентификатор файла, привязанного к тексту письма. Свойство необязательное и используется только для вида пакета "ЭлектронноеПисьмо"
//			МаксимальныйСуммарныйРазмерФайлов	- ограничения на максимальный размер файлов в байтах. Если обший размер файлов превышает установленное значение,
//												  либо ограничения учетной записи почты, файлы будут упакованы в архив, который, при необходимости, будет разбит на тома. Свойство не обязательное.
//			Организация		- организация, которой принадлежат файлы пакета. Свойство необязательное. Если значение не указано, файлы будут считаться общими.
//			ДатаСоздания	- дата создания пакета. Свойство необязательное. Может использоваться, например, для добавления уже обработанных пакетов.
//		свойства структуры для вида "ЭлектронноеПисьмо":
//			УведомитьОДоставке				- признак того, что требуется уведомление о доставке письма. Необязательное свойство.
//			ПолучателиУведомленияОДоставке	- массив структур с данными получателей уведомления о доставке письма или строка из адресов с разделителем ';' или ','. Свойство обязательное при "УведомитьОДоставке" = Истина.
//				Адрес						- адрес электронной почты
//				Представление				- представление получателя
//			УведомитьОПрочтении				- признак того, что требуется уведомление о прочтении письма. Необязательное свойство.
//			ПолучателиУведомленияОПрочтении	- массив структур с данными получателей уведомления о прочтении письма или строка из адресов с разделителем ';' или ','. Свойство обязательное при "УведомитьОПрочтении" = Истина.
//				Адрес						- адрес электронной почты
//				Представление				- представление получателя
//			УчетнаяЗапись					- учетная запись электронной почты. Свойство необязательное. Если свойство не указано, используется учетная запись по умочанию.
//			Текст							- текст письма
//			ТипТекста						- тип текста письма
//			Тема							- тема письма
//			АдресОтправителя				- адрес электронной почты отправителя
//			ПредставлениеОтправителя		- представление отправителя
//			ОбратныйАдрес					- адрес электронной почты для ответа на письмо
//			ОбратныйАдресПредставление		- представление для обратного адреса
//			Получатели						- массив структур с данными получателей письма или строка из адресов с разделителем ';' или ','
//				Адрес						- адрес электронной почты
//				Представление				- представление получателя
//			ПолучателиКопий					- массив структур с данными получателей копий письма или строка из адресов с разделителем ';' или ','
//				Адрес						- адрес электронной почты
//				Представление				- представление получателя
//			ПолучателиСлепыхКопий			- массив структур с данными получателей слепых копий письма или строка из адресов с разделителем ';' или ','
//				Адрес						- адрес электронной почты
//				Представление				- представление получателя
//			ИдентификаторыОснований			- идентификаторы оснований письма. Необязательное свойство.
//			Важность						- важность письма
//			Кодировка						- кодировка текста письма
//			ОбрабатыватьТексты				- признак необходимости обрабатывать текст письма при отправке
//		свойство структуры для вида "ВыгрузкаФайла":
//			Путь							- каталог в который требуется выгрузить файлы
//			ИмяАрхива						- имя архива, в который будут помещены файлы, в случае, если файлов более одного или их суммарный размер превышает установленные ограничения.
//											  если свойство не задано, по умолчанию будет использоваться "Архив.zip", в качестве имени архива.
//			НеЗаменятьФайлыВКаталоге		- признак того, что нужно генерировать ошибку, если файл с таким именем в каталоге уже существует.
//											  Свойство необязательное. Значение по умолчанию Ложь.
// ОтложеннаяОбработка		- признак того, что пакет необходимо обработать без помещения в общую очередь. Значение по умолчанию "Истина".
//
// Возвращаемое значение:
//  Ссылка на созданный пакет данных.
//
Функция СоздатьПакетДанных(Вид, Данные, ОтложеннаяОбработка = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Пакет = СохранитьПакетДанных(Вид, Данные);
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось создать пакет данных из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если Пакет <> Неопределено
		И НЕ ОтложеннаяОбработка Тогда
		
		Попытка
			ВыполнитьОбработкуПакета(Пакет);
		Исключение
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(СтрШаблон("Не удалось обработать '%1' из-за ошибки:%2", Пакет, Символы.ПС + ОписаниеОшибки()), "Пакеты данных к обработке");
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пакет;
	
КонецФункции

//	Обрабатывает переданные в параметрах пакеты данных
//
//	Параметры:
//		Пакеты				- массив со ссылками на пакеты данных, которые требуется обработать
//		СообщениеОбОшибках	- пустой массив, в который будут помещаться сообщения об ошибках в процессе обработки пакетов. Параметр необязательный.
//
Процедура ОбработатьПакетыДанных(Пакеты, СообщенияОбОшибках = Неопределено) Экспорт
	
	Если СообщенияОбОшибках = Неопределено Тогда
		СообщенияОбОшибках = Новый Массив;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыполнитьОбработкуПакетовДанных(Пакеты, СообщенияОбОшибках);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//	Выполняет обработку пакетов данных в количестве, переданном в параметрах, первых (по дате создания) с типом пакета "ВыгрузкаФайла".
//	Параметры:
//		КоличествоПакетов	- количество пакетов, которое требуется обработать.
//							  Значение по умолчанию 100. Если задать нулевое количество, будут обработаны все необработанные до данного момента пакеты.
//
Процедура ВыгрузитьФайлы(КоличествоПакетов = 100) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла)
		|	И НЕ ПакетыДанныхКОбработке.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ПакетДанных КАК ПакетДанных
		|				ИЗ
		|					РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(, ИдентификаторТома = """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|				ГДЕ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена)
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетыДанныхКОбработке.ДатаСоздания";
	
	Если КоличествоПакетов > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %1", Формат(КоличествоПакетов, "ЧДЦ=0; ЧГ=0")));
	КонецЕсли;
	
	СообщенияОбОшибках = Новый Массив;
	
	ОбработатьПакетыДанных(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пакет"), СообщенияОбОшибках);
	
	Для Каждого Сообщение Из СообщенияОбОшибках Цикл
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Сообщение, "Автоматическая обработка пакетов данных (выгрузка файлов)");
	КонецЦикла;
	
КонецПроцедуры

//	Выполняет обработку пакетов данных в количестве, переданном в параметрах, первых (по дате создания) с типом пакета "ЭлектронноеПисьмо".
//	Параметры:
//		КоличествоПакетов	- количество пакетов, которое требуется обработать.
//							  Значение по умолчанию 100. Если задать нулевое количество, будут обработаны все необработанные до данного момента пакеты.
//
Процедура ОтправитьЭлектронныеПисьма(КоличествоПакетов = 100) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо)
		|	И НЕ ПакетыДанныхКОбработке.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ПакетДанных КАК ПакетДанных
		|				ИЗ
		|					РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(, ИдентификаторТома = """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|				ГДЕ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена)
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетыДанныхКОбработке.ДатаСоздания";
	
	Если КоличествоПакетов > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %1", Формат(КоличествоПакетов, "ЧДЦ=0; ЧГ=0")));
	КонецЕсли;
	
	СообщенияОбОшибках = Новый Массив;
	
	ОбработатьПакетыДанных(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пакет"), СообщенияОбОшибках);
	
	Для Каждого Сообщение Из СообщенияОбОшибках Цикл
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Сообщение, "Автоматическая обработка пакетов данных (электронные письма)");
	КонецЦикла;
	
КонецПроцедуры

//	Отключает дальнейшую обработку пакетов данных.
//	Параметры:
//		Пакеты				- ссылка или массив ссылок на пакеты данных количество пакетов, обработку которых требуется отключить.
//		СообщенияОбОшибках	- пустой массив, в который будут помещены сообщения об ошибках, если таковые произойдут.
//
Процедура ОтменитьОбработкуПакетов(Пакеты, СообщенияОбОшибках = Неопределено) Экспорт
	
	Если СообщенияОбОшибках = Неопределено Тогда
		СообщенияОбОшибках = Новый Массив;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пакеты", Пакеты);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Ссылка КАК Пакет,
		|	ПакетыДанныхКОбработке.ОбработкаОтменена КАК ОбработкаОтменена,
		|	ЕСТЬNULL(ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена, ЛОЖЬ) КАК ОбработкаВыполнена
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(
		|				,
		|				ПакетДанных В (&Пакеты)
		|					И ИдентификаторТома = """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|		ПО ПакетыДанныхКОбработке.Ссылка = ЖурналОбработкиПакетовДанныхСрезПоследних.ПакетДанных
		|ГДЕ
		|	ПакетыДанныхКОбработке.Ссылка В(&Пакеты)";
	
	ТекущийПользователь = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОбработкаОтменена Тогда
			СообщенияОбОшибках.Добавить(СтрШаблон("Не удалось отменить обработку '%1' т.к. обработка пакета уже отменена!", Выборка.Пакет));
		ИначеЕсли Выборка.ОбработкаВыполнена Тогда
			СообщенияОбОшибках.Добавить(СтрШаблон("Не удалось отменить обработку '%1' т.к. обработка пакета уже выполнена!", Выборка.Пакет));
		Иначе
			
			Пакет = Выборка.Пакет.ПолучитьОбъект();
			
			Пакет.ОбработкаОтменена	= Истина;
			Пакет.ДатаОтмены				= ТекущаяДатаСеанса();
			Пакет.ОтменившийПользователь	= ТекущийПользователь;
			
			Попытка
				Пакет.Записать();
			Исключение
				СообщенияОбОшибках.Добавить(СтрШаблон("Не удалось отменить обработку '%1' из-за ошибки:%2", Выборка.Пакет, ОписаниеОшибки()));
				Продолжить;
			КонецПопытки;
			
			РаботаСОтчетами.ЗафиксироватьОтменуОтправкиИлиВыгрузкиОтчета(Выборка.Пакет);
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКорректностьУказанияПолучателей(ДанныеПакета, ИмяСвойства)
	
	// Проверяем корректность указания получателей уведомления о доставке
	Если НЕ ДанныеПакета.Свойство(ИмяСвойства)
		ИЛИ ТипЗнч(ДанныеПакета[ИмяСвойства]) <> Тип("Массив")
		И ТипЗнч(ДанныеПакета[ИмяСвойства]) <> Тип("Строка")
		ИЛИ ТипЗнч(ДанныеПакета[ИмяСвойства]) = Тип("Массив")
		И ДанныеПакета[ИмяСвойства].Количество() = 0
		ИЛИ ТипЗнч(ДанныеПакета[ИмяСвойства]) = Тип("Строка")
		И ДанныеПакета[ИмяСвойства] = "" Тогда
		ВызватьИсключение СтрШаблон("Не корректно указано свойство '%1' письма!", ИмяСвойства);
	ИначеЕсли ТипЗнч(ДанныеПакета[ИмяСвойства]) = Тип("Массив") Тогда
		
		Индекс = 1;
		
		// Проверяем получателей
		Для Каждого Получатель Из ДанныеПакета[ИмяСвойства] Цикл
			
			Если НЕ Получатель.Свойство("Адрес") Тогда
				ВызватьИсключение СтрШаблон("В свойстве '%1' у получателя №%2 отсутствует адрес!", ИмяСвойства, Индекс);
			ИначеЕсли НЕ РаботаСоСтрокамиКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Получатель.Адрес) Тогда
				ВызватьИсключение СтрШаблон("В свойстве '%1' у получателя №%2 указан некорректный адрес '%3'!", ИмяСвойства, Индекс, Получатель.Адрес);
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		Возврат ДанныеПакета[ИмяСвойства];
		
	Иначе
		
		// Парсим строку и проверяем получателей
		Получатели = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ДанныеПакета[ИмяСвойства]);
		
		Индекс = 1;
		
		// Проверяем получателей
		Для Каждого Получатель Из Получатели Цикл
			
			Если НЕ Получатель.Статус Тогда
				ВызватьИсключение Получатель.СообщениеОбОшибке;
			ИначеЕсли НЕ РаботаСоСтрокамиКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Получатель.Адрес) Тогда
				ВызватьИсключение СтрШаблон("В свойстве '%1' у получателя №%2 указан некорректный адрес '%3'!", ИмяСвойства, Индекс, Получатель.Адрес);
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		Возврат Получатели;
		
	КонецЕсли;
	
КонецФункции

Функция СохранитьПакетДанных(Вид, Данные)
	
	ОповеститьОбАрхивацииПривязанныхКТекстуФайлов = Ложь;
	
	ВременныеФайлыКУдалению = Новый Массив;
	
	НовыйЭлемент = Справочники.ПакетыДанныхКОбработке.СоздатьЭлемент();
	
	НовыйИдентификатор = Новый УникальныйИдентификатор();
	
	НовыйЭлемент.УстановитьСсылкуНового(Справочники.ПакетыДанныхКОбработке.ПолучитьСсылку(НовыйИдентификатор));
	
	НовыйЭлемент.ДатаСоздания	= ?(Данные.Свойство("ДатаСоздания"), Данные.ДатаСоздания, ТекущаяДата());
	НовыйЭлемент.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
	НовыйЭлемент.Вид			= Вид;
	
	Если Данные.Свойство("Организация")
		И ЗначениеЗаполнено(Данные.Организация) Тогда
		Организация = Данные.Организация;
	Иначе
		Организация = Неопределено;
	КонецЕсли;
	
	#Область ПроверкаЗаполненияОбязательныхПараметров
	
	Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла Тогда
		
		Если НЕ Данные.Свойство("Путь")
			ИЛИ НЕ ЗначениеЗаполнено(Данные.Путь) Тогда
			ВызватьИсключение "Создание пакета данных к выгрузке файла без указания пути выгрузки невозможно!";
		КонецЕсли;
		
		Если НЕ Данные.Свойство("Файлы") Тогда
			
			Если Данные.Файлы.Количество() = 0 Тогда
				ВызватьИсключение "Для пакета данных с типом 'Выгрузка файла' не переданы файлы!";
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
		
		Если НЕ Данные.Свойство("Получатели") Тогда
			ВызватьИсключение СтрШаблон("Не определены получатели письма!");
		Иначе
			МассивПолучателей = ПроверитьКорректностьУказанияПолучателей(Данные, "Получатели");
		КонецЕсли;
		
		Если Данные.Свойство("УведомитьОДоставке") И Данные.УведомитьОДоставке Тогда
			МассивПолучателейУведомленияОДоставке = ПроверитьКорректностьУказанияПолучателей(Данные, "ПолучателиУведомленияОДоставке");
		КонецЕсли;
		
		Если Данные.Свойство("УведомитьОПрочтении") И Данные.УведомитьОПрочтении  Тогда
			МассивПолучателейУведомленияОПрочтении = ПроверитьКорректностьУказанияПолучателей(Данные, "ПолучателиУведомленияОПрочтении");
		КонецЕсли;
		
		Если Данные.Свойство("ПолучателиКопий") Тогда
			МассивПолучателейКопий = ПроверитьКорректностьУказанияПолучателей(Данные, "ПолучателиКопий");
		КонецЕсли;
		
		Если Данные.Свойство("ПолучателиСлепыхКопий") Тогда
			МассивПолучателейСлепыхКопий = ПроверитьКорректностьУказанияПолучателей(Данные, "ПолучателиСлепыхКопий");
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтрШаблон("Создание пакетов данных к обработке с видом '%1' не реализовано!", НовыйЭлемент.Вид);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПодготовкаМассиваФайлов
	
	Если Данные.Свойство("Файлы")
		И ТипЗнч(Данные.Файлы) = Тип("Массив") Тогда
		СписокФайлов = Данные.Файлы;
	Иначе
		СписокФайлов = Новый Массив;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОбработкаДанныхЭлектронногоПисьма
	
	Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
		
		Если Данные.Свойство("УчетнаяЗапись")
			И ЗначениеЗаполнено(Данные.УчетнаяЗапись) Тогда
			НовыйЭлемент.УчетнаяЗапись = Данные.УчетнаяЗапись;
		Иначе
			НовыйЭлемент.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
		КонецЕсли;
		
		#Область ОбрабатываемТекстПисьма
		
		Если Данные.Свойство("Текст") Тогда
			
			Если ТипЗнч(Данные.Текст) = Тип("ФорматированныйДокумент") Тогда
				
				СодержимоеПисьма	= РаботаСЭлектроннойПочтой.ПолучитьHTMLФорматированногоДокументаДляПисьма(Данные.Текст);
				Текст				= СодержимоеПисьма.ТекстHTML;
				Картинки			= СодержимоеПисьма.Картинки;
				
				Если Картинки.Количество() > 0 Тогда
					
					Для Каждого Картинка Из Картинки Цикл
						
						Файл = Новый Файл(Картинка.Ключ);
						
						НовыйФайл = Новый Структура;
						
						ДвоичныеДанныеКартинки = Картинка.Значение.ПолучитьДвоичныеДанные();
						
						НовыйФайл.Вставить("ДанныеФайла",			ДвоичныеДанныеКартинки);
						НовыйФайл.Вставить("Имя",					Файл.Имя);
						НовыйФайл.Вставить("Размер",				ДвоичныеДанныеКартинки.Размер());
						НовыйФайл.Вставить("ПривязанКТексту",		Истина);
						НовыйФайл.Вставить("ИдентификаторВложения",	Картинка.Ключ);
						
						СписокФайлов.Добавить(НовыйФайл);
						
					КонецЦикла;
					
				КонецЕсли;
				
				НовыйЭлемент.Текст = Текст;
				
			Иначе
				НовыйЭлемент.Текст = Данные.Текст;
			КонецЕсли;
			
			Если Данные.Свойство("ТипТекста") Тогда
				НовыйЭлемент.ТипТекста = Данные.ТипТекста;
			Иначе
				
				Попытка
					ПервыеШестьСимволов = НРег(Лев(СокрЛ(НовыйЭлемент.Текст), 6));
				Исключение
					ПервыеШестьСимволов = "";
				КонецПопытки;
				
				Если ПервыеШестьСимволов = "<html>" Тогда
					НовыйЭлемент.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
				Иначе
					НовыйЭлемент.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ОпределениеМаксимальногоРазмераВложений
	
	Максимумы = Новый ТаблицаЗначений;
	
	Максимумы.Колонки.Добавить("Максимум", Новый ОписаниеТипов("Число"));
	
	// Определяем максимальный суммарный размер файлов, переданный в данных
	Если Данные.Свойство("МаксимальныйСуммарныйРазмерФайлов")
		И ЗначениеЗаполнено(Данные.МаксимальныйСуммарныйРазмерФайлов) Тогда
		НоваяСтрока				= Максимумы.Добавить();
		НоваяСтрока.Максимум	= Данные.МаксимальныйСуммарныйРазмерФайлов;
	КонецЕсли;
	
	// Добавляем к максимумам максимальный размер письма для учетной записи
	Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
		НоваяСтрока				= Максимумы.Добавить();
		НоваяСтрока.Максимум	= НовыйЭлемент.УчетнаяЗапись.МаксимальныйРазмерПисьма;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Максимумы", Максимумы);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Максимумы.Максимум КАК Максимум
		|ПОМЕСТИТЬ _Максимумы
		|ИЗ
		|	&Максимумы КАК Максимумы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_Максимумы.Максимум) КАК Максимум
		|ИЗ
		|	_Максимумы КАК _Максимумы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		И ЗначениеЗаполнено(Выборка.Максимум) Тогда
		Максимум = Выборка.Максимум;
	Иначе
		Максимум = Неопределено;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ПодготовкаДанныхФайловКОбработке
	
	ДанныеФайловКОбработке = Новый Массив;
	
	СуммарныйРазмер = 0;
	
	// обрабатываем данные файлов
	Для Каждого Файл Из СписокФайлов Цикл
		
		ДанныеФайла = Новый Структура;
		
		// Файл находится в файловом хранилище
		Если Файл.Свойство("ИдентификаторВерсии") Тогда
			
			ДанныеФайла.Вставить("ИдентификаторВерсии", Файл.ИдентификаторВерсии);
			
			// Получаем данные файла из файлового хранилища
			Попытка
				ДанныеВерсии = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(Файл.ИдентификаторВерсии);
			Исключение
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				ВызватьИсключение СтрШаблон("Не удалось получить данные версии файла с идентификатором '%1' из файлового хранилища из-за ошибки:%2", Файл.ИдентификаторВерсии, Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
			ДанныеФайла.Вставить("ДвоичныеДанные",			ПолучитьИзВременногоХранилища(ДанныеВерсии.Адрес));
			ДанныеФайла.Вставить("Имя",						Файл.Имя);
			ДанныеФайла.Вставить("Размер",					ДанныеФайла.ДвоичныеДанные.Размер());
			
			СуммарныйРазмер = СуммарныйРазмер + ДанныеФайла.ДвоичныеДанные.Размер();
			
		ИначеЕсли Файл.Свойство("ДанныеФайла") Тогда
			
			Если ТипЗнч(Файл.ДанныеФайла) = Тип("Строка")
				И ЭтоАдресВременногоХранилища(Файл.ДанныеФайла) Тогда
				ДвоичныеДанные	= ПолучитьИзВременногоХранилища(Файл.ДанныеФайла);
				Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			Иначе
				ДвоичныеДанные	= Файл.ДанныеФайла;
				Адрес			= ПоместитьВоВременноеХранилище(Файл.ДанныеФайла);
			КонецЕсли;
					
			ОбъектФайл = Новый Файл(Файл.Имя);
			
			ДанныеВерсии = Новый Структура;
			
			ДанныеВерсии.Вставить("Адрес",					Адрес);
			ДанныеВерсии.Вставить("Имя",					ОбъектФайл.Имя);
			ДанныеВерсии.Вставить("Расширение",				СтрЗаменить(ОбъектФайл.Расширение, ".", ""));
			ДанныеВерсии.Вставить("НаименованиеВладельца",	Строка(Вид));
			ДанныеВерсии.Вставить("ИдентификаторВладельца",	Строка(НовыйИдентификатор));
			ДанныеВерсии.Вставить("ТипВладельца",			"Файлы пакетов данных к обработке");
			
			Попытка
				Идентификаторы = РаботаСФайловымХранилищем.СоздатьФайл(ДанныеВерсии, Организация);
			Исключение
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				ВызватьИсключение СтрШаблон("Не удалось сохранить данные файла в файловом хранилище из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
			// Подгатавливаем данные файла для добавления в пакет данных
			ДанныеФайла = Новый Структура;
			
			ДанныеФайла.Вставить("ДвоичныеДанные",			ДвоичныеДанные);
			ДанныеФайла.Вставить("Имя",						Файл.Имя);
			ДанныеФайла.Вставить("Размер",					ДвоичныеДанные.Размер());
			ДанныеФайла.Вставить("ИдентификаторВерсии",		Идентификаторы.ИдентификаторВерсии);
			
			ВременныеФайлыКУдалению.Добавить(Новый Структура("ФайлВХранилище, ИдентификаторФайла", Истина, Идентификаторы.ИдентификаторФайла));
			
			СуммарныйРазмер = СуммарныйРазмер + ДвоичныеДанные.Размер();
			
		Иначе
			ВызватьИсключение "Данные файлов пакета не соотсветствуют требуемой структуре!";
		КонецЕсли;
		
		Если Файл.Свойство("ПривязанКТексту")
			И Файл.ПривязанКТексту
			И Файл.Свойство("ИдентификаторВложения")
			И ЗначениеЗаполнено(Файл.ИдентификаторВложения) Тогда
			ДанныеФайла.Вставить("ПривязанКТексту",			Истина);
			ДанныеФайла.Вставить("ИдентификаторВложения",	Файл.ИдентификаторВложения);
		Иначе
			ДанныеФайла.Вставить("ПривязанКТексту", Ложь);
		КонецЕсли;	
		
		Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
			
			Если Файл.Свойство("ПривязанКТексту")
				И Файл.ПривязанКТексту Тогда
				
				Если Файл.Свойство("ИдентификаторВложения")
					И ЗначениеЗаполнено(Файл.ИдентификаторВложения) Тогда
					ДанныеФайла.Вставить("ПривязанКТексту",			Истина);
					ДанныеФайла.Вставить("ИдентификаторВложения",	Файл.ИдентификаторВложения);
				Иначе
					УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
					ВызватьИсключение "Не указан идентификатор файла, привязанного к тексту письма!";
				КонецЕсли;
				
			Иначе
				ДанныеФайла.Вставить("ПривязанКТексту", Ложь);
			КонецЕсли;
			
		Иначе
			ДанныеФайла.Вставить("ПривязанКТексту", Ложь);
		КонецЕсли;
		
		#Область КонтрольСовпаденияИменФайлов
		
		Для Каждого Файл Из ДанныеФайловКОбработке Цикл
			
			Если ДанныеФайла.Имя = Файл.Имя Тогда
				
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				
				ВызватьИсключение СтрШаблон("Не удалось сформировать пакет данных к обработке из-за совпадения имен файлов ('%1')!", Файл.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		ДанныеФайловКОбработке.Добавить(ДанныеФайла);
		
		НовыйФайл = НовыйЭлемент.Файлы.Добавить();
		
		НовыйФайл.ИдентификаторВерсии	= ДанныеФайла.ИдентификаторВерсии;
		НовыйФайл.Имя					= ДанныеФайла.Имя;
		НовыйФайл.Размер				= ДанныеФайла.Размер/1048576;
		НовыйФайл.ПривязанКТексту		= ДанныеФайла.ПривязанКТексту;
		
		Если ДанныеФайла.ПривязанКТексту Тогда
			НовыйФайл.ИдентификаторВложения = ДанныеФайла.ИдентификаторВложения;
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Архивация
	
	ВременныйКаталог = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + "\";
	
	ВременныеФайлыКУдалению.Добавить(Новый Структура("ФайлВХранилище, Имя", Ложь, ВременныйКаталог));
	
	// Если есть ограничения на суммарный размер пакета
	Если Максимум <> Неопределено И Максимум <= СуммарныйРазмер
		ИЛИ НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла И НовыйЭлемент.Файлы.Количество() > 1 Тогда
		
		НовыйЭлемент.РазделенНаТома = Истина;
		
		// Для пакета с одним файлом имя архива должно быть таким же, как имя самого файла
		Если НовыйЭлемент.Файлы.Количество() = 1 Тогда
			
			Файл = Новый Файл(НовыйЭлемент.Файлы[0].Имя);
			
			ИмяАрхива = Файл.ИмяБезРасширения;
			
		ИначеЕсли НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла
			И Данные.Свойство("ИмяАрхива") И ЗначениеЗаполнено(Данные.ИмяАрхива) Тогда
			ИмяАрхива = Данные.ИмяАрхива;
		Иначе
			ИмяАрхива = "Архив";
		КонецЕсли;
		
		ФайлАрхива = ВременныйКаталог + ИмяАрхива + ".zip";
		
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ФайлАрхива,,,,,, КодировкаИменФайловВZipФайле.OSEncodingWithUTF8);
		
		Для Каждого ДанныеФайла Из ДанныеФайловКОбработке Цикл
			
			Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо
				И ДанныеФайла.ПривязанКТексту Тогда
				ОповеститьОбАрхивацииПривязанныхКТекстуФайлов = Истина;
			КонецЕсли;
			
			ИсходныйФайл = ВременныйКаталог + ДанныеФайла.Имя;
			
			Попытка
				ДанныеФайла.ДвоичныеДанные.Записать(ИсходныйФайл);
			Исключение
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				ВызватьИсключение СтрШаблон("Не удалось записать временный файл при формировании пакета данных из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
			Попытка
				ЗаписьZipФайла.Добавить(ИсходныйФайл);
			Исключение
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				ВызватьИсключение СтрШаблон("Не удалось добавить файл в архив из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
		Попытка
			ЗаписьZipФайла.Записать();
		Исключение
			УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
			ВызватьИсключение СтрШаблон("Не удалось добавить файл в архив из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ФайлАрхива);
		
		// При необходимости делим архив на тома
		Если Максимум <> Неопределено
			И ДвоичныеДанныеАрхива.Размер() >= Максимум Тогда
			
			ЧастиАрхива = РазделитьДвоичныеДанные(ДвоичныеДанныеАрхива, Максимум * 0.7);// т.к. base64 увеличивает размер вложения примерно на треть
			
			НомерЧасти = 0;
			
			Для Каждого Часть Из ЧастиАрхива Цикл
				
				НомерЧасти = НомерЧасти + 1;
				
				Том = НовыйЭлемент.Тома.Добавить();
				
				Имя = ИмяАрхива + ".zip" + Формат(НомерЧасти, "ЧЦ='3'; ЧФ='.Ч'; ЧВН=''");
				
				ДанныеВерсии = Новый Структура;
				
				ДанныеВерсии.Вставить("Адрес",					ПоместитьВоВременноеХранилище(Часть));
				ДанныеВерсии.Вставить("Имя",					Имя);
				ДанныеВерсии.Вставить("Расширение",				"zip");
				ДанныеВерсии.Вставить("НаименованиеВладельца",	Строка(Вид));
				ДанныеВерсии.Вставить("ИдентификаторВладельца",	Строка(НовыйЭлемент.Ссылка.УникальныйИдентификатор()));
				ДанныеВерсии.Вставить("ТипВладельца",			"Файлы пакетов данных к обработке");
				
				Попытка
					Идентификаторы = РаботаСФайловымХранилищем.СоздатьФайл(ДанныеВерсии, Организация);
				Исключение
					УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
					ВызватьИсключение СтрШаблон("Не удалось сохранить данные файла в файловом хранилище из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
				Том.ИдентификаторВерсии	= Идентификаторы.ИдентификаторВерсии;
				Том.Имя					= Имя;
				Том.Размер				= Часть.Размер()/1048576;
				
				ВременныеФайлыКУдалению.Добавить(Новый Структура("ФайлВХранилище, ИдентификаторФайла", Истина, Идентификаторы.ИдентификаторФайла));
				
			КонецЦикла;
			
		Иначе
			
			Том = НовыйЭлемент.Тома.Добавить();
			
			ДанныеВерсии = Новый Структура;
			
			ДанныеВерсии.Вставить("Адрес",					ПоместитьВоВременноеХранилище(ДвоичныеДанныеАрхива));
			ДанныеВерсии.Вставить("Имя",					ИмяАрхива);
			ДанныеВерсии.Вставить("Расширение",				"zip");
			ДанныеВерсии.Вставить("НаименованиеВладельца",	Строка(Вид));
			ДанныеВерсии.Вставить("ИдентификаторВладельца",	Строка(НовыйЭлемент.Ссылка.УникальныйИдентификатор()));
			ДанныеВерсии.Вставить("ТипВладельца",			"Файлы пакетов данных к обработке");
			
			Попытка
				Идентификаторы = РаботаСФайловымХранилищем.СоздатьФайл(ДанныеВерсии, Организация);
			Исключение
				УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
				ВызватьИсключение СтрШаблон("Не удалось сохранить данные файла в файловом хранилище из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
			Том.ИдентификаторВерсии	= Идентификаторы.ИдентификаторВерсии;
			Том.Имя					= ИмяАрхива + ".zip";
			Том.Размер				= ДвоичныеДанныеАрхива.Размер()/1048576;
			
			ВременныеФайлыКУдалению.Добавить(Новый Структура("ФайлВХранилище, ИдентификаторФайла", Истина, Идентификаторы.ИдентификаторФайла));
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЗаполнениеПараметровПакета
	
	НовыйЭлемент.Организация = Организация;
	
	Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла Тогда
		
		НовыйЭлемент.Путь = Данные.Путь;
		
		Если Данные.Свойство("НеЗаменятьФайлыВКаталоге")
			И Данные.НеЗаменятьФайлыВКаталоге Тогда
			НовыйЭлемент.НеЗаменятьФайлыВКаталоге = Истина;
		КонецЕсли;
		
	Иначе
		
		// Тема
		Если Данные.Свойство("Тема") Тогда
			НовыйЭлемент.Тема = Данные.Тема;
		КонецЕсли;
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		// Отправитель
		Если Данные.Свойство("АдресОтправителя") Тогда
			
			НовыйЭлемент.АдресОтправителя = Данные.АдресОтправителя;
			
			Если Данные.Свойство("ПредставлениеОтправителя") Тогда
				НовыйЭлемент.ИмяОтправителя = Данные.ПредставлениеОтправителя;
			КонецЕсли;
			
		КонецЕсли;
		
		// Обратные адреса
		Если Данные.Свойство("ОбратныеАдреса") Тогда
			
			Для Каждого ОбратныйАдрес Из Данные.ОбратныеАдреса Цикл
				
				НовыйАдрес = НовыйЭлемент.ОбратныеАдреса.Добавить();
				
				НовыйАдрес.Адрес			= ОбратныйАдрес.Адрес;
				НовыйАдрес.Представление	= ОбратныйАдрес.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получатели
		Для Каждого Получатель Из МассивПолучателей Цикл
			
			НовыйПолучатель = НовыйЭлемент.Получатели.Добавить();
			
			НовыйПолучатель.Адрес			= Получатель.Адрес;
			НовыйПолучатель.Представление	= Получатель.Представление;
			
		КонецЦикла;
		
		// Получатели копий
		Если Данные.Свойство("ПолучателиКопий") Тогда
			
			Для Каждого Получатель Из МассивПолучателейКопий Цикл
				
				НовыйПолучатель = НовыйЭлемент.ПолучателиКопий.Добавить();
				
				НовыйПолучатель.Адрес			= Получатель.Адрес;
				НовыйПолучатель.Представление	= Получатель.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получатели слепых копий
		Если Данные.Свойство("ПолучателиСлепыхКопий") Тогда
			
			Для Каждого Получатель Из МассивПолучателейСлепыхКопий Цикл
				
				НовыйПолучатель = НовыйЭлемент.ПолучателиСлепыхКопий.Добавить();
				
				НовыйПолучатель.Адрес			= Получатель.Адрес;
				НовыйПолучатель.Представление	= Получатель.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получатели уведомлений о доставке
		Если Данные.Свойство("УведомитьОДоставке")
			И Данные.УведомитьОДоставке Тогда
			
			НовыйЭлемент.УведомитьОДоставке = Данные.УведомитьОДоставке;
			
			Для Каждого Получатель Из МассивПолучателейУведомленияОДоставке Цикл
				
				НовыйПолучатель = НовыйЭлемент.ПолучателиУведомленияОДоставке.Добавить();
				
				НовыйПолучатель.Адрес			= Получатель.Адрес;
				НовыйПолучатель.Представление	= Получатель.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получатели уведомлений о прочтении
		Если Данные.Свойство("УведомитьОПрочтении")
			И Данные.УведомитьОПрочтении Тогда
			
			НовыйЭлемент.УведомитьОПрочтении = Данные.УведомитьОПрочтении;
			
			Для Каждого Получатель Из МассивПолучателейУведомленияОПрочтении Цикл
				
				НовыйПолучатель = НовыйЭлемент.ПолучателиУведомленияОПрочтении.Добавить();
				
				НовыйПолучатель.Адрес			= Получатель.Адрес;
				НовыйПолучатель.Представление	= Получатель.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Идентификаторы оснований
		Если Данные.Свойство("ИдентификаторыОснований") Тогда
			НовыйЭлемент.ИдентификаторыОснований = Данные.ИдентификаторыОснований;
		КонецЕсли;
		
		// Важность
		Если Данные.Свойство("Важность") Тогда
			НовыйЭлемент.Важность = Данные.Важность;
		КонецЕсли;
		
		// Кодировка
		Если Данные.Свойство("Кодировка") Тогда
			НовыйЭлемент.Кодировка = Данные.Кодировка;
		КонецЕсли;
		
		// Обрабатывать тексты
		Если Данные.Свойство("ОбрабатыватьТексты") Тогда
			НовыйЭлемент.ОбрабатыватьТексты = Данные.ОбрабатыватьТексты;
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	НовыйЭлемент.Наименование = СтрШаблон("%1 от %2", НовыйЭлемент.Вид, Формат(НовыйЭлемент.ДатаСоздания, "ДЛФ=DT"));
	
	Если Данные.Свойство("КомментарийКОтменеОбработки") И Не ПустаяСтрока(Данные.КомментарийКОтменеОбработки) Тогда
	
		НовыйЭлемент.ОбработкаОтменена = Истина;
		НовыйЭлемент.Комментарий = Данные.КомментарийКОтменеОбработки;
		НовыйЭлемент.ДатаОтмены = ТекущаяДатаСеанса();
		НовыйЭлемент.ОтменившийПользователь = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
	
	КонецЕсли;
	
	#Область ЗаписьПакетаДанных
	
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		УдалитьВременныеФайлы(ВременныеФайлыКУдалению);
		Возврат Неопределено;
	КонецПопытки;
	
	#КонецОбласти
	
	Если НовыйЭлемент.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла
		И ОповеститьОбАрхивацииПривязанныхКТекстуФайлов Тогда
		Справочники.Оповещения.СформироватьОповещения("Справочник.ПакетыДанныхКОбработке", Перечисления.ТипыСобытий.ПриЗаписиСправочников, Новый Структура("ПакетДанных", НовыйЭлемент.Ссылка));
	КонецЕсли;
	
	УдалитьВременныеФайлы(ВременныйКаталог);
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура ВыполнитьОбработкуПакетовДанных(ПакетыДанных, СообщенияОбОшибках)
	
	ВыборкаПакеты = ПолучитьДанныеПакетовДляОбработки(ПакетыДанных);
	
	Пока ВыборкаПакеты.Следующий() Цикл
		
		Попытка
			ВыполнитьОбработкуПакета(ВыборкаПакеты);
		Исключение
			СообщенияОбОшибках.Добавить(СтрШаблон("Не удалось обработать '%1' из-за ошибки:%2", ВыборкаПакеты.Пакет, Символы.ПС + ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьОтправкуПисьма(Соединение, Письмо, ДанныеДляОбработки, ИдентификаторТома = "")
	
	Результат = Истина;
	
	ДанныеЗаписи = Новый Структура;
	
	ДанныеЗаписи.Вставить("ПакетДанных",		ДанныеДляОбработки.Пакет);
	ДанныеЗаписи.Вставить("ИдентификаторТома",	ИдентификаторТома);
	ДанныеЗаписи.Вставить("ОбработкаВыполнена",	Истина);
	
	Попытка
		РезультатОтправки = Соединение.Послать(Письмо, ?(ДанныеДляОбработки.ОбрабатыватьТексты, ОбработкаТекстаИнтернетПочтовогоСообщения.Обрабатывать, ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать));
	Исключение
		
		ДанныеЗаписи.Вставить("ОбработкаВыполнена",	Ложь);
		ДанныеЗаписи.Вставить("Примечание",			ОписаниеОшибки());
		
		Результат = Ложь;
		
	КонецПопытки;
	
	// Если функция Послать вернула непустой результат, письмо не отправится ни одному из получателей
	// такая ситуация происходит, когда в однин из адресов получателей указан некорректно (не соответствует формату)
	// поэтому если получили непустой результат, считаем письмо не отправленным
	Если ДанныеЗаписи.ОбработкаВыполнена
		И РезультатОтправки.Количество() > 0 Тогда
		
		Для Каждого ОшибочныйАдрес Из РезультатОтправки Цикл
			
			ДанныеЗаписи.Вставить("ОбработкаВыполнена",	Ложь);
			ДанныеЗаписи.Вставить("Примечание",			СтрШаблон("Почтовый сервер не принял адрес получателя '%1' из-за ошибки:%2", ОшибочныйАдрес.Ключ, Символы.ПС + ОшибочныйАдрес.Значение));
			
			Результат = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДобавитьЗаписьВЖурналОбработкиПакетов(ДанныеЗаписи);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьОбработкуПакета(Пакет)
	
	РезультатОбработкиПакета = Истина;
	
	ЭтоТестоваяИнформационнаяБаза = НЕ ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза");
	
	// Если передана ссылка, получаем данные пакета
	Если ТипЗнч(Пакет) = Тип("СправочникСсылка.ПакетыДанныхКОбработке") Тогда
		
		// Получаем выборку с данными пакета
		ДанныеДляОбработки = ПолучитьДанныеПакетовДляОбработки(Пакет);
		
		Если НЕ ДанныеДляОбработки.Следующий() Тогда
			ВызватьИсключение "Пакет данных не подлежит обработке. Возможные причины: пакет уже обработан / обработка пакета отменена / пакет помечен на удаление.";
		КонецЕсли;
		
	Иначе
		ДанныеДляОбработки = Пакет;
	КонецЕсли;
	
	// Проверяем, что обработка пакета не отменена.
	Если ДанныеДляОбработки.ОбработкаОтменена Тогда
		ВызватьИсключение "Обработка пакета была отменена!";
	КонецЕсли;
	
	// Блокируем пакет перед обработкой
	ПакетОбъект = ДанныеДляОбработки.Пакет.ПолучитьОбъект();
	
	Попытка
		ПакетОбъект.Заблокировать();
	Исключение
		
		ТекстОписанияОшибки = ОписаниеОшибки();
		ТекстОшибкиБлокировки = "Ошибка при вызове метода контекста (Заблокировать): Не удалось заблокировать запись. Действие (изменение, удаление или блокировка записи) не выполнено";
		Если СтрНайти(ТекстОписанияОшибки, ТекстОшибкиБлокировки) <> 0 Тогда
			ЗаписьЖурналаРегистрации("Блокировка пакета данных", УровеньЖурналаРегистрации.Предупреждение, ПакетОбъект.Метаданные(), ДанныеДляОбработки.Пакет, ТекстОписанияОшибки);
			Возврат;
		Иначе
			ВызватьИсключение СтрШаблон("Не удалось заблокировать '%1' из-за ошибки:%2", ДанныеДляОбработки.Пакет, Символы.ПС + ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;
	
	#Область ОпределениеОбработанныхТомовАрхива
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пакет", ДанныеДляОбработки.Пакет);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналОбработкиПакетовДанныхСрезПоследних.ИдентификаторТома КАК ИдентификаторТома
		|ИЗ
		|	РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(
		|			,
		|			ПакетДанных = &Пакет
		|				И ПакетДанных.РазделенНаТома
		|				И ИдентификаторТома <> """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|ГДЕ
		|	ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена";
	
	ИдентификаторыОбработанныхТомов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторТома");
	
	#КонецОбласти
	
	#Область ПолучениеДанныхИзФайловогоХранилища
	
	ДанныеФайловКОбработке = Новый Соответствие;
	
	Если НЕ ДанныеДляОбработки.РазделенНаТома Тогда
		ВыборкаТабличнойЧасти = ДанныеДляОбработки.Файлы.Выбрать();
	Иначе
		ВыборкаТабличнойЧасти = ДанныеДляОбработки.Тома.Выбрать();
	КонецЕсли;
	
	ИндексВложения = 0;
	
	Пока ВыборкаТабличнойЧасти.Следующий() Цикл
		
		ИндексВложения = ИндексВложения + 1;
		
		Если ИдентификаторыОбработанныхТомов.Найти(ВыборкаТабличнойЧасти.ИдентификаторВерсии) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ПолученныеДанные = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(ВыборкаТабличнойЧасти.ИдентификаторВерсии);
		Исключение
			ВызватьИсключение СтрШаблон("Не удалось получить данные версии файла из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ДанныеФайла = Новый Структура;
		
		ДанныеФайла.Вставить("Адрес",					ПолученныеДанные.Адрес);
		ДанныеФайла.Вставить("Имя",						ВыборкаТабличнойЧасти.Имя);
		
		Если ДанныеДляОбработки.РазделенНаТома Тогда
			ДанныеФайла.Вставить("ИдентификаторТома", ВыборкаТабличнойЧасти.ИдентификаторВерсии);
		ИначеЕсли ДанныеДляОбработки.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
			ДанныеФайла.Вставить("ПривязанКТексту",			ВыборкаТабличнойЧасти.ПривязанКТексту);
			ДанныеФайла.Вставить("ИдентификаторВложения",	ВыборкаТабличнойЧасти.ИдентификаторВложения);
		КонецЕсли;
		
		ДанныеФайловКОбработке.Вставить(ИндексВложения, ДанныеФайла);
		
	КонецЦикла;
	
	#КонецОбласти
	
	Если ДанныеДляОбработки.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла Тогда
		
		#Область ВыгрузкаФайлов
		
		Для ИндексФайла = 1 По ДанныеФайловКОбработке.Количество() Цикл
			
			Результат = Истина;
			
			Файл = ДанныеФайловКОбработке.Получить(ИндексФайла);
			
			ДанныеЗаписи = Новый Структура;
			
			ДанныеЗаписи.Вставить("ПакетДанных", ДанныеДляОбработки.Пакет);
			
			Если ДанныеДляОбработки.РазделенНаТома Тогда
				ДанныеЗаписи.Вставить("ИдентификаторТома", Файл.ИдентификаторТома);
			КонецЕсли;
			
			Попытка
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(Файл.Адрес);
			Исключение
				
				Результат					= Ложь;
				РезультатОбработкиПакета	= Ложь;
				
				ДанныеЗаписи.Вставить("Примечание", СтрШаблон("При получении данных файла из временного хранилища произошла ошибка:%1", Символы.ПС + ОписаниеОшибки()));
				
			КонецПопытки;
			
			ПолноеИмяФайла = Неопределено;
			
			Если Результат Тогда
				
				Если ЭтоТестоваяИнформационнаяБаза Тогда
					
					КаталогДляТестовойБазы = Константы.КаталогВыгрузкиФайловДляТестовойБазы.Получить();
					
					Если НЕ ЗначениеЗаполнено(КаталогДляТестовойБазы) Тогда
						
						Результат					= Ложь;
						РезультатОбработкиПакета	= Ложь;
						
						ДанныеЗаписи.Вставить("Примечание", "Не удалось записать файл т.к. не установлено значение константы 'Каталог выгрузки файлов для тестовой базы'!");
						
					Иначе
						ПолноеИмяФайла = КаталогДляТестовойБазы;
					КонецЕсли;
					
				Иначе
					ПолноеИмяФайла = ДанныеДляОбработки.Путь;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
					
					Если Прав(ПолноеИмяФайла, 1) <> "\" Тогда
						ПолноеИмяФайла = ПолноеИмяФайла + "\";
					КонецЕсли;
					
					ПолноеИмяФайла = ПолноеИмяФайла + Файл.Имя;
					
					Если ДанныеДляОбработки.НеЗаменятьФайлыВКаталоге Тогда
						
						ОбъектФайл = Новый Файл(ПолноеИмяФайла);
						
						Если ОбъектФайл.Существует() Тогда
							
							Результат					= Ложь;
							РезультатОбработкиПакета	= Ложь;
							
							ДанныеЗаписи.Вставить("Примечание", СтрШаблон("Не удалось записать файл '%1' из-за того, что одноименный файл уже существует!", ПолноеИмяФайла));
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Результат Тогда
					
					Попытка
						ДвоичныеДанные.Записать(ПолноеИмяФайла);
					Исключение
						
						Результат					= Ложь;
						РезультатОбработкиПакета	= Ложь;
						
						ДанныеЗаписи.Вставить("Примечание", СтрШаблон("Не удалось записать файл '%1' из-за ошибки:%2", ПолноеИмяФайла, Символы.ПС + ОписаниеОшибки()));
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ДанныеЗаписи.Вставить("ОбработкаВыполнена", Результат);
			
			ДобавитьЗаписьВЖурналОбработкиПакетов(ДанныеЗаписи);
			
		КонецЦикла;
		
		#КонецОбласти
		
	ИначеЕсли ДанныеДляОбработки.Вид = Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо Тогда
		
		#Область ЭлектронноеПисьмо
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		
		// Определяем учетную запись
		Если ЭтоТестоваяИнформационнаяБаза Тогда
			УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ТестоваяУчетнаяЗаписьЭлектроннойПочты;
		ИначеЕсли ЗначениеЗаполнено(ДанныеДляОбработки.УчетнаяЗапись) Тогда
			УчетнаяЗапись = ДанныеДляОбработки.УчетнаяЗапись;
		Иначе
			УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ТестоваяУчетнаяЗаписьЭлектроннойПочты;
		КонецЕсли;
		
		Если НЕ ЭтоТестоваяИнформационнаяБаза Тогда
			
			// Если указан адрес отправителя, используем его
			// если не указан, все данные об отправителе получаем из учетной записи
			Если ЗначениеЗаполнено(ДанныеДляОбработки.АдресОтправителя) Тогда
				Письмо.ИмяОтправителя				= ДанныеДляОбработки.ИмяОтправителя;
				Письмо.Отправитель.ОтображаемоеИмя	= ДанныеДляОбработки.ИмяОтправителя;
				Письмо.Отправитель.Адрес			= ДанныеДляОбработки.АдресОтправителя;
			Иначе
				Письмо.ИмяОтправителя				= УчетнаяЗапись.Наименование;
				Письмо.Отправитель.ОтображаемоеИмя	= УчетнаяЗапись.Наименование;
				Письмо.Отправитель.Адрес			= УчетнаяЗапись.АдресЭлектроннойПочты;
			КонецЕсли;
			
			// Обратные адреса
			ОбратныеАдреса = ДанныеДляОбработки.ОбратныеАдреса.Выбрать();
			
			Пока ОбратныеАдреса.Следующий() Цикл
				
				НовыйОбратныйАдрес = Письмо.ОбратныйАдрес.Добавить();
				
				НовыйОбратныйАдрес.Адрес			= ОбратныеАдреса.Адрес;
				НовыйОбратныйАдрес.ОтображаемоеИмя	= ОбратныеАдреса.Представление;
				
			КонецЦикла;
			
			// Получатели
			Получатели = ДанныеДляОбработки.Получатели.Выбрать();
			
			Пока Получатели.Следующий() Цикл
				
				Получатель = Письмо.Получатели.Добавить();
				
				Получатель.Адрес			= Получатели.Адрес;
				Получатель.ОтображаемоеИмя	= Получатели.Представление;
				
			КонецЦикла;
			
			// Получатели копий
			ПолучателиКопий = ДанныеДляОбработки.ПолучателиКопий.Выбрать();
			
			Пока ПолучателиКопий.Следующий() Цикл
				
				ПолучательКопий = Письмо.Копии.Добавить();
				
				ПолучательКопий.Адрес			= ПолучателиКопий.Адрес;
				ПолучательКопий.ОтображаемоеИмя	= ПолучателиКопий.Представление;
				
			КонецЦикла;
			
			// Получатели слепых копий
			ПолучателиСлепыхКопий = ДанныеДляОбработки.ПолучателиСлепыхКопий.Выбрать();
			
			Пока ПолучателиСлепыхКопий.Следующий() Цикл
				
				ПолучательСлепойКопии = Письмо.СлепыеКопии.Добавить();
				
				ПолучательСлепойКопии.Адрес				= ПолучателиСлепыхКопий.Адрес;
				ПолучательСлепойКопии.ОтображаемоеИмя	= ПолучателиСлепыхКопий.Представление;
				
			КонецЦикла;
			
			// Уведомление о доставке
			Если ДанныеДляОбработки.УведомитьОДоставке Тогда
				
				Письмо.УведомитьОДоставке = Истина;
				
				// Получатели слепых копий
				АдресаУведомленияОДоставке = ДанныеДляОбработки.ПолучателиУведомленияОДоставке.Выбрать();
				
				Пока АдресаУведомленияОДоставке.Следующий() Цикл
					
					АдресУведомления = Письмо.АдресаУведомленияОДоставке.Добавить();
					
					АдресУведомления.Адрес				= АдресаУведомленияОДоставке.Адрес;
					АдресУведомления.ОтображаемоеИмя	= АдресаУведомленияОДоставке.Представление;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// Уведомление о прочтении
			Если ДанныеДляОбработки.УведомитьОПрочтении Тогда
				
				Письмо.УведомитьОПрочтении = Истина;
				
				// Получатели слепых копий
				АдресаУведомленияОПрочтении = ДанныеДляОбработки.ПолучателиУведомленияОПрочтении.Выбрать();
				
				Пока АдресаУведомленияОПрочтении.Следующий() Цикл
					
					АдресУведомления = Письмо.АдресаУведомленияОПрочтении.Добавить();
					
					АдресУведомления.Адрес				= АдресаУведомленияОПрочтении.Адрес;
					АдресУведомления.ОтображаемоеИмя	= АдресаУведомленияОПрочтении.Представление;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			// Переопределяем параметры письма и учетную запись
			Письмо.ИмяОтправителя				= УчетнаяЗапись.Наименование;
			Письмо.Отправитель.ОтображаемоеИмя	= УчетнаяЗапись.Наименование;
			Письмо.Отправитель.Адрес			= УчетнаяЗапись.АдресЭлектроннойПочты;
			
			АдресТекущегоПользователя = РаботаСПользователями.ТекущийПользователь().АдресЭлектроннойПочты;
			
			Если НЕ ЗначениеЗаполнено(АдресТекущегоПользователя) Тогда
				ВызватьИсключение "Не удалось отправить письмо из-за незаполненного адреса электронной почты текущего пользователя!";
			КонецЕсли;
			
			Письмо.ОбратныйАдрес.Добавить(АдресТекущегоПользователя);
			Письмо.Получатели.Добавить(АдресТекущегоПользователя);
			
			Если ДанныеДляОбработки.УведомитьОДоставке Тогда
				Письмо.УведомитьОДоставке = Истина;
				
				Письмо.АдресаУведомленияОДоставке.Добавить(АдресТекущегоПользователя);
			КонецЕсли;
			
			Если ДанныеДляОбработки.УведомитьОПрочтении Тогда
				Письмо.УведомитьОПрочтении = Истина;
				
				Письмо.АдресаУведомленияОПрочтении.Добавить(АдресТекущегоПользователя);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДанныеДляОбработки.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML
			ИЛИ ДанныеДляОбработки.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		ИначеЕсли ДанныеДляОбработки.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст Тогда
			ТипТекста = ТипТекстаПочтовогоСообщения.РазмеченныйТекст;
		Иначе
			ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		КонецЕсли;
		
		// Текст и тип текста письма
		Письмо.Тексты.Добавить(ДанныеДляОбработки.Текст, ТипТекста);
		
		// Важность
		Если ДанныеДляОбработки.Важность = Перечисления.ВидыВажностиЭлектронногоПисьма.Наивысшая Тогда
			Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Наивысшая;
		ИначеЕсли ДанныеДляОбработки.Важность = Перечисления.ВидыВажностиЭлектронногоПисьма.Высокая Тогда
			Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
		ИначеЕсли ДанныеДляОбработки.Важность = Перечисления.ВидыВажностиЭлектронногоПисьма.Низкая Тогда
			Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Низкая;
		ИначеЕсли ДанныеДляОбработки.Важность = Перечисления.ВидыВажностиЭлектронногоПисьма.Наименьшая Тогда
			Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Наименьшая;
		Иначе
			Письмо.Важность = ВажностьИнтернетПочтовогоСообщения.Обычная;
		КонецЕсли;
		
		// Кодировка
		Письмо.Кодировка = ДанныеДляОбработки.Кодировка;
		
		// Идентификаторы оснований
		Письмо.УстановитьПолеЗаголовка("References", ДанныеДляОбработки.ИдентификаторыОснований);
		
		Соединение = Новый ИнтернетПочта;
		
		Попытка
			Соединение.Подключиться(РаботаСЭлектроннойПочтой.СформироватьИнтернетПрофиль(УчетнаяЗапись));
		Исключение
			ВызватьИсключение СтрШаблон("Не удалось подключиться к почтовому серверу из-за ошибки:%1", Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
			
		// Если разделено на тома, отправляем вложения разными письмами
		Если ДанныеДляОбработки.РазделенНаТома Тогда
			
			Для ИндексТома = 1 По ДанныеФайловКОбработке.Количество() Цикл
				
				// Тема письма
				Письмо.Тема = СтрШаблон("%1 (%2 из %3)", ДанныеДляОбработки.Тема, ИндексТома, ДанныеФайловКОбработке.Количество());
				
				Письмо.Вложения.Очистить();
				
				Файл = ДанныеФайловКОбработке.Получить(ИндексТома);
				
				Вложение = Письмо.Вложения.Добавить(ПолучитьИзВременногоХранилища(Файл.Адрес), Файл.Имя);
				
				Если НЕ ВыполнитьОтправкуПисьма(Соединение, Письмо, ДанныеДляОбработки, Файл.ИдентификаторТома) Тогда
					РезультатОбработкиПакета = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		// Если не разделено, отправляем все одним письмом
		Иначе
			
			// Тема письма
			Письмо.Тема = ДанныеДляОбработки.Тема;
			
			Для ИндексФайла = 1 По ДанныеФайловКОбработке.Количество() Цикл
				
				Файл = ДанныеФайловКОбработке.Получить(ИндексФайла);
				
				Вложение = Письмо.Вложения.Добавить(ПолучитьИзВременногоХранилища(Файл.Адрес), Файл.Имя);
				
				Если Файл.Свойство("ПривязанКТексту")
					И Файл.ПривязанКТексту Тогда
					Вложение.Идентификатор = Файл.Значение.ИдентификаторВложения;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ВыполнитьОтправкуПисьма(Соединение, Письмо, ДанныеДляОбработки) Тогда
				РезультатОбработкиПакета = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	// Фиксируем успешную обработку пакета
	Если ДанныеДляОбработки.РазделенНаТома
		И РезультатОбработкиПакета Тогда
		
		ДанныеЗаписи = Новый Структура;
		
		ДанныеЗаписи.Вставить("ПакетДанных",		ДанныеДляОбработки.Пакет);
		ДанныеЗаписи.Вставить("ОбработкаВыполнена",	Истина);
		
		ДобавитьЗаписьВЖурналОбработкиПакетов(ДанныеЗаписи);
		
	КонецЕсли;
	
	// Снимаем блокировку пакета
	ПакетОбъект.Разблокировать();
	
КонецПроцедуры

Процедура ДобавитьЗаписьВЖурналОбработкиПакетов(ДанныеЗаписи)
	
	Дата = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ЖурналОбработкиПакетовДанных.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.ПакетДанных.Установить(ДанныеЗаписи.ПакетДанных);
	
	Если ДанныеЗаписи.Свойство("ИдентификаторТома") Тогда
		НаборЗаписей.Отбор.ИдентификаторТома.Установить(ДанныеЗаписи.ИдентификаторТома);
	Иначе
		НаборЗаписей.Отбор.ИдентификаторТома.Установить("");
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Период				= Дата;
	НоваяЗапись.ПакетДанных			= ДанныеЗаписи.ПакетДанных;
	НоваяЗапись.ОбработкаВыполнена	= ДанныеЗаписи.ОбработкаВыполнена;
	
	ДанныеЗаписи.Свойство("ИдентификаторТома",	НоваяЗапись.ИдентификаторТома);
	ДанныеЗаписи.Свойство("Примечание",			НоваяЗапись.Примечание);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(СтрШаблон("Не удалось зафиксировать %1 обработку %2%3!",
																		?(ДанныеЗаписи.ОбработкаВыполнена, "успешную", "неудачную"),
																		ДанныеЗаписи.ПакетДанных,
																		?(ДанныеЗаписи.Свойство("ИдентификаторТома"), " с идентификатором тома " + ДанныеЗаписи.ИдентификаторТома, "")));
	КонецПопытки;
	
	// Добавляем запись в ЖР для уведомления об ошибке
	Если НЕ ДанныеЗаписи.ОбработкаВыполнена Тогда
		ЗаписьЖурналаРегистрации("Обработка пакетов данных", УровеньЖурналаРегистрации.Ошибка,, ДанныеЗаписи.ПакетДанных, ДанныеЗаписи.Примечание);
	КонецЕсли;
	
	// Если запись по пакету и он успешно обработан
	Если (НЕ ДанныеЗаписи.Свойство("ИдентификаторТома") ИЛИ ПустаяСтрока(ДанныеЗаписи.ИдентификаторТома))
		И ДанныеЗаписи.ОбработкаВыполнена Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ПакетДанных", ДанныеЗаписи.ПакетДанных);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналСобытийСОтчетами.Экземпляр КАК Экземпляр,
			|	ВЫБОР
			|		КОГДА ЖурналСобытийСОтчетами.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеПисьма)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.ОтправкаПисьмом)
			|		КОГДА ЖурналСобытийСОтчетами.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеВыгрузкиВЭДО)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.ВыгрузкаВЭДО)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.ОтправкаПисьмомПоПросьбе)
			|	КОНЕЦ КАК Событие,
			|	ЖурналСобытийСОтчетами.ИдентификаторВерсии КАК ИдентификаторВерсии,
			|	ЖурналСобытийСОтчетами.ПакетДанных КАК ПакетДанных
			|ИЗ
			|	РегистрСведений.ЖурналСобытийСОтчетами КАК ЖурналСобытийСОтчетами
			|ГДЕ
			|	ЖурналСобытийСОтчетами.ПакетДанных = &ПакетДанных
			|	И ЖурналСобытийСОтчетами.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеПисьма), ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеВыгрузкиВЭДО), ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеПисьмаПоПросьбе))";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			РаботаСОтчетами.ЗафиксироватьСобытиеСОтчетом(Выборка.Событие, Выборка.Экземпляр, Выборка.ИдентификаторВерсии, Выборка.ПакетДанных);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПакетовДляОбработки(Пакеты)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пакеты", Пакеты);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Вид КАК Вид,
		|	ПакетыДанныхКОбработке.Организация КАК Организация,
		|	ПакетыДанныхКОбработке.РазделенНаТома КАК РазделенНаТома,
		|	ПакетыДанныхКОбработке.Путь КАК Путь,
		|	ПакетыДанныхКОбработке.НеЗаменятьФайлыВКаталоге КАК НеЗаменятьФайлыВКаталоге,
		|	ПакетыДанныхКОбработке.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ПакетыДанныхКОбработке.АдресОтправителя КАК АдресОтправителя,
		|	ПакетыДанныхКОбработке.ИмяОтправителя КАК ИмяОтправителя,
		|	ПакетыДанныхКОбработке.Тема КАК Тема,
		|	ПакетыДанныхКОбработке.Текст КАК Текст,
		|	ПакетыДанныхКОбработке.ТипТекста КАК ТипТекста,
		|	ПакетыДанныхКОбработке.Важность КАК Важность,
		|	ПакетыДанныхКОбработке.Кодировка КАК Кодировка,
		|	ПакетыДанныхКОбработке.ОбрабатыватьТексты КАК ОбрабатыватьТексты,
		|	ПакетыДанныхКОбработке.УведомитьОДоставке КАК УведомитьОДоставке,
		|	ПакетыДанныхКОбработке.УведомитьОПрочтении КАК УведомитьОПрочтении,
		|	ПакетыДанныхКОбработке.ИдентификаторыОснований КАК ИдентификаторыОснований,
		|	ПакетыДанныхКОбработке.ОбработкаОтменена КАК ОбработкаОтменена,
		|	ПакетыДанныхКОбработке.Файлы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ИдентификаторВерсии КАК ИдентификаторВерсии,
		|		Имя КАК Имя,
		|		ПривязанКТексту КАК ПривязанКТексту,
		|		ИдентификаторВложения КАК ИдентификаторВложения
		|	) КАК Файлы,
		|	ПакетыДанныхКОбработке.Тома.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ИдентификаторВерсии КАК ИдентификаторВерсии,
		|		Имя КАК Имя
		|	) КАК Тома,
		|	ПакетыДанныхКОбработке.Получатели.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК Получатели,
		|	ПакетыДанныхКОбработке.ПолучателиКопий.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК ПолучателиКопий,
		|	ПакетыДанныхКОбработке.ПолучателиСлепыхКопий.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК ПолучателиСлепыхКопий,
		|	ПакетыДанныхКОбработке.ПолучателиУведомленияОДоставке.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК ПолучателиУведомленияОДоставке,
		|	ПакетыДанныхКОбработке.ПолучателиУведомленияОПрочтении.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК ПолучателиУведомленияОПрочтении,
		|	ПакетыДанныхКОбработке.ОбратныеАдреса.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Адрес КАК Адрес,
		|		Представление КАК Представление
		|	) КАК ОбратныеАдреса,
		|	ПакетыДанныхКОбработке.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.Ссылка В(&Пакеты)
		|	И НЕ ПакетыДанныхКОбработке.ПометкаУдаления
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена
		|	И НЕ ПакетыДанныхКОбработке.Ссылка В
		|				(ВЫБРАТЬ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ПакетДанных КАК ПакетДанных
		|				ИЗ
		|					РегистрСведений.ЖурналОбработкиПакетовДанных.СрезПоследних(, ПакетДанных В (&Пакеты)
		|						И ИдентификаторТома = """") КАК ЖурналОбработкиПакетовДанныхСрезПоследних
		|				ГДЕ
		|					ЖурналОбработкиПакетовДанныхСрезПоследних.ОбработкаВыполнена)";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Процедура УдалитьВременныеФайлы(УдаляемыеФайлы)
	
	Если ТипЗнч(УдаляемыеФайлы) <> Тип("Строка") Тогда
		
		// Передан список файлов
		Для Каждого Файл Из УдаляемыеФайлы Цикл
			
			Если Файл.ФайлВХранилище Тогда
				
				Попытка
					РаботаСФайловымХранилищем.УдалитьФайл(Файл.ИдентификаторФайла);
				Исключение
					// Информируем ответственных.
				КонецПопытки;
				
			Иначе
				
				Попытка
					УдалитьФайлы(Файл.Имя);
				Исключение
					// Информируем ответственных.
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		// Передано имя каталога или файла
		Попытка
			УдалитьФайлы(УдаляемыеФайлы);
		Исключение
			// Информируем ответственных.
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти