// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Расчет стоимости депозита",
		"0.12",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Возвращает параметры выполняемой по регламентному заданию команды для подключения к механизму регистрации работы
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды  
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды, ПараметрыКоманды)
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ПараметрыОтчета.Вставить("Период", ЭтотОбъект.Период);

	Если ПараметрыКоманды.Свойство("Организация") Тогда
		ПараметрыОтчета.Вставить("Организация", ПараметрыКоманды.Организация);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("ПолучателиОповещения") Тогда
		ПараметрыОтчета.Вставить("ПолучателиОповещения", ПараметрыКоманды.ПолучателиОповещения);
	КонецЕсли;
	
	Описание = "";
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Описание = Описание + ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение + Символы.ПС;		
	КонецЦикла;
	Описание = Лев(Описание, СтрДлина(Описание) - СтрДлина(Символы.ПС));	
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

