
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОбновитьДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(НеСообщатьОбИзмененииОбъектов = Неопределено, НеСообщатьОбОтсутствииИзменений = Неопределено)

	РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Запись.Вексель, , , НеСообщатьОбИзмененииОбъектов, НеСообщатьОбОтсутствииИзменений);
		
	ЭтаФорма.Прочитать();
	
КонецПроцедуры
