// Проверяет права на доступ к задачам на согласование документов 
// и открывает форму с текущими задачами пользователя
Процедура ОткрытьЗадачиПользователяНаСогласованиеДокументов() Экспорт
	
	Если РаботаСБизнесПроцессамиИЗадачами.КоличествоНевыполненныхЗадачТекущегоПользователя() Тогда
		
		ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.ФормаСписка");
		
	КонецЕсли;
		
КонецПроцедуры 

Процедура ЗавершитьОтменитьБизнесПроцесс(Форма, БизнесПроцесс, Отказ) Экспорт
	
	РеквизитыБизнесПроцесса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БизнесПроцесс, "Отменен, Завершен");
	
	Если РеквизитыБизнесПроцесса.Завершен = Истина Тогда
		ПоказатьПредупреждение(, СтрШаблон("Бизнес-процесс %1 завершён. Отмена невозможна.", БизнесПроцесс));
		
	ИначеЕсли РеквизитыБизнесПроцесса.Отменен = Истина Тогда
		ПоказатьПредупреждение(, СтрШаблон("Бизнес-процесс %1 отменён. Повторная отмена невозможна.", БизнесПроцесс));
	
	ИначеЕсли Вопрос("Бизнес-процесс будет отменён, подчинённые задачи будут прекращены. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСБизнесПроцессамиИЗадачами.ЗавершитьОтменитьБизнесПроцесс(БизнесПроцесс, Отказ);
		Форма.Прочитать();
		
	КонецЕсли;
	
КонецПроцедуры