
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ЭлементОтбора ИЗ ЭтотОбъект.Список.Отбор.Элементы  Цикл 
		Если ЭлементОтбора.ЛевоеЗначение = ЭтотОбъект.Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("ВыбраннаяФорма").Поле Тогда    
			 // ищем формы 2024 г.: Например "ФормаОтчета_МСФО9_2024"  
			 // Формы 2024 г. сделаны на основе форм 2020. Для поиска отчета за прошлый год нужно показывать обе редакции формы.  
			СтрокаВыбраннаяФорма = ЭлементОтбора.ПравоеЗначение; 
			Если Прав(СтрокаВыбраннаяФорма, 4) = "2024" Тогда
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				МассивФорм = Новый Массив;
				МассивФорм.Добавить(СтрокаВыбраннаяФорма);
				МассивФорм.Добавить(СтрЗаменить(СтрокаВыбраннаяФорма, "_2024", "_2020"));
				ЭлементОтбора.ПравоеЗначение = МассивФорм;      
			ИначеЕсли СтрокаВыбраннаяФорма = "ФормаОтчета_07100001_2025" Тогда    // Баланс РСБУ 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				МассивФорм = Новый Массив;
				МассивФорм.Добавить(СтрокаВыбраннаяФорма);
				МассивФорм.Добавить("ФормаОтчета_07100001");
				ЭлементОтбора.ПравоеЗначение = МассивФорм; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры
