
&НаКлиенте
Процедура КомпоновщикНастройкиОтборДоступныеПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПолеОтбора = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	Закрыть(Новый Структура("Заголовок, Поле", ПолеОтбора.Заголовок, ПолеОтбора.Поле));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.НаборДанных = Параметры.Базис.НаборДанных;
	ЭтаФорма.ТекущееПоле = Параметры.ТекущееПоле;
	
	СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса(ЭтаФорма.НаборДанных);
	Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
		
		ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
		ЭтаФорма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.АдресСКД));
		ДоступноеПолеОтбора = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ЭтаФорма.ТекущееПоле));
		Если Не ДоступноеПолеОтбора = Неопределено Тогда
			Идентификатор = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.ПолучитьИдентификаторПоОбъекту(ДоступноеПолеОтбора);
			Элементы.КомпоновщикНастройкиОтборДоступныеПоляОтбора.ТекущаяСтрока = Идентификатор;
		КонецЕсли; 
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить СКД выбранного набора данных");
	КонецЕсли;
		
КонецПроцедуры
