
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСКД = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
	ТекстЗапроса = Параметры.ТекстЗапроса;
	Ресурсы = Параметры.Ресурсы;
	
	СформироватьСКДНаСервере(АдресСКД, ТекстЗапроса, Ресурсы);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Для каждого ДоступноеПолеВыбора Из Настройки.ДоступныеПоляВыбора.Элементы Цикл
	
		Если Не ДоступноеПолеВыбора.Заголовок = "Системные поля" Тогда
			ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбор.Использование = Истина;
			ПолеВыбор.Поле = ДоступноеПолеВыбора.Поле;
		КонецЕсли; 
	
	КонецЦикла; 
	
	НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления", "МакетОформленияОтчетовЗеленый");
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабличныйДокумент = СформироватьОтчетНаСервере(АдресСКД, КомпоновщикНастроек, АдресДанныхРасшифровки);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(ТабличныйДокумент.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ТабличныйДокументПриАктивизацииОбластиПодключаемый", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.АдресДанныхРасшифровки, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			
			ОткрытьЗначение(Значение);
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СформироватьСКДНаСервере(АдресСКД, ТекстЗапроса, Ресурсы)
	
	// создаем новую СКД
	СКД = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанныхРейтинги = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанныхРейтинги.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанныхРейтинги.Имя = "Запрос";
	НаборДанныхРейтинги.ИсточникДанных = "ИсточникДанных1";
	НаборДанныхРейтинги.Запрос = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(Ресурсы) Тогда
		МассивРесурсов = СтрРазделить(СтрЗаменить(Ресурсы, " ", ""), ",");
		Для каждого Ресурс Из МассивРесурсов Цикл
			ПолеИтога = СКД.ПоляИтога.Добавить();
			ПолеИтога.Выражение = "Сумма(" + Ресурс + ")";
			ПолеИтога.ПутьКДанным = Ресурс;
		КонецЦикла; 
	КонецЕсли; 
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	Для каждого Параметр Из СхемаЗапроса.НайтиПараметры() Цикл
	
		ПараметрСКД = СКД.Параметры.Добавить();
		ЗаполнитьЗначенияСвойств(ПараметрСКД, Параметр);
		ПараметрСКД.ОграничениеИспользования = Ложь;
		ПараметрСКД.ВключатьВДоступныеПоля = Ложь;
		ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	
	КонецЦикла; 
	
	ПоместитьВоВременноеХранилище(СКД, АдресСКД);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьОтчетНаСервере(АдресСКД, КомпоновщикНастроек, АдресДанныхРасшифровки)

	СКД = ПолучитьИзВременногоХранилища(АдресСКД);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПоместитьВоВременноеХранилище(ДанныеРасшифровки, АдресДанныхРасшифровки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Возврат ДокументРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРасшифровки(АдресДанныхРасшифровки, Расшифровка)

	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

&НаКлиенте
Процедура Подключаемый_ТабличныйДокументПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, ТабличныйДокумент, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_ДокументРезультатБазисПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСуммаБазис = РаботаСБухгалтерскимиОтчетами.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ТабличныйДокумент, КэшВыделеннойОбласти);
	
КонецПроцедуры

#КонецОбласти 
