
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруИзмеренийЖуранала()
	
	ИзмеренияЖурнала = Новый Структура();
	
	Для каждого Измерение Из Метаданные.РегистрыСведений.ЖурналОперацийБэкОфиса.Измерения Цикл
		ИзмеренияЖурнала.Вставить(Измерение.Имя);
	КонецЦикла;
	
	Возврат ИзмеренияЖурнала;
	
КонецФункции // ПолучитьСтруктуруИзмеренийЖуранала

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// скроем указанные поля, если это требуется
	Если ЭтаФорма.Параметры.Свойство("НеОтображатьПоля") Тогда
		
		НеОтображатьПоля = ЭтаФорма.Параметры.НеОтображатьПоля;
		
		Если ТипЗнч(НеОтображатьПоля) = Тип("Строка") Тогда
			НеОтображатьПоля = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(НеОтображатьПоля, ",", Истина, Истина);
		КонецЕсли;
		
		Если ТипЗнч(НеОтображатьПоля) = Тип("Массив") Тогда
			Для каждого НеОтображатьПоле Из НеОтображатьПоля Цикл
				Элементы["ВариантыСводнойФормы" + НеОтображатьПоле].Видимость = Ложь;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// заголовок
	Если ЭтаФорма.Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок     = ЭтаФорма.Параметры.Заголовок;
		ЭтаФорма.АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	// заполним варианты
	Для каждого СтрокаВариантыСводнойФормы Из ЭтаФорма.Параметры.ВариантыСводнойФормы Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ВариантыСводнойФормы.Добавить(), СтрокаВариантыСводнойФормы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыСводнойФормыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВариантСводнойФормы = ПолучитьСтруктуруИзмеренийЖуранала();
	
	ЗаполнитьЗначенияСвойств(ВариантСводнойФормы, Элементы.ВариантыСводнойФормы.ТекущиеДанные);
	
	ЭтаФорма.Закрыть(ВариантСводнойФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВыбрать");
	Попытка
		ВариантыСводнойФормыВыбор(,,,);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
