
Процедура ПередЗаписью(Отказ)
	
	Если Не Ссылка.Пустая() Тогда
		
		// Контролируем, что настройка СрокФормирования имеет вариант получения НаДатуПредоставления, а Формировать и УчетКалендарныхДнейПриЕжедневномФормировании - на отчетную дату. На это завязано определение остальных настроек
		Если Ссылка = ПланыВидовХарактеристик.НастройкиОтчетов.СрокФормирования И ВариантОпределенияНастройкиОтчета <> Перечисления.ВариантыОпределенияНастроекОтчетов.НаДатуПредоставления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У настройки 'Срок формирования' должен быть вариант определения 'На дату предоставления'", Ссылка,,, Отказ);			
			Возврат;
		ИначеЕсли (Ссылка = ПланыВидовХарактеристик.НастройкиОтчетов.Формировать 
						Или Ссылка = ПланыВидовХарактеристик.НастройкиОтчетов.УчетКалендарныхДнейПриЕжедневномФормировании
						Или Ссылка = ПланыВидовХарактеристик.НастройкиОтчетов.ВариантПолученияКонечнойДатыПриЕженедФормировании
						Или Ссылка = ПланыВидовХарактеристик.НастройкиОтчетов.УчитыватьНачалоИКонецМесяцаПриЕженедФормировании)
				И ВариантОпределенияНастройкиОтчета <> Перечисления.ВариантыОпределенияНастроекОтчетов.НаОтчетнуюДату Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У настройки '" + СокрЛП(Ссылка) + "' должен быть вариант определения 'На отчетную дату'", Ссылка,,, Отказ);
			Возврат;		
		КонецЕсли; 
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СоставИНастройкиОтчетов.ВидЗначения КАК ВидЗначения,
			|	ТИПЗНАЧЕНИЯ(СоставИНастройкиОтчетов.Значение) КАК ТипЗначения,
			|	ВЫБОР
			|		КОГДА СоставИНастройкиОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.ПоУмолчанию)
			|			ТОГДА СоставИНастройкиОтчетов.Значение
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Значение
			|ИЗ
			|	РегистрСведений.СоставИНастройкиОтчетов КАК СоставИНастройкиОтчетов
			|ГДЕ
			|	СоставИНастройкиОтчетов.Настройка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Если Выборка.ВидЗначения = Перечисления.ВидыЗначенияНастроекОтчетов.ПоУмолчанию И ЗначениеЗаполнено(Выборка.Значение) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для настройки '" + СокрЛП(Ссылка) + "' существуют записи регистра 'Состав и настройки отчетов' по умолчанию с заполненным значением", Ссылка,,, Отказ);
				Прервать;
				
			ИначеЕсли Выборка.ВидЗначения = Перечисления.ВидыЗначенияНастроекОтчетов.Собственное Тогда
				
				Если Не ТипЗначения.СодержитТип(Выборка.ТипЗначения) Тогда
				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для настройки '" + СокрЛП(Ссылка) + "' существуют собственные записи регистра 'Состав и настройки отчетов' с типом значения, отличным от " + ТипЗначения, Ссылка,,, Отказ);
					Прервать;
				
				КонецЕсли
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры
