
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Балансовый портфель страховой компании для клиента",
		"0.11",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьКурсыВалютныхАктивовСтраховойКомпании(СчетДоверительногоУправления, Организация, Период)
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Актив,
	               |	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	               |	ВЫБОР
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	               |			ТОГДА ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).Валюта
	               |		КОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
	               |		ИНАЧЕ ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета
	               |	КОНЕЦ КАК Валюта
	               |ИЗ
	               |	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	               |				И ВЫБОР
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.Акции
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.Облигации
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.Векселя
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	               |						ТОГДА ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).Валюта
	               |					КОГДА ЦеннаяБумага ССЫЛКА Справочник.Паи
	               |						ТОГДА ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
	               |					ИНАЧЕ ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ВалютаУчета
	               |				КОНЕЦ <> Организация.ВалютаУчета) КАК ОстаткиЦенныхБумагОстатки
	               |ГДЕ
	               |	ОстаткиЦенныхБумагОстатки.КоличествоОстаток > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОстаткиПрочихАктивовОстатки.Актив,
	               |	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
	               |	ОстаткиПрочихАктивовОстатки.Валюта
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	               |				И Валюта <> Организация.ВалютаУчета) КАК ОстаткиПрочихАктивовОстатки
	               |ГДЕ
	               |	ОстаткиПрочихАктивовОстатки.КоличествоОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиПрочихАктивовОстатки.Валюта,
	               |	ОстаткиПрочихАктивовОстатки.Актив,
	               |	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент,
	               |	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления,
	               |	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент.БанковскийСчет.Валюта
	               |ИЗ
	               |	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
	               |				И ВЫРАЗИТЬ(КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта <> КредитныйИнструмент.Организация.ВалютаУчета) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
	               |ГДЕ
	               |	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОстаткиДенежныхСредствОстатки.РасчетныйСчет,
	               |	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления,
	               |	ОстаткиДенежныхСредствОстатки.Валюта
	               |ИЗ
	               |	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	               |				И Валюта <> Организация.ВалютаУчета) КАК ОстаткиДенежныхСредствОстатки
	               |ГДЕ
	               |	ОстаткиДенежныхСредствОстатки.СуммаОстаток > 0";
	
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",СчетДоверительногоУправления);
		
		ОстаткиВалютныхАктивовСтраховойКомпании = Запрос.Выполнить().Выгрузить();
		
		КурсыВалютАктивовСтраховойКомпании = Документы.РаспределениеАктивовСтраховыхКомпаний.ПолучитьКурсыВалютДляАктивовСтраховойКомпании(
				     ОстаткиВалютныхАктивовСтраховойКомпании, Период, Организация);
		
		Возврат КурсыВалютАктивовСтраховойКомпании;
		
		
КонецФункции
	 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
			
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрПериод = КонецДня(НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период").Значение.Дата);
	ПараметрСчетДУ = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("СчетДоверительногоУправления").Значение;
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Организация").Значение;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект,, Новый Структура("Период,Организация,СчетДоверительногоУправления", ПараметрПериод, ПараметрОрганизация, ПараметрСчетДУ));
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПортфельСтраховойКомпании = ПолучитьПортфельСтраховойКомпании(ПараметрСчетДУ, ПараметрОрганизация, ПараметрПериод);
	
	Для Каждого Актив Из ПортфельСтраховойКомпании Цикл
		
		Если Актив.ВидАктива = Перечисления.РынкиЦенныхБумаг.Облигации Тогда 
			
			ДюрацияИДоходность = Справочники.Облигации.ПолучитьДоходностьИДюрацию(Актив.ФинансовыйИнструмент, Ложь, Актив.ПартияДата, Актив.Котировка, ПараметрСчетДУ, Неопределено, Актив.ДатаКотировки); 
			Если НЕ ДюрацияИДоходность = Неопределено Тогда
				Актив.ДюрацияДней = ДюрацияИДоходность.Дюрация;
				Актив.ДоходностьКПогашению = ДюрацияИДоходность.Доходность;
			КонецЕсли; 
		КонецЕсли;
		
		Если Актив.ВидАктива = "Депозиты" Тогда
			
			ДюрацияИДоходность = Справочники.ДепозитныеВклады.ПолучитьДоходностьИДюрацию(Актив.ФинансовыйИнструмент); 
			Если НЕ ДюрацияИДоходность = Неопределено Тогда
				Актив.ДюрацияДней = ДюрацияИДоходность.Дюрация;
				Актив.ДоходностьКПогашению = ДюрацияИДоходность.Доходность;
			КонецЕсли; 

			
		КонецЕсли;
		
	КонецЦикла;      	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);


	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 	
	
	ВнешниеНаборыДанных = Новый Структура();
	
	ВнешниеНаборыДанных.Вставить("ПортфельСтраховойКомпании", ПортфельСтраховойКомпании); 	
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ДокументРезультат.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьПортфельСтраховойКомпании(СчетДоверительногоУправления, Организация, Период)
	
	Запрос = Новый Запрос();
	
	КурсыВалютныхАктивовСтраховойКомпании = ПолучитьКурсыВалютныхАктивовСтраховойКомпании(СчетДоверительногоУправления, Организация, Период);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_КурсыВалютАктивовСтраховойКомпании.Актив КАК Актив,
	|	_КурсыВалютАктивовСтраховойКомпании.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_КурсыВалютАктивовСтраховойКомпании.Валюта КАК Валюта,
	|	_КурсыВалютАктивовСтраховойКомпании.ДатаКурсаВалют КАК ДатаКурсаВалют,
	|	_КурсыВалютАктивовСтраховойКомпании.Курс КАК Курс,
	|	_КурсыВалютАктивовСтраховойКомпании.Кратность КАК Кратность
	|ПОМЕСТИТЬ _КурсыВалютАктивовСтраховойКомпании
	|ИЗ
	|	&КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Категория
	|	КОНЕЦ КАК Категория,
	|	ЮрФизЛица.Ссылка КАК Эмитент,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВалютаНоминала,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.СтоимостьОстаток, 0) - ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток, 0) КАК БалансоваяСтоимостьБезПереоценки,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаОстаток, 0) + ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток, 0) КАК Переоценка,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток, 0) - ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток, 0) КАК БалансоваяСтоимостьКупонаБезПереоценки,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток, 0) КАК ПереоценкаКупона,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.СтоимостьОстаток, 0) + ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаОстаток, 0) КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток, 0) + ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток, 0) КАК БалансоваяСтоимостьКупона,
	|	СтоимостьПереоценкиСрезПоследних.ДатаЦены КАК ДатаКотировки,
	|	СтоимостьПереоценкиСрезПоследних.Цена КАК Котировка,
	|	СтоимостьПереоценкиСрезПоследних.ЦенаКупона КАК КотировкаКупона,
	|	СтоимостьПереоценкиСрезПоследних.СуммаВВалютеУчета КАК ТекущаяОценка,
	|	СтоимостьПереоценкиСрезПоследних.СуммаКупонаВВалютеУчета КАК ТекущаяОценкаКупона,
	|	ЕСТЬNULL(КупонныйДоходПоОблигациямСрезПоследних.СтавкаКупона, Облигации.БазоваяСтавка) КАК Ставка,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ДатаАннулирования
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Векселя).ДатаПогашения
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДатаПогашения,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).ДатаРегистрации
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Векселя).ДатаСоставления
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ДатаРегистрации
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).ДатаНачалаОбращения
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ДатаРегистрации
	|		КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ДатаРегистрации
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДатаРегистрации,
	|	БухПартииЦенныхБумагОстатки.Партия.Дата КАК ПартияДата
	|ПОМЕСТИТЬ _ЦенныеБумаги
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
	|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки.СрезПоследних(
	|				&Период,
	|				ВидУчета = &ВидУчета
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|					И Организация = &Организация
	|					И Регистратор ССЫЛКА Документ.ПереоценкаЦенныхБумаг) КАК СтоимостьПереоценкиСрезПоследних
	|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = СтоимостьПереоценкиСрезПоследних.ЦеннаяБумага
	|			И БухПартииЦенныхБумагОстатки.Партия = СтоимостьПереоценкиСрезПоследних.Партия
	|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = СтоимостьПереоценкиСрезПоследних.СтрокаПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
	|		ПО (ВЫБОР
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|					ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Векселя
	|					ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
	|					ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|					ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|					ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
	|				КОГДА БухПартииЦенныхБумагОстатки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
	|				ИНАЧЕ NULL
	|			КОНЕЦ = ЮрФизЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = Облигации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(&Период, ) КАК КупонныйДоходПоОблигациямСрезПоследних
	|		ПО (Облигации.Ссылка = КупонныйДоходПоОблигациямСрезПоследних.Облигация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННБанкаДепозитногоВклада,
	|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицоБанкаДепозитногоВклада,
	|	БанковскиеСчета.Валюта КАК ВалютаДепозитногоВклада,
	|	ЕПСНоминалОстатки.ВалютнаяСуммаОстаток КАК НоминалОстатокДепозитногоВклада,
	|	ЕПСПроцентыОстатки.ВалютнаяСуммаОстаток КАК ПроцентыОстатокДепозитногоВклада,
	|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРегистрации
	|ПОМЕСТИТЬ _ДепозитныеВклады
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|				&Период,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты01),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕПСНоминалОстатки
	|		ПО (ЕПСНоминалОстатки.ЛицевойСчет.ДепозитныйВклад = ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
	|				&Период,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕПСПроцентыОстатки
	|		ПО (ЕПСНоминалОстатки.ЛицевойСчет.ДепозитныйВклад = ЕПСПроцентыОстатки.Субконто1)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
	|		ПО (ЕПСНоминалОстатки.ЛицевойСчет.ДепозитныйВклад = ДепозитныеВклады.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО (ДепозитныеВклады.БанковскийСчет = БанковскиеСчета.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО (БанковскиеСчета.Банк = Банки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК РасчетныйСчет,
	|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
	|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ _БанковскиеСчета
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	|				ПО Банки.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	|			ПО БанковскиеСчета.Банк = Банки.Ссылка
	|		ПО ОстаткиДенежныхСредствОстатки.РасчетныйСчет = БанковскиеСчета.Ссылка
	|ГДЕ
	|	ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.Рынок КАК Рынок,
	|	_ЦенныеБумаги.Категория КАК Категория,
	|	_ЦенныеБумаги.Эмитент КАК Эмитент,
	|	_ЦенныеБумаги.ИНН КАК ИНН,
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.Количество) КАК Количество,
	|	_ЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезПереоценки) КАК БалансоваяСтоимостьБезПереоценки,
	|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьКупонаБезПереоценки) КАК БалансоваяСтоимостьКупонаБезПереоценки,
	|	СУММА(_ЦенныеБумаги.ПереоценкаКупона) КАК ПереоценкаКупона,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимость) КАК БалансоваяСтоимость,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьКупона) КАК БалансоваяСтоимостьКупона,
	|	МАКСИМУМ(_ЦенныеБумаги.ДатаКотировки) КАК ДатаКотировки,
	|	МАКСИМУМ(_ЦенныеБумаги.Котировка) КАК Котировка,
	|	СУММА(_ЦенныеБумаги.КотировкаКупона) КАК КотировкаКупона,
	|	СУММА(_ЦенныеБумаги.ТекущаяОценка) КАК ТекущаяОценка,
	|	СУММА(_ЦенныеБумаги.ТекущаяОценкаКупона) КАК ТекущаяОценкаКупона,
	|	_ЦенныеБумаги.Ставка КАК Ставка,
	|	_ЦенныеБумаги.ДатаПогашения КАК ДатаПогашения,
	|	_ЦенныеБумаги.ДатаРегистрации КАК ДатаРегистрации,
	|	МИНИМУМ(_ЦенныеБумаги.ПартияДата) КАК ПартияДата
	|ПОМЕСТИТЬ _ЦенныеБумагиСуммарно
	|ИЗ
	|	_ЦенныеБумаги КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.Категория,
	|	_ЦенныеБумаги.Рынок,
	|	_ЦенныеБумаги.Эмитент,
	|	_ЦенныеБумаги.ИНН,
	|	_ЦенныеБумаги.ЦеннаяБумага,
	|	_ЦенныеБумаги.ВалютаНоминала,
	|	_ЦенныеБумаги.Ставка,
	|	_ЦенныеБумаги.ДатаПогашения,
	|	_ЦенныеБумаги.ДатаРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумагиСуммарно.Рынок КАК ВидАктива,
	|	_ЦенныеБумагиСуммарно.Категория КАК КатегорияАктива,
	|	_ЦенныеБумагиСуммарно.ЦеннаяБумага КАК ФинансовыйИнструмент,
	|	_ЦенныеБумагиСуммарно.Эмитент КАК Эмитент,
	|	_ЦенныеБумагиСуммарно.ИНН КАК ИННЭмитента,
	|	_ЦенныеБумагиСуммарно.ВалютаНоминала КАК Валюта,
	|	_ЦенныеБумагиСуммарно.Количество КАК Количество,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.БалансоваяСтоимостьБезПереоценки КАК БалансоваяСтоимостьБезУчетаПереоценки,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.Переоценка КАК Переоценка,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	0 КАК ДоляБалансовойСтоимости,
	|	_ЦенныеБумагиСуммарно.ДатаКотировки КАК ДатаКотировки,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.Котировка КАК Котировка,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.ТекущаяОценка КАК ТекущаяОценка,
	|	0 КАК ДоляОценки,
	|	_ЦенныеБумагиСуммарно.Ставка КАК Ставка,
	|	_ЦенныеБумагиСуммарно.ДатаПогашения КАК ДатаПогашения,
	|	_ЦенныеБумагиСуммарно.ДатаРегистрации КАК ДатаРазмещения,
	|	0 КАК ДюрацияДней,
	|	0 КАК ДоходностьКПогашению,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.БалансоваяСтоимостьКупонаБезПереоценки КАК БалансоваяСтоимостьБезУчетаПереоценкиКупона,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.ПереоценкаКупона КАК ПереоценкаКупона,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.БалансоваяСтоимостьКупона КАК БалансоваяСтоимостьКупона,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.КотировкаКупона КАК КотировкаКупона,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ЦенныеБумагиСуммарно.ТекущаяОценкаКупона КАК ТекущаяОценкаКупона,
	|	_ЦенныеБумагиСуммарно.ПартияДата КАК ПартияДата
	|ИЗ
	|	_ЦенныеБумагиСуммарно КАК _ЦенныеБумагиСуммарно
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|		ПО _ЦенныеБумагиСуммарно.ЦеннаяБумага = _КурсыВалютАктивовСтраховойКомпании.Актив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Денежные средства на расчетных счетах"",
	|	NULL,
	|	_БанковскиеСчета.РасчетныйСчет,
	|	_БанковскиеСчета.ЮрФизЛицо,
	|	_БанковскиеСчета.ИНН,
	|	_БанковскиеСчета.Валюта,
	|	NULL,
	|	NULL,
	|	NULL,
	|	СУММА(ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _БанковскиеСчета.СуммаОстаток),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	_БанковскиеСчета КАК _БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|		ПО _БанковскиеСчета.РасчетныйСчет = _КурсыВалютАктивовСтраховойКомпании.Актив
	|
	|СГРУППИРОВАТЬ ПО
	|	_БанковскиеСчета.РасчетныйСчет,
	|	_БанковскиеСчета.ЮрФизЛицо,
	|	_БанковскиеСчета.ИНН,
	|	_БанковскиеСчета.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Депозиты"",
	|	NULL,
	|	_ДепозитныеВклады.ДепозитныйВклад,
	|	_ДепозитныеВклады.ЮрФизЛицоБанкаДепозитногоВклада,
	|	_ДепозитныеВклады.ИННБанкаДепозитногоВклада,
	|	_ДепозитныеВклады.ВалютаДепозитногоВклада,
	|	NULL,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ДепозитныеВклады.НоминалОстатокДепозитногоВклада,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * _ДепозитныеВклады.ПроцентыОстатокДепозитногоВклада,
	|	ЕСТЬNULL(_КурсыВалютАктивовСтраховойКомпании.Курс / _КурсыВалютАктивовСтраховойКомпании.Кратность, 1) * (ЕСТЬNULL(_ДепозитныеВклады.ПроцентыОстатокДепозитногоВклада, 0) + ЕСТЬNULL(_ДепозитныеВклады.НоминалОстатокДепозитногоВклада, 0)),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	_ДепозитныеВклады.ДатаРегистрации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	_ДепозитныеВклады КАК _ДепозитныеВклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютАктивовСтраховойКомпании КАК _КурсыВалютАктивовСтраховойКомпании
	|		ПО _ДепозитныеВклады.ДепозитныйВклад = _КурсыВалютАктивовСтраховойКомпании.Актив";
	    //Нельзя барть максимальную котировку, нужно фильтровать по бирже, и котировку дать в группировку
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления); 	
	Запрос.УстановитьПараметр("КурсыВалютАктивовСтраховойКомпании", КурсыВалютныхАктивовСтраховойКомпании);

		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
