
// СписокЗначений для накапливания пакета сообщений в журнал регистрации, 
// формируемых в клиентской бизнес-логике
Перем СообщенияДляЖурналаРегистрации Экспорт;

// Структура параметров для клиентской логики по завершению работы в программе
Перем ПараметрыРаботыКлиентаПриЗавершении Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	УстановитьЗаголовокКлиентскогоПриложения(РаботаСФормамиКлиент.СформироватьЗаголовокПриложения());
	
	Если Не ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		Если Не РаботаСПользователями.ПроверитьВозможностьПодключенияККопииИнформационнойБазы() Тогда
			Предупреждение("Это служебная копия. Для подключения к ней обратитесь к разработчикам", 30);
			ЗавершитьРаботуСистемы(Ложь, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыРаботыКлиентаПриЗавершении = Новый Структура;
	РаботаСФормамиКлиент.ЗаполнитьПараметрыРаботыКлиентаПриЗавершении();
	
	Если Не РаботаСПользователями.ЭтоПолноправныйПользователь() И РаботаСПользователями.КоличествоДоступныхОрганизаций() > 1 Тогда
		ОткрытьФормуМодально("Справочник.Пользователи.Форма.ВыборТекущейОрганизации");
	КонецЕсли;
	
	РаботаСПользователями.ПроверитьПраваДоступаКДокументамПодсистемыДокументооборот();
	
	// Открываем форму с задачами на согласование
	РаботаСБизнесПроцессамиИЗадачамиКлиент.ОткрытьЗадачиПользователяНаСогласованиеДокументов();
	
	РаботаСВнешнимиСистемами.УстановитьПараметрыСоединенийСВнешнимиИсточниками();
		
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Отказ = ПараметрыРаботыКлиентаПриЗавершении.ПоказыватьПредупреждениеПередЗавершениемРаботыСистемы;
	ТекстПредупреждения = "Завершить работу с программой?";
	
КонецПроцедуры
