#Область ПрограммныйИнтерфейс

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки".
//
// Возвращаемое значение (Структура):
//	Вид (Строка) - вид подключаемого объекта:
//		|- "ДополнительнаяОбработка"
//		|- "ДополнительныйОтчет"
//		|- "ЗаполнениеОбъекта"
//		|- "ПечатнаяФорма"
//
//	Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//		Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//	Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//	Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//	Информация (Строка) - описание обработки
//
//	Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//		|- Представление (строка) - представление команды конечному пользователю
//		|- Идентификатор (строка) - идентификатор команды
//		|- Использование (строка) - варианты запуска обработки:
//		|	|- "ОткрытиеФормы" - открыть форму обработки
//		|	|- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//		|	|- "ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
//		|- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//		|	Прим. Имеет смысл только при запуске обработки без открытия формы.
//		|- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//			Печать требуется установить как "ПечатьMXL"
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Тестирование SPPI",
		"1.21",
		"",
		Истина);
	
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, "АвтоматическаяОтправкаРезультатаТестирования", "Автоматическая оправка результата тестирования",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, "АвтоматическаяОтправкаУведомления", "Автоматическая оправка уведомления",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
КонецФункции

// Интерфейс для формирования отчета и отправки на почту по регламентному заданию.
//
// Параметры:
//	ИдентификаторКоманды - Строка - идентификатор команды
//	ПараметрыОбработки - Структура - структура со свойством ДополнительнаяОбработкаСсылка
//		(ссылка на элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	#Область ОписаниеПараметровКоманд
	// Параметры команды "АвтоматическаяОтправкаРезультатаТестирования":
	//	"Организация" - СправочникСсылка.Организации
	//	"ПутьВыгрузкиВExcel" - Строка(250)
	//	"АдресаЭлектроннойПочты" - Строка
	//	"ЮридическоеЛицо" - СправочникСсылка.ЮрФизЛица - Находятся все счета Д/У, у которых указано это юридическое лицо
	//
	// Параметры команды "АвтоматическаяОтправкаУведомления":
	//	"Организация" - СправочникСсылка.Организации
	//	"АдресаЭлектроннойПочты" - Строка
	//	"ЮридическоеЛицо" - СправочникСсылка.ЮрФизЛица - Находятся все счета Д/У, у которых указано это юридическое лицо
	#КонецОбласти
	Ошибки = Новый Массив();
	ПриВыполненииВозниклиОшибки = Ложь;
	
	// Проверка наличия выполняемой команды
	Если Не СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяОтправкаРезультатаТестирования")
		И Не СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяОтправкаУведомления")
	Тогда
		Ошибки.Добавить("Неизвестный идентификатор команды """ + ИдентификаторКоманды + """");
	КонецЕсли;
	ПриВыполненииВозниклиОшибки = Ошибки.Количество() > 0;
	
	Если Не ПриВыполненииВозниклиОшибки Тогда
		// Заполнение обязательных параметров команд
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(
			ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
		ТекущийПараметрКоманды = "Организация";
		Если Не ПараметрыКоманды.Свойство(ТекущийПараметрКоманды, ЭтотОбъект.Организация)
			Или Не ЗначениеЗаполнено(ЭтотОбъект.Организация)
		Тогда
			Ошибки.Добавить("Не указан или не заполнен параметр """ + ТекущийПараметрКоманды + """");
		КонецЕсли;
		
		// Параметры "АдресаЭлектроннойПочты"
		ТекущийАдресЭП = Неопределено;
		ПараметрыКоманды.Свойство("АдресаЭлектроннойПочты", ЭтотОбъект.АдресаЭлектроннойПочты);
		Если Не ЗначениеЗаполнено(ЭтотОбъект.АдресаЭлектроннойПочты) Тогда
			Ошибки.Добавить("Не указан или не заполнен параметр """ + ТекущийПараметрКоманды + """");
		КонецЕсли;
		
		// Период
		ПрошлыйРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		ЭтотОбъект.Период = Новый СтандартныйПериод(ПрошлыйРабочийДень, НачалоДня(НачалоДня(ТекущаяДата()) - 1));
		
		// Параметр "ЮридическоеЛицо"
		ЮридическоеЛицо = Неопределено;
		ТекущийПараметрКоманды = "ЮридическоеЛицо";
		ПараметрыКоманды.Свойство(ТекущийПараметрКоманды, ЮридическоеЛицо);
		Если ЮридическоеЛицо = Неопределено Тогда
			Ошибки.Добавить("Не указан или не заполнен параметр """ + ТекущийПараметрКоманды + """");
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
			|ГДЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ЮридическоеЛицо";
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ЮридическоеЛицо", ЮридическоеЛицо);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаСчетовДУ = ЭтотОбъект.СчетаДоверительногоУправления.Добавить();
			СтрокаСчетовДУ.Ссылка = Выборка.СчетДоверительногоУправления;
		КонецЦикла;
		Если ЭтотОбъект.СчетаДоверительногоУправления.Количество() = 0
			Или Не ЗначениеЗаполнено(ЭтотОбъект.СчетаДоверительногоУправления[0].Ссылка)
		Тогда
			Ошибки.Добавить("По юридическому лицу не было найдено ни одного счёта Д/У.");
		КонецЕсли;
		
		// Заполнение индивидуальных параметров команд:
		// Команда "АвтоматическаяОтправкаРезультатаТестирования"
		#Область АвтоматическаяОтправкаРезультатаТестирования
		Если СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяОтправкаРезультатаТестирования") Тогда
			// Параметр "ПутьВыгрузкиВExcel"
			ТекущийПараметрКоманды = "ПутьВыгрузкиВExcel";
			Если Не ПараметрыКоманды.Свойство(ТекущийПараметрКоманды, ЭтотОбъект.ПутьВыгрузкиВExcel)
				Или Не ЗначениеЗаполнено(ЭтотОбъект.ПутьВыгрузкиВExcel)
			Тогда
				Ошибки.Добавить("Не указан или не заполнен параметр """ + ТекущийПараметрКоманды + """");
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
	КонецЕсли;
	ПриВыполненииВозниклиОшибки = Ошибки.Количество() > 0;
		
	// Организация сбора статистики
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	// Формирование отчёта
	Если Не ПриВыполненииВозниклиОшибки Тогда
		Если СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяОтправкаРезультатаТестирования") Тогда
			АвтоматическаяОтправкаРезультатаТестирования(Ошибки);
		ИначеЕсли СтрНачинаетсяС(ИдентификаторКоманды, "АвтоматическаяОтправкаУведомления") Тогда
			АвтоматическаяОтправкаУведомления(Ошибки);
		КонецЕсли;
		ПриВыполненииВозниклиОшибки = Ошибки.Количество() > 0;
	КонецЕсли;
	
	// Если были ошибки, нужно их сохранить
	Если ПриВыполненииВозниклиОшибки Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Ошибки, ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
		// Вывод ошибки при ручном запуске команды
		Для Каждого Ошибка Из Ошибки Цикл
			Сообщить(Ошибка);
		КонецЦикла;
	КонецЕсли;
	
	// Завершение сессии сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
КонецПроцедуры

// Возвращает параметры выполняемой по регламентному заданию команды для подключения к механизму регистрации работы.
//
// Параметры:
//	ИдентификаторКоманды - Строка - идентификатор команды
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды)
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("Организация", ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	
	Описание = "";
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Описание = Описание + ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение + Символы.ПС;
	КонецЦикла;
	Описание = Лев(Описание, СтрДлина(Описание) - СтрДлина(Символы.ПС));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Новый ХранилищеЗначения(ПараметрыОтчета), Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьДанныеОЦенныхБумагах(Ошибки = Неопределено) Экспорт
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	// Проверка параметров перед получением данных
	ПараметрыЗапросов = Новый Структура("Организация, ДатаНачала, ДатаОкончания, СчетаДоверительногоУправления, Календарь, КалендарьКотировки");
	ПараметрыЗапросов.СчетаДоверительногоУправления = Новый Массив;
	// Параметр "Организация"
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		Ошибки.Добавить("Параметр ""Организация"" не заполнен.");
	КонецЕсли;
	// Параметр "Период" ("ДатаНачала", "ДатаОкончания")
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Период.ДатаНачала) Или Не ЗначениеЗаполнено(ЭтотОбъект.Период.ДатаОкончания) Тогда
		Ошибки.Добавить("Параметр ""Период"" не заполнен.");
	КонецЕсли;
	// Параметр "СчетаДоверительногоУправления"
	Если ЭтотОбъект.СчетаДоверительногоУправления.Количество() = 0
		Или Не ЗначениеЗаполнено(ЭтотОбъект.СчетаДоверительногоУправления[0].Ссылка)
	Тогда
		Ошибки.Добавить("Параметр ""СчетаДоверительногоУправления"" не заполнен.");
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапросов.Организация = ЭтотОбъект.Организация;
	ПараметрыЗапросов.ДатаНачала = ЭтотОбъект.Период.ДатаНачала;
	ПараметрыЗапросов.ДатаОкончания = ЭтотОбъект.Период.ДатаОкончания;
	Для Каждого СтрокаСчетовДоверительногоУправления Из ЭтотОбъект.СчетаДоверительногоУправления Цикл
		ПараметрыЗапросов.СчетаДоверительногоУправления.Добавить(СтрокаСчетовДоверительногоУправления.Ссылка);
	КонецЦикла;
	ПараметрыЗапросов.Календарь = Справочники.Календари.Общероссийский;
	ПараметрыЗапросов.КалендарьКотировки = Справочники.Календари.НайтиПоНаименованию("Котировки", Истина);
	
	// Получение данных о ценных бумагах разных типов и заполнение описаний табличных документов (будущих листов Excel)
	ОписанияТабличныхДокументов.Очистить();
	ОбъектыВТабличныхДокументах.Очистить();
	
	ПолучитьДанныеОДепозитах(ПараметрыЗапросов, Ошибки);
	ПолучитьДанныеОМНО(ПараметрыЗапросов, Ошибки);
	ПолучитьДанныеОбОблигациях(ПараметрыЗапросов, Ошибки);
	ПолучитьДанныеОСделкахРЕПО(ПараметрыЗапросов, Ошибки);
	Если Ошибки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	// При первом запуске процедуры критерии тестирования могут быть не заполнены
	Если КритерииТестирования.Количество() = 0 Тогда
		ПерезаполнитьКритерииТестирования();
	КонецЕсли;
	
	// Перезаполнение настроек ответов для каждого табличного документа
	НастройкиОтветов.Очистить();
	КритерииТестированияПоТипамАктивовПоУмолчанию = ПолучитьКритерииТестированияПоТипамАктивовПоУмолчанию();
	НайденныеНастройкиОтветов = ПолучитьНастройкиОтветов();
	Для Каждого СтрокаОписаний Из ОписанияТабличныхДокументов Цикл
		// При наличии найденных настроек ответов заполнение происходит по сохранённым данным из базы
		НастройкиОтветовПоДатам = НайденныеНастройкиОтветов.Получить(СтрокаОписаний.СчетДоверительногоУправления);
		Если НастройкиОтветовПоДатам <> Неопределено Тогда
			НастройкиОтветовПоНаименованиямТабличныхДокументов = НастройкиОтветовПоДатам.Получить(СтрокаОписаний.Дата);
			Если НастройкиОтветовПоНаименованиямТабличныхДокументов <> Неопределено Тогда
				ТекущиеНастройкиОтветов = НастройкиОтветовПоНаименованиямТабличныхДокументов.Получить(СтрокаОписаний.Наименование);
				Если ТекущиеНастройкиОтветов <> Неопределено Тогда
					НайденныеОтветыПоКритериям = ТекущиеНастройкиОтветов.ОтветыПоКритериям.Получить();
					Итератор = 0;
					Для Каждого НайденныйОтветПоКритериям Из НайденныеОтветыПоКритериям Цикл
						Итератор = Итератор + 1;
						СтрокаНастроекОтветов = НастройкиОтветов.Добавить();
						СтрокаНастроекОтветов.КритерийТестирования = НайденныйОтветПоКритериям.КритерийТестирования;
						СтрокаНастроекОтветов.НомерОписанияТабличногоДокумента = СтрокаОписаний.НомерСтроки;
						НайденныйКритерийТестирования = ЭтотОбъект.КритерииТестирования.Найти(НайденныйОтветПоКритериям.КритерийТестирования, "Ссылка");
						Если НайденныйКритерийТестирования = Неопределено Тогда
							Сообщить("Найденный критерий тестирования """ + НайденныйОтветПоКритериям.КритерийТестирования + """ не используется в тестировании."
								+ " (Организация: " + ЭтотОбъект.Организация + ", СчетДоверительногоУправления: " + СтрокаОписаний.СчетДоверительногоУправления
								+ ", Дата: " + СтрокаОписаний.Дата + ", Объект: " + ТекущиеНастройкиОтветов.Объект);
							Продолжить;
						КонецЕсли;
						СтрокаНастроекОтветов.НомерКритерияТестирования = НайденныйКритерийТестирования.НомерСтроки;
						СтрокаНастроекОтветов.Порядок = Итератор;
						СтрокаНастроекОтветов.Ответ = НайденныйОтветПоКритериям.Ответ;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// При отсутствии данных в базе заполнение происходит по умолчанию
		ДанныеКритериевТестирования = КритерииТестированияПоТипамАктивовПоУмолчанию.Получить(СтрокаОписаний.ТипАктива);
		Если ДанныеКритериевТестирования = Неопределено Тогда
			Сообщить("Не найдены критерии тестирования по умолчанию для типа актива """ + СтрокаОписаний.ТипАктива + """");
			Продолжить;
		КонецЕсли;
		Итератор = 0;
		Для Каждого ДанныеКритерияТестирования Из ДанныеКритериевТестирования Цикл
			Итератор = Итератор + 1;
			СтрокаНастроекОтветов = НастройкиОтветов.Добавить();
			СтрокаНастроекОтветов.КритерийТестирования = ДанныеКритерияТестирования.КритерийТестирования;
			СтрокаНастроекОтветов.НомерОписанияТабличногоДокумента = СтрокаОписаний.НомерСтроки;
			СтрокаНастроекОтветов.НомерКритерияТестирования = ДанныеКритерияТестирования.НомерСтроки;
			СтрокаНастроекОтветов.Порядок = Итератор;
			СтрокаНастроекОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет");
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПерезаполнитьКритерииТестирования() Экспорт
	КритерииТестирования.Очистить();
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КритерииТестированияSPPI.Ссылка КАК Ссылка,
		|	КритерииТестированияSPPI.Наименование КАК Наименование,
		|	КритерииТестированияSPPI.УсловияДоговора КАК УсловияДоговора,
		|	КритерииТестированияSPPI.Описание КАК Описание
		|ИЗ
		|	Справочник.КритерииТестированияSPPI КАК КритерииТестированияSPPI
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКритериевТестирования = КритерииТестирования.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКритериевТестирования, Выборка);
	КонецЦикла;
КонецПроцедуры

// Возвращаемое значение:
//	Соответствие(Строка (Тип актива), Массив(Структура(
//		"КритерийТестирования": СправочникСсылка.КритерииТестированияSPPI,
//		"НомерСтроки": Число (Номер строки ТЧ "Ответы")
//	))
Функция ПолучитьКритерииТестированияПоТипамАктивовПоУмолчанию() Экспорт
	НомераОтветовПоТипамАктивов = Новый Соответствие;
	
	// Для типов активов "Депозиты", "МНО" и "Сделки РЕПО"
	НомераОтветовТекущегоТипа = Новый Массив;
	Для Каждого КритерийТестирования Из ЭтотОбъект.КритерииТестирования Цикл
		// Не добавляем критерии по финансовым инструментам
		Если СтрНайти(КритерийТестирования.Наименование, "(по ФИ)") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		НомераОтветовТекущегоТипа.Добавить(Новый Структура("КритерийТестирования, НомерСтроки",
			КритерийТестирования.Ссылка, КритерийТестирования.НомерСтроки));
	КонецЦикла;
	НомераОтветовПоТипамАктивов.Вставить("Депозиты", НомераОтветовТекущегоТипа);
	НомераОтветовПоТипамАктивов.Вставить("МНО", НомераОтветовТекущегоТипа);
	НомераОтветовПоТипамАктивов.Вставить("Сделки РЕПО", НомераОтветовТекущегоТипа);
	
	// Для типа активов "Облигации"
	НомераОтветовТекущегоТипа = Новый Массив; // "Пролонгация договора без согласия кредитора"
	Для Каждого КритерийТестирования Из ЭтотОбъект.КритерииТестирования Цикл
		// Не добавляем критерии по кредиту
		Если СтрНайти(КритерийТестирования.Наименование, "(по кредиту)") <> 0
			Или КритерийТестирования.Наименование = "Пролонгация договора без согласия кредитора"
		Тогда
			Продолжить;
		КонецЕсли;
		НомераОтветовТекущегоТипа.Добавить(Новый Структура("КритерийТестирования, НомерСтроки",
			КритерийТестирования.Ссылка, КритерийТестирования.НомерСтроки));
	КонецЦикла;
	НомераОтветовПоТипамАктивов.Вставить("Облигации", НомераОтветовТекущегоТипа);
	
	Возврат НомераОтветовПоТипамАктивов;
КонецФункции

Функция ПостроитьТабличныйДокумент(СчетДоверительногоУправления, Дата, ТипАктива, Наименование) Экспорт
	ДоступныеСтрокиОписания = ОписанияТабличныхДокументов.НайтиСтроки(
		Новый Структура("СчетДоверительногоУправления, Дата, ТипАктива, Наименование",
			СчетДоверительногоУправления, Дата, ТипАктива, Наименование));
	Если ДоступныеСтрокиОписания.Количество() <> 1 Тогда
		Сообщить("Неоднозначный выбор табличного документа.");
		Возврат Неопределено;
	КонецЕсли;
	СтрокаОписания = ДоступныеСтрокиОписания[0];
	// Формирование табличного документа
	Если СтрокаОписания.ТипАктива = "Депозиты"
		Или СтрокаОписания.ТипАктива = "МНО"
	Тогда
		Возврат ПолучитьТабличныйДокументДепозиты(СтрокаОписания);
	ИначеЕсли СтрокаОписания.ТипАктива = "Облигации" Тогда
		Возврат ПолучитьТабличныйДокументОблигации(СтрокаОписания);
	ИначеЕсли СтрокаОписания.ТипАктива = "Сделки РЕПО" Тогда
		Возврат ПолучитьТабличныйДокументСделкиРЕПО(СтрокаОписания);
	КонецЕсли;
КонецФункции

// Получение всех табличных документов и информации о них.
//
// Возвращаемое значение:
//	Массив - Массив(Структура(
//		"ТабличныйДокумент": ТабличныйДокумент
//		"Информация": Структура(
//			"СчетДоверительногоУправления": СправочникСсылка.СчетаДоверительногоУправления,
//			"Дата": Дата,
//			"ТипАктива": Строка,
//			"Наименование": Строка
//		),
//	)
Функция ПолучитьТабличныеДокументы() Экспорт
	Результат = Новый Массив;
	ОписанияТабличныхДокументов.Сортировать("СчетДоверительногоУправления, Дата, ТипАктива, Наименование");
	Для Каждого СтрокаОписания Из ОписанияТабличныхДокументов Цикл
		ТабличныйДокумент = ПостроитьТабличныйДокумент(
			СтрокаОписания.СчетДоверительногоУправления, СтрокаОписания.Дата,
			СтрокаОписания.ТипАктива, СтрокаОписания.Наименование);
		Результат.Добавить(Новый Структура("ТабличныйДокумент, Информация",
			ТабличныйДокумент,
			Новый Структура("СчетДоверительногоУправления, Дата, ТипАктива, Наименование",
				СтрокаОписания.СчетДоверительногоУправления, СтрокаОписания.Дата,
				СтрокаОписания.ТипАктива, СтрокаОписания.Наименование)));
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Выгрузка текущих табличных документов в Excel-файлы.
//
// Возвращаемое значение:
//	Массив(Структура(
//		"Имя": Строка (Имя файла),
//		"ПолноеИмя": Строка (Полный путь к файлу)
//	)
Функция ВыгрузитьВExcel() Экспорт
	Результат = Новый Массив;
	
	Если ПустаяСтрока(СтрЗаменить(СтрЗаменить(СокрЛП(ПутьВыгрузкиВExcel), "/", ""), "\", "")) Тогда
		Сообщить("Путь выгрузки пуст.");
		Возврат Результат;
	КонецЕсли;
	
	ПакетОтображаемыхДокументов = Новый ПакетОтображаемыхДокументов;
	ТекущийСчетДоверительногоУправления = Неопределено;
	ТекущаяДата = Неопределено;
	// Оформление пути
	ПутьВыгрузкиВExcel = СокрЛП(ПутьВыгрузкиВExcel);
	Если Прав(ПутьВыгрузкиВExcel, 1) <> "\" И Прав(ПутьВыгрузкиВExcel, 1) <> "/" Тогда
		ПутьВыгрузкиВExcel = ПутьВыгрузкиВExcel + "\";
	КонецЕсли;
	ИмяПодпапкиВыгрузкиВExcel = "Тестирование SPPI от " + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd");
	ПутьПодпапкиВыгрузкиВExcel = ПутьВыгрузкиВExcel + ИмяПодпапкиВыгрузкиВExcel;
	СуществующаяДиректория = Новый Файл(ПутьПодпапкиВыгрузкиВExcel);
	Если Не СуществующаяДиректория.Существует() Тогда
		Попытка
			СоздатьКаталог(СуществующаяДиректория.ПолноеИмя);
		Исключение
			Сообщить("Не удалось создать директорию """ + СуществующаяДиректория.ПолноеИмя + """.");
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	СозданоФайлов = 0;
	УникальныйИдентификаторФайлов = Новый УникальныйИдентификатор;
	// Документы отсортированы по счёту Д/У, дате, типу актива и наименованию, поэтому дополнительная сортировка не нужна
	ТабличныеДокументы = ПолучитьТабличныеДокументы();
	Для Каждого СтрокаТабличныхДокументов Из ТабличныеДокументы Цикл
		// При изменении измерений нужно сохранить файл
		Если ТекущийСчетДоверительногоУправления <> СтрокаТабличныхДокументов.Информация.СчетДоверительногоУправления
			Или ТекущаяДата <> СтрокаТабличныхДокументов.Информация.Дата
		Тогда
			Если ПакетОтображаемыхДокументов.Состав.Количество() > 0 Тогда
				МожноСоздатьФайл = Истина;
				ТекущийСчетДоверительногоУправленияСтрокой =
					СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ТекущийСчетДоверительногоУправления), "/", ""), "\", ""), """", "");
				НазваниеФайла = "[" + Формат(ТекущаяДата, "ДФ=yyyy-MM-dd") + "], " + ТекущийСчетДоверительногоУправленияСтрокой + " - Тестирование SPPI.xlsx";
				ПолныйПутьДоФайла = ПутьПодпапкиВыгрузкиВExcel + "\" + НазваниеФайла;
				СуществующийФайл = Новый Файл(ПолныйПутьДоФайла);
				Если СуществующийФайл.Существует() Тогда
					Попытка
						УдалитьФайлы(СуществующийФайл.ПолноеИмя);
					Исключение
						Сообщить("Не удалось удалить существующий файл """ + СуществующийФайл.ПолноеИмя + """.");
						МожноСоздатьФайл = Ложь;
					КонецПопытки;
				КонецЕсли;
				Если МожноСоздатьФайл Тогда
					ПакетОтображаемыхДокументов.Записать(ПолныйПутьДоФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
					СозданоФайлов = СозданоФайлов + 1;
					Результат.Добавить(Новый Структура("Имя, ПолноеИмя", НазваниеФайла, ПолныйПутьДоФайла));
				КонецЕсли;
				ПакетОтображаемыхДокументов.Состав.Очистить();
			КонецЕсли;
			ТекущийСчетДоверительногоУправления = СтрокаТабличныхДокументов.Информация.СчетДоверительногоУправления;
			ТекущаяДата = СтрокаТабличныхДокументов.Информация.Дата;
		КонецЕсли;
		// Заполнение текущего файла
		АдресРезультата = ПоместитьВоВременноеХранилище(СтрокаТабличныхДокументов.ТабличныйДокумент, УникальныйИдентификаторФайлов);
		ЭлементПакета = ПакетОтображаемыхДокументов.Состав.Добавить(АдресРезультата);
		ЭлементПакета.Наименование = СтрокаТабличныхДокументов.Информация.Наименование;
	КонецЦикла;
	// После завершения цикла нужно сохранить последний файл
	Если ПакетОтображаемыхДокументов.Состав.Количество() > 0 Тогда
		МожноСоздатьФайл = Истина;
		ТекущийСчетДоверительногоУправленияСтрокой =
			СтрЗаменить(СтрЗаменить(СтрЗаменить(Строка(ТекущийСчетДоверительногоУправления), "/", ""), "\", ""), """", "");
		НазваниеФайла = "[" + Формат(ТекущаяДата, "ДФ=yyyy-MM-dd") + "], " + ТекущийСчетДоверительногоУправленияСтрокой + " - Тестирование SPPI.xlsx";
		ПолныйПутьДоФайла = ПутьПодпапкиВыгрузкиВExcel + "\" + НазваниеФайла;
		СуществующийФайл = Новый Файл(ПолныйПутьДоФайла);
		Если СуществующийФайл.Существует() Тогда
			Попытка
				УдалитьФайлы(СуществующийФайл.ПолноеИмя);
			Исключение
				Сообщить("Не удалось удалить существующий файл """ + СуществующийФайл.ПолноеИмя + """.");
				МожноСоздатьФайл = Ложь;
			КонецПопытки;
		КонецЕсли;
		Если МожноСоздатьФайл Тогда
			ПакетОтображаемыхДокументов.Записать(ПолныйПутьДоФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			СозданоФайлов = СозданоФайлов + 1;
			Результат.Добавить(Новый Структура("Имя, ПолноеИмя", НазваниеФайла, ПолныйПутьДоФайла));
		КонецЕсли;
		ПакетОтображаемыхДокументов.Состав.Очистить();
	КонецЕсли;
	Если СозданоФайлов > 0 Тогда
		Сообщить("Создание файлов (" + СозданоФайлов + ") завершено успешно.");
	Иначе
		Сообщить("Не было создано ни одного файла.");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получение сохранённых в базе настроек ответов по данным текущих найденных измерений тестирования
//
// Возвращаемое значение:
//	Соответствие(СправочникСсылка.СчетаДоверительногоУправления, // НайденныеНастройкиОтветовПоСчетамДоверительногоУправления
//		Соответствие(Дата, // НастройкиОтветовПоДатам
//			Соответствие(Строка(50) (Наименование табличного документа), // НастройкиОтветовПоНаименованиямТабличныхДокументов
//				Структура( // ТекущиеНастройкиОтветов
//					"Объект": <ТипОбъектаСтрокой>,
//					"ОтветыПоКритериям": ХранилищеЗначений)))
Функция ПолучитьНастройкиОтветов()
	// Таблица текущих найденных измерений тестирования
	ТаблицаТабличныхДокументов = Новый ТаблицаЗначений;
	ТаблицаТабличныхДокументов.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаТабличныхДокументов.Колонки.Добавить("НаименованиеТабличногоДокумента", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	ТаблицаТабличныхДокументов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТипОбъектаСтрокой = "СправочникСсылка.Облигации, ДокументСсылка.СделкаРЕПО, ДокументСсылка.МНО, СправочникСсылка.ДепозитныеВклады";
	ТаблицаТабличныхДокументов.Колонки.Добавить("Объект", Новый ОписаниеТипов(ТипОбъектаСтрокой));
	Для Каждого СтрокаОбъектовВТабличныхДокументах Из ЭтотОбъект.ОбъектыВТабличныхДокументах Цикл
		ОписаниеТабличногоДокумента = ЭтотОбъект.ОписанияТабличныхДокументов[СтрокаОбъектовВТабличныхДокументах.НомерОписанияТабличногоДокумента - 1];
		СтрокаТабличныхДокументов = ТаблицаТабличныхДокументов.Добавить();
		СтрокаТабличныхДокументов.СчетДоверительногоУправления = ОписаниеТабличногоДокумента.СчетДоверительногоУправления;
		СтрокаТабличныхДокументов.Дата = ОписаниеТабличногоДокумента.Дата;
		СтрокаТабличныхДокументов.НаименованиеТабличногоДокумента = ОписаниеТабличногоДокумента.Наименование;
		СтрокаТабличныхДокументов.Объект = СтрокаОбъектовВТабличныхДокументах.Объект;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ТаблицаТабличныхДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаТабличныхДокументов.НаименованиеТабличногоДокумента КАК НаименованиеТабличногоДокумента,
		|	ТаблицаТабличныхДокументов.Дата КАК Дата,
		|	ТаблицаТабличныхДокументов.Объект КАК Объект
		|ПОМЕСТИТЬ _ТаблицаТабличныхДокументов
		|ИЗ
		|	&ТаблицаТабличныхДокументов КАК ТаблицаТабличныхДокументов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТаблицаТабличныхДокументов.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаТабличныхДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ТаблицаТабличныхДокументов.НаименованиеТабличногоДокумента КАК НаименованиеТабличногоДокумента,
		|	_ТаблицаТабличныхДокументов.Дата КАК Дата,
		|	МАКСИМУМ(_ТаблицаТабличныхДокументов.Объект) КАК Объект
		|ПОМЕСТИТЬ _НайденныеИзмеренияТабличныхДокументов
		|ИЗ
		|	_ТаблицаТабличныхДокументов КАК _ТаблицаТабличныхДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТестированияSPPI КАК ТестированияSPPI
		|		ПО (ТестированияSPPI.Организация = &Организация)
		|			И _ТаблицаТабличныхДокументов.СчетДоверительногоУправления = ТестированияSPPI.СчетДоверительногоУправления
		|			И _ТаблицаТабличныхДокументов.Дата = ТестированияSPPI.Дата
		|			И _ТаблицаТабличныхДокументов.Объект = ТестированияSPPI.Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаТабличныхДокументов.СчетДоверительногоУправления,
		|	_ТаблицаТабличныхДокументов.НаименованиеТабличногоДокумента,
		|	_ТаблицаТабличныхДокументов.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НайденныеИзмеренияТабличныхДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НайденныеИзмеренияТабличныхДокументов.Дата КАК Дата,
		|	_НайденныеИзмеренияТабличныхДокументов.НаименованиеТабличногоДокумента КАК НаименованиеТабличногоДокумента,
		|	_НайденныеИзмеренияТабличныхДокументов.Объект КАК Объект,
		|	ТестированияSPPI.ОтветыПоКритериям КАК ОтветыПоКритериям
		|ИЗ
		|	_НайденныеИзмеренияТабличныхДокументов КАК _НайденныеИзмеренияТабличныхДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТестированияSPPI КАК ТестированияSPPI
		|		ПО (ТестированияSPPI.Организация = &Организация)
		|			И _НайденныеИзмеренияТабличныхДокументов.СчетДоверительногоУправления = ТестированияSPPI.СчетДоверительногоУправления
		|			И _НайденныеИзмеренияТабличныхДокументов.Дата = ТестированияSPPI.Дата
		|			И _НайденныеИзмеренияТабличныхДокументов.Объект = ТестированияSPPI.Объект
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Дата";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ТаблицаТабличныхДокументов", ТаблицаТабличныхДокументов);
	
	НайденныеНастройкиОтветовПоСчетамДоверительногоУправления = Новый Соответствие; // см. Возвращаемое значение
	ВыборкаСчетДоверительногоУправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетДоверительногоУправления.Следующий() Цикл
		НастройкиОтветовПоДатам = Новый Соответствие;
		НайденныеНастройкиОтветовПоСчетамДоверительногоУправления.Вставить(
			ВыборкаСчетДоверительногоУправления.СчетДоверительногоУправления, НастройкиОтветовПоДатам);
		ВыборкаДата = ВыборкаСчетДоверительногоУправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			НастройкиОтветовПоНаименованиямТабличныхДокументов = Новый Соответствие;
			НастройкиОтветовПоДатам.Вставить(ВыборкаДата.Дата, НастройкиОтветовПоНаименованиямТабличныхДокументов);
			Выборка = ВыборкаДата.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекущиеНастройкиОтветов = Новый Структура("Объект, ОтветыПокритериям");
				ЗаполнитьЗначенияСвойств(ТекущиеНастройкиОтветов, Выборка);
				НастройкиОтветовПоНаименованиямТабличныхДокументов.Вставить(Выборка.НаименованиеТабличногоДокумента, ТекущиеНастройкиОтветов);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Возврат НайденныеНастройкиОтветовПоСчетамДоверительногоУправления;
КонецФункции

#Область ПолучениеДанныхЦенныхБумагРазныхТипов

Процедура ПолучитьДанныеОДепозитах(ПараметрыЗапроса, Ошибки = Неопределено)
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваВКредитныхИнструментах.Период, ДЕНЬ) КАК Дата,
		|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент КАК Справочник.ДепозитныеВклады) КАК ДепозитныйВклад,
		|	СУММА(ДенежныеСредстваВКредитныхИнструментах.СуммаПриход) КАК Сумма
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ),
		|			РЕГИСТРАТОР,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментах
		|ГДЕ
		|	ДенежныеСредстваВКредитныхИнструментах.СуммаПриход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваВКредитныхИнструментах.Период, ДЕНЬ),
		|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент КАК Справочник.ДепозитныеВклады)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Депозиты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Депозиты.Дата КАК Дата,
		|	РАЗНОСТЬДАТ(_Депозиты.Дата, УсловияКредитныхИнструментов.ДатаПогашения, ДЕНЬ) КАК ФактическихДней,
		|	_Депозиты.ДепозитныйВклад.БанковскийСчет.Банк КАК Банк,
		|	_Депозиты.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_Депозиты.Сумма КАК Сумма,
		|	СОКРЛП(_Депозиты.ДепозитныйВклад.НомерПодтверждения) КАК НомерПодтверждения,
		|	_Депозиты.ДепозитныйВклад.МестоХранения КАК МестоХранения,
		|	Договоры.Ссылка КАК Договор,
		|	СОКРЛП(Договоры.НомерДоговора) КАК ДоговорНомер,
		|	УсловияКредитныхИнструментов.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментов.Процент КАК Процент,
		|	УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплат,
		|	УсловияКредитныхИнструментов.СрокВозвратаДепозитаПоТребованиюКлиента КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ПОМЕСТИТЬ _ДепозитыСПодробностями
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО _Депозиты.ДепозитныйВклад = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий <= _Депозиты.Дата)
		|			И (УсловияКредитныхИнструментов.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО _Депозиты.ДепозитныйВклад.БанковскийСчет.Договор = Договоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитыСПодробностями.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДепозитыСПодробностями.Дата КАК Дата,
		|	_ДепозитыСПодробностями.Банк КАК Банк,
		|	_ДепозитыСПодробностями.ФактическихДней КАК ФактическихДней,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК РабочихДней,
		|	_ДепозитыСПодробностями.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_ДепозитыСПодробностями.Сумма КАК Сумма,
		|	_ДепозитыСПодробностями.НомерПодтверждения КАК НомерПодтверждения,
		|	_ДепозитыСПодробностями.МестоХранения КАК МестоХранения,
		|	_ДепозитыСПодробностями.Договор КАК Договор,
		|	_ДепозитыСПодробностями.ДоговорНомер КАК ДоговорНомер,
		|	_ДепозитыСПодробностями.ДатаПогашения КАК ДатаПогашения,
		|	_ДепозитыСПодробностями.Процент КАК Процент,
		|	_ДепозитыСПодробностями.ПериодичностьВыплат КАК ПериодичностьВыплат,
		|	_ДепозитыСПодробностями.СрокВозвратаДепозитаПоТребованиюКлиента КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ИЗ
		|	_ДепозитыСПодробностями КАК _ДепозитыСПодробностями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = &Календарь)
		|			И (ДанныеКалендаря.Дата >= _ДепозитыСПодробностями.Дата)
		|			И (ДанныеКалендаря.Дата < _ДепозитыСПодробностями.ДатаПогашения)
		|			И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|				ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДепозитыСПодробностями.СчетДоверительногоУправления,
		|	_ДепозитыСПодробностями.Дата,
		|	_ДепозитыСПодробностями.Банк,
		|	_ДепозитыСПодробностями.ФактическихДней,
		|	_ДепозитыСПодробностями.ДепозитныйВклад,
		|	_ДепозитыСПодробностями.Сумма,
		|	_ДепозитыСПодробностями.НомерПодтверждения,
		|	_ДепозитыСПодробностями.МестоХранения,
		|	_ДепозитыСПодробностями.Договор,
		|	_ДепозитыСПодробностями.ДоговорНомер,
		|	_ДепозитыСПодробностями.ДатаПогашения,
		|	_ДепозитыСПодробностями.Процент,
		|	_ДепозитыСПодробностями.ПериодичностьВыплат,
		|	_ДепозитыСПодробностями.СрокВозвратаДепозитаПоТребованиюКлиента
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) > 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ДепозитыСПодробностями.СчетДоверительногоУправления,
		|	_ДепозитыСПодробностями.Дата,
		|	_ДепозитыСПодробностями.Банк,
		|	_ДепозитыСПодробностями.ФактическихДней,
		|	_ДепозитыСПодробностями.ДепозитныйВклад
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Дата,
		|	Банк,
		|	ФактическихДней";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ПараметрыЗапроса.СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("Календарь", ПараметрыЗапроса.Календарь);
	
	Попытка
		ВыборкаСчетДоверительногоУправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		Ошибки.Добавить(ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	ТекущиеУникальныеЦенныеБумаги = Новый Соответствие;
	ТекущиеУникальныеДоговоры = Новый Соответствие;
	Пока ВыборкаСчетДоверительногоУправления.Следующий() Цикл
		ВыборкаДата = ВыборкаСчетДоверительногоУправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ВыборкаБанк = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаБанк.Следующий() Цикл
				ТекущиеУникальныеДоговоры.Очистить();
				ВыборкаФактическихДней = ВыборкаБанк.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаФактическихДней.Следующий() Цикл
					Выборка = ВыборкаФактическихДней.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если Не Выборка.Следующий() Тогда
						Продолжить;
					КонецЕсли;
					ТекущаяСтрокаОписания = ОписанияТабличныхДокументов.Добавить();
					// Основные поля
					ТекущаяСтрокаОписания.ТипАктива = "Депозиты";
					ТекущаяСтрокаОписания.Наименование =
						"Деп. (" + Строка(Выборка.Банк) + ") (" + Формат(Выборка.ФактическихДней, "ЧДЦ=0; ЧГ=0") + " д.)";
					ТекущаяСтрокаОписания.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
					ТекущаяСтрокаОписания.Дата = Выборка.Дата;
					// Прочие поля
					ТекущаяСтрокаОписания.Процент = Выборка.Процент;
					ТекущаяСтрокаОписания.ДатаОкончания = Выборка.ДатаПогашения;
					ТекущаяСтрокаОписания.ФактическихДней = Выборка.ФактическихДней;
					ТекущаяСтрокаОписания.РабочихДней = Выборка.РабочихДней;
					ТекущаяСтрокаОписания.Банк = Выборка.Банк;
					ТекущаяСтрокаОписания.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
					ТекущаяСтрокаОписания.СрокВозвратаДепозитаПоТребованиюКлиента = Выборка.СрокВозвратаДепозитаПоТребованиюКлиента;
					ТекущаяСтрокаОписания.НомерПодтверждения = Выборка.НомерПодтверждения;
					ТекущаяСтрокаОписания.МестоХранения = Выборка.МестоХранения;
					ТекущаяСтрокаОписания.ГлавныйДоговор = Выборка.Договор; // Первый попавшийся
					// Группируемые поля
					ТекущаяСтрокаОписания.НомераДоговоров = Выборка.ДоговорНомер; // Договор
					ТекущиеУникальныеДоговоры.Вставить(Выборка.ДоговорНомер, Истина);
					ТекущаяСтрокаОписания.СуммаДокументов = Выборка.Сумма;
					СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить(); // Депозитный вклад
					СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
					СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.ДепозитныйВклад;
					ТекущиеУникальныеЦенныеБумаги.Вставить(Выборка.ДепозитныйВклад);
					Пока Выборка.Следующий() Цикл
						Если ЗначениеЗаполнено(Выборка.Договор) И ТекущиеУникальныеДоговоры.Получить(Выборка.Договор) = Неопределено Тогда
							ТекущаяСтрокаОписания.НомераДоговоров = ТекущаяСтрокаОписания.НомераДоговоров + "; " + Выборка.ДоговорНомер;
							ТекущиеУникальныеДоговоры.Вставить(Выборка.Договор, Истина);
						КонецЕсли;
						ТекущаяСтрокаОписания.СуммаДокументов = ТекущаяСтрокаОписания.СуммаДокументов + Выборка.Сумма;
						Если ТекущиеУникальныеЦенныеБумаги.Получить(Выборка.ДепозитныйВклад) = Неопределено Тогда
							СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить();
							СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
							СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.ДепозитныйВклад;
							ТекущиеУникальныеЦенныеБумаги.Вставить(Выборка.ДепозитныйВклад);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьДанныеОМНО(ПараметрыЗапроса, Ошибки = Неопределено)
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.Период, ДЕНЬ) КАК Дата,
		|	ДенежныеСредстваМНО.Регистратор КАК МНО,
		|	СУММА(ДенежныеСредстваМНО.СуммаПриход) КАК Сумма
		|ПОМЕСТИТЬ _МНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ),
		|			РЕГИСТРАТОР,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)) КАК ДенежныеСредстваМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО ДенежныеСредстваМНО.МНО.РасчетныйСчет.ДоговорМНО = Договоры.Ссылка
		|ГДЕ
		|	ДенежныеСредстваМНО.СуммаПриход > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваМНО.СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваМНО.Период, ДЕНЬ),
		|	ДенежныеСредстваМНО.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_МНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МНО.Дата КАК Дата,
		|	_МНО.МНО.РасчетныйСчет.Банк КАК Банк,
		|	РАЗНОСТЬДАТ(_МНО.Дата, _МНО.МНО.ДатаВозврата, ДЕНЬ) КАК ФактическихДней,
		|	_МНО.МНО КАК МНО,
		|	СОКРЛП(_МНО.МНО.Номер) КАК МНОНомер,
		|	_МНО.МНО.ДатаВозврата КАК ДатаВозврата,
		|	_МНО.Сумма КАК Сумма,
		|	_МНО.МНО.Процент КАК Процент,
		|	Договоры.Ссылка КАК Договор,
		|	СОКРЛП(Договоры.НомерДоговора) КАК ДоговорНомер
		|ПОМЕСТИТЬ _МНОСПодробностями
		|ИЗ
		|	_МНО КАК _МНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО _МНО.МНО.РасчетныйСчет.ДоговорМНО = Договоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МНОСПодробностями.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МНОСПодробностями.Дата КАК Дата,
		|	_МНОСПодробностями.Банк КАК Банк,
		|	_МНОСПодробностями.ФактическихДней КАК ФактическихДней,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК РабочихДней,
		|	_МНОСПодробностями.МНО КАК МНО,
		|	_МНОСПодробностями.МНОНомер КАК МНОНомер,
		|	_МНОСПодробностями.ДатаВозврата КАК ДатаВозврата,
		|	_МНОСПодробностями.Сумма КАК Сумма,
		|	_МНОСПодробностями.Процент КАК Процент,
		|	_МНОСПодробностями.Договор КАК Договор,
		|	_МНОСПодробностями.ДоговорНомер КАК ДоговорНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.ВКонцеСрока) КАК ПериодичностьВыплат,
		|	0 КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ИЗ
		|	_МНОСПодробностями КАК _МНОСПодробностями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = &Календарь)
		|			И (ДанныеКалендаря.Дата >= _МНОСПодробностями.Дата)
		|			И (ДанныеКалендаря.Дата < _МНОСПодробностями.ДатаВозврата)
		|			И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|				ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО _МНОСПодробностями.Договор = Договоры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	_МНОСПодробностями.СчетДоверительногоУправления,
		|	_МНОСПодробностями.Дата,
		|	_МНОСПодробностями.Банк,
		|	_МНОСПодробностями.ФактическихДней,
		|	_МНОСПодробностями.МНО,
		|	_МНОСПодробностями.МНОНомер,
		|	_МНОСПодробностями.ДатаВозврата,
		|	_МНОСПодробностями.Сумма,
		|	_МНОСПодробностями.Процент,
		|	_МНОСПодробностями.Договор,
		|	_МНОСПодробностями.ДоговорНомер
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) > 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	_МНОСПодробностями.СчетДоверительногоУправления,
		|	_МНОСПодробностями.Дата,
		|	_МНОСПодробностями.Банк,
		|	_МНОСПодробностями.ФактическихДней,
		|	_МНОСПодробностями.МНО
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Дата,
		|	Банк,
		|	ФактическихДней";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ПараметрыЗапроса.СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("Календарь", ПараметрыЗапроса.Календарь);
	
	Попытка
		ВыборкаСчетДоверительногоУправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		Ошибки.Добавить(ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	ТекущиеУникальныеДоговоры = Новый Соответствие;
	ТекущиеУникальныеЦенныеБумаги = Новый Соответствие;
	Пока ВыборкаСчетДоверительногоУправления.Следующий() Цикл
		ВыборкаДата = ВыборкаСчетДоверительногоУправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ВыборкаБанк = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаБанк.Следующий() Цикл
				ТекущиеУникальныеДоговоры.Очистить();
				ВыборкаФактическихДней = ВыборкаБанк.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаФактическихДней.Следующий() Цикл
					Выборка = ВыборкаФактическихДней.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если Не Выборка.Следующий() Тогда
						Продолжить;
					КонецЕсли;
					ТекущаяСтрокаОписания = ОписанияТабличныхДокументов.Добавить();
					// Основные поля
					ТекущаяСтрокаОписания.ТипАктива = "МНО";
					ТекущаяСтрокаОписания.Наименование =
						"МНО (" + Строка(Выборка.Банк) + ") (" + Формат(Выборка.ФактическихДней, "ЧДЦ=0; ЧГ=0") + " дней)";
					ТекущаяСтрокаОписания.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
					ТекущаяСтрокаОписания.Дата = Выборка.Дата;
					// Прочие поля
					ТекущаяСтрокаОписания.Процент = Выборка.Процент;
					ТекущаяСтрокаОписания.ДатаОкончания = Выборка.ДатаВозврата;
					ТекущаяСтрокаОписания.ФактическихДней = Выборка.ФактическихДней;
					ТекущаяСтрокаОписания.РабочихДней = Выборка.РабочихДней;
					ТекущаяСтрокаОписания.Банк = Выборка.Банк;
					ТекущаяСтрокаОписания.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
					ТекущаяСтрокаОписания.СрокВозвратаДепозитаПоТребованиюКлиента = Выборка.СрокВозвратаДепозитаПоТребованиюКлиента;
					ТекущаяСтрокаОписания.ГлавныйДоговор = Выборка.Договор; // Первый попавшийся
					// Группируемые поля
					ТекущаяСтрокаОписания.НомераДоговоров = Выборка.ДоговорНомер; // Договор
					ТекущиеУникальныеДоговоры.Вставить(Выборка.Договор, Истина);
					ТекущаяСтрокаОписания.СуммаДокументов = Выборка.Сумма;
					СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить(); // МНО
					СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
					СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.МНО;
					ТекущиеУникальныеЦенныеБумаги.Вставить(Выборка.МНО);
					Пока Выборка.Следующий() Цикл
						Если ЗначениеЗаполнено(Выборка.Договор) И ТекущиеУникальныеДоговоры.Получить(Выборка.Договор) = Неопределено Тогда
							ТекущаяСтрокаОписания.НомераДоговоров = ТекущаяСтрокаОписания.НомераДоговоров + "; " + Выборка.ДоговорНомер;
							ТекущиеУникальныеДоговоры.Вставить(Выборка.Договор, Истина);
						КонецЕсли;
						ТекущаяСтрокаОписания.СуммаДокументов = ТекущаяСтрокаОписания.СуммаДокументов + Выборка.Сумма;
						Если ТекущиеУникальныеЦенныеБумаги.Получить(Выборка.МНО) = Неопределено Тогда
							СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить();
							СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
							СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.МНО;
							ТекущиеУникальныеЦенныеБумаги.Вставить(Выборка.МНО);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьДанныеОбОблигациях(ПараметрыЗапроса, Ошибки = Неопределено)
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	УчетныеАктивыЕПС.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _УчетныеАктивыЕПСУдерживаемыеДоПогашения
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	УчетныеАктивыЕПС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ) КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага КАК Облигация
		|ПОМЕСТИТЬ _ОблигацииДляТестирования
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ),
		|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ), ДЕНЬ, 14),
		|			РЕГИСТРАТОР,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС В
		|					(ВЫБРАТЬ
		|						_УчетныеАктивыЕПСУдерживаемыеДоПогашения.Ссылка
		|					ИЗ
		|						_УчетныеАктивыЕПСУдерживаемыеДоПогашения)) КАК БухПартииЦенныхБумагОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПоставкаЦенныхБумаг))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.Сделка
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.ПоставкаЦенныхБумаг).ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход))
		|	И БухПартииЦенныхБумагОбороты.КоличествоПриход > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОблигацииДляТестированияSPPI.ДатаПокупки,
		|	ОблигацииДляТестированияSPPI.СчетДоверительногоУправления,
		|	ОблигацииДляТестированияSPPI.Облигация
		|ИЗ
		|	РегистрСведений.ОблигацииДляТестированияSPPI КАК ОблигацииДляТестированияSPPI
		|ГДЕ
		|	ОблигацииДляТестированияSPPI.Организация = &Организация
		|	И ОблигацииДляТестированияSPPI.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
		|	И ОблигацииДляТестированияSPPI.ДатаПокупки >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И ОблигацииДляТестированияSPPI.ДатаПокупки <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОблигацииДляТестирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОблигацииДляТестирования.ДатаПокупки КАК ДатаПокупки,
		|	_ОблигацииДляТестирования.Облигация КАК Облигация,
		|	МАКСИМУМ(Облигации.ВалютаНоминала) КАК ВалютаНоминала,
		|	МАКСИМУМ(Облигации.ДатаНачалаРазмещения) КАК ДатаЭмиссии,
		|	МАКСИМУМ(ВЫРАЗИТЬ(Облигации.Дополнительно КАК СТРОКА(1000))) КАК ОписаниеСтавокКупонов,
		|	МАКСИМУМ(КодыВТорговыхСистемахСрезПоследнихISIN.Код) КАК НомерРегистрации,
		|	МАКСИМУМ(КодыВТорговыхСистемахСрезПоследнихКодНаММВБКраткий.Код) КАК НазваниеВыпуска,
		|	ЕСТЬNULL(МИНИМУМ(УсловияОферт.ДатаВыкупа), МАКСИМУМ(Облигации.ДатаПогашения)) КАК ДатаОфертыИлиПогашения,
		|	МАКСИМУМ(КупонныйДоходПоОблигациям.Срок) КАК ПериодичностьВыплатыКупона
		|ИЗ
		|	_ОблигацииДляТестирования КАК _ОблигацииДляТестирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ОблигацииДляТестирования.Облигация = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних({(&ДатаОкончания)}, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _ОблигацииДляТестирования.Облигация = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних({(&ДатаОкончания)}, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБКраткий
		|		ПО _ОблигацииДляТестирования.Облигация = КодыВТорговыхСистемахСрезПоследнихКодНаММВБКраткий.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ОблигацииДляТестирования.Облигация = УсловияОферт.Облигация
		|			И _ОблигацииДляТестирования.ДатаПокупки < УсловияОферт.ДатаВыкупа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ПО _ОблигацииДляТестирования.Облигация = КупонныйДоходПоОблигациям.Облигация
		|			И _ОблигацииДляТестирования.ДатаПокупки >= КупонныйДоходПоОблигациям.Период
		|			И _ОблигацииДляТестирования.ДатаПокупки <= КупонныйДоходПоОблигациям.ДатаОкончанияКупона
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОблигацииДляТестирования.СчетДоверительногоУправления,
		|	_ОблигацииДляТестирования.ДатаПокупки,
		|	_ОблигацииДляТестирования.Облигация
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОблигацииДляТестирования.СчетДоверительногоУправления,
		|	_ОблигацииДляТестирования.ДатаПокупки,
		|	_ОблигацииДляТестирования.Облигация";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ПараметрыЗапроса.СчетаДоверительногоУправления);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		Ошибки.Добавить(ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрокаОписания = ОписанияТабличныхДокументов.Добавить();
		// Основные поля
		ТекущаяСтрокаОписания.ТипАктива = "Облигации";
		ТекущаяСтрокаОписания.Наименование = "Облигации (" + Строка(Выборка.НомерРегистрации) + ")";
		ТекущаяСтрокаОписания.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		ТекущаяСтрокаОписания.Дата = Выборка.ДатаПокупки;
		// Прочие поля
		ТекущаяСтрокаОписания.НазваниеВыпуска = Выборка.НазваниеВыпуска;
		ТекущаяСтрокаОписания.ВалютаНоминала = Выборка.ВалютаНоминала;
		ТекущаяСтрокаОписания.НомерРегистрации = Выборка.НомерРегистрации;
		ТекущаяСтрокаОписания.ДатаЭмиссии = Выборка.ДатаЭмиссии;
		ТекущаяСтрокаОписания.ОписаниеСтавокКупонов = Выборка.ОписаниеСтавокКупонов;
		ТекущаяСтрокаОписания.ДатаОфертыИлиПогашения = Выборка.ДатаОфертыИлиПогашения;
		ТекущаяСтрокаОписания.ПериодичностьВыплатыКупона = Выборка.ПериодичностьВыплатыКупона;
		
		СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить(); // Облигация
		СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
		СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.Облигация;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьДанныеОСделкахРЕПО(ПараметрыЗапроса, Ошибки = Неопределено)
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	УсловияСделокРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) КАК Дата,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.ДатаВторойЧастиРЕПО, ДЕНЬ), ДЕНЬ)) КАК ФактическихДней,
		|	УсловияСделокРЕПО.СделкаРЕПО КАК СделкаРЕПО,
		|	МАКСИМУМ(УсловияСделокРЕПО.СделкаРЕПО.Номер) КАК СделкаРЕПОНомер,
		|	МАКСИМУМ(УсловияСделокРЕПО.СделкаРЕПО.Договор) КАК Договор,
		|	МАКСИМУМ(УсловияСделокРЕПО.СделкаРЕПО.Договор.НомерДоговора) КАК ДоговорНомер,
		|	МАКСИМУМ(УсловияСделокРЕПО.СтавкаРЕПО) КАК СтавкаРЕПО,
		|	НАЧАЛОПЕРИОДА(МАКСИМУМ(УсловияСделокРЕПО.ДатаВторойЧастиРЕПО), ДЕНЬ) КАК ДатаВторойЧастиРЕПО,
		|	СУММА(УсловияСделокРЕПО.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _СделкиРЕПОСПодробностями
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|ГДЕ
		|	УсловияСделокРЕПО.Организация = &Организация
		|	И УсловияСделокРЕПО.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
		|	И УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|	И УсловияСделокРЕПО.Период >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И УсловияСделокРЕПО.Период <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И УсловияСделокРЕПО.Сумма > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	УсловияСделокРЕПО.СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ),
		|	УсловияСделокРЕПО.СделкаРЕПО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СделкиРЕПОСПодробностями.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СделкиРЕПОСПодробностями.Дата КАК Дата,
		|	_СделкиРЕПОСПодробностями.ФактическихДней КАК ФактическихДней,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК ТорговыхДней,
		|	_СделкиРЕПОСПодробностями.СделкаРЕПО КАК СделкаРЕПО,
		|	_СделкиРЕПОСПодробностями.СделкаРЕПОНомер КАК СделкаРЕПОНомер,
		|	_СделкиРЕПОСПодробностями.Договор КАК Договор,
		|	_СделкиРЕПОСПодробностями.ДоговорНомер КАК ДоговорНомер,
		|	_СделкиРЕПОСПодробностями.СтавкаРЕПО КАК СтавкаРЕПО,
		|	_СделкиРЕПОСПодробностями.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.ВКонцеСрока) КАК ПериодичностьВыплат,
		|	_СделкиРЕПОСПодробностями.Сумма КАК Сумма
		|ИЗ
		|	_СделкиРЕПОСПодробностями КАК _СделкиРЕПОСПодробностями
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = &КалендарьКотировки)
		|			И (ДанныеКалендаря.Дата >= НАЧАЛОПЕРИОДА(_СделкиРЕПОСПодробностями.СделкаРЕПО.Дата, ДЕНЬ))
		|			И (ДанныеКалендаря.Дата < _СделкиРЕПОСПодробностями.СделкаРЕПО.ДатаВторойЧастиРЕПО)
		|			И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|				ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|СГРУППИРОВАТЬ ПО
		|	_СделкиРЕПОСПодробностями.СчетДоверительногоУправления,
		|	_СделкиРЕПОСПодробностями.Дата,
		|	_СделкиРЕПОСПодробностями.ФактическихДней,
		|	_СделкиРЕПОСПодробностями.СделкаРЕПО,
		|	_СделкиРЕПОСПодробностями.СделкаРЕПОНомер,
		|	_СделкиРЕПОСПодробностями.Договор,
		|	_СделкиРЕПОСПодробностями.ДоговорНомер,
		|	_СделкиРЕПОСПодробностями.СтавкаРЕПО,
		|	_СделкиРЕПОСПодробностями.ДатаВторойЧастиРЕПО,
		|	_СделкиРЕПОСПодробностями.Сумма
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СделкиРЕПОСПодробностями.СчетДоверительногоУправления,
		|	_СделкиРЕПОСПодробностями.Дата,
		|	_СделкиРЕПОСПодробностями.ФактическихДней,
		|	_СделкиРЕПОСПодробностями.СделкаРЕПО
		|ИТОГИ ПО
		|	СчетДоверительногоУправления,
		|	Дата,
		|	ФактическихДней";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ПараметрыЗапроса.СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("КалендарьКотировки", ПараметрыЗапроса.КалендарьКотировки);
	
	Попытка
		ВыборкаСчетДоверительногоУправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		Ошибки.Добавить(ОписаниеОшибки);
		Возврат;
	КонецПопытки;
	
	ТекущиеУникальныеСделкиРЕПО = Новый Соответствие;
	ТекущиеУникальныеДоговоры = Новый Соответствие;
	Пока ВыборкаСчетДоверительногоУправления.Следующий() Цикл
		ВыборкаДата = ВыборкаСчетДоверительногоУправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ТекущиеУникальныеСделкиРЕПО.Очистить();
			ТекущиеУникальныеДоговоры.Очистить();
			ВыборкаФактическихДней = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаФактическихДней.Следующий() Цикл
				Выборка = ВыборкаФактическихДней.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если Не Выборка.Следующий() Тогда
					Продолжить;
				КонецЕсли;
				ТекущаяСтрокаОписания = ОписанияТабличныхДокументов.Добавить();
				// Основные поля
				ТекущаяСтрокаОписания.ТипАктива = "Сделки РЕПО";
				ТекущаяСтрокаОписания.Наименование = "Сделки РЕПО (" + Формат(Выборка.ФактическихДней, "ЧДЦ=0; ЧГ=0") + " дней)";
				ТекущаяСтрокаОписания.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
				ТекущаяСтрокаОписания.Дата = Выборка.Дата;
				// Прочие поля
				ТекущаяСтрокаОписания.Процент = Выборка.СтавкаРЕПО;
				ТекущаяСтрокаОписания.ДатаОкончания = Выборка.ДатаВторойЧастиРЕПО;
				ТекущаяСтрокаОписания.ФактическихДней = Выборка.ФактическихДней;
				ТекущаяСтрокаОписания.ТорговыхДней = Выборка.ТорговыхДней;
				ТекущаяСтрокаОписания.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
				// Группируемые поля
				ТекущаяСтрокаОписания.НомераДокументов = Выборка.СделкаРЕПОНомер; // Сделка РЕПО
				ТекущиеУникальныеСделкиРЕПО.Вставить(Выборка.СделкаРЕПО);
				СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить();
				СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
				СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.СделкаРЕПО;
				ТекущаяСтрокаОписания.НомераДоговоров = Выборка.ДоговорНомер; // Договор
				ТекущиеУникальныеДоговоры.Вставить(Выборка.Договор);
				ТекущаяСтрокаОписания.СуммаДокументов = Выборка.Сумма;
				Пока Выборка.Следующий() Цикл
					Если ТекущиеУникальныеСделкиРЕПО.Получить(Выборка.СделкаРЕПО) = Неопределено Тогда
						ТекущаяСтрокаОписания.НомераДокументов = ТекущаяСтрокаОписания.НомераДокументов + "; " + Выборка.СделкаРЕПОНомер;
						ТекущиеУникальныеСделкиРЕПО.Вставить(Выборка.СделкаРЕПО, Истина);
						СтрокаЦенныхБумагТабличныхДокументов = ОбъектыВТабличныхДокументах.Добавить();
						СтрокаЦенныхБумагТабличныхДокументов.НомерОписанияТабличногоДокумента = ТекущаяСтрокаОписания.НомерСтроки;
						СтрокаЦенныхБумагТабличныхДокументов.Объект = Выборка.СделкаРЕПО;
					КонецЕсли;
					Если ЗначениеЗаполнено(Выборка.Договор) И ТекущиеУникальныеДоговоры.Получить(Выборка.Договор) = Неопределено Тогда
						ТекущаяСтрокаОписания.НомераДоговоров = ТекущаяСтрокаОписания.НомераДоговоров + "; " + Выборка.ДоговорНомер;
						ТекущиеУникальныеДоговоры.Вставить(Выборка.Договор, Истина);
					КонецЕсли;
					ТекущаяСтрокаОписания.СуммаДокументов = ТекущаяСтрокаОписания.СуммаДокументов + Выборка.Сумма;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПостроениеТабличногоДокумента

Функция ПолучитьТабличныйДокументДепозиты(СтрокаОписания)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	// Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаДепозиты");
	ОбластьШапка.Параметры.НомерИДатаДоговораДУ = Строка(СтрокаОписания.СчетДоверительногоУправления.НомерДоговора)
		+ " от " + Формат(СтрокаОписания.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НаименованиеБанка = Строка(СтрокаОписания.Банк);
	ОбластьШапка.Параметры.НомераДоговоров = СтрокаОписания.НомераДоговоров
		+ ?(ЗначениеЗаполнено(СтрокаОписания.НомерПодтверждения), ", подтверждение #" + Строка(СтрокаОписания.НомерПодтверждения), "");
	ОбластьШапка.Параметры.ДатаЗаключенияДоговора = Формат(СтрокаОписания.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаЗакрытияДепозита = Формат(СтрокаОписания.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодичностьВыплат = СтрокаОписания.ПериодичностьВыплат;
	ОбластьШапка.Параметры.Сумма = СтрокаОписания.СуммаДокументов;
	ОбластьШапка.Параметры.ФактическихДней = СтрокаОписания.ФактическихДней;
	ОбластьШапка.Параметры.Ставка = СтрокаОписания.Процент;
	ОбластьШапка.Параметры.ПараметрыГенеральногоСоглашенияСБанком = Строка(СтрокаОписания.ГлавныйДоговор);
	ОбластьШапка.Параметры.ОписаниеИнструмента = ?(СтрокаОписания.ТипАктива = "МНО", "Размещение денежных средств на расчётном счёте",
		?(СтрокаОписания.ТипАктива = "Депозиты",
			?(ЗначениеЗаполнено(СтрокаОписания.МестоХранения), "Биржевой депозит",
				?(ЗначениеЗаполнено(СтрокаОписания.НомерПодтверждения),
					"Депозитный договор - подтверждение в рамках генерального соглашения",
					"Депозитный договор")),
			""));
	ОбластьШапка.Параметры.ОписаниеВозможностиДосрочногоПогашения = ?(СтрокаОписания.СрокВозвратаДепозитаПоТребованиюКлиента = 0,
		"Досрочное расторжение по инициативе вкладчика не предусмотрено.", "-");
	// Таблица условий договора
	ПриоритетныйОтвет = 0;
	ОбластиТаблицыУсловийДоговора = ПолучитьОбластьТаблицыУсловийДоговора(Макет, СтрокаОписания.НомерСтроки, ПриоритетныйОтвет);
	Если ПриоритетныйОтвет = 2 Тогда
		РезультатАнализа = "SPPI-тест не пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестНеПройден");
	ИначеЕсли ПриоритетныйОтвет = 1 Тогда
		РезультатАнализа = "Вопрос к обсуждению";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветВопросКОбсуждению");
	Иначе
		РезультатАнализа = "SPPI-тест пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестПройден");
	КонецЕсли;
	ОбластьШапка.Параметры.РезультатАнализа = РезультатАнализа;
	ЦветРезультатаАнализа = ОбластьЦветРезультатаАнализа.Область(1, 1, 1, 1).ЦветФона;
	ОбластьШапка.Области.Найти("РезультатАнализаДепозиты").ЦветФона = ЦветРезультатаАнализа;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластиТаблицыУсловийДоговора);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьТабличныйДокументОблигации(СтрокаОписания)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	// Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОблигации");
	ОбластьШапка.Параметры.НомерИДатаДоговораДУ = Строка(СтрокаОписания.СчетДоверительногоУправления.НомерДоговора)
		+ " от " + Формат(СтрокаОписания.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НазваниеВыпуска = СтрокаОписания.НазваниеВыпуска;
	ОбластьШапка.Параметры.НомерРегистрации = СтрокаОписания.НомерРегистрации;
	ОбластьШапка.Параметры.ДатаПокупкиБумаги = Формат(СтрокаОписания.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаОфертыИлиПогашения = Формат(СтрокаОписания.ДатаОфертыИлиПогашения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаЭмиссии = Формат(СтрокаОписания.ДатаЭмиссии, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодичностьВыплатыКупона = СтрокаОписания.ПериодичностьВыплатыКупона;
	ОбластьШапка.Параметры.ОписаниеСтавокКупонов = СтрокаОписания.ОписаниеСтавокКупонов;
	ОбластьШапка.Параметры.ВалютаНоминала = СтрокаОписания.ВалютаНоминала;
	ОбластьШапка.Параметры.ПараметрыГенеральногоСоглашенияСБанком = "";
	ОбластьШапка.Параметры.ОписаниеИнструмента = "";
	// Таблица условий договора
	ПриоритетныйОтвет = 0;
	ОбластиТаблицыУсловийДоговора = ПолучитьОбластьТаблицыУсловийДоговора(Макет, СтрокаОписания.НомерСтроки, ПриоритетныйОтвет);
	Если ПриоритетныйОтвет = 2 Тогда
		РезультатАнализа = "SPPI-тест не пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестНеПройден");
	ИначеЕсли ПриоритетныйОтвет = 1 Тогда
		РезультатАнализа = "Вопрос к обсуждению";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветВопросКОбсуждению");
	Иначе
		РезультатАнализа = "SPPI-тест пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестПройден");
	КонецЕсли;
	ОбластьШапка.Параметры.РезультатАнализа = РезультатАнализа;
	ЦветРезультатаАнализа = ОбластьЦветРезультатаАнализа.Область(1, 1, 1, 1).ЦветФона;
	ОбластьШапка.Области.Найти("РезультатАнализаОблигации").ЦветФона = ЦветРезультатаАнализа;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластиТаблицыУсловийДоговора);
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьТабличныйДокументСделкиРЕПО(СтрокаОписания)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	// Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСделкиРЕПО");
	ОбластьШапка.Параметры.НомерИДатаДоговораДУ = Строка(СтрокаОписания.СчетДоверительногоУправления.НомерДоговора)
		+ " от " + Формат(СтрокаОписания.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомераДокументов = СтрокаОписания.НомераДокументов;
	ОбластьШапка.Параметры.ДатаСделки = Формат(СтрокаОписания.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаВторойЧастиРЕПО = Формат(СтрокаОписания.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Сумма = СтрокаОписания.СуммаДокументов;
	ОбластьШапка.Параметры.ФактическихДней = СтрокаОписания.ФактическихДней;
	ОбластьШапка.Параметры.ПериодичностьВыплат = СтрокаОписания.ПериодичностьВыплат;
	ОбластьШапка.Параметры.Ставка = СтрокаОписания.Процент;
	ОбластьШапка.Параметры.ПараметрыГенеральногоСоглашенияСБанком = СтрокаОписания.НомераДоговоров;
	ОбластьШапка.Параметры.ОписаниеИнструмента = "";
	// Таблица условий договора
	ПриоритетныйОтвет = 0;
	ОбластиТаблицыУсловийДоговора = ПолучитьОбластьТаблицыУсловийДоговора(Макет, СтрокаОписания.НомерСтроки, ПриоритетныйОтвет);
	Если ПриоритетныйОтвет = 2 Тогда
		РезультатАнализа = "SPPI-тест не пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестНеПройден");
	ИначеЕсли ПриоритетныйОтвет = 1 Тогда
		РезультатАнализа = "Вопрос к обсуждению";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветВопросКОбсуждению");
	Иначе
		РезультатАнализа = "SPPI-тест пройден";
		ОбластьЦветРезультатаАнализа = Макет.ПолучитьОбласть("ЦветТестПройден");
	КонецЕсли;
	ОбластьШапка.Параметры.РезультатАнализа = РезультатАнализа;
	ЦветРезультатаАнализа = ОбластьЦветРезультатаАнализа.Область(1, 1, 1, 1).ЦветФона;
	ОбластьШапка.Области.Найти("РезультатАнализаСделкиРЕПО").ЦветФона = ЦветРезультатаАнализа;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластиТаблицыУсловийДоговора);
	
	Возврат ТабличныйДокумент;
КонецФункции

// Получение области таблицы условий договора табличного документа
Функция ПолучитьОбластьТаблицыУсловийДоговора(Макет, НомерОписанияТабличногоДокумента, ПриоритетныйОтвет)
	ОбластьЗаголовкиУсловийДоговора = Макет.ПолучитьОбласть("ЗаголовкиУсловийДоговора");
	ОбластьСтрокаУсловийДоговора = Макет.ПолучитьОбласть("СтрокаУсловийДоговора");
	ТекущиеНастройкиОтветов = НастройкиОтветов.НайтиСтроки(
		Новый Структура("НомерОписанияТабличногоДокумента", НомерОписанияТабличногоДокумента));
	ПриоритетныйОтвет = 0; // Приоритет: ПометкаНет (0) -> ПометкаВопросКОбсуждению (1) -> ПометкаДа (2) (самый приоритетный)
	ОбластиТаблицыУсловийДоговора = Новый ТабличныйДокумент;
	ОбластиТаблицыУсловийДоговора.Вывести(ОбластьЗаголовкиУсловийДоговора);
	Для Каждого СтрокаНастройкиОтветов Из ТекущиеНастройкиОтветов Цикл
		ТекущийОтвет = КритерииТестирования[СтрокаНастройкиОтветов.НомерКритерияТестирования - 1];
		ОбластьСтрокаУсловийДоговора.Параметры.Номер = СтрокаНастройкиОтветов.Порядок;
		ОбластьСтрокаУсловийДоговора.Параметры.УсловияДоговора = ТекущийОтвет.УсловияДоговора;
		ОбластьСтрокаУсловийДоговора.Параметры.Описание = ТекущийОтвет.Описание;
		ОбластьСтрокаУсловийДоговора.Параметры.ПометкаДа =
			?(СтрокаНастройкиОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Да"), "v", "");
		ОбластьСтрокаУсловийДоговора.Параметры.ПометкаНет =
			?(СтрокаНастройкиОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Нет"), "v", "");
		ОбластьСтрокаУсловийДоговора.Параметры.ПометкаВопросКОбсуждению =
			?(СтрокаНастройкиОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.ВопросКОбсуждению"), "v", "");
		Если ПриоритетныйОтвет < 2 И СтрокаНастройкиОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.Да") Тогда
			ПриоритетныйОтвет = 2;
		ИначеЕсли ПриоритетныйОтвет < 1 И СтрокаНастройкиОтветов.Ответ = ПредопределенноеЗначение("Перечисление.ОтветыТестированияSPPI.ВопросКОбсуждению") Тогда
			ПриоритетныйОтвет = 1;
		КонецЕсли;
		ОбластиТаблицыУсловийДоговора.Вывести(ОбластьСтрокаУсловийДоговора);
	КонецЦикла;
	Возврат ОбластиТаблицыУсловийДоговора;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Команды

Процедура АвтоматическаяОтправкаРезультатаТестирования(Ошибки = Неопределено)
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.АдресаЭлектроннойПочты) Тогда
		Ошибки.Добавить("Параметр ""АдресаЭлектроннойПочты"" не заполнен.");
		Возврат;
	КонецЕсли;
	Попытка
		// Подготовка данных для создания отчёта
		ЭтотОбъект.СформироватьДанныеОЦенныхБумагах(Ошибки);
		Если Ошибки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		// Создание и сохранение отчёта в папку (табличных документов, распределённых по Excel-файлам)
		ВыгруженныеФайлы = ВыгрузитьВExcel();
		Если ВыгруженныеФайлы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		// Отправка уведомлений на почту
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", ЭтотОбъект.АдресаЭлектроннойПочты);
		ПараметрыПисьма.Вставить("Тема", "Произведено тестирование SPPI");
		ПараметрыПисьма.Вставить("Тело", "Сформированные документы сохранены в директории: """ + ЭтотОбъект.ПутьВыгрузкиВExcel + """");
		ПараметрыПисьма.Вставить("ТипТекста", ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст"));
		Вложения = Новый Соответствие;
		Для Каждого ВыгруженныйФайл Из ВыгруженныеФайлы Цикл
			ВременноеХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВыгруженныйФайл.ПолноеИмя));
			Вложения.Вставить(ВыгруженныйФайл.Имя, ВременноеХранилище);
		КонецЦикла;
		ПараметрыПисьма.Вставить("Вложения", Вложения);
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
			РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	Исключение
		Ошибки.Добавить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура АвтоматическаяОтправкаУведомления(Ошибки = Неопределено)
	// Параметр "Организация"
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		Ошибки.Добавить("Параметр ""Организация"" не заполнен.");
	КонецЕсли;
	// Параметр "Период" ("ДатаНачала", "ДатаОкончания")
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Период.ДатаНачала) Или Не ЗначениеЗаполнено(ЭтотОбъект.Период.ДатаОкончания) Тогда
		Ошибки.Добавить("Параметр ""Период"" не заполнен.");
	КонецЕсли;
	// Параметр "СчетаДоверительногоУправления"
	Если ЭтотОбъект.СчетаДоверительногоУправления.Количество() = 0
		Или Не ЗначениеЗаполнено(ЭтотОбъект.СчетаДоверительногоУправления[0].Ссылка)
	Тогда
		Ошибки.Добавить("Параметр ""СчетаДоверительногоУправления"" не заполнен.");
	КонецЕсли;
	// Параметр "АдресаЭлектроннойПочты"
	Если ПустаяСтрока(ЭтотОбъект.АдресаЭлектроннойПочты) Тогда
		Ошибки.Добавить("Параметр ""АдресаЭлектроннойПочты"" не заполнен.");
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область Запрос
		"ВЫБРАТЬ
		|	УчетныеАктивыЕПС.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _УчетныеАктивыЕПСУдерживаемыеДоПогашения
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	УчетныеАктивыЕПС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОбороты.Период, ДЕНЬ) КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага КАК Облигация
		|ПОМЕСТИТЬ _ОблигацииДляТестирования
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ),
		|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ), ДЕНЬ, 14),
		|			РЕГИСТРАТОР,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС В
		|					(ВЫБРАТЬ
		|						_УчетныеАктивыЕПСУдерживаемыеДоПогашения.Ссылка
		|					ИЗ
		|						_УчетныеАктивыЕПСУдерживаемыеДоПогашения)) КАК БухПартииЦенныхБумагОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОбороты.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.ИсполнениеОбязательствПоСделке), ТИП(Документ.ПоставкаЦенныхБумаг))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.Сделка
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.Сделка).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|	И (НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ИЛИ ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.ПоставкаЦенныхБумаг).ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход))
		|	И БухПартииЦенныхБумагОбороты.КоличествоПриход > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОблигацииДляТестированияSPPI.ДатаПокупки,
		|	ОблигацииДляТестированияSPPI.СчетДоверительногоУправления,
		|	ОблигацииДляТестированияSPPI.Облигация
		|ИЗ
		|	РегистрСведений.ОблигацииДляТестированияSPPI КАК ОблигацииДляТестированияSPPI
		|ГДЕ
		|	ОблигацииДляТестированияSPPI.Организация = &Организация
		|	И ОблигацииДляТестированияSPPI.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
		|	И ОблигацииДляТестированияSPPI.ДатаПокупки >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И ОблигацииДляТестированияSPPI.ДатаПокупки <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) КАК ДатаПокупки,
		|	УсловияСделок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделок.ЦеннаяБумага КАК Облигация
		|ИЗ
		|	РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОблигацииДляТестирования КАК _ОблигацииДляТестирования
		|		ПО (НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) = _ОблигацииДляТестирования.ДатаПокупки)
		|			И УсловияСделок.СчетДоверительногоУправления = _ОблигацииДляТестирования.СчетДоверительногоУправления
		|			И ((ВЫРАЗИТЬ(УсловияСделок.ЦеннаяБумага КАК Справочник.Облигации)) = _ОблигацииДляТестирования.Облигация)
		|ГДЕ
		|	УсловияСделок.Период >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И УсловияСделок.Период <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И УсловияСделок.Организация = &Организация
		|	И УсловияСделок.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
		|	И УсловияСделок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|	И УсловияСделок.Сделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|	И УсловияСделок.Количество > 0
		|	И _ОблигацииДляТестирования.Облигация ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПокупки,
		|	СчетДоверительногоУправления,
		|	Облигация";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ЭтотОбъект.СчетаДоверительногоУправления.ВыгрузитьКолонку("Ссылка"));
	Выборка = Запрос.Выполнить().Выбрать();
	ПериодОднодневный = ЭтотОбъект.Период.ДатаНачала = ЭтотОбъект.Период.ДатаОкончания;
	ПериодТекстом = ?(ПериодОднодневный,
		Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"),
		"период с " + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по "
			+ Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	ТелоПисьма = "За " + ПериодТекстом + " произошли покупки облигаций, для которых нужно проверить, нужно ли включать их в тестирование SPPI:";
	КоличествоСтрокОблигаций = 0;
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + Символы.ПС + Символы.Таб + ?(ПериодОднодневный, "[" + Формат(Выборка.ДатаПокупки, "ДФ=dd.MM.yyyy") + "] - ", "")
			+ Строка(Выборка.СчетДоверительногоУправления) + " - " + Строка(Выборка.Облигация);
		КоличествоСтрокОблигаций = КоличествоСтрокОблигаций + 1;
	КонецЦикла;
	// Отправка уведомлений на почту
	Если КоличествоСтрокОблигаций > 0 Тогда
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", ЭтотОбъект.АдресаЭлектроннойПочты);
		ПараметрыПисьма.Вставить("Тема", "Нужно проверить облигации для тестирования SPPI");
		ПараметрыПисьма.Вставить("Тело", ТелоПисьма);
		ПараметрыПисьма.Вставить("ТипТекста", ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст"));
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
			РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		Сообщить("Уведомление о необходимости проверки (" + КоличествоСтрокОблигаций + ") облигаций успешно отправлено.");
	Иначе
		Сообщить("Нет облигаций, которые необходимо проверить. Уведомление не требуется.");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
