
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ВидВнутреннегоДокумента) 
		И Данные.ВидВнутреннегоДокумента.ПринадлежитЭлементу(Справочники.ВидыВнутреннихДокументов.Распорядительные) Тогда
	
		СтандартнаяОбработка = Ложь;
		
		Представление = "Приказ № " + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
	
	КонецЕсли; 

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("НаименованиеДокумента");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидВнутреннегоДокумента");
	
КонецПроцедуры

Функция ПечатьВыпискиИзРеестраКонтроляОценки(Ссылка) Экспорт

	Макет = ПолучитьМакет("ВыпискаИзРеестраКонтроляОценки");
	Область = Макет.ПолучитьОбласть("Страница");
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеДокументыОрганизации.Ссылка КАК Ссылка,
		|	ВнутренниеДокументыОрганизации.Дата КАК Дата,
		|	ВнутренниеДокументыОрганизации.ДатаОценки КАК ДатаОценки,
		|	Организации.ЮрФизЛицо КАК ЮрФизЛицоОрганизация,
		|	Сотрудники.ЮрФизЛицо КАК ЮрФизЛицоЗаместитель,
		|	ВнутренниеДокументыОрганизации.Организация КАК Организация
		|ПОМЕСТИТЬ _ДанныеДокументов
		|ИЗ
		|	Документ.ВнутреннийДокумент КАК ВнутренниеДокументыОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ВнутренниеДокументыОрганизации.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ВнутренниеДокументыОрганизации.Заместитель = Сотрудники.Ссылка
		|ГДЕ
		|	ВнутренниеДокументыОрганизации.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДокументов.Ссылка КАК Ссылка,
		|	_ДанныеДокументов.Дата КАК Дата,
		|	_ДанныеДокументов.ДатаОценки КАК ДатаОценки,
		|	РеквизитыСотрудниковОрганизации.Фамилия + "" "" + РеквизитыСотрудниковОрганизации.Имя + "" "" + РеквизитыСотрудниковОрганизации.Отчество КАК ФиоСотрудника,
		|	РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДанныеДокументов.Ссылка КАК Ссылка,
		|			МАКСИМУМ(РеквизитыСотрудниковОрганизации.Период) КАК ПериодРеквизитовСотрудника,
		|			МАКСИМУМ(РеквизитыЮридическихЛицАнкетные.Период) КАК ПериодРеквизитовОрганизации
		|		ИЗ
		|			_ДанныеДокументов КАК _ДанныеДокументов
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации КАК РеквизитыСотрудниковОрганизации
		|				ПО _ДанныеДокументов.Организация = РеквизитыСотрудниковОрганизации.Организация
		|					И _ДанныеДокументов.ЮрФизЛицоЗаместитель = РеквизитыСотрудниковОрганизации.ЮрФизЛицо
		|					И (РеквизитыСотрудниковОрганизации.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					И _ДанныеДокументов.ДатаОценки >= РеквизитыСотрудниковОрганизации.Период
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|				ПО _ДанныеДокументов.Организация = РеквизитыЮридическихЛицАнкетные.Организация
		|					И _ДанныеДокументов.ЮрФизЛицоОрганизация = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|					И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					И _ДанныеДокументов.ДатаОценки >= РеквизитыЮридическихЛицАнкетные.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДанныеДокументов.Ссылка) КАК ВложенныйЗапрос
		|		ПО _ДанныеДокументов.Ссылка = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|		ПО (ВложенныйЗапрос.ПериодРеквизитовОрганизации = РеквизитыЮридическихЛицАнкетные.Период)
		|			И _ДанныеДокументов.Организация = РеквизитыЮридическихЛицАнкетные.Организация
		|			И _ДанныеДокументов.ЮрФизЛицоОрганизация = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации КАК РеквизитыСотрудниковОрганизации
		|		ПО (ВложенныйЗапрос.ПериодРеквизитовСотрудника = РеквизитыСотрудниковОрганизации.Период)
		|			И _ДанныеДокументов.Организация = РеквизитыСотрудниковОрганизации.Организация
		|			И _ДанныеДокументов.ЮрФизЛицоЗаместитель = РеквизитыСотрудниковОрганизации.ЮрФизЛицо
		|			И (РеквизитыСотрудниковОрганизации.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))";		
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Пока Выборка.Следующий() Цикл
	
		Область.Параметры.Заполнить(Выборка);
		
		Для каждого КолонкаРезультат Из Результат.Колонки Цикл
			
			ИмяКолонки = КолонкаРезультат.Имя;
			Если ИмяКолонки = "Ссылка" Тогда
				Продолжить;
			КонецЕсли; 
			
			Если КолонкаРезультат.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
				Область.Параметры[ИмяКолонки] = Формат(Выборка[ИмяКолонки], "ДФ=dd.MM.yyyy");
			Иначе
				Область.Параметры[ИмяКолонки] = Выборка[ИмяКолонки];
			КонецЕсли; 
		
		КонецЦикла; 
		
		
		ТабличныйДокумент.Вывести(Область);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

