
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Ожидаемые погашения ценных бумаг",
		"1.96",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);	
	
	// Фиксируем старт операции
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетаДоверительногоУправления,ДетализироватьПоСчетамДоверительногоУправления,КлючТекущегоВарианта", Новый Структура("ВариантОтчета",ВариантОтчета));
	
	Попытка
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
		
	КонецПопытки;
		
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	МВТ = Новый МенеджерВременныхТаблиц;

	МинимальнаяДатаФиксации = ПолучитьМинимальнуюДатуФиксации(МВТ, ВариантОтчета);
			
	Параметры.УстановитьЗначениеПараметра("МинимальнаяДатаФиксации", 						МинимальнаяДатаФиксации);	
	Параметры.УстановитьЗначениеПараметра("НачалоПериода", 									ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("КонецПериода", 									ЭтотОбъект.Период.ДатаОкончания);
	Параметры.УстановитьЗначениеПараметра("ДетализироватьПоСчетамДоверительногоУправления", ЭтотОбъект.ДетализироватьПоСчетамДоверительногоУправления);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.УстановитьПараметр("МинимальнаяДатаФиксации", 								МинимальнаяДатаФиксации);	
	Запрос.УстановитьПараметр("Организация", 											ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 											Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 											Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтборПоВидамДоговоровИСчетаДоверительногоУправления",	ЭтотОбъект.ОтборПоВидамДоговоровИСчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", 							ЭтотОбъект.СчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("ИсключитьВидыДоговоровИСчетаДоверительногоУправления",	ЭтотОбъект.ИсключитьВидыДоговоровИСчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("ИсключаемыеСчетаДоверительногоУправления", 				ЭтотОбъект.ИсключаемыеСчетаДоверительногоУправления);
	Запрос.УстановитьПараметр("ДетализироватьПоСчетамДоверительногоУправления", 		ЭтотОбъект.ДетализироватьПоСчетамДоверительногоУправления);
			
	#Область Текст_запроса
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниПериода
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &МинимальнаяДатаФиксации И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.ВидКода КАК ВидКода,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыВТорговыхСистемах
		|ИЗ
		|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода В (ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN), ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ), ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий))) КАК КодыВТорговыхСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (НЕ &ОтборПоВидамДоговоровИСчетаДоверительногоУправления
		|			ИЛИ СчетаДоверительногоУправления.Ссылка В (&СчетаДоверительногоУправления))
		|	И НЕ(&ИсключитьВидыДоговоровИСчетаДоверительногоУправления
		|				И СчетаДоверительногоУправления.Ссылка В (&ИсключаемыеСчетаДоверительногоУправления))
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &МинимальнаяДатаФиксации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО КАК СделкаРЕПО
		|ПОМЕСТИТЬ _ЕстьВтораяЧастьРЕПО
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2)
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО <= &КонецПериода
		|	И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОстаток <= 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО КАК СделкаРЕПО
		|ПОМЕСТИТЬ _НетВторойЧастиРЕПО
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2)
		|ГДЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОстаток > 0
		|	И НЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО В
		|				(ВЫБРАТЬ
		|					_ЕстьВтораяЧастьРЕПО.СделкаРЕПО
		|				ИЗ
		|					_ЕстьВтораяЧастьРЕПО КАК _ЕстьВтораяЧастьРЕПО)
		|	И УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО <= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.Период КАК Период,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот КАК КоличествоОборот,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ДепозитарныйСчет.Брокер КАК Брокер
		|ПОМЕСТИТЬ _ОстаткиИОборотыЦенныхБумаг
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО,
		|	0,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток,
		|	-ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО.Брокер
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НетВторойЧастиРЕПО КАК _НетВторойЧастиРЕПО
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = _НетВторойЧастиРЕПО.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = _НетВторойЧастиРЕПО.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления = _НетВторойЧастиРЕПО.СчетДоверительногоУправления
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = _НетВторойЧастиРЕПО.ЦеннаяБумага
		|ГДЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период >= КОНЕЦПЕРИОДА(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)
		|	И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаКонечныйОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления,
		|	&КонецПериода,
		|	-СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход),
		|	-СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход),
		|	0,
		|	ОстаткиЦенныхБумагОбороты.ДепозитарныйСчет.Брокер
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(
		|			,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ОстаткиЦенныхБумагОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НетВторойЧастиРЕПО КАК _НетВторойЧастиРЕПО
		|		ПО ОстаткиЦенныхБумагОбороты.Организация = _НетВторойЧастиРЕПО.Организация
		|			И ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления = _НетВторойЧастиРЕПО.СчетДоверительногоУправления
		|			И ОстаткиЦенныхБумагОбороты.ЦеннаяБумага = _НетВторойЧастиРЕПО.ЦеннаяБумага
		|			И ОстаткиЦенныхБумагОбороты.Регистратор = _НетВторойЧастиРЕПО.СделкаРЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОбороты.Период,
		|	ОстаткиЦенныхБумагОбороты.ДепозитарныйСчет.Брокер,
		|	ОстаткиЦенныхБумагОбороты.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОбороты1.Период,
		|	-СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход),
		|	-СУММА(ОстаткиЦенныхБумагОбороты.КоличествоПриход),
		|	0,
		|	ОстаткиЦенныхБумагОбороты.ДепозитарныйСчет.Брокер
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(
		|			,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ОстаткиЦенныхБумагОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НетВторойЧастиРЕПО КАК _НетВторойЧастиРЕПО
		|		ПО ОстаткиЦенныхБумагОбороты.Организация = _НетВторойЧастиРЕПО.Организация
		|			И ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления = _НетВторойЧастиРЕПО.СчетДоверительногоУправления
		|			И ОстаткиЦенныхБумагОбороты.ЦеннаяБумага = _НетВторойЧастиРЕПО.ЦеннаяБумага
		|			И ОстаткиЦенныхБумагОбороты.Регистратор = _НетВторойЧастиРЕПО.СделкаРЕПО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(&МинимальнаяДатаФиксации, &КонецПериода, День, ) КАК ОстаткиЦенныхБумагОбороты1
		|		ПО ОстаткиЦенныхБумагОбороты.Организация = ОстаткиЦенныхБумагОбороты1.Организация
		|			И ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления = ОстаткиЦенныхБумагОбороты1.СчетДоверительногоУправления
		|			И ОстаткиЦенныхБумагОбороты.ДепозитарныйСчет = ОстаткиЦенныхБумагОбороты1.ДепозитарныйСчет
		|			И ОстаткиЦенныхБумагОбороты.Рынок = ОстаткиЦенныхБумагОбороты1.Рынок
		|			И ОстаткиЦенныхБумагОбороты.ЦеннаяБумага = ОстаткиЦенныхБумагОбороты1.ЦеннаяБумага
		|			И (_НетВторойЧастиРЕПО.ДатаВторойЧастиРЕПО >= ОстаткиЦенныхБумагОбороты.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОбороты.Период,
		|	ОстаткиЦенныхБумагОбороты.ДепозитарныйСчет.Брокер,
		|	ОстаткиЦенныхБумагОбороты.Регистратор,
		|	ОстаткиЦенныхБумагОбороты1.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОблигацииПоАС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)) КАК БухПартииЦенныхБумагОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниПериода.Дата КАК ДатаОстатков,
		|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход
		|ПОМЕСТИТЬ _РасходЗаблокированныхЦенныхБумагПоДатамПериода
		|ИЗ
		|	_ДниПериода КАК _ДниПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.ОстаткиИОбороты(
		|				&МинимальнаяДатаФиксации,
		|				&КонецПериода,
		|				Регистратор,
		|				ДвиженияИГраницыПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДУ.Ссылка
		|						ИЗ
		|							_СчетаДУ КАК _СчетаДУ)
		|					И ЦеннаяБумага В
		|						(ВЫБРАТЬ
		|							_ВыплатыЗаПериод.ЦеннаяБумага
		|						ИЗ
		|							_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|					И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
		|					И ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)) КАК ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты
		|		ПО (_ДниПериода.Дата = НАЧАЛОПЕРИОДА(ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.Период, ДЕНЬ))
		|ГДЕ
		|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеЦеннойБумаги
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниПериода.Дата,
		|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.ЦеннаяБумага,
		|	ОстаткиЦенныхБумагЗаблокированныеОстаткиИОбороты.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период КАК Период,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот КАК Оборот,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоНачальныйОстаток КАК НачальныйОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток КАК КонечныйОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _ЗадолженностьПоЦБОстаткиИОбороты
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период КАК Период,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОборот КАК Оборот,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоНачальныйОстаток КАК НачальныйОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток КАК КонечныйОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО КАК СделкаРЕПО
		|ПОМЕСТИТЬ _ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2)
		|ГДЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период <= КОНЕЦПЕРИОДА(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности,
		|	-ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоНачальныйОстаток,
		|	0,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|			&МинимальнаяДатаФиксации,
		|			&КонецПериода,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ВыплатыЗаПериод.ЦеннаяБумага
		|					ИЗ
		|						_ВыплатыЗаПериод КАК _ВыплатыЗаПериод)
		|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = УсловияСделокРЕПОСрезПоследних.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага
		|			И (УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = 2)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НетВторойЧастиРЕПО КАК _НетВторойЧастиРЕПО
		|		ПО ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО = _НетВторойЧастиРЕПО.СделкаРЕПО
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация = _НетВторойЧастиРЕПО.Организация
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления = _НетВторойЧастиРЕПО.СчетДоверительногоУправления
		|			И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага = _НетВторойЧастиРЕПО.ЦеннаяБумага
		|ГДЕ
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период >= КОНЕЦПЕРИОДА(УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО, ДЕНЬ)
		|	И ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СуммаКонечныйОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Период КАК Период,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток КАК СуммаКупонаНачальныйОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход КАК СуммаКупонаРасход
		|ПОМЕСТИТЬ _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.Ссылка
		|					ИЗ
		|						_СчетаДУ КАК _СчетаДУ)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И (ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|					ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|						И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ВыкупЭмитентом
		|						И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниПериода.Дата КАК ДатаОстатков,
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент КАК ДепозитныйВклад,
		|	СУММА(ВЫБОР
		|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ВЫБОР
		|						КОГДА _ДниПериода.Дата > &НачалоПериода
		|							ТОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаКонечныйОстаток
		|						ИНАЧЕ ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаНачальныйОстаток
		|					КОНЕЦ
		|			КОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период < _ДниПериода.Дата
		|				ТОГДА ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачальныйОстаток
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода
		|ИЗ
		|	_ДниПериода КАК _ДниПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|				&НачалоПериода,
		|				&КонецПериода,
		|				День,
		|				ДвиженияИГраницыПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДУ.Ссылка
		|						ИЗ
		|							_СчетаДУ КАК _СчетаДУ)
		|					И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
		|					И ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ПО _ДниПериода.Дата >= ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниПериода.Дата,
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Период КАК Период,
		|	ОстаткиДенежныхСредств.Организация КАК Организация,
		|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
		|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств
		|ПОМЕСТИТЬ _ПоступленияДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДУ.Ссылка
		|			ИЗ
		|				_СчетаДУ КАК _СчетаДУ)
		|	И ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаКупона))
		|				И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|			ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ЗакрытиеДепозитногоВклада), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу))
		|			ИЛИ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И (ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|						И ВЫРАЗИТЬ(ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).ВыкупЭмитентом
		|					ИЛИ ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.Сделка
		|						И ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.Сделка).ВыкупЭмитентом))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.Основание КАК Основание,
		|	ВложенныйЗапрос.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|	_ВыплатыЗаПериод.ВидВыплаты КАК ВидВыплаты,
		|	_ВыплатыЗаПериод.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ДатаСделки > _ВыплатыЗаПериод.ДатаФиксацииОстатков
		|			ТОГДА &КонецПериода
		|		ИНАЧЕ КОНЕЦПЕРИОДА(_ВыплатыЗаПериод.ДатаФиксацииОстатков, ДЕНЬ)
		|	КОНЕЦ КАК ДатаСреза
		|ПОМЕСТИТЬ _СделкиОснованияЗадолженностиПоЦеннымБумагам
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЗадолженностьПоЦБОстаткиИОбороты.Организация КАК Организация,
		|		_ЗадолженностьПоЦБОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ЗадолженностьПоЦБОстаткиИОбороты.Основание КАК Основание,
		|		ВЫБОР
		|			КОГДА _ЗадолженностьПоЦБОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностьПоЦБОстаткиИОбороты.Основание КАК Документ.Сделка).Дата
		|			КОГДА _ЗадолженностьПоЦБОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностьПоЦБОстаткиИОбороты.Основание КАК Документ.СделкаРЕПО).Дата
		|		КОНЕЦ КАК ДатаСделки,
		|		_ЗадолженностьПоЦБОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|		ВЫБОР
		|			КОГДА _ЗадолженностьПоЦБОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ТОГДА 1
		|			КОГДА _ЗадолженностьПоЦБОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				ТОГДА 2
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ЧастьСделкиРепо
		|	ИЗ
		|		_ЗадолженностьПоЦБОстаткиИОбороты КАК _ЗадолженностьПоЦБОстаткиИОбороты
		|	ГДЕ
		|		(_ЗадолженностьПоЦБОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|				ИЛИ _ЗадолженностьПоЦБОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты.Организация,
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты.СчетДоверительногоУправления,
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты.СделкаРЕПО,
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты.СделкаРЕПО.Дата,
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты.ЦеннаяБумага,
		|		2
		|	ИЗ
		|		_ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты КАК _ЗадолженностьПоВторойЧастиРепоОстаткиИОбороты) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВыплатыЗаПериод КАК _ВыплатыЗаПериод
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = _ВыплатыЗаПериод.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Организация КАК Организация,
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание КАК Ссылка,
		|	""Купон"" КАК ВидВыплаты,
		|	ВЫБОР
		|		КОГДА _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ЧастьСделкиРепо
		|ПОМЕСТИТЬ _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|ГДЕ
		|	(_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|			ИЛИ _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО)
		|	И _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаРасход <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Организация,
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления,
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание,
		|	""Оферта"",
		|	ВЫБОР
		|		КОГДА _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|ГДЕ
		|	(_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.Сделка
		|			ИЛИ _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО)
		|	И _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаРасход <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ПоступленияДенежныхСредств.Организация,
		|	_ПоступленияДенежныхСредств.СчетДоверительногоУправления,
		|	_ПоступленияДенежныхСредств.Регистратор,
		|	""Оферта"",
		|	0
		|ИЗ
		|	_ПоступленияДенежныхСредств КАК _ПоступленияДенежныхСредств
		|ГДЕ
		|	_ПоступленияДенежныхСредств.Регистратор ССЫЛКА Документ.Сделка
		|	И _ПоступленияДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОснованияИзЗадолжености.Основание КАК Основание,
		|	ОснованияИзЗадолжености.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|	ОснованияИзЗадолжености.ВидВыплаты КАК ВидВыплаты,
		|	ОснованияИзЗадолжености.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	ЕСТЬNULL(УсловияСделокРепо.ЦеннаяБумага, УсловияСделок.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(УсловияСделокРепо.Количество, УсловияСделок.Количество) КАК Количество,
		|	ЕСТЬNULL(УсловияСделокРепо.ДатаИсполнения, УсловияСделок.ДатаИсполнения) КАК ДатаИсполнения,
		|	ЕСТЬNULL(УсловияСделокРепо.ДатаПоставки, УсловияСделок.ДатаПоставки) КАК ДатаПоставки,
		|	ЕСТЬNULL(УсловияСделокРепо.Период, УсловияСделок.Период) КАК Период
		|ПОМЕСТИТЬ _УсловияСделокОснованияЗадолжености
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.Организация, _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.Организация) КАК Организация,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления, _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.Основание, _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.Ссылка) КАК Основание,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.ЧастьСделкиРепо, _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.ЧастьСделкиРепо) КАК ЧастьСделкиРепо,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.ВидВыплаты, _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.ВидВыплаты) КАК ВидВыплаты,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.ДатаФиксацииОстатков, &КонецПериода) КАК ДатаФиксацииОстатков,
		|		ЕСТЬNULL(_СделкиОснованияЗадолженностиПоЦеннымБумагам.ДатаСреза, &КонецПериода) КАК ДатаСреза
		|	ИЗ
		|		_СделкиОснованияЗадолженностиПоЦеннымБумагам КАК _СделкиОснованияЗадолженностиПоЦеннымБумагам
		|			ПОЛНОЕ СОЕДИНЕНИЕ _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат КАК _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат
		|			ПО _СделкиОснованияЗадолженностиПоЦеннымБумагам.Основание = _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.Ссылка
		|				И _СделкиОснованияЗадолженностиПоЦеннымБумагам.ЧастьСделкиРепо = _СделкиОснованияЗадолженностиПоДенежнымСредствамИРегистраторыОплат.ЧастьСделкиРепо) КАК ОснованияИзЗадолжености
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРепо
		|		ПО ОснованияИзЗадолжености.Организация = УсловияСделокРепо.Организация
		|			И ОснованияИзЗадолжености.СчетДоверительногоУправления = УсловияСделокРепо.СчетДоверительногоУправления
		|			И ОснованияИзЗадолжености.Основание = УсловияСделокРепо.СделкаРЕПО
		|			И (УсловияСделокРепо.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)))
		|			И ОснованияИзЗадолжености.ЧастьСделкиРепо = УсловияСделокРепо.ЧастьСделкиРЕПО
		|			И ОснованияИзЗадолжености.ДатаСреза >= УсловияСделокРепо.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|		ПО ОснованияИзЗадолжености.Организация = УсловияСделок.Организация
		|			И ОснованияИзЗадолжености.СчетДоверительногоУправления = УсловияСделок.СчетДоверительногоУправления
		|			И ОснованияИзЗадолжености.Основание = УсловияСделок.Сделка
		|			И (УсловияСделок.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)))
		|			И ОснованияИзЗадолжености.ДатаСреза >= УсловияСделок.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделокОснованияЗадолжености.Основание КАК Основание,
		|	_УсловияСделокОснованияЗадолжености.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|	_УсловияСделокОснованияЗадолжености.ВидВыплаты КАК ВидВыплаты,
		|	_УсловияСделокОснованияЗадолжености.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	_УсловияСделокОснованияЗадолжености.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_УсловияСделокОснованияЗадолжености.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА _УсловияСделокОснованияЗадолжености.ДатаИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _УсловияСделокОснованияЗадолжености.ДатаИсполнения
		|		КОГДА _УсловияСделокОснованияЗадолжености.ДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _УсловияСделокОснованияЗадолжености.ДатаПоставки
		|		ИНАЧЕ _УсловияСделокОснованияЗадолжености.Период
		|	КОНЕЦ КАК ДатаИсполнения
		|ПОМЕСТИТЬ _УсловияСделокСрезНаДатуФиксации
		|ИЗ
		|	_УсловияСделокОснованияЗадолжености КАК _УсловияСделокОснованияЗадолжености
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияСделокОснованияЗадолжености.Основание КАК Основание,
		|			_УсловияСделокОснованияЗадолжености.ЧастьСделкиРепо КАК ЧастьСделкиРепо,
		|			_УсловияСделокОснованияЗадолжености.ВидВыплаты КАК ВидВыплаты,
		|			_УсловияСделокОснованияЗадолжености.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|			МАКСИМУМ(_УсловияСделокОснованияЗадолжености.Период) КАК Период
		|		ИЗ
		|			_УсловияСделокОснованияЗадолжености КАК _УсловияСделокОснованияЗадолжености
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияСделокОснованияЗадолжености.Основание,
		|			_УсловияСделокОснованияЗадолжености.ЧастьСделкиРепо,
		|			_УсловияСделокОснованияЗадолжености.ВидВыплаты,
		|			_УсловияСделокОснованияЗадолжености.ДатаФиксацииОстатков) КАК ВложенныйЗапрос
		|		ПО _УсловияСделокОснованияЗадолжености.Основание = ВложенныйЗапрос.Основание
		|			И _УсловияСделокОснованияЗадолжености.ЧастьСделкиРепо = ВложенныйЗапрос.ЧастьСделкиРепо
		|			И _УсловияСделокОснованияЗадолжености.ВидВыплаты = ВложенныйЗапрос.ВидВыплаты
		|			И _УсловияСделокОснованияЗадолжености.ДатаФиксацииОстатков = ВложенныйЗапрос.ДатаФиксацииОстатков
		|			И _УсловияСделокОснованияЗадолжености.Период = ВложенныйЗапрос.Период
		|ГДЕ
		|	_УсловияСделокОснованияЗадолжености.ДатаФиксацииОстатков >= ВЫБОР
		|			КОГДА _УсловияСделокОснованияЗадолжености.ДатаИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА _УсловияСделокОснованияЗадолжености.ДатаИсполнения
		|			КОГДА _УсловияСделокОснованияЗадолжености.ДатаПоставки <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА _УсловияСделокОснованияЗадолжености.ДатаПоставки
		|			ИНАЧЕ _УсловияСделокОснованияЗадолжености.Период
		|		КОНЕЦ
		|	ИЛИ _УсловияСделокОснованияЗадолжености.ЧастьСделкиРепо > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание КАК Основание,
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВводЦенныхБумагЦенныеБумаги.Количество) КАК Количество
		|ПОМЕСТИТЬ _ЦенныеБумагиИзОснований
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И (_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Контрагент = ВЫРАЗИТЬ(ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо)
		|			И (_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание,
		|	ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = 1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_УсловияСделокСрезНаДатуФиксации.Основание,
		|	_УсловияСделокСрезНаДатуФиксации.ЦеннаяБумага,
		|	СУММА(_УсловияСделокСрезНаДатуФиксации.Количество)
		|ИЗ
		|	_УсловияСделокСрезНаДатуФиксации КАК _УсловияСделокСрезНаДатуФиксации
		|
		|СГРУППИРОВАТЬ ПО
		|	_УсловияСделокСрезНаДатуФиксации.Основание,
		|	_УсловияСделокСрезНаДатуФиксации.ЦеннаяБумага
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _УсловияСделокСрезНаДатуФиксации.ЦеннаяБумага) = 1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Количество
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ПО _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Организация = ОперацииСЦеннымиБумагами.Организация
		|			И _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления = ОперацииСЦеннымиБумагами.СчетДоверительногоУправления
		|			И (ОперацииСЦеннымиБумагами.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)))
		|			И _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание = ОперацииСЦеннымиБумагами.Операция
		|			И (_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеКупона
		|				ИЛИ _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|				ИЛИ _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.НачислениеДивидендов)
		|			И (_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Векселя).Серия + ""/"" + ВЫРАЗИТЬ(ВложенныйЗапрос.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|	КОНЕЦ КАК ГосРегНомер,
		|	ВложенныйЗапрос.ВалютаНоминала.Наименование КАК ВалютаНоминалаНаименование,
		|	КодыНаММВБ.Код КАК КодНаММВБ,
		|	КодыНаММВБ_Краткие.Код КАК КраткийКодММВБ,
		|	КодыISIN.Код КАК КодISIN
		|ПОМЕСТИТЬ _КодыЦенныхБумаг
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ВыплатыЗаПериод.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ВыплатыЗаПериод.ВалютаНоминала КАК ВалютаНоминала
		|	ИЗ
		|		_ВыплатыЗаПериод КАК _ВыплатыЗаПериод
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_УсловияСделокСрезНаДатуФиксации.ЦеннаяБумага,
		|		_УсловияСделокСрезНаДатуФиксации.ЦеннаяБумага.ВалютаНоминала
		|	ИЗ
		|		_УсловияСделокСрезНаДатуФиксации КАК _УсловияСделокСрезНаДатуФиксации
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ЦенныеБумагиИзОснований.ЦеннаяБумага,
		|		_ЦенныеБумагиИзОснований.ЦеннаяБумага.ВалютаНоминала
		|	ИЗ
		|		_ЦенныеБумагиИзОснований КАК _ЦенныеБумагиИзОснований) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВТорговыхСистемах КАК КодыISIN
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = КодыISIN.ЦеннаяБумага
		|			И (КодыISIN.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВТорговыхСистемах КАК КодыНаММВБ
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = КодыНаММВБ.ЦеннаяБумага
		|			И (КодыНаММВБ.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВТорговыхСистемах КАК КодыНаММВБ_Краткие
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = КодыНаММВБ_Краткие.ЦеннаяБумага
		|			И (КодыНаММВБ_Краткие.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ЛОЖЬ КАК Задолженность
		|ПОМЕСТИТЬ _ДепозитныеВклады
		|ИЗ
		|	_ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода КАК _ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода
		|ГДЕ
		|	_ОстаткиДенежныхСредствНаДепозитныхВкладахПоДатамПериода.СуммаНачальныйОстаток <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ВЫРАЗИТЬ(_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент,
		|	ИСТИНА
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|ГДЕ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Период = &НачалоПериода
		|	И _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты))
		|	И ВЫРАЗИТЬ(_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Актив КАК Актив,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВложенныйЗапрос.ЭмитентНаименование) КАК Наименование
		|ПОМЕСТИТЬ _НаименованияЭмитентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_КодыЦенныхБумаг.ЦеннаяБумага КАК Актив,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|		КОНЕЦ КАК ЭмитентЮрФизЛицо,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование
		|			КОГДА ТИПЗНАЧЕНИЯ(_КодыЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|				ТОГДА ВЫРАЗИТЬ(_КодыЦенныхБумаг.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование
		|		КОНЕЦ КАК ЭмитентНаименование
		|	ИЗ
		|		_КодыЦенныхБумаг КАК _КодыЦенныхБумаг
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ДепозитныеВклады.ДепозитныйВклад,
		|		ВЫРАЗИТЬ(_ДепозитныеВклады.ДепозитныйВклад КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо,
		|		ВЫРАЗИТЬ(_ДепозитныеВклады.ДепозитныйВклад КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.Наименование
		|	ИЗ
		|		_ДепозитныеВклады КАК _ДепозитныеВклады) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ВложенныйЗапрос.ЭмитентЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_НаименованияЭмитентов.Наименование + "", "" + ВЫБОР
		|		КОГДА _КодыЦенныхБумаг.ГосРегНомер <> """"
		|			ТОГДА _КодыЦенныхБумаг.ГосРегНомер
		|		ИНАЧЕ ЕСТЬNULL(_КодыЦенныхБумаг.КодISIN, _КодыЦенныхБумаг.КодНаММВБ)
		|	КОНЕЦ + "", "" + _КодыЦенныхБумаг.ВалютаНоминалаНаименование КАК Наименование,
		|	_НаименованияЭмитентов.Наименование КАК ЭмитентНаименование,
		|	ЕСТЬNULL(_КодыЦенныхБумаг.КраткийКодММВБ, _КодыЦенныхБумаг.КодНаММВБ) КАК КодНаММВБ,
		|	_КодыЦенныхБумаг.КодISIN КАК КодISIN
		|ПОМЕСТИТЬ _НаименованияИКодыЦенныхБумаг
		|ИЗ
		|	_КодыЦенныхБумаг КАК _КодыЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НаименованияЭмитентов КАК _НаименованияЭмитентов
		|		ПО _КодыЦенныхБумаг.ЦеннаяБумага = _НаименованияЭмитентов.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|	УсловияКредитныхИнструментовСрезПоследних.Действует КАК Действует,
		|	УсловияКредитныхИнструментовСрезПоследних.Реинвестировать КАК Реинвестировать,
		|	УсловияКредитныхИнструментовСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладов
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_ДепозитныеВклады.ДепозитныйВклад
		|					ИЗ
		|						_ДепозитныеВклады КАК _ДепозитныеВклады)
		|				И ДатаНачалаДействияУсловий <= &КонецПериода) КАК УсловияКредитныхИнструментовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	_УсловияДепозитныхВкладов.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладов.Процент КАК Процент,
		|	_УсловияДепозитныхВкладов.Действует КАК Действует
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладовАкутальныеНаДатыПериода
		|ИЗ
		|	_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.Период) КАК Период,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|		ИЗ
		|			_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ГДЕ
		|			_УсловияДепозитныхВкладов.Действует
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент) КАК ВложенныйЗапрос
		|		ПО _УсловияДепозитныхВкладов.КредитныйИнструмент = ВложенныйЗапрос.КредитныйИнструмент
		|			И _УсловияДепозитныхВкладов.Период = ВложенныйЗапрос.Период
		|			И _УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий = ВложенныйЗапрос.ДатаНачалаДействияУсловий
		|ГДЕ
		|	(_УсловияДепозитныхВкладов.ДатаПогашения <= &КонецПериода
		|			ИЛИ _УсловияДепозитныхВкладов.Реинвестировать = ЛОЖЬ
		|				И _УсловияДепозитныхВкладов.ПериодичностьВыплатыПроцентов В (ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежемесячно), ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежеквартально)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитныеВклады.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДепозитныеВклады.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_ДепозитныеВклады.Задолженность КАК Задолженность,
		|	ВЫРАЗИТЬ(_ДепозитныеВклады.ДепозитныйВклад.БанковскийСчет КАК Справочник.БанковскиеСчета).Валюта КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения < &КонецПериода
		|			ТОГДА _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения
		|		ИНАЧЕ &КонецПериода
		|	КОНЕЦ КАК ДатаРасчетаПроцентов,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.Процент КАК Процент
		|ПОМЕСТИТЬ _ДепозитныеВкладыСУсловиями
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияДепозитныхВкладовАкутальныеНаДатыПериода КАК _УсловияДепозитныхВкладовАкутальныеНаДатыПериода
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПоступленияДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПоступленияДенежныхСредств.Брокер КАК Брокер
		|ПОМЕСТИТЬ _СчетаДУВОстаткахИОборотах
		|ИЗ
		|	_ПоступленияДенежныхСредств КАК _ПоступленияДенежныхСредств
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ОстаткиИОборотыЦенныхБумаг.СчетДоверительногоУправления,
		|	_ОстаткиИОборотыЦенныхБумаг.Брокер
		|ИЗ
		|	_ОстаткиИОборотыЦенныхБумаг КАК _ОстаткиИОборотыЦенныхБумаг
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|ИЗ
		|	_ЗадолженностьПоДенежнымСредствамОстаткиИОбороты КАК _ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУВОстаткахИОборотах.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА _СчетаДУВОстаткахИОборотах.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоБрокеров
		|ПОМЕСТИТЬ _КоличествоБрокеровВОстатках
		|ИЗ
		|	_СчетаДУВОстаткахИОборотах КАК _СчетаДУВОстаткахИОборотах
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДУВОстаткахИОборотах.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоБрокеровВОстатках.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДУВОстаткахИОборотах.Брокер КАК Брокер
		|ПОМЕСТИТЬ _СчетаИзОстатковСБрокером
		|ИЗ
		|	_КоличествоБрокеровВОстатках КАК _КоличествоБрокеровВОстатках
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДУВОстаткахИОборотах КАК _СчетаДУВОстаткахИОборотах
		|		ПО _КоличествоБрокеровВОстатках.СчетДоверительногоУправления = _СчетаДУВОстаткахИОборотах.СчетДоверительногоУправления
		|ГДЕ
		|	_КоличествоБрокеровВОстатках.КоличествоБрокеров = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоБрокеровВОстатках.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаИзОстатковБезБрокера
		|ИЗ
		|	_КоличествоБрокеровВОстатках КАК _КоличествоБрокеровВОстатках
		|ГДЕ
		|	_КоличествоБрокеровВОстатках.КоличествоБрокеров <> 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _ВсеКодыУБрокеров
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУВОстаткахИОборотах.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУВОстаткахИОборотах КАК _СчетаДУВОстаткахИОборотах)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&НачалоПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &НачалоПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокеров
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) КАК КоличествоКодов
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) = 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыБрокеровСМаксимальнымПериодом
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ВсеКодыУБрокеров.Период) КАК Период
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ВсеКодыУБрокеров.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаИзОстатковСБрокером.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаИзОстатковСБрокером.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_СчетаИзОстатковСБрокером.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыУБрокеров
		|ИЗ
		|	_СчетаИзОстатковСБрокером КАК _СчетаИзОстатковСБрокером
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО _СчетаИзОстатковСБрокером.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И _СчетаИзОстатковСБрокером.Брокер = _ВсеКодыУБрокеров.Брокер
		|ГДЕ
		|	_СчетаИзОстатковСБрокером.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СчетаИзОстатковБезБрокера.СчетДоверительногоУправления,
		|	_СчетаИзОстатковБезБрокера.СчетДоверительногоУправления.КодСчета,
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Брокер, _КодыБрокеровСМаксимальнымПериодом.Брокер),
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Код, _КодыБрокеровСМаксимальнымПериодом.Код)
		|ИЗ
		|	_СчетаИзОстатковБезБрокера КАК _СчетаИзОстатковБезБрокера
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокеров КАК _ЕдиничныеКодыУБрокеров
		|		ПО _СчетаИзОстатковБезБрокера.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыБрокеровСМаксимальнымПериодом КАК _КодыБрокеровСМаксимальнымПериодом
		|		ПО _СчетаИзОстатковБезБрокера.СчетДоверительногоУправления = _КодыБрокеровСМаксимальнымПериодом.СчетДоверительногоУправления";
	
	#КонецОбласти
	
	Запрос.Выполнить();
	
	ВыборкаДепозитов = МВТ.Таблицы["_ДепозитныеВкладыСУсловиями"].ПолучитьДанные().Выбрать();

	ТаблицаПроцентовПоДепозитам = Новый ТаблицаЗначений;
	
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("КредитныйИнструмент", Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады, СправочникСсылка.Займы"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Проценты", Новый ОписаниеТипов("Число"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("ДатаДенежногоПотока", Новый ОписаниеТипов("Дата"));
	
	Пока ВыборкаДепозитов.Следующий() Цикл
		
		Попытка
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РаботаСКредитнымиИнструментами.ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(ВыборкаДепозитов.СчетДоверительногоУправления, ВыборкаДепозитов.ДатаРасчетаПроцентов,,,,,ВыборкаДепозитов.ДепозитныйВклад), ТаблицаПроцентовПоДепозитам);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(ВыборкаДепозитов.ПериодичностьВыплатыПроцентов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях депозита [" + ВыборкаДепозитов.ДепозитныйВклад + "] не указана периодичность выплаты процентов.");
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТаблицаПроцентовПоДепозитам", ТаблицаПроцентовПоДепозитам);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПроцентовПоДепозитам.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ТаблицаПроцентовПоДепозитам.Проценты КАК Проценты,
		|	ТаблицаПроцентовПоДепозитам.Операция КАК Операция,
		|	ТаблицаПроцентовПоДепозитам.ДатаДенежногоПотока КАК ДатаДенежногоПотока
		|ПОМЕСТИТЬ _ПроцентыПоДепозитнымВкладам
		|ИЗ
		|	&ТаблицаПроцентовПоДепозитам КАК ТаблицаПроцентовПоДепозитам";
	
	Запрос.Выполнить();
	
	// Выполняем програмную компоновку
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,,, Новый Структура("МенеджерВременныхТаблиц, РегистрацияСтатистики", МВТ, Ложь));
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
		
КонецПроцедуры // ПриКомпоновкеРезультата

Функция ПолучитьМинимальнуюДатуФиксации(МВТ, ВариантОтчета)
	
	МинимальнаяДатаФиксации = Период.ДатаОкончания; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ; 
	Запрос.УстановитьПараметр("НачалоПериода",		Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 		Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПечатьЗаявлений",	ВариантОтчета = "ПодачаЗаявленийНаОферту");
	Запрос.УстановитьПараметр("Облигация",			ЭтотОбъект.Облигация);
	
	Если ВариантОтчета = "ОплатыПоПогашениям" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ДанныеКалендаря.Дата), ДЕНЬ, 1) КАК Дата
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
		|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата < &НачалоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Период.ДатаНачала <> ВыборкаДетальныеЗаписи.Дата Тогда
				Запрос.УстановитьПараметр("НачалоПериода",	ВыборкаДетальныеЗаписи.Дата);
				Период.ДатаНачала =  ВыборкаДетальныеЗаписи.Дата;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Так как отчет формируется после выходного дня, то на случай если БЭК еще не ввел данные Т- за период с %1, то отчет сформирован с учетом этого периода.", Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy")));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	#Область Текст_запроса
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДивидендыПоАкциям.Акция КАК ЦеннаяБумага,
		|	ДивидендыПоАкциям.Акция.ВалютаНоминала КАК ВалютаНоминала,
		|	СУММА(ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию) КАК Цена,
		|	ДивидендыПоАкциям.ДатаФиксации КАК ДатаФиксации,
		|	ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов КАК ДатаВыплатыПлан,
		|	СУММА(ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию * 0.13 * ВЫБОР
		|			КОГДА ДивидендыПоАкциям.Д1 > 0
		|				ТОГДА 1 / ДивидендыПоАкциям.Д1 * (ДивидендыПоАкциям.Д1 - ДивидендыПоАкциям.Д2)
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК СуммаНалога
		|ПОМЕСТИТЬ _ДивидендыПоАкциям
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДивидендыПоАкциямСрезПоследних.Акция КАК Акция,
		|		ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов КАК ИдСобытия,
		|		ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов КАК ПлановаяДатаОплатыДивидендов,
		|		ДивидендыПоАкциямСрезПоследних.ДатаФиксации КАК ДатаФиксации,
		|		ДивидендыПоАкциямСрезПоследних.Период КАК Период
		|	ИЗ
		|		РегистрСведений.ДивидендыПоАкциям.СрезПоследних(&КонецПериода, ) КАК ДивидендыПоАкциямСрезПоследних) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДивидендыПоАкциям КАК ДивидендыПоАкциям
		|		ПО ВложенныйЗапрос.Акция = ДивидендыПоАкциям.Акция
		|			И ВложенныйЗапрос.ИдСобытия = ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов
		|			И ВложенныйЗапрос.ПлановаяДатаОплатыДивидендов = ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов
		|			И ВложенныйЗапрос.ДатаФиксации = ДивидендыПоАкциям.ДатаФиксации
		|			И ВложенныйЗапрос.Период = ДивидендыПоАкциям.Период
		|ГДЕ
		|	НЕ &ПечатьЗаявлений
		|
		|СГРУППИРОВАТЬ ПО
		|	ДивидендыПоАкциям.Акция,
		|	ДивидендыПоАкциям.Валюта,
		|	ДивидендыПоАкциям.ДатаФиксации,
		|	ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов,
		|	ДивидендыПоАкциям.Акция.ВалютаНоминала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Купон"" КАК ВидВыплаты,
		|	КупонныйДоходПоОблигациям.Облигация КАК ЦеннаяБумага,
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаПогашения,
		|	КупонныйДоходПоОблигациям.Облигация.ВалютаНоминала КАК ВалютаНоминала,
		|	КупонныйДоходПоОблигациям.СуммаКупона КАК Цена,
		|	0 КАК СуммаНоминала,
		|	КупонныйДоходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	КупонныйДоходПоОблигациям.ДатаВыплатыПлан КАК ДатаВыплатыПлан,
		|	ВЫБОР
		|		КОГДА КупонныйДоходПоОблигациям.ДатаФиксации = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КупонныйДоходПоОблигациям.ДатаФиксации > &КонецПериода
		|			ТОГДА КупонныйДоходПоОблигациям.ДатаОкончанияКупона
		|		ИНАЧЕ КупонныйДоходПоОблигациям.ДатаФиксации
		|	КОНЕЦ КАК ДатаФиксацииОстатков,
		|	NULL КАК ДосрочноеПогашение,
		|	NULL КАК ТипОферты,
		|	NULL КАК АкцептС,
		|	NULL КАК АкцептПо,
		|	NULL КАК ТолькоДляФизическихЛиц,
		|	NULL КАК СуммаНалога
		|ПОМЕСТИТЬ _КупоныОфертыНоминалыДивидендыВекселя
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона МЕЖДУ &НачалоПериода И &КонецПериода
		|	И КупонныйДоходПоОблигациям.ДатаФиксации <= &КонецПериода
		|	И НЕ &ПечатьЗаявлений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Оферта"",
		|	УсловияОферт.Облигация,
		|	УсловияОферт.ДатаВыкупа,
		|	УсловияОферт.Облигация.ВалютаНоминала,
		|	УсловияОферт.Цена,
		|	0,
		|	NULL,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ВЫБОР
		|		КОГДА УсловияОферт.АкцептПо <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА УсловияОферт.АкцептПо
		|		ИНАЧЕ УсловияОферт.ДатаВыкупа
		|	КОНЕЦ,
		|	УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно),
		|	УсловияОферт.ТипОферты,
		|	УсловияОферт.АкцептС,
		|	УсловияОферт.АкцептПо,
		|	УсловияОферт.ТолькоДляФизическихЛиц,
		|	NULL
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.ДатаВыкупа МЕЖДУ &НачалоПериода И &КонецПериода
		|	И УсловияОферт.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))
		|	И ВЫБОР
		|			КОГДА &ПечатьЗаявлений
		|				ТОГДА УсловияОферт.Облигация = &Облигация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Номинал"",
		|	ВложенныВопрос.Облигация,
		|	ВложенныВопрос.ДатаПогашения,
		|	ВложенныВопрос.Облигация.ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА ВложенныВопрос.Облигация.ИндексируемыйНоминал
		|				И НоминалыЦенныхБумаг.Номинал < ВложенныВопрос.Облигация.Номинал
		|			ТОГДА ВложенныВопрос.Облигация.Номинал
		|		ИНАЧЕ НоминалыЦенныхБумаг.Номинал
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВложенныВопрос.Облигация.ИндексируемыйНоминал
		|				И НоминалыЦенныхБумаг.Номинал < ВложенныВопрос.Облигация.Номинал
		|			ТОГДА ВложенныВопрос.Облигация.Номинал
		|		ИНАЧЕ НоминалыЦенныхБумаг.Номинал
		|	КОНЕЦ,
		|	ВложенныВопрос.ДатаФиксацииДляПогашения,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ВЫБОР
		|		КОГДА ВложенныВопрос.ДатаФиксацииДляПогашения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВложенныВопрос.ДатаФиксацииДляПогашения
		|		ИНАЧЕ ВложенныВопрос.ДатаПогашения
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	(ВЫБРАТЬ
		|		Облигации.Ссылка КАК Облигация,
		|		Облигации.ДатаПогашения КАК ДатаПогашения,
		|		Облигации.ДатаФиксацииДляПогашения КАК ДатаФиксацииДляПогашения,
		|		МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|	ИЗ
		|		Справочник.Облигации КАК Облигации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО Облигации.Ссылка = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И (Облигации.ДатаПогашения МЕЖДУ &НачалоПериода И &КонецПериода)
		|				И Облигации.ДатаПогашения >= НоминалыЦенныхБумаг.Период
		|				И (НЕ Облигации.Бессрочная)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Облигации.Ссылка,
		|		Облигации.ДатаПогашения,
		|		Облигации.ДатаФиксацииДляПогашения) КАК ВложенныВопрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО ВложенныВопрос.Облигация = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И ВложенныВопрос.Период = НоминалыЦенныхБумаг.Период
		|ГДЕ
		|	НЕ &ПечатьЗаявлений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Номинал"",
		|	НоминалыЦенныхБумаг.ЦеннаяБумага,
		|	НоминалыЦенныхБумаг.Период,
		|	НоминалыЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала,
		|	НоминалыЦенныхБумаг.СуммаИзменения,
		|	НоминалыЦенныхБумаг.СуммаИзменения + НоминалыЦенныхБумаг.Номинал,
		|	НоминалыЦенныхБумаг.ДатаФиксации,
		|	НоминалыЦенныхБумаг.ДатаВыплатыПлан,
		|	ВЫБОР
		|		КОГДА НоминалыЦенныхБумаг.ДатаФиксации <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НоминалыЦенныхБумаг.ДатаФиксации
		|		ИНАЧЕ НоминалыЦенныхБумаг.Период
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НоминалыЦенныхБумаг.ЦеннаяБумага.Амортизационная
		|	И НЕ &ПечатьЗаявлений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Дивиденды"",
		|	_ДивидендыПоАкциям.ЦеннаяБумага,
		|	NULL,
		|	_ДивидендыПоАкциям.ВалютаНоминала,
		|	_ДивидендыПоАкциям.Цена,
		|	0,
		|	_ДивидендыПоАкциям.ДатаФиксации,
		|	_ДивидендыПоАкциям.ДатаВыплатыПлан,
		|	_ДивидендыПоАкциям.ДатаФиксации,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	_ДивидендыПоАкциям.СуммаНалога
		|ИЗ
		|	_ДивидендыПоАкциям КАК _ДивидендыПоАкциям
		|ГДЕ
		|	_ДивидендыПоАкциям.ДатаФиксации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ &ПечатьЗаявлений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Вексель"",
		|	Векселя.Ссылка,
		|	Векселя.ДатаПогашения,
		|	Векселя.ВалютаНоминала,
		|	0,
		|	Векселя.Номинал,
		|	NULL,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	Векселя.ДатаПогашения,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.Векселя КАК Векселя
		|ГДЕ
		|	Векселя.ДатаПогашения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ &ПечатьЗаявлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _АмортизационныеОблигацииСИндексируемымНоминалом
		|ИЗ
		|	_КупоныОфертыНоминалыДивидендыВекселя КАК _КупоныОфертыНоминалыДивидендыВекселя
		|ГДЕ
		|	_КупоныОфертыНоминалыДивидендыВекселя.ВидВыплаты = ""Номинал""
		|	И ВЫРАЗИТЬ(_КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага КАК Справочник.Облигации).Амортизационная
		|	И ВЫРАЗИТЬ(_КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага КАК Справочник.Облигации).ИндексируемыйНоминал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КупоныОфертыНоминалыДивидендыВекселя.ВидВыплаты КАК ВидВыплаты,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ДатаПогашения КАК ДатаПогашения,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ВалютаНоминала КАК ВалютаНоминала,
		|	_КупоныОфертыНоминалыДивидендыВекселя.Цена КАК Цена,
		|	_КупоныОфертыНоминалыДивидендыВекселя.СуммаНоминала КАК СуммаНоминала,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ДатаФиксации КАК ДатаФиксации,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ДатаВыплатыПлан КАК ДатаВыплатыПлан,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ДатаФиксацииОстатков КАК ДатаФиксацииОстатков,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ДосрочноеПогашение КАК ДосрочноеПогашение,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ТипОферты КАК ТипОферты,
		|	_КупоныОфертыНоминалыДивидендыВекселя.АкцептС КАК АкцептС,
		|	_КупоныОфертыНоминалыДивидендыВекселя.АкцептПо КАК АкцептПо,
		|	_КупоныОфертыНоминалыДивидендыВекселя.ТолькоДляФизическихЛиц КАК ТолькоДляФизическихЛиц,
		|	_КупоныОфертыНоминалыДивидендыВекселя.СуммаНалога КАК СуммаНалога,
		|	ВЫБОР
		|		КОГДА КурсыВалют.Курс ЕСТЬ NULL
		|			ТОГДА КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
		|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
		|	КОНЕЦ КАК Курс
		|ПОМЕСТИТЬ _ВыплатыЗаПериод
		|ИЗ
		|	_КупоныОфертыНоминалыДивидендыВекселя КАК _КупоныОфертыНоминалыДивидендыВекселя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК ОфертыДосрочногоПогашения
		|		ПО (_КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага ССЫЛКА Справочник.Облигации)
		|			И _КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага = ОфертыДосрочногоПогашения.Облигация
		|			И _КупоныОфертыНоминалыДивидендыВекселя.ДатаПогашения > ОфертыДосрочногоПогашения.ДатаВыкупа
		|			И (ОфертыДосрочногоПогашения.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО _КупоныОфертыНоминалыДивидендыВекселя.ВалютаНоминала = КурсыВалют.Валюта
		|			И (_КупоныОфертыНоминалыДивидендыВекселя.ДатаВыплатыПлан = ДАТАВРЕМЯ(1, 1, 1)
		|					И _КупоныОфертыНоминалыДивидендыВекселя.ДатаПогашения = КурсыВалют.Период
		|				ИЛИ _КупоныОфертыНоминалыДивидендыВекселя.ДатаВыплатыПлан = КурсыВалют.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|		ПО _КупоныОфертыНоминалыДивидендыВекселя.ВалютаНоминала = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АмортизационныеОблигацииСИндексируемымНоминалом КАК _АмортизационныеОблигацииСИндексируемымНоминалом
		|		ПО _КупоныОфертыНоминалыДивидендыВекселя.ЦеннаяБумага = _АмортизационныеОблигацииСИндексируемымНоминалом.ЦеннаяБумага
		|ГДЕ
		|	ОфертыДосрочногоПогашения.Облигация ЕСТЬ NULL
		|	И _АмортизационныеОблигацииСИндексируемымНоминалом.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_ВыплатыЗаПериод.ДатаФиксацииОстатков) КАК МинимальнаяДатаФиксации
		|ИЗ
		|	_ВыплатыЗаПериод КАК _ВыплатыЗаПериод";
	
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.МинимальнаяДатаФиксации) Тогда
			МинимальнаяДатаФиксации = Выборка.МинимальнаяДатаФиксации;
		КонецЕсли;
		
	КонецЦикла;
	
	ОшибкиНоминала = МВТ.Таблицы["_АмортизационныеОблигацииСИндексируемымНоминалом"].ПолучитьДанные().Выбрать();
	
	Пока ОшибкиНоминала.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для амортизационных облигаций с индексируемым номиналом не определен расчет выплаты. Облигация [" + ОшибкиНоминала.ЦеннаяБумага + "]");
		
	КонецЦикла;
	
	Возврат МинимальнаяДатаФиксации;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);	
	
	ТекстСообщения = "";
	Если ВариантОтчета <> "ПодачаЗаявленийНаОферту" Тогда
		
		Если ПроверяемыеРеквизиты.Найти("Облигация") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Облигация"));
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ЭтотОбъект.Период.ДатаНачала = '00010101' Или ЭтотОбъект.Период.ДатаОкончания = '00010101' Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(ВариантОтчета = "ПодачаЗаявленийНаОферту", "Не заполнена дата оферты",  "Неверно указан период отчета"),,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

