
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоОтличия = Истина;
	ЭтаФорма.АдресТаблицыСравнения = Параметры.АдресТаблицыСравнения;
	ЭтаФорма.ТаблицаСравнения.Загрузить(ПолучитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыСравнения));
	
	УстановитьОтборСтрок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ПоместитьИмпортируемыеДанныеВХранилище();
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(ЭтаФорма)
	Если ЭтаФорма.ТолькоОтличия Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЕстьОтличия", Истина));
	Иначе
		ОтборСтрок = Неопределено;
	КонецЕсли; 
	ЭтаФорма.Элементы.ТаблицаСравнения.ОтборСтрок = ОтборСтрок;
КонецПроцедуры
 
&НаКлиенте
Процедура ТолькоОтличияПриИзменении(Элемент)
	УстановитьОтборСтрок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПоместитьИмпортируемыеДанныеВХранилище()

	ТаблицаНаСервере = ЭтаФорма.ТаблицаСравнения.Выгрузить();
	ИмпортируемыеДанные = ТаблицаНаСервере.СкопироватьКолонки("id,name,INN,OGRN,date_from,date_basement,comment,relation,Действие");
	
	Для каждого Строка Из ТаблицаНаСервере Цикл
	
		Если Строка.Действие <> "Оставить без изменений" Тогда
		
			ЗаполнитьЗначенияСвойств(ИмпортируемыеДанные.Добавить(), Строка);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	ПоместитьВоВременноеХранилище(ИмпортируемыеДанные, ЭтаФорма.АдресТаблицыСравнения);

КонецПроцедуры
