
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(ЭтаФорма.КодыСекторовЭкономики.Отбор, "ВнешняяСистема",, ВидСравненияКомпоновкиДанных.Равно, Справочники.ВнешниеСистемы.ЦБРФ,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(ЭтаФорма.КодыСекторовЭкономики.Отбор, "ГруппаОбъектов",, ВидСравненияКомпоновкиДанных.Равно, Справочники.ГруппыИмпортируемыхОбъектов.СектораЭкономики,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры
