
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьСписокИсточников();
	ЗаполнитьСписокФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИсточников()
	
	Элементы.Источник.СписокВыбора.Очистить();	
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Значение"		, Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Представление", Новый ОписаниеТипов("Строка"));
	
	ТекстЗапроса = 
		"SELECT 
		|	[Id] AS Значение,
		|	[Source_Name] AS Представление
		|FROM 
		|	[Externals].[dbo].[Data_Sources]";

	РезультатЗапроса = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если РезультатЗапроса <> Неопределено Тогда
		Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
			Элементы.Источник.СписокВыбора.Добавить(СтрокаРезультата.Значение, Строка(СтрокаРезультата.Значение) + ". " + СтрокаРезультата.Представление);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокФайлов()
	
	Если Не ЗначениеЗаполнено(Объект.Источник) Тогда
		Объект.ТаблицаФайлов.Очистить();
		Возврат;
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("Идентификатор", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("ИмяФайла"		, Новый ОписаниеТипов("Строка"));
	ТипыКолонок.Вставить("ВремяЗагрузки", Новый ОписаниеТипов("Дата"));
	ТипыКолонок.Вставить("РазмерФайла"	, Новый ОписаниеТипов("Число"));
	
	ТекстЗапроса = 
		"SELECT 
		|	[Id] AS Идентификатор,
		|	[File_Name] AS ИмяФайла,
		|	[Upload_Time] AS ВремяЗагрузки,
		|	DATALENGTH([File_Data]) / 1024 AS РазмерФайла
		|FROM 
		|	[Externals].[dbo].[Files]
		|Where
		|	Source_Id = &Source_Id
		|	AND ([Organization] = '&Organization' OR [Organization] IS NULL)
		|Order by
		|	[Id]";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Source_Id"	, Объект.Источник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Organization", Строка(Объект.Организация.УникальныйИдентификатор()));
	
	РезультатЗапроса = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок);
	
	Если РезультатЗапроса <> Неопределено Тогда
		Объект.ТаблицаФайлов.Загрузить(РезультатЗапроса);
	Иначе
		Объект.ТаблицаФайлов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	Объект.ТаблицаФайлов.Очистить();	
	
	Если ЗначениеЗаполнено(Объект.Источник) Тогда
		ЗаполнитьСписокФайлов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ТаблицаФайловВыбор");
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	// Получаем имя файла
	
	ИмяФайла = ТекущиеДанные.ИмяФайла;
	
	Если Найти(ИмяФайла, "/") > 0 Тогда
		ЧастиИмениФайла = СтрРазделить(ИмяФайла, "/");
		ИмяФайла = ЧастиИмениФайла[ЧастиИмениФайла.Количество() - 1];
	КонецЕсли;
	
	ИмяФайла = РаботаСФайламиКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
	
	ИмяВременногоФайла = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + ИмяФайла;
	
	// Получаем данные и сохраняем в каталоге временных файлов
	
	ДвоичныеДанные = ПолучитьДанныеФайла(ТекущиеДанные.Идентификатор);
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		Попытка
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			ЗапуститьПриложение(ИмяВременногоФайла);
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось открыть файл %1, возможно он уже открыт", ИмяВременногоФайла);
			ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	Иначе
		ВызватьИсключение "Ошибка получения файла из Externals";
	КонецЕсли;
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Идентификатор)
	
	Возврат РаботаСВнешнимиСистемами.ПолучитьФайлИзExternals(Идентификатор);
	
КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	
	// Обновляем источники	
	
	ЗаполнитьСписокИсточников();
	
	Если Элементы.Источник.СписокВыбора.НайтиПоЗначению(Объект.Источник) = Неопределено Тогда
		Объект.Источник = Неопределено;
	КонецЕсли;
	
	// Обновляем файлы
	
	ЗаполнитьСписокФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	ВыполнитьОбновление();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновление()

	ТекущийИсточник		= Объект.Источник;
	ТекущийФайл			= Элементы.ТаблицаФайлов.ТекущиеДанные;
	ИдентификаторФайла	= ?(ТекущийФайл = Неопределено, Неопределено, ТекущийФайл.Идентификатор);
	
	ОбновитьНаСервере();
	
	Если Объект.Источник = ТекущийИсточник И ЗначениеЗаполнено(ИдентификаторФайла) Тогда
		СтрокиФайлов = Объект.ТаблицаФайлов.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторФайла));
		Если СтрокиФайлов.Количество() > 0 Тогда
			Элементы.ТаблицаФайлов.ТекущаяСтрока = СтрокиФайлов[0].ПолучитьИдентификатор();		
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(
		РеквизитФормыВЗначение("Объект"), ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти

СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСExternals();