
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если ПараметрКоманды.Количество() = 1 Тогда
		ПараметрыФормы = Новый Структура("ЮрФизЛицо", ПараметрКоманды[0]);
	Иначе
		СписокЮрФизЛиц = Новый СписокЗначений;
		СписокЮрФизЛиц.ЗагрузитьЗначения(ПараметрКоманды);
		ПараметрыФормы = Новый Структура("СписокЮрФизЛиц", СписокЮрФизЛиц);
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.ПечатьАнкетныхДанных.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
