
Функция УказанаЛицензияНаДатуЗаключенияДоговора(Отказ)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", 		ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаЗаключения", ЭтотОбъект.ДатаЗаключения);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
		|			&ДатаЗаключения,
		|			СчетДоверительногоУправления = &Ссылка
		|				И Организация = &Организация) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует";	
	
	Если Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("По счёту внутр. учёта '%1' не заданы условия ДУ на дату заключения договора %2", 
				ЭтотОбъект.Ссылка, 
				Формат(ЭтотОбъект.ДатаЗаключения, "ДФ=dd.MM.yyyy")), ЭтотОбъект,,, Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Организация") И ДанныеЗаполнения.Свойство("ВидДоговораДоверительногоУправления") Тогда
			ЭтотОбъект.КодСчета = Справочники.СчетаДоверительногоУправления.ОпределитьНовыйКодСчета(ДанныеЗаполнения.Организация, ДанныеЗаполнения.ВидДоговораДоверительногоУправления, ЭтотОбъект.КодСчета);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Стратегия Тогда
		ПроверяемыеРеквизиты.Добавить("Родитель");
	КонецЕсли;
	
	// Для ПН и ПР нужно проверить реквизит ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами
	Если ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями
		Или ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами");
	КонецЕсли;
	
	ИсключаемыеВидыДоговоровДоверительногоУправления = Новый Массив;
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица);
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.Собственный);
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов);
	ИсключаемыеВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов);
	
	РеквизитСпециализированныйДепозитарий = ПроверяемыеРеквизиты.Найти("СпециализированныйДепозитарий");
	
	Если РеквизитСпециализированныйДепозитарий <> Неопределено
		И (Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК")
			ИЛИ ИсключаемыеВидыДоговоровДоверительногоУправления.Найти(ВидДоговораДоверительногоУправления) <> Неопределено
			ИЛИ ЗначениеЗаполнено(ДатаРасторжения)
				И ДатаРасторжения < ТекущаяДатаСеанса()) Тогда
		ПроверяемыеРеквизиты.Удалить(РеквизитСпециализированныйДепозитарий);
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	РаботаСоСправочниками.ПередЗаписью(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		
		// Зафиксируем создание нового объекта для последующей корректировки доступа к счетам д/у
		Если РаботаСПользователями.ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления() Тогда
			ДополнительныеСвойства.Вставить("СозданНовыйСчет", ЭтоНовый());
		КонецЕсли;
		
	Иначе
		
		ПредЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "Организация, ВидДоговораДоверительногоУправления");
		
		ОрганизацияИзменена	= Организация <> ПредЗначенияРеквизитов.Организация;
		ВидДоговораИзменен	= ВидДоговораДоверительногоУправления <> ПредЗначенияРеквизитов.ВидДоговораДоверительногоУправления;
		
		// изменять организацию или вид договора можно только тогда, когда на объект нет ссылок
		Если ОрганизацияИзменена Или ВидДоговораИзменен Тогда
			
			МассивИскомыхСсылок = Новый Массив;
			МассивИскомыхСсылок.Добавить(ЭтотОбъект.Ссылка);
			
			МассивИсключаемыхОбъектовМетаданных = Новый Массив;
			МассивИсключаемыхОбъектовМетаданных.Добавить(Метаданные.РегистрыСведений.ДоступныеСчетаДоверительногоУправления.Измерения.СчетДоверительногоУправления);
			
			Если НайтиПоСсылкам(МассивИскомыхСсылок,,, МассивИсключаемыхОбъектовМетаданных).Количество() > 0 Тогда
				
				Если ОрганизацияИзменена Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено менять организацию счета доверительного управления, если на него есть ссылки!",, "Объект.Организация",, Отказ);
				КонецЕсли;
				
				Если ВидДоговораИзменен Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено менять вид договора счета доверительного управления, если на него есть ссылки!",, "Объект.ВидДоговораДоверительногоУправления",, Отказ);
				КонецЕсли;
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Зафиксируем смену организации для последующей корректировки доступа к счетам д/у
		Если ОрганизацияИзменена Тогда
			ДополнительныеСвойства.Вставить("ИзмененаОрганизация", Истина);
			ДополнительныеСвойства.Вставить("СтараяОрганизация", ПредЗначенияРеквизитов.Организация);
			
		// Зафиксируем смену вида договора для последующей корректировки доступа к счетам д/у
		ИначеЕсли ВидДоговораИзменен
			И РаботаСПользователями.ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления()
		Тогда
			ДополнительныеСвойства.Вставить("ИзмененВидДоговора", Истина);
		КонецЕсли;		
		
	КонецЕсли;
	
	
	// выделим номер счета д/у из кода счета
	Если ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Договор
			И ЭтотОбъект.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный
			И Не ЗначениеЗаполнено(ЭтотОбъект.НомерСчета)
	Тогда
		ЭтотОбъект.НомерСчета = Число(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(ЭтотОбъект.КодСчета));
	КонецЕсли;
	
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		// проверим уникальность кода и номера счета д/у (собтсвенные счета д/у и стратегии д/у нам пока не интересны)
		Если ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Договор
				И ЭтотОбъект.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный
		Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	""КодСчета"" КАК ИмяПоля,
				|	""Код счета"" КАК СинонимПоля,
				|	СчетаДоверительногоУправления.КодСчета КАК ЗначениеПоля,
				|	СчетаДоверительногоУправления.Ссылка
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.Ссылка <> &Ссылка
				|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
				|	И СчетаДоверительногоУправления.КодСчета = &КодСчета
				|	И СчетаДоверительногоУправления.Организация = &Организация
				|	И СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДоверительногоУправления.Договор)
				|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	""НомерСчета"" КАК ИмяПоля,
				|	""Номер счета"" КАК СинонимПоля,
				|	СчетаДоверительногоУправления.НомерСчета КАК ЗначениеПоля,
				|	СчетаДоверительногоУправления.Ссылка
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.Ссылка <> &Ссылка
				|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
				|	И СчетаДоверительногоУправления.НомерСчета = &НомерСчета
				|	И СчетаДоверительногоУправления.Организация = &Организация
				|	И СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДоверительногоУправления.Договор)
				|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
				|	И &ОтборПоВидуДоговораДоверительногоУправления";
				
			Запрос.УстановитьПараметр("Ссылка",      ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("КодСчета",    ЭтотОбъект.КодСчета);
			Запрос.УстановитьПараметр("НомерСчета",  ЭтотОбъект.НомерСчета);
			Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления",  ЭтотОбъект.ВидДоговораДоверительногоУправления);
			
		    УсловиеПоВидуДоговораДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПолучитьУсловиеЗапросаПоВидуДоговораДоверительногоУправления(
				ЭтотОбъект.Организация, 
				ЭтотОбъект.ВидДоговораДоверительногоУправления);
				
	    	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуДоговораДоверительногоУправления", УсловиеПоВидуДоговораДоверительногоУправления);
			
			ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
			
			Для каждого РезультатЗапроса Из ПакетРезультатовЗапроса Цикл
				Если Не РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.СинонимПоля + " '" + Выборка.ЗначениеПоля + "' не уникален. Он также встречается в счете д/у '" + Выборка.Ссылка + "'", ЭтотОбъект, "КодСчета",, Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// проверим уникальность договора
		Если ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Договор
				И ЭтотОбъект.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.Собственный
				И ЭтотОбъект.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
				И ЭтотОбъект.НомерДоговора <> "090117-1/DU/FL" // это Фаллико, у которого заведены два счета д/у с одним договором
		Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.НомерДоговора = &НомерДоговора
				|	И СчетаДоверительногоУправления.ДатаЗаключения = &ДатаЗаключения
				|	И СчетаДоверительногоУправления.Организация = &Организация
				|	И СчетаДоверительногоУправления.Ссылка <> &Ссылка
				|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
				|	И СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДоверительногоУправления.Договор)";
				
			Запрос.УстановитьПараметр("Ссылка",         ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("НомерДоговора",  ЭтотОбъект.НомерДоговора);
			Запрос.УстановитьПараметр("ДатаЗаключения", ЭтотОбъект.ДатаЗаключения);
			Запрос.УстановитьПараметр("Организация",    ЭтотОбъект.Организация);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор № " + ЭтотОбъект.НомерДоговора + " от " + ЭтотОбъект.ДатаЗаключения + " не уникален. Он также встречается в счете д/у '" + Выборка.Ссылка + "'", ЭтотОбъект, "НомерДоговора",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// проверим, что расчетные счета в соответствующей табличной части уникальны
		НеУникальныеРасчетныеСчета = РаботаСКоллекциями.ТаблицаЗначений_НайтиНеУникальныеЗначения(ЭтотОбъект.РасчетныеСчета.Выгрузить(, "РасчетныйСчет"), "РасчетныйСчет");
		
		Для Каждого НеУникальныйРасчетныйСчет Из НеУникальныеРасчетныеСчета Цикл
			// найдем № строки второго вхождения
			СтрокиОтрасли    = ЭтотОбъект.РасчетныеСчета.НайтиСтроки(Новый Структура("РасчетныйСчет", НеУникальныйРасчетныйСчет.Ключ));
			НомерСтрокиДубля = ЭтотОбъект.РасчетныеСчета.Индекс(СтрокиОтрасли[1]);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет '" + НеУникальныйРасчетныйСчет.Ключ + "' встречается более одного раза", ЭтотОбъект, "РасчетныеСчета[" + НомерСтрокиДубля + "].РасчетныйСчет",, Отказ);
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
#Область Настройки_доступа_к_счетам_доверительного_управления

	// Был добавлен новый элемент справочника.
	Если ДополнительныеСвойства.Свойство("СозданНовыйСчет") И ДополнительныеСвойства.СозданНовыйСчет Тогда
		
		Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ДобавитьДанныеОДоступностиСчетовДоверительногоУправления(Организация, Ссылка) Тогда
			ТекстСообщения = СтрШаблон("Не удалось записать счет доверительного управления из-за ошибки при установке доступности счетов доверительного управления по организации '%1'!", Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	// Изменили организацию.
	ИначеЕсли ДополнительныеСвойства.Свойство("ИзмененаОрганизация") И ДополнительныеСвойства.ИзмененаОрганизация Тогда
		
		// Удаляем записи по ключу Организация + Счет ДУ.
		Если РаботаСПользователями.ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления(ДополнительныеСвойства.СтараяОрганизация) Тогда
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.УдалитьДанныеОДоступностиСчетовДоверительногоУправления(ДополнительныеСвойства.СтараяОрганизация, Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать счет доверительного управления из-за ошибки при отключении доступности счетов доверительного управления по организации '%1'!", ДополнительныеСвойства.СтараяОрганизация);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Устанавливаем доступность счета ДУ для новой организации.
		Если РаботаСПользователями.ПоОрганизацииВключенКонтрольДоступаКСчетамДоверительногоУправления() Тогда
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ДобавитьДанныеОДоступностиСчетовДоверительногоУправления(Организация, Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать счет доверительного управления из-за ошибки при отключении доступности счетов доверительного управления по организации '%1'!", Организация);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	// Изменили вид договора.
	ИначеЕсли ДополнительныеСвойства.Свойство("ИзмененВидДоговора") И ДополнительныеСвойства.ИзмененВидДоговора Тогда
		
		Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ОбновитьДанныеОДоступностиСчетовДоверительногоУправленияПоОрганизации(Организация) Тогда
			ТекстСообщения = СтрШаблон("Не удалось записать счет доверительного управления из-за ошибки при обновлении доступности счетов доверительного управления по организации '%1'!", Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
#КонецОбласти
	
	Если Не Отказ Тогда
		
		// вся работа с клиентами происходит в ПриЗаписи после того как доступ к счетам д/у уже
		// установлен, чтобы получение разрешенных данных происходила в штатном режиме
		
		Если ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Стратегия Тогда
			
			// клиенты д/у для стратегий копируются из владельца - счета д/у;
			// т.к. происходит это явление раз в год по обещанию, то пишем всегда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КлиентыДоверительногоУправления.Период,
				|	КлиентыДоверительногоУправления.Клиент
				|ИЗ
				|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
				|ГДЕ
				|	КлиентыДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления";
				
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.Родитель);
				
			Выборка = Запрос.Выполнить().Выбрать();
			
			НаборЗаписей = РегистрыСведений.КлиентыДоверительногоУправления.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СчетДоверительногоУправления.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			
			НаборЗаписей.Очистить();
			
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.Период                       = Выборка.Период;
				Запись.СчетДоверительногоУправления = ЭтотОбъект.Ссылка;
				Запись.Клиент                       = Выборка.Клиент;
			КонецЦикла;
			
			НаборЗаписей.Записать();
				
		ИначеЕсли ЭтотОбъект.ВидСчетаДоверительногоУправления = Перечисления.ВидыСчетовДоверительногоУправления.Договор Тогда
			
			// проверим, что клиент был создан (при интерактивном создании счета д/у он записывается из формы элемента)
			Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.Ссылка);
			
			Если Не ЗначениеЗаполнено(Клиент) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан клиент доверительного управления", ЭтотОбъект, "Клиент",, Отказ);
				Возврат;
			КонецЕсли;
			
			// проверим, что вид договора соответствует клиенту
			Если ТипЗнч(Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды")
					И ЭтотОбъект.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Если клиентом является ПИФ, то видом договора может быть только " + Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда, ЭтотОбъект, "Клиент",, Отказ);
			КонецЕсли;
			
			// соответствие данных виду договора
			Если ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
				Если ЭтотОбъект.Организация.ЮрФизЛицо <> Клиент Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Клиент собственного счета д/у не является юр. лицом организации", ЭтотОбъект, "Клиент",, Отказ);
				КонецЕсли;
			КонецЕсли;
			
			// проверим, что юр. лицо упр. компании совпадает с владельцами расчетных счетов
			Для каждого СтрокаРасчетныеСчета Из ЭтотОбъект.РасчетныеСчета Цикл
				Если СтрокаРасчетныеСчета.РасчетныйСчет.ЮрФизЛицо <> Клиент Тогда
					ТекстСообщения = "Владелец '" + СтрокаРасчетныеСчета.РасчетныйСчет.ЮрФизЛицо + "' расчетного счета '" + СтрокаРасчетныеСчета.РасчетныйСчет + "'"
						+ " не совпадает является клиентом '" + Клиент + "'";
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "РасчетныеСчета[" + ЭтотОбъект.РасчетныеСчета.Индекс(СтрокаРасчетныеСчета) + "].РасчетныйСчет",, Отказ);
				КонецЕсли;
			КонецЦикла;			
			
		КонецЕсли;
		
		
		// регистрация лицензии
		Если ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
				Или ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный
		Тогда
				
			НаборЗаписейЛицензииДоговоров = РегистрыСведений.ЛицензииДоговоровДоверительногоУправления.СоздатьНаборЗаписей();
			НаборЗаписейЛицензииДоговоров.Отбор.Период.Установить(Дата(1980, 1, 1));
			НаборЗаписейЛицензииДоговоров.Отбор.Организация.Установить(ЭтотОбъект.Организация);
			НаборЗаписейЛицензииДоговоров.Отбор.СчетДоверительногоУправления.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписейЛицензииДоговоров.ДополнительныеСвойства.Вставить("ЗаписьВСоставеСчетаДоверительногоУправления");
			
			Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
				Запрос = Новый Запрос;
				
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ДАТАВРЕМЯ(1980, 1, 1) КАК Период,
					|	&Организация КАК Организация,
					|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
					|	СтатусыЛицензийСрезПоследних.Лицензия КАК Лицензия,
					|	ИСТИНА КАК Действует
					|ИЗ
					|	РегистрСведений.СтатусыЛицензий.СрезПоследних(&ДатаЛицезнии, Лицензия.ВидДеятельности = &ВидДеятельности) КАК СтатусыЛицензийСрезПоследних
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
					|		ПО (Организации.Ссылка = &Организация)
					|			И СтатусыЛицензийСрезПоследних.Лицензия.ЮрФизЛицо = Организации.ЮрФизЛицо
					|			И СтатусыЛицензийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)";
				
				
				Если ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
					ВидДеятельности = Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ;
					
				ИначеЕсли ЭтотОбъект.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
					ВидДеятельности = Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами;
					
				КонецЕсли;
				
				Запрос.УстановитьПараметр("ДатаЛицезнии",				  ЭтотОбъект.ДатаЗаключения);
				Запрос.УстановитьПараметр("Организация",				  ЭтотОбъект.Организация);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("ВидДеятельности",			  ВидДеятельности);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(НаборЗаписейЛицензииДоговоров.Добавить(), Выборка);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для организации " + ЭтотОбъект.Организация + " не найдена лицензия с видом " + ВидДеятельности,,,, Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				Попытка
					НаборЗаписейЛицензииДоговоров.Записать();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), НаборЗаписейЛицензииДоговоров,,, Отказ);
					Возврат;
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") И НЕ ЭтотОбъект.ПометкаУдаления Тогда
		Если НЕ УказанаЛицензияНаДатуЗаключенияДоговора(Отказ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
