Функция ПолучитьПросроченныеРаспоряженияМНО(Дата, Организация, Банк) Экспорт
	
	Запрос = Новый Запрос; 
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Документ,
		|	ВЫБОР
		|		КОГДА Документ.Проведен
		|			ТОГДА 1
		|		КОГДА Документ.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеДокумента,
		|	Документ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Документ.РасчетныйСчет КАК РасчетныйСчет,
		|	Документ.Процент КАК Процент,
		|	Документ.ДатаВозврата КАК ДатаВозврата,
		|	Документ.Сумма КАК Сумма
		|ИЗ
		|	Документ.Распоряжение КАК Документ
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) < &Дата
		|	И НЕ Документ.ПометкаУдаления
		|	И Документ.Организация = &Организация
		|	И Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|	И НЕ Документ.Ссылка В
		|				(ВЫБРАТЬ
		|					МНО.Основание КАК Распоряжение
		|				ИЗ
		|					Документ.МНО КАК МНО
		|				ГДЕ
		|					НАЧАЛОПЕРИОДА(МНО.Дата, ДЕНЬ) < &Дата
		|					И МНО.Проведен
		|					И МНО.Организация = &Организация
		|					И (&БезОтбораПоБанку
		|						ИЛИ МНО.РасчетныйСчет.Банк = &Банк))
		|	И (&БезОтбораПоБанку
		|			ИЛИ Документ.РасчетныйСчет.Банк = &Банк)";
#КонецОбласти

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("БезОтбораПоБанку", (Не ЗначениеЗаполнено(Банк)));
		
	ПросроченныеРаспоряжения = Запрос.Выполнить().Выгрузить();
	
	Возврат ПросроченныеРаспоряжения;	
	
КонецФункции 

Функция ПоместитьВоВременнуюТаблицуУсловияАкцептованияРаспоряжений(Дата, Организация) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокРаспоряжение.Ссылка КАК Ссылка,
		|	ДокРаспоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДокРаспоряжение.РасчетныйСчет КАК РасчетныйСчет
		|ПОМЕСТИТЬ _ДанныеРаспоряжений
		|ИЗ
		|	Документ.Распоряжение КАК ДокРаспоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокМНО
		|		ПО ДокРаспоряжение.Ссылка = ДокМНО.Основание
		|			И (НЕ ДокМНО.ПометкаУдаления)
		|ГДЕ
		|	ДокРаспоряжение.Организация = &Организация
		|	И НЕ ДокРаспоряжение.ПометкаУдаления
		|	И ДокРаспоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|	И ДокРаспоряжение.ДатаВозврата > &Дата
		|	И НАЧАЛОПЕРИОДА(ДокРаспоряжение.Дата, ДЕНЬ) <= &Дата
		|	И ДокМНО.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиАкцептованияОперацийСрезПоследних.Организация КАК Организация,
		|	НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиАкцептованияОперацийСрезПоследних.ВидАкцепта КАК ВидАкцепта,
		|	_ДанныеРаспоряжений.Ссылка КАК Распоряжение,
		|	_ДанныеРаспоряжений.РасчетныйСчет КАК РасчетныйСчет
		|ПОМЕСТИТЬ _НастройкиАкцептования
		|ИЗ
		|	РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ДанныеРаспоряжений.СчетДоверительногоУправления
		|					ИЗ
		|						_ДанныеРаспоряжений КАК _ДанныеРаспоряжений)
		|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО)) КАК НастройкиАкцептованияОперацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|		ПО (_ДанныеРаспоряжений.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления)
		|ГДЕ
		|	НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиАкцептования.Распоряжение КАК Распоряжение,
		|	АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
		|		ИЛИ АкцептованиеОперацийСрезПоследних.Срок <> ДАТАВРЕМЯ(1, 1, 1)
		|			И АкцептованиеОперацийСрезПоследних.Срок <= &Дата КАК ТребуетсяАкцепт
		|ПОМЕСТИТЬ _УсловияАкцептованияРаспоряжений
		|ИЗ
		|	_НастройкиАкцептования КАК _НастройкиАкцептования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО)
		|					И Операция В
		|						(ВЫБРАТЬ
		|							_НастройкиАкцептования.Распоряжение
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования
		|				
		|						ОБЪЕДИНИТЬ
		|				
		|						ВЫБРАТЬ
		|							_НастройкиАкцептования.РасчетныйСчет
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования)) КАК АкцептованиеОперацийСрезПоследних
		|		ПО _НастройкиАкцептования.Организация = АкцептованиеОперацийСрезПоследних.Организация
		|			И _НастройкиАкцептования.ВидАкцепта = АкцептованиеОперацийСрезПоследних.ВидАкцепта
		|			И (АкцептованиеОперацийСрезПоследних.Операция В (_НастройкиАкцептования.Распоряжение, _НастройкиАкцептования.РасчетныйСчет))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеРаспоряжений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _НастройкиАкцептования";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Выполнить();
	
	Возврат МВТ;
		
КонецФункции

		
