
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация 			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.ДатаСверки 			= ТекущаяДата();
	
	Если Параметры.Свойство("ЦеннаяБумага") Тогда
		ЭтаФорма.ОтборЦеннаяБумага = Параметры.ЦеннаяБумага;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборЦеннаяБумага) Тогда
		
		УстановитьОтборПоЦеннойБумаге();
		СкомпоноватьРезультат();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЦеннойБумаге()
	
	ИдентификаторОтбораПоЦеннойБумаге = "";
	
	//ищем отбор по ЦБ в списке отборов
	Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦеннаяБумага") Тогда
			ИдентификаторОтбораПоЦеннойБумаге = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//если кто-то удалил отбор по ЦБ восстановим его
	Если ИдентификаторОтбораПоЦеннойБумаге = "" Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЦеннаяБумага");
		ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
		
		ИдентификаторОтбораПоЦеннойБумаге = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
	КонецЕсли;	
	
	//Установим отбор по ЦБ и отключим другие пользовательские отборы
	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторОтбораПоЦеннойБумаге Тогда
				Элемент.ПравоеЗначение	= ЭтаФорма.ОтборЦеннаяБумага;
				Элемент.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				Элемент.Использование 	= Истина;
			Иначе
				Элемент.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры