
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	ДокументВводЦБ = ЭтаФорма.Параметры.ДокументВводЦБ;
	ДокументВыводЦБ = ЭтаФорма.Параметры.ДокументВыводЦБ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводЦенныхБумаг.Ссылка КАК СсылкаДокументаВывода,
		|	ПРЕДСТАВЛЕНИЕ(ВыводЦенныхБумаг.Ссылка) КАК Представление,
		|	ПРЕДСТАВЛЕНИЕ(ВыводЦенныхБумаг.Организация) КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ВыводЦенныхБумаг.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ВыводЦенныхБумаг.Рынок КАК Рынок
		|ИЗ
		|	Документ.ВыводЦенныхБумаг КАК ВыводЦенныхБумаг
		|ГДЕ
		|	ВыводЦенныхБумаг.Проведен
		|	И НЕ ВыводЦенныхБумаг.ПометкаУдаления
		|	И ВыводЦенныхБумаг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВыводЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыводЦенныхБумаг.Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДокументВводЦБ.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДокументВводЦБ.Дата));
	
	ДокументыВывода.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЗначениеЗаполнено(ДокументВыводЦБ) Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("СсылкаДокументаВывода", ДокументВыводЦБ);
		Строки = ДокументыВывода.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			Элементы.ДокументыВывода.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать()
	
	ТекущиеДанные = Элементы.ДокументыВывода.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбДанные = Новый Структура("СсылкаДокументаВывода, Представление",
		ТекущиеДанные.СсылкаДокументаВывода,
		ТекущиеДанные.Представление);
	
	ЭтаФорма.Закрыть(ВыбДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыводаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Выбрать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Выбрать();
КонецПроцедуры
