
Функция ЗаписатьРасчетнуюЦенуПая(Данные, Ошибки)
	
	Результат = Истина;
	
	// У пользователя может не быть прав, на внесение изменений в регистр "Расчетные цены паев",
	// но если у него есть права на отправку данных на сайт, цену мы зарегистрировать должны.
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.РасчетныеЦеныПаев.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Данные.Период);
	НаборЗаписей.Отбор.ЦеннаяБумага.Установить(Данные.ЦеннаяБумага);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.РасчетнаяЦена)
		ИЛИ Запись.РасчетнаяЦена <> Данные.РасчетнаяЦена
		ИЛИ НЕ ЗначениеЗаполнено(Запись.КоличествоПаев)
		ИЛИ Запись.КоличествоПаев <> Данные.КоличествоПаев Тогда
	
		НаборЗаписей.ДополнительныеСвойства.Вставить("ИмпортИзВнешнейСистемы", Истина);
		
		ЗаполнитьЗначенияСвойств(Запись, Данные);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось зарегистрировать расчетную цену по '%1' за %2!%3%4.",
									Данные.ЦеннаяБумага,
									Формат(Данные.Период, "ДФ=dd.MM.yyyy"),
									Символы.ПС,
									ОписаниеОшибки());
			
			Ошибки.Добавить(ТекстОшибки);
			
			Результат = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ЗарегистрироватьРасчетныеЦеныПаев(Данные, Ошибки)
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Данные", Данные.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ПИФ КАК ПИФ,
		|	Данные.Дата КАК Дата,
		|	Данные.КоличествоПаев КАК КоличествоПаев,
		|	Данные.СтоимостьПая КАК СтоимостьПая
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	&Данные КАК Данные
		|ГДЕ
		|	Данные.КоличествоПаев <> ""NULL""
		|	И Данные.СтоимостьПая <> ""NULL""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.Дата КАК Период,
		|	Паи.Ссылка КАК ЦеннаяБумага,
		|	_Данные.СтоимостьПая КАК РасчетнаяЦена,
		|	_Данные.КоличествоПаев КАК КоличествоПаев
		|ИЗ
		|	_Данные КАК _Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|		ПО _Данные.ПИФ = Паи.ПаевойИнвестиционныйФонд";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗаписатьРасчетнуюЦенуПая(Выборка, Ошибки) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Результат Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьФайлыВыгрузки(Ошибки = Неопределено) Экспорт
	
	// Начало сессии +
	ДанныеДляСбораСтатистики = Новый Структура;
	
	ДанныеДляСбораСтатистики.Вставить("Организация",	Организация);
	ДанныеДляСбораСтатистики.Вставить("НачалоПериода",	НачалоПериода);
	ДанныеДляСбораСтатистики.Вставить("КонецПериода",	КонецПериода);
	ДанныеДляСбораСтатистики.Вставить("Брокер",			Брокер);
	ДанныеДляСбораСтатистики.Вставить("ДатаВыгрузки",	ДатаВыгрузки);
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ДанныеДляСбораСтатистики);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя()  + " (Формирование файлов выгрузки)";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	// Начало сессии -
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	// Выгружаем данные ПИФ в файл
	ПутьКФайлуДанныхПИФ = СформироватьФайлДанныхПИФ(Ошибки);
	
	// Готовим файл к передаче на клиент
	ОписаниеФайлов = Новый Массив;
	ОписаниеФайлов.Добавить(
		Новый ОписаниеПередаваемогоФайла(
			ЭтотОбъект.ПутьКФайлу,
			ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлуДанныхПИФ), Новый УникальныйИдентификатор)
		)
	);
	
	// Удаляем временные файлы 
	УдалитьФайлы(ПутьКФайлуДанныхПИФ);
	
	// Окончание сессии +
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	// Окончание сессии -
	
	Возврат ОписаниеФайлов;
	
КонецФункции

Функция СформироватьФайлДанныхПИФ(Ошибки)
	// Получаем данные
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ПаевыеИнвестиционныеФонды
		|ИЗ
		|	&ПаевыеИнвестиционныеФонды КАК _ПаевыеИнвестиционныеФонды
		|ГДЕ
		|	_ПаевыеИнвестиционныеФонды.Выбран
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления КАК СчетДУ,
		|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК Наименование,
		|	ПРЕДСТАВЛЕНИЕ(ПаевыеИнвестиционныеФонды.Тип) КАК Тип,
		|	КодыСчетовДУ.Код КАК Код,
		|	ВЫБОР
		|		КОГДА КодыСчетовДУ.Код = ""115""
		|			ТОГДА ""ffd200""
		|		КОГДА КодыСчетовДУ.Код = ""116""
		|			ТОГДА ""dd0808""
		|		КОГДА КодыСчетовДУ.Код = ""550""
		|			ТОГДА ""27b600""
		|		КОГДА КодыСчетовДУ.Код = ""551""
		|			ТОГДА ""d000fc""
		|		ИНАЧЕ ""5A83A9""
		|	КОНЕЦ КАК ЦветФонда,
		|	ВЫБОР
		|		КОГДА НЕ(КлиентыДУ.СчетДоверительногоУправления.ДатаРасторжения <= &КонецПериода
		|					И КлиентыДУ.СчетДоверительногоУправления.ДатаРасторжения <> &ПустаяДата)
		|			ТОГДА ""true""
		|		ИНАЧЕ ""false""
		|	КОНЕЦ КАК Активность
		|ИЗ
		|	_ПаевыеИнвестиционныеФонды КАК _ПаевыеИнвестиционныеФонды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, ) КАК КлиентыДУ
		|		ПО (КлиентыДУ.СчетДоверительногоУправления = _ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО (ПаевыеИнвестиционныеФонды.Ссылка = КлиентыДУ.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = КлиентыДУ.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И Брокер = &Брокер) КАК КодыСчетовДУ
		|		ПО (КодыСчетовДУ.СчетДоверительногоУправления = _ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _РабочиеДни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления КАК СчетДУ,
		|	_РабочиеДни.Дата КАК Дата,
		|	ЕСТЬNULL(СЧА.Значение, НЕОПРЕДЕЛЕНО) КАК СЧА,
		|	ЕСТЬNULL(СтоимостьПая.Значение, НЕОПРЕДЕЛЕНО) КАК СтоимостьПая,
		|	0 КАК Доход
		|ИЗ
		|	_ПаевыеИнвестиционныеФонды КАК _ПаевыеИнвестиционныеФонды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РабочиеДни КАК _РабочиеДни
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.Организация = &Организация)
		|			И (СЧА.СубъектАналитики = _ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (СЧА.Период = _РабочиеДни.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СтоимостьПая
		|		ПО (СтоимостьПая.Организация = &Организация)
		|			И (СтоимостьПая.СубъектАналитики = _ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления)
		|			И (СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|			И (СтоимостьПая.Период = _РабочиеДни.Дата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления,
		|	_РабочиеДни.Дата");
	Запрос.УстановитьПараметр("ОсновнойКалендарьКотировок", Константы.ОсновнойКалендарьКотировок.Получить());
	Запрос.УстановитьПараметр("Брокер", ЭтотОбъект.Брокер);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПаевыеИнвестиционныеФонды", ЭтотОбъект.ПаевыеИнвестиционныеФонды);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("ПустаяДата",  Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ВалютаДоллары", Справочники.Валюты.НайтиПоНаименованию("USD", Истина));
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();	
	ПИФ			= ПакетЗапроса[1];
	Котировки	= ПакетЗапроса[3].Выгрузить();	
	
	// Формируем файл
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "UTF-8"); 
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("root");
		// Фонды		
		ЗаписьXML.ЗаписатьНачалоЭлемента("stocks");
			Если ПИФ.Пустой() Тогда
				Ошибки.Добавить("Не выбраны ПИФ для выгрузки.");
			КонецЕсли;
			
			ПИФ = ПИФ.Выбрать();
			Пока ПИФ.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ПИФ.Код) Тогда
					Ошибки.Добавить("Для """ + ПИФ.Наименование + """ не удалось определить код счета ДУ у брокера.");
					Продолжить;		
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("stock");
					ЗаписьXML.ЗаписатьАтрибут("title",	ПИФ.Наименование);
					ЗаписьXML.ЗаписатьАтрибут("active",	ПИФ.Активность);
					ЗаписьXML.ЗаписатьАтрибут("color",	ПИФ.ЦветФонда);
					ЗаписьXML.ЗаписатьАтрибут("code",	ПИФ.Код);
					ЗаписьXML.ЗаписатьАтрибут("type",	ПИФ.Тип);
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("datas");
						КотировкиПИФ = Котировки.НайтиСтроки(Новый Структура("СчетДУ", ПИФ.СчетДУ)); 
						
						Если КотировкиПИФ.Количество() = 0 Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для """ + ПИФ.Наименование + """ нет данных для выгрузки.");
						КонецЕсли;							
						
						Для Каждого Котировка Из КотировкиПИФ Цикл
							Если Котировка.СтоимостьПая = Неопределено Тогда
								Ошибки.Добавить("Для """ + ПИФ.Наименование + """ не удалось определить стоимость пая на " + Формат(Котировка.Дата, "ДФ='dd.MM.yyyy'"));
							КонецЕсли;
							
							Если Котировка.СЧА = Неопределено Тогда
								Ошибки.Добавить("Для """ + ПИФ.Наименование + """ не удалось определить СЧА на " + Формат(Котировка.Дата, "ДФ='dd.MM.yyyy'"));
							КонецЕсли;							
							
							ЗаписьXML.ЗаписатьНачалоЭлемента("data");
								ЗаписьXML.ЗаписатьАтрибут("date",			Формат(Котировка.Дата, "ДФ='dd.MM.yyyy'"));
								ЗаписьXML.ЗаписатьАтрибут("value",			Формат(Котировка.СтоимостьПая, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ="));
								ЗаписьXML.ЗаписатьАтрибут("value2",			Формат(Котировка.СЧА, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ="));
								ЗаписьXML.ЗаписатьАтрибут("doxod",			Формат(Котировка.Доход, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ="));
								ЗаписьXML.ЗаписатьАтрибут("actual_date",	Формат(ЭтотОбъект.ДатаВыгрузки, "ДФ='dd.MM.yyyy HH:mm'"));
							ЗаписьXML.ЗаписатьКонецЭлемента();
						КонецЦикла;
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	Возврат ИмяВременногоФайла;
КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(СтруктураДанныхДляСтатистики)
		
	Описание = "";
	
	Для Каждого Свойство Из СтруктураДанныхДляСтатистики Цикл
	
		Описание = Описание + Символы.ПС + Свойство.Ключ + ": " + Свойство.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(СтруктураДанныхДляСтатистики, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура ОтправитьВMatrix(Ошибки = Неопределено) Экспорт
	
	ДанныеДляСбораСтатистики = Новый Структура;
	
	ДанныеДляСбораСтатистики.Вставить("Организация",	Организация);
	ДанныеДляСбораСтатистики.Вставить("НачалоПериода",	НачалоПериода);
	ДанныеДляСбораСтатистики.Вставить("КонецПериода",	КонецПериода);
	ДанныеДляСбораСтатистики.Вставить("Брокер",			Брокер);
	ДанныеДляСбораСтатистики.Вставить("ДатаВыгрузки",	ДатаВыгрузки);
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ДанныеДляСбораСтатистики);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя()  + " (Отправка в Matrix)";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ВыгруженоУспешно	= Истина;
	Ошибки				= Новый Массив;
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	// Получаем данные
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	&ПаевыеИнвестиционныеФонды КАК _ПаевыеИнвестиционныеФонды
		|ГДЕ
		|	_ПаевыеИнвестиционныеФонды.Выбран
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПаевыеИнвестиционныеФонды.Ссылка КАК ПИФ,
		|	КодыВМатрих.Код КАК ВнешнийКод,
		|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПредназначенДляКвалИнвесторов
		|		И ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый) КАК ОтправитьОповещение
		|ПОМЕСТИТЬ _ПИФы
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&КонецПериода,
		|				СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Клиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_Клиенты)) КАК КлиентыПИФы
		|		ПО (КлиентыПИФы.СчетДоверительногоУправления = _Клиенты.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО (ПаевыеИнвестиционныеФонды.Ссылка = КлиентыПИФы.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)) КАК КодыВМатрих
		|		ПО (КодыВМатрих.Объект = КлиентыПИФы.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&КонецПериода, ) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
		|		ПО (ПаевыеИнвестиционныеФонды.Ссылка = УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПаевойИнвестиционныйФонд)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КоличествоПаев.ПаевойИнвестиционныйФонд КАК ПИФ,
		|	КоличествоПаев.Период КАК Дата,
		|	КоличествоПаев.КоличествоКонечныйОстаток КАК Количество
		|ПОМЕСТИТЬ _КоличествоПаев
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, ДвиженияИГраницыПериода, Организация = &Организация) КАК КоличествоПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	СтоимостьПая.Период КАК Дата,
		|	СтоимостьПая.Значение КАК Стоимость
		|ПОМЕСТИТЬ _СтоимостьПаев
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СтоимостьПая
		|		ПО (СтоимостьПая.Организация = &Организация)
		|			И (СтоимостьПая.СубъектАналитики = _ПИФы.СчетДоверительногоУправления)
		|			И (СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|			И (СтоимостьПая.Период МЕЖДУ &НачалоПериода И &КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	_Дни.Дата КАК Дата,
		|	МАКСИМУМ(_КоличествоПаев.Дата) КАК ДатаИзменения
		|ПОМЕСТИТЬ _ДатыИзмененияКоличестваПаев
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоПаев КАК _КоличествоПаев
		|		ПО (_КоличествоПаев.ПИФ = _ПИФы.ПИФ)
		|			И (_КоличествоПаев.Дата <= _Дни.Дата)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПИФы.ПИФ,
		|	_Дни.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	_ПИФы.ВнешнийКод КАК ВнешнийКод,
		|	_Дни.Дата КАК Дата,
		|	ЕСТЬNULL(_КоличествоПаев.Количество, ""NULL"") КАК КоличествоПаев,
		|	ЕСТЬNULL(_СтоимостьПаев.Стоимость, ""NULL"") КАК СтоимостьПая,
		|	_ПИФы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПИФы.ОтправитьОповещение КАК ОтправитьОповещение
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыИзмененияКоличестваПаев КАК _ДатыИзмененияКоличестваПаев
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КоличествоПаев КАК _КоличествоПаев
		|			ПО (_КоличествоПаев.ПИФ = _ДатыИзмененияКоличестваПаев.ПИФ)
		|				И (_КоличествоПаев.Дата = _ДатыИзмененияКоличестваПаев.ДатаИзменения)
		|		ПО (_ДатыИзмененияКоличестваПаев.ПИФ = _ПИФы.ПИФ)
		|			И (_ДатыИзмененияКоличестваПаев.Дата = _Дни.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаев КАК _СтоимостьПаев
		|		ПО (_СтоимостьПаев.ПИФ = _ПИФы.ПИФ)
		|			И (_СтоимостьПаев.Дата = _Дни.Дата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ПИФы.ПИФ,
		|	_Дни.Дата");
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПаевыеИнвестиционныеФонды", ЭтотОбъект.ПаевыеИнвестиционныеФонды);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Если НЕ ЗарегистрироватьРасчетныеЦеныПаев(РезультатЗапроса, Ошибки) Тогда
			Ошибки.Добавить("Операция прервана!");
			Возврат;
		Иначе
			
			// Определяем источник данных
			Если ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
				ИсточникДанных = "РЭМ";
			ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
				ИсточникДанных = "Регион Траст";
			ИначеЕсли ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
				ИсточникДанных = "РПИ";
			Иначе
				ИсточникДанных = "";
			КонецЕсли;	
			
			МассивДанных = Новый Массив;
			МассивДанных.Добавить("SET NOCOUNT ON;");	
			
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			ДанныеОповещений = Новый ТаблицаЗначений;
			ДанныеОповещений.Колонки.Добавить("ПИФ", Новый ОписаниеТипов("СправочникСсылка.ПаевыеИнвестиционныеФонды"));
			ДанныеОповещений.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
			ДанныеОповещений.Колонки.Добавить("СтоимостьПая", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
			ДанныеОповещений.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
			
			Пока ВыборкаЗапроса.Следующий() Цикл
				// exec MatriX_External.[AM].[usp_Securities_Quotes_API_Modify]
				//	@ShareID varchar(100),			-- ID ПИФ 
				//	@Date datetime,					-- Дата
				//	@MarketSource nvarchar(256),	-- Источник данных = 'Регион девелопмент', 'РЭМ', 'РПИ', 'Регион Траст'
				//	@CalculatedPrice numeric(18,2),	-- Стоимость пая
				//	@ShareCount numeric(20,5)		-- Количество паев 
				
				МассивДанных.Добавить(
				"exec MatriX_External.AM.usp_Securities_Quotes_API_Modify "
				+ "@ShareID = '" + ВыборкаЗапроса.ВнешнийКод + "', "
				+ "@Date = '" + Формат(ВыборкаЗапроса.Дата, "ДФ=dd/MM/yyyy") + "', "
				+ "@MarketSource = '" + ИсточникДанных + "', "
				+ "@CalculatedPrice = " + Формат(ВыборкаЗапроса.СтоимостьПая, "ЧРД=.; ЧН=; ЧГ=") + ", "
				+ "@ShareCount = " + Формат(ВыборкаЗапроса.КоличествоПаев, "ЧРД=.; ЧН=; ЧГ=") + ";"
				);
				
				Если ВыборкаЗапроса.ОтправитьОповещение Тогда
					ЗаполнитьЗначенияСвойств(ДанныеОповещений.Добавить(), ВыборкаЗапроса);
				КонецЕсли; 
				
			КонецЦикла;
			
			ТекстЗапроса = СтрСоединить(МассивДанных, Символы.ПС);
			
			// Соединяемся с Матрикс и отправляем данные	
			СтрокаСоединения		= РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрихExternal();
			ДополнительныеПараметры	= Новый Структура("РежимБезУведомлений, Ошибки", Истина, Ошибки);
			
			Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(СтрокаСоединения, , ДополнительныеПараметры);
			
			Если Соединение <> Неопределено Тогда
				
				Если ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
					РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса, ДополнительныеПараметры);
				КонецЕсли;
				
				РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение, ДополнительныеПараметры);
				
				Если ДанныеОповещений.Количество() > 0 Тогда
					ОтправитьОповещения(ДанныеОповещений);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ОтправитьВЛКК(Ошибки = Неопределено) Экспорт
	
	// Отправка в ЛКК только для РЭМа
	Если ЭтотОбъект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляСбораСтатистики = Новый Структура;
	
	ДанныеДляСбораСтатистики.Вставить("Организация",	Организация);
	ДанныеДляСбораСтатистики.Вставить("НачалоПериода",	НачалоПериода);
	ДанныеДляСбораСтатистики.Вставить("КонецПериода",	КонецПериода);	
	ДанныеДляСбораСтатистики.Вставить("ДатаВыгрузки",	ДатаВыгрузки);
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ДанныеДляСбораСтатистики);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя()  + " (Отправка в ЛКК)";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ВыгруженоУспешно	= Истина;	
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
	КонецЕсли;
	
	// Получаем данные
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПаевыеИнвестиционныеФонды.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	&ПаевыеИнвестиционныеФонды КАК _ПаевыеИнвестиционныеФонды
		|ГДЕ
		|	_ПаевыеИнвестиционныеФонды.Выбран
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПаевыеИнвестиционныеФонды.Ссылка КАК ПИФ,
		|	КодыВЕСИАФинанс.Код КАК ВнешнийКод
		|ПОМЕСТИТЬ _ПИФы
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&КонецПериода,
		|				СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Клиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_Клиенты)) КАК КлиентыПИФы
		|		ПО (КлиентыПИФы.СчетДоверительногоУправления = _Клиенты.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО (ПаевыеИнвестиционныеФонды.Ссылка = КлиентыПИФы.Клиент)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)) КАК КодыВЕСИАФинанс
		|		ПО (КодыВЕСИАФинанс.Объект = КлиентыПИФы.Клиент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	СЧА.Период КАК Дата,
		|	СЧА.Значение КАК Сумма
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.Организация = &Организация)
		|			И (СЧА.СубъектАналитики = _ПИФы.СчетДоверительногоУправления)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (СЧА.Период МЕЖДУ &НачалоПериода И &КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	СтоимостьПая.Период КАК Дата,
		|	СтоимостьПая.Значение КАК Стоимость
		|ПОМЕСТИТЬ _СтоимостьПаев
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СтоимостьПая
		|		ПО (СтоимостьПая.Организация = &Организация)
		|			И (СтоимостьПая.СубъектАналитики = _ПИФы.СчетДоверительногоУправления)
		|			И (СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|			И (СтоимостьПая.Период МЕЖДУ &НачалоПериода И &КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПИФы.ПИФ КАК ПИФ,
		|	_Дни.Дата КАК Дата,
		|	ЕСТЬNULL(_СЧА.Сумма, ""NULL"") КАК СЧА,
		|	ЕСТЬNULL(_СтоимостьПаев.Стоимость, ""NULL"") КАК СтоимостьПая
		|ИЗ
		|	_ПИФы КАК _ПИФы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|		ПО _ПИФы.ПИФ = _СЧА.ПИФ
		|			И (_СЧА.Дата = _Дни.Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаев КАК _СтоимостьПаев
		|		ПО (_СтоимостьПаев.ПИФ = _ПИФы.ПИФ)
		|			И (_СтоимостьПаев.Дата = _Дни.Дата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ПИФы.ПИФ,
		|	_Дни.Дата");
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПаевыеИнвестиционныеФонды", ЭтотОбъект.ПаевыеИнвестиционныеФонды);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Количество() > 0 Тогда
		
		ОбработкаОбменаСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать();
		ОбработкаОбменаСЛКК.Организация = ЭтотОбъект.Организация;
		
		Пока Выборка.Следующий() Цикл 
			
			ОбработкаОбменаСЛКК.Пиф		= Выборка.ПИФ;
			ОбработкаОбменаСЛКК.Дата	= Выборка.Дата;
			ОбработкаОбменаСЛКК.ВыгрузитьСтоимостьПаев(Выборка.СтоимостьПая, Выборка.СЧА);
			
		КонецЦикла;
		
	КонецЕсли;	
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ОтправитьОповещения(ДанныеОповещений)
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеОповещений.ПИФ КАК ПИФ,
		|	ДанныеОповещений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДанныеОповещений.СтоимостьПая КАК СтоимостьПая,
		|	ДанныеОповещений.Дата КАК Дата
		|ПОМЕСТИТЬ _ДанныеОповещений
		|ИЗ
		|	&ДанныеОповещений КАК ДанныеОповещений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПаевыеИнвестиционныеФонды.ДатаПравил КАК ДатаПравил,
		|	ПаевыеИнвестиционныеФонды.НомерПравил КАК НомерПравил,
		|	_ДанныеОповещений.СтоимостьПая КАК СтоимостьПая,
		|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК НаименованиеПИФ,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеОрганизации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ФактическийАдрес КАК АдресОрганизации,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК ТелефоныОрганизации,
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензии,
		|	_ДанныеОповещений.Дата КАК Дата,
		|	ВходящийДокумент.НомерВходящегоДокумента КАК НомерЗапроса,
		|	ВходящийДокумент.ДатаВходящегоДокумента КАК ДатаЗапроса
		|ИЗ
		|	_ДанныеОповещений КАК _ДанныеОповещений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|		ПО _ДанныеОповещений.ПИФ = ПаевыеИнвестиционныеФонды.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО _ДанныеОповещений.ПИФ = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО (РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = &ЮрЛицоОрганизация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|		ПО _ДанныеОповещений.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийДокумент КАК ВходящийДокумент
		|			ПО ЗначенияДополнительныхСведений.Значение = ВходящийДокумент.Ссылка
		|		ПО _ДанныеОповещений.СчетДоверительногоУправления = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВходящийЗапросСтоимостиПаяДляБК"")
		|ГДЕ
		|	(НЕ ВходящийДокумент.Ссылка ЕСТЬ NULL
		|			ИЛИ &ЭтоОрганизацияРПИ)";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", 		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЭтоОрганизацияРПИ", 	ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	Запрос.УстановитьПараметр("ЮрЛицоОрганизация", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("ДанныеОповещений", 	ДанныеОповещений);
	Запрос.УстановитьПараметр("Период", 			КонецДня(ЭтотОбъект.КонецПериода));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		РеквизитыОповещения = Новый Структура("НаименованиеПИФ, НаименованиеОрганизации, АдресОрганизации, ТелефоныОрганизации");
		ЗаполнитьЗначенияСвойств(РеквизитыОповещения, Выборка);
		
		РеквизитыОповещения.Вставить("Организация", 	 ЭтотОбъект.Организация);
		РеквизитыОповещения.Вставить("ДатаЗапроса", 	 Формат(Выборка.ДатаЗапроса, "ДФ='dd ММММ yyyy'"));
		РеквизитыОповещения.Вставить("НомерЗапроса", 	 Выборка.НомерЗапроса);
		РеквизитыОповещения.Вставить("Дата", 			 Формат(Выборка.Дата, "ДФ='dd.MM.yyyy ''г.'''"));
		РеквизитыОповещения.Вставить("СтоимостьПая", 	 Формат(Выборка.СтоимостьПая, "ЧДЦ=2; ЧН=0,00; ЧГ=3,0; ЧФ='Ч руб.'"));
		РеквизитыОповещения.Вставить("ДатаЛицензии", 	 Формат(Выборка.ДатаЛицензии, "ДФ='dd ММММ yyyy'"));
		РеквизитыОповещения.Вставить("НомерЛицензии", 	 Формат(Выборка.НомерЛицензии, "ЧГ=0"));
		РеквизитыОповещения.Вставить("ДатаПравил", 		 Формат(Выборка.ДатаПравил, "ДФ='dd ММММ yyyy'"));
		РеквизитыОповещения.Вставить("НомерПравил", 	 Формат(Выборка.НомерПравил, "ЧГ=0"));
		
		Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт.ОтправитьВMatrix()", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	
	КонецЦикла;

КонецПроцедуры

Функция ОткрытьСессию(ПараметрыПодключения) Экспорт
	
	НастройкиСессии = Новый COMОбъект("WinSCP.SessionOptions");
	Сессия          = Новый COMОбъект("WinSCP.Session");
	
	Если НРег(ПараметрыПодключения.Протокол) = "sftp" Тогда
		
		Если ПустаяСтрока(ПараметрыПодключения.Ключ) Тогда
			Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + ":" + ПараметрыПодключения.Пароль + "@" + ПараметрыПодключения.Сервер + "/";
		Иначе
			Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + "@" + ПараметрыПодключения.Сервер + "/";
			ИмяВременногоКлюча = КаталогВременныхФайлов() + "key.ppk";
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоКлюча, "CESU-8");
			ЗаписьТекста.Записать(ПараметрыПодключения.Ключ);
			ЗаписьТекста.Закрыть();
			НастройкиСессии.SshPrivateKeyPath = ИмяВременногоКлюча;
		КонецЕсли;
		
		НастройкиСессии.ParseUrl(Url);
		Fingerprint = Сессия.ScanFingerprint(НастройкиСессии, "SHA-256");
		НастройкиСессии.SshHostKeyFingerprint = Fingerprint;
		
	Иначе
		Url = ПараметрыПодключения.Протокол + "://" + ПараметрыПодключения.ИмяПользователя + ":" + ПараметрыПодключения.Пароль + "@" + ПараметрыПодключения.Сервер + "/";
		НастройкиСессии.ParseUrl(Url);
	КонецЕсли;
	
	Сессия.Open(НастройкиСессии);
	
	Возврат Сессия;
	
КонецФункции

Процедура ОтправитьФайлы(ОписанияФайлов, ПараметрыПодключения) Экспорт
	
	Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
		
		ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
		
		Файл = Новый Файл(ИмяВременногоКаталога);
		Если Не Файл.Существует() Тогда
			СоздатьКаталог(ИмяВременногоКаталога);
		КонецЕсли;
		ИмяВременногоФайла = ИмяВременногоКаталога + "\" + ОписаниеФайла.ИмяФайла;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеФайла.АдресВХранилище);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		УспешнаяВыгрузкаНаФТП = Ложь;
		
		Попытка
			
			Сессия = ОткрытьСессию(ПараметрыПодключения);
			
			КаталогНаСервере = ПараметрыПодключения.ТекущийКаталог;
			Если Не СтрНачинаетсяС(КаталогНаСервере, "/") Тогда
				КаталогНаСервере = "/" + КаталогНаСервере;
			КонецЕсли;
			Если Не СтрЗаканчиваетсяНа(КаталогНаСервере, "/") Тогда
				КаталогНаСервере = КаталогНаСервере + "/";
			КонецЕсли;
			
			НастройкиПередачи = Новый COMОбъект("WinSCP.TransferOptions");
			НастройкиПередачи.PreserveTimestamp = false;
			РезультатПередачи = Сессия.PutFiles(ИмяВременногоФайла, КаталогНаСервере, false, НастройкиПередачи);
			РезультатПередачи.Check();
			
			Сессия.Close();
			УспешнаяВыгрузкаНаФТП = Истина;
			
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если Не УспешнаяВыгрузкаНаФТП Тогда
			
			УдалитьФайлы(ИмяВременногоКаталога);
			ОписаниеОшибки = "Ошибка выгрузки данных на FTP. Система сообщает: """ + ОписаниеОшибки + """";
			Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт", Перечисления.ТипыСобытий.ВнешнийВызов, Новый Структура("ОписаниеОшибки", ОписаниеОшибки));
			ВызватьИсключение ОписаниеОшибки;
			
		Иначе
			
			Если ПараметрыПодключения.ЗащищенноеСоединение Тогда
				ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
			Иначе
				ЗащищенноеСоединение = Неопределено;
			КонецЕсли;
			
			HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСайта,,,,,, ЗащищенноеСоединение);
			HTTPЗапрос    = Новый HTTPЗапрос(ПараметрыПодключения.Скрипт + ОписаниеФайла.ИмяФайла);
			Результат     = HTTPСоединение.Получить(HTTPЗапрос);
			
			ДобавитьЗаписьАсинхронногоОбмена(ОписаниеФайла, Результат);
			
			Если Результат.КодСостояния >= 300 Тогда
				УдалитьФайлы(ИмяВременногоКаталога);
				ОписаниеОшибки = "Ошибка отправки данных на сайт (код состояния: " + Результат.КодСостояния + ")";
				Справочники.Оповещения.СформироватьОповещения("Обработка.ОтправкаДанныхПИФНаСайт", Перечисления.ТипыСобытий.ВнешнийВызов, Новый Структура("ОписаниеОшибки", ОписаниеОшибки));
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременногоКаталога);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗаписьАсинхронногоОбмена(ОписаниеФайла, Результат)
	
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(ОписаниеФайла.АдресВХранилище);
	ЧтениеДанных 	= Новый ЧтениеДанных(ДвоичныеДанные);
	ЧтениеТекста 	= Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток());
	ТекстЗапроса 	= ЧтениеТекста.Прочитать();
	
	Запись = РегистрыСведений.АсинхронныйОбменДанными.СоздатьМенеджерЗаписи();
	Запись.ВнешняяСистема            = Справочники.ВнешниеСистемы.СайтГКРегион;
	Запись.УникальныйИдентификатор   = ОписаниеФайла.ИдентификаторОбменаДанными;
	Запись.ТипПакета                 = Справочники.ГруппыИмпортируемыхОбъектов.ИмпортДанныхПИФ;
	Запись.ТекстЗапроса              = Новый ХранилищеЗначения(ТекстЗапроса, Новый СжатиеДанных(9));
	Запись.ТекстОтвета               = Новый ХранилищеЗначения(Результат.ПолучитьТелоКакСтроку(), Новый СжатиеДанных(9));
	Запись.КодСостояния              = Результат.КодСостояния;
	Запись.ДатаЗапроса               = ТекущаяДатаСеанса();
	Запись.СтатусОтвета              = ?(Результат.КодСостояния >= 300,
		Перечисления.СтатусыОтветаАсинхронногоОбменаДанными.Ошибка,
		Перечисления.СтатусыОтветаАсинхронногоОбменаДанными.Исполнено);
	Запись.Пользователь              = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
	Запись.Записать();
	
КонецПроцедуры
