
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Дата, Организация");
	
	Если Параметры.Свойство("ДанныеФайла") Тогда
	
		Для Каждого ЭлементДанных Из Параметры.ДанныеФайла Цикл
			
			НоваяСтрокаДанных = ЭтаФорма.ДанныеДляЗагрузки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ЭлементДанных);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	ЭтаФорма.Заголовок = "Загрузка статуса [" + НРег(Параметры.Статус) + "] из файла.";  
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Загрузить");
	Попытка
		ВыполнитьЗагрузить(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузить(ПараметрыСессии)
	
	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаДанныеДляЗагрузки Из ЭтаФорма.ДанныеДляЗагрузки Цикл
		
		Если СтрокаДанныеДляЗагрузки.Флажок Тогда 
			
			Если Не Элементы.ДанныеДляЗагрузки.ПроверитьСтроку(СтрокаДанныеДляЗагрузки.ПолучитьИдентификатор()) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДанныеДляЗагрузки.ВидПоручения = "ВНУТРЕННЕЕ" И Не СтрокаДанныеДляЗагрузки.СчетСоответствуетСчетуИзНастроек Тогда
				
				ВариантыОтветов = Новый СписокЗначений;
				ВариантыОтветов.Добавить(1, "Отменить");
				ВариантыОтветов.Добавить(2, "Загрузить");

				Если Вопрос("В поручении на сумму " + СтрокаДанныеДляЗагрузки.Сумма + " " + СтрокаДанныеДляЗагрузки.Валюта + " расчетный счет отличается от расчетного счета в настройках учета по ценным бумагам.
							|Загрузить статус " + СтрокаДанныеДляЗагрузки.НовыйСтатус + "?", ВариантыОтветов,,, "Счет ду " + СтрокаДанныеДляЗагрузки.СчетДоверительногоУправления + ".") = 1 Тогда		
					Продолжить;			
				КонецЕсли;
				
			КонецЕсли;
			
			МассивДанных.Добавить(СтрокаДанныеДляЗагрузки.Поручение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДанных.Количество() > 0 Тогда
		Закрыть(Новый Структура("МассивДанных", МассивДанных));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите поручения для загрузки статуса " + СтрокаДанныеДляЗагрузки.НовыйСтатус  + ".");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("УстановитьФлажки");
	Попытка
		ИзменитьЗначенияФлажков(Истина);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СнятьФлажки");
	Попытка
		ИзменитьЗначенияФлажков(Ложь);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьЗначенияФлажков(Значение);
	
	Для Каждого СтрокаТаблицыДанных Из ЭтаФорма.ДанныеДляЗагрузки Цикл 
		
		Если Значение = Ложь Или Элементы.ДанныеДляЗагрузки.ПроверитьСтроку(СтрокаТаблицыДанных.ПолучитьИдентификатор()) И Не СтрокаТаблицыДанных.ЕстьОшибки Тогда
			 
			СтрокаТаблицыДанных.Флажок = Значение;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляЗагрузкиПередНачаломИзменения(Элемент, Отказ)
	ТаблицаДанныхДляЗагрузкиОбработкаНажатия(Элемент, Отказ);
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаДанныхДляЗагрузкиОбработкаНажатия(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
		
	Если Не (ТекущиеДанные = Неопределено Или Элемент.ТекущийЭлемент = Неопределено) Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ДанныеДляЗагрузкиФлажок" Тогда
			Возврат;
		Конецесли;
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущийЭлемент.Имя = "ДанныеДляЗагрузкиСчетДоверительногоУправления"
			Или Элемент.ТекущийЭлемент.Имя = "ДанныеДляЗагрузкиКодСчета" Тогда
			
			ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
				
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДанныеДляЗагрузкиЕстьОшибки" Тогда 
			
			Сообщить(ТекущиеДанные.ТекстОшибки);
			
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДанныеДляЗагрузкиИдентификатор" Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
				ОткрытьЗначение(ТекущиеДанные.Поручение);
			КонецЕсли;

		КонецЕсли;
		
		Отказ = Истина;			
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляЗагрузкиПриАктивизацииСтроки(Элемент)
	
	ТекстОшибки = ""; 
	
	ЭтаФорма.ТекстОшибки = СокрЛП(Элемент.ТекущиеДанные.ТекстОшибки);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

