Перем КодыПифов;

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//	Вид (Строка) - вид подключаемого объекта:
//		|- "ДополнительнаяОбработка"
//		|- "ДополнительныйОтчет"
//		|- "ЗаполнениеОбъекта"
//		|- "ПечатнаяФорма"
//
//	Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//		Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//	Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//	Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//	Информация (Строка) - описание обработки
//
//	Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//		|- Представление (строка) - представление команды конечному пользователю
//		|- Идентификатор (строка) - идентификатор команды
//		|- Использование (строка) - варианты запуска обработки:
//		|	|- "ОткрытиеФормы"          - открыть форму обработки
//		|	|- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//		|	|- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//		|- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//		|	Прим. Имеет смысл только при запуске обработки без открытия формы.
//		|- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//		Печать требуется установить как "ПечатьMXL"
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Экспорт в ЕГАР",
		"2.13.11",
		"",
		Истина);
	
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПроверкаСоединения_АП55", "Проверка соединения с EGAR (АП55)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПроверкаСоединения_АП91", "Проверка соединения с EGAR (АП91)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "Удаление_АП55", "Удаление данных из EGAR (АП55)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортОстатков_АП55", "Экспорт остатков (АП55)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортСделок_АП55", "Экспорт сделок (АП55)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОбновитьПараметрыКлиентов_АП55", "Обновить параметры",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОбновитьСписокБумагУдерживаемыхДоПогашения_АП55", "Обновить список бумаг (АП55)",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//	ИдентификаторКоманды - Строка - идентификатор команды
//	ПараметрыОбработки - Структура - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//		элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	Если Не ЭтоРабочийИлиТорговыйДень(НачалоДня(ТекущаяДатаСеанса())) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.ДатаВыгрузки = НачалоДня(ТекущаяДата());
	ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	ЭтотОбъект.ДопСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	// Значение для переменной "Сервер" не должно отличаться от его условия
	Если Прав(ИдентификаторКоманды, СтрДлина("АП91")) = "АП91" Тогда
		Сервер = "АП91";
	ИначеЕсли Прав(ИдентификаторКоманды, СтрДлина("АП55")) = "АП55" Тогда
		Если ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
			Сервер = "АП55";
		Иначе
			Сообщить("Запрещено совершать операции с рабочей базой ЕГАР вне рабочей базы 1С.");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭкспортСправочника = Ложь;
	ЭкспортОстатков = Ложь;
	ЭкспортСделок = Ложь;
	ОбновлениеПараметров = Ложь;
	ЭкспортБумагУдерживаемыхДоПогашения = Ложь;
	
	// Команда: ПроверкаСоединения
	Если ИдентификаторКоманды = "ПроверкаСоединения" + "_" + Сервер Тогда
		ПроверитьСоединение(Сервер);
		Возврат;
	// Команда: Удаление
	ИначеЕсли ИдентификаторКоманды = "Удаление" + "_" + Сервер Тогда
		УдалитьДанные(Сервер,,); //(Сервер, Соединение, МассивСделок)
		Возврат;
	// Команда: ЭкспортОстатков
	ИначеЕсли ИдентификаторКоманды = "ЭкспортОстатков" + "_" + Сервер Тогда
		ЭкспортСправочника = Истина;
		ЭкспортОстатков = Истина;
	// Команда: ЭкспортСделок
	ИначеЕсли ИдентификаторКоманды = "ЭкспортСделок" + "_" + Сервер Тогда
		ЭкспортСправочника = Истина;
		ЭкспортСделок = Истина;
	// Команда: ОбновитьПараметрыКлиентов_АП55
	ИначеЕсли ИдентификаторКоманды = "ОбновитьПараметрыКлиентов_АП55" Тогда
		ОбновлениеПараметров = Истина;
	// Команда: ОбновитьСписокБумагУдерживаемыхДоПогашения_АП55
	ИначеЕсли ИдентификаторКоманды = "ОбновитьСписокБумагУдерживаемыхДоПогашения_АП55" Тогда
		ЭкспортБумагУдерживаемыхДоПогашения = Истина;
	// Иная команда
	Иначе
		ЗарегистрироватьУведомление("Не найдена команда [" + ИдентификаторКоманды + "]", Истина);
		ОбработатьУведомления(Сервер);
		Возврат;
	КонецЕсли;
	
	Загрузить(Сервер);
КонецПроцедуры

Функция ЭтоРабочийИлиТорговыйДень(НачалоДня)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Календарь КАК Календарь
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата = &НачалоДня
		|	И ДанныеКалендаря.Календарь В (&КалендарьКотировок, ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)) 
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня);
	Запрос.УстановитьПараметр("КалендарьКотировок", ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"));
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Процедура Timeout(Секунды)
	КомандаWindows = "Timeout /T " + Строка(Секунды) + " /NoBreak";
	ЗапуститьПриложение(КомандаWindows,, Истина);
КонецПроцедуры

Функция ПолучитьПараметрыПодключения(Сервер, ТолькоSQL = Ложь)
	ПараметрыПодключения = Новый Структура;
	
	Если ТолькоSQL Тогда
		Если Найти(Сервер, "АП91") > 0 Тогда
			СтрокаСоединенияSQL = "Driver={SQL Server};Server=AP91.G1.LAN;UID=link_1C;PWD=12345;Database=ELM_AM";
		ИначеЕсли Найти(Сервер, "АП55") > 0 Тогда
			СтрокаСоединенияSQL = "Driver={SQL Server};Server=AP55.G1.LAN;UID=link_1C;PWD=EGAR_3;Database=ELM_ram";
		КонецЕсли;
	Иначе
		ПараметрыПодключения = РаботаСВнешнимиСистемами.EGAR_ПолучитьПараметрыПодключения(Сервер);
		
		Если ТипЗнч(ПараметрыПодключения) <> Тип("Структура") Тогда
			ЗарегистрироватьУведомление(ПараметрыПодключения, Истина);
			Возврат Неопределено;
		КонецЕсли;
		
		СтрокаСоединенияSQL = ПараметрыПодключения.СтрокаСоединенияSQL;
	КонецЕсли;
	
	СоединениеSQL = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(СтрокаСоединенияSQL);
	
	Если СоединениеSQL <> Неопределено Тогда
		ПараметрыПодключения.Вставить("СоединениеSQL", СоединениеSQL);
		Возврат ПараметрыПодключения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ЗарегистрироватьУведомление(Уведомление, Ошибка = Ложь)
	Если Ошибка Тогда
		Если ДопСвойства.Свойство("Источник") Тогда
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Уведомление, ЭтотОбъект.ДопСвойства.Источник);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Уведомление);
		КонецЕсли;
	Иначе
		Если Не ЭтотОбъект.ДопСвойства.Свойство("Уведомления") Тогда
			ЭтотОбъект.ДопСвойства.Вставить("Уведомления", Новый Массив());
		КонецЕсли;
		
		Если ЭтотОбъект.ДопСвойства.Уведомления.Найти(Уведомление) = Неопределено Тогда
			ЭтотОбъект.ДопСвойства.Уведомления.Добавить(Уведомление);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ОтправитьСообщениеОБумагахБезЦен(Портфели, ДатаЦенОценки, Сервер)
	ТекстСообщения = "";
	Для Каждого Портфель Из Портфели Цикл
		ТекстСообщения = ТекстСообщения +
			"<tr>
			|	<td>" + Портфель.Ключ + "</td>
			|<td>";
		Счетчик = 0;
		
		Для Каждого ЦБ Из Портфель.Значение Цикл
			//ТекстСообщения = ТекстСообщения + ЦБ +"; ";
			ТекстСообщения = ТекстСообщения + ?(Портфель.Значение.Найти(ЦБ) = Портфель.Значение.ВГраница(), ЦБ, ЦБ + ";");
			Счетчик = Счетчик + 1;
			Если Счетчик = 10 Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС;
				Счетчик = 0;
			КонецЕсли;
		КонецЦикла;
		ТекстСообщения = ТекстСообщения + "</td>
			|</tr>";
	КонецЦикла;
	
	Если ТекстСообщения <> "" Тогда
		#Область ТекстHTML
		ТекстСообщения =
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style type=""text/css"">
			|		body  { font: 10pt sans-serif; }
			|		table { text-align: left; border-spacing: 0; border-collapse: collapse; }
			|		td    { border: 1px solid #CCC085; padding: 5px; }
			|		.caption { font-weight: bolder; font-size: 12px; background: #F4ECC5; }
			|		.message { color: maroon; font-size: 14px; background: #F4ECC5; }
			|	</style>
			|</head>
			|<body>
			|<table cols=""2"">
			|<tr class=""message"">
			|<td colspan=""2"">Перечень ценных бумаг без цен с " + Формат(ДатаЦенОценки, "ДФ=dd.MM.yyyy") + " (УК " + Организация.ЮрФизЛицо.Наименование + ")</td>
			|</tr>
			|<tr class=""caption"">
			|	<td>Портфель (Код счета ДУ)</td>
			|	<td>ЦБ (Код matrix)</td>
			|</tr>"
			+ ТекстСообщения + "</table></body></html>";
 		#КонецОбласти
		
		РеквизитыОповещения = Новый Структура("Организация, Сервер, Текст, Пояснение", ЭтотОбъект.Организация, Сервер, ТекстСообщения, "Отчет о бумагах без цены переоценки.");
		Справочники.Оповещения.СформироватьОповещения("Обработка._ЭкспортВЕГАР", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	КонецЕсли;
КонецФункции

Процедура ОбработатьУведомления(Сервер, Источник = "")
	Если Не ЭтотОбъект.ДопСвойства.Свойство("Уведомления") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопСвойства.Свойство("Источник") Тогда
		Текст = "";
		
		Для Каждого ЭлементМассива Из ЭтотОбъект.ДопСвойства.Уведомления Цикл
			Текст = Текст + ?(Текст = "", "", "<br>") + ЭлементМассива;
		КонецЦикла;
		
		Если Текст <> "" Тогда
			Текст = "<html><head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8""></head><body><a>" + Текст + "</a></body></html>";
			
			РеквизитыОповещения = Новый Структура("Организация, Сервер, Текст, Пояснение", ЭтотОбъект.Организация, Сервер, Текст);
			ПолноеИмяИсточника = "Обработка._ЭкспортВЕГАР" + ?(Не ПустаяСтрока(Источник), "." + Источник, "");
			Справочники.Оповещения.СформироватьОповещения(ПолноеИмяИсточника, Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДопСвойства.Уведомления, Символы.ПС));
	КонецЕсли;
	
	ЭтотОбъект.ДопСвойства.Удалить("Уведомления");
КонецПроцедуры

Процедура ПроверитьНаличиеНепроведенныхДокументов(Сервер)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетыДанныхКОбработке.Текст КАК ТекстПисьма
		|ПОМЕСТИТЬ _ПисьмаКОтправке
		|ИЗ
		|	Справочник.ПакетыДанныхКОбработке КАК ПакетыДанныхКОбработке
		|ГДЕ
		|	ПакетыДанныхКОбработке.ДатаСоздания МЕЖДУ &ДатаВыгрузкиНачалоДня И &ДатаВыгрузкиКонецДня
		|	И ПакетыДанныхКОбработке.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо)
		|	И (ВЫРАЗИТЬ(ПакетыДанныхКОбработке.Тема КАК СТРОКА(100))) = ВЫРАЗИТЬ(&ТемаПисьма КАК СТРОКА(100))
		|	И НЕ ПакетыДанныхКОбработке.ОбработкаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналОперацийБэкОфиса.Организация.Наименование КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ЖурналОперацийБэкОфиса.ВидОперации) КАК ВидОперации,
		|	ЖурналОперацийБэкОфиса.Номер КАК Номер,
		|	ЖурналОперацийБэкОфиса.Сумма КАК Сумма,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|ГДЕ
		|	(ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ПереводДенежныхСредств
		|			ИЛИ ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ВводДенежныхСредств
		|			ИЛИ ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ВыводДенежныхСредств)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Записан)
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &ДатаВыгрузкиНачалоДня И &ДатаВыгрузкиКонецДня
		|	И ЖурналОперацийБэкОфиса.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаВыгрузкиКонецДня", КонецДня(ДатаВыгрузки));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТемаПисьма", "ЕГАР(" + Сервер + "). Данные о непроведенных вводах-выводах денежных средств.");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщения = "";
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "", "", "<br>") + "В 1С " + Выборка.Организация + ", портфель " + Выборка.КодСчетаДУ + ", документ """ + Выборка.ВидОперации + """ № " + Выборка.Номер + " на сумму " + Выборка.Сумма + " находится в состоянии ""ЗАПИСАН""";
	КонецЦикла;
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = "<html><head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8""></head><body><a>" + ТекстСообщения + "</a></body></html>";
		
		ПисьмаКОтправке = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПисьмаКОтправке"].ПолучитьДанные().Выгрузить();
		
		Для Каждого Письмо Из ПисьмаКОтправке Цикл
							
			Если СтрНайти(Письмо.ТекстПисьма, ТекстСообщения) > 0 Тогда	
				Возврат;	
			КонецЕсли;
			
		КонецЦикла;
		
		РеквизитыОповещения = Новый Структура("Организация, Сервер, Текст, Пояснение", ЭтотОбъект.Организация, Сервер, ТекстСообщения, "Данные о непроведенных вводах-выводах денежных средств.");
		Справочники.Оповещения.СформироватьОповещения("Обработка._ЭкспортВЕГАР", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
	
	КонецЕсли;
		
КонецПроцедуры

Функция ДатаJSON(Дата = Неопределено, Время = Неопределено)
	
	Если Дата = Неопределено Тогда
		Возврат(Формат(Время, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));//ДатаВремя
	Иначе
	    Возврат(Формат(Дата, "ДФ=""гггг-ММ-дд"""));
	КонецЕсли;
	
КонецФункции

Функция ЗаменитьНедопустимыеСимволы(Знач КодКлиента)

	НедопустимыеСимволы = """/\[]:;|=?*<>-";
	НедопустимыеСимволы = НедопустимыеСимволы + Символы.Таб;
	
	Для ПозицияСимвола = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		ПроверяемыйСимвол = Сред(НедопустимыеСимволы, ПозицияСимвола, 1);
		КодКлиента = СтрЗаменить(КодКлиента, ПроверяемыйСимвол, "_");
	КонецЦикла;
	
	Возврат КодКлиента;

КонецФункции

Функция ЧислоJSON(Число)
	
	Если Число = 0 Тогда
		Возврат 0;
	Иначе
		Возврат(Формат(Число, "ЧРД=.; ЧГ=0"));
	КонецЕсли;
	
КонецФункции

Функция СформироватьAssetFlows(Выборка)
	id                 = СокрЛП(Выборка.id);
	Обязательство      = Новый Структура();
	МассивОбязательств = Новый Массив;
	НомерОбязательства = 1;
	
	Если СтрНайти(Выборка.Comment, "Сделка") Тогда
		// Обязательство по бумагам
		Обязательство.Вставить("tradeId", id);
		Обязательство.Вставить("id", id + "_" + НомерОбязательства);
		Обязательство.Вставить("type", "PH"); // Для Бумаг
		Обязательство.Вставить("instrumentId", Выборка.instrumentId);
		Обязательство.Вставить("amount", ?(Выборка.side = "B", Формат(Выборка.quantity, "ЧРД=.; ЧГ=0"),-Формат(Выборка.quantity, "ЧРД=.; ЧГ=0"))); // Покупка с "+", продажа с "-"
		Обязательство.Вставить("date", ДатаJSON(Выборка.tradeDate)); // Дата сделки
		Обязательство.Вставить("executionDate", ДатаJSON(Выборка.deliveryDate)); // Дата поставки
		Обязательство.Вставить("isFactual", 1);
		Обязательство.Вставить("counterpartyId", Выборка.counterpartyId);
		Обязательство.Вставить("portfolioId", Выборка.portfolioId);
		МассивОбязательств.Добавить(Обязательство);
		
		// Обязательство по оплате
		Обязательство = Новый Структура();
		НомерОбязательства = НомерОбязательства + 1;
		Обязательство.Вставить("tradeId", id);
		Обязательство.Вставить("id", id + "_" + НомерОбязательства);
		Обязательство.Вставить("type", "CLCM"); // Для денег
		Обязательство.Вставить("currencyCode", Выборка.paymentCurrencyCode);
		Обязательство.Вставить("amount", Формат(Выборка.paymentAssetFlows, "ЧРД=.; ЧГ=0")); // Деньги покупка с "-", продажа с "+"
		Обязательство.Вставить("date", ДатаJSON(Выборка.tradeDate));// Дата сделки
		Обязательство.Вставить("executionDate", ДатаJSON(Выборка.paymentDate));// Дата поставки
		Обязательство.Вставить("isFactual", 1);
		Обязательство.Вставить("counterpartyId", Выборка.moneyCounterpartyId); // Нужно указать счет где хранятся деньги
		Обязательство.Вставить("portfolioId", Выборка.portfolioId); // Клиент
		МассивОбязательств.Добавить(Обязательство);
		
		// Обязательство по комиссии
		Если Выборка.ТорговаяКомиссия <> 0 Тогда
			Обязательство = Новый Структура();
			НомерОбязательства = НомерОбязательства + 1;
			Обязательство.Вставить("tradeId", id);
			Обязательство.Вставить("id", id + "_" + НомерОбязательства);
			Обязательство.Вставить("type", "BRCM"); // Для комиссий
			Обязательство.Вставить("currencyCode", Выборка.ВалютаТорговойКомиссии);
			Обязательство.Вставить("amount", Формат(Выборка.ТорговаяКомиссия, "ЧРД=.; ЧГ=0"));
			Обязательство.Вставить("date", ДатаJSON(Выборка.tradeDate)); // Дата сделки
			Обязательство.Вставить("executionDate", ДатаJSON(Выборка.ДатаОплатыТорговойКомиссии));// Дата оплаты
			Обязательство.Вставить("isFactual", 1);
			Обязательство.Вставить("counterpartyId", Выборка.moneyCounterpartyId); // Нужно указать счет где хранятся деньги
			Обязательство.Вставить("portfolioId", Выборка.portfolioId); // Клиент
			МассивОбязательств.Добавить(Обязательство);
		КонецЕсли;
		
		Если Выборка.КомиссияБрокера <> 0 Тогда
			Обязательство = Новый Структура();
			НомерОбязательства = НомерОбязательства + 1;
			Обязательство.Вставить("tradeId", id);
			Обязательство.Вставить("id", id + "_" + НомерОбязательства);
			Обязательство.Вставить("type", "BRCM"); // Для комиссий
			Обязательство.Вставить("currencyCode", Выборка.ВалютаКомиссииБрокера);
			Обязательство.Вставить("amount", Формат(Выборка.КомиссияБрокера, "ЧРД=.; ЧГ=0"));
			Обязательство.Вставить("date", ДатаJSON(Выборка.tradeDate)); // Дата сделки
			Обязательство.Вставить("executionDate", ДатаJSON(Выборка.ДатаОплатыКомиссииБрокера)); // Дата оплаты
			Обязательство.Вставить("isFactual", 1);
			Обязательство.Вставить("counterpartyId", Выборка.moneyCounterpartyId); //Нужно указать счет где хранятся деньги
			Обязательство.Вставить("portfolioId", Выборка.portfolioId); // Клиент
			МассивОбязательств.Добавить(Обязательство);
		КонецЕсли;
		
		Возврат(МассивОбязательств);
		
	ИначеЕсли СтрНайти(Выборка.Comment, "Депозит") Тогда
		Обязательство.Вставить("tradeId", id);
		Обязательство.Вставить("id", id + "_" + НомерОбязательства);
		Обязательство.Вставить("type", Выборка.assetFlowsType);
		Обязательство.Вставить("currencyCode", Выборка.instrumentId);
		Обязательство.Вставить("amount", Формат(Выборка.СтоимостьДепозитаНаДатуВыгрузки, "ЧРД=.; ЧГ=0; ЧДЦ=0"));
		Обязательство.Вставить("date", ДатаJSON(ДатаВыгрузки));
		Обязательство.Вставить("executionDate", ДатаJSON(ДатаВыгрузки));
		Обязательство.Вставить("isFactual", 1);
		Обязательство.Вставить("counterpartyId", Выборка.counterpartyId);
		Обязательство.Вставить("portfolioId", Выборка.portfolioId);
		МассивОбязательств.Добавить(Обязательство);
		
		// Обязательство к депозиту с суммой резерва под обесценение
		Если Выборка.СуммаРезерва <> 0 Тогда
			Обязательство = Новый Структура();
			НомерОбязательства = НомерОбязательства + 1;
			
			Обязательство.Вставить("tradeId", id);
			Обязательство.Вставить("id", id + "_" + НомерОбязательства);
			Обязательство.Вставить("type", "RES");
			Обязательство.Вставить("currencyCode", Выборка.instrumentId);
			Обязательство.Вставить("amount", Формат(Выборка.СуммаРезерва, "ЧРД=.; ЧГ=0; ЧДЦ=0"));
			Обязательство.Вставить("date", ДатаJSON(ДатаВыгрузки));
			Обязательство.Вставить("executionDate", ДатаJSON(ДатаВыгрузки));
			Обязательство.Вставить("isFactual", 1);
			Обязательство.Вставить("counterpartyId", Выборка.counterpartyId);
			Обязательство.Вставить("portfolioId", Выборка.portfolioId);
			МассивОбязательств.Добавить(Обязательство);
		КонецЕсли;
		
		Если Выборка.ФлагВыплатыПроцентовАвансом Тогда // Выгружаем одно обязательства с суммой номинала и резервом
			Возврат(МассивОбязательств);
		КонецЕсли;
		
		// Здесь формируется пять обязательств к депозиту с суммой процентов начисленных за один день (T+1, ...., T+5)
		ДатаОбязательства = КонецДня(ДатаВыгрузки) + 1;
		ДатаЗакрытияДепозита = НачалоДня(Выборка.expirationDate);
		
		Для Счетчик = 1 По 5 Цикл
			Если ДатаОбязательства > ДатаЗакрытияДепозита Тогда
				Возврат(МассивОбязательств);
			КонецЕсли;
			Обязательство = Новый Структура();
			Обязательство.Вставить("tradeId", id);
			Обязательство.Вставить("id", id + "_T+" + Счетчик);
			Обязательство.Вставить("type", Выборка.assetFlowsType);
			Обязательство.Вставить("currencyCode", Выборка.instrumentId);
			
			// Если дата обязательства перешла в следующий год, а в нем другое количество дней
			Если Год(ДатаОбязательства) = Год(ДатаВыгрузки) Тогда
				Обязательство.Вставить("amount", Формат(Выборка.СуммаПроцентовВДень, "ЧРД=.; ЧГ=0"));
			Иначе
				Обязательство.Вставить("amount", Формат(Выборка.СуммаПроцентовВДень_ТПлюсПять, "ЧРД=.; ЧГ=0"));
			КонецЕсли;
			
			Обязательство.Вставить("date", ДатаJSON(ДатаВыгрузки));
			Обязательство.Вставить("executionDate", ДатаJSON(ДатаОбязательства));
			Обязательство.Вставить("isFactual", 1);
			Обязательство.Вставить("counterpartyId", Выборка.counterpartyId);
			Обязательство.Вставить("portfolioId", Выборка.portfolioId);
			
			ДатаОбязательства = ДатаОбязательства + 86400;
			МассивОбязательств.Добавить(Обязательство);
		КонецЦикла;
		
		Возврат(МассивОбязательств);
	Иначе
		// Формируется обязательство для остатков по ЦБ и ДС. Для депозитов формируется сделка на дату закрытия.
		Если СтрНайти(Выборка.Comment, "ЦБ") Тогда
			Обязательство.Вставить("instrumentId", Выборка.instrumentId);
		Иначе
			Обязательство.Вставить("currencyCode", Выборка.priceCurrencyCode);
		КонецЕсли;
		
		Обязательство.Вставить("amount", Формат(Выборка.quantity, "ЧРД=.; ЧГ=0"));
		Обязательство.Вставить("tradeId", id);
		Обязательство.Вставить("id", id + "_" + НомерОбязательства);
		Обязательство.Вставить("type", Выборка.assetFlowsType);
		Обязательство.Вставить("date", ДатаJSON(Выборка.tradeDate));
		Обязательство.Вставить("executionDate", ДатаJSON(Выборка.paymentDate));
		Обязательство.Вставить("isFactual", 1);
		Обязательство.Вставить("counterpartyId", Выборка.counterpartyId);
		Обязательство.Вставить("portfolioId", Выборка.portfolioId);
		
		МассивОбязательств.Добавить(Обязательство);
		Возврат(МассивОбязательств);
	КонецЕсли;
КонецФункции

Функция СформироватьЗапрос(Выборка)
	Запрос = Новый Структура();
	
	// transactionId нужен для сделок Репо для связки двух частей.
	Если Не ПустаяСтрока(Выборка.transactionId) Тогда
		Запрос.Вставить("transactionId", Выборка.transactionId);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Выборка.tradingFloorId) Тогда
		Запрос.Вставить("tradingFloorId", Выборка.tradingFloorId);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Выборка.productCode) Тогда
		Запрос.Вставить("productCode", Выборка.productCode); //Место хранения ДС
	КонецЕсли;
	
	Если Не ПустаяСтрока(Выборка.tradingModeId) Тогда
		Запрос.Вставить("tradingModeId", Выборка.tradingModeId); //Тип борда (режим торгов)
	КонецЕсли;
	
	Если Не ПустаяСтрока(Выборка.expirationDate) Тогда
		Запрос.Вставить("expirationDate", ДатаJSON(Выборка.expirationDate));//Дата окончания срока депозита, оферта-продажа
	КонецЕсли;
	
	//Для депозитов выгружаем сделку на дату закрытия депозита, если дата выгрузки больше даты закрытия - сообщим об этом. 
	Если Выборка.comment = "loan_ДС" И Выборка.expirationDate < ДатаВыгрузки Тогда
		ЗарегистрироватьУведомление("У клиента [" + Выборка.portfolioId + "] истек срок действия депозита. Закрывающая сделка депозита [" + Выборка.id + "]!");
	КонецЕсли;
	
	Запрос.Вставить("id", СокрЛП(Выборка.id));
	Запрос.Вставить("isBalance", Выборка.isBalance);
	Запрос.Вставить("systemCode", Выборка.systemCode);
	Запрос.Вставить("tradeDate", ДатаJSON(Выборка.tradeDate));
	Запрос.Вставить("tradeDateTime", ДатаJSON(,Выборка.tradeDateTime));//нужно указать время сделки
	Запрос.Вставить("paymentDate", ДатаJSON(Выборка.paymentDate));
	Запрос.Вставить("deliveryDate", ДатаJSON(Выборка.deliveryDate));
	Запрос.Вставить("price", ЧислоJSON(Выборка.price)); // Для Остатков ЦБ - оценочная цена(среденевзвешенная), для Сделок - цена за 1 шт. ЦБ	
	Запрос.Вставить("portfolioId", Выборка.portfolioId); //КодСчетаДУ
	Запрос.Вставить("instrumentId", Выборка.instrumentId);
	Запрос.Вставить("counterpartyId", Выборка.counterpartyId);
	Запрос.Вставить("quantity", Формат(Выборка.quantity, "ЧРД=.; ЧГ=0"));
	Запрос.Вставить("payment", Формат(Выборка.payment, "ЧРД=.; ЧГ=0"));  //Для сделок - полная сумма сделки (сумма сделки + комиссии)
	
	Если Не ПустаяСтрока(Выборка.depositaryId) Тогда
		Запрос.Вставить("depositaryId", Выборка.depositaryId);
	КонецЕсли;
	
	Запрос.Вставить("customerId", ?(КодыПифов.Получить(Выборка.customerId) = Неопределено, Выборка.customerId, КодыПифов.Получить(Выборка.customerId)));
	Запрос.Вставить("paymentCurrencyCode", Выборка.paymentCurrencyCode);
	Запрос.Вставить("priceCurrencyCode", Выборка.priceCurrencyCode);
	Запрос.Вставить("traderId", Выборка.traderId);
	Запрос.Вставить("lastTraderId", Выборка.lastTraderId);
	Запрос.Вставить("legNumber", Выборка.legNumber); //Для РЕПО указываем часть сделки
	Запрос.Вставить("accruedInterest", ЧислоJSON(Выборка.accruedInterest));//НКД 1 шт.
	Запрос.Вставить("dirtyPrice", ЧислоJSON(Выборка.dirtyPrice));
	
	Запрос.Вставить("branchId", ?(КодыПифов.Получить(Выборка.branchId) = Неопределено, Выборка.branchId, КодыПифов.Получить(Выборка.branchId)));
	Запрос.Вставить("scope", Выборка.scope);
	Запрос.Вставить("type", Выборка.type);
	Запрос.Вставить("interestRate", ЧислоJSON(Выборка.interestRate));//Процентная ставка по депозиту
	Запрос.Вставить("settlementType", Выборка.settlementType); //Для сделок - DVP
	Запрос.Вставить("side", Выборка.side);
	Запрос.Вставить("bOStatus", Выборка.bOStatus);
	Запрос.Вставить("operDate", ДатаJSON(ТекущаяДата()));
	Запрос.Вставить("isSkipDetails", Выборка.isSkipDetails);
	Запрос.Вставить("objectType", Выборка.objectType);
	Если Не ПустаяСтрока(Выборка.originId) Тогда
		Запрос.Вставить("originId", Выборка.originId);
	КонецЕсли;
	
	Запрос.Вставить("comment", Выборка.comment);
	Запрос.Вставить("status", "A"); //Статус сделки
	Запрос.Вставить("assetFlows", СформироватьAssetFlows(Выборка));
	
	Если ПустаяСтрока(Выборка.id) Тогда
		ЗарегистрироватьУведомление("В портфеле [" + Выборка.portfolioId + "] присутствует сделка с типом [" + Выборка.type + "] без ID");
	КонецЕсли;
	
	Возврат(Запрос);
КонецФункции

Функция ПолучитьСтрокуJSON(Данные)
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Возврат СтрокаJSON;
	Исключение
		Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = Новый УникальныйИдентификатор;
		Запись.ХранилищеЗначения = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
		Запись.Комментарий = "Экспорт в ЕГАР. Не удалось записать JSON";
		Запись.Записать();
		
		ЗарегистрироватьУведомление("Не удалось записать JSON" + Символы.ПС + Запись.Идентификатор, Истина);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПолучитьТаблицуВыгруженныхСделок(Соединение, ДанныеДляСтатистики)
	ГоловнаяОрганизация = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(Организация.ЮрФизЛицо, ДатаВыгрузки);
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		ЮрЛицоОрганизации = ГоловнаяОрганизация;
	Иначе
		ЮрЛицоОрганизации = Организация.ЮрФизЛицо;
	КонецЕсли;
	
	МатрихКодКомпании = ПолучитьМатрихКод(ЮрЛицоОрганизации);
	
	// Исключение SpotForward по Акциям (EQ), потому что они обрабатываются по группам.
	//	Если исключить сделку из этого запроса, то при выгрузке новых сделок не будет найдено совпадений с существующей,
	//	и новая сделка будет выгружена, затерев прошлую с таким же ID при её наличии.
	// Для соединения со сделками с Терминала (от Перехватчика, "ME#") будет использовано поле ORIGIN_ID.
	// Для сделок из Матрикса SYSTEM_CODE пустой, но по шаблону ID сделки "MX%" мы понимаем, что должен быть SYSTEM_CODE "MX".
	ЗапросSQL =
		"SELECT
		|	CASE
		|		WHEN T.ID LIKE 'MX%'
		|		THEN SUBSTRING(T.ID, CHARINDEX('-', T.ID) + 1, LEN(T.ID) - 5)
		|		ELSE T.ID
		|	END ID,
		|	T.ORIGIN_ID AS ORIGIN_ID,
		|	CASE
		|		WHEN ISNULL(T.SYSTEM_CODE, '') = '' AND T.ID LIKE 'MX%'
		|		THEN 'MX'
		|		ELSE T.SYSTEM_CODE
		|	END AS SYSTEM_CODE,
		|	CAST(T.QUANTITY AS DEC(19, 4)) AS QUANTITY,
		|	CAST(T.PRICE AS DEC(19, 10)) AS PRICE,
		|	T.PRODUCT_CODE AS PRODUCT_CODE,
		|	CASE
		|		WHEN T.COMMENT IS NULL
		|		THEN CASE
		|			WHEN T.[TYPE] = 'REP'
		|			THEN 'СделкаРепо'
		|			ELSE 'Сделка'
		|		END
		|		ELSE T.COMMENT
		|	END COMMENT
		|FROM [LZ_TRADES] AS T
		|	LEFT JOIN [LZ_PORTFOLIOS] AS P ON T.PORTFOLIO_ID = P.ID
		|	LEFT JOIN [LZ_COUNTERPARTIES] AS C ON P.COUNTERPARTY_ID = C.ID
		|	LEFT JOIN [LZ_INSTRUMENTS] AS I ON T.INSTRUMENT_ID = I.ID
		|-- Перехватчик пока ещё выдаёт сделки ""ME#"" с указанием компании ""Регион Траст""
		|WHERE (C.EXTERNAL_ID = '" + МатрихКодКомпании + "' OR C.EXTERNAL_ID = 220007)
		|	AND (T.ID LIKE 'MX%' OR T.SYSTEM_CODE IN ('ME', '1C'))
		|	AND NOT (I.[TYPE] = 'EQ' AND T.[TYPE] = 'SPF' AND T.SYSTEM_CODE = 'ME')";
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ТипыКолонок.Вставить("ORIGIN_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	ТипыКолонок.Вставить("SYSTEM_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)));
	ТипыКолонок.Вставить("QUANTITY", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("PRICE", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("PRODUCT_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)));
	ТипыКолонок.Вставить("COMMENT", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	
	СтартЗапуска = ТекущаяДатаСеанса();
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение.СоединениеSQL, ЗапросSQL);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ТаблицаСделок = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей, ТипыКолонок);
		
		Если ТаблицаСделок = Неопределено Тогда
			ТаблицаСделок = Новый ТаблицаЗначений;
			ТаблицаСделок.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)), "ID");
			ТаблицаСделок.Колонки.Добавить("ORIGIN_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)), "ORIGIN_ID");
			ТаблицаСделок.Колонки.Добавить("SYSTEM_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)), "SYSTEM_CODE");
			ТаблицаСделок.Колонки.Добавить("QUANTITY", Новый ОписаниеТипов("Число"), "QUANTITY");
			ТаблицаСделок.Колонки.Добавить("PRICE", Новый ОписаниеТипов("Число"), "PRICE");
			ТаблицаСделок.Колонки.Добавить("PRODUCT_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(2)), "PRODUCT_CODE");
			ТаблицаСделок.Колонки.Добавить("COMMENT", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)), "COMMENT");
		КонецЕсли;
		
		ДанныеДляСтатистики.Вставить("SQL_ЗапросКЕгару_Операции", "Время выполнения запроса: "
			+ РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + Строка(ТаблицаСделок.Количество()) + ".");
		
		Возврат ТаблицаСделок;
	КонецЕсли;
КонецФункции

Функция ПолучитьМатрихКод(ЮрЛицо)
	Отбор = Новый Структура("ВнешняяСистема, ГруппаОбъектов, Объект",
		Справочники.ВнешниеСистемы.Матрих, Справочники.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица, ЮрЛицо);
	ЗаписьРегистра = РегистрыСведений.КодыВоВнешнихСистемах.СрезПоследних(ДатаВыгрузки, Отбор);
	Возврат ЗаписьРегистра[0].Код;
КонецФункции

Функция ПолучитьМенеджерВременныхТаблиц(РанееВыгруженныеОперации, ДанныеДляСтатистики)
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата МЕЖДУ &МинусДваРабочихДня И &ДатаВыгрузкиНачалоДня
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки);
	Запрос.УстановитьПараметр("МинусДваРабочихДня", Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ДатаВыгрузки, -3));
	Запрос.Выполнить();

#Область СТОИМОСТЬ_ПЕРЕОЦЕНКИ
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.Организация КАК Организация,
		|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	СтоимостьПереоценки.Сумма КАК Сумма,
		|	СтоимостьПереоценки.Цена КАК Цена,
		|	СтоимостьПереоценки.Количество КАК Количество 
		|ПОМЕСТИТЬ _СтоимостьПереоценки
		|ИЗ
		|	_ДанныеКалендаря КАК _ДанныеКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО _ДанныеКалендаря.Дата = СтоимостьПереоценки.Период
		|			И (СтоимостьПереоценки.Организация = &Организация)
		|			И (СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|			И (СтоимостьПереоценки.ЦельРасчета В (ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.КонтрольИнвестиционнойДекларации), ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)))";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	СтартЗапуска = ТекущаяДатаСеанса();
	Запрос.Выполнить();
	ДанныеДляСтатистики.Вставить("ЗапросПолученияЦенСтоимостиПереоценки", "Время выполнения запроса: " + РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + МВТ.Таблицы["_СтоимостьПереоценки"].ПолучитьДанные().Выбрать().Количество());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СобственныйПортфель
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, Клиент = &ЮрЛицоОрганизации) КАК КлиентыДоверительногоУправленияСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтоимостьПереоценки.Организация КАК Организация,
		|	_СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СтоимостьПереоценки.Период КАК Дата,
		|	_СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СтоимостьПереоценки.Рынок КАК Рынок,
		|	_СтоимостьПереоценки.Сумма КАК Сумма,
		|	_СтоимостьПереоценки.Цена КАК Цена,
		|	_СтоимостьПереоценки.Количество КАК Количество
		|ПОМЕСТИТЬ _СтоимостьАктивовСобственногоПортфеля
		|ИЗ
		|	_СтоимостьПереоценки КАК _СтоимостьПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СобственныйПортфель КАК _СобственныйПортфель
		|		ПО _СтоимостьПереоценки.СчетДоверительногоУправления = _СобственныйПортфель.СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", Организация.ЮрФизЛицо);
	Запрос.Выполнить();
	
	Если МВТ.Таблицы["_СтоимостьАктивовСобственногоПортфеля"].ПолучитьДанные().Выбрать().Количество() = 0 Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьПереоценкиСрезПоследних.Организация,
			|	СтоимостьПереоценкиСрезПоследних.СчетДоверительногоУправления,
			|	СтоимостьПереоценкиСрезПоследних.Период,
			|	СтоимостьПереоценкиСрезПоследних.ЦеннаяБумага,
			|	СтоимостьПереоценкиСрезПоследних.Рынок КАК Рынок,
			|	СтоимостьПереоценкиСрезПоследних.Сумма КАК Сумма,
			|	СтоимостьПереоценкиСрезПоследних.Цена КАК Цена,
			|	СтоимостьПереоценкиСрезПоследних.Количество КАК Количество
			|ПОМЕСТИТЬ _СтоимостьАктивовСобственногоПортфеляСрезПоследних
			|ИЗ
			|	РегистрСведений.СтоимостьПереоценки.СрезПоследних(
			|			&ДатаВыгрузкиНачалоДня,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления В
			|					(ВЫБРАТЬ
			|						_СобственныйПортфель.СчетДоверительногоУправления
			|					ИЗ
			|						_СобственныйПортфель)
			|				И ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
			|				И ЦельРасчета В (ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.КонтрольИнвестиционнойДекларации), ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))) КАК СтоимостьПереоценкиСрезПоследних";
		
		СтартЗапуска = ТекущаяДатаСеанса();
		Запрос.Выполнить();
		ДанныеДляСтатистики.Вставить("ЗапросПолученияЦенСтоимостиПереоценкиСобственногоПортфеля", "Время выполнения запроса: " + РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + МВТ.Таблицы["_СтоимостьАктивовСобственногоПортфеляСрезПоследних"].ПолучитьДанные().Выбрать().Количество());
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Период КАК Дата,
			|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
			|			ТОГДА СРЕДНЕЕ(ВложенныйЗапрос.Сумма)
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Цена) > 1
			|					ТОГДА СУММА(ВложенныйЗапрос.Сумма) / СУММА(ВложенныйЗапрос.Количество)
			|				ИНАЧЕ СРЕДНЕЕ(ВложенныйЗапрос.Цена)
			|			КОНЕЦ
			|	КОНЕЦ КАК Цена
			|ПОМЕСТИТЬ _ЦеныОценки
			|ИЗ
			|	(ВЫБРАТЬ
			|		_СтоимостьПереоценки.Организация КАК Организация,
			|		_СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|		_СтоимостьПереоценки.Период КАК Период,
			|		_СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|		_СтоимостьПереоценки.Рынок КАК Рынок,
			|		_СтоимостьПереоценки.Сумма КАК Сумма,
			|		_СтоимостьПереоценки.Цена КАК Цена,
			|		_СтоимостьПереоценки.Количество КАК Количество
			|	ИЗ
			|		_СтоимостьПереоценки КАК _СтоимостьПереоценки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Организация,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.СчетДоверительногоУправления,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Период,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.ЦеннаяБумага,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Рынок,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Сумма,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Цена,
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних.Количество
			|	ИЗ
			|		_СтоимостьАктивовСобственногоПортфеляСрезПоследних КАК _СтоимостьАктивовСобственногоПортфеляСрезПоследних) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.СчетДоверительногоУправления,
			|	ВложенныйЗапрос.Период,
			|	ВложенныйЗапрос.ЦеннаяБумага,
			|	ВложенныйЗапрос.Рынок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _СобственныйПортфель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _СтоимостьАктивовСобственногоПортфеля
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _СтоимостьАктивовСобственногоПортфеляСрезПоследних";
		
		Запрос.Выполнить();
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СтоимостьПереоценки.Организация КАК Организация,
			|	_СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СтоимостьПереоценки.Период КАК Дата,
			|	_СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _СтоимостьПереоценки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
			|			ТОГДА СРЕДНЕЕ(_СтоимостьПереоценки.Сумма)
			|		ИНАЧЕ ВЫБОР
			|				КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СтоимостьПереоценки.Цена) > 1
			|					ТОГДА СУММА(_СтоимостьПереоценки.Сумма) / СУММА(_СтоимостьПереоценки.Количество)
			|				ИНАЧЕ СРЕДНЕЕ(_СтоимостьПереоценки.Цена)
			|			КОНЕЦ
			|	КОНЕЦ КАК Цена
			|ПОМЕСТИТЬ _ЦеныОценки
			|ИЗ
			|	_СтоимостьПереоценки КАК _СтоимостьПереоценки
			|
			|СГРУППИРОВАТЬ ПО
			|	_СтоимостьПереоценки.Организация,
			|	_СтоимостьПереоценки.СчетДоверительногоУправления,
			|	_СтоимостьПереоценки.Период,
			|	_СтоимостьПереоценки.ЦеннаяБумага,
			|	_СтоимостьПереоценки.Рынок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _СтоимостьАктивовСобственногоПортфеля";
		
		Запрос.Выполнить();
	КонецЕсли;
#КонецОбласти
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееВыгруженныеОперации.ID КАК ID,
		|	РанееВыгруженныеОперации.ORIGIN_ID КАК ORIGIN_ID,
		|	РанееВыгруженныеОперации.SYSTEM_CODE КАК SYSTEM_CODE,
		|	РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	РанееВыгруженныеОперации.PRODUCT_CODE КАК PRODUCT_CODE,
		|	РанееВыгруженныеОперации.COMMENT КАК COMMENT
		|ПОМЕСТИТЬ _РанееВыгруженныеОперации
		|ИЗ
		|	&РанееВыгруженныеОперации КАК РанееВыгруженныеОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(_ДанныеКалендаря.Дата) КАК Дата
		|ПОМЕСТИТЬ _МинусДваРабочихДня
		|ИЗ
		|	_ДанныеКалендаря КАК _ДанныеКалендаря
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Паи.Ссылка КАК ПайСсылка,
		|	ФинансовыеПоказателиСрезПоследних.Значение КАК СтоимостьПая
		|ПОМЕСТИТЬ _ФинПоказателиПаев
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели.СрезПоследних(&ДатаВыгрузкиНачалоДня, ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)) КАК ФинансовыеПоказателиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = Паи.ПаевойИнвестиционныйФонд
		|		ПО ФинансовыеПоказателиСрезПоследних.СубъектАналитики = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ФинансовыеПоказателиСрезПоследних.Значение <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦеныОценки.Дата КАК Дата,
		|	_ЦеныОценки.Организация КАК Организация,
		|	_ЦеныОценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЦеныОценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ФинПоказателиПаев.СтоимостьПая, _ЦеныОценки.Цена) КАК Цена
		|ПОМЕСТИТЬ _ЦеныОценкиАктивов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЦеныОценки.Организация КАК Организация,
		|		_ЦеныОценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ЦеныОценки.Дата) КАК Дата,
		|		_ЦеныОценки.ЦеннаяБумага КАК ЦеннаяБумага
		|	ИЗ
		|		_ЦеныОценки КАК _ЦеныОценки
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ЦеныОценки.Организация,
		|		_ЦеныОценки.СчетДоверительногоУправления,
		|		_ЦеныОценки.ЦеннаяБумага) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЦеныОценки КАК _ЦеныОценки
		|		ПО ВложенныйЗапрос.Организация = _ЦеныОценки.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ЦеныОценки.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|			И ВложенныйЗапрос.Дата = _ЦеныОценки.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинПоказателиПаев КАК _ФинПоказателиПаев
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = _ФинПоказателиПаев.ПайСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов
		|ПОМЕСТИТЬ _КодыМатрих
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&ДатаВыгрузкиНачалоДня,
		|			(ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|				ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ИпотечныеСертификатыУчастия))
		|				И ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка КАК ВалютаСсылка,
		|	ЕСТЬNULL(_КодыМатрих.Код, Валюты.Наименование) КАК МатрихКодВалюты
		|ПОМЕСТИТЬ _Валюты
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрих
		|		ПО Валюты.Ссылка = _КодыМатрих.Объект
		|			И (_КодыМатрих.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Валюты))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДефолтыПоОблигациямСрезПоследних.Период КАК Период,
		|	ДефолтыПоОблигациямСрезПоследних.Облигация КАК Облигация
		|ПОМЕСТИТЬ _ДефолтыПоОблигациям
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипДефолта В (ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации), ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.КупонныеВыплаты))) КАК ДефолтыПоОблигациямСрезПоследних
		|ГДЕ
		|	ДефолтыПоОблигациямСрезПоследних.СтатусДефолта В (ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт), ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.ТехническийДефолт))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ФинПоказателиПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеКалендаря
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЦеныОценки";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("РанееВыгруженныеОперации", РанееВыгруженныеОперации);
	
	СтартЗапуска = ТекущаяДатаСеанса();
	Запрос.Выполнить();
	ДанныеДляСтатистики.Вставить("ЗапросПолученияКодовМатрикс", "Время выполнения запроса: " + РассчитатьВремя(СтартЗапуска) + ".");
	
	Возврат МВТ;
КонецФункции

Процедура ОбработатьРезультатЗапроса(Выборка, СделкиДляВыгрузки, СделкиДляУдаления = Неопределено, Сервер = Неопределено)
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаЦенОценки = Неопределено;
	БумагиБезЦенОценки = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		ПортфельКлюч = "Портфель_" + ЗаменитьНедопустимыеСимволы(Выборка.portfolioId);
		
		// Не у всех выборок есть это поле, поэтому пока что через исключение
		СравнениеСДругойСистемой = Ложь;
		Попытка
			СравнениеСДругойСистемой = Выборка.СравнениеСДругойСистемой;
		Исключение
		КонецПопытки;
		
		// Исключаем ранее выгруженные сделки. Формируем массив сделок для удаления.
		//	Если ранее выгруженная сделка из 1С, то нет смысла её удалять, ведь всё равно создадим такую же.
		Сообщить("Информация о сделке: id = " + Выборка.id + "; Выборка.ФлагВыгрузки = " + Выборка.ФлагВыгрузки
			+ "; СравнениеСДругойСистемой = " + СравнениеСДругойСистемой + "; Выборка.ИДСделкиДляУдаления = " + Выборка.ИДСделкиДляУдаления
			+ "; ORIGIN_ID = " + Выборка.originId + " (" + Строка(ТипЗнч(Выборка.originId)) + ")");
		Если Выборка.originId <> "" Тогда
			Попытка
				Сообщить("РанееID: " + Выборка.РанееID + "; РанееSYSTEM_CODE: " + Выборка.РанееSYSTEM_CODE + "; РанееORIGIN_ID: " + Выборка.РанееORIGIN_ID);
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если Не Выборка.ФлагВыгрузки Или СравнениеСДругойСистемой Тогда
			Если Выборка.ИДСделкиДляУдаления <> NULL Тогда
				СделкиДляУдаления.Добавить(СокрЛП(Выборка.ИДСделкиДляУдаления));
				Сообщить("Обработка сделки """ + Выборка.id + """. Будет удалена сделка: " + СокрЛП(Выборка.ИДСделкиДляУдаления));
			КонецЕсли;
		КонецЕсли;
		
		// Если нужно только удалить, то переходим к следующей сделке
		Если Не Выборка.ФлагВыгрузки Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.comment = "ПогашениеДС" И Выборка.ФлагОтсутствияОплаты Тогда
			ЗарегистрироватьУведомление("У клиента [" + Выборка.portfolioId + "] отсутствует оплата НКД по бумаге ["
				+ Выборка.МатрихКодЦБ +"]. Прошло более 3 дней от ожидаемой даты оплаты!");
		КонецЕсли;
		
		// Для НПФов проверяем наличие бумаг без цен оценки
		Если Выборка.comment = "ОстатокЦБ" И Выборка.СообщитьОбОтсутствииЦены Тогда
			ДатаЦенОценки = Выборка.ДатаЦенОценки;
			
			Если Не БумагиБезЦенОценки.Свойство(ПортфельКлюч) Тогда
				БумагиБезЦенОценки.Вставить(ПортфельКлюч, Новый Массив());
			КонецЕсли;
			
			БумагиБезЦенОценки[ПортфельКлюч].Добавить(Выборка.instrumentId);
		КонецЕсли;
		
		Если ПустаяСтрока(Выборка.id) Тогда
			Если Час(ТекущаяДата()) < 11 Тогда
				//Такая фигня бывает когда некорректно заведены документы.
				ЗарегистрироватьУведомление("При формировании запроса в ЕГАР обнаружена операция [" + Выборка.comment
					+ "] без ID в портфеле [" + Выборка.portfolioId + "] на сумму [" + Выборка.quantity + "].");
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если Не СделкиДляВыгрузки.Свойство(ПортфельКлюч) Тогда
			СделкиДляВыгрузки.Вставить(ПортфельКлюч, Новый Массив());
		КонецЕсли;
		
		ЗапросВЕгар = СформироватьЗапрос(Выборка);
		
		Если ЗначениеЗаполнено(ЗапросВЕгар) Тогда
			СделкиДляВыгрузки[ПортфельКлюч].Добавить(ЗапросВЕгар);
			Сообщить("Обработка сделки """ + Выборка.id + """. Будет создана сделка.");
		КонецЕсли;
	КонецЦикла;
	
	Если БумагиБезЦенОценки.Количество() > 0 И ДопСвойства.Свойство("Источник") Тогда
		ОтправитьСообщениеОБумагахБезЦен(БумагиБезЦенОценки, ДатаЦенОценки, Сервер);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьИВыгрузитьДанныеПоСчетамДУ(ПараметрыПодключения, ДанныеДляСтатистики)
	// Отбор по флагу раннее выгруженных портфелей
	ЗапросSQL =
		"SELECT
		|	LZ_PORTFOLIOS.EXTERNAL_ID,
		|	LZ_PORTFOLIOS.COUNTERPARTY_ID,
		|	COUNTERPARTY_BROKERS.EXTERNAL_ID AS [BROKER],
		|	LZ_PORTFOLIOS.[NAME],
		|	CASE
		|		WHEN LZ_PORTFOLIOS.[NAME] LIKE '%XXXXX%'
		|		THEN 1
		|		ELSE 0
		|	END AS CHANGE,
		|	LZ_PORTFOLIOS.BROKER_CODE,
		|	LZ_PORTFOLIOS.FOREIGN_ALLOWED,
		|	LZ_PORTFOLIOS.REPO_ALLOWED,
		|	LZ_PORTFOLIOS.SPOT_ALLOWED
		|FROM LZ_PORTFOLIOS
		|	LEFT JOIN LZ_COUNTERPARTIES AS COUNTERPARTY_BROKERS
		|	ON LZ_PORTFOLIOS.BROKER_ID = COUNTERPARTY_BROKERS.ID
		|WHERE LZ_PORTFOLIOS.USE_FOR_CONSOLIDATION = 1
		|	AND NOT LZ_PORTFOLIOS.[NAME] LIKE '%Расторгнут%'";
	СтартЗапуска = ТекущаяДатаСеанса();
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
	Если НаборЗаписей = Неопределено Тогда
		Сообщить("Список выгруженных портфелей (LZ_PORTFOLIOS) оказался пустым.");
		Возврат;
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("EXTERNAL_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ТипыКолонок.Вставить("COUNTERPARTY_ID", Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("BROKER", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55))); // BROKER_ID -> EXTERNAL_ID
	ТипыКолонок.Вставить("NAME", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ТипыКолонок.Вставить("CHANGE", Новый ОписаниеТипов("Булево"));
	// Поля, не указав которые EGAR LM затрёт их значения у себя, установив значения по умолчанию
	ТипыКолонок.Вставить("BROKER_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(3)));
	ТипыКолонок.Вставить("FOREIGN_ALLOWED", Новый ОписаниеТипов("Булево")); // smallint в SQL
	ТипыКолонок.Вставить("REPO_ALLOWED", Новый ОписаниеТипов("Булево")); // smallint в SQL
	ТипыКолонок.Вставить("SPOT_ALLOWED", Новый ОписаниеТипов("Булево")); // smallint в SQL
	
	ВыгруженныеСчетаДУ = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей, ТипыКолонок);
	
	Если ВыгруженныеСчетаДУ = Неопределено Тогда
		ВыгруженныеСчетаДУ = Новый ТаблицаЗначений;
		ВыгруженныеСчетаДУ.Колонки.Добавить("EXTERNAL_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)), "EXTERNAL_ID");
		ВыгруженныеСчетаДУ.Колонки.Добавить("COUNTERPARTY_ID", Новый ОписаниеТипов("Число"), "COUNTERPARTY_ID");
		ВыгруженныеСчетаДУ.Колонки.Добавить("BROKER", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)), "BROKER");
		ВыгруженныеСчетаДУ.Колонки.Добавить("NAME", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)), "NAME");
		ВыгруженныеСчетаДУ.Колонки.Добавить("CHANGE", Новый ОписаниеТипов("Булево"), "CHANGE");
		// Поля, не указав которые EGAR LM затрёт их значения у себя, установив значения по умолчанию
		ВыгруженныеСчетаДУ.Колонки.Добавить("BROKER_CODE", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(3)), "BROKER_CODE");
		ВыгруженныеСчетаДУ.Колонки.Добавить("FOREIGN_ALLOWED", Новый ОписаниеТипов("Булево"), "FOREIGN_ALLOWED"); // smallint в SQL
		ВыгруженныеСчетаДУ.Колонки.Добавить("REPO_ALLOWED", Новый ОписаниеТипов("Булево"), "REPO_ALLOWED"); // smallint в SQL
		ВыгруженныеСчетаДУ.Колонки.Добавить("SPOT_ALLOWED", Новый ОписаниеТипов("Булево"), "SPOT_ALLOWED"); // smallint в SQL
	КонецЕсли;
	
	ДанныеДляСтатистики.Вставить("SQL_ЗапросКЕгару_Клиенты",
		"Время выполнения запроса (клиенты): " + РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + Строка(ВыгруженныеСчетаДУ.Количество()) + ".");
	
	Строка = ВыгруженныеСчетаДУ.Добавить();
	Строка.EXTERNAL_ID = "0";
	Строка.CHANGE = ЛОЖЬ;
	Строка.BROKER = "65295"; //БК РЕГИОН
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыгруженныеСчетаДУ.EXTERNAL_ID КАК EXTERNAL_ID,
		|	ВыгруженныеСчетаДУ.COUNTERPARTY_ID КАК COUNTERPARTY_ID,
		|	ВыгруженныеСчетаДУ.NAME КАК NAME,
		|	ВыгруженныеСчетаДУ.BROKER КАК BROKER,
		|	ВыгруженныеСчетаДУ.CHANGE КАК CHANGE,
		|	ВыгруженныеСчетаДУ.BROKER_CODE КАК BROKER_CODE,
		|	ВыгруженныеСчетаДУ.FOREIGN_ALLOWED КАК FOREIGN_ALLOWED,
		|	ВыгруженныеСчетаДУ.REPO_ALLOWED КАК REPO_ALLOWED,
		|	ВыгруженныеСчетаДУ.SPOT_ALLOWED КАК SPOT_ALLOWED
		|ПОМЕСТИТЬ _ВыгруженныеСчетаДУ
		|ИЗ
		|	&ВыгруженныеСчетаДУ КАК ВыгруженныеСчетаДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ДействующиеСчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаВыгрузкиКонецДня
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиКонецДня)
		|	И (&СчетНеопределен = НЕОПРЕДЕЛЕНО
		|			ИЛИ СчетаДоверительногоУправления.Ссылка <> &СчетНеопределен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДействующиеСчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВложенныйЗапрос.Брокер, ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК Брокер,
		|	ВложенныйЗапрос.Код КАК Код,
		|	ЕСТЬNULL(ВложенныйЗапрос.ОсновнойБрокер, ЛОЖЬ) КАК ОсновнойБрокер,
		|	ВложенныйЗапрос.Период КАК Период
		|ПОМЕСТИТЬ _ВсеКодыУБрокеров
		|ИЗ
		|	_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер КАК ОсновнойБрокер,
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период
		|		ИЗ
		|			РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					(Организация, СчетДоверительногоУправления) В
		|						(ВЫБРАТЬ
		|							_ДействующиеСчетаДУ.Организация,
		|							_ДействующиеСчетаДУ.СчетДоверительногоУправления
		|						ИЗ
		|							_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаВыгрузкиКонецДня, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|				ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ГДЕ
		|			(ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаВыгрузкиКонецДня)) КАК ВложенныйЗапрос
		|		ПО _ДействующиеСчетаДУ.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА _ВсеКодыУБрокеров.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Итого,
		|	СУММА(ВЫБОР
		|			КОГДА _ВсеКодыУБрокеров.ОсновнойБрокер
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ИтогоОсновых
		|ПОМЕСТИТЬ _КоличествоБрокеровПоСчетам
		|ИЗ
		|	_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеКодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокеров
		|ИЗ
		|	_КоличествоБрокеровПоСчетам КАК _КоличествоБрокеровПоСчетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО _КоличествоБрокеровПоСчетам.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И (_КоличествоБрокеровПоСчетам.Итого = 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУОсновныхБрокеров
		|ИЗ
		|	_КоличествоБрокеровПоСчетам КАК _КоличествоБрокеровПоСчетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО _КоличествоБрокеровПоСчетам.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И (_ВсеКодыУБрокеров.ОсновнойБрокер)
		|			И (_КоличествоБрокеровПоСчетам.ИтогоОсновых = 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыБрокеровСМаксимальнымПериодом
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ВсеКодыУБрокеров.Период) КАК Период
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ВсеКодыУБрокеров.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействующиеСчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Брокер, _ЕдиничныеКодыУОсновныхБрокеров.Брокер), _КодыБрокеровСМаксимальнымПериодом.Брокер) КАК Брокер,
		|	ЕСТЬNULL(ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Код, _ЕдиничныеКодыУОсновныхБрокеров.Код), _КодыБрокеровСМаксимальнымПериодом.Код) КАК Код
		|ПОМЕСТИТЬ _КодыУБрокеров
		|ИЗ
		|	_ДействующиеСчетаДУ КАК _ДействующиеСчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокеров КАК _ЕдиничныеКодыУБрокеров
		|		ПО _ДействующиеСчетаДУ.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУОсновныхБрокеров КАК _ЕдиничныеКодыУОсновныхБрокеров
		|		ПО _ДействующиеСчетаДУ.СчетДоверительногоУправления = _ЕдиничныеКодыУОсновныхБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыБрокеровСМаксимальнымПериодом КАК _КодыБрокеровСМаксимальнымПериодом
		|		ПО _ДействующиеСчетаДУ.СчетДоверительногоУправления = _КодыБрокеровСМаксимальнымПериодом.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КодыВоВнешнихСистемахСрезПоследних.ВнешняяСистема КАК ВнешняяСистема,
		|	КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов КАК ГруппаОбъектов
		|ПОМЕСТИТЬ _КодыВоВнешнихСистемах
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&ДатаВыгрузкиКонецДня,
		|			ВнешняяСистема В (ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих), ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.EGAR))
		|				И (ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования))) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
		|	ЕСТЬNULL(_КодыУБрокеров.Код, ""XXXXX"") + "" \ "" + КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Наименование КАК КодУБрокера,
		|	_КодыМатрихКлиентов.Код КАК МатрихКодКлиента,
		|	ЕСТЬNULL(_КодыМатрихБК.Код, 0) КАК МатрихКодБК,
		|	_КодыМатрихУК.Код КАК МатрихКодУК,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Стандартная, ЛОЖЬ)
		|			ТОГДА _КодыЕгарСтратегий.Код
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|			ТОГДА ""ИИС""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.КонтрольСаморегулируемыхОрганизаций), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний))
		|			ТОГДА ""ДУ ЮЛ""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА ""ДУ ФЦК""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|			ТОГДА ""УК СС""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ""ПИФ""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА ""ПФР""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
		|			ТОГДА ""ДУ ФЛ""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""НПФ ПН""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""НПФ ПР""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""НПФ СС""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Профиль,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ""CLS""
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""MK2""
		|		ИНАЧЕ ""MK3""
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	_КодыУБрокеров КАК _КодыУБрокеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ДатаВыгрузкиКонецДня,
		|				(СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиКонецДня
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|					И СчетДоверительногоУправления.Организация В (&Организация)
		|					И НЕ СчетДоверительногоУправления.ПометкаУдаления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиКонецДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаВыгрузкиКонецДня, ) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыЕгарСтратегий
		|			ПО (СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = _КодыЕгарСтратегий.Объект)
		|				И (_КодыЕгарСтратегий.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.EGAR))
		|				И (_КодыЕгарСтратегий.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования))
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|				И (_КодыМатрихКлиентов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыМатрихУК
		|			ПО (ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация.ЮрФизЛицо) = _КодыМатрихУК.Объект)
		|				И (_КодыМатрихУК.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|		ПО _КодыУБрокеров.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыМатрихБК
		|		ПО _КодыУБрокеров.Брокер.ЮрФизЛицо = _КодыМатрихБК.Объект
		|			И (_КодыМатрихБК.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУ.КодСчетаДУ КАК КодСчетаДУ,
		|	ВЫБОР
		|		КОГДА _ВыгруженныеСчетаДУ.EXTERNAL_ID ЕСТЬ NULL
		|				ИЛИ _СчетаДУ.МатрихКодБК <> 0
		|					И (_ВыгруженныеСчетаДУ.CHANGE
		|						ИЛИ _ВыгруженныеСчетаДУ.BROKER <> _СчетаДУ.МатрихКодБК)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ВыгруженныеСчетаДУ.EXTERNAL_ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагНового,
		|	ВЫБОР
		|		КОГДА _СчетаДУ.МатрихКодБК <> 0
		|				И _ВыгруженныеСчетаДУ.BROKER <> _СчетаДУ.МатрихКодБК
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагСменыБрокера,
		|	_ВыгруженныеСчетаДУ.NAME КАК NAME,
		|	_ВыгруженныеСчетаДУ.BROKER_CODE КАК BROKER_CODE,
		|	_ВыгруженныеСчетаДУ.FOREIGN_ALLOWED КАК FOREIGN_ALLOWED,
		|	_ВыгруженныеСчетаДУ.REPO_ALLOWED КАК REPO_ALLOWED,
		|	_ВыгруженныеСчетаДУ.SPOT_ALLOWED КАК SPOT_ALLOWED
		|ПОМЕСТИТЬ _СчетаДляВыгрузки
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВыгруженныеСчетаДУ КАК _ВыгруженныеСчетаДУ
		|		ПО _СчетаДУ.КодСчетаДУ = _ВыгруженныеСчетаДУ.EXTERNAL_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУ.КодСчетаДУ КАК КодСчетаДУ,
		|	_СчетаДУ.КодУБрокера КАК КодУБрокера,
		|	_СчетаДУ.МатрихКодКлиента КАК МатрихКодКлиента,
		|	_СчетаДУ.МатрихКодБК КАК МатрихКодБК,
		|	_СчетаДУ.МатрихКодУК КАК МатрихКодУК,
		|	_СчетаДУ.Профиль КАК Профиль,
		|	_СчетаДУ.Цена КАК ТипЦены,
		|	_СчетаДляВыгрузки.ФлагНового КАК ФлагНового,
		|	_СчетаДляВыгрузки.ФлагСменыБрокера КАК ФлагСменыБрокера,
		|	_СчетаДляВыгрузки.NAME КАК NAME,
		|	_СчетаДляВыгрузки.BROKER_CODE КАК BROKER_CODE,
		|	_СчетаДляВыгрузки.FOREIGN_ALLOWED КАК FOREIGN_ALLOWED,
		|	_СчетаДляВыгрузки.REPO_ALLOWED КАК REPO_ALLOWED,
		|	_СчетаДляВыгрузки.SPOT_ALLOWED КАК SPOT_ALLOWED
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДляВыгрузки КАК _СчетаДляВыгрузки
		|		ПО _СчетаДУ.КодСчетаДУ = _СчетаДляВыгрузки.КодСчетаДУ
		|ГДЕ
		|	_СчетаДляВыгрузки.ФлагВыгрузки";
	#КонецОбласти
	Запрос.УстановитьПараметр("ВыгруженныеСчетаДУ", ВыгруженныеСчетаДУ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаВыгрузкиКонецДня", КонецДня(ДатаВыгрузки));
	
	СчетНеопределен = Неопределено;
	
	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		СчетНеопределен = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_РЭМ");
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		СчетНеопределен = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Неопределен_Траст");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетНеопределен", СчетНеопределен);
	
	СтартЗапуска = ТекущаяДатаСеанса();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сообщить("Количество изменений портфелей (LZ_PORTFOLIOS): " + Выборка.Количество());
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.Профиль) Тогда
			ЗарегистрироватьУведомление("У портфеля [" + Выборка.КодСчетаДУ + "] новый вид договора ДУ.");
		КонецЕсли;
		
		Наименование = СтрЗаменить(Выборка.КодУБрокера, "\", "|");
		Наименование = СтрЗаменить(Наименование, "_", "/");
		ДанныеКлиента = Новый Структура;
		ДанныеКлиента.Вставить("id", СокрЛП(Выборка.КодСчетаДУ));
		ДанныеКлиента.Вставить("name", ?(Выборка.ФлагНового, Наименование, Выборка.NAME)); // Лучше не менять имя, если портфель уже существует
		ДанныеКлиента.Вставить("profitCenterId", Выборка.Профиль);
		ДанныеКлиента.Вставить("counterpartyId", Выборка.МатрихКодУК);
		
		Если Выборка.Профиль = "ПИФ" Тогда
			ДанныеКлиента.Вставить("legalEntityId", ?(КодыПифов.Получить(Выборка.МатрихКодКлиента) = Неопределено,
				Выборка.МатрихКодУК, КодыПифов.Получить(Выборка.МатрихКодКлиента)));
		Иначе
			ДанныеКлиента.Вставить("legalEntityId", Выборка.МатрихКодКлиента);
		КонецЕсли;
		
		ДанныеКлиента.Вставить("brokerId", ?(Выборка.МатрихКодБК = 0, "65295", Выборка.МатрихКодБК));
		ДанныеКлиента.Вставить("marketPriceType", Выборка.ТипЦены);
		ДанныеКлиента.Вставить("useForConsolidation", 1); // Флаг используется для поиска уже выгруженных портфелей из 1С
		
		// Обязательно нужно указать исходные значения полей, которые в ином случае EGAR LM перетрёт, установив значения по умолчанию
		Если Не ПустаяСтрока(Выборка.BROKER_CODE) Тогда
			ДанныеКлиента.Вставить("brokerCode", Выборка.BROKER_CODE);
		КонецЕсли;
		ДанныеКлиента.Вставить("isForeignAllowed", ?(Выборка.FOREIGN_ALLOWED, 1, 0));
		ДанныеКлиента.Вставить("isRepoAllowed", ?(Выборка.REPO_ALLOWED, 1, 0));
		ДанныеКлиента.Вставить("isSpotAllowed", ?(Выборка.SPOT_ALLOWED, 1, 0));
		
		Портфель = РаботаСКоллекциями.ЗначениеВМассив(ДанныеКлиента);
		
		ТелоЗапросаJSON = ПолучитьСтрокуJSON(Портфель);
		Если ТелоЗапросаJSON = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщить("Изменение портфелей: " + ТелоЗапросаJSON);
		
		ТекстСообщения = "Не удалось загрузить портфель [" + Выборка.КодСчетаДУ + "] в справочник [Portfolios]!
			|Возможно в справочнике [Counterparties] отсутствует юр/физ лицо с External_ID = [" + Выборка.МатрихКодКлиента + "].";
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Portfolios, ТелоЗапросаJSON, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьУведомление(ТекстСообщения, Истина);
		Иначе
			Если Выборка.ФлагСменыБрокера Тогда
				ЗарегистрироватьУведомление("У Портфеля [" + Выборка.КодСчетаДУ + "] изменился брокер.");
			ИначеЕсли Выборка.ФлагНового Тогда
				ЗарегистрироватьУведомление("У Портфеля [" + Выборка.КодСчетаДУ + "] изменились некоторые поля.");
			Иначе
				ЗарегистрироватьУведомление("В справочник [Portfolios] загружен новый портфель. External_ID [" + Выборка.КодСчетаДУ + "]. Name [" + Наименование + "].");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляСтатистики.Вставить("ДанныеОКлиентах",
		"Время выполнения запроса и выгрузки данных: " + РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + Строка(Выборка.Количество()) + ".");
	
	// Необходимо помечать закрытые счета ДУ
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _ЗакрытыеСчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА СчетаДоверительногоУправления.ДатаРасторжения < &ДатаВыгрузкиНачалоДня
		|		КОНЕЦ
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗакрытыеСчетаДУ.КодСчета КАК КодСчета,
		|	_ЗакрытыеСчетаДУ.Ссылка.Наименование КАК СсылкаНаименование,
		|	_ВыгруженныеСчетаДУ.NAME КАК NAME
		|ИЗ
		|	_ВыгруженныеСчетаДУ КАК _ВыгруженныеСчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗакрытыеСчетаДУ КАК _ЗакрытыеСчетаДУ
		|		ПО _ВыгруженныеСчетаДУ.EXTERNAL_ID = _ЗакрытыеСчетаДУ.КодСчета
		|ГДЕ
		|	НЕ _ЗакрытыеСчетаДУ.КодСчета ЕСТЬ NULL";
	#КонецОбласти
	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки);
	СтартЗапуска = ТекущаяДатаСеанса();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			ДанныеКлиента = Новый Структура("id, name", СокрЛП(Выборка.КодСчета), СокрЛП(Выборка.NAME) + " | Расторгнут");
			
			Портфель = РаботаСКоллекциями.ЗначениеВМассив(ДанныеКлиента);
			ТелоЗапросаJSON = ПолучитьСтрокуJSON(Портфель);
			Если ТелоЗапросаJSON = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения = "У портфеля [" + Выборка.КодСчета + "] расторгнут договор ДУ. В справочник [Portfolios] не удалось внести изменения!";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Portfolios, ТелоЗапросаJSON, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьУведомление(ТекстСообщения, Истина);
			Иначе
				ЗарегистрироватьУведомление("В справочнике [Portfolios] у портфеля: [" + Выборка.КодСчета + "] установлен статус [Расторгнут]");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляСтатистики.Вставить("ДанныеОЗакрытыхКлиентах",
		"Время выполнения запроса и выгрузки данных: " + РассчитатьВремя(СтартЗапуска) + ". Количество записей: " + Строка(Выборка.Количество()) + ".");
КонецПроцедуры

Процедура СформироватьИВыгрузитьОстатки(Сервер, ПараметрыПодключения, МВТ, ДанныеДляСтатистики)
	СтартЗапуска = ТекущаяДатаСеанса();
	
	ПроверитьНаличиеНепроведенныхДокументов(Сервер);
	
	СделкиДляУдаления = Новый Массив;
	СделкиДляВыгрузки = Новый Структура;
	
	// Остатки ДС
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Организация КАК Организация,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ОстаткиДенежныхСредств.Регистратор.БрокерПолучатель КАК БрокерПолучатель,
		|	ОстаткиДенежныхСредств.Регистратор.МестоХраненияПолучатель КАК МестоХраненияПолучатель,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Регистратор.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредств.Регистратор.РасчетныйСчетПолучатель.Банк.ЮрФизЛицо
		|	КОНЕЦ КАК БанкПолучатель
		|ПОМЕСТИТЬ _ДенежныеСредстваВПути
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПереводДенежныхСредств
		|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ВПуть)
		|	И ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ОстаткиДенежныхСредств.Период >= ДОБАВИТЬКДАТЕ(&ДатаВыгрузкиНачалоДня, ДЕНЬ, -10)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути) КАК ФлагВПути,
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.БрокерПолучатель, ОстаткиДенежныхСредствОстатки.Брокер) КАК Брокер,
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.МестоХраненияПолучатель, ОстаткиДенежныхСредствОстатки.МестоХранения) КАК МестоХранения,
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.БанкПолучатель, ОстаткиДенежныхСредствОстатки.РасчетныйСчет.Банк.ЮрФизЛицо) КАК БанкЮрЛицо,
		|	ВалютыОстатков.МатрихКодВалюты КАК КодВалютыОстаткаДС,
		|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиВключаяЗависшиеВПути
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаВыгрузкиНачалоДня, Организация = &Организация) КАК ОстаткиДенежныхСредствОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДенежныеСредстваВПути КАК _ДенежныеСредстваВПути
		|		ПО ОстаткиДенежныхСредствОстатки.Организация = _ДенежныеСредстваВПути.Организация
		|			И ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления = _ДенежныеСредстваВПути.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредствОстатки.РасчетныйСчет = _ДенежныеСредстваВПути.РасчетныйСчет
		|			И ОстаткиДенежныхСредствОстатки.СуммаОстаток = _ДенежныеСредстваВПути.Сумма
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОстатков
		|		ПО ОстаткиДенежныхСредствОстатки.Валюта = ВалютыОстатков.ВалютаСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути),
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.БрокерПолучатель, ОстаткиДенежныхСредствОстатки.Брокер),
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.МестоХраненияПолучатель, ОстаткиДенежныхСредствОстатки.МестоХранения),
		|	ЕСТЬNULL(_ДенежныеСредстваВПути.БанкПолучатель, ОстаткиДенежныхСредствОстатки.РасчетныйСчет.Банк.ЮрФизЛицо),
		|	ВалютыОстатков.МатрихКодВалюты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаВыгрузкиНачалоДня КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА _ОстаткиВключаяЗависшиеВПути.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ""001""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ОстаткиВключаяЗависшиеВПути.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|					ТОГДА ""002""
		|				КОГДА _ОстаткиВключаяЗависшиеВПути.МестоХранения = &РазделFORTS
		|					ТОГДА ""006""
		|				КОГДА _ОстаткиВключаяЗависшиеВПути.МестоХранения = &РазделFX
		|					ТОГДА ""007""
		|				ИНАЧЕ ""003""
		|			КОНЕЦ
		|	КОНЕЦ КАК ЕгарКодМестаХранения,
		|	ВЫБОР
		|		КОГДА _ОстаткиВключаяЗависшиеВПути.МестоХранения = &РазделFX
		|			ТОГДА ""-FX""
		|		КОГДА _ОстаткиВключаяЗависшиеВПути.МестоХранения = &РазделFORTS
		|			ТОГДА ""-FORTS""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК МХ,
		|	_ОстаткиВключаяЗависшиеВПути.Сумма КАК Сумма,
		|	_ОстаткиВключаяЗависшиеВПути.КодВалютыОстаткаДС КАК КодВалютыОстаткаДС,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, _ОстаткиВключаяЗависшиеВПути.БанкЮрЛицо) КАК Банк,
		|	ВЫРАЗИТЬ(_ОстаткиВключаяЗависшиеВПути.Брокер КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо КАК Брокер,
		|	_ОстаткиВключаяЗависшиеВПути.СчетДоверительногоУправления КАК СчетДУ
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	_ОстаткиВключаяЗависшиеВПути КАК _ОстаткиВключаяЗависшиеВПути
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО _ОстаткиВключаяЗависшиеВПути.БанкЮрЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""ОстатокДС"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_Остатки.ЕгарКодМестаХранения + _Остатки.МХ + ""-"" + ЕСТЬNULL(_КодыМатрихБанков.Код, ЕСТЬNULL(_КодыМатрихБрокеров.Код, &МатрихКод_НКО_НКЦ)) + ""-"" + _Остатки.КодВалютыОстаткаДС + ""-"" + КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	1 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	_Остатки.ДатаОперации КАК tradeDate,
		|	_Остатки.ДатаОперации КАК tradeDateTime,
		|	_Остатки.ДатаОперации КАК paymentDate,
		|	_Остатки.ДатаОперации КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	_Остатки.ЕгарКодМестаХранения КАК productCode,
		|	ВЫРАЗИТЬ(_Остатки.Сумма КАК ЧИСЛО(19, 4)) КАК quantity,
		|	1 КАК price,
		|	ВЫРАЗИТЬ(_Остатки.Сумма КАК ЧИСЛО(19, 4)) КАК payment,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК portfolioId,
		|	_Остатки.КодВалютыОстаткаДС КАК instrumentId,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК counterpartyId,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК depositaryId,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	"""" КАК expirationDate,
		|	_Остатки.КодВалютыОстаткаДС КАК paymentCurrencyCode,
		|	_Остатки.КодВалютыОстаткаДС КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	""BAL"" КАК type,
		|	0 КАК interestRate,
		|	"""" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	""B"" КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PR"" КАК assetFlowsType
		|ПОМЕСТИТЬ _ТаблицаСделок
		|ИЗ
		|	_Остатки КАК _Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО _Остатки.СчетДУ = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _Остатки.Банк = _КодыМатрихБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБрокеров
		|		ПО _Остатки.Брокер = _КодыМатрихБрокеров.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	_РанееВыгруженныеОперации.PRODUCT_CODE КАК PRODUCT_CODE
		|ПОМЕСТИТЬ _РанееВыгруженныеОстаткиДС
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""ОстатокДС"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаСделок.comment КАК comment,
		|	_ТаблицаСделок.id КАК id,
		|	_ТаблицаСделок.transactionId КАК transactionId,
		|	_ТаблицаСделок.isBalance КАК isBalance,
		|	_ТаблицаСделок.systemCode КАК systemCode,
		|	_ТаблицаСделок.tradeDate КАК tradeDate,
		|	_ТаблицаСделок.tradeDateTime КАК tradeDateTime,
		|	_ТаблицаСделок.paymentDate КАК paymentDate,
		|	_ТаблицаСделок.deliveryDate КАК deliveryDate,
		|	_ТаблицаСделок.tradingFloorId КАК tradingFloorId,
		|	_ТаблицаСделок.productCode КАК productCode,
		|	_ТаблицаСделок.quantity КАК quantity,
		|	_ТаблицаСделок.price КАК price,
		|	_ТаблицаСделок.payment КАК payment,
		|	_ТаблицаСделок.portfolioId КАК portfolioId,
		|	_ТаблицаСделок.instrumentId КАК instrumentId,
		|	_ТаблицаСделок.counterpartyId КАК counterpartyId,
		|	_ТаблицаСделок.depositaryId КАК depositaryId,
		|	_ТаблицаСделок.customerId КАК customerId,
		|	_ТаблицаСделок.expirationDate КАК expirationDate,
		|	_ТаблицаСделок.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ТаблицаСделок.priceCurrencyCode КАК priceCurrencyCode,
		|	_ТаблицаСделок.traderId КАК traderId,
		|	_ТаблицаСделок.lastTraderId КАК lastTraderId,
		|	_ТаблицаСделок.legNumber КАК legNumber,
		|	_ТаблицаСделок.accruedInterest КАК accruedInterest,
		|	_ТаблицаСделок.dirtyPrice КАК dirtyPrice,
		|	_ТаблицаСделок.branchId КАК branchId,
		|	_ТаблицаСделок.scope КАК scope,
		|	_ТаблицаСделок.type КАК type,
		|	_ТаблицаСделок.interestRate КАК interestRate,
		|	_ТаблицаСделок.tradingModeId КАК tradingModeId,
		|	_ТаблицаСделок.settlementType КАК settlementType,
		|	_ТаблицаСделок.side КАК side,
		|	_ТаблицаСделок.bOstatus КАК bOstatus,
		|	_ТаблицаСделок.isSkipDetails КАК isSkipDetails,
		|	_ТаблицаСделок.objectType КАК objectType,
		|	_ТаблицаСделок.originId КАК originId,
		|	_ТаблицаСделок.assetFlowsType КАК assetFlowsType,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеОстаткиДС.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ТаблицаСделок.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеОстаткиДС.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ИЗ
		|	_ТаблицаСделок КАК _ТаблицаСделок
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеОстаткиДС КАК _РанееВыгруженныеОстаткиДС
		|		ПО _ТаблицаСделок.id = _РанееВыгруженныеОстаткиДС.ID
		|			И _ТаблицаСделок.quantity = _РанееВыгруженныеОстаткиДС.QUANTITY
		|			И _ТаблицаСделок.price = _РанееВыгруженныеОстаткиДС.PRICE
		|			И (ПОДСТРОКА(_ТаблицаСделок.productCode, 2, 2) = _РанееВыгруженныеОстаткиДС.PRODUCT_CODE)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ТаблицаСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиВключаяЗависшиеВПути
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДенежныеСредстваВПути
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеОстаткиДС";
	#КонецОбласти

	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки); //Для остатков установим дату предыдущего дня.
	Запрос.УстановитьПараметр("ДатаВыгрузкиКонецДня", КонецДня(ДатаВыгрузки));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МатрихКод_НКО_НКЦ", ПолучитьМатрихКод(ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ")));
	Запрос.УстановитьПараметр("РазделFX", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX"));
	Запрос.УстановитьПараметр("РазделFORTS", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FORTS"));
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	//Остатки ЦБ. Иcключил "доли". По ним пока не определились с выгрузкой.
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Документ.СделкаРЕПО).МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок) КАК ФлагБиржеваяСделка,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРепо)
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|						ТОГДА -ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРепо)
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|						ТОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ _ЗадолженностьПоСделкамРепо
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРепо), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРепо))) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностьПоСделкамРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностьПоСделкамРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗадолженностьПоСделкамРепо.ФлагБиржеваяСделка КАК ФлагБиржеваяСделка,
		|	СУММА(_ЗадолженностьПоСделкамРепо.Количество) КАК Количество
		|ПОМЕСТИТЬ _КупленныеПоРепо
		|ИЗ
		|	_ЗадолженностьПоСделкамРепо КАК _ЗадолженностьПоСделкамРепо
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностьПоСделкамРепо.СчетДоверительногоУправления,
		|	_ЗадолженностьПоСделкамРепо.ЦеннаяБумага,
		|	_ЗадолженностьПоСделкамРепо.ФлагБиржеваяСделка
		|
		|ИМЕЮЩИЕ
		|	СУММА(_ЗадолженностьПоСделкамРепо.Количество) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Торговый)
		|			ИЛИ ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Родитель.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Торговый)
		|			ИЛИ ОстаткиЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы), ЛОЖЬ) КАК ЭтоТорговыйСчет,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Закладные)
		|			ТОГДА NULL
		|		КОГДА ОстаткиЦенныхБумагОстатки.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.Валюта
		|		ИНАЧЕ ОстаткиЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	ОстаткиЦенныхБумагОстатки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы) КАК ФлагФьючерсы,
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиЦенныхБумагОстаткиЗаблокированные.КоличествоОстаток, 0) КАК Количество
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И НЕ Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)) КАК ОстаткиЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
		|				&ДатаВыгрузкиКонецДня,
		|				Организация = &Организация
		|					И ВидБлокировкиАктива = ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение)
		|					И НЕ ЦеннаяБумага В
		|							(ВЫБРАТЬ
		|								Дефолты.Облигация
		|							ИЗ
		|								_ДефолтыПоОблигациям КАК Дефолты)
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК ОстаткиЦенныхБумагОстаткиЗаблокированные
		|		ПО ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = ОстаткиЦенныхБумагОстаткиЗаблокированные.СчетДоверительногоУправления
		|			И ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет = ОстаткиЦенныхБумагОстаткиЗаблокированные.ДепозитарныйСчет
		|			И ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = ОстаткиЦенныхБумагОстаткиЗаблокированные.ЦеннаяБумага
		|ГДЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиЦенныхБумагОстаткиЗаблокированные.КоличествоОстаток, 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумаг.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумаг.ДепозитарныйСчет.Код КАК КодСчетаДепо,
		|	_ОстаткиЦенныхБумаг.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумаг.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумаг.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиЦенныхБумаг.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиЦенныхБумаг.Количество - ЕСТЬNULL(_КупленныеПоРепо.Количество, 0) КАК Количество
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагБезРепо
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КупленныеПоРепо КАК _КупленныеПоРепо
		|		ПО _ОстаткиЦенныхБумаг.СчетДоверительногоУправления = _КупленныеПоРепо.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумаг.ЦеннаяБумага = _КупленныеПоРепо.ЦеннаяБумага
		|			И _ОстаткиЦенныхБумаг.ЭтоТорговыйСчет = _КупленныеПоРепо.ФлагБиржеваяСделка
		|ГДЕ
		|	_ОстаткиЦенныхБумаг.Количество - ЕСТЬNULL(_КупленныеПоРепо.Количество, 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ _БумагиОцениваемыеПоАмортизированнойСтоимости
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И УчетныйАктивЕПС В (&УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости)
		|				И НЕ Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)) КАК БухПартииЦенныхБумагОстатки
		|ГДЕ
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_ОстаткиЦенныхБумагБезРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарныйСчет.Код КАК КодСчетаДепо,
		|	_ОстаткиЦенныхБумагБезРепо.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумагБезРепо.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагБезРепо.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиЦенныхБумагБезРепо.Количество КАК Количество
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагОпределенногоМестаХранения
		|ИЗ
		|	_ОстаткиЦенныхБумагБезРепо КАК _ОстаткиЦенныхБумагБезРепо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БумагиОцениваемыеПоАмортизированнойСтоимости КАК _БумагиОцениваемыеПоАмортизированнойСтоимости
		|		ПО _ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления = _БумагиОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагБезРепо.ЦеннаяБумага = _БумагиОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага
		|ГДЕ
		|	_БумагиОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_ОстаткиЦенныхБумагБезРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарныйСчет.Код КАК КодСчетаДепо,
		|	_ОстаткиЦенныхБумагБезРепо.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагБезРепо.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумагБезРепо.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагБезРепо.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиЦенныхБумагБезРепо.Количество КАК Количество
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагДляУточненияМестаХранения
		|ИЗ
		|	_ОстаткиЦенныхБумагБезРепо КАК _ОстаткиЦенныхБумагБезРепо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БумагиОцениваемыеПоАмортизированнойСтоимости КАК _БумагиОцениваемыеПоАмортизированнойСтоимости
		|		ПО _ОстаткиЦенныхБумагБезРепо.СчетДоверительногоУправления = _БумагиОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагБезРепо.ЦеннаяБумага = _БумагиОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага
		|ГДЕ
		|	НЕ _БумагиОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.Количество КАК Количество
		|ИЗ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения КАК _ОстаткиЦенныхБумагДляУточненияМестаХранения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоТорговыйСчет,
		|	Количество УБЫВ,
		|	ДепозитарныйСчет";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости", Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости());

	ТаблицаСчетовДепо = Запрос.Выполнить().Выгрузить();
	ТаблицаСчетовДепо.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Число"));
	
	//Бумаги оцениваемые по амортизированной стоимости выгружаем отдельно, предварительно уменьшив общий остаток (из общего остатка вычетаем количество по аморт.стоимости)
	//Т.к. остатки выгружаем в разрезе счетов депо, необходимо количество бумаг по аморт.стоимости размазать по счетам депо.
	Инд = 0;
	Для Каждого СчетДепо Из ТаблицаСчетовДепо Цикл
		СчетДепо.Индекс = Инд;
		Инд = Инд + 1;
	КонецЦикла;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаСчетовДепо.Индекс КАК Индекс,
		|	ТаблицаСчетовДепо.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ТаблицаСчетовДепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаСчетовДепо.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _СчетаДепо
		|ИЗ
		|	&ТаблицаСчетовДепо КАК ТаблицаСчетовДепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.КодСчета КАК КодСчета,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.КодСчетаДепо КАК КодСчетаДепо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения.Количество КАК Количество,
		|	_СчетаДепо.Индекс КАК Индекс
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные
		|ИЗ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХранения КАК _ОстаткиЦенныхБумагДляУточненияМестаХранения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДепо КАК _СчетаДепо
		|		ПО _ОстаткиЦенныхБумагДляУточненияМестаХранения.СчетДоверительногоУправления = _СчетаДепо.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагДляУточненияМестаХранения.ЦеннаяБумага = _СчетаДепо.ЦеннаяБумага
		|			И _ОстаткиЦенныхБумагДляУточненияМестаХранения.ДепозитарныйСчет = _СчетаДепо.ДепозитарныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.КодСчета КАК КодСчета,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.КодСчетаДепо КАК КодСчетаДепо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЭтоТорговыйСчет КАК ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.Количество) <= _БумагиОцениваемыеПоАмортизированнойСтоимости.Количество
		|			ТОГДА _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Количество
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _БумагиОцениваемыеПоАмортизированнойСтоимости.Количество - СУММА(_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.Количество) + _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Количество > 0
		|					ТОГДА _БумагиОцениваемыеПоАмортизированнойСтоимости.Количество - СУММА(_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.Количество) + _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Количество
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоПоАмортизированнойСтоимости
		|ПОМЕСТИТЬ _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости
		|ИЗ
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные КАК _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные КАК _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1
		|		ПО _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.СчетДоверительногоУправления = _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЦеннаяБумага = _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.ЦеннаяБумага
		|			И _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Индекс >= _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные1.Индекс
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БумагиОцениваемыеПоАмортизированнойСтоимости КАК _БумагиОцениваемыеПоАмортизированнойСтоимости
		|		ПО _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.СчетДоверительногоУправления = _БумагиОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЦеннаяБумага = _БумагиОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.КодСчета,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.КодСчетаДепо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ЭтоТорговыйСчет,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ДепозитарийЮрФизЛицо,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.ВалютаНоминала,
		|	_ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные.Количество,
		|	_БумагиОцениваемыеПоАмортизированнойСтоимости.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчетаДепо + ""-"" + _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчета КАК Идентификатор,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчета КАК КодСчета,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ДепозитарийЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ЭтоТорговыйСчет
		|			ТОГДА ""004""
		|		ИНАЧЕ ""005""
		|	КОНЕЦ КАК КодМестаХраненияЕгар,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ФлагФьючерсы КАК ФлагФьючерсы,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.Количество - _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КоличествоПоАмортизированнойСтоимости КАК Количество
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагИтоги
		|ИЗ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости КАК _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости
		|ГДЕ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.Количество - _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КоличествоПоАмортизированнойСтоимости <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчетаДепо + ""_"" + _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчета + ""-HTM"",
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.СчетДоверительногоУправления,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КодСчета,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ЦеннаяБумага,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ДепозитарныйСчет,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ДепозитарийЮрФизЛицо,
		|	""008"",
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ФлагФьючерсы,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.ВалютаНоминала,
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КоличествоПоАмортизированнойСтоимости
		|ИЗ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости КАК _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости
		|ГДЕ
		|	_ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости.КоличествоПоАмортизированнойСтоимости <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.КодСчетаДепо + ""_"" + _ОстаткиЦенныхБумагОпределенногоМестаХранения.КодСчета,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.КодСчета,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.ЦеннаяБумага,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.ДепозитарныйСчет,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.ДепозитарийЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА _ОстаткиЦенныхБумагОпределенногоМестаХранения.ЭтоТорговыйСчет
		|			ТОГДА ""004""
		|		ИНАЧЕ ""005""
		|	КОНЕЦ,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.ФлагФьючерсы,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.ВалютаНоминала,
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения.Количество
		|ИЗ
		|	_ОстаткиЦенныхБумагОпределенногоМестаХранения КАК _ОстаткиЦенныхБумагОпределенногоМестаХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""ОстатокЦБ"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(МатрихКодыЦБ.Код + ""-"" + _ОстаткиЦенныхБумагИтоги.Идентификатор КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	1 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDate,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDateTime,
		|	&ДатаВыгрузкиНачалоДня КАК paymentDate,
		|	&ДатаВыгрузкиНачалоДня КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	_ОстаткиЦенныхБумагИтоги.КодМестаХраненияЕгар КАК productCode,
		|	ВЫРАЗИТЬ(_ОстаткиЦенныхБумагИтоги.Количество КАК ЧИСЛО(19, 4)) КАК quantity,
		|	ВЫБОР
		|		КОГДА КотировкиЦенныхБумагСрезПоследних.BID ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА _ЦеныОценки.Цена ЕСТЬ NULL
		|						ТОГДА ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, 1)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА _ЦеныОценки.Цена = 0
		|								ТОГДА ЕСТЬNULL(НоминалыЦенныхБумагСрезПоследних.Номинал, 1)
		|							ИНАЧЕ _ЦеныОценки.Цена
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ КотировкиЦенныхБумагСрезПоследних.BID
		|	КОНЕЦ КАК price,
		|	_ЦеныОценки.Цена ЕСТЬ NULL КАК ФлагНетЦены,
		|	ВЫРАЗИТЬ(_ОстаткиЦенныхБумагИтоги.Количество КАК ЧИСЛО(19, 4)) КАК payment,
		|	_ОстаткиЦенныхБумагИтоги.КодСчета КАК portfolioId,
		|	МатрихКодыЦБ.Код КАК instrumentId,
		|	ЕСТЬNULL(_КодыМатрихДепозитариев.Код, &МатрихКод_НКО_НКЦ) КАК counterpartyId,
		|	ЕСТЬNULL(_КодыМатрихДепозитариев.Код, &МатрихКод_НКО_НКЦ) КАК depositaryId,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	_ОстаткиЦенныхБумагИтоги.ВалютаНоминала КАК ВалютаНоминала,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	ВЫБОР
		|		КОГДА _ОстаткиЦенныхБумагИтоги.ФлагФьючерсы
		|			ТОГДА ""FUT""
		|		ИНАЧЕ ""SPF""
		|	КОНЕЦ КАК type,
		|	0 КАК interestRate,
		|	"""" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	""B"" КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PH"" КАК assetFlowsType,
		|	"""" КАК expirationDate,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)) КАК ФлКонтрольЦен
		|ПОМЕСТИТЬ _ДанныеДляВыгрузки
		|ИЗ
		|	_ОстаткиЦенныхБумагИтоги КАК _ОстаткиЦенныхБумагИтоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО _ОстаткиЦенныхБумагИтоги.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК МатрихКодыЦБ
		|		ПО _ОстаткиЦенныхБумагИтоги.ЦеннаяБумага = МатрихКодыЦБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок.СрезПоследних(
		|				&ДатаВыгрузкиНачалоДня,
		|				Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|					И Биржа = &Биржа
		|					И РежимТоргов = &РежимТоргов
		|					И BID <> 0) КАК КотировкиЦенныхБумагСрезПоследних
		|		ПО _ОстаткиЦенныхБумагИтоги.ЦеннаяБумага = КотировкиЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныОценкиАктивов КАК _ЦеныОценки
		|		ПО _ОстаткиЦенныхБумагИтоги.СчетДоверительногоУправления = _ЦеныОценки.СчетДоверительногоУправления
		|			И _ОстаткиЦенныхБумагИтоги.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&ДатаВыгрузкиНачалоДня, ЦеннаяБумага.ДатаНачалаРазмещения МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаВыгрузкиНачалоДня, НЕДЕЛЯ, -1) И &ДатаВыгрузкиНачалоДня) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _ОстаткиЦенныхБумагИтоги.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО _ОстаткиЦенныхБумагИтоги.ДепозитарийЮрФизЛицо = _КодыМатрихДепозитариев.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE
		|ПОМЕСТИТЬ _РанееВыгруженныеОстаткиЦБ
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""ОстатокЦБ"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДляВыгрузки.comment КАК comment,
		|	_ДанныеДляВыгрузки.id КАК id,
		|	_ДанныеДляВыгрузки.transactionId КАК transactionId,
		|	_ДанныеДляВыгрузки.isBalance КАК isBalance,
		|	_ДанныеДляВыгрузки.systemCode КАК systemCode,
		|	_ДанныеДляВыгрузки.tradeDate КАК tradeDate,
		|	_ДанныеДляВыгрузки.tradeDateTime КАК tradeDateTime,
		|	_ДанныеДляВыгрузки.paymentDate КАК paymentDate,
		|	_ДанныеДляВыгрузки.deliveryDate КАК deliveryDate,
		|	_ДанныеДляВыгрузки.tradingFloorId КАК tradingFloorId,
		|	_ДанныеДляВыгрузки.productCode КАК productCode,
		|	_ДанныеДляВыгрузки.quantity КАК quantity,
		|	_ДанныеДляВыгрузки.price КАК price,
		|	_ДанныеДляВыгрузки.payment КАК payment,
		|	_ДанныеДляВыгрузки.portfolioId КАК portfolioId,
		|	_ДанныеДляВыгрузки.instrumentId КАК instrumentId,
		|	_ДанныеДляВыгрузки.counterpartyId КАК counterpartyId,
		|	_ДанныеДляВыгрузки.depositaryId КАК depositaryId,
		|	_ДанныеДляВыгрузки.customerId КАК customerId,
		|	ВалютыЦБ.МатрихКодВалюты КАК paymentCurrencyCode,
		|	ВалютыЦБ.МатрихКодВалюты КАК priceCurrencyCode,
		|	_ДанныеДляВыгрузки.traderId КАК traderId,
		|	_ДанныеДляВыгрузки.lastTraderId КАК lastTraderId,
		|	_ДанныеДляВыгрузки.legNumber КАК legNumber,
		|	_ДанныеДляВыгрузки.accruedInterest КАК accruedInterest,
		|	_ДанныеДляВыгрузки.dirtyPrice КАК dirtyPrice,
		|	_ДанныеДляВыгрузки.branchId КАК branchId,
		|	_ДанныеДляВыгрузки.scope КАК scope,
		|	_ДанныеДляВыгрузки.type КАК type,
		|	_ДанныеДляВыгрузки.interestRate КАК interestRate,
		|	_ДанныеДляВыгрузки.tradingModeId КАК tradingModeId,
		|	_ДанныеДляВыгрузки.settlementType КАК settlementType,
		|	_ДанныеДляВыгрузки.side КАК side,
		|	_ДанныеДляВыгрузки.bOstatus КАК bOstatus,
		|	_ДанныеДляВыгрузки.isSkipDetails КАК isSkipDetails,
		|	_ДанныеДляВыгрузки.objectType КАК objectType,
		|	_ДанныеДляВыгрузки.originId КАК originId,
		|	_ДанныеДляВыгрузки.assetFlowsType КАК assetFlowsType,
		|	_ДанныеДляВыгрузки.expirationDate КАК expirationDate,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеОстаткиЦБ.ID ЕСТЬ NULL
		|				И _ДанныеДляВыгрузки.quantity <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ДанныеДляВыгрузки.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеОстаткиЦБ.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления,
		|	ЕСТЬNULL(_ДанныеДляВыгрузки.price, 1) = 1
		|		И _ДанныеДляВыгрузки.ФлКонтрольЦен
		|		И _ДанныеДляВыгрузки.ФлагНетЦены КАК СообщитьОбОтсутствииЦены,
		|	_МинусДваРабочихДня.Дата КАК ДатаЦенОценки
		|ИЗ
		|	_ДанныеДляВыгрузки КАК _ДанныеДляВыгрузки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеОстаткиЦБ КАК _РанееВыгруженныеОстаткиЦБ
		|		ПО _ДанныеДляВыгрузки.id = _РанееВыгруженныеОстаткиЦБ.ID
		|			И _ДанныеДляВыгрузки.quantity = _РанееВыгруженныеОстаткиЦБ.QUANTITY
		|			И _ДанныеДляВыгрузки.price = _РанееВыгруженныеОстаткиЦБ.PRICE
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыЦБ
		|		ПО _ДанныеДляВыгрузки.ВалютаНоминала = ВалютыЦБ.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МинусДваРабочихДня КАК _МинусДваРабочихДня
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЗадолженностьПоСделкамРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КупленныеПоРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагБезРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _БумагиОцениваемыеПоАмортизированнойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагОпределенногоМестаХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагДляУточненияМестаХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаДепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагДляУточненияМестаХраненияИндексированные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиБумагВключаяОцениваемыеПоАмортизированнойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагИтоги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеДляВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеОстаткиЦБ";
	#КонецОбласти

	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_NYSE"));
	Запрос.УстановитьПараметр("РежимТоргов", ОбщегоНазначения.ПолучитьИменованныйОбъект("РежимТоргов_NYSE"));
	Запрос.УстановитьПараметр("ТаблицаСчетовДепо", ТаблицаСчетовДепо);
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления, Сервер); 
	
	//Операции (Погашения и возврат НКД / погашения облигаций)
	//1. Формируем расчетные данные по погашениям купонов и облигаций.
	//2. Из расчетных данных исключаем данные отраженные в учетной системе (операции погашения купонов и облигаций)
	// кроме случаев когда и погашение и оплата совершены одним днем в текущем дне.
	// Если операция погашения отражена в системе, и нет задолженности по погашению на конец текущего дня - значит прошла оплата.
	// - если оплата совершена раньше текущего дня - данные не выгружаем, т.к. эта сумма уже отражена в остатках ДС (остатки формируются на конец вчерашнего дня)
	// - если оплата прошла в текущем дне - выгружаем данные.
	//3. Из расчета исключаем данные по офертам put, т.к. участие не обязательное.
	//	Если прошло погашение по оферте put - данные об ожидаемых суммах выгрузятся по факту возникшей задолженности (при проведении документа погашение ценной бумаги)
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК Минус3,
		|	ВложенныйЗапрос.Минус2 КАК Минус2,
		|	ВложенныйЗапрос.Минус1 КАК Минус1,
		|	&ДатаВыгрузкиНачалоДня КАК НачалоТекущегоДня,
		|	ВложенныйЗапрос.Плюс1 КАК Плюс1,
		|	ВложенныйЗапрос.Плюс2 КАК Плюс2
		|ПОМЕСТИТЬ _РабочиеДни
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ДанныеКалендаря.Дата) КАК Минус2,
		|		ВложенныйЗапрос.НачалоПериода КАК Минус1,
		|		ВложенныйЗапрос.КонецПериода КАК Плюс1,
		|		МИНИМУМ(ДанныеКалендаря1.Дата) КАК Плюс2
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МАКСИМУМ(ВЫБОР
		|					КОГДА ДанныеКалендаря.Дата < &ДатаВыгрузкиНачалоДня
		|						ТОГДА ДанныеКалендаря.Дата
		|				КОНЕЦ) КАК НачалоПериода,
		|			МИНИМУМ(ВЫБОР
		|					КОГДА ДанныеКалендаря.Дата > &ДатаВыгрузкиНачалоДня
		|						ТОГДА ДанныеКалендаря.Дата
		|				КОНЕЦ) КАК КонецПериода
		|		ИЗ
		|			РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ГДЕ
		|			ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|			И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|			И ДанныеКалендаря.Дата МЕЖДУ &МинусМесяц И &ПлюсМесяц) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|			ПО ВложенныйЗапрос.НачалоПериода > ДанныеКалендаря.Дата
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря1
		|			ПО ВложенныйЗапрос.КонецПериода < ДанныеКалендаря1.Дата
		|	ГДЕ
		|		ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|		И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|		И ДанныеКалендаря.Дата МЕЖДУ &МинусМесяц И &ДатаВыгрузкиНачалоДня
		|		И ДанныеКалендаря1.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|		И ДанныеКалендаря1.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|		И ДанныеКалендаря1.Дата МЕЖДУ &ДатаВыгрузкиНачалоДня И &ПлюсМесяц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.НачалоПериода,
		|		ВложенныйЗапрос.КонецПериода) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО ВложенныйЗапрос.Минус2 > ДанныеКалендаря.Дата
		|ГДЕ
		|	ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &МинусМесяц И &ДатаВыгрузкиНачалоДня
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Минус2,
		|	ВложенныйЗапрос.Минус1,
		|	ВложенныйЗапрос.Плюс1,
		|	ВложенныйЗапрос.Плюс2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.Период КАК Период,
		|	КупонныйДоходПоОблигациям.Облигация КАК Облигация,
		|	КупонныйДоходПоОблигациям.ДатаВыплатыПлан КАК ДатаВыплатыПлан,
		|	КупонныйДоходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	КупонныйДоходПоОблигациям.Облигация.ДатаПогашения КАК ДатаПогашения,
		|	КупонныйДоходПоОблигациям.СуммаКупона КАК СуммаКупона,
		|	0 КАК ЦенаОферты,
		|	ЛОЖЬ КАК ОфертаПродажа
		|ПОМЕСТИТЬ _БумагиОферты
		|ИЗ
		|	_РабочиеДни КАК _РабочиеДни
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ПО _РабочиеДни.Минус3 < КупонныйДоходПоОблигациям.ДатаВыплатыПлан
		|			И _РабочиеДни.Плюс1 >= КупонныйДоходПоОблигациям.ДатаВыплатыПлан
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РабочиеДни.Минус3,
		|	УсловияОферт.Облигация,
		|	УсловияОферт.ДатаВыкупа,
		|	УсловияОферт.ДатаВыкупа,
		|	УсловияОферт.ДатаВыкупа,
		|	0,
		|	УсловияОферт.Цена,
		|	УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа)
		|ИЗ
		|	_РабочиеДни КАК _РабочиеДни
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _РабочиеДни.Минус3 < УсловияОферт.ДатаВыкупа
		|			И _РабочиеДни.Плюс1 >= УсловияОферт.ДатаВыкупа
		|ГДЕ
		|	УсловияОферт.ТипОферты В (ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПокупка), ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Облигация КАК Ссылка,
		|	ВложенныйЗапрос.ДатаВыплатыПлан КАК ДатаВыплатыПлан,
		|	ВложенныйЗапрос.ДатаВыплатыПлан КАК ПредполагаемаяДатаПоступленияДС,
		|	ВложенныйЗапрос.ДатаФиксации КАК ДатаФиксации,
		|	ВложенныйЗапрос.СуммаКупона КАК СуммаКупона,
		|	ВложенныйЗапрос.ЦенаОферты КАК ЦенаОферты,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаВыплатыПлан, ВложенныйЗапрос.ДатаПогашения, ДЕНЬ) <= 5
		|				И ВложенныйЗапрос.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагПогашенияОблигации,
		|	ВложенныйЗапрос.ОфертаПродажа КАК ОфертаПродажа
		|ПОМЕСТИТЬ _ТаблицаОблигаций
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(_БумагиОферты.Период) КАК Период,
		|		_БумагиОферты.Облигация КАК Облигация,
		|		МИНИМУМ(_БумагиОферты.ДатаВыплатыПлан) КАК ДатаВыплатыПлан,
		|		МИНИМУМ(_БумагиОферты.ДатаФиксации) КАК ДатаФиксации,
		|		МИНИМУМ(_БумагиОферты.ДатаПогашения) КАК ДатаПогашения,
		|		МАКСИМУМ(_БумагиОферты.СуммаКупона) КАК СуммаКупона,
		|		МАКСИМУМ(_БумагиОферты.ЦенаОферты) КАК ЦенаОферты,
		|		МАКСИМУМ(_БумагиОферты.ОфертаПродажа) КАК ОфертаПродажа
		|	ИЗ
		|		_БумагиОферты КАК _БумагиОферты
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДефолтыПоОблигациям КАК _ДефолтыПоОблигациям
		|			ПО _БумагиОферты.Облигация = _ДефолтыПоОблигациям.Облигация
		|	ГДЕ
		|		_ДефолтыПоОблигациям.Облигация ЕСТЬ NULL
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_БумагиОферты.Облигация) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДатыКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &МинусМесяц И &ЗавтраНачалоДня
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумаг.КоличествоОстаток КАК КоличествоОстаток,
		|	_ТаблицаОблигаций.ФлагПогашенияОблигации КАК ФлагПогашенияОблигации,
		|	_ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС КАК ПредполагаемаяДатаПоступленияДС,
		|	_ТаблицаОблигаций.СуммаКупона КАК СуммаКупона,
		|	_ТаблицаОблигаций.ЦенаОферты КАК ЦенаОферты,
		|	ОстаткиЦенныхБумаг.Дата КАК ДатаОстатков
		|ПОМЕСТИТЬ _ОстаткиБумагКПогашению
		|ИЗ
		|	_ТаблицаОблигаций КАК _ТаблицаОблигаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДатыКалендаря.Дата КАК Дата,
		|			ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|			СУММА(ВЫБОР
		|					КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.Период = &МинусМесяц
		|						ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток
		|					ИНАЧЕ ЕСТЬNULL(ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот, 0)
		|				КОНЕЦ) КАК КоличествоОстаток
		|		ИЗ
		|			_ДатыКалендаря КАК _ДатыКалендаря
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|						&МинусМесяц,
		|						&ЗавтраНачалоДня,
		|						День,
		|						,
		|						Организация = &Организация
		|							И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|							И ЦеннаяБумага В
		|								(ВЫБРАТЬ
		|									_ТаблицаОблигаций.Ссылка
		|								ИЗ
		|									_ТаблицаОблигаций КАК _ТаблицаОблигаций
		|								ГДЕ
		|									НЕ _ТаблицаОблигаций.ОфертаПродажа)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|				ПО _ДатыКалендаря.Дата >= ОстаткиЦенныхБумагОстаткиИОбороты.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДатыКалендаря.Дата,
		|			ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления,
		|			ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага) КАК ОстаткиЦенныхБумаг
		|		ПО (ОстаткиЦенныхБумаг.ЦеннаяБумага = _ТаблицаОблигаций.Ссылка)
		|			И (ВЫБОР
		|				КОГДА _ТаблицаОблигаций.ДатаФиксации >= &ДатаВыгрузкиНачалоДня
		|					ТОГДА ОстаткиЦенныхБумаг.Дата = &ЗавтраНачалоДня
		|				ИНАЧЕ ОстаткиЦенныхБумаг.Дата = _ТаблицаОблигаций.ДатаФиксации
		|			КОНЕЦ)
		|ГДЕ
		|	ОстаткиЦенныхБумаг.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыКалендаря.Дата КАК Дата,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Организация КАК Организация,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период = &МинусМесяц
		|				ТОГДА ВЫБОР
		|						КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|							ТОГДА -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|						ИНАЧЕ ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|						ТОГДА -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот
		|					ИНАЧЕ ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагПоРепо
		|ИЗ
		|	_ДатыКалендаря КАК _ДатыКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|				&МинусМесяц,
		|				&ЗавтраНачалоДня,
		|				День,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРепо)
		|					И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации) В
		|						(ВЫБРАТЬ
		|							_ТаблицаОблигаций.Ссылка
		|						ИЗ
		|							_ТаблицаОблигаций)) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|		ПО _ДатыКалендаря.Дата >= ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Организация,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага,
		|	_ДатыКалендаря.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыКалендаря.Дата,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период = &МинусМесяц
		|				ТОГДА ВЫБОР
		|						КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|							ТОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|						ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|						ТОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОборот
		|					ИНАЧЕ -ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоОборот
		|				КОНЕЦ
		|		КОНЕЦ)
		|ИЗ
		|	_ДатыКалендаря КАК _ДатыКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|				&МинусМесяц,
		|				&ЗавтраНачалоДня,
		|				День,
		|				,
		|				Организация = &Организация
		|					И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации) В
		|						(ВЫБРАТЬ
		|							_ТаблицаОблигаций.Ссылка
		|						ИЗ
		|							_ТаблицаОблигаций)) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ПО _ДатыКалендаря.Дата >= ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДатыКалендаря.Дата,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Организация,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагПоРепо.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагПоРепо.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ОстаткиЦенныхБумагПоРепо.КоличествоОстаток) КАК КоличествоОстаток,
		|	_ТаблицаОблигаций.ФлагПогашенияОблигации КАК ФлагПогашенияОблигации,
		|	_ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС КАК ПредполагаемаяДатаПоступленияДС,
		|	_ТаблицаОблигаций.СуммаКупона КАК СуммаКупона,
		|	_ТаблицаОблигаций.ЦенаОферты КАК ЦенаОферты,
		|	ОстаткиЦенныхБумагПоРепо.Дата КАК ДатаОстатков
		|ПОМЕСТИТЬ _ОстаткиБумагКВозвратуКупона
		|ИЗ
		|	_ТаблицаОблигаций КАК _ТаблицаОблигаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагПоРепо КАК ОстаткиЦенныхБумагПоРепо
		|		ПО _ТаблицаОблигаций.Ссылка = ОстаткиЦенныхБумагПоРепо.ЦеннаяБумага
		|			И (ВЫБОР
		|				КОГДА _ТаблицаОблигаций.ДатаФиксации >= &ДатаВыгрузкиНачалоДня
		|					ТОГДА ОстаткиЦенныхБумагПоРепо.Дата = &ЗавтраНачалоДня
		|				ИНАЧЕ ОстаткиЦенныхБумагПоРепо.Дата = _ТаблицаОблигаций.ДатаФиксации
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагПоРепо.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагПоРепо.ЦеннаяБумага,
		|	_ТаблицаОблигаций.ФлагПогашенияОблигации,
		|	_ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС,
		|	_ТаблицаОблигаций.СуммаКупона,
		|	_ТаблицаОблигаций.ЦенаОферты,
		|	ОстаткиЦенныхБумагПоРепо.Дата
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОстаткиЦенныхБумагПоРепо.КоличествоОстаток) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Количество * ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|				И ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|			ТОГДА ""-ВозвратКупона-""
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеКупона
		|			ТОГДА ""-Купон-""
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона))
		|						ТОГДА ""-Купон-""
		|					ИНАЧЕ ""-Тело-""
		|				КОНЕЦ
		|	КОНЕЦ КАК ВидПогашения,
		|	ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК ВидДвижения,
		|	СУММА((ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаНачальныйОстаток + ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаНачальныйОстаток + ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаПриход + ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаПриход) * ВЫБОР
		|			КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Сумма,
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)) КАК ФлагПогашенияОблигации,
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода) КАК ФлагВозвратаНКД,
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА _ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС > &ДатаВыгрузкиНачалоДня
		|			ТОГДА _ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС
		|		ИНАЧЕ &ДатаВыгрузкиНачалоДня
		|	КОНЕЦ КАК ПредполагаемаяДатаПоступленияДС,
		|	РАЗНОСТЬДАТ(_ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС, &ДатаВыгрузкиНачалоДня, ДЕНЬ) > 3 КАК ФлагОтсутствияОплатыПоПогашению
		|ПОМЕСТИТЬ _ЗадолженностьПоПогашениям
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&ДатаВыгрузкиНачалоДня,
		|			&ДатаВыгрузкиКонецДня,
		|			День,
		|			,
		|			Организация = &Организация
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|				И (Основание ССЫЛКА Документ.ПогашениеКупона
		|					ИЛИ Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|					ИЛИ Основание ССЫЛКА Документ.СделкаРЕПО)) КАК ЗадолженностьПоДенежнымСредствамОстаткиИОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаОблигаций КАК _ТаблицаОблигаций
		|			ПО ОперацииСЦеннымиБумагами.ЦеннаяБумага = _ТаблицаОблигаций.Ссылка
		|		ПО ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Организация = ОперацииСЦеннымиБумагами.Организация
		|			И ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание = ОперацииСЦеннымиБумагами.Регистратор
		|			И (ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
		|			И (ОперацииСЦеннымиБумагами.ЧастьСделкиРЕПО <> 2)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Количество * ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.СделкаРЕПО
		|				И ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|			ТОГДА ""-ВозвратКупона-""
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеКупона
		|			ТОГДА ""-Купон-""
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона))
		|						ТОГДА ""-Купон-""
		|					ИНАЧЕ ""-Тело-""
		|				КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ,
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)),
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода),
		|	ЗадолженностьПоДенежнымСредствамОстаткиИОбороты.Валюта,
		|	ВЫБОР
		|		КОГДА _ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС > &ДатаВыгрузкиНачалоДня
		|			ТОГДА _ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС
		|		ИНАЧЕ &ДатаВыгрузкиНачалоДня
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(_ТаблицаОблигаций.ПредполагаемаяДатаПоступленияДС, &ДатаВыгрузкиНачалоДня, ДЕНЬ) > 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокОплата.Дата КАК ДатаОплаты,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ДокОплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)) КАК ПогашениеОблигации,
		|	ДокОплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода) КАК ВозвратНКД,
		|	ВЫРАЗИТЬ(СУММА(ВЫБОР
		|				КОГДА ДокОплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации))
		|					ТОГДА ОснованиеОплат.Сумма * ОперацииСЦеннымиБумагами.Количество / ОперацииСЦеннымиБумагами.Сумма
		|				ИНАЧЕ ОснованиеОплат.СуммаКупона * ОперацииСЦеннымиБумагами.Количество / ОперацииСЦеннымиБумагами.СуммаКупона
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ДокОплата.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					ТОГДА 1
		|				ИНАЧЕ -1
		|			КОНЕЦ) КАК ЧИСЛО(19, 0)) КАК Количество
		|ПОМЕСТИТЬ _ОплатыПоПогашениям
		|ИЗ
		|	Документ.Оплата КАК ДокОплата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОснованиеОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|			ПО ОснованиеОплат.Основание = ОперацииСЦеннымиБумагами.Операция
		|				И (ОперацииСЦеннымиБумагами.Организация = &Организация)
		|		ПО ДокОплата.Ссылка = ОснованиеОплат.Ссылка
		|			И (ДокОплата.Проведен)
		|			И (ДокОплата.Организация = &Организация)
		|			И (ДокОплата.Дата МЕЖДУ &МинусМесяц И &ДатаВыгрузкиНачалоДня)
		|			И (ДокОплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага,
		|	ДокОплата.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)),
		|	ДокОплата.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода),
		|	ДокОплата.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиБумагКПогашению.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиБумагКПогашению.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиБумагКПогашению.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиБумагКПогашению.ФлагПогашенияОблигации КАК ФлагПогашенияОблигации,
		|	_ОстаткиБумагКПогашению.ПредполагаемаяДатаПоступленияДС КАК ПредполагаемаяДатаПоступленияДС,
		|	_ОстаткиБумагКПогашению.СуммаКупона КАК СуммаКупона,
		|	_ОстаткиБумагКПогашению.ЦенаОферты КАК ЦенаОферты,
		|	ЛОЖЬ КАК ФлагВозвратаНКД
		|ПОМЕСТИТЬ _ОстактиБумагДляРасчетаСумм
		|ИЗ
		|	_ОстаткиБумагКПогашению КАК _ОстаткиБумагКПогашению
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиБумагКПогашению.СчетДоверительногоУправления,
		|	_ОстаткиБумагКПогашению.ЦеннаяБумага,
		|	_ОстаткиБумагКПогашению.КоличествоОстаток,
		|	ЛОЖЬ,
		|	_ОстаткиБумагКПогашению.ПредполагаемаяДатаПоступленияДС,
		|	_ОстаткиБумагКПогашению.СуммаКупона,
		|	_ОстаткиБумагКПогашению.ЦенаОферты,
		|	ЛОЖЬ
		|ИЗ
		|	_ОстаткиБумагКПогашению КАК _ОстаткиБумагКПогашению
		|ГДЕ
		|	_ОстаткиБумагКПогашению.ФлагПогашенияОблигации
		|	И _ОстаткиБумагКПогашению.СуммаКупона <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиБумагКВозвратуКупона.СчетДоверительногоУправления,
		|	_ОстаткиБумагКВозвратуКупона.ЦеннаяБумага,
		|	_ОстаткиБумагКВозвратуКупона.КоличествоОстаток,
		|	_ОстаткиБумагКВозвратуКупона.ФлагПогашенияОблигации,
		|	_ОстаткиБумагКВозвратуКупона.ПредполагаемаяДатаПоступленияДС,
		|	_ОстаткиБумагКВозвратуКупона.СуммаКупона,
		|	_ОстаткиБумагКВозвратуКупона.ЦенаОферты,
		|	ИСТИНА
		|ИЗ
		|	_ОстаткиБумагКВозвратуКупона КАК _ОстаткиБумагКВозвратуКупона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ОстактиБумагДляРасчетаСумм.ФлагВозвратаНКД
		|			ТОГДА ""-ВозвратКупонаРасчет-""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ОстактиБумагДляРасчетаСумм.ФлагПогашенияОблигации
		|					ТОГДА ""-ТелоРасчет-""
		|				ИНАЧЕ ""-КупонРасчет-""
		|			КОНЕЦ
		|	КОНЕЦ КАК ВидПогашения,
		|	ВЫБОР
		|		КОГДА _ОстактиБумагДляРасчетаСумм.ФлагПогашенияОблигации
		|			ТОГДА ВЫБОР
		|					КОГДА _ОстактиБумагДляРасчетаСумм.ЦенаОферты = 0
		|						ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|					ИНАЧЕ _ОстактиБумагДляРасчетаСумм.ЦенаОферты
		|				КОНЕЦ
		|		ИНАЧЕ _ОстактиБумагДляРасчетаСумм.СуммаКупона
		|	КОНЕЦ * _ОстактиБумагДляРасчетаСумм.КоличествоОстаток КАК Сумма,
		|	_ОстактиБумагДляРасчетаСумм.ПредполагаемаяДатаПоступленияДС КАК ПредполагаемаяДатаПоступленияДС,
		|	_ОстактиБумагДляРасчетаСумм.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстактиБумагДляРасчетаСумм.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстактиБумагДляРасчетаСумм.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстактиБумагДляРасчетаСумм.ЦеннаяБумага.ВалютаНоминала КАК Валюта,
		|	_ОстактиБумагДляРасчетаСумм.ФлагВозвратаНКД КАК ФлагВозвратаНКД,
		|	_ОстактиБумагДляРасчетаСумм.ФлагПогашенияОблигации КАК ФлагПогашенияОблигации,
		|	ВЫБОР
		|		КОГДА _ОстактиБумагДляРасчетаСумм.ФлагВозвратаНКД
		|				И _ОстактиБумагДляРасчетаСумм.КоличествоОстаток < 0
		|			ТОГДА ""S""
		|		ИНАЧЕ ""B""
		|	КОНЕЦ КАК ВидДвижения
		|ПОМЕСТИТЬ _РасчетныеДанныеПоПогашениям
		|ИЗ
		|	_ОстактиБумагДляРасчетаСумм КАК _ОстактиБумагДляРасчетаСумм
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыПоПогашениям КАК _ОплатыПоПогашениям
		|		ПО _ОстактиБумагДляРасчетаСумм.СчетДоверительногоУправления = _ОплатыПоПогашениям.СчетДоверительногоУправления
		|			И _ОстактиБумагДляРасчетаСумм.ЦеннаяБумага = _ОплатыПоПогашениям.ЦеннаяБумага
		|			И _ОстактиБумагДляРасчетаСумм.КоличествоОстаток = _ОплатыПоПогашениям.Количество
		|			И _ОстактиБумагДляРасчетаСумм.ФлагПогашенияОблигации = _ОплатыПоПогашениям.ПогашениеОблигации
		|			И _ОстактиБумагДляРасчетаСумм.ФлагВозвратаНКД = _ОплатыПоПогашениям.ВозвратНКД
		|			И _ОстактиБумагДляРасчетаСумм.ПредполагаемаяДатаПоступленияДС <= _ОплатыПоПогашениям.ДатаОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|				&ДатаВыгрузкиНачалоДня,
		|				ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации) В
		|					(ВЫБРАТЬ
		|						_ТаблицаОблигаций.Ссылка
		|					ИЗ
		|						_ТаблицаОблигаций)) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _ОстактиБумагДляРасчетаСумм.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|ГДЕ
		|	_ОплатыПоПогашениям.ЦеннаяБумага ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ВидПогашения, _РасчетныеДанныеПоПогашениям.ВидПогашения) КАК ВидПогашения,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.Сумма, _РасчетныеДанныеПоПогашениям.Сумма) КАК Сумма,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ПредполагаемаяДатаПоступленияДС, _РасчетныеДанныеПоПогашениям.ПредполагаемаяДатаПоступленияДС) КАК ПредполагаемаяДатаПоступленияДС,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.СчетДоверительногоУправления, _РасчетныеДанныеПоПогашениям.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ЦеннаяБумага, _РасчетныеДанныеПоПогашениям.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.Валюта, _РасчетныеДанныеПоПогашениям.Валюта) КАК Валюта,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ФлагВозвратаНКД, _РасчетныеДанныеПоПогашениям.ФлагВозвратаНКД) КАК ФлагВозвратаНКД,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ФлагПогашенияОблигации, _РасчетныеДанныеПоПогашениям.ФлагПогашенияОблигации) КАК ФлагПогашенияОблигации,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ВидДвижения, _РасчетныеДанныеПоПогашениям.ВидДвижения) КАК ВидДвижения,
		|	ЕСТЬNULL(_ЗадолженностьПоПогашениям.ФлагОтсутствияОплатыПоПогашению, ЛОЖЬ) КАК ФлагОтсутствияОплатыПоПогашению
		|ПОМЕСТИТЬ _ИтоговыеДанныеПоПогашениям
		|ИЗ
		|	_РасчетныеДанныеПоПогашениям КАК _РасчетныеДанныеПоПогашениям
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПогашениям КАК _ЗадолженностьПоПогашениям
		|		ПО _РасчетныеДанныеПоПогашениям.СчетДоверительногоУправления = _ЗадолженностьПоПогашениям.СчетДоверительногоУправления
		|			И _РасчетныеДанныеПоПогашениям.ЦеннаяБумага = _ЗадолженностьПоПогашениям.ЦеннаяБумага
		|			И _РасчетныеДанныеПоПогашениям.ФлагВозвратаНКД = _ЗадолженностьПоПогашениям.ФлагВозвратаНКД
		|			И _РасчетныеДанныеПоПогашениям.ФлагПогашенияОблигации = _ЗадолженностьПоПогашениям.ФлагПогашенияОблигации
		|			И _РасчетныеДанныеПоПогашениям.КоличествоОстаток = _ЗадолженностьПоПогашениям.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация КАК Организация,
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо КАК ЮЛ_Банка,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ИсполнителиСобственныеЕдиничные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсполнителиПоДенежнымСредствамСобственные.Организация КАК Организация,
		|		ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта КАК Валюта
		|	ИЗ
		|		РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|	ГДЕ
		|		ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|		И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления В
		|				(ВЫБРАТЬ
		|					_Итоги.СчетДоверительногоУправления
		|				ИЗ
		|					_ИтоговыеДанныеПоПогашениям КАК _Итоги)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИсполнителиПоДенежнымСредствамСобственные.Организация,
		|		ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления,
		|		ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк) = 1) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО ВложенныйЗапрос.Организация = ИсполнителиПоДенежнымСредствамСобственные.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Валюта = ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.СчетДоверительногоУправления, _ИсполнителиСобственныеЕдиничные.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Валюта, _ИсполнителиСобственныеЕдиничные.Валюта) КАК Валюта,
		|	ЕСТЬNULL(НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.РасчетныйСчет.Банк.ЮрФизЛицо, _ИсполнителиСобственныеЕдиничные.ЮЛ_Банка) КАК ЮЛ_Банка
		|ПОМЕСТИТЬ _НастройкиУчетаДоходовСИсполнителями
		|ИЗ
		|	_ИсполнителиСобственныеЕдиничные КАК _ИсполнителиСобственныеЕдиничные
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаДоходовПоЦеннымБумагам.СрезПоследних(
		|				&ДатаВыгрузкиКонецДня,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_Итоги.СчетДоверительногоУправления
		|						ИЗ
		|							_ИтоговыеДанныеПоПогашениям КАК _Итоги)) КАК НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних
		|		ПО _ИсполнителиСобственныеЕдиничные.Организация = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Организация
		|			И _ИсполнителиСобственныеЕдиничные.СчетДоверительногоУправления = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.СчетДоверительногоУправления
		|			И _ИсполнителиСобственныеЕдиничные.Валюта = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиУчетаДоходовСИсполнителями.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НастройкиУчетаДоходовСИсполнителями.Валюта КАК Валюта,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, _НастройкиУчетаДоходовСИсполнителями.ЮЛ_Банка) КАК ЮЛ_Банка
		|ПОМЕСТИТЬ _БанкиПоступленияДенежныхСредств
		|ИЗ
		|	_НастройкиУчетаДоходовСИсполнителями КАК _НастройкиУчетаДоходовСИсполнителями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиКонецДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО _НастройкиУчетаДоходовСИсполнителями.ЮЛ_Банка = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""ПогашениеДС"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(МатрихКодыЦБ.Код + _ИтоговыеДанныеПоПогашениям.ВидПогашения + КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDate,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDateTime,
		|	_ИтоговыеДанныеПоПогашениям.ПредполагаемаяДатаПоступленияДС КАК paymentDate,
		|	_ИтоговыеДанныеПоПогашениям.ПредполагаемаяДатаПоступленияДС КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	ВЫБОР
		|		КОГДА _ИтоговыеДанныеПоПогашениям.ФлагВозвратаНКД
		|			ТОГДА ""003""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(_БанкиПоступленияДенежныхСредств.ЮЛ_Банка, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|					ТОГДА ""002""
		|				ИНАЧЕ ""001""
		|			КОНЕЦ
		|	КОНЕЦ КАК productCode,
		|	ВЫРАЗИТЬ(_ИтоговыеДанныеПоПогашениям.Сумма КАК ЧИСЛО(19, 4)) КАК quantity,
		|	1 КАК price,
		|	ВЫРАЗИТЬ(_ИтоговыеДанныеПоПогашениям.Сумма КАК ЧИСЛО(19, 4)) КАК payment,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК portfolioId,
		|	ВалютыОперации.МатрихКодВалюты КАК instrumentId,
		|	ВЫБОР
		|		КОГДА НЕ _ИтоговыеДанныеПоПогашениям.ФлагВозвратаНКД
		|			ТОГДА ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ)
		|		ИНАЧЕ &МатрихКод_НКО_НКЦ
		|	КОНЕЦ КАК counterpartyId,
		|	ВЫБОР
		|		КОГДА НЕ _ИтоговыеДанныеПоПогашениям.ФлагВозвратаНКД
		|			ТОГДА ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ)
		|	КОНЕЦ КАК depositaryId,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	"""" КАК expirationDate,
		|	ВалютыОперации.МатрихКодВалюты КАК paymentCurrencyCode,
		|	ВалютыОперации.МатрихКодВалюты КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	""BAL"" КАК type,
		|	0 КАК interestRate,
		|	ВЫБОР
		|		КОГДА _ИтоговыеДанныеПоПогашениям.Сумма < 0
		|			ТОГДА ""RFND""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	_ИтоговыеДанныеПоПогашениям.ВидДвижения КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PR"" КАК assetFlowsType,
		|	_ИтоговыеДанныеПоПогашениям.ФлагОтсутствияОплатыПоПогашению КАК ФлагОтсутствияОплаты,
		|	МатрихКодыЦБ.Код КАК МатрихКодЦБ
		|ПОМЕСТИТЬ _ОперацииДС
		|ИЗ
		|	_ИтоговыеДанныеПоПогашениям КАК _ИтоговыеДанныеПоПогашениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО _ИтоговыеДанныеПоПогашениям.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОперации
		|		ПО _ИтоговыеДанныеПоПогашениям.Валюта = ВалютыОперации.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БанкиПоступленияДенежныхСредств КАК _БанкиПоступленияДенежныхСредств
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|			ПО _БанкиПоступленияДенежныхСредств.ЮЛ_Банка = _КодыМатрихБанков.Объект
		|		ПО _ИтоговыеДанныеПоПогашениям.СчетДоверительногоУправления = _БанкиПоступленияДенежныхСредств.СчетДоверительногоУправления
		|			И _ИтоговыеДанныеПоПогашениям.Валюта = _БанкиПоступленияДенежныхСредств.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК МатрихКодыЦБ
		|		ПО _ИтоговыеДанныеПоПогашениям.ЦеннаяБумага = МатрихКодыЦБ.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	_РанееВыгруженныеОперации.PRODUCT_CODE КАК PRODUCT_CODE
		|ПОМЕСТИТЬ _РанееВыгруженныеПогашения
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""ПогашениеДС"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииДС.comment КАК comment,
		|	_ОперацииДС.id КАК id,
		|	_ОперацииДС.transactionId КАК transactionId,
		|	_ОперацииДС.isBalance КАК isBalance,
		|	_ОперацииДС.systemCode КАК systemCode,
		|	_ОперацииДС.tradeDate КАК tradeDate,
		|	_ОперацииДС.tradeDateTime КАК tradeDateTime,
		|	_ОперацииДС.paymentDate КАК paymentDate,
		|	_ОперацииДС.deliveryDate КАК deliveryDate,
		|	_ОперацииДС.tradingFloorId КАК tradingFloorId,
		|	_ОперацииДС.productCode КАК productCode,
		|	_ОперацииДС.quantity КАК quantity,
		|	_ОперацииДС.price КАК price,
		|	_ОперацииДС.payment КАК payment,
		|	_ОперацииДС.portfolioId КАК portfolioId,
		|	_ОперацииДС.instrumentId КАК instrumentId,
		|	_ОперацииДС.counterpartyId КАК counterpartyId,
		|	_ОперацииДС.depositaryId КАК depositaryId,
		|	_ОперацииДС.customerId КАК customerId,
		|	_ОперацииДС.expirationDate КАК expirationDate,
		|	_ОперацииДС.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ОперацииДС.priceCurrencyCode КАК priceCurrencyCode,
		|	_ОперацииДС.traderId КАК traderId,
		|	_ОперацииДС.lastTraderId КАК lastTraderId,
		|	_ОперацииДС.legNumber КАК legNumber,
		|	_ОперацииДС.accruedInterest КАК accruedInterest,
		|	_ОперацииДС.dirtyPrice КАК dirtyPrice,
		|	_ОперацииДС.branchId КАК branchId,
		|	_ОперацииДС.scope КАК scope,
		|	_ОперацииДС.type КАК type,
		|	_ОперацииДС.interestRate КАК interestRate,
		|	_ОперацииДС.tradingModeId КАК tradingModeId,
		|	_ОперацииДС.settlementType КАК settlementType,
		|	_ОперацииДС.side КАК side,
		|	_ОперацииДС.bOstatus КАК bOstatus,
		|	_ОперацииДС.isSkipDetails КАК isSkipDetails,
		|	_ОперацииДС.objectType КАК objectType,
		|	_ОперацииДС.originId КАК originId,
		|	_ОперацииДС.assetFlowsType КАК assetFlowsType,
		|	_ОперацииДС.МатрихКодЦБ КАК МатрихКодЦБ,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеПогашения.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ОперацииДС.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеПогашения.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления,
		|	_ОперацииДС.ФлагОтсутствияОплаты КАК ФлагОтсутствияОплаты
		|ИЗ
		|	_ОперацииДС КАК _ОперацииДС
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеПогашения КАК _РанееВыгруженныеПогашения
		|		ПО _ОперацииДС.id = _РанееВыгруженныеПогашения.ID
		|			И _ОперацииДС.quantity = _РанееВыгруженныеПогашения.QUANTITY
		|			И (ПОДСТРОКА(_ОперацииДС.productCode, 2, 2) = _РанееВыгруженныеПогашения.PRODUCT_CODE)";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("МинусМесяц", ДобавитьМесяц(ДатаВыгрузки, -1));
	Запрос.УстановитьПараметр("ПлюсМесяц", ДобавитьМесяц(ДатаВыгрузки, 1));
	Запрос.УстановитьПараметр("ЗавтраНачалоДня", КонецДня(ДатаВыгрузки) + 1);
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	//Депозиты. К депозитам выгружается закрывающая сделка на дату закрытия (с суммой тело депозита + проценты).
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК КредитныйИнструмент,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток) КАК Сумма
		|ПОМЕСТИТЬ _ЗадолженностьПоКредитнымИнструментам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ДатаВыгрузкиКонецДня,
		|			Организация = &Организация
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Организация = ЗакрытиеКредитногоИнструмента.Организация
		|			И ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = ЗакрытиеКредитногоИнструмента.СчетДоверительногоУправления
		|			И ЗадолженностиПоДенежнымСредствамОстатки.Основание = ЗакрытиеКредитногоИнструмента.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
		|	ЗакрытиеКредитногоИнструмента.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Организация, _ЗадолженностьПоКредитнымИнструментам.Организация) КАК Организация,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СчетДоверительногоУправления, _ЗадолженностьПоКредитнымИнструментам.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент, _ЗадолженностьПоКредитнымИнструментам.КредитныйИнструмент) КАК КредитныйИнструмент,
		|	ЕСТЬNULL(ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СуммаКонечныйОстаток, 0) + ЕСТЬNULL(_ЗадолженностьПоКредитнымИнструментам.Сумма, 0) КАК Сумма
		|ПОМЕСТИТЬ _ДенежныеСредстваВКредитныхИнструментах
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&ДатаВыгрузкиНачалоДня,
		|			&ДатаВыгрузкиКонецДня,
		|			День,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
		|				И ВидКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ВидыКредитныхИнструментов.Выданный)) КАК ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЗадолженностьПоКредитнымИнструментам КАК _ЗадолженностьПоКредитнымИнструментам
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.Организация = _ЗадолженностьПоКредитнымИнструментам.Организация
		|			И ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.СчетДоверительногоУправления = _ЗадолженностьПоКредитнымИнструментам.СчетДоверительногоУправления
		|			И ДенежныеСредстваВКредитныхИнструментахОстаткиИОбороты.КредитныйИнструмент = _ЗадолженностьПоКредитнымИнструментам.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад,
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.НомерПодтверждения = """"
		|			ТОГДА ЕСТЬNULL(ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора, """")
		|		ИНАЧЕ ЕСТЬNULL(ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора, """") + ""("" + ДепозитныеВклады.НомерПодтверждения + "")""
		|	КОНЕЦ КАК НомерДоговора,
		|	ВЫРАЗИТЬ(ДепозитныеВклады._НачальныйНоминал КАК ЧИСЛО(19, 4)) КАК Номинал,
		|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРегистрации,
		|	ДепозитныеВклады.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК) КАК Биржевой,
		|	_ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо) КАК ЮрЛицоБанкаДепозитногоВклада,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	_ДенежныеСредстваВКредитныхИнструментах.Сумма КАК Сумма,
		|	_ДенежныеСредстваВКредитныхИнструментах.Сумма = 0 КАК ДепозитЗакрыт
		|ПОМЕСТИТЬ _ДепозитныеВклады
		|ИЗ
		|	_ДенежныеСредстваВКредитныхИнструментах КАК _ДенежныеСредстваВКредитныхИнструментах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|			ПО ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ПО _ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО _ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|	УсловияКредитныхИнструментовСрезПоследних.Действует КАК Действует,
		|	УсловияКредитныхИнструментовСрезПоследних.Реинвестировать КАК Реинвестировать,
		|	УсловияКредитныхИнструментовСрезПоследних.Период КАК Период,
		|	УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств.Банк.ЮрФизЛицо КАК ЮрЛицоБанкаВозвратаДС
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладов
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_ДепозитныеВклады.ДепозитныйВклад
		|					ИЗ
		|						_ДепозитныеВклады КАК _ДепозитныеВклады)
		|				И ДатаНачалаДействияУсловий <= &ДатаВыгрузкиНачалоДня) КАК УсловияКредитныхИнструментовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	_УсловияДепозитныхВкладов.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладов.Процент КАК Процент,
		|	_УсловияДепозитныхВкладов.Действует КАК Действует,
		|	_УсловияДепозитныхВкладов.ЮрЛицоБанкаВозвратаДС КАК ЮрЛицоБанкаВозвратаДС
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладовАкутальныеНаДатыПериода
		|ИЗ
		|	_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.Период) КАК Период,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|		ИЗ
		|			_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ГДЕ
		|			_УсловияДепозитныхВкладов.Действует
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент) КАК ВложенныйЗапрос
		|		ПО _УсловияДепозитныхВкладов.КредитныйИнструмент = ВложенныйЗапрос.КредитныйИнструмент
		|			И _УсловияДепозитныхВкладов.Период = ВложенныйЗапрос.Период
		|			И _УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий = ВложенныйЗапрос.ДатаНачалаДействияУсловий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитныеВклады.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДепозитныеВклады.КодСчета КАК КодСчета,
		|	_ДепозитныеВклады.Клиент КАК Клиент,
		|	_ДепозитныеВклады.ЮрЛицоБанкаДепозитногоВклада КАК ЮрЛицоБанкаДепозитногоВклада,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ЮрЛицоБанкаВозвратаДС) КАК ЮрЛицоБанкаВозвратаДС,
		|	_ДепозитныеВклады.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_ДепозитныеВклады.Биржевой КАК Биржевой,
		|	_ДепозитныеВклады.НомерДоговора КАК НомерДоговора,
		|	_ДепозитныеВклады.Номинал КАК Номинал,
		|	_ДепозитныеВклады.ДатаРегистрации КАК ДатаРегистрации,
		|	_ДепозитныеВклады.Сумма КАК Сумма,
		|	_ДепозитныеВклады.ДепозитЗакрыт КАК ДепозитЗакрыт,
		|	ВЫРАЗИТЬ(_ДепозитныеВклады.ДепозитныйВклад.БанковскийСчет КАК Справочник.БанковскиеСчета).Валюта КАК ВалютаНоминала,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.Процент КАК Процент,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Авансом) КАК ФлагВыплатыПроцентовАвансом,
		|	МИНИМУМ(ДанныеКалендаря.Дата) КАК ПредполагаемаяДатаПогашения
		|ПОМЕСТИТЬ _ДепозитныеВкладыСУсловиями
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияДепозитныхВкладовАкутальныеНаДатыПериода КАК _УсловияДепозитныхВкладовАкутальныеНаДатыПериода
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|			ПО _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ЮрЛицоБанкаВозвратаДС = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ПО _ДепозитныеВклады.ДепозитныйВклад = _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения <= ДанныеКалендаря.Дата)
		|			И (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДепозитныеВклады.СчетДоверительногоУправления,
		|	_ДепозитныеВклады.КодСчета,
		|	_ДепозитныеВклады.Клиент,
		|	_ДепозитныеВклады.ЮрЛицоБанкаДепозитногоВклада,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, _УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ЮрЛицоБанкаВозвратаДС),
		|	_ДепозитныеВклады.ДепозитныйВклад,
		|	_ДепозитныеВклады.Биржевой,
		|	_ДепозитныеВклады.НомерДоговора,
		|	_ДепозитныеВклады.Номинал,
		|	_ДепозитныеВклады.ДатаРегистрации,
		|	_ДепозитныеВклады.Сумма,
		|	_ДепозитныеВклады.ДепозитЗакрыт,
		|	ВЫРАЗИТЬ(_ДепозитныеВклады.ДепозитныйВклад.БанковскийСчет КАК Справочник.БанковскиеСчета).Валюта,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаПогашения,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ДатаНачалаДействияУсловий,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.Процент,
		|	_УсловияДепозитныхВкладовАкутальныеНаДатыПериода.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Авансом)";
	#КонецОбласти
	
	Запрос.Выполнить();
	
	ВыборкаДепозитов = МВТ.Таблицы["_ДепозитныеВкладыСУсловиями"].ПолучитьДанные().Выбрать();
	
	ТаблицаПроцентовПоДепозитам = Новый ТаблицаЗначений;
	
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("КредитныйИнструмент", Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Проценты", Новый ОписаниеТипов("Число"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("ДатаДенежногоПотока", Новый ОписаниеТипов("Дата"));
	
	Пока ВыборкаДепозитов.Следующий() Цикл
		Если Не ВыборкаДепозитов.ДепозитЗакрыт Тогда
			Попытка
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РаботаСКредитнымиИнструментами.ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(ВыборкаДепозитов.СчетДоверительногоУправления, ВыборкаДепозитов.ДатаПогашения,,,,,ВыборкаДепозитов.ДепозитныйВклад), ТаблицаПроцентовПоДепозитам);
			Исключение
				ЗарегистрироватьУведомление(ОписаниеОшибки(), Истина);
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(ВыборкаДепозитов.ПериодичностьВыплатыПроцентов) Тогда
				ЗарегистрироватьУведомление("В условиях депозита [" + ВыборкаДепозитов.ДепозитныйВклад + "] не указана периодичность выплаты процентов.", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПроцентовПоДепозитам.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ТаблицаПроцентовПоДепозитам.Проценты КАК Проценты,
		|	ТаблицаПроцентовПоДепозитам.Операция КАК Операция,
		|	ТаблицаПроцентовПоДепозитам.ДатаДенежногоПотока КАК ДатаДенежногоПотока
		|ПОМЕСТИТЬ _ПроцентыПоДепозитнымВкладам
		|ИЗ
		|	&ТаблицаПроцентовПоДепозитам КАК ТаблицаПроцентовПоДепозитам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроцентыПоДепозитнымВкладам.КредитныйИнструмент КАК ДепозитныйВклад,
		|	СУММА(_ПроцентыПоДепозитнымВкладам.Проценты) КАК Сумма
		|ПОМЕСТИТЬ _СтоимостиДепозитовНаДатуПогашения
		|ИЗ
		|	_ПроцентыПоДепозитнымВкладам КАК _ПроцентыПоДепозитнымВкладам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПроцентыПоДепозитнымВкладам.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|				ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СуммаРынок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДепозита,
		|	СУММА(ВЫБОР
		|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты)
		|				ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СуммаРынок
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПроцентов
		|ПОМЕСТИТЬ _СтоимостиАктивов
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СрезПоследних(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация = &Организация
		|				И СубъектАналитики В
		|					(ВЫБРАТЬ
		|						_ДепозитныеВклады.ДепозитныйВклад
		|					ИЗ
		|						_ДепозитныеВклады КАК _ДепозитныеВклады)
		|				И ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты))) КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагамСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Организация КАК Организация,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.Оплата
		|				И ЗадолженностиПоДенежнымСредствам.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.РазмещениеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПриходПроцентовПоКредитномуИнструменту
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ПриходПроцентовПоКредитномуИнструменту).КредитныйИнструмент
		|	КОНЕЦ КАК Депозит,
		|	ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК) КАК Биржевой,
		|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	СУММА(ОстаткиДенежныхСредств.Сумма * ВЫБОР
		|			КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ _РазмещенияЗакрытияДепозитов
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО ОстаткиДенежныхСредств.Организация = ЗадолженностиПоДенежнымСредствам.Организация
		|			И ОстаткиДенежныхСредств.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредств.Регистратор = ЗадолженностиПоДенежнымСредствам.Регистратор
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И (ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты))
		|			ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе)
		|			ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ЗакрытиеДепозитногоВклада)
		|			ИЛИ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу))
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаВыгрузкиНачалоДня И &ДатаВыгрузкиКонецДня
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредств.Организация,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.Оплата
		|				И ЗадолженностиПоДенежнымСредствам.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.РазмещениеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.РазмещениеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПриходПроцентовПоКредитномуИнструменту
		|			ТОГДА ВЫРАЗИТЬ(ОстаткиДенежныхСредств.Регистратор КАК Документ.ПриходПроцентовПоКредитномуИнструменту).КредитныйИнструмент
		|	КОНЕЦ,
		|	ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК),
		|	ОстаткиДенежныхСредств.РасчетныйСчет,
		|	ОстаткиДенежныхСредств.ВидДвижения,
		|	ОстаткиДенежныхСредств.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Депозит КАК Депозит,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ВложенныйЗапрос.БанкЮрЛицо) КАК БанкЮрЛицо
		|ПОМЕСТИТЬ _ЮрЛицаБанковРазмещенияЗакрытияДепозитов
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_РазмещенияЗакрытияДепозитов.Депозит КАК Депозит,
		|		ВЫБОР
		|			КОГДА _РазмещенияЗакрытияДепозитов.Биржевой
		|				ТОГДА ВЫРАЗИТЬ(_РазмещенияЗакрытияДепозитов.Депозит КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо
		|			ИНАЧЕ _РазмещенияЗакрытияДепозитов.РасчетныйСчет.Банк.ЮрФизЛицо
		|		КОНЕЦ КАК БанкЮрЛицо
		|	ИЗ
		|		_РазмещенияЗакрытияДепозитов КАК _РазмещенияЗакрытияДепозитов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ВложенныйЗапрос.БанкЮрЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыМатрихКлиентов.Код + ""-"" + _ДепозитныеВкладыСУсловиями.НомерДоговора КАК Номер,
		|	ВЫБОР
		|		КОГДА _ДепозитныеВкладыСУсловиями.ПредполагаемаяДатаПогашения < &ДатаВыгрузкиНачалоДня
		|			ТОГДА &ДатаВыгрузкиНачалоДня
		|		ИНАЧЕ _ДепозитныеВкладыСУсловиями.ПредполагаемаяДатаПогашения
		|	КОНЕЦ КАК ПредполагаемаяДатаПогашения,
		|	_ДепозитныеВкладыСУсловиями.Номинал КАК Номинал,
		|	_ДепозитныеВкладыСУсловиями.КодСчета КАК КодСчетаДУ,
		|	ВалютыДепозитов.МатрихКодВалюты КАК КодВалютыДепозита,
		|	_КодыМатрихБанков.Код КАК МатрихКодБанка,
		|	_КодыМатрихБанковВозвратаДС.Код КАК МатрихКодБанкаВозвратаДС,
		|	_КодыМатрихКлиентов.Код КАК МатрихКодЮрЛицаКлиента,
		|	_ДепозитныеВкладыСУсловиями.ДатаПогашения КАК ДатаПогашения,
		|	_ДепозитныеВкладыСУсловиями.Процент КАК Процент,
		|	_ДепозитныеВкладыСУсловиями.СчетДоверительногоУправления КАК СчетДУ,
		|	_ДепозитныеВкладыСУсловиями.ДепозитныйВклад КАК Депозит,
		|	_ДепозитныеВкладыСУсловиями.Биржевой КАК Биржевой,
		|	ВЫБОР
		|		КОГДА _ДепозитныеВкладыСУсловиями.ФлагВыплатыПроцентовАвансом
		|			ТОГДА 0
		|		ИНАЧЕ _ДепозитныеВкладыСУсловиями.Номинал * (_ДепозитныеВкладыСУсловиями.Процент / 100) * (1 / ДЕНЬГОДА(КОНЕЦПЕРИОДА(&ДатаВыгрузкиНачалоДня, ГОД)))
		|	КОНЕЦ КАК СуммаПроцентовВДень,
		|	_ДепозитныеВкладыСУсловиями.Номинал * (_ДепозитныеВкладыСУсловиями.Процент / 100) * (1 / ДЕНЬГОДА(КОНЕЦПЕРИОДА(&ПериодПлюс5, ГОД))) КАК СуммаПроцентовВДень_ТПлюсПять,
		|	_ДепозитныеВкладыСУсловиями.ДатаРегистрации КАК ДатаРегистрации,
		|	_ДепозитныеВкладыСУсловиями.ФлагВыплатыПроцентовАвансом КАК ФлагВыплатыПроцентовАвансом,
		|	ЕСТЬNULL(_СтоимостиАктивов.СуммаДепозита, 0) КАК СуммаСтоимостьДепозита,
		|	_ДепозитныеВкладыСУсловиями.ДепозитЗакрыт КАК ДепозитЗакрыт,
		|	_ДепозитныеВкладыСУсловиями.Сумма + ЕСТЬNULL(_СтоимостиДепозитовНаДатуПогашения.Сумма, 0) КАК ПолнаяСтоимостьДепозитаКЗакрытию,
		|	ВЫБОР
		|		КОГДА _ДепозитныеВкладыСУсловиями.ФлагВыплатыПроцентовАвансом
		|				ИЛИ ЕСТЬNULL(_СтоимостиАктивов.СуммаДепозита, 0) + ЕСТЬNULL(_СтоимостиАктивов.СуммаПроцентов, 0) = 0
		|			ТОГДА _ДепозитныеВкладыСУсловиями.Номинал
		|		ИНАЧЕ ЕСТЬNULL(_СтоимостиАктивов.СуммаДепозита, 0) + ЕСТЬNULL(_СтоимостиАктивов.СуммаПроцентов, 0)
		|	КОНЕЦ КАК СтоимостьДепозитаНаДатуВыгрузки
		|ПОМЕСТИТЬ _ДанныеПоДепозитам
		|ИЗ
		|	_ДепозитныеВкладыСУсловиями КАК _ДепозитныеВкладыСУсловиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|		ПО _ДепозитныеВкладыСУсловиями.Клиент = _КодыМатрихКлиентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыДепозитов
		|		ПО _ДепозитныеВкладыСУсловиями.ВалютаНоминала = ВалютыДепозитов.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостиАктивов КАК _СтоимостиАктивов
		|		ПО _ДепозитныеВкладыСУсловиями.ДепозитныйВклад = _СтоимостиАктивов.СубъектАналитики
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостиДепозитовНаДатуПогашения КАК _СтоимостиДепозитовНаДатуПогашения
		|		ПО _ДепозитныеВкладыСУсловиями.ДепозитныйВклад = _СтоимостиДепозитовНаДатуПогашения.ДепозитныйВклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанковВозвратаДС
		|		ПО _ДепозитныеВкладыСУсловиями.ЮрЛицоБанкаВозвратаДС = _КодыМатрихБанковВозвратаДС.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _ДепозитныеВкладыСУсловиями.ЮрЛицоБанкаДепозитногоВклада = _КодыМатрихБанков.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""transfer_ДС"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_ДанныеПоДепозитам.Номер + ""-transfer"" КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDate,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDateTime,
		|	&ДатаВыгрузкиНачалоДня КАК paymentDate,
		|	&ДатаВыгрузкиНачалоДня КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	""001"" КАК productCode,
		|	ВЫРАЗИТЬ(_РазмещенияЗакрытияДепозитов.Сумма КАК ЧИСЛО(19, 4)) КАК quantity,
		|	1 КАК price,
		|	ВЫРАЗИТЬ(_РазмещенияЗакрытияДепозитов.Сумма КАК ЧИСЛО(19, 4)) КАК payment,
		|	_ДанныеПоДепозитам.КодСчетаДУ КАК portfolioId,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК instrumentId,
		|	_КодыМатрихБанков.Код КАК counterpartyId,
		|	_КодыМатрихБанков.Код КАК depositaryId,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента КАК customerId,
		|	"""" КАК expirationDate,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК paymentCurrencyCode,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента КАК branchId,
		|	""BRK"" КАК scope,
		|	""BAL"" КАК type,
		|	0 КАК interestRate,
		|	"""" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	ВЫБОР
		|		КОГДА _РазмещенияЗакрытияДепозитов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ""S""
		|		ИНАЧЕ ""B""
		|	КОНЕЦ КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PR"" КАК assetFlowsType
		|ПОМЕСТИТЬ _ОперацииРазмещенияЗакрытияДепозитов
		|ИЗ
		|	_РазмещенияЗакрытияДепозитов КАК _РазмещенияЗакрытияДепозитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеПоДепозитам КАК _ДанныеПоДепозитам
		|		ПО _РазмещенияЗакрытияДепозитов.Депозит = _ДанныеПоДепозитам.Депозит
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЮрЛицаБанковРазмещенияЗакрытияДепозитов КАК _ЮрЛицаБанковРазмещенияЗакрытияДепозитов
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|			ПО _ЮрЛицаБанковРазмещенияЗакрытияДепозитов.БанкЮрЛицо = _КодыМатрихБанков.Объект
		|		ПО _РазмещенияЗакрытияДепозитов.Депозит = _ЮрЛицаБанковРазмещенияЗакрытияДепозитов.Депозит
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	_РанееВыгруженныеОперации.COMMENT КАК COMMENT
		|ПОМЕСТИТЬ _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""transfer_ДС"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииРазмещенияЗакрытияДепозитов.comment КАК comment,
		|	_ОперацииРазмещенияЗакрытияДепозитов.id КАК id,
		|	_ОперацииРазмещенияЗакрытияДепозитов.transactionId КАК transactionId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.isBalance КАК isBalance,
		|	_ОперацииРазмещенияЗакрытияДепозитов.systemCode КАК systemCode,
		|	_ОперацииРазмещенияЗакрытияДепозитов.tradeDate КАК tradeDate,
		|	_ОперацииРазмещенияЗакрытияДепозитов.tradeDateTime КАК tradeDateTime,
		|	_ОперацииРазмещенияЗакрытияДепозитов.paymentDate КАК paymentDate,
		|	_ОперацииРазмещенияЗакрытияДепозитов.deliveryDate КАК deliveryDate,
		|	_ОперацииРазмещенияЗакрытияДепозитов.tradingFloorId КАК tradingFloorId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.productCode КАК productCode,
		|	_ОперацииРазмещенияЗакрытияДепозитов.quantity КАК quantity,
		|	_ОперацииРазмещенияЗакрытияДепозитов.price КАК price,
		|	_ОперацииРазмещенияЗакрытияДепозитов.payment КАК payment,
		|	_ОперацииРазмещенияЗакрытияДепозитов.portfolioId КАК portfolioId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.instrumentId КАК instrumentId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.counterpartyId КАК counterpartyId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.depositaryId КАК depositaryId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.customerId КАК customerId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.expirationDate КАК expirationDate,
		|	_ОперацииРазмещенияЗакрытияДепозитов.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ОперацииРазмещенияЗакрытияДепозитов.priceCurrencyCode КАК priceCurrencyCode,
		|	_ОперацииРазмещенияЗакрытияДепозитов.traderId КАК traderId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.lastTraderId КАК lastTraderId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.legNumber КАК legNumber,
		|	_ОперацииРазмещенияЗакрытияДепозитов.accruedInterest КАК accruedInterest,
		|	_ОперацииРазмещенияЗакрытияДепозитов.dirtyPrice КАК dirtyPrice,
		|	_ОперацииРазмещенияЗакрытияДепозитов.branchId КАК branchId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.scope КАК scope,
		|	_ОперацииРазмещенияЗакрытияДепозитов.type КАК type,
		|	_ОперацииРазмещенияЗакрытияДепозитов.interestRate КАК interestRate,
		|	_ОперацииРазмещенияЗакрытияДепозитов.tradingModeId КАК tradingModeId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.settlementType КАК settlementType,
		|	_ОперацииРазмещенияЗакрытияДепозитов.side КАК side,
		|	_ОперацииРазмещенияЗакрытияДепозитов.bOstatus КАК bOstatus,
		|	_ОперацииРазмещенияЗакрытияДепозитов.isSkipDetails КАК isSkipDetails,
		|	_ОперацииРазмещенияЗакрытияДепозитов.objectType КАК objectType,
		|	_ОперацииРазмещенияЗакрытияДепозитов.originId КАК originId,
		|	_ОперацииРазмещенияЗакрытияДепозитов.assetFlowsType КАК assetFlowsType,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ОперацииРазмещенияЗакрытияДепозитов.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ПОМЕСТИТЬ _ОперацииРазмещенияЗакрытияДепозитовДляВыгрузки
		|ИЗ
		|	_ОперацииРазмещенияЗакрытияДепозитов КАК _ОперацииРазмещенияЗакрытияДепозитов
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах КАК _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах
		|		ПО _ОперацииРазмещенияЗакрытияДепозитов.id = _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах.ID
		|			И _ОперацииРазмещенияЗакрытияДепозитов.quantity = _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах.QUANTITY
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""Депозит"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_ДанныеПоДепозитам.Номер КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	1 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	_ДанныеПоДепозитам.ДатаРегистрации КАК tradeDate,
		|	_ДанныеПоДепозитам.ДатаРегистрации КАК tradeDateTime,
		|	_ДанныеПоДепозитам.ДатаРегистрации КАК paymentDate,
		|	_ДанныеПоДепозитам.ДатаРегистрации КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	"""" КАК productCode,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом
		|			ТОГДА _ДанныеПоДепозитам.СуммаСтоимостьДепозита
		|		ИНАЧЕ _ДанныеПоДепозитам.Номинал
		|	КОНЕЦ КАК quantity,
		|	1 КАК price,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом
		|			ТОГДА _ДанныеПоДепозитам.СуммаСтоимостьДепозита
		|		ИНАЧЕ _ДанныеПоДепозитам.Номинал
		|	КОНЕЦ КАК payment,
		|	_ДанныеПоДепозитам.КодСчетаДУ КАК portfolioId,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК instrumentId,
		|	_ДанныеПоДепозитам.МатрихКодБанка КАК counterpartyId,
		|	_ДанныеПоДепозитам.МатрихКодБанка КАК depositaryId,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента КАК customerId,
		|	_ДанныеПоДепозитам.ПредполагаемаяДатаПогашения КАК expirationDate,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК paymentCurrencyCode,
		|	_ДанныеПоДепозитам.КодВалютыДепозита КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента КАК branchId,
		|	""BRK"" КАК scope,
		|	""LOA"" КАК type,
		|	_ДанныеПоДепозитам.Процент КАК interestRate,
		|	"""" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	""S"" КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PR"" КАК assetFlowsType,
		|	_ДанныеПоДепозитам.СчетДУ КАК СчетДУ,
		|	_ДанныеПоДепозитам.Депозит КАК Депозит,
		|	_ДанныеПоДепозитам.СуммаПроцентовВДень КАК СуммаПроцентовВДень,
		|	_ДанныеПоДепозитам.СуммаПроцентовВДень_ТПлюсПять КАК СуммаПроцентовВДень_ТПлюсПять,
		|	ЕСТЬNULL(-РезервыПредстоящихРасходовОстатки.СуммаОстаток, 0) КАК СуммаРезерва,
		|	_ДанныеПоДепозитам.СтоимостьДепозитаНаДатуВыгрузки КАК СтоимостьДепозитаНаДатуВыгрузки,
		|	_ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом КАК ФлагВыплатыПроцентовАвансом
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	_ДанныеПоДепозитам КАК _ДанныеПоДепозитам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыПредстоящихРасходов.Остатки(КОНЕЦПЕРИОДА(&ДатаВыгрузкиНачалоДня, ДЕНЬ), Организация = &Организация) КАК РезервыПредстоящихРасходовОстатки
		|		ПО _ДанныеПоДепозитам.Депозит = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|ГДЕ
		|	НЕ _ДанныеПоДепозитам.ДепозитЗакрыт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""loan_ДС"",
		|	_ДанныеПоДепозитам.Номер + ""-loan"",
		|	"""",
		|	0,
		|	""1C"",
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения < &ДатаВыгрузкиНачалоДня
		|			ТОГДА &ДатаВыгрузкиНачалоДня
		|		ИНАЧЕ _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения < &ДатаВыгрузкиНачалоДня
		|			ТОГДА &ДатаВыгрузкиНачалоДня
		|		ИНАЧЕ _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения < &ДатаВыгрузкиНачалоДня
		|			ТОГДА &ДатаВыгрузкиНачалоДня
		|		ИНАЧЕ _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения < &ДатаВыгрузкиНачалоДня
		|			ТОГДА &ДатаВыгрузкиНачалоДня
		|		ИНАЧЕ _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения
		|	КОНЕЦ,
		|	"""",
		|	"""",
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом
		|			ТОГДА _ДанныеПоДепозитам.Номинал
		|		ИНАЧЕ _ДанныеПоДепозитам.ПолнаяСтоимостьДепозитаКЗакрытию
		|	КОНЕЦ,
		|	1,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом
		|			ТОГДА _ДанныеПоДепозитам.Номинал
		|		ИНАЧЕ _ДанныеПоДепозитам.ПолнаяСтоимостьДепозитаКЗакрытию
		|	КОНЕЦ,
		|	_ДанныеПоДепозитам.КодСчетаДУ,
		|	_ДанныеПоДепозитам.КодВалютыДепозита,
		|	_ДанныеПоДепозитам.МатрихКодБанка,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.Биржевой
		|			ТОГДА _ДанныеПоДепозитам.МатрихКодБанка
		|		ИНАЧЕ _ДанныеПоДепозитам.МатрихКодБанкаВозвратаДС
		|	КОНЕЦ,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента,
		|	ВЫБОР
		|		КОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения > _ДанныеПоДепозитам.ДатаПогашения
		|			ТОГДА _ДанныеПоДепозитам.ПредполагаемаяДатаПогашения
		|		ИНАЧЕ _ДанныеПоДепозитам.ДатаПогашения
		|	КОНЕЦ,
		|	_ДанныеПоДепозитам.КодВалютыДепозита,
		|	_ДанныеПоДепозитам.КодВалютыДепозита,
		|	0,
		|	0,
		|	0,
		|	0,
		|	1,
		|	_ДанныеПоДепозитам.МатрихКодЮрЛицаКлиента,
		|	""BRK"",
		|	""BAL"",
		|	_ДанныеПоДепозитам.Процент,
		|	"""",
		|	""SAF"",
		|	""B"",
		|	""ST"",
		|	1,
		|	""T"",
		|	"""",
		|	""PR"",
		|	_ДанныеПоДепозитам.СчетДУ,
		|	_ДанныеПоДепозитам.Депозит,
		|	_ДанныеПоДепозитам.СуммаПроцентовВДень,
		|	_ДанныеПоДепозитам.СуммаПроцентовВДень_ТПлюсПять,
		|	ЕСТЬNULL(-РезервыПредстоящихРасходовОстатки.СуммаОстаток, 0),
		|	_ДанныеПоДепозитам.СтоимостьДепозитаНаДатуВыгрузки,
		|	_ДанныеПоДепозитам.ФлагВыплатыПроцентовАвансом
		|ИЗ
		|	_ДанныеПоДепозитам КАК _ДанныеПоДепозитам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыПредстоящихРасходов.Остатки(КОНЕЦПЕРИОДА(&ДатаВыгрузкиНачалоДня, ДЕНЬ), Организация = &Организация) КАК РезервыПредстоящихРасходовОстатки
		|		ПО _ДанныеПоДепозитам.Депозит = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|ГДЕ
		|	НЕ _ДанныеПоДепозитам.ДепозитЗакрыт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	_РанееВыгруженныеОперации.COMMENT КАК COMMENT
		|ПОМЕСТИТЬ _РанееВыгруженныеДепозиты
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	(_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""Депозит"" КАК СТРОКА(15)))
		|			ИЛИ _РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""loan_ДС"" КАК СТРОКА(15))))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Депозиты.comment КАК comment,
		|	_Депозиты.id КАК id,
		|	_Депозиты.transactionId КАК transactionId,
		|	_Депозиты.isBalance КАК isBalance,
		|	_Депозиты.systemCode КАК systemCode,
		|	_Депозиты.tradeDate КАК tradeDate,
		|	_Депозиты.tradeDateTime КАК tradeDateTime,
		|	_Депозиты.paymentDate КАК paymentDate,
		|	_Депозиты.deliveryDate КАК deliveryDate,
		|	_Депозиты.tradingFloorId КАК tradingFloorId,
		|	_Депозиты.productCode КАК productCode,
		|	ВЫБОР
		|		КОГДА _Депозиты.quantity = 0
		|			ТОГДА ЕСТЬNULL(_РанееВыгруженныеДепозиты.QUANTITY, 0)
		|		ИНАЧЕ _Депозиты.quantity
		|	КОНЕЦ КАК quantity,
		|	_Депозиты.price КАК price,
		|	_Депозиты.payment КАК payment,
		|	_Депозиты.portfolioId КАК portfolioId,
		|	_Депозиты.instrumentId КАК instrumentId,
		|	_Депозиты.counterpartyId КАК counterpartyId,
		|	_Депозиты.depositaryId КАК depositaryId,
		|	_Депозиты.customerId КАК customerId,
		|	_Депозиты.expirationDate КАК expirationDate,
		|	_Депозиты.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_Депозиты.priceCurrencyCode КАК priceCurrencyCode,
		|	_Депозиты.traderId КАК traderId,
		|	_Депозиты.lastTraderId КАК lastTraderId,
		|	_Депозиты.legNumber КАК legNumber,
		|	_Депозиты.accruedInterest КАК accruedInterest,
		|	_Депозиты.dirtyPrice КАК dirtyPrice,
		|	_Депозиты.branchId КАК branchId,
		|	_Депозиты.scope КАК scope,
		|	_Депозиты.type КАК type,
		|	_Депозиты.interestRate КАК interestRate,
		|	_Депозиты.tradingModeId КАК tradingModeId,
		|	_Депозиты.settlementType КАК settlementType,
		|	_Депозиты.side КАК side,
		|	_Депозиты.bOstatus КАК bOstatus,
		|	_Депозиты.isSkipDetails КАК isSkipDetails,
		|	_Депозиты.objectType КАК objectType,
		|	_Депозиты.originId КАК originId,
		|	_Депозиты.assetFlowsType КАК assetFlowsType,
		|	_Депозиты.СчетДУ КАК СчетДУ,
		|	_Депозиты.Депозит КАК Депозит,
		|	_Депозиты.СуммаПроцентовВДень КАК СуммаПроцентовВДень,
		|	_Депозиты.СуммаПроцентовВДень_ТПлюсПять КАК СуммаПроцентовВДень_ТПлюсПять,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеДепозиты.ID ЕСТЬ NULL
		|				ИЛИ _Депозиты.quantity <> _РанееВыгруженныеДепозиты.QUANTITY
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _Депозиты.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеДепозиты.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления,
		|	_Депозиты.СуммаРезерва КАК СуммаРезерва,
		|	_Депозиты.СтоимостьДепозитаНаДатуВыгрузки КАК СтоимостьДепозитаНаДатуВыгрузки,
		|	_Депозиты.ФлагВыплатыПроцентовАвансом КАК ФлагВыплатыПроцентовАвансом
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеДепозиты КАК _РанееВыгруженныеДепозиты
		|		ПО _Депозиты.id = _РанееВыгруженныеДепозиты.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДепозитныеВклады
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияДепозитныхВкладов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияДепозитныхВкладовАкутальныеНаДатыПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДепозитныеВкладыСУсловиями
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПроцентыПоДепозитнымВкладам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СтоимостиДепозитовНаДатуПогашения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СтоимостиАктивов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеПоДепозитам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Депозиты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеДепозиты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РазмещенияЗакрытияДепозитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОперацииРазмещенияЗакрытияДепозитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеРазмещенияЗакрытияКредитныхИнструментах";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТаблицаПроцентовПоДепозитам", ТаблицаПроцентовПоДепозитам);
	Запрос.УстановитьПараметр("ПериодПлюс5", КонецДня(ДатаВыгрузки) + (86400 * 5));
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	// При закрытии/размещении депозита В Т0 выгружаем операцию перемещения ДС. Тем самым уменьшаем/увеличиваем остаток ДС на счете.
	ОбработатьРезультатЗапроса(МВТ.Таблицы["_ОперацииРазмещенияЗакрытияДепозитовДляВыгрузки"].ПолучитьДанные().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	// Сделки предыдущего периода с неистекшим сроком исполнения загружаем в одно время с остатками
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|				И СделкаДокумент.НомерСделки = """"
		|			ТОГДА ПОДСТРОКА(СделкаДокумент.Номер, 14, 20)
		|		ИНАЧЕ СделкаДокумент.НомерСделки
		|	КОНЕЦ КАК НомерСделки,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ДатаСделки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОперацииСЦеннымиБумагами.ДатаОплатыПлановая
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаОплаты
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК ТипСделки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|				И ОперацииСЦеннымиБумагами.Количество = 0
		|			ТОГДА 1
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Количество
		|	КОНЕЦ КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.СуммаКупона КАК СуммаКупона,
		|	ОперацииСЦеннымиБумагами.Сумма КАК Сумма,
		|	ОперацииСЦеннымиБумагами.Валюта КАК ВалютаСделки,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	ОперацииСЦеннымиБумагами.Операция КАК ОперацияСсылка,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|				И СделкаДокумент.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, СделкаДокумент.РасчетныйСчет.Банк.ЮрФизЛицо)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ИсполнительДС,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ СделкаДокумент.Контрагент
		|	КОНЕЦ КАК КонтрагентЦБ,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""5""
		|		ИНАЧЕ ""1""
		|	КОНЕЦ КАК МестоХранения,
		|	РежимыБиржевыхТоргов.Код КАК КодРежимаБиржевыхТоргов,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""005""
		|		ИНАЧЕ ""004""
		|	КОНЕЦ КАК МестоХраненияЦБ
		|ПОМЕСТИТЬ _ОперацииСЦБ
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|			ПО СделкаДокумент.РежимБиржевыхТоргов = РежимыБиржевыхТоргов.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО СделкаДокумент.Ссылка = СделкаЦенныеБумаги.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|			ПО СделкаДокумент.РасчетныйСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ПО ОперацииСЦеннымиБумагами.Операция = СделкаДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И (ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая >= &ДатаВыгрузкиНачалоДня
		|			ИЛИ ОперацииСЦеннымиБумагами.ДатаОплатыПлановая >= &ДатаВыгрузкиНачалоДня)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации < &ДатаВыгрузкиНачалоДня
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаОплатыТорговойКомиссии,
		|	ПлановыеДатыОплатБрокерскойКомиссии.ДатаОплаты КАК ДатаОплатыКомиссииБрокера,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаКомиссииБрокера,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	РасходыПоБрокерскойКомиссии.СуммаОборот КАК КомиссияБрокера,
		|	РасходыПоТорговойКомиссии.СуммаОборот КАК ТорговаяКомиссия,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК ВалютаОплаты
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&ДатаВыгрузкиКонецДня, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО _ОперацииСЦБ.ОперацияСсылка = УсловияСделокСрезПоследних.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаВыгрузкиНачалоДня,
		|				,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоБрокерскойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					Организация = &Организация
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ПлановыеДатыОплатБрокерскойКомиссии
		|			ПО РасходыПоБрокерскойКомиссии.Сделка = ПлановыеДатыОплатБрокерскойКомиссии.Основание
		|				И РасходыПоБрокерскойКомиссии.Валюта = ПлановыеДатыОплатБрокерскойКомиссии.Валюта
		|		ПО _ОперацииСЦБ.ОперацияСсылка = РасходыПоБрокерскойКомиссии.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = РасходыПоБрокерскойКомиссии.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаВыгрузкиНачалоДня,
		|				,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоТорговойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					Организация = &Организация
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ПлановыеДатыОплатТорговойКомиссии
		|			ПО РасходыПоТорговойКомиссии.Сделка = ПлановыеДатыОплатТорговойКомиссии.Основание
		|				И РасходыПоТорговойКомиссии.Валюта = ПлановыеДатыОплатТорговойКомиссии.Валюта
		|		ПО _ОперацииСЦБ.ОперацияСсылка = РасходыПоТорговойКомиссии.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = РасходыПоТорговойКомиссии.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(_ОперацииСЦБ.ДатаСделки, ДЕНЬ) КАК ДатаСделки,
		|	_ОперацииСЦБ.ДатаОплаты КАК ДатаОплаты,
		|	_ОперацииСЦБ.ДатаПоставки КАК ДатаПоставки,
		|	_ОперацииСЦБ.МестоХранения КАК МестоХранения,
		|	СУММА(_ОперацииСЦБ.Количество) КАК Количество,
		|	СУММА(_ОперацииСЦБ.Сумма) КАК Сумма,
		|	СУММА(_ОперацииСЦБ.СуммаКупона) КАК СуммаКупона,
		|	_ОперацииСЦБ.КодСчетаДУ КАК КодСчетаДУ,
		|	КодыМатрихЦБ.Код КАК МатрихКодЦБ,
		|	ЕСТЬNULL(_КодыМатрихКонтрагентов.Код, &МатрихКод_НКО_НКЦ) КАК МатрихКодКонтрагента,
		|	_КодыМатрихДепозитариев.Код КАК МатрихКодДепозитария,
		|	ВалютыСделок.МатрихКодВалюты КАК КодВалютыСделки,
		|	ВалютыОплат.МатрихКодВалюты КАК КодВалютыОплаты,
		|	_КодыМатрихКлиентов.Код КАК МатрихКодКлиента,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ОперацииСЦБ.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ""FUT""
		|		ИНАЧЕ ""SPF""
		|	КОНЕЦ КАК Тип,
		|	_ОперацииСЦБ.КодРежимаБиржевыхТоргов КАК КодРежимаБиржевыхТоргов,
		|	_ОперацииСЦБ.ТипСделки КАК ТипСделки,
		|	СУММА(ЕСТЬNULL(_УсловияСделок.ТорговаяКомиссия, 0)) КАК ТорговаяКомиссия,
		|	_УсловияСделок.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	_УсловияСделок.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	СУММА(ЕСТЬNULL(_УсловияСделок.КомиссияБрокера, 0)) КАК КомиссияБрокера,
		|	_УсловияСделок.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера,
		|	_УсловияСделок.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК МатрихКодБанка,
		|	_ОперацииСЦБ.СчетДУ КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 1
		|			ТОГДА ""1""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 2
		|			ТОГДА ""2""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 3
		|			ТОГДА ""3""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 4
		|			ТОГДА ""4""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 5
		|			ТОГДА ""5""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 6
		|			ТОГДА ""6""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 7
		|			ТОГДА ""7""
		|	КОНЕЦ КАК День,
		|	ВЫБОР
		|		КОГДА _ЦеныОценки.Цена = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_ЦеныОценки.Цена, 1)
		|	КОНЕЦ КАК ЦенаОценки,
		|	_ОперацииСЦБ.МестоХраненияЦБ КАК МестоХраненияЦБ
		|ПОМЕСТИТЬ _СводныеСделки
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК КодыМатрихЦБ
		|		ПО _ОперацииСЦБ.ЦеннаяБумага = КодыМатрихЦБ.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОплат
		|			ПО _УсловияСделок.ВалютаОплаты = ВалютыОплат.ВалютаСсылка
		|		ПО _ОперацииСЦБ.ОперацияСсылка = _УсловияСделок.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = _УсловияСделок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныОценкиАктивов КАК _ЦеныОценки
		|		ПО _ОперацииСЦБ.СчетДУ = _ЦеныОценки.СчетДоверительногоУправления
		|			И _ОперацииСЦБ.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыСделок
		|		ПО _ОперацииСЦБ.ВалютаСделки = ВалютыСделок.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _ОперацииСЦБ.ИсполнительДС = _КодыМатрихБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО _ОперацииСЦБ.ДепозитарийЮрФизЛицо = _КодыМатрихДепозитариев.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКонтрагентов
		|		ПО _ОперацииСЦБ.КонтрагентЦБ = _КодыМатрихКонтрагентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|		ПО _ОперацииСЦБ.Клиент = _КодыМатрихКлиентов.Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(_ОперацииСЦБ.ДатаСделки, ДЕНЬ),
		|	_ОперацииСЦБ.ДатаОплаты,
		|	_ОперацииСЦБ.ДатаПоставки,
		|	_ОперацииСЦБ.МестоХранения,
		|	_ОперацииСЦБ.КодСчетаДУ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ОперацииСЦБ.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ""FUT""
		|		ИНАЧЕ ""SPF""
		|	КОНЕЦ,
		|	_ОперацииСЦБ.КодРежимаБиржевыхТоргов,
		|	_ОперацииСЦБ.ТипСделки,
		|	_УсловияСделок.ВалютаТорговойКомиссии,
		|	_УсловияСделок.ДатаОплатыТорговойКомиссии,
		|	_УсловияСделок.ВалютаКомиссииБрокера,
		|	_УсловияСделок.ДатаОплатыКомиссииБрокера,
		|	КодыМатрихЦБ.Код,
		|	ВалютыСделок.МатрихКодВалюты,
		|	ВалютыОплат.МатрихКодВалюты,
		|	_ОперацииСЦБ.СчетДУ,
		|	ВЫБОР
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 1
		|			ТОГДА ""1""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 2
		|			ТОГДА ""2""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 3
		|			ТОГДА ""3""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 4
		|			ТОГДА ""4""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 5
		|			ТОГДА ""5""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 6
		|			ТОГДА ""6""
		|		КОГДА ДЕНЬНЕДЕЛИ(_ОперацииСЦБ.ДатаСделки) = 7
		|			ТОГДА ""7""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ЦеныОценки.Цена = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_ЦеныОценки.Цена, 1)
		|	КОНЕЦ,
		|	_ОперацииСЦБ.МестоХраненияЦБ,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ),
		|	_КодыМатрихДепозитариев.Код,
		|	ЕСТЬNULL(_КодыМатрихКонтрагентов.Код, &МатрихКод_НКО_НКЦ),
		|	_КодыМатрихКлиентов.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""СводнаяСделка"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(""Сводная_сделка-"" + _СводныеСделки.День + ""-"" + _СводныеСделки.ТипСделки + ""-"" + _СводныеСделки.СчетДУ.КодСчета + ""-"" + _СводныеСделки.МатрихКодЦБ + ""-"" + ЕСТЬNULL(_СводныеСделки.КодРежимаБиржевыхТоргов, ""Внеб"") КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	_СводныеСделки.ДатаСделки КАК tradeDate,
		|	_СводныеСделки.ДатаСделки КАК tradeDateTime,
		|	_СводныеСделки.ДатаОплаты КАК paymentDate,
		|	_СводныеСделки.ДатаПоставки КАК deliveryDate,
		|	_СводныеСделки.МестоХранения КАК tradingFloorId,
		|	_СводныеСделки.МестоХраненияЦБ КАК productCode,
		|	ВЫРАЗИТЬ(_СводныеСделки.Количество КАК ЧИСЛО(19, 4)) КАК quantity,
		|	ВЫРАЗИТЬ(_СводныеСделки.Сумма / _СводныеСделки.Количество КАК ЧИСЛО(19, 10)) КАК price,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА _СводныеСделки.КодВалютыСделки = ВалютыКомиссииБрокера.МатрихКодВалюты
		|					И _СводныеСделки.КодВалютыСделки = ВалютыТорговойКомиссии.МатрихКодВалюты
		|				ТОГДА _СводныеСделки.Сумма + _СводныеСделки.СуммаКупона + _СводныеСделки.КомиссияБрокера + _СводныеСделки.ТорговаяКомиссия
		|			ИНАЧЕ _СводныеСделки.Сумма + _СводныеСделки.СуммаКупона
		|		КОНЕЦ КАК ЧИСЛО(19, 4)) КАК payment,
		|	ВЫБОР
		|		КОГДА _СводныеСделки.ТипСделки = ""B""
		|			ТОГДА -(_СводныеСделки.Сумма + _СводныеСделки.СуммаКупона)
		|		ИНАЧЕ _СводныеСделки.Сумма + _СводныеСделки.СуммаКупона
		|	КОНЕЦ КАК paymentAssetFlows,
		|	_СводныеСделки.СчетДУ.КодСчета КАК portfolioId,
		|	_СводныеСделки.МатрихКодЦБ КАК instrumentId,
		|	_СводныеСделки.МатрихКодКонтрагента КАК counterpartyId,
		|	_СводныеСделки.МатрихКодДепозитария КАК depositaryId,
		|	_СводныеСделки.МатрихКодКлиента КАК customerId,
		|	_СводныеСделки.КодВалютыОплаты КАК paymentCurrencyCode,
		|	_СводныеСделки.КодВалютыСделки КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	_СводныеСделки.СуммаКупона / _СводныеСделки.Количество КАК accruedInterest,
		|	_СводныеСделки.ЦенаОценки КАК dirtyPrice,
		|	_СводныеСделки.МатрихКодКлиента КАК branchId,
		|	""BRK"" КАК scope,
		|	_СводныеСделки.Тип КАК type,
		|	0 КАК interestRate,
		|	_СводныеСделки.КодРежимаБиржевыхТоргов КАК tradingModeId,
		|	""DVP"" КАК settlementType,
		|	_СводныеСделки.ТипСделки КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	ЕСТЬNULL(-_СводныеСделки.ТорговаяКомиссия, 0) КАК ТорговаяКомиссия,
		|	ВалютыТорговойКомиссии.МатрихКодВалюты КАК ВалютаТорговойКомиссии,
		|	_СводныеСделки.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	ЕСТЬNULL(-_СводныеСделки.КомиссияБрокера, 0) КАК КомиссияБрокера,
		|	ВалютыКомиссииБрокера.МатрихКодВалюты КАК ВалютаКомиссииБрокера,
		|	_СводныеСделки.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	_СводныеСделки.МатрихКодБанка КАК moneyCounterpartyId,
		|	_СводныеСделки.СчетДУ КАК СчетДУ,
		|	"""" КАК expirationDate
		|ПОМЕСТИТЬ _ИтоговыеСделки
		|ИЗ
		|	_СводныеСделки КАК _СводныеСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
		|		ПО _СводныеСделки.ВалютаТорговойКомиссии = ВалютыТорговойКомиссии.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыКомиссииБрокера
		|		ПО _СводныеСделки.ВалютаКомиссииБрокера = ВалютыКомиссииБрокера.ВалютаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE
		|ПОМЕСТИТЬ _РанееВыгруженныеСводныеСделки
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""СводнаяСделка"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговыеСделки.comment КАК comment,
		|	_ИтоговыеСделки.id КАК id,
		|	_ИтоговыеСделки.transactionId КАК transactionId,
		|	_ИтоговыеСделки.isBalance КАК isBalance,
		|	_ИтоговыеСделки.systemCode КАК systemCode,
		|	_ИтоговыеСделки.tradeDate КАК tradeDate,
		|	_ИтоговыеСделки.tradeDateTime КАК tradeDateTime,
		|	_ИтоговыеСделки.paymentDate КАК paymentDate,
		|	_ИтоговыеСделки.deliveryDate КАК deliveryDate,
		|	_ИтоговыеСделки.tradingFloorId КАК tradingFloorId,
		|	_ИтоговыеСделки.productCode КАК productCode,
		|	_ИтоговыеСделки.quantity КАК quantity,
		|	_ИтоговыеСделки.price КАК price,
		|	_ИтоговыеСделки.payment КАК payment,
		|	_ИтоговыеСделки.paymentAssetFlows КАК paymentAssetFlows,
		|	_ИтоговыеСделки.portfolioId КАК portfolioId,
		|	_ИтоговыеСделки.instrumentId КАК instrumentId,
		|	_ИтоговыеСделки.counterpartyId КАК counterpartyId,
		|	_ИтоговыеСделки.depositaryId КАК depositaryId,
		|	_ИтоговыеСделки.customerId КАК customerId,
		|	_ИтоговыеСделки.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ИтоговыеСделки.priceCurrencyCode КАК priceCurrencyCode,
		|	_ИтоговыеСделки.traderId КАК traderId,
		|	_ИтоговыеСделки.lastTraderId КАК lastTraderId,
		|	_ИтоговыеСделки.legNumber КАК legNumber,
		|	_ИтоговыеСделки.accruedInterest КАК accruedInterest,
		|	_ИтоговыеСделки.dirtyPrice КАК dirtyPrice,
		|	_ИтоговыеСделки.branchId КАК branchId,
		|	_ИтоговыеСделки.scope КАК scope,
		|	_ИтоговыеСделки.type КАК type,
		|	_ИтоговыеСделки.interestRate КАК interestRate,
		|	_ИтоговыеСделки.tradingModeId КАК tradingModeId,
		|	_ИтоговыеСделки.settlementType КАК settlementType,
		|	_ИтоговыеСделки.side КАК side,
		|	_ИтоговыеСделки.bOstatus КАК bOstatus,
		|	_ИтоговыеСделки.isSkipDetails КАК isSkipDetails,
		|	_ИтоговыеСделки.objectType КАК objectType,
		|	_ИтоговыеСделки.originId КАК originId,
		|	_ИтоговыеСделки.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_ИтоговыеСделки.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	_ИтоговыеСделки.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	_ИтоговыеСделки.КомиссияБрокера КАК КомиссияБрокера,
		|	_ИтоговыеСделки.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера,
		|	_ИтоговыеСделки.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	_ИтоговыеСделки.moneyCounterpartyId КАК moneyCounterpartyId,
		|	_ИтоговыеСделки.expirationDate КАК expirationDate,
		|	_ИтоговыеСделки.СчетДУ КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеСводныеСделки.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ИтоговыеСделки.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеСводныеСделки.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ИЗ
		|	_ИтоговыеСделки КАК _ИтоговыеСделки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеСводныеСделки КАК _РанееВыгруженныеСводныеСделки
		|		ПО _ИтоговыеСделки.id = _РанееВыгруженныеСводныеСделки.ID
		|			И _ИтоговыеСделки.quantity = _РанееВыгруженныеСводныеСделки.QUANTITY
		|			И _ИтоговыеСделки.price = _РанееВыгруженныеСводныеСделки.PRICE
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОперацииСЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СводныеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИтоговыеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеСводныеСделки";
	#КонецОбласти
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	//Операции с ЦБ. Задолженности по поручениям (ожидаемые вводы-выводы ЦБ).
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""ОперацииЦБ"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА ""ВводЦБ-""
		|			ИНАЧЕ ""ВыводЦБ-""
		|		КОНЕЦ + МатрихКодыЦБ.Код + ""-"" + ЗадолженностиПоЦеннымБумагамПоПоручениям.Поручение.Номер КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDate,
		|	&ДатаВыгрузкиНачалоДня КАК tradeDateTime,
		|	&ДатаВыгрузкиНачалоДня КАК paymentDate,
		|	&ДатаВыгрузкиНачалоДня КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	""004"" КАК productCode,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ * ЗадолженностиПоЦеннымБумагамПоПоручениям.КоличествоОстаток КАК ЧИСЛО(19, 4)) КАК quantity,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.КоличествоОстаток = 0
		|			ТОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.СуммаОстаток + ЗадолженностиПоЦеннымБумагамПоПоручениям.СуммаКупонаОстаток
		|		ИНАЧЕ (ЗадолженностиПоЦеннымБумагамПоПоручениям.СуммаОстаток + ЗадолженностиПоЦеннымБумагамПоПоручениям.СуммаКупонаОстаток) / ЗадолженностиПоЦеннымБумагамПоПоручениям.КоличествоОстаток
		|	КОНЕЦ КАК price,
		|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамПоПоручениям.КоличествоОстаток КАК ЧИСЛО(19, 4)) КАК payment,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК portfolioId,
		|	МатрихКодыЦБ.Код КАК instrumentId,
		|	ЕСТЬNULL(_КодыМатрихДепозитариев.Код, &МатрихКод_НКО_НКЦ) КАК counterpartyId,
		|	ЕСТЬNULL(_КодыМатрихДепозитариев.Код, &МатрихКод_НКО_НКЦ) КАК depositaryId,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА NULL
		|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|			ТОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага.Валюта
		|		ИНАЧЕ ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ""FUT""
		|		ИНАЧЕ ""SPF""
		|	КОНЕЦ КАК type,
		|	0 КАК interestRate,
		|	""TRAS"" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PH"" КАК assetFlowsType,
		|	"""" КАК expirationDate
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагамПоПоручениям.Остатки(
		|			,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|				И НЕ СчетДоверительногоУправления.ПометкаУдаления
		|				И НЕ Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)) КАК ЗадолженностиПоЦеннымБумагамПоПоручениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = ЗадолженностиПоЦеннымБумагамПоПоручениям.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК МатрихКодыЦБ
		|		ПО ЗадолженностиПоЦеннымБумагамПоПоручениям.ЦеннаяБумага = МатрихКодыЦБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО ЗадолженностиПоЦеннымБумагамПоПоручениям.Поручение.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = _КодыМатрихДепозитариев.Объект
		|ГДЕ
		|	РАЗНОСТЬДАТ(ЗадолженностиПоЦеннымБумагамПоПоручениям.Поручение.Дата, &ДатаВыгрузкиНачалоДня, ДЕНЬ) < 32
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE
		|ПОМЕСТИТЬ _РанееВыгруженныеВводыВыводыЦБ
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""ОперацииЦБ"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводы.comment КАК comment,
		|	_ВводыВыводы.id КАК id,
		|	_ВводыВыводы.transactionId КАК transactionId,
		|	_ВводыВыводы.isBalance КАК isBalance,
		|	_ВводыВыводы.systemCode КАК systemCode,
		|	_ВводыВыводы.tradeDate КАК tradeDate,
		|	_ВводыВыводы.tradeDateTime КАК tradeDateTime,
		|	_ВводыВыводы.paymentDate КАК paymentDate,
		|	_ВводыВыводы.deliveryDate КАК deliveryDate,
		|	_ВводыВыводы.tradingFloorId КАК tradingFloorId,
		|	_ВводыВыводы.productCode КАК productCode,
		|	_ВводыВыводы.quantity КАК quantity,
		|	_ВводыВыводы.price КАК price,
		|	_ВводыВыводы.payment КАК payment,
		|	_ВводыВыводы.portfolioId КАК portfolioId,
		|	_ВводыВыводы.instrumentId КАК instrumentId,
		|	_ВводыВыводы.counterpartyId КАК counterpartyId,
		|	_ВводыВыводы.depositaryId КАК depositaryId,
		|	_ВводыВыводы.customerId КАК customerId,
		|	ВалютыЦБ.МатрихКодВалюты КАК paymentCurrencyCode,
		|	ВалютыЦБ.МатрихКодВалюты КАК priceCurrencyCode,
		|	_ВводыВыводы.traderId КАК traderId,
		|	_ВводыВыводы.lastTraderId КАК lastTraderId,
		|	_ВводыВыводы.legNumber КАК legNumber,
		|	_ВводыВыводы.accruedInterest КАК accruedInterest,
		|	_ВводыВыводы.dirtyPrice КАК dirtyPrice,
		|	_ВводыВыводы.branchId КАК branchId,
		|	_ВводыВыводы.scope КАК scope,
		|	_ВводыВыводы.type КАК type,
		|	_ВводыВыводы.interestRate КАК interestRate,
		|	_ВводыВыводы.tradingModeId КАК tradingModeId,
		|	_ВводыВыводы.settlementType КАК settlementType,
		|	_ВводыВыводы.side КАК side,
		|	_ВводыВыводы.bOstatus КАК bOstatus,
		|	_ВводыВыводы.isSkipDetails КАК isSkipDetails,
		|	_ВводыВыводы.objectType КАК objectType,
		|	_ВводыВыводы.originId КАК originId,
		|	_ВводыВыводы.assetFlowsType КАК assetFlowsType,
		|	_ВводыВыводы.expirationDate КАК expirationDate,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеВводыВыводыЦБ.ID ЕСТЬ NULL
		|				И _ВводыВыводы.quantity <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ВводыВыводы.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеВводыВыводыЦБ.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеВводыВыводыЦБ КАК _РанееВыгруженныеВводыВыводыЦБ
		|		ПО _ВводыВыводы.id = _РанееВыгруженныеВводыВыводыЦБ.ID
		|			И _ВводыВыводы.quantity = _РанееВыгруженныеВводыВыводыЦБ.QUANTITY
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыЦБ
		|		ПО _ВводыВыводы.ВалютаНоминала = ВалютыЦБ.ВалютаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВводыВыводы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеВводыВыводыЦБ";
	#КонецОбласти
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	Если СделкиДляУдаления.Количество() > 0 Тогда
		УдалитьДанные( ,ПараметрыПодключения, СделкиДляУдаления);
	КонецЕсли;
	
	КоличествоЗапросовВыгрузки = 0;
	
	Если СделкиДляВыгрузки.Количество() > 0 Тогда
		Для Каждого Портфель Из СделкиДляВыгрузки Цикл
			ТелоЗапросаJSON = ПолучитьСтрокуJSON(Портфель.Значение);
			Если ТелоЗапросаJSON <> Неопределено Тогда
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Trades, ТелоЗапросаJSON);
				КоличествоЗапросовВыгрузки = КоличествоЗапросовВыгрузки + Портфель.Значение.Количество();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляСтатистики.Вставить("ПроцедураВыгрузкиОстатков", "Время выполнения: " + РассчитатьВремя(СтартЗапуска)
		+ ". Удалено: " + Строка(СделкиДляУдаления.Количество()) + ", загружено: " + Строка(КоличествоЗапросовВыгрузки) + ".");
КонецПроцедуры

Процедура СФормироватьИВыгрузитьДанныеПоСделкам(ПараметрыПодключения, МВТ, ДанныеДляСтатистики)
	СтартЗапуска = ТекущаяДатаСеанса();
	СделкиДляУдаления = Новый Массив;
	СделкиДляВыгрузки = Новый Структура;
	
	// Сделки текущего дня
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|				И СделкаДокумент.НомерСделки = """"
		|			ТОГДА ПОДСТРОКА(СделкаДокумент.Номер, 14, 20)
		|		ИНАЧЕ СделкаДокумент.НомерСделки
		|	КОНЕЦ КАК НомерСделки,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ДатаСделки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОперацииСЦеннымиБумагами.ДатаОплатыПлановая
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаОплаты
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК ТипСделки,
		|	ОперацииСЦеннымиБумагами.Количество КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.СуммаКупона КАК СуммаКупона,
		|	ОперацииСЦеннымиБумагами.Сумма КАК Сумма,
		|	ОперацииСЦеннымиБумагами.Валюта КАК ВалютаСделки,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	ОперацииСЦеннымиБумагами.Операция КАК ОперацияСсылка,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ""Облигация""
		|		ИНАЧЕ ""Другое""
		|	КОНЕЦ КАК ТипЦеннойБумаги,
		|	СделкаЦенныеБумаги.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо КАК ДепозитарийЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|				И СделкаДокумент.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, СделкаДокумент.РасчетныйСчет.Банк.ЮрФизЛицо)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ИсполнительДС,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ СделкаДокумент.Контрагент
		|	КОНЕЦ КАК КонтрагентЦБ,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""5""
		|		ИНАЧЕ ""1""
		|	КОНЕЦ КАК МестоХранения,
		|	РежимыБиржевыхТоргов.Код КАК КодРежимаБиржевыхТоргов,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА СделкаДокумент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""005""
		|		ИНАЧЕ ""004""
		|	КОНЕЦ КАК МестоХраненияЦБ
		|ПОМЕСТИТЬ _ОперацииСЦБ
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|			ПО СделкаДокумент.РежимБиржевыхТоргов = РежимыБиржевыхТоргов.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО СделкаДокумент.Ссылка = СделкаЦенныеБумаги.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|			ПО СделкаДокумент.РасчетныйСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ПО ОперацииСЦеннымиБумагами.Операция = СделкаДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И (ОперацииСЦеннымиБумагами.ДатаПоставкиПлановая >= &ДатаВыгрузкиНачалоДня
		|			ИЛИ ОперацииСЦеннымиБумагами.ДатаОплатыПлановая >= &ДатаВыгрузкиНачалоДня)
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &ДатаВыгрузкиНачалоДня И &ДатаВыгрузкиКонецДня
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПлановыеДатыОплатТорговойКомиссии.ДатаОплаты КАК ДатаОплатыТорговойКомиссии,
		|	ПлановыеДатыОплатБрокерскойКомиссии.ДатаОплаты КАК ДатаОплатыКомиссииБрокера,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаКомиссииБрокера,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	РасходыПоБрокерскойКомиссии.СуммаОборот КАК КомиссияБрокера,
		|	РасходыПоТорговойКомиссии.СуммаОборот КАК ТорговаяКомиссия,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК ВалютаОплаты
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&ДатаВыгрузкиКонецДня, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО _ОперацииСЦБ.ОперацияСсылка = УсловияСделокСрезПоследних.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаВыгрузкиНачалоДня,
		|				,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоБрокерскойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					Организация = &Организация
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ПлановыеДатыОплатБрокерскойКомиссии
		|			ПО РасходыПоБрокерскойКомиссии.Сделка = ПлановыеДатыОплатБрокерскойКомиссии.Основание
		|				И РасходыПоБрокерскойКомиссии.Валюта = ПлановыеДатыОплатБрокерскойКомиссии.Валюта
		|		ПО _ОперацииСЦБ.ОперацияСсылка = РасходыПоБрокерскойКомиссии.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = РасходыПоБрокерскойКомиссии.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаВыгрузкиНачалоДня,
		|				,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК РасходыПоТорговойКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					Организация = &Организация
		|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ПлановыеДатыОплатТорговойКомиссии
		|			ПО РасходыПоТорговойКомиссии.Сделка = ПлановыеДатыОплатТорговойКомиссии.Основание
		|				И РасходыПоТорговойКомиссии.Валюта = ПлановыеДатыОплатТорговойКомиссии.Валюта
		|		ПО _ОперацииСЦБ.ОперацияСсылка = РасходыПоТорговойКомиссии.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = РасходыПоТорговойКомиссии.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""Сделка"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_ОперацииСЦБ.НомерСделки КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	НАЧАЛОПЕРИОДА(_ОперацииСЦБ.ДатаСделки, ДЕНЬ) КАК tradeDate,
		|	_ОперацииСЦБ.ДатаСделки КАК tradeDateTime,
		|	_ОперацииСЦБ.ДатаОплаты КАК paymentDate,
		|	_ОперацииСЦБ.ДатаПоставки КАК deliveryDate,
		|	_ОперацииСЦБ.МестоХранения КАК tradingFloorId,
		|	_ОперацииСЦБ.МестоХраненияЦБ КАК productCode,
		|	ВЫРАЗИТЬ(_ОперацииСЦБ.Количество КАК ЧИСЛО(18, 2)) КАК quantity,
		|	ВЫРАЗИТЬ(_ОперацииСЦБ.Цена КАК ЧИСЛО(18, 2)) КАК price,
		|	ВЫБОР
		|		КОГДА _ОперацииСЦБ.ВалютаСделки = _УсловияСделок.ВалютаКомиссииБрокера
		|				И _ОперацииСЦБ.ВалютаСделки = _УсловияСделок.ВалютаТорговойКомиссии
		|			ТОГДА _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона + _УсловияСделок.КомиссияБрокера + _УсловияСделок.ТорговаяКомиссия
		|		ИНАЧЕ _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона
		|	КОНЕЦ КАК payment,
		|	ВЫБОР
		|		КОГДА _ОперацииСЦБ.ТипСделки = ""B""
		|			ТОГДА -(_ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона)
		|		ИНАЧЕ _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона
		|	КОНЕЦ КАК paymentAssetFlows,
		|	_ОперацииСЦБ.КодСчетаДУ КАК portfolioId,
		|	КодыМатрихЦБ.Код КАК instrumentId,
		|	ЕСТЬNULL(_КодыМатрихКонтрагентов.Код, &МатрихКод_НКО_НКЦ) КАК counterpartyId,
		|	_КодыМатрихДепозитариев.Код КАК depositaryId,
		|	"""" КАК expirationDate,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	ВалютыОплат.МатрихКодВалюты КАК paymentCurrencyCode,
		|	ВалютыСделок.МатрихКодВалюты КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	_ОперацииСЦБ.СуммаКупона / _ОперацииСЦБ.Количество КАК accruedInterest,
		|	ВЫБОР
		|		КОГДА _ЦеныОценки.Цена = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_ЦеныОценки.Цена, 1)
		|	КОНЕЦ КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ОперацииСЦБ.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|			ТОГДА ""FUT""
		|		ИНАЧЕ ""SPF""
		|	КОНЕЦ КАК type,
		|	0 КАК interestRate,
		|	_ОперацииСЦБ.КодРежимаБиржевыхТоргов КАК tradingModeId,
		|	""DVP"" КАК settlementType,
		|	_ОперацииСЦБ.ТипСделки КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	_ОперацииСЦБ.ТипЦеннойБумаги КАК ТипЦеннойБумаги,
		|	ЕСТЬNULL(-_УсловияСделок.ТорговаяКомиссия, 0) КАК ТорговаяКомиссия,
		|	ВалютыТорговойКомиссии.МатрихКодВалюты КАК ВалютаТорговойКомиссии,
		|	_УсловияСделок.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	ЕСТЬNULL(-_УсловияСделок.КомиссияБрокера, 0) КАК КомиссияБрокера,
		|	ВалютыБрокерскойКомиссии.МатрихКодВалюты КАК ВалютаКомиссииБрокера,
		|	_УсловияСделок.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК moneyCounterpartyId,
		|	_ОперацииСЦБ.СчетДУ КАК СчетДУ
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК КодыМатрихЦБ
		|		ПО _ОперацииСЦБ.ЦеннаяБумага = КодыМатрихЦБ.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОплат
		|			ПО _УсловияСделок.ВалютаОплаты = ВалютыОплат.ВалютаСсылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
		|			ПО _УсловияСделок.ВалютаТорговойКомиссии = ВалютыТорговойКомиссии.ВалютаСсылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыБрокерскойКомиссии
		|			ПО _УсловияСделок.ВалютаКомиссииБрокера = ВалютыБрокерскойКомиссии.ВалютаСсылка
		|		ПО _ОперацииСЦБ.ОперацияСсылка = _УсловияСделок.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = _УсловияСделок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныОценкиАктивов КАК _ЦеныОценки
		|		ПО _ОперацииСЦБ.СчетДУ = _ЦеныОценки.СчетДоверительногоУправления
		|			И _ОперацииСЦБ.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыСделок
		|		ПО _ОперацииСЦБ.ВалютаСделки = ВалютыСделок.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _ОперацииСЦБ.ИсполнительДС = _КодыМатрихБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО _ОперацииСЦБ.ДепозитарийЮрФизЛицо = _КодыМатрихДепозитариев.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКонтрагентов
		|		ПО _ОперацииСЦБ.КонтрагентЦБ = _КодыМатрихКонтрагентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|		ПО _ОперацииСЦБ.Клиент = _КодыМатрихКлиентов.Объект
		|ГДЕ
		|	_ОперацииСЦБ.ТипЦеннойБумаги <> ""Акция""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(""Сделка"" КАК СТРОКА(15)),
		|	""EQ"" + (ВЫРАЗИТЬ(МИНИМУМ(_ОперацииСЦБ.НомерСделки) КАК СТРОКА(50))),
		|	"""",
		|	0,
		|	""1C"",
		|	НАЧАЛОПЕРИОДА(_ОперацииСЦБ.ДатаСделки, ДЕНЬ),
		|	МАКСИМУМ(_ОперацииСЦБ.ДатаСделки),
		|	_ОперацииСЦБ.ДатаОплаты,
		|	_ОперацииСЦБ.ДатаПоставки,
		|	_ОперацииСЦБ.МестоХранения,
		|	_ОперацииСЦБ.МестоХраненияЦБ,
		|	ВЫРАЗИТЬ(СУММА(_ОперацииСЦБ.Количество) КАК ЧИСЛО(18, 2)),
		|	ВЫРАЗИТЬ(_ОперацииСЦБ.Цена КАК ЧИСЛО(18, 2)),
		|	СУММА(ВЫБОР
		|			КОГДА _ОперацииСЦБ.ВалютаСделки = _УсловияСделок.ВалютаКомиссииБрокера
		|					И _ОперацииСЦБ.ВалютаСделки = _УсловияСделок.ВалютаТорговойКомиссии
		|				ТОГДА _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона + _УсловияСделок.КомиссияБрокера + _УсловияСделок.ТорговаяКомиссия
		|			ИНАЧЕ _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА _ОперацииСЦБ.ТипСделки = ""B""
		|				ТОГДА -(_ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона)
		|			ИНАЧЕ _ОперацииСЦБ.Сумма + _ОперацииСЦБ.СуммаКупона
		|		КОНЕЦ),
		|	_ОперацииСЦБ.КодСчетаДУ,
		|	КодыМатрихЦБ.Код,
		|	МАКСИМУМ(ЕСТЬNULL(_КодыМатрихКонтрагентов.Код, &МатрихКод_НКО_НКЦ)),
		|	_КодыМатрихДепозитариев.Код,
		|	"""",
		|	_КодыМатрихКлиентов.Код,
		|	ВалютыОплат.МатрихКодВалюты,
		|	ВалютыСделок.МатрихКодВалюты,
		|	0,
		|	0,
		|	0,
		|	СУММА(_ОперацииСЦБ.СуммаКупона / _ОперацииСЦБ.Количество),
		|	ВЫБОР
		|		КОГДА _ЦеныОценки.Цена = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_ЦеныОценки.Цена, 1)
		|	КОНЕЦ,
		|	_КодыМатрихКлиентов.Код,
		|	""BRK"",
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(_ОперацииСЦБ.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|				ТОГДА ""FUT""
		|			ИНАЧЕ ""SPF""
		|		КОНЕЦ),
		|	0,
		|	_ОперацииСЦБ.КодРежимаБиржевыхТоргов,
		|	""DVP"",
		|	_ОперацииСЦБ.ТипСделки,
		|	""ST"",
		|	1,
		|	""T"",
		|	"""" КАК originId,
		|	МАКСИМУМ(_ОперацииСЦБ.ТипЦеннойБумаги),
		|	СУММА(ЕСТЬNULL(-_УсловияСделок.ТорговаяКомиссия, 0)),
		|	ВалютыТорговойКомиссии.МатрихКодВалюты,
		|	_УсловияСделок.ДатаОплатыТорговойКомиссии,
		|	СУММА(ЕСТЬNULL(-_УсловияСделок.КомиссияБрокера, 0)),
		|	ВалютыБрокерскойКомиссии.МатрихКодВалюты,
		|	_УсловияСделок.ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ),
		|	МАКСИМУМ(_ОперацииСЦБ.СчетДУ)
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК КодыМатрихЦБ
		|		ПО _ОперацииСЦБ.ЦеннаяБумага = КодыМатрихЦБ.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделок
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОплат
		|			ПО _УсловияСделок.ВалютаОплаты = ВалютыОплат.ВалютаСсылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыТорговойКомиссии
		|			ПО _УсловияСделок.ВалютаТорговойКомиссии = ВалютыТорговойКомиссии.ВалютаСсылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыБрокерскойКомиссии
		|			ПО _УсловияСделок.ВалютаКомиссииБрокера = ВалютыБрокерскойКомиссии.ВалютаСсылка
		|		ПО _ОперацииСЦБ.ОперацияСсылка = _УсловияСделок.Сделка
		|			И _ОперацииСЦБ.ЦеннаяБумага = _УсловияСделок.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныОценкиАктивов КАК _ЦеныОценки
		|		ПО _ОперацииСЦБ.СчетДУ = _ЦеныОценки.СчетДоверительногоУправления
		|			И _ОперацииСЦБ.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыСделок
		|		ПО _ОперацииСЦБ.ВалютаСделки = ВалютыСделок.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _ОперацииСЦБ.ИсполнительДС = _КодыМатрихБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО _ОперацииСЦБ.ДепозитарийЮрФизЛицо = _КодыМатрихДепозитариев.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКонтрагентов
		|		ПО _ОперацииСЦБ.КонтрагентЦБ = _КодыМатрихКонтрагентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|		ПО _ОперацииСЦБ.Клиент = _КодыМатрихКлиентов.Объект
		|ГДЕ
		|	_ОперацииСЦБ.ТипЦеннойБумаги = ""Акция""
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(_ОперацииСЦБ.ДатаСделки, ДЕНЬ),
		|	_ОперацииСЦБ.ТипСделки,
		|	КодыМатрихЦБ.Код,
		|	_ОперацииСЦБ.КодСчетаДУ,
		|	_ОперацииСЦБ.Цена,
		|	_ОперацииСЦБ.КодРежимаБиржевыхТоргов,
		|	_ОперацииСЦБ.ДатаОплаты,
		|	_ОперацииСЦБ.ДатаПоставки,
		|	_ОперацииСЦБ.МестоХранения,
		|	_ОперацииСЦБ.МестоХраненияЦБ,
		|	_КодыМатрихДепозитариев.Код,
		|	_КодыМатрихКлиентов.Код,
		|	ВалютыОплат.МатрихКодВалюты,
		|	ВалютыСделок.МатрихКодВалюты,
		|	ВЫБОР
		|		КОГДА _ЦеныОценки.Цена = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_ЦеныОценки.Цена, 1)
		|	КОНЕЦ,
		|	ВалютыТорговойКомиссии.МатрихКодВалюты,
		|	_УсловияСделок.ДатаОплатыТорговойКомиссии,
		|	ВалютыБрокерскойКомиссии.МатрихКодВалюты,
		|	_УсловияСделок.ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE
		|ПОМЕСТИТЬ _РанееВыгруженныеСделки
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""Сделка"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.comment КАК comment,
		|	_Сделки.id КАК id,
		|	_Сделки.transactionId КАК transactionId,
		|	_Сделки.isBalance КАК isBalance,
		|	_Сделки.systemCode КАК systemCode,
		|	_Сделки.tradeDate КАК tradeDate,
		|	_Сделки.tradeDateTime КАК tradeDateTime,
		|	_Сделки.paymentDate КАК paymentDate,
		|	_Сделки.deliveryDate КАК deliveryDate,
		|	_Сделки.tradingFloorId КАК tradingFloorId,
		|	_Сделки.productCode КАК productCode,
		|	_Сделки.quantity КАК quantity,
		|	_Сделки.price КАК price,
		|	_Сделки.payment КАК payment,
		|	_Сделки.paymentAssetFlows КАК paymentAssetFlows,
		|	_Сделки.portfolioId КАК portfolioId,
		|	_Сделки.instrumentId КАК instrumentId,
		|	_Сделки.counterpartyId КАК counterpartyId,
		|	_Сделки.depositaryId КАК depositaryId,
		|	_Сделки.customerId КАК customerId,
		|	_Сделки.expirationDate КАК expirationDate,
		|	_Сделки.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_Сделки.priceCurrencyCode КАК priceCurrencyCode,
		|	_Сделки.traderId КАК traderId,
		|	_Сделки.lastTraderId КАК lastTraderId,
		|	_Сделки.legNumber КАК legNumber,
		|	_Сделки.accruedInterest КАК accruedInterest,
		|	_Сделки.dirtyPrice КАК dirtyPrice,
		|	_Сделки.branchId КАК branchId,
		|	_Сделки.scope КАК scope,
		|	_Сделки.type КАК type,
		|	_Сделки.interestRate КАК interestRate,
		|	_Сделки.tradingModeId КАК tradingModeId,
		|	_Сделки.settlementType КАК settlementType,
		|	_Сделки.side КАК side,
		|	_Сделки.bOstatus КАК bOstatus,
		|	_Сделки.isSkipDetails КАК isSkipDetails,
		|	_Сделки.objectType КАК objectType,
		|	_Сделки.originId КАК originId,
		|	_Сделки.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_Сделки.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	_Сделки.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	_Сделки.КомиссияБрокера КАК КомиссияБрокера,
		|	_Сделки.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера,
		|	_Сделки.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	_Сделки.moneyCounterpartyId КАК moneyCounterpartyId,
		|	_Сделки.СчетДУ КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеСделки.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА НЕ _Сделки.id ЕСТЬ NULL
		|				И _Сделки.id ПОДОБНО ""EQ%""
		|				И (ВЫРАЗИТЬ(_Сделки.quantity КАК ЧИСЛО(15, 0))) <> (ВЫРАЗИТЬ(_РанееВыгруженныеСделки.QUANTITY КАК ЧИСЛО(15, 0)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _Сделки.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеСделки.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеСделки КАК _РанееВыгруженныеСделки
		|		ПО _Сделки.id = _РанееВыгруженныеСделки.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОперацииСЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Сделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеСделки";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаВыгрузкиКонецДня", КонецДня(ДатаВыгрузки));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МатрихКод_НКО_НКЦ", ПолучитьМатрихКод(ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ")));
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	// Сделки РЕПО
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК Ссылка,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки КАК ВидСделки,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК ДатаВремяСделки,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделки = """"
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом = """"
		|						ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Номер
		|					ИНАЧЕ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом
		|				КОНЕЦ
		|		ИНАЧЕ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделки
		|	КОНЕЦ КАК НомерПервойЧасти,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Номер + ""-2""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СделкаРЕПОВтораяЧасть.НомерСделки = """"
		|					ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделкиСЦентральнымКонтрагентом + ""-2""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ПОДСТРОКА(СделкаРЕПОВтораяЧасть.НомерСделки, 1, 15) = ПОДСТРОКА(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерСделки, 1, 15)
		|							ТОГДА СделкаРЕПОВтораяЧасть.НомерСделки + ""-2""
		|						ИНАЧЕ СделкаРЕПОВтораяЧасть.НомерСделки
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерВторойЧасти,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.НомерЗаявки КАК НомерЗаявки,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.МестоХранения КАК МестоХранения,
		|	УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.РежимБиржевыхТоргов.Код КАК КодРежимаБиржевыхТоргов,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.РасчетныйСчет.Банк.ЮрФизЛицо) КАК Банк,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Брокер КАК Брокер
		|ПОМЕСТИТЬ _СделкиРепо
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДатаВыгрузкиКонецДня,
		|			Организация = &Организация
		|				И ЧастьСделкиРЕПО = 2
		|				И СделкаРЕПО.Дата < &ДатаВыгрузкиКонецДня) КАК УсловияСделокРЕПОСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиНачалоДня, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиНачалоДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.РасчетныйСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОВтораяЧасть
		|		ПО УсловияСделокРЕПОСрезПоследних.СделкаРЕПО = СделкаРЕПОВтораяЧасть.ПерваяЧастьРЕПО
		|			И УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО = СделкаРЕПОВтораяЧасть.ЧастьСделкиРЕПО
		|ГДЕ
		|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты >= &ДатаВыгрузкиНачалоДня
		|	И УсловияСделокРЕПОСрезПоследних.ДатаПоставки >= &ДатаВыгрузкиНачалоДня
		|	И (НЕ СделкаРЕПОВтораяЧасть.Ссылка ЕСТЬ NULL
		|			ИЛИ УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиРепо.Ссылка КАК Ссылка,
		|	РасходыПоСделкеОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	РасходыПоСделкеОбороты.СуммаОборот КАК Сумма,
		|	ПлановыеДатыОплатСрезПоследних.ДатаОплаты КАК ПлановаяДатаОплаты,
		|	РасходыПоСделкеОбороты.Валюта КАК Валюта
		|ПОМЕСТИТЬ _РасходыПоСделке
		|ИЗ
		|	_СделкиРепо КАК _СделкиРепо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				&ДатаВыгрузкиНачалоДня,
		|				&ДатаВыгрузкиКонецДня,
		|				,
		|				Организация = &Организация
		|					И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&ДатаВыгрузкиКонецДня,
		|					Организация = &Организация
		|						И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))) КАК ПлановыеДатыОплатСрезПоследних
		|			ПО РасходыПоСделкеОбороты.Сделка = ПлановыеДатыОплатСрезПоследних.Основание
		|				И РасходыПоСделкеОбороты.ВидЗадолженности = ПлановыеДатыОплатСрезПоследних.ВидЗадолженности
		|				И РасходыПоСделкеОбороты.Валюта = ПлановыеДатыОплатСрезПоследних.Валюта
		|		ПО _СделкиРепо.Ссылка = РасходыПоСделкеОбороты.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СделкиРепо.Ссылка КАК СделкаРепо,
		|	_СделкиРепо.ДатаВремяСделки КАК ДатаВремяСделки,
		|	УсловияСделокРЕПО.ДатаИсполнения КАК ДатаВремяИсполненияСделки,
		|	УсловияСделокРЕПО.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокРЕПО.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокРЕПО.Количество КАК Количество,
		|	УсловияСделокРЕПО.Цена КАК Цена,
		|	УсловияСделокРЕПО.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона + ВЫБОР
		|		КОГДА _СделкиРепо.ВалютаСделки = РасходыПоБрокерскойКомиссии.Валюта
		|			ТОГДА РасходыПоБрокерскойКомиссии.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА _СделкиРепо.ВалютаСделки = РасходыПоТорговойКомиссии.Валюта
		|			ТОГДА РасходыПоТорговойКомиссии.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОбщаяСуммаСделки,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|					И _СделкиРепо.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ИЛИ УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|					И _СделкиРепо.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА -(УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона)
		|		ИНАЧЕ УсловияСделокРЕПО.Сумма + УсловияСделокРЕПО.СуммаКупона
		|	КОНЕЦ КАК СуммаСделкиРепо,
		|	_СделкиРепо.ВалютаСделки КАК ВалютаСделки,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ВалютаОплаты = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА &Рубль
		|		ИНАЧЕ УсловияСделокРЕПО.ВалютаОплаты
		|	КОНЕЦ КАК ВалютаОплаты,
		|	РасходыПоТорговойКомиссии.ПлановаяДатаОплаты КАК ДатаОплатыТК,
		|	РасходыПоТорговойКомиссии.Сумма КАК ТК,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТК,
		|	РасходыПоБрокерскойКомиссии.ПлановаяДатаОплаты КАК ДатаОплатыБК,
		|	РасходыПоБрокерскойКомиссии.Сумма КАК БК,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаБК,
		|	УсловияСделокРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_СделкиРепо.Контрагент КАК Контрагент,
		|	УсловияСделокРЕПО.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо КАК Депозитарий,
		|	_СделкиРепо.Клиент КАК Клиент,
		|	ВЫБОР
		|		КОГДА _СделкиРепо.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|				И _СделкиРепо.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА _СделкиРепо.Банк
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Банк,
		|	ВЫБОР
		|		КОГДА _СделкиРепо.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""5""
		|		ИНАЧЕ ""1""
		|	КОНЕЦ КАК КодМестаХранения,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|			ТОГДА _СделкиРепо.НомерПервойЧасти
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|			ТОГДА _СделкиРепо.НомерВторойЧасти
		|	КОНЕЦ КАК НомерСделки,
		|	_СделкиРепо.НомерЗаявки КАК НомерЗаявки,
		|	""TR-"" + _СделкиРепо.НомерПервойЧасти КАК НомерТранзакции,
		|	_СделкиРепо.КодСчетаДУ КАК КодСчетаДУ,
		|	_СделкиРепо.СтавкаРЕПО КАК СтавкаРЕПО,
		|	_СделкиРепо.КодРежимаБиржевыхТоргов КАК КодРежимаБиржевыхТоргов,
		|	ВЫБОР
		|		КОГДА УсловияСделокРЕПО.ЧастьСделкиРЕПО = 1
		|					И _СделкиРепо.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ИЛИ УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2
		|					И _СделкиРепо.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ КАК ВидСделки,
		|	_ЦеныОценки.Цена КАК СтоимостьПереоценки,
		|	ВЫБОР
		|		КОГДА _СделкиРепо.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ""005""
		|		ИНАЧЕ ""004""
		|	КОНЕЦ КАК МестоХраненияЦБ
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	_СделкиРепо КАК _СделкиРепо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ДатаВыгрузкиКонецДня,
		|				Организация = &Организация
		|					И СделкаРЕПО В
		|						(ВЫБРАТЬ
		|							Репо.Ссылка
		|						ИЗ
		|							_СделкиРепо КАК Репо)) КАК УсловияСделокРЕПО
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ЦеныОценкиАктивов КАК _ЦеныОценки
		|			ПО УсловияСделокРЕПО.Организация = _ЦеныОценки.Организация
		|				И УсловияСделокРЕПО.СчетДоверительногоУправления = _ЦеныОценки.СчетДоверительногоУправления
		|				И УсловияСделокРЕПО.ЦеннаяБумага = _ЦеныОценки.ЦеннаяБумага
		|		ПО _СделкиРепо.Ссылка = УсловияСделокРЕПО.СделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоБрокерскойКомиссии
		|		ПО _СделкиРепо.Ссылка = РасходыПоБрокерскойКомиссии.Ссылка
		|			И (РасходыПоБрокерскойКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделке КАК РасходыПоТорговойКомиссии
		|		ПО _СделкиРепо.Ссылка = РасходыПоТорговойКомиссии.Ссылка
		|			И (РасходыПоТорговойКомиссии.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделок.СделкаРепо КАК СделкаРепо,
		|	КодыЦБ.Код КАК МатрихКодЦБ,
		|	ЕСТЬNULL(_КодыМатрихКонтрагентов.Код, &МатрихКод_НКО_НКЦ) КАК МатрихКодКонтрагента,
		|	_КодыМатрихДепозитариев.Код КАК МатрихКодДепозитария,
		|	_КодыМатрихКлиентов.Код КАК МатрихКодКлиента,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК МатрихКодБанка,
		|	_УсловияСделок.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО
		|ПОМЕСТИТЬ _КодыМатрихОбщие
		|ИЗ
		|	_УсловияСделок КАК _УсловияСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК КодыЦБ
		|		ПО _УсловияСделок.ЦеннаяБумага = КодыЦБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _УсловияСделок.Банк = _КодыМатрихБанков.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихДепозитариев
		|		ПО _УсловияСделок.Депозитарий = _КодыМатрихДепозитариев.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКонтрагентов
		|		ПО _УсловияСделок.Контрагент = _КодыМатрихКонтрагентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|		ПО _УсловияСделок.Клиент = _КодыМатрихКлиентов.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""СделкаРепо"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_УсловияСделок.НомерСделки КАК СТРОКА(50)) КАК id,
		|	_УсловияСделок.НомерТранзакции КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	_УсловияСделок.ДатаВремяСделки КАК tradeDate,
		|	_УсловияСделок.ДатаВремяСделки КАК tradeDateTime,
		|	_УсловияСделок.ДатаОплаты КАК paymentDate,
		|	_УсловияСделок.ДатаПоставки КАК deliveryDate,
		|	_УсловияСделок.КодМестаХранения КАК tradingFloorId,
		|	_УсловияСделок.МестоХраненияЦБ КАК productCode,
		|	_УсловияСделок.Количество КАК quantity,
		|	_УсловияСделок.Цена КАК price,
		|	_УсловияСделок.ОбщаяСуммаСделки КАК payment,
		|	_УсловияСделок.СуммаСделкиРепо КАК paymentAssetFlows,
		|	_УсловияСделок.КодСчетаДУ КАК portfolioId,
		|	_КодыМатрих.МатрихКодЦБ КАК instrumentId,
		|	_КодыМатрих.МатрихКодКонтрагента КАК counterpartyId,
		|	_КодыМатрих.МатрихКодБанка КАК moneyCounterpartyId,
		|	_КодыМатрих.МатрихКодДепозитария КАК depositaryId,
		|	_КодыМатрих.МатрихКодКлиента КАК customerId,
		|	"""" КАК expirationDate,
		|	_ВалютыОплаты.МатрихКодВалюты КАК paymentCurrencyCode,
		|	_ВалютыСделок.МатрихКодВалюты КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	_УсловияСделок.ЧастьСделкиРЕПО КАК legNumber,
		|	_УсловияСделок.ЦенаКупона КАК accruedInterest,
		|	ВЫБОР
		|		КОГДА _УсловияСделок.СтоимостьПереоценки = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(_УсловияСделок.СтоимостьПереоценки, 1)
		|	КОНЕЦ КАК dirtyPrice,
		|	_КодыМатрих.МатрихКодКлиента КАК branchId,
		|	""BRK"" КАК scope,
		|	""REP"" КАК type,
		|	_УсловияСделок.СтавкаРЕПО КАК interestRate,
		|	_УсловияСделок.КодРежимаБиржевыхТоргов КАК tradingModeId,
		|	""DVP"" КАК settlementType,
		|	_УсловияСделок.ВидСделки КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	ВЫРАЗИТЬ(_УсловияСделок.НомерЗаявки КАК СТРОКА(20)) КАК originId,
		|	_УсловияСделок.ДатаОплатыТК КАК ДатаОплатыТорговойКомиссии,
		|	ЕСТЬNULL(-_УсловияСделок.ТК, 0) КАК ТорговаяКомиссия,
		|	_ВалютыТорговойКомиссии.МатрихКодВалюты КАК ВалютаТорговойКомиссии,
		|	_УсловияСделок.ДатаОплатыБК КАК ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(-_УсловияСделок.БК, 0) КАК КомиссияБрокера,
		|	_ВалютыБрокерскойКомиссии.МатрихКодВалюты КАК ВалютаКомиссииБрокера
		|ПОМЕСТИТЬ _ДанныеСделокРепо
		|ИЗ
		|	_УсловияСделок КАК _УсловияСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрихОбщие КАК _КодыМатрих
		|		ПО _УсловияСделок.СделкаРепо = _КодыМатрих.СделкаРепо
		|			И _УсловияСделок.ЧастьСделкиРЕПО = _КодыМатрих.ЧастьСделкиРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _ВалютыСделок
		|		ПО _УсловияСделок.ВалютаСделки = _ВалютыСделок.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _ВалютыОплаты
		|		ПО _УсловияСделок.ВалютаОплаты = _ВалютыОплаты.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _ВалютыТорговойКомиссии
		|		ПО _УсловияСделок.ВалютаТК = _ВалютыТорговойКомиссии.ВалютаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК _ВалютыБрокерскойКомиссии
		|		ПО _УсловияСделок.ВалютаБК = _ВалютыБрокерскойКомиссии.ВалютаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.ORIGIN_ID КАК ORIGIN_ID,
		|	_РанееВыгруженныеОперации.SYSTEM_CODE КАК SYSTEM_CODE,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE
		|ПОМЕСТИТЬ _РанееВыгруженныеСделкиРепо
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""СделкаРепо"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеСделокРепо.comment КАК comment,
		|	_ДанныеСделокРепо.id КАК id,
		|	_ДанныеСделокРепо.transactionId КАК transactionId,
		|	_ДанныеСделокРепо.isBalance КАК isBalance,
		|	_ДанныеСделокРепо.systemCode КАК systemCode,
		|	_ДанныеСделокРепо.tradeDate КАК tradeDate,
		|	_ДанныеСделокРепо.tradeDateTime КАК tradeDateTime,
		|	_ДанныеСделокРепо.paymentDate КАК paymentDate,
		|	_ДанныеСделокРепо.deliveryDate КАК deliveryDate,
		|	_ДанныеСделокРепо.tradingFloorId КАК tradingFloorId,
		|	_ДанныеСделокРепо.productCode КАК productCode,
		|	_ДанныеСделокРепо.quantity КАК quantity,
		|	_ДанныеСделокРепо.price КАК price,
		|	_ДанныеСделокРепо.payment КАК payment,
		|	_ДанныеСделокРепо.paymentAssetFlows КАК paymentAssetFlows,
		|	_ДанныеСделокРепо.portfolioId КАК portfolioId,
		|	_ДанныеСделокРепо.instrumentId КАК instrumentId,
		|	_ДанныеСделокРепо.counterpartyId КАК counterpartyId,
		|	_ДанныеСделокРепо.moneyCounterpartyId КАК moneyCounterpartyId,
		|	_ДанныеСделокРепо.depositaryId КАК depositaryId,
		|	_ДанныеСделокРепо.customerId КАК customerId,
		|	_ДанныеСделокРепо.expirationDate КАК expirationDate,
		|	_ДанныеСделокРепо.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ДанныеСделокРепо.priceCurrencyCode КАК priceCurrencyCode,
		|	_ДанныеСделокРепо.traderId КАК traderId,
		|	_ДанныеСделокРепо.lastTraderId КАК lastTraderId,
		|	_ДанныеСделокРепо.legNumber КАК legNumber,
		|	_ДанныеСделокРепо.accruedInterest КАК accruedInterest,
		|	_ДанныеСделокРепо.dirtyPrice КАК dirtyPrice,
		|	_ДанныеСделокРепо.branchId КАК branchId,
		|	_ДанныеСделокРепо.scope КАК scope,
		|	_ДанныеСделокРепо.type КАК type,
		|	_ДанныеСделокРепо.interestRate КАК interestRate,
		|	_ДанныеСделокРепо.tradingModeId КАК tradingModeId,
		|	_ДанныеСделокРепо.settlementType КАК settlementType,
		|	_ДанныеСделокРепо.side КАК side,
		|	_ДанныеСделокРепо.bOstatus КАК bOstatus,
		|	_ДанныеСделокРепо.isSkipDetails КАК isSkipDetails,
		|	_ДанныеСделокРепо.objectType КАК objectType,
		|	_ДанныеСделокРепо.originId КАК originId,
		|	_ДанныеСделокРепо.ДатаОплатыТорговойКомиссии КАК ДатаОплатыТорговойКомиссии,
		|	_ДанныеСделокРепо.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	_ДанныеСделокРепо.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	_ДанныеСделокРепо.ДатаОплатыКомиссииБрокера КАК ДатаОплатыКомиссииБрокера,
		|	_ДанныеСделокРепо.КомиссияБрокера КАК КомиссияБрокера,
		|	_ДанныеСделокРепо.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеСделкиРепо.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА _РанееВыгруженныеСделкиРепо.SYSTEM_CODE = ""ME""
		|				И _ДанныеСделокРепо.originId = _РанееВыгруженныеСделкиРепо.ORIGIN_ID
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеСделкиРепо.ID ЕСТЬ NULL
		|			ТОГДА NULL
		|		КОГДА _ДанныеСделокРепо.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеСделкиРепо.ID
		|		КОГДА _РанееВыгруженныеСделкиРепо.SYSTEM_CODE = ""ME""
		|				И _РанееВыгруженныеСделкиРепо.ORIGIN_ID <> """"
		|				И _ДанныеСделокРепо.originId = _РанееВыгруженныеСделкиРепо.ORIGIN_ID
		|			ТОГДА _РанееВыгруженныеСделкиРепо.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеСделкиРепо.SYSTEM_CODE <> ""1C""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СравнениеСДругойСистемой,
		|	_РанееВыгруженныеСделкиРепо.ID КАК РанееID,
		|	_РанееВыгруженныеСделкиРепо.SYSTEM_CODE КАК РанееSYSTEM_CODE,
		|	_РанееВыгруженныеСделкиРепо.ORIGIN_ID КАК РанееORIGIN_ID
		|ИЗ
		|	_ДанныеСделокРепо КАК _ДанныеСделокРепо
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеСделкиРепо КАК _РанееВыгруженныеСделкиРепо
		|		ПО (_ДанныеСделокРепо.id = _РанееВыгруженныеСделкиРепо.ID
		|				ИЛИ _РанееВыгруженныеСделкиРепо.SYSTEM_CODE = ""ME""
		|					И _РанееВыгруженныеСделкиРепо.ORIGIN_ID <> """"
		|					И _ДанныеСделокРепо.originId = _РанееВыгруженныеСделкиРепо.ORIGIN_ID)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _УсловияСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КодыМатрихОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РасходыПоСделке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СделкиРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ДанныеСделокРепо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеСделкиРепо";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	// Операции (вводы/выводы ДС, переводы ДС, начисленные дивиденды, задолженность по сделкам с валютой, поручения на вывод)
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПереводДенежныхСредств
		|				И ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ""Перевод-2-""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПереводДенежныхСредств
		|					ТОГДА ""Перевод-""
		|				КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ВыводДенежныхСредств
		|					ТОГДА ВЫБОР
		|							КОГДА ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаНДФЛ)
		|								ТОГДА ""Вывод-НДФЛ-""
		|							ИНАЧЕ ""Вывод-""
		|						КОНЕЦ
		|				КОГДА ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ВводДенежныхСредств
		|					ТОГДА ""Ввод-""
		|			КОНЕЦ
		|	КОНЕЦ + ОстаткиДенежныхСредств.Регистратор.Номер КАК Номер,
		|	ОстаткиДенежныхСредств.Период КАК Дата,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА -ОстаткиДенежныхСредств.Сумма
		|		ИНАЧЕ ОстаткиДенежныхСредств.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА ""S""
		|		ИНАЧЕ ""B""
		|	КОНЕЦ КАК ВидДвижения,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДУ,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	ОстаткиДенежныхСредств.РасчетныйСчет.Банк.ЮрФизЛицо КАК ЮрЛицоБанка,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредств.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ""001""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|					ТОГДА ""002""
		|				КОГДА ОстаткиДенежныхСредств.МестоХранения = &РазделFORTS
		|					ТОГДА ""006""
		|				КОГДА ОстаткиДенежныхСредств.МестоХранения = &РазделFX
		|					ТОГДА ""007""
		|				ИНАЧЕ ""003""
		|			КОНЕЦ
		|	КОНЕЦ КАК ЕгарКодМестаХранения
		|ПОМЕСТИТЬ _ДанныеУчетнойСистемы
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И (ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ПереводДенежныхСредств
		|			ИЛИ ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ВыводДенежныхСредств
		|			ИЛИ ОстаткиДенежныхСредств.Регистратор ССЫЛКА Документ.ВводДенежныхСредств)
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаВыгрузкиНачалоДня И &ДатаВыгрузкиКонецДня
		|	И НЕ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИзПути)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаСВалютой
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Валюта.Наименование + ""-Валюта-""
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеДивидендов
		|			ТОГДА КодыЦБ.Код + ""-Дивиденды-""
		|	КОНЕЦ + ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления.КодСчета,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеДивидендов
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ДатаОплатыПлановая > &ДатаВыгрузкиКонецДня
		|						ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ДатаОплатыПлановая
		|					ИНАЧЕ &ДатаВыгрузкиКонецДня
		|				КОНЕЦ
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаСВалютой
		|				И ЗадолженностиПоДенежнымСредствамОстатки.Основание.ОтложенноеИсполнение
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.ДатаИсполнения
		|		ИНАЧЕ &ДатаВыгрузкиКонецДня
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|		ИНАЧЕ -ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ""B""
		|		ИНАЧЕ ""S""
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления.КодСчета,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.РасчетныйСчет.Банк.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеДивидендов
		|			ТОГДА ВЫБОР
		|					КОГДА НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА ""001""
		|					ИНАЧЕ ""002""
		|				КОНЕЦ
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаСВалютой
		|			ТОГДА ВЫБОР
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА ""001""
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|						ТОГДА ""002""
		|					КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.МестоХранения = &РазделFX
		|						ТОГДА ""007""
		|					ИНАЧЕ ""003""
		|				КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ДатаВыгрузкиКонецДня,
		|			Организация = &Организация
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
		|				И (Основание ССЫЛКА Документ.НачислениеДивидендов
		|					ИЛИ Основание ССЫЛКА Документ.СделкаСВалютой)
		|				И РАЗНОСТЬДАТ(Основание.Дата, &ДатаВыгрузкиКонецДня, ГОД) < 1) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК КодыЦБ
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание.ЦеннаяБумага = КодыЦБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаДоходовПоЦеннымБумагам.СрезПоследних(&ДатаВыгрузкиКонецДня, Организация = &Организация) КАК НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних
		|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Организация = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Организация
		|			И ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления = НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Поручение-"" + ДокПоручение.СчетДоверительногоУправления.КодСчета + ""-"" + ДокПоручение.НомерВходящегоДокумента,
		|	ДокПоручение.ДатаИсполненияПо,
		|	-ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта,
		|	""S"",
		|	ДокПоручение.СчетДоверительногоУправления,
		|	ДокПоручение.СчетДоверительногоУправления.КодСчета,
		|	ДокПоручение.РасчетныйСчет.Банк.ЮрФизЛицо,
		|	""010""
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|			&ДатаВыгрузкиКонецДня,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И Основание ССЫЛКА Документ.ПоручениеНаДвижениеДенежныхСредств
		|				И ВЫРАЗИТЬ(Основание КАК Документ.ПоручениеНаДвижениеДенежныхСредств).СпособПередачи <> ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема)) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеНаДвижениеДенежныхСредств КАК ДокПоручение
		|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание = ДокПоручение.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеУчетнойСистемы.Номер КАК Номер,
		|	_ДанныеУчетнойСистемы.Дата КАК Дата,
		|	_ДанныеУчетнойСистемы.Сумма КАК Сумма,
		|	ВалютыОперации.МатрихКодВалюты КАК ВалютаКод,
		|	_ДанныеУчетнойСистемы.ВидДвижения КАК ВидДвижения,
		|	_ДанныеУчетнойСистемы.СчетДУ КАК СчетДУ,
		|	_ДанныеУчетнойСистемы.КодСчета КАК КодСчета,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, _ДанныеУчетнойСистемы.ЮрЛицоБанка) КАК ЮрЛицоБанка,
		|	_ДанныеУчетнойСистемы.ЕгарКодМестаХранения КАК ЕгарКодМестаХранения
		|ПОМЕСТИТЬ _Операции
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаВыгрузкиКонецДня, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО _ДанныеУчетнойСистемы.ЮрЛицоБанка = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Валюты КАК ВалютыОперации
		|		ПО _ДанныеУчетнойСистемы.Валюта = ВалютыОперации.ВалютаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(""ОперацияДС"" КАК СТРОКА(15)) КАК comment,
		|	ВЫРАЗИТЬ(_Операции.Номер КАК СТРОКА(50)) КАК id,
		|	"""" КАК transactionId,
		|	0 КАК isBalance,
		|	""1C"" КАК systemCode,
		|	_Операции.Дата КАК tradeDate,
		|	_Операции.Дата КАК tradeDateTime,
		|	_Операции.Дата КАК paymentDate,
		|	_Операции.Дата КАК deliveryDate,
		|	"""" КАК tradingFloorId,
		|	_Операции.ЕгарКодМестаХранения КАК productCode,
		|	ВЫРАЗИТЬ(_Операции.Сумма КАК ЧИСЛО(19, 4)) КАК quantity,
		|	1 КАК price,
		|	ВЫРАЗИТЬ(_Операции.Сумма КАК ЧИСЛО(19, 4)) КАК payment,
		|	_Операции.КодСчета КАК portfolioId,
		|	_Операции.ВалютаКод КАК instrumentId,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК counterpartyId,
		|	ЕСТЬNULL(_КодыМатрихБанков.Код, &МатрихКод_НКО_НКЦ) КАК depositaryId,
		|	_КодыМатрихКлиентов.Код КАК customerId,
		|	"""" КАК expirationDate,
		|	_Операции.ВалютаКод КАК paymentCurrencyCode,
		|	_Операции.ВалютаКод КАК priceCurrencyCode,
		|	0 КАК traderId,
		|	0 КАК lastTraderId,
		|	0 КАК legNumber,
		|	0 КАК accruedInterest,
		|	1 КАК dirtyPrice,
		|	_КодыМатрихКлиентов.Код КАК branchId,
		|	""BRK"" КАК scope,
		|	""BAL"" КАК type,
		|	0 КАК interestRate,
		|	"""" КАК tradingModeId,
		|	""SAF"" КАК settlementType,
		|	_Операции.ВидДвижения КАК side,
		|	""ST"" КАК bOstatus,
		|	1 КАК isSkipDetails,
		|	""T"" КАК objectType,
		|	"""" КАК originId,
		|	""PR"" КАК assetFlowsType
		|ПОМЕСТИТЬ _ОперацииДС
		|ИЗ
		|	_Операции КАК _Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВыгрузкиКонецДня, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихКлиентов
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = _КодыМатрихКлиентов.Объект
		|		ПО _Операции.СчетДУ = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыМатрих КАК _КодыМатрихБанков
		|		ПО _Операции.ЮрЛицоБанка = _КодыМатрихБанков.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РанееВыгруженныеОперации.ID КАК ID,
		|	_РанееВыгруженныеОперации.QUANTITY КАК QUANTITY,
		|	_РанееВыгруженныеОперации.PRICE КАК PRICE,
		|	_РанееВыгруженныеОперации.PRODUCT_CODE КАК PRODUCT_CODE
		|ПОМЕСТИТЬ _РанееВыгруженныеОперацииДС
		|ИЗ
		|	_РанееВыгруженныеОперации КАК _РанееВыгруженныеОперации
		|ГДЕ
		|	_РанееВыгруженныеОперации.COMMENT = (ВЫРАЗИТЬ(""ОперацияДС"" КАК СТРОКА(15)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииДС.comment КАК comment,
		|	_ОперацииДС.id КАК id,
		|	_ОперацииДС.transactionId КАК transactionId,
		|	_ОперацииДС.isBalance КАК isBalance,
		|	_ОперацииДС.systemCode КАК systemCode,
		|	_ОперацииДС.tradeDate КАК tradeDate,
		|	_ОперацииДС.tradeDateTime КАК tradeDateTime,
		|	_ОперацииДС.paymentDate КАК paymentDate,
		|	_ОперацииДС.deliveryDate КАК deliveryDate,
		|	_ОперацииДС.tradingFloorId КАК tradingFloorId,
		|	_ОперацииДС.productCode КАК productCode,
		|	_ОперацииДС.quantity КАК quantity,
		|	_ОперацииДС.price КАК price,
		|	_ОперацииДС.payment КАК payment,
		|	_ОперацииДС.portfolioId КАК portfolioId,
		|	_ОперацииДС.instrumentId КАК instrumentId,
		|	_ОперацииДС.counterpartyId КАК counterpartyId,
		|	_ОперацииДС.depositaryId КАК depositaryId,
		|	_ОперацииДС.customerId КАК customerId,
		|	_ОперацииДС.expirationDate КАК expirationDate,
		|	_ОперацииДС.paymentCurrencyCode КАК paymentCurrencyCode,
		|	_ОперацииДС.priceCurrencyCode КАК priceCurrencyCode,
		|	_ОперацииДС.traderId КАК traderId,
		|	_ОперацииДС.lastTraderId КАК lastTraderId,
		|	_ОперацииДС.legNumber КАК legNumber,
		|	_ОперацииДС.accruedInterest КАК accruedInterest,
		|	_ОперацииДС.dirtyPrice КАК dirtyPrice,
		|	_ОперацииДС.branchId КАК branchId,
		|	_ОперацииДС.scope КАК scope,
		|	_ОперацииДС.type КАК type,
		|	_ОперацииДС.interestRate КАК interestRate,
		|	_ОперацииДС.tradingModeId КАК tradingModeId,
		|	_ОперацииДС.settlementType КАК settlementType,
		|	_ОперацииДС.side КАК side,
		|	_ОперацииДС.bOstatus КАК bOstatus,
		|	_ОперацииДС.isSkipDetails КАК isSkipDetails,
		|	_ОперацииДС.objectType КАК objectType,
		|	_ОперацииДС.originId КАК originId,
		|	_ОперацииДС.assetFlowsType КАК assetFlowsType,
		|	ВЫБОР
		|		КОГДА _РанееВыгруженныеОперацииДС.ID ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР
		|		КОГДА _ОперацииДС.id ЕСТЬ NULL
		|			ТОГДА _РанееВыгруженныеОперацииДС.ID
		|	КОНЕЦ КАК ИДСделкиДляУдаления
		|ИЗ
		|	_ОперацииДС КАК _ОперацииДС
		|		ПОЛНОЕ СОЕДИНЕНИЕ _РанееВыгруженныеОперацииДС КАК _РанееВыгруженныеОперацииДС
		|		ПО _ОперацииДС.id = _РанееВыгруженныеОперацииДС.ID
		|			И _ОперацииДС.quantity = _РанееВыгруженныеОперацииДС.QUANTITY
		|			И (ПОДСТРОКА(_ОперацииДС.productCode, 2, 2) = _РанееВыгруженныеОперацииДС.PRODUCT_CODE)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _Операции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ОперацииДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РанееВыгруженныеОперацииДС";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("РазделFX", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FX"));
	Запрос.УстановитьПараметр("РазделFORTS", ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС_раздел_FORTS"));
	
	ОбработатьРезультатЗапроса(Запрос.Выполнить().Выбрать(), СделкиДляВыгрузки, СделкиДляУдаления);
	
	Если СделкиДляУдаления.Количество() > 0 Тогда
		УдалитьДанные(, ПараметрыПодключения, СделкиДляУдаления);
	КонецЕсли;
	
	КоличествоЗапросовВыгрузки = 0;
	
	Если СделкиДляВыгрузки.Количество() > 0 Тогда
		Для Каждого Портфель Из СделкиДляВыгрузки Цикл
			ТелоЗапросаJSON = ПолучитьСтрокуJSON(Портфель.Значение);
			Если ТелоЗапросаJSON <> Неопределено Тогда
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Trades, ТелоЗапросаJSON);
				КоличествоЗапросовВыгрузки = КоличествоЗапросовВыгрузки + Портфель.Значение.Количество();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляСтатистики.Вставить("ПроцедураВыгрузкиСделок", "Время выполнения: " + РассчитатьВремя(СтартЗапуска)
		+ ". Удалено: " + Строка(СделкиДляУдаления.Количество()) + ", загружено: " + Строка(КоличествоЗапросовВыгрузки) + ".");
КонецПроцедуры

Процедура ОбновитьПараметрыКлиентов(ПараметрыПодключения, ДанныеДляСтатистики)
	СтартЗапуска = ТекущаяДатаСеанса();
	
	ЗапросSQL = "SELECT
				|LZ_PORTFOLIOS.EXTERNAL_ID,
				|CAST(LZ_PORTFOLIOS.BROKER_ID AS VARCHAR(55)) AS BROKER_EGAR_ID,
				|LZ_COUNTERPARTIES.EXTERNAL_ID AS BROKER_MATRIX_ID,
				|LZ_PORTFOLIOS.SPOT_ALLOWED,
				|LZ_PORTFOLIOS.REPO_ALLOWED,
				|LZ_PORTFOLIOS.FOREIGN_ALLOWED
				|FROM LZ_PORTFOLIOS
				|INNER JOIN LZ_COUNTERPARTIES ON LZ_PORTFOLIOS.BROKER_ID = LZ_COUNTERPARTIES.ID
				|WHERE USE_FOR_CONSOLIDATION = 1 AND NOT LZ_PORTFOLIOS.NAME LIKE '%Расторгнут%'";
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("EXTERNAL_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ТипыКолонок.Вставить("BROKER_EGAR_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ТипыКолонок.Вставить("BROKER_MATRIX_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ТипыКолонок.Вставить("SPOT_ALLOWED", Новый ОписаниеТипов("Булево"));
	ТипыКолонок.Вставить("REPO_ALLOWED", Новый ОписаниеТипов("Булево"));
	ТипыКолонок.Вставить("FOREIGN_ALLOWED", Новый ОписаниеТипов("Булево"));
	
	ПараметрыКлиентовЕгар = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей, ТипыКолонок);
	
	Если ПараметрыКлиентовЕгар = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыКлиентовЕгар.EXTERNAL_ID КАК EXTERNAL_ID,
		|	ПараметрыКлиентовЕгар.BROKER_EGAR_ID КАК BROKER_EGAR_ID,
		|	ПараметрыКлиентовЕгар.BROKER_MATRIX_ID КАК BROKER_MATRIX_ID,
		|	ПараметрыКлиентовЕгар.REPO_ALLOWED КАК REPO_ALLOWED,
		|	ПараметрыКлиентовЕгар.SPOT_ALLOWED КАК SPOT_ALLOWED,
		|	ПараметрыКлиентовЕгар.FOREIGN_ALLOWED КАК FOREIGN_ALLOWED
		|ПОМЕСТИТЬ _ПараметрыКлиентовЕгар
		|ИЗ
		|	&ПараметрыКлиентовЕгар КАК ПараметрыКлиентовЕгар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодБрокера,
		|	УсловияДоговоровСБрокером.Репо КАК ПризнакРепо,
		|	НЕ(УсловияДоговоровСБрокером.ФРОРК = """"
		|			И УсловияДоговоровСБрокером.КодРасчетовВВалютеНаФондовомРынке = """") КАК ПризнакФондовыйРынок,
		|	НЕ(УсловияДоговоровСБрокером.КодРасчетовВРубляхНаВалютномРынке = """"
		|			И УсловияДоговоровСБрокером.КодРасчетовВВалютеНаВалютномРынке = """") КАК ПризнакВалютныйРынок
		|ПОМЕСТИТЬ _ПараметрыКлиентов_1С
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаВыгрузкиКонецДня,
		|			СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиКонецДня
		|				ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаВыгрузкиКонецДня, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровБрокерскогоОбслуживания.СрезПоследних(&ДатаВыгрузкиКонецДня, ) КАК УсловияДоговоровСБрокером
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровСБрокером.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ДатаВыгрузкиКонецДня,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо = КодыВоВнешнихСистемахСрезПоследних.Объект
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаВыгрузкиКонецДня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПараметрыКлиентовЕгар.EXTERNAL_ID КАК EXTERNAL_ID,
		|	_ПараметрыКлиентовЕгар.BROKER_EGAR_ID КАК BROKER_EGAR_ID,
		|	ВЫБОР
		|		КОГДА _ПараметрыКлиентов_1С.ПризнакРепо
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК REPO_ALLOWED,
		|	ВЫБОР
		|		КОГДА _ПараметрыКлиентов_1С.ПризнакФондовыйРынок
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК SPOT_ALLOWED,
		|	ВЫБОР
		|		КОГДА _ПараметрыКлиентов_1С.ПризнакВалютныйРынок
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК FOREIGN_ALLOWED
		|ИЗ
		|	_ПараметрыКлиентовЕгар КАК _ПараметрыКлиентовЕгар
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПараметрыКлиентов_1С КАК _ПараметрыКлиентов_1С
		|		ПО _ПараметрыКлиентовЕгар.EXTERNAL_ID = _ПараметрыКлиентов_1С.КодСчетаДУ
		|			И _ПараметрыКлиентовЕгар.BROKER_MATRIX_ID = _ПараметрыКлиентов_1С.КодБрокера
		|			И (_ПараметрыКлиентовЕгар.REPO_ALLOWED <> _ПараметрыКлиентов_1С.ПризнакРепо
		|				ИЛИ _ПараметрыКлиентовЕгар.SPOT_ALLOWED <> _ПараметрыКлиентов_1С.ПризнакФондовыйРынок
		|				ИЛИ _ПараметрыКлиентовЕгар.FOREIGN_ALLOWED <> _ПараметрыКлиентов_1С.ПризнакВалютныйРынок)";
	
#КонецОбласти
	
	Запрос.УстановитьПараметр("ПараметрыКлиентовЕгар", ПараметрыКлиентовЕгар);
	Запрос.УстановитьПараметр("ДатаВыгрузкиКонецДня", КонецДня(ДатаВыгрузки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		UpdateQuery = СтрШаблон("UPDATE [LZ_PORTFOLIOS] SET [REPO_ALLOWED] = %1, [SPOT_ALLOWED] = %2, [FOREIGN_ALLOWED] = %3
								|FROM [LZ_PORTFOLIOS] 
								|WHERE [LZ_PORTFOLIOS].[EXTERNAL_ID] = '%4' AND [LZ_PORTFOLIOS].[BROKER_ID] = '%5'",
								Выборка.REPO_ALLOWED, Выборка.SPOT_ALLOWED, Выборка.FOREIGN_ALLOWED, Выборка.EXTERNAL_ID, Выборка.BROKER_EGAR_ID);
		
		Если РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, UpdateQuery) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляСтатистики.Вставить("ОбновлениеПараметровКлиентов", "Время выполнения: " + РассчитатьВремя(СтартЗапуска) + ".");
КонецПроцедуры

Процедура СформироватьИВыгрузитьДанныеБумагУдерживаемыхДоПогашения(ПараметрыПодключения, ДанныеДляСтатистики, Сервер)
	СтартЗапуска = ТекущаяДатаСеанса();
	МассивДанныхДляВыгрузки = Новый Массив;
	ТекстСообщения = "";
	
	Query = "SELECT PAPERS.EXTERNAL_ID [INSTRUMENT_ID], CLIENTS.EXTERNAL_ID [PORTFOLIO_ID], HTM.[EXTERNAL_ID]
			|FROM [LZRG_BONDS_HTM] HTM
			|	LEFT JOIN [LZ_INSTRUMENTS] PAPERS
			|		ON HTM.INSTRUMENT_ID = PAPERS.ID
			|	LEFT JOIN [LZ_PORTFOLIOS] CLIENTS
			|		ON HTM.PORTFOLIO_ID = CLIENTS.ID";
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, Query);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦенныеБумагиЕгар = Новый ТаблицаЗначений;
	ЦенныеБумагиЕгар.Колонки.Добавить("INSTRUMENT_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ЦенныеБумагиЕгар.Колонки.Добавить("PORTFOLIO_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ЦенныеБумагиЕгар.Колонки.Добавить("EXTERNAL_ID", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	ДанныеИзЕгар = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей,, Новый Структура("ВозвращатьПустуюТаблицу", Истина));
	
	Если ДанныеИзЕгар = Неопределено Тогда
		Возврат;
	Иначе
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДанныеИзЕгар, ЦенныеБумагиЕгар);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенныеБумагиЕгар.INSTRUMENT_ID КАК instrumentId,
		|	ЦенныеБумагиЕгар.PORTFOLIO_ID КАК portfolioId,
		|	ЦенныеБумагиЕгар.EXTERNAL_ID КАК externalId
		|ПОМЕСТИТЬ _ЦенныеБумаги_Егар
		|ИЗ
		|	&ЦенныеБумагиЕгар КАК ЦенныеБумагиЕгар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления.КодСчета КАК КодСчета
		|ПОМЕСТИТЬ _БухПартииОстатки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаВыгрузкиНачалоДня,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И УчетныйАктивЕПС В (&УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости)
		|				И Организация В (&РЭМ, &Траст)) КАК БухПартииЦенныхБумагОстатки
		|ГДЕ
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.Брокер КАК Брокер
		|ПОМЕСТИТЬ _СчетаВОстатках
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредствОстатки.Брокер КАК Брокер
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				,
		|				Организация В (&РЭМ, &Траст)
		|					И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня
		|						ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|					И НЕ СчетДоверительногоУправления.ПометкаУдаления) КАК ОстаткиДенежныхСредствОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Брокер
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|				,
		|				Организация В (&РЭМ, &Траст)
		|					И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня
		|						ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|					И НЕ СчетДоверительногоУправления.ПометкаУдаления) КАК ОстаткиЦенныхБумагОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.СчетДоверительногоУправления,
		|		ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки.Поручение.ДепозитарныйСчет.Брокер
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоЦеннымБумагамПоПоручениям.Остатки(
		|				,
		|				Организация В (&РЭМ, &Траст)
		|					И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня
		|						ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|					И НЕ СчетДоверительногоУправления.ПометкаУдаления) КАК ЗадолженностиПоЦеннымБумагамПоПоручениямОстатки) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаВОстатках.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВЫБОР
		|			КОГДА _СчетаВОстатках.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоБрокеров
		|ПОМЕСТИТЬ _КоличествоБрокеровВОстатках
		|ИЗ
		|	_СчетаВОстатках КАК _СчетаВОстатках
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаВОстатках.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоБрокеровВОстатках.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаВОстатках.Брокер КАК Брокер
		|ПОМЕСТИТЬ _СчетаИзОстатковСБрокером
		|ИЗ
		|	_КоличествоБрокеровВОстатках КАК _КоличествоБрокеровВОстатках
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаВОстатках КАК _СчетаВОстатках
		|		ПО _КоличествоБрокеровВОстатках.СчетДоверительногоУправления = _СчетаВОстатках.СчетДоверительногоУправления
		|ГДЕ
		|	_КоличествоБрокеровВОстатках.КоличествоБрокеров = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КоличествоБрокеровВОстатках.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаИзОстатковБезБрокера
		|ИЗ
		|	_КоличествоБрокеровВОстатках КАК _КоличествоБрокеровВОстатках
		|ГДЕ
		|	_КоличествоБрокеровВОстатках.КоличествоБрокеров <> 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ _ВсеКодыУБрокеров
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаВыгрузкиНачалоДня,
		|			Организация В (&РЭМ, &Траст)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаВОстатках.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаВОстатках КАК _СчетаВОстатках)
		|				И (СчетДоверительногоУправления.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаВыгрузкиНачалоДня, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &ДатаВыгрузкиНачалоДня)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокеров
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) КАК КоличествоКодов
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ВсеКодыУБрокеров.Код) = 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеКодыУБрокеров.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыБрокеровСМаксимальнымПериодом
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ВсеКодыУБрокеров.Период) КАК Период
		|	ИЗ
		|		_ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ВсеКодыУБрокеров.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ВсеКодыУБрокеров.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаИзОстатковСБрокером.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаИзОстатковСБрокером.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_СчетаИзОстатковСБрокером.Брокер КАК Брокер,
		|	_ВсеКодыУБрокеров.Код КАК Код
		|ПОМЕСТИТЬ _КодыУБрокеров
		|ИЗ
		|	_СчетаИзОстатковСБрокером КАК _СчетаИзОстатковСБрокером
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеКодыУБрокеров КАК _ВсеКодыУБрокеров
		|		ПО _СчетаИзОстатковСБрокером.СчетДоверительногоУправления = _ВсеКодыУБрокеров.СчетДоверительногоУправления
		|			И _СчетаИзОстатковСБрокером.Брокер = _ВсеКодыУБрокеров.Брокер
		|ГДЕ
		|	_СчетаИзОстатковСБрокером.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СчетаИзОстатковБезБрокера.СчетДоверительногоУправления,
		|	_СчетаИзОстатковБезБрокера.СчетДоверительногоУправления.КодСчета,
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Брокер, _КодыБрокеровСМаксимальнымПериодом.Брокер),
		|	ЕСТЬNULL(_ЕдиничныеКодыУБрокеров.Код, _КодыБрокеровСМаксимальнымПериодом.Код)
		|ИЗ
		|	_СчетаИзОстатковБезБрокера КАК _СчетаИзОстатковБезБрокера
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокеров КАК _ЕдиничныеКодыУБрокеров
		|		ПО _СчетаИзОстатковБезБрокера.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыБрокеровСМаксимальнымПериодом КАК _КодыБрокеровСМаксимальнымПериодом
		|		ПО _СчетаИзОстатковБезБрокера.СчетДоверительногоУправления = _КодыБрокеровСМаксимальнымПериодом.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN
		|ПОМЕСТИТЬ _КодыЦБ
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И (ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|					ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи))) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО КодыВоВнешнихСистемахСрезПоследних.Объект = КодыВТорговыхСистемахСрезПоследних.Объект
		|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_БухПартииОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыУБрокеров.Код КАК КодУБрокера,
		|	_КодыУБрокеров.Брокер КАК Брокер,
		|	_БухПартииОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_БухПартииОстатки.КодСчета КАК portfolioId,
		|	_КодыЦБ.ISIN КАК ISIN,
		|	_КодыЦБ.Код КАК instrumentId
		|ПОМЕСТИТЬ _ЦенныеБумаги_1C
		|ИЗ
		|	_БухПартииОстатки КАК _БухПартииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЦБ КАК _КодыЦБ
		|		ПО _БухПартииОстатки.ЦеннаяБумага = _КодыЦБ.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокеров КАК _КодыУБрокеров
		|		ПО _БухПартииОстатки.СчетДоверительногоУправления = _КодыУБрокеров.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.СчетДоверительногоУправления, _КодыУБрокеров.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.КодУБрокера, _КодыУБрокеров.Код) КАК КодУБрокера,
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.ЦеннаяБумага, _КодыЦБ.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.ISIN, _КодыЦБ.ISIN) КАК ISIN,
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.portfolioId, _ЦенныеБумаги_Егар.portfolioId) КАК portfolioId,
		|	ЕСТЬNULL(_ЦенныеБумаги_1C.instrumentId, _ЦенныеБумаги_Егар.instrumentId) КАК instrumentId,
		|	_ЦенныеБумаги_Егар.externalId КАК externalId,
		|	_ЦенныеБумаги_1C.СчетДоверительногоУправления ЕСТЬ NULL КАК УдалитьЗапись,
		|	_ЦенныеБумаги_Егар.externalId ЕСТЬ NULL КАК ВыгрузитьЗапись
		|ИЗ
		|	_ЦенныеБумаги_Егар КАК _ЦенныеБумаги_Егар
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыУБрокеров КАК _КодыУБрокеров
		|		ПО _ЦенныеБумаги_Егар.portfolioId = _КодыУБрокеров.КодСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЦБ КАК _КодыЦБ
		|		ПО _ЦенныеБумаги_Егар.instrumentId = _КодыЦБ.Код
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ЦенныеБумаги_1C КАК _ЦенныеБумаги_1C
		|		ПО _ЦенныеБумаги_Егар.portfolioId = _ЦенныеБумаги_1C.portfolioId
		|			И _ЦенныеБумаги_Егар.instrumentId = _ЦенныеБумаги_1C.instrumentId
		|ГДЕ
		|	(_ЦенныеБумаги_1C.СчетДоверительногоУправления ЕСТЬ NULL
		|			ИЛИ _ЦенныеБумаги_Егар.externalId ЕСТЬ NULL)";
	#КонецОбласти
	Запрос.УстановитьПараметр("ДатаВыгрузкиНачалоДня", ДатаВыгрузки);
	Запрос.УстановитьПараметр("РЭМ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("Траст", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	Запрос.УстановитьПараметр("ЦенныеБумагиЕгар", ЦенныеБумагиЕгар);
	Запрос.УстановитьПараметр("УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости", Кэширование.УчетныеАктивыОцениваемыеПоАмортизированнойСтоимости());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Загружено = "";
		Удалено = "";
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВыгрузитьЗапись Тогда
				МассивДанныхДляВыгрузки.Добавить(Новый Структура("instrumentId, portfolioId, externalId",
					Выборка.instrumentId, Выборка.portfolioId, СокрЛП(Выборка.instrumentId) + "_" + СокрЛП(Выборка.portfolioId)));
				Загружено = Загружено + Символы.ПС + "<tr><td>" + Выборка.СчетДоверительногоУправления + "</td><td>" + Выборка.portfolioId + "</td><td>" + Выборка.КодУБрокера
					+ "</td><td class=""paper"">" + Выборка.ЦеннаяБумага + "</td><td class=""paper"">" + Выборка.instrumentId + "</td><td class=""paper"">" + Выборка.ISIN
					+ "</td><td>" + СокрЛП(Выборка.instrumentId) + "_" + СокрЛП(Выборка.portfolioId) + "</td></tr>";
			ИначеЕсли Выборка.УдалитьЗапись Тогда
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("DELETE", ПараметрыПодключения, ПараметрыПодключения.Bonds_htm + "/" + СокрЛП(Выборка.externalId));
				
				Если HTTPОтвет = Неопределено Тогда
					Удалено = Удалено + Символы.ПС + "<tr class=""warning""><td colspan=""7"">Не удалось удалить данные в Егар. Код ошибки: " + HTTPОтвет.КодСостояния
						+ "</td></tr><tr class=""warning""><td> " + Выборка.СчетДоверительногоУправления + "</td><td>" + Выборка.portfolioId
						+ "</td><td>" + Выборка.ЦеннаяБумага + "</td><td>" + Выборка.instrumentId + "</td><td>" + СокрЛП(Выборка.externalId) + "</td></tr>";
				Иначе
					Удалено = Удалено + Символы.ПС + "<tr><td>" + Выборка.СчетДоверительногоУправления + "</td><td>" + Выборка.portfolioId + "</td><td>" + Выборка.КодУБрокера
						+ "</td><td class=""paper"">" + Выборка.ЦеннаяБумага + "</td><td class=""paper"">" + Выборка.instrumentId + "</td><td class=""paper"">" + Выборка.ISIN
						+ "</td><td>" + СокрЛП(Выборка.externalId) + "</td></tr>";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивДанныхДляВыгрузки.Количество() > 0 Тогда
			ТелоЗапросаJSON = ПолучитьСтрокуJSON(МассивДанныхДляВыгрузки);
			
			Если ТелоЗапросаJSON <> Неопределено Тогда
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Bonds_htm, ТелоЗапросаJSON);
				
				Если HTTPОтвет <> Неопределено Тогда
					
					Если ЦенныеБумагиЕгар.Количество() = 0 Тогда
						ТекстСообщения = "<b>В Егар отсутствовали данные о ценных бумагах удерживаемых до погашения. В справочник [Bonds_HTM] загружено " + Выборка.Количество() + " зап.</b>";
					Иначе
						ТекстСообщения = "<b>Загружено</b><table cols=""7"">
										 |<tr class=""top""><td colspan=""3"">Счет доверительного управления</td><td colspan=""3"">Ценная бумага</td><td rowspan=""2"">External ID</td></tr>
										 |<tr class=""top""><td>Наименование</td><td>Код 1С</td><td>Код у брокера</td><td>Наименование</td><td>Код</td><td>ISIN</td></tr>" + Загружено + "</table>";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + ?(Удалено = "", "", Символы.ПС + "<b>Удалено</b>
			|<table cols=""7"">
			|<tr class=""top""><td colspan=""3"">Счет доверительного управления</td><td colspan=""3"">Ценная бумага</td><td rowspan=""2"">External ID</td></tr>
			|<tr class=""top""><td>Наименование</td><td>Код 1С</td><td>Код у брокера</td><td>Наименование</td><td>Код</td><td>ISIN</td></tr>" + Удалено + "</table>");
		
		Если ТекстСообщения <> "" Тогда
			ТекстСообщения =
				"<html>
				|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
				|	<style type=""text/css"">
				|		body     { font-family: ""Arial""; font-size: 12px; }
				|		b        { font-size: 14px; }
				|		table    { text-align: left; border-spacing: 0; border-collapse: collapse; }
				|		td       { border: 1px solid #CCC085; padding: 5px; }
				|		.paper   { color: #009646; }
				|		.warning { color: #DC143C; }
				|		.top     { background: #F4ECC5; }
				|	</style>
				|</head><body>" + ТекстСообщения + "</body></html>";
			РеквизитыОповещения = Новый Структура("Организация, Сервер, Текст", ЭтотОбъект.Организация, Сервер, ТекстСообщения);
			Справочники.Оповещения.СформироватьОповещения("Обработка._ЭкспортВЕГАР.СформироватьИВыгрузитьДанныеБумагУдерживаемыхДоПогашения",
				Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДляСтатистики.Вставить("ОбновлениеСпискаБумагУдерживаемыхДоПогашения", "Время выполнения: " + РассчитатьВремя(СтартЗапуска) + ".");
КонецПроцедуры

// Проверка соединения и установка соединения, если ещё не было подключения
Процедура ПроверитьСоединение(Сервер = Неопределено) Экспорт
	// Начало сессии
	СвойстваОбъекта = "ДатаВыгрузки, Организация, ЭкспортСделок, ЭкспортОстатков, ЭкспортСправочника, ОбновлениеПараметров, ЭкспортБумагУдерживаемыхДоПогашения";
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СвойстваОбъекта);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "(" + Сервер + ").ПроверитьСоединение";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(Сервер, Истина); // (Флаг Открыть соединение, Сервер - номер сервера, флаг только соединение SQL)
	
	Если ПараметрыПодключения = Неопределено Тогда
		// Отправка оповещения об отсутствии соединения
		ЗарегистрироватьУведомление("Проверка доступности сервиса EGAR (" + Сервер + "): Соединение не установлено. Возможно, сервис выключен.");
		ОбработатьУведомления(Сервер, "ПроверкаСоединения");
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Не удалось установить соединение с EGAR.");
	Иначе
		// Если проверка прошла успешно, максимум можно вывести пользователю это на экран, но при автоматическом запуске ничего не должно больше происходить
		Сообщить("Соединение с ЕГАР (" + Сервер + ") установлено успешно.");
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Соединение с EGAR успешно установлено.");
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьДанные(Сервер = Неопределено, ПараметрыПодключения = Неопределено, МассивСделок = Неопределено) Экспорт
	Если ПараметрыПодключения = Неопределено Тогда
		// Начало сессии
		СвойстваОбъекта = "ДатаВыгрузки, Организация, ЭкспортСделок, ЭкспортОстатков, ЭкспортСправочника, ОбновлениеПараметров, ЭкспортБумагУдерживаемыхДоПогашения";
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СвойстваОбъекта);
		Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "(" + Сервер + ").УдалитьДанные.";
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
		
		ПараметрыПодключения = ПолучитьПараметрыПодключения(Сервер, Истина); // (Флаг Открыть соединение, Сервер - номер сервера, флаг только соединение SQL)
		
		Если ПараметрыПодключения = Неопределено Тогда
			ОбработатьУведомления(Сервер);
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Не удалось установить соединение с ЕГАР для удаления данных.");
			Возврат;
		КонецЕсли;
	Конецесли;
	
	Если МассивСделок = Неопределено Тогда
		// При удалении сделок через API, обязательства по сделкам не удаляются. Удаляем их из таблицы SQL.
		ЗапросSQL = "DELETE FROM [LZ_ASSET_FLOWS]";
		РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
		
		ЗапросSQL = "DELETE FROM [LZ_TRADES]";
		РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
		
		// Конец сессии
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
		РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(ПараметрыПодключения.СоединениеSQL);
		
		ОбработатьУведомления(Сервер);
	ИначеЕсли МассивСделок.Количество() > 0 Тогда
		СделкиНаУдаление = Новый Массив;
		
		Для Каждого Элемент Из МассивСделок Цикл
			СделкиНаУдаление.Добавить(Новый Структура("id, status", Элемент, "C"));
		КонецЦикла;
		
		ТелоЗапросаJSON = ПолучитьСтрокуJSON(СделкиНаУдаление);
		
		Если ТелоЗапросаJSON <> Неопределено Тогда
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Trades, ТелоЗапросаJSON);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура Загрузить(Сервер) Экспорт
	// Начало сессии
	ДанныеДляСтатистики = Новый Структура();
	СвойстваОбъекта = "ДатаВыгрузки, Организация, ЭкспортСделок, ЭкспортОстатков, ЭкспортСправочника, ОбновлениеПараметров, ЭкспортБумагУдерживаемыхДоПогашения";
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СвойстваОбъекта);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "(" + Сервер + ")";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(Сервер);
	
	Если ПараметрыПодключения = Неопределено Тогда
		ОбработатьУведомления(Сервер);
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
			Механизм, Сессия,,, "Не удалось установить соединение с ЕГАР для выгрузки данных.");
		Возврат;
	КонецЕсли;
		
	Если ЭкспортОстатков Или ЭкспортСделок Тогда
		ТаблицаВыгруженныхСделок = ПолучитьТаблицуВыгруженныхСделок(ПараметрыПодключения, ДанныеДляСтатистики);
		
		Если ТаблицаВыгруженныхСделок = Неопределено Тогда
			ОбработатьУведомления(Сервер);
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
				Механизм, Сессия,,, "Не удалось получить данные из ЕГАР о ранее выгруженных сделках.");
			Возврат;
		КонецЕсли;
		
		МВТ = ПолучитьМенеджерВременныхТаблиц(ТаблицаВыгруженныхСделок, ДанныеДляСтатистики);
	КонецЕсли;
	
	Если ЭкспортСправочника Тогда
		СформироватьИВыгрузитьДанныеПоСчетамДУ(ПараметрыПодключения, ДанныеДляСтатистики);
	КонецЕсли;
	
	Если ЭкспортОстатков Тогда
		СформироватьИВыгрузитьОстатки(Сервер, ПараметрыПодключения, МВТ, ДанныеДляСтатистики);
	КонецЕсли;
	
	Если ЭкспортСделок Тогда
		СформироватьИВыгрузитьДанныеПоСделкам(ПараметрыПодключения, МВТ, ДанныеДляСтатистики);
	КонецЕсли;
	
	Если ОбновлениеПараметров Тогда
		ОбновитьПараметрыКлиентов(ПараметрыПодключения, ДанныеДляСтатистики);
	КонецЕсли;
	
	Если ЭкспортБумагУдерживаемыхДоПогашения Тогда
		СформироватьИВыгрузитьДанныеБумагУдерживаемыхДоПогашения(ПараметрыПодключения, ДанныеДляСтатистики, Сервер);
	КонецЕсли;
	
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(ПараметрыПодключения.СоединениеSQL);
	
	ОбработатьУведомления(Сервер);
	
	// Конец сессии
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДанныеДляСтатистики);
КонецПроцедуры

Процедура ОбновитьЛимиты(Сервер) Экспорт
	#Область Получение_данных_из_МАТРИХ
	//Сервер = "АП91";
	СтрокаСоединения = РаботаСВнешнимиСистемами.СтрокаСоединенияСМатрих();
	СоединениеСМатрих = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(СтрокаСоединения);
	
	Если СоединениеСМатрих = Неопределено Тогда
		ОбработатьУведомления(Сервер);
		Возврат;
	КонецЕсли;

	// 3 - ДУ, 11 - Нефтегарант, 44 - НПФы, 45 - НПФы+Согласие+РВИ+ДУ, 53 - Будущее, 6 - НПФы+Согласие+НГ+РВИ+ДУ
	ЗапросSQL =
		"SELECT
		|CAST(_limits.Limit_Group_ID AS VARCHAR) + '-' + CAST(_limits.Limit_Object_ID AS VARCHAR) + '-' + CAST(_limits.Currency_ID AS VARCHAR) id,
		|_groups.Name + '-' + _objects.Name + '-#' + CASE WHEN _limits.Status = 2321 THEN CAST(_limits.ID AS VARCHAR) ELSE CAST(_limits.ID AS VARCHAR) + '-ТЕХНИЧЕСКИЙ' END name,
		|CASE WHEN _limits.Status = 2321 THEN 0 ELSE 1 END valueVerification,
		|CAST(_limits.Date_Start AS Datetime) startDate,
		|_limits.Volume * 1000000 ownValue,
		|_limits.Currency_ID valueCurrencyCode,
		|@CURRENCY_LIMITS,
		|'K' + CAST(_limits.Limit_Object_ID AS VARCHAR) objectId,
		|_firms.Firm_ID matriхId,
		|_groups.ID categoryId
		|FROM [MatriX].[Risks].[Limits] _limits
		|	LEFT JOIN [MatriX].[Risks].[Limits_Groups] _groups ON _limits.Limit_Group_ID = _groups.ID
		|	LEFT JOIN [MatriX].[Risks].[Limits_Objects] _objects ON _limits.Limit_Object_ID = _objects.ID
		|	LEFT JOIN [MatriX].[Risks].Limits_Objects_Firms _firms ON _limits.[Limit_Object_ID] = _firms.[Limit_Object_ID]
		//|--WHERE (_groups.ID = 53 AND _limits.Status IN (2321, 2323)) OR (_groups.ID IN (3, 11, 44, 45, 6, 48) AND _limits.Status = 2321)";
		|WHERE _groups.ID IN (3, 11, 44, 45, 6, 48, 53) AND _limits.Status IN (2321, 2323)";
	Если Сервер = "АП91" Тогда
		ЗапросSQL = СтрЗаменить(ЗапросSQL, "@CURRENCY_LIMITS", "CASE WHEN _limits.Currency_ID = 32 THEN 12839 WHEN _limits.Currency_ID = 10 THEN 12840 END currencyLimitId"); //WHEN _limits.Currency_ID = 25 THEN 12841 
	ИначеЕсли Сервер = "АП55" Тогда
		ЗапросSQL = СтрЗаменить(ЗапросSQL, "@CURRENCY_LIMITS", "CASE WHEN _limits.Currency_ID = 32 THEN 10597 WHEN _limits.Currency_ID = 10 THEN 10598 END currencyLimitId"); //WHEN _limits.Currency_ID = 25 THEN 10599 
	КонецЕсли;
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(СоединениеСМатрих, ЗапросSQL);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	Иначе
		ТипыКолонок = Новый Структура;
		ТипыКолонок.Вставить("id", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
		ТипыКолонок.Вставить("name", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
		ТипыКолонок.Вставить("startDate", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		ТипыКолонок.Вставить("ownValue", Новый ОписаниеТипов("Число"));
		ТипыКолонок.Вставить("valueCurrencyCode", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(5)));
		ТипыКолонок.Вставить("currencyLimitId", Новый ОписаниеТипов("Число"));
		ТипыКолонок.Вставить("objectId", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТипыКолонок.Вставить("matriхId", Новый ОписаниеТипов("Число"));
		ТипыКолонок.Вставить("categoryId", Новый ОписаниеТипов("Число"));
		ТипыКолонок.Вставить("valueVerification", Новый ОписаниеТипов("Число"));
		
		ТаблицаЛимитов = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей, ТипыКолонок);
	КонецЕсли;
	
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(СоединениеСМатрих);
	#КонецОбласти
	
	#Область Получение_данных_из_ЕГАР
	ТаблицаМатрихКодовЭмитентов = ТаблицаЛимитов.Скопировать( ,"matriхId");
	ТаблицаМатрихКодовЭмитентов.Свернуть("matriхId");
	
	//Собираем массив матрих кодов эмитентов для запароса в ЕГАР для получения кодов ЕГАР
	СтрокаМатрихКодов = "";
	Для Каждого Строка Из ТаблицаМатрихКодовЭмитентов Цикл
		Если ПустаяСтрока(Строка.matriхID) Тогда
			Продолжить;
		Иначе
			СтрокаМатрихКодов = СтрокаМатрихКодов + ?(ПустаяСтрока(СтрокаМатрихКодов), "", ", ") + "'" + ЧислоJSON(Строка.matriхID) + "'";
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодключения = ПолучитьПараметрыПодключения(Сервер); 
	
	Если ПараметрыПодключения = Неопределено Тогда
		ОбработатьУведомления(Сервер);
		Возврат;
	КонецЕсли;
	
	//Получаем таблицу кодов(матрих - егар) эмитентов из ЕГАР
	ЗапросSQL =
		"SELECT ID egarId,
		|EXTERNAL_ID matrixId
		|FROM [LZ_COUNTERPARTIES] WHERE EXTERNAL_ID IN (" + СтрокаМатрихКодов + ")";
	
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	Иначе
		ТипыКолонок = Новый Структура;
		ТипыКолонок.Вставить("egarId", Новый ОписаниеТипов("Число"));
		ТипыКолонок.Вставить("matrixId", Новый ОписаниеТипов("Число"));
		ТаблицаМатрихЕгарКодовЭмитентов = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей, ТипыКолонок);
	КонецЕсли;
		
	ЗапросSQL =
		"SELECT EXTERNAL_ID externalId,
		|CASE WHEN NAME LIKE '%ТЕХНИЧЕСКИЙ%'
		|		THEN CASE WHEN CURRENT_VALUE < OWN_VALUE THEN CURRENT_VALUE ELSE 0 END
		|		ELSE OWN_VALUE END newOwnValue,
		|		COMMENT AS comment
		//|ISNULL(CAST(CASE WHEN COMMENT LIKE '%[а-яА-Я]%'
		//|					THEN 0
		//|					ELSE COMMENT END AS BIGINT), 0) AS oldOwnValue
		|FROM [LZ_LIMITS] WHERE NOT EXTERNAL_ID IS NULL AND IS_DELETED = 0";
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(ПараметрыПодключения.СоединениеSQL, ЗапросSQL);
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	Иначе
		ТаблицаЛимитовЕгар = Новый ТаблицаЗначений;
		ТаблицаЛимитовЕгар.Колонки.Добавить("externalId", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)), "externalId");
		ТаблицаЛимитовЕгар.Колонки.Добавить("newOwnValue", Новый ОписаниеТипов("Число"), "newOwnValue");
		ТаблицаЛимитовЕгар.Колонки.Добавить("oldOwnValue", Новый ОписаниеТипов("Число"), "oldOwnValue");
		ТаблицаЛимитовЕгар.Колонки.Добавить("comment", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)), "comment");
		
		ВнешниеДанные = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей);
		
		Если ВнешниеДанные <> Неопределено Тогда
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ВнешниеДанные, ТаблицаЛимитовЕгар);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаЗаписи Из ТаблицаЛимитовЕгар Цикл
		Если ЗначениеЗаполнено(СтрокаЗаписи.comment) Тогда
			Попытка
				СтрокаЗаписи.oldOwnValue = Число(СтрокаЗаписи.comment);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	#КонецОбласти
	
	//Для каждого лимита собираем Егар_коды эмитентов для дальнейшего формирования фильтров
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЛимитов.objectId КАК КодОбъектаЛимитирования,
		|	_ТаблицаЛимитов.matriхId КАК КодМатрихПодчиненногоОбъекта
		|ПОМЕСТИТЬ _ТаблицаОбъектовЛимитирования
		|ИЗ
		|	&ТаблицаЛимитов КАК _ТаблицаЛимитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаКодов.egarId КАК КодЕгар,
		|	_ТаблицаКодов.matrixId КАК КодМатрих
		|ПОМЕСТИТЬ _ТаблицаКодов
		|ИЗ
		|	&ТаблицаМатрихЕгарКодов КАК _ТаблицаКодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаОбъектовЛимитирования.КодОбъектаЛимитирования КАК КодОбъекта,
		|	_ТаблицаКодов.КодЕгар КАК КодЕгар
		|ИЗ
		|	_ТаблицаОбъектовЛимитирования КАК _ТаблицаОбъектовЛимитирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаКодов
		|	ПО _ТаблицаОбъектовЛимитирования.КодМатрихПодчиненногоОбъекта = _ТаблицаКодов.КодМатрих
		|	И НЕ _ТаблицаКодов.КодЕгар ЕСТЬ NULL";
	#КонецОбласти
	Запрос.УстановитьПараметр("ТаблицаЛимитов", ТаблицаЛимитов);
	Запрос.УстановитьПараметр("ТаблицаМатрихЕгарКодов", ТаблицаМатрихЕгарКодовЭмитентов);
	
	ОбъектыЛимитирования = Новый Структура;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ОбъектыЛимитирования.Свойство(Выборка.КодОбъекта) И Не ПустаяСтрока(Выборка.КодЕгар) Тогда
			ОбъектыЛимитирования.Вставить(Выборка.КодОбъекта, Новый Массив());
		КонецЕсли;
		
		Если Не ПустаяСтрока(Выборка.КодЕгар) Тогда
			ОбъектыЛимитирования[Выборка.КодОбъекта].Добавить(Строка(ЧислоJSON(Выборка.КодЕгар)));
		КонецЕсли;
	КонецЦикла;
	
	МассивЛимитов = Новый Массив;
	ТаблицаЛимитов = ТаблицаЛимитов.Скопировать( ,"id, name, startDate, ownValue, valueCurrencyCode, currencyLimitId, objectId, categoryId, valueVerification");
	ТаблицаЛимитов.Свернуть("id, name, startDate, ownValue, valueCurrencyCode, currencyLimitId, objectId, categoryId, valueVerification");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ _ТаблицаЛимитов
		|ИЗ
		|	&ТаблицаЛимитов КАК ТаблицаЛимитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ _ТаблицаЛимитовЕгар
		|ИЗ
		|	&ТаблицаЛимитовЕгар КАК ТаблицаЛимитовЕгар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ТаблицаЛимитов.id, _ТаблицаЛимитовЕгар.externalId) КАК id,
		|	_ТаблицаЛимитов.name КАК name,
		|	_ТаблицаЛимитов.startDate КАК startDate,
		|	ВЫБОР
		|		КОГДА _ТаблицаЛимитов.valueVerification = 1
		|			И _ТаблицаЛимитовЕгар.newOwnValue > 0 
		|			И _ТаблицаЛимитов.ownValue = _ТаблицаЛимитовЕгар.oldOwnValue
		|		ТОГДА _ТаблицаЛимитовЕгар.newOwnValue
		|		ИНАЧЕ _ТаблицаЛимитов.ownValue
		|	КОНЕЦ КАК ownValue,
		|	_ТаблицаЛимитов.valueCurrencyCode КАК valueCurrencyCode,
		|	_ТаблицаЛимитов.objectId КАК objectId,
		|	_ТаблицаЛимитов.categoryId КАК categoryId,
		//
		|	_ТаблицаЛимитов.currencyLimitId КАК currencyLimitId,
		//|	_ТаблицаЛимитов.valueVerification КАК valueVerification,
		//|	_ТаблицаЛимитовЕгар.oldOwnValue КАК newOwnValue,
		//|	_ТаблицаЛимитов.ownValue КАК  ownValue_Test,
		//
		|	ВЫБОР
		|		КОГДА _ТаблицаЛимитов.id ЕСТЬ NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФлагУдаления,
		|	ВЫБОР
		|		КОГДА _ТаблицаЛимитовЕгар.externalId ЕСТЬ NULL
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|			КОГДА _ТаблицаЛимитов.valueVerification = 1 И (_ТаблицаЛимитовЕгар.newOwnValue > 0 ИЛИ _ТаблицаЛимитов.ownValue <> _ТаблицаЛимитовЕгар.oldOwnValue)
		|				ИЛИ _ТаблицаЛимитов.valueVerification = 0 И _ТаблицаЛимитов.ownValue <> _ТаблицаЛимитовЕгар.newOwnValue
		|			ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	КОНЕЦ КАК ФлагВыгрузки,
		|	ВЫБОР КОГДА _ТаблицаЛимитов.valueVerification = 1
		|			И _ТаблицаЛимитов.ownValue <> _ТаблицаЛимитовЕгар.oldOwnValue
		|		ТОГДА _ТаблицаЛимитов.ownValue
		|		ИНАЧЕ _ТаблицаЛимитовЕгар.oldOwnValue
		|	КОНЕЦ КАК comment
		|ИЗ
		|	_ТаблицаЛимитовЕгар КАК _ТаблицаЛимитовЕгар
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ТаблицаЛимитов КАК _ТаблицаЛимитов
		|		ПО _ТаблицаЛимитовЕгар.externalId = _ТаблицаЛимитов.id";
	#КонецОбласти
	Запрос.УстановитьПараметр("ТаблицаЛимитов", ТаблицаЛимитов);
	Запрос.УстановитьПараметр("ТаблицаЛимитовЕгар", ТаблицаЛимитовЕгар);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЛимитовДляЗагрузки = Новый Массив;
	МассивЛимитовДляУдаления = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ФлагУдаления Тогда
			МассивЛимитовДляУдаления.Добавить(Выборка.id);
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ФлагВыгрузки Тогда
			
			Лимит = Новый Структура();
			
			Если ОбъектыЛимитирования.Свойство(Выборка.objectId) Тогда
				СтрокаКодов = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ОбъектыЛимитирования[Выборка.objectId]);
				СтрокаФильтра = "<expr exprType='func'><field id='DepositaryId' type='list(INT)'/><operator name='IN'/><value val='"
					+ СтрокаКодов + "'/></expr><expr exprType='bool' name='OR'/><expr exprType='func'><field id='InstrumentIssuerId' type='list(INT)'/>"
					+ "<operator name='IN'/><value val='" + СтрокаКодов + "'/></expr>";
			Иначе
				СтрокаФильтра = ""
			КонецЕсли;
			
			Лимит.Вставить("id", Выборка.id);
			Лимит.Вставить("categoryId", Строка(ЧислоJSON(Выборка.categoryId)));
			Лимит.Вставить("type", "CL");
			Лимит.Вставить("name", Выборка.name);
			Лимит.Вставить("kind", "R");
			Лимит.Вставить("ownValue", ЧислоJSON(Выборка.ownValue));
			Лимит.Вставить("valueCurrencyCode", Выборка.valueCurrencyCode);
			Лимит.Вставить("valueRestrictionType", "LE");
			Лимит.Вставить("startDate", ДатаJSON(Выборка.startDate));
			Лимит.Вставить("required", 1);
			Лимит.Вставить("recalculateOnTrade", 1);
			Лимит.Вставить("recalculateOnBod", 1);
			Лимит.Вставить("useParentRecalculationTimer", 1);
			
			Если Не ПустаяСтрока(Выборка.comment) Тогда
				Лимит.Вставить("comment", Строка(ЧислоJSON(Выборка.comment)));
			КонецЕсли;
			
			МассивФильтров = Новый Массив;
			
			Если Выборка.currencyLimitId <> 0 Тогда
				ФильтрПоВалюте = Новый Структура("id", Формат(Выборка.currencyLimitId, "ЧРД=.; ЧГ=0"));
				МассивФильтров.Добавить(ФильтрПоВалюте);
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаФильтра) Тогда
				ФильтрПоЭмитентам = Новый Структура("expression", СтрокаФильтра);
				МассивФильтров.Добавить(ФильтрПоЭмитентам);
			КонецЕсли;
			
			Если МассивФильтров.Количество() > 0 Тогда
				Лимит.Вставить("filters", МассивФильтров);
			КонецЕсли;
			
			МассивЛимитовДляЗагрузки.Добавить(Лимит);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЛимитовДляЗагрузки.Количество() > 0 Тогда
		ТелоЗапросаJSON = ПолучитьСтрокуJSON(МассивЛимитовДляЗагрузки);
		
		Если ТелоЗапросаJSON <> Неопределено Тогда
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("PUT", ПараметрыПодключения, ПараметрыПодключения.Limits, ТелоЗапросаJSON);
		КонецЕсли;
	КонецЕсли;
	
	Если МассивЛимитовДляУдаления.Количество() > 0 Тогда
		ТелоЗапросаJSON = ПолучитьСтрокуJSON(МассивЛимитовДляУдаления);
		
		Если ТелоЗапросаJSON <> Неопределено Тогда
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("DELETE", ПараметрыПодключения, ПараметрыПодключения.Limits, ТелоЗапросаJSON);
		КонецЕсли;
	КонецЕсли;
	
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(ПараметрыПодключения.СоединениеSQL);
КонецПроцедуры

Функция РассчитатьВремя(СтартЗапуска)
	ВремяСек = ТекущаяДатаСеанса() - СтартЗапуска;
	ВремяМин = Цел((ВремяСек) / 60);
	
	Возврат Строка(ВремяСек) + " сек."  + ?(ВремяМин > 0, " (" + Строка(ВремяМин) + " м. " + Строка(ВремяСек - ВремяМин * 60) + " с.)", "");
КонецФункции

//В 1С8 нет Матрих кодов ПИФондов, есть коды ПАЕВ. Для ЕГАРа нужен код ПИФа.
КодыПифов = Новый Соответствие;
КодыПифов.Вставить("586487", "233198"); //ЗПИФ Ритм
КодыПифов.Вставить("66403", "229848"); //ИПИФ Дако
КодыПифов.Вставить("592325", "237449"); //ОПИФ Горизонт
КодыПифов.Вставить("585801", "232955"); //ОПИФ Атлант
КодыПифов.Вставить("585799", "232956"); //ОПИФ Глобус
КодыПифов.Вставить("585800", "232957"); //ОПИФ Сфера
КодыПифов.Вставить("595372", "248343"); // Консенсус
КодыПифов.Вставить("595373", "248342"); //ЗПИФ Оптимум
КодыПифов.Вставить("596341", "248806"); //ОПИФ Регион Российские облигации инвестиционного уровня
КодыПифов.Вставить("596340", "248807"); //ОПИФ рыночных финансовых инструментов "Регион Российские облигации ААА"
КодыПифов.Вставить("625641", "200000"); //ОПИФ рыночных финансовых инструментов "РЕГИОН Доходные облигации". Код ЕГАРа.
КодыПифов.Вставить("625640", "257474"); //ИнтеллектФонд.

ЭтотОбъект.ДопСвойства = Новый Структура;
