
&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.Эмитенты = Эмитенты;
	
	ОбработкаОбъект.ЗаполнитьОтчет(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Сформировать");
	ВыполнитьФормирование(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФормирование(ПараметрыСессии)
	
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	Иначе
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не заполнены обязательные реквизиты");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	БлижайшийТорговыйДень	= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"), НачалоДня(ТекущаяДатаСеанса() - 86400));
	
	Объект.Период		= БлижайшийТорговыйДень;
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_МКБ"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Сафмар"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_ОВКФинанс"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_МВидео"));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
