
&НаСервере
Процедура СформироватьПроверкуНаСервере()
	
	Если РольДоступна("ПолныеПрава") Тогда
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания, ЭтаФорма.Результат, ЭтаФорма.ОрганизацияВыбор);
	Иначе
		РеквизитФормыВЗначение("Объект").СформироватьОтчет(Период.ДатаНачала, Период.ДатаОкончания,  ЭтаФорма.Результат, ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПроверку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СформироватьПроверку");
	Попытка
		ВыполнитьСформироватьПроверку();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСформироватьПроверку()
	
		СформироватьПроверкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ОрганизацияВыбор = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), НачалоДня(НачалоДня(ТекущаяДата()) - 1));
	ЭтаФорма.Период.ДатаНачала = Дата;
	ЭтаФорма.Период.ДатаОкончания = Дата;
	
	ЭтаФорма.Элементы.Организация.Видимость = НЕ РольДоступна("ПолныеПрава");
	ЭтаФорма.Элементы.ОрганизацияВыбор.Видимость = РольДоступна("ПолныеПрава");
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПисьмаНаСервере()
	РеквизитФормыВЗначение("Объект").ПроверитьШкалыРейтинга(Новый Структура("ДатаНачала, ДатаОкончания", Период.ДатаНачала, Период.ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура Письма(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Письма");
	Попытка
		ВыполнитьПисьма();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПисьма()
	
		ПисьмаНаСервере();
	
КонецПроцедуры
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
