
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Параметры.ДанныеДляВыбора Цикл
		ЗаполнитьЗначенияСвойств(Список.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ИзменитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Обработать", Истина);
	
	ВыбранныеСтроки = Список.НайтиСтроки(Отбор);
	
	ИдентификаторыСтрок = Новый Массив;
	
	Для Каждого ТекСтрока Из ВыбранныеСтроки Цикл
		ИдентификаторыСтрок.Добавить(ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	Если ИдентификаторыСтрок.Количество() > 0 Тогда
		ЭтаФорма.Закрыть(ИдентификаторыСтрок);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ИзменитьФлажки(НовоеЗначение)
	
	Для Каждого ТекСтрока Из Список Цикл
		ТекСтрока.Обработать = НовоеЗначение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти