
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "ЮрФизЛицо");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Ссылка.ЮрФизЛицо <> ЮрФизЛицо
		ИЛИ Ссылка.ВалютаУчета <> ВалютаУчета
		ИЛИ Ссылка.ДатаНачалаУчета <> Ссылка.ДатаНачалаУчета Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		РаботаСНормативноСправочнойИнформацией.ПроверкаНаНаличиеФункциональнойРоли(ЭтотОбъект, Отказ);
		
		// проверим, чтобы при изменении даты начала учета отсутствовали проведенные документы
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата",        ЭтотОбъект.ДатаНачалаУчета);
		Запрос.УстановитьПараметр("Период",      ЭтотОбъект.ДатаНачалаУчета - 86400);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Ссылка);
		
		Для каждого ДокументМД Из Метаданные.Документы Цикл
			Если ДокументМД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
				Если ПустаяСтрока(Запрос.Текст) Тогда
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ """ + ДокументМД.ПолноеИмя() + """ КАК ИмяОбъектаМД, ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Документ ИЗ Документ." + ДокументМД.Имя + " ГДЕ Проведен И Организация = &Организация И Дата < &Дата";
				Иначе
					Запрос.Текст = Запрос.Текст + Символы.ПС
						+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + ДокументМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Ссылка) ИЗ Документ." + ДокументМД.Имя + " ГДЕ Проведен И Организация = &Организация И Дата < &Дата";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//// движения запрещены, начиная с предыдущего дня, т.к. нам нужен ввод начальных остатков
		//Для каждого РегистрМД Из Метаданные.РегистрыНакопления Цикл
		//	Запрос.Текст = Запрос.Текст + Символы.ПС
		//		+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрНакопления." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//КонецЦикла;
		//
		//Для каждого РегистрМД Из Метаданные.РегистрыБухгалтерии Цикл
		//	Запрос.Текст = Запрос.Текст + Символы.ПС
		//		+ "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрБухгалтерии." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//КонецЦикла;
		
		//Для каждого РегистрМД Из Метаданные.РегистрыСведений Цикл
		//	Если РегистрМД.Измерения.Найти("Организация") <> Неопределено
		//		И РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
		//		И РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора // считаем, что по ним контроль будет осуществляться при проведении регистратора
		//	Тогда
		//		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗРЕШЕННЫЕ """ + РегистрМД.ПолноеИмя() + """, ПРЕДСТАВЛЕНИЕ(Регистратор) ИЗ РегистрСведений." + РегистрМД.Имя + " ГДЕ Организация = &Организация И Период < &Период";
		//	КонецЕсли;
		//КонецЦикла;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МаксКоличествоСообщений = 20; // чтобы процесс вывода сообщений не завесил систему, ибо он может :((
		КоличествоСообщений = 0;
		
		Пока Выборка.Следующий() Цикл
			Если КоличествоСообщений > МаксКоличествоСообщений Тогда
				Прервать;
			КонецЕсли;
			
			Если      Найти(Выборка.ИмяОбъектаМД, "Документ.") = 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ранее даты начала учета присутствует проведенный документ '" + Выборка.Документ + "'",,,, Отказ);
			ИначеЕсли Найти(Выборка.ИмяОбъектаМД, "РегистрНакопления.") = 1 Или Найти(Выборка.ИмяОбъектаМД, "РегистрБухгалтерии.") = 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ранее даты, предшествующей дате начала учета, присутствуют движения по регистру '" + Выборка.ИмяОбъектаМД + "', зарегистрованные документом '" + Выборка.Документ + "'",,,, Отказ);
			КонецЕсли;
			
			КоличествоСообщений = КоличествоСообщений + 1;
		КонецЦикла;
		
		Если КоличествоСообщений > МаксКоличествоСообщений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("…",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИзмененКонтрольДоступаКСчетамДоверительногоУправления", НЕ ЭтоНовый() И КонтрольДоступаКСчетамДоверительногоУправления <> Ссылка.КонтрольДоступаКСчетамДоверительногоУправления);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.ВидыДеятельностиОрганизации.ПриЗаписиОбъекта(ЭтотОбъект);
	
	Если ДополнительныеСвойства.Свойство("ИзмененКонтрольДоступаКСчетамДоверительногоУправления")
		И ДополнительныеСвойства.ИзмененКонтрольДоступаКСчетамДоверительногоУправления Тогда
		
		// Включили контроль.
		Если КонтрольДоступаКСчетамДоверительногоУправления Тогда
			
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.ОбновитьДанныеОДоступностиСчетовДоверительногоУправленияПоОрганизации(Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать организацию из-за ошибки при установке по ней доступности счетов доверительного управления!", Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		// Отключили контроль.
		Иначе
			
			Если НЕ РегистрыСведений.ДоступныеСчетаДоверительногоУправления.УдалитьДанныеОДоступностиСчетовДоверительногоУправления(Ссылка) Тогда
				ТекстСообщения = СтрШаблон("Не удалось записать организацию из-за ошибки при отклбчении по ней доступности счетов доверительного управления!", Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи
