
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ВладелецФайла, ДатаСоздания, ИдентификаторФайла, Наименование, Описание, Расширение");
	УстановитьДоступность();
	ЗаполнитьВерсииФайла();
КонецПроцедуры
	
#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ВерсииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Версии.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьВерсиюФайла(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ЗаписатьВыполнитьКлиент(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъект(Команда)
	
	Отказ = Ложь;
	ЗаписатьВыполнитьКлиент(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСписокВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотреть(Команда)
	
	ТекущиеДанные = Элементы.Версии.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьВерсиюФайла(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьАктивной(Команда)
	
	ТекущиеДанные = Элементы.Версии.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		РаботаСФайловымХранилищем.СделатьВерсиюАктивной(ИдентификаторФайла, ТекущиеДанные.Идентификатор);
		ЗаписатьВЖурналРегистрации("Файловое хранилище.Установка активной версии", "Установлена активная версия: """ + ТекущиеДанные.Наименование + """");
		ОбновитьСписокВерсий();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	ТекущиеДанные = Элементы.Версии.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбора.ПолноеИмяФайла = ТекущиеДанные.Наименование + "." + ТекущиеДанные.Расширение;
		ДиалогВыбора.Фильтр = СтрШаблон("Все файлы (*.%1)|*.%1", ТекущиеДанные.Расширение);
		Если ДиалогВыбора.Выбрать() Тогда
			ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(ТекущиеДанные.Идентификатор);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
			ДвоичныеДанные.Записать(ДиалогВыбора.ПолноеИмяФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура ЗаписатьВыполнитьКлиент(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Наименование) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Наименование",, "Наименование",, Отказ); 
		Возврат;
	КонецЕсли;
	
	ЗаписатьВыполнить();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыполнить()
	
	Прокси = РаботаСФайловымХранилищем.ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	ОбъектXDTO = РаботаСФайловымХранилищем.СоздатьОбъект(Прокси, "DMFile");
	ОбъектXDTO.objectID = РаботаСФайловымХранилищем.СоздатьObjectID(Прокси, ЭтаФорма.ИдентификаторФайла, "DMFile");
	
	// Только 2 поля, Имя и Описание передаем при записи.
	ОбъектXDTO.name = ЭтаФорма.Наименование;
	ОбъектXDTO.description = ЭтаФорма.Описание;
	
	РаботаСФайловымХранилищем.ЗаписатьОбъект(Прокси, ОбъектXDTO);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВерсииФайла()
	
	ЭтаФорма.Версии.Очистить();
	Если Не ЗначениеЗаполнено(ИдентификаторФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВерсий = РаботаСФайловымХранилищем.ПолучитьСписокВерсийФайла(ЭтаФорма.ИдентификаторФайла);
	Для каждого Версия Из ПараметрыВерсий Цикл
		НоваяСтрока = ЭтаФорма.Версии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Версия);
		НоваяСтрока.ПредставлениеРазмера = РаботаСФайловымХранилищем.КраткоеПредставлениеРазмера(НоваяСтрока.Размер);
	КонецЦикла; 
	ЭтаФорма.Версии.Сортировать("ВремяСоздания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВерсий()
	
	Если Элементы.Версии.ТекущиеДанные = Неопределено Тогда
		ТекущаяСтрока = Неопределено;
	Иначе
		ТекущаяСтрока = Элементы.Версии.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ЗаполнитьВерсииФайла();
	
	Элементы.Версии.ТекущаяСтрока = ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВерсиюФайла(ТекущиеДанные)

	ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьВерсиюФайла(ТекущиеДанные.Идентификатор);
	Если ДанныеФайла <> Неопределено Тогда
	
		Путь = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + ДанныеФайла.Имя + "." + ДанныеФайла.Расширение;
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);	
		ДвоичныеДанные.Записать(Путь);
		
		УдалитьИзВременногоХранилища(ДанныеФайла.Адрес);
		
		ЗапуститьПриложение(Путь);
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьВЖурналРегистрации(ИмяСобытия, Комментарий)

	ЗаписьЖурналаРегистрации(ИмяСобытия, 
		УровеньЖурналаРегистрации.Информация, 
		ВладелецФайла.Метаданные(), 
		ВладелецФайла, 
		Комментарий);

КонецПроцедуры
 
&НаСервере
Процедура УстановитьДоступность()

	ДоступНаИзменение = ЗначениеЗаполнено(ВладелецФайла) И ПравоДоступа("Изменение", ВладелецФайла.Метаданные()); 
	
	Элементы.ФормаЗаписатьИЗакрыть.Доступность 	= ДоступНаИзменение;
	Элементы.ФормаЗаписать.Доступность 			= ДоступНаИзменение;
	Элементы.ВерсииСделатьАктивной.Доступность 	= ДоступНаИзменение;
	Элементы.ИмяФайла.ТолькоПросмотр 			= Не ДоступНаИзменение;
	Элементы.Описание.ТолькоПросмотр 			= Не ДоступНаИзменение;
	
КонецПроцедуры

#КонецОбласти 

