Процедура ПриЗаписи(Отказ)
	
	ПересеченияПоВидамОпераций = Неопределено;
	Если Не ПроверитьПересеченияПоВидамОпераций(ПересеченияПоВидамОпераций) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено пересечение по видам операций: " + ПересеченияПоВидамОпераций, , , , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

// В случаем обнаружения заполняет Пересечения строкой формата "ГруппаВидовОпераций (ВидОперации1, ВидОперации2, ...)"
Функция ПроверитьПересеченияПоВидамОпераций(Пересечения = Неопределено)
	Если ЭтотОбъект.ПометкаУдаления Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыВидовОперацийВидыОпераций.Ссылка КАК ГруппаВидовОпераций,
		|	ГруппыВидовОперацийВидыОпераций.ВидОперации КАК ВидОперации,
		|	ГруппыВидовОперацийВидыОпераций.ЦельРасчета КАК ЦельРасчета
		|ИЗ
		|	Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ГруппыВидовОперацийВидыОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|		ПО (ГруппыВидовОпераций.Ссылка = ГруппыВидовОперацийВидыОпераций.Ссылка)
		|			И (ГруппыВидовОпераций.ПометкаУдаления = ЛОЖЬ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГруппыВидовОперацийВидыОпераций.ВидОперации КАК ВидОперации,
		|			ГруппыВидовОперацийВидыОпераций.ЦельРасчета КАК ЦельРасчета
		|		ИЗ
		|			Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ГруппыВидовОперацийВидыОпераций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций КАК ГруппыВидовОпераций
		|				ПО (ГруппыВидовОпераций.Ссылка = ГруппыВидовОперацийВидыОпераций.Ссылка)
		|					И (ГруппыВидовОпераций.ПометкаУдаления = ЛОЖЬ)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыВидовОпераций.ВидыОпераций КАК ВидыОперацийТекущейГруппы
		|				ПО (ВидыОперацийТекущейГруппы.Ссылка = &ТекущаяГруппаВидовОпераций)
		|					И (ВидыОперацийТекущейГруппы.ВидОперации = ГруппыВидовОперацийВидыОпераций.ВидОперации)
		|					И (ВидыОперацийТекущейГруппы.ЦельРасчета = ГруппыВидовОперацийВидыОпераций.ЦельРасчета)
		|		СГРУППИРОВАТЬ ПО
		|			ГруппыВидовОперацийВидыОпераций.ВидОперации,
		|			ГруппыВидовОперацийВидыОпераций.ЦельРасчета
		|		ИМЕЮЩИЕ
		|			КОЛИЧЕСТВО(ГруппыВидовОперацийВидыОпераций.Ссылка) > 1) КАК ПересекающиесяВидыОпераций
		|		ПО (ПересекающиесяВидыОпераций.ВидОперации = ГруппыВидовОперацийВидыОпераций.ВидОперации)
		|			И (ПересекающиесяВидыОпераций.ЦельРасчета = ГруппыВидовОперацийВидыОпераций.ЦельРасчета)
		|ГДЕ
		|	ГруппыВидовОперацийВидыОпераций.Ссылка <> &ТекущаяГруппаВидовОпераций
		|ИТОГИ ПО
		|	ГруппыВидовОперацийВидыОпераций.Ссылка
		|");
	Запрос.УстановитьПараметр("ТекущаяГруппаВидовОпераций", ЭтотОбъект.Ссылка);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Пересечения	= "";
	
	ВыборкаПоГруппеВидовОпераций = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоГруппеВидовОпераций.Следующий() Цикл
		МассивВидовОпераций = Новый Массив;
		
		ВыборкаПоВидамОпераций = ВыборкаПоГруппеВидовОпераций.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаПоВидамОпераций.Следующий() Цикл
			Если ТипЗнч(ВыборкаПоВидамОпераций.ВидОперации) = Тип("Строка") Тогда
				МассивВидовОпераций.Добавить(ВыборкаПоВидамОпераций.ВидОперации + ?(ЗначениеЗаполнено(ВыборкаПоВидамОпераций.ЦельРасчета), " '" + Строка(ВыборкаПоВидамОпераций.ЦельРасчета) + "'", ""));	
			Иначе
				МассивВидовОпераций.Добавить(ВыборкаПоВидамОпераций.ВидОперации.Метаданные().Синоним + ?(ЗначениеЗаполнено(ВыборкаПоВидамОпераций.ЦельРасчета), " '" + Строка(ВыборкаПоВидамОпераций.ЦельРасчета) + "'", ""));	
			КонецЕсли;
		КонецЦикла;
		
		Пересечения = Пересечения + Строка(ВыборкаПоГруппеВидовОпераций.ГруппаВидовОпераций) + " (" + СтрСоединить(МассивВидовОпераций, ", ") + "), "	
	КонецЦикла;
	
	Пересечения = Лев(Пересечения, СтрДлина(Пересечения) - 2);
	
	Возврат Ложь;
КонецФункции