
&НаСервере
Процедура НайтиСсылкиНаСервере()
	
	ЭтаФорма.СсылкиНаОбъект.Очистить();
	
	Объекты = Новый Массив();
	Объекты.Добавить(Объект.Объект);
	
	СсылкиНаСервере = НайтиПоСсылкам(Объекты);
	
	Для каждого СтрокаСсылкиНаСервере Из СсылкиНаСервере Цикл
		НоваяСтрокаСсылкиНаОбъект = ЭтаФорма.СсылкиНаОбъект.Добавить();
		НоваяСтрокаСсылкиНаОбъект.Ссылка              = СтрокаСсылкиНаСервере[1];
		НоваяСтрокаСсылкиНаОбъект.ПолноеИмяМетаданных = СтрокаСсылкиНаСервере[2].ПолноеИмя();
	КонецЦикла;
	
КонецПроцедуры // НайтиСсылкиНаСервере

&НаКлиенте
Процедура КомандаНайтиСсылки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаНайтиСсылки");
	Попытка
		ВыполнитьНайтиСсылки(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНайтиСсылки(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ПараметрыСессии.ТекстОшибки = "Ошибка проверки заполнения";
		Возврат;
	КонецЕсли;
	
	НайтиСсылкиНаСервере();
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("Объект") И ЗначениеЗаполнено(ЭтаФорма.Параметры.Объект) Тогда
		Объект.Объект = ЭтаФорма.Параметры.Объект;
		НайтиСсылкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкиНаОбъектПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОткрытьЗначение(Элементы.СсылкиНаОбъект.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

