
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантИнвестиционногоГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.ИнтервалДат Тогда
		ПроверяемыеРеквизиты.Добавить("НачалоПериодаИнвестиционногоГоризонта");
		ПроверяемыеРеквизиты.Добавить("ОкончаниеПериодаИнвестиционногоГоризонта");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ОтносительныйСрокИнвестиционногоГоризонта");
	КонецЕсли;
	
	КвалифицированныйИнвестор = ОпределитьФлагКвалифицированныйИнвестор();
	
	Если ТипЗнч(СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		
		ПроверяемыеРеквизиты.Добавить("СуммаПередаваемыхВДУСредств");
		
		Если НЕ КвалифицированныйИнвестор Тогда
			
			КлиентФизЛицо = КлиентФизЛицо();
			
			Если КлиентФизЛицо Тогда
				ПроверяемыеРеквизиты.Добавить("ВеличинаУсловногоДохода");
				ПроверяемыеРеквизиты.Добавить("ВеличинаУсловногоРасхода");
				ПроверяемыеРеквизиты.Добавить("ВеличинаУсловныхНакоплений");
				ПроверяемыеРеквизиты.Добавить("ПриемлемыйУровеньРискаВОтносительномВыражении");
			Иначе
				ПроверяемыеРеквизиты.Добавить("ПредельныйДопустимыйРискЗаВесьСрокИнвестирования");
				ПроверяемыеРеквизиты.Добавить("РазмерЦелевыхСредств");
				ПроверяемыеРеквизиты.Добавить("СоотношениеЧистыхАктивовКОбъемуПередаваемыхСредств");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИнвестиционнаяЦель)
				И ЗначениеЗаполнено(СубъектУчета) Тогда
				
				Если НЕ ЗначениеЗаполнено(ИнвестиционнаяЦель.ДопустимыйРиск) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В качестве субъекта учета выбран неквалифицированный инвестор, но в инвестиционной цели не заполнен реквизит 'Допустимый риск'!",
					ЭтотОбъект,
					"ИнвестиционнаяЦель",
					,
					Отказ);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ИнвестиционнаяЦель.ДопустимыйРискВПроцентах) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В качестве субъекта учета выбран неквалифицированный инвестор, но в инвестиционной цели не заполнен реквизит 'Допустимый риск в процентах'!",
					ЭтотОбъект,
					"ИнвестиционнаяЦель",
					,
					Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);      
	
	Если НЕ ПроверкаКорректностиИнвестиционногоГоризонта(Отказ) Тогда 
		Возврат;
	КонецЕсли;	

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инвестиционные профили
	РегистрыСведений.ИнвестиционныеПрофили.ЗарегистрироватьИнвестиционныйПрофиль(ЭтотОбъект);
	
КонецПроцедуры

Функция ОпределитьФлагКвалифицированныйИнвестор()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("СДУ",			СубъектУчета);
	Запрос.УстановитьПараметр("Период",			Дата);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	               |ПОМЕСТИТЬ _ЮрФизЛицо
	               |ИЗ
	               |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СДУ) КАК КлиентыДоверительногоУправленияСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КвалифицированныеИнвесторыСрезПоследних.Является
	               |		ИЛИ КвалифицированныеИнвесторыСрезПоследних.ВСилуЗакона КАК КвалифицированныйИнвестор
	               |ИЗ
	               |	РегистрСведений.КвалифицированныеИнвесторы.СрезПоследних(
	               |			&Период,
	               |			ВЫБОР
	               |					КОГДА Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА Организация = &Организация
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ЮрФизЛицо В
	               |					(ВЫБРАТЬ
	               |						_ЮрФизЛицо.Клиент КАК Клиент
	               |					ИЗ
	               |						_ЮрФизЛицо КАК _ЮрФизЛицо)) КАК КвалифицированныеИнвесторыСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий() И Выборка.КвалифицированныйИнвестор;
	
КонецФункции

Функция КлиентФизЛицо()
	
	Если ТипЗнч(СубъектУчета) <> Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо) КАК ЭтоФизЛицо
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СубъектУчета) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("СубъектУчета",	СубъектУчета);
	Запрос.УстановитьПараметр("Период",			Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоФизЛицо;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверкаКорректностиИнвестиционногоГоризонта(Отказ)   
	
	РезультатПроверки = Истина;
	
	Если ТипЗнч(СубъектУчета) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда 
		
		ПроверятьНачало = Ложь;  
		ДатаРасторженияДоговора  = СубъектУчета.ДатаРасторжения;
		
		Если ВариантИнвестиционногоГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.ИнтервалДат Тогда
			
			ПроверятьНачало = Истина;         
			ДатаОкончанияГоризонта = ОкончаниеПериодаИнвестиционногоГоризонта;
			
		ИначеЕсли ВариантИнвестиционногоГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыЗаключенияДоговора Тогда 
			
			ДатаОкончанияГоризонта = ДобавитьМесяц(СубъектУчета.ДатаЗаключения, ОтносительныйСрокИнвестиционногоГоризонта * 12); 
			
		ИначеЕсли ВариантИнвестиционногоГоризонта = Перечисления.ВариантыИнвестиционногоГоризонта.КоличествоЛетСДатыРегистрацииПрофиля Тогда 
			
			ДатаОкончанияГоризонта = ДобавитьМесяц(Дата, ОтносительныйСрокИнвестиционногоГоризонта * 12); 
		
		КонецЕсли; 	    
		
		Если ПроверятьНачало Тогда 
			Если СубъектУчета.ДатаЗаключения > НачалоПериодаИнвестиционногоГоризонта Тогда 
				РезультатПроверки = Ложь;   
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало периода инвестиционного горизонта не может быть раньше даты начала договора",,,,Отказ);				
			КонецЕсли; 			
		КонецЕсли;	    
		
		// конец проверяем всегда 
		Если ЗначениеЗаполнено(ДатаРасторженияДоговора) И ДатаРасторженияДоговора < ДатаОкончанияГоризонта Тогда    
			РезультатПроверки = Ложь;  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Окончание периода инвестиционного горизонта не может быть позже даты расторжения договора",,,,Отказ);			
		КонецЕсли;	
		
	КонецЕсли;   
	
	Возврат РезультатПроверки;
	
КонецФункции	
