
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Описание = Новый ХранилищеЗначения(ЭтаФорма.Описание, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если Не Объект.Ссылка.Пустая() 
		ИЛИ Параметры.Свойство("ЗначениеКопирования") И Не Параметры.ЗначениеКопирования.Пустая() Тогда
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.БазыРасчета"));
		
		Если Параметры.Свойство("ЗначениеКопирования") И Не Параметры.ЗначениеКопирования.Пустая() Тогда
		
			ТекущийОбъект.Описание = Параметры.ЗначениеКопирования.Описание;
		
		КонецЕсли; 
		
		ЭтаФорма.Описание = ТекущийОбъект.Описание.Получить();
		
		//Если ТипЗнч(ТекущееОписание) = Тип("ФорматированныйДокумент") Тогда
		//	Описание = ТекущееОписание;
		//КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
