
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Период		= ТекущаяДата();
	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеВСписок(Список, Значение)
	
	НовыйЭлемент = Список.Добавить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СДУИВидыДДУПриИзменении(Элемент)
	
	Отчет.СчетаДоверительногоУправления.Очистить();
	Отчет.ВидыДоговоровДоверительногоУправления.Очистить();
	
	Для Каждого ТекЭлемент Из СДУИВидыДДУ Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда
			Если ТипЗнч(ТекЭлемент.Значение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.СчетаДоверительногоУправления, ТекЭлемент.Значение);
			ИначеЕсли ТипЗнч(ТекЭлемент.Значение) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.ВидыДоговоровДоверительногоУправления, ТекЭлемент.Значение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
