
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	ЭтоНедвижимоеИмущество = (Форма.Объект.ВидПрочегоАктива = ПредопределенноеЗначение("Справочник.ВидыПрочихАктивов.НедвижимоеИмущество"));
	
	Элементы = Форма.Элементы;
	
	Элементы.ОценкаСтоимостьИмущества.Видимость = ЭтоНедвижимоеИмущество;
	Элементы.ГруппаСтранницы.ОтображениеСтраниц = ?(ЭтоНедвижимоеИмущество, ОтображениеСтраницФормы.ЗакладкиСверху, ОтображениеСтраницФормы.Нет);
	Элементы.Описание.ПоложениеЗаголовка        = ?(ЭтоНедвижимоеИмущество, ПоложениеЗаголовкаЭлементаФормы.Нет, ПоложениеЗаголовкаЭлементаФормы.Авто);
	// TA 24.03.2016: на сегодняшний день исключать из распределения можно только недвижимое имущество (речь только о прочих активах).
	Элементы.ИсключениеПрочихАктивовИзРаспределения.Видимость = ЭтоНедвижимоеИмущество;
КонецПроцедуры // НастроитьВидимостьДоступность
	
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ОценкиСтоимостьИмущества.Отбор, Новый Структура("ИмяПоля, Представление", "Имущество", "ПредопределенныйОтборИмущество"),
		"ПредопределенныйОтборИмущество", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсключениеПрочихАктивовИзРаспределения.Отбор, Новый Структура("ИмяПоля, Представление", "Актив", "ПредопределенныйОтборИсключениеПрочихАктивовИзРаспределения"),
		"ПредопределенныйОтборИсключениеПрочихАктивовИзРаспределения", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);

	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ОценкиСтоимостьИмущества.Отбор, Новый Структура("ИмяПоля, Представление", "Имущество", "ПредопределенныйОтборИмущество"),
		"ПредопределенныйОтборИмущество", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсключениеПрочихАктивовИзРаспределения.Отбор, Новый Структура("ИмяПоля, Представление", "Актив", "ПредопределенныйОтборИсключениеПрочихАктивовИзРаспределения"),
		"ПредопределенныйОтборИсключениеПрочихАктивовИзРаспределения", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);

КонецПроцедуры
	
&НаКлиенте
Процедура ВидПрочегоАктиваПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
