// Параметры формы:
//	ТипЭкспорта - Строка - Возможные значения:
//		"ДостигнутаяДоходность" - Экспорт достигнутых доходностей
//		"ОбязательстваПередКлиентом" - Экспорт обязательств перед клиентом
//	НачалоПериода - Дата - Начало периода данных отчёта
//	КонецПериода - Дата - Конец периода данных отчёта
//	КоллекцияДанных - Массив(Структура(
//		"КодКлиента": Строка(50),
//		"ДостигнутаяДоходность": Число(18, 6),
//		"ОбязательстваПередКлиентом": Число(20, 2)
//	))

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Параметр "Организация"
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	// Параметр "ТипЭкспорта"
	Если ЗначениеЗаполнено(Параметры.ТипЭкспорта) Тогда
		ТипЭкспорта = Параметры.ТипЭкспорта;
	КонецЕсли;
	// Параметр "НачалоПериода"
	Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		НачалоПериода = Параметры.НачалоПериода;
		Элементы.НачалоПериода.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.НачалоПериода.Шрифт = Новый Шрифт(, , Истина);
	КонецЕсли;
	// Параметр "КонецПериода"
	Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		КонецПериода = Параметры.КонецПериода;
		Элементы.КонецПериода.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.КонецПериода.Шрифт = Новый Шрифт(, , Истина);
	КонецЕсли;
	// Параметр "КоллекцияДанных"
	Если Параметры.КоллекцияДанных <> Неопределено И ТипЗнч(Параметры.КоллекцияДанных) = Тип("Массив") Тогда
		ТекущееСвойство = Неопределено;
		Для Каждого ЭлементКоллекции Из Параметры.КоллекцияДанных Цикл
			Если ТипЗнч(ЭлементКоллекции) = Тип("Структура") Тогда
				ТекущаяСтрокаДанных = Неопределено;
				// Поле "КодКлиента" (обязательное)
				Если ЭлементКоллекции.Свойство("КодКлиента", ТекущееСвойство) И Не ПустаяСтрока(ТекущееСвойство) Тогда
					ТекущаяСтрокаДанных = ТаблицаДанных.Добавить();
					ТекущаяСтрокаДанных.КодКлиента = ТекущееСвойство;
				КонецЕсли;
				Если ТекущаяСтрокаДанных = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				// Поле "ДостигнутаяДоходность"
				Если ЭлементКоллекции.Свойство("ДостигнутаяДоходность", ТекущееСвойство) И Не ПустаяСтрока(ТекущееСвойство) Тогда
					ТекущаяСтрокаДанных.ДостигнутаяДоходность = ТекущееСвойство;
				КонецЕсли;
				// Поле "ОбязательстваПередКлиентов"
				Если ЭлементКоллекции.Свойство("ОбязательстваПередКлиентом", ТекущееСвойство) И Не ПустаяСтрока(ТекущееСвойство) Тогда
					ТекущаяСтрокаДанных.ОбязательстваПередКлиентом = ТекущееСвойство;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Реквизит "ЗамещенияКодовКлиентов"
	ЗамещенияКодовКлиентов.Очистить();
	ОрганизацияМДТраст = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст");
	Если ЗначениеЗаполнено(ОрганизацияМДТраст) Тогда
		НоваяСтрока = ЗамещенияКодовКлиентов.Добавить();
		НоваяСтрока.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст");
		НоваяСтрока.КодКлиента = "О";
		НоваяСтрока.НовыйКодКлиента = "МДТ_СОБ";
	КонецЕсли;
	// Применение замещений кодов клиентов
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если ПустаяСтрока(СтрокаДанных) Тогда
			Продолжить;
		КонецЕсли;
		// Поиск замещения кода клиента
		НайденнаяСтрокаЗамещенийКодовКлиентов = Неопределено;
		Для Каждого СтрокаЗамещенийКодовКлиентов Из ЗамещенияКодовКлиентов Цикл
			Если СтрокаЗамещенийКодовКлиентов.Организация <> ЭтотОбъект.Организация Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаЗамещенийКодовКлиентов.КодКлиента = СтрокаДанных.КодКлиента Тогда
				НайденнаяСтрокаЗамещенийКодовКлиентов = СтрокаЗамещенийКодовКлиентов;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НайденнаяСтрокаЗамещенийКодовКлиентов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// Применение изменений
		СтрокаДанных.КодКлиента = НайденнаяСтрокаЗамещенийКодовКлиентов.НовыйКодКлиента;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверка реквизита "ТипЭкспорта"
	Если ПустаяСтрока(ТипЭкспорта) Тогда
		ТипЭкспорта = "ДостигнутаяДоходность";
	КонецЕсли;
	ТипЭкспортаПриИзменении(Неопределено);
	// Проверка реквизита "ТаблицаДанных"
	УникальныеКодыКлиентов = Новый Соответствие; // Соответствие(Строка (Код клиента), Истина)
	ДубликатовКодовКлиентов = 0;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если УникальныеКодыКлиентов.Получить(СтрокаДанных.КодКлиента) = Неопределено Тогда
			УникальныеКодыКлиентов.Вставить(СтрокаДанных.КодКлиента);
			СтрокаДанных.Пометка = Истина;
		Иначе
			ДубликатовКодовКлиентов = ДубликатовКодовКлиентов + 1;
			СтрокаДанных.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ДубликатовКодовКлиентов > 0 Тогда
		Сообщить("Найдено (" + ДубликатовКодовКлиентов + ") дубликатов кодов клиентов в таблице данных. "
			+ "Пометка на выгрузку этих строк была снята.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипЭкспортаПриИзменении(Элемент)
	Элементы.ТаблицаДанныхДостигнутаяДоходность.Видимость = Ложь;
	Элементы.ТаблицаДанныхОбязательстваПередКлиентом.Видимость = Ложь;
	
	Если ТипЭкспорта = "ДостигнутаяДоходность" Тогда
		Элементы.ТаблицаДанныхДостигнутаяДоходность.Видимость = Истина;
	ИначеЕсли ТипЭкспорта = "ОбязательстваПередКлиентом" Тогда
		Элементы.ТаблицаДанныхОбязательстваПередКлиентом.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭкспортДанных(Команда)
	// Проверка заполнения "ТипЭкспорта"
	Если Не ЗначениеЗаполнено(ТипЭкспорта) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ТипЭкспорта";
		Сообщение.Текст = "Не заполнен тип экспорта.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// Проверка заполнения "НачалоПериода"
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "НачалоПериода";
		Сообщение.Текст = "Не заполнено начало периода.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// Проверка заполнения "КонецПериода"
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "КонецПериода";
		Сообщение.Текст = "Не заполнен конец периода.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	КомандаЭкспортДанныхНаСервере();
	ПоказатьПредупреждение(, "Данные успешно выгружены.", , "Экспорт данных");
КонецПроцедуры

&НаСервере
Процедура КомандаЭкспортДанныхНаСервере()
	ВнешниеИсточникиДанных.RiskControl.НачатьТранзакцию();
	Попытка
		Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
			Если ТипЭкспорта = "ДостигнутаяДоходность" Тогда
				#Область ОписаниеПроцедуры
				// Параметры [P_Add_Scenario_Portfolio_Guaranty]:
				//	@ClientCode NVARCHAR(50),
				//	@ClientName NVARCHAR(255) = NULL,
				//	@StartDate DATE,
				//	@EndDate DATE,
				//	@Yield DECIMAL(18, 6) = NULL,
				//	@GuarantedYield DECIMAL(18, 6) = NULL,
				//	@MinYield DECIMAL(18, 6) = NULL,
				//	@GuarantyValue DECIMAL(38, 4) = NULL
				#КонецОбласти
				ВнешниеИсточникиДанных.RiskControl.P_Add_Scenario_Portfolio_Guaranty(
					СтрокаДанных.КодКлиента, NULL, НачалоПериода, КонецПериода,
					СтрокаДанных.ДостигнутаяДоходность, NULL, NULL, NULL);
			ИначеЕсли ТипЭкспорта = "ОбязательстваПередКлиентом" Тогда
				#Область ОписаниеПроцедуры
				// Параметры [P_Add_Scenario_Portfolio_Guaranty]:
				//	@ClientCode NVARCHAR(50),
				//	@ClientName NVARCHAR(255) = NULL,
				//	@StartDate DATE,
				//	@EndDate DATE,
				//	@Yield DECIMAL(18, 6) = NULL,
				//	@GuarantedYield DECIMAL(18, 6) = NULL,
				//	@MinYield DECIMAL(18, 6) = NULL,
				//	@GuarantyValue DECIMAL(38, 4) = NULL
				#КонецОбласти
				ВнешниеИсточникиДанных.RiskControl.P_Add_Scenario_Portfolio_Guaranty(
					СтрокаДанных.КодКлиента, NULL, НачалоПериода, КонецПериода,
					NULL, NULL, NULL, СтрокаДанных.ОбязательстваПередКлиентом);
			КонецЕсли;
		КонецЦикла;
		ВнешниеИсточникиДанных.RiskControl.ЗафиксироватьТранзакцию();
	Исключение
		ВнешниеИсточникиДанных.RiskControl.ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗамещенияКодовКлиентов(Команда)
	ПараметрыОткрываемойФормы = Новый Структура;
	ПараметрыОткрываемойФормы.Вставить("Организация", ЭтотОбъект.Организация);
	ЗамещенияКодовКлиентовПоОрганизации = Новый Массив; // Массив(Структура("КодКлиента": Строка(50), "НовыйКодКлиента": Строка(50)))
	Для Каждого СтрокаЗамещенийКодовКлиентов Из ЭтотОбъект.ЗамещенияКодовКлиентов Цикл
		Если СтрокаЗамещенийКодовКлиентов.Организация <> ЭтотОбъект.Организация Тогда
			Продолжить;
		КонецЕсли;
		ДанныеЗамещенияКодовКлиента = Новый Структура("КодКлиента, НовыйКодКлиента");
		ЗаполнитьЗначенияСвойств(ДанныеЗамещенияКодовКлиента, СтрокаЗамещенийКодовКлиентов);
		ЗамещенияКодовКлиентовПоОрганизации.Добавить(ДанныеЗамещенияКодовКлиента);
	КонецЦикла;
	ПараметрыОткрываемойФормы.Вставить("ЗамещенияКодовКлиентовПоОрганизации", ЗамещенияКодовКлиентовПоОрганизации);
	ОткрытьФорму("ВнешнийОтчет._РасчетДоходностиДУ.Форма.ЗамещенияКодовКлиентов", ПараметрыОткрываемойФормы, ЭтаФорма); //РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
КонецПроцедуры
