&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОтчетОСверке = ВыполнитьСверкуСоСпискомЛицСЗамороженнымиСчетамиВMatrix();
	
	Если ОтчетОСверке = Неопределено Тогда
		ПоказатьПредупреждение(, "При выполнении сверки прозошли ошибки!");
		Возврат;	
	КонецЕсли;
	ОтчетОСверке.Показать("Результат сверки со списком лиц с замороженными счетами в Matrix");	
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЖурналСверкиСоСписками"));
КонецПроцедуры

&НаСервере
Функция ВыполнитьСверкуСоСпискомЛицСЗамороженнымиСчетамиВMatrix()
	ОтчетОСверке = Новый ТабличныйДокумент;

	РегистрыСведений.ЖурналСверкиСоСписками.ВыполнитьСверкуСоСпискомЛицСЗамороженнымиСчетамиВMatrix(, , ОтчетОСверке);

	Возврат ОтчетОСверке;
КонецФункции