
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		Сообщить("Перед печатью документ необходимо записать.");
	Иначе
		
		РаботаСДокументооборотомКлиент.ПроверитьЗаполнитьСодержаниеИсходящихДокументов(ПараметрКоманды, "УведомлениеОбЭДО");
		
		Результат = ПечатьНаСервере(ПараметрКоманды);
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			
			Если Результат.Количество() = 1 Тогда
				
				ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
				ДиалогСохраненияФайла.ПолноеИмяФайла = Результат[0].ИмяФайла;
				ДиалогСохраненияФайла.Фильтр = "XTDD файл (*.xtdd)|*.xtdd";
				
			ИначеЕсли Результат.Количество() > 1 Тогда
				
				ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
				
			Иначе
				
				Возврат;
				
			КонецЕсли;
			
			ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
			
			Если ДиалогСохраненияФайла.Выбрать() Тогда
				
				Если Результат.Количество() = 1 Тогда
					Результат[0].ДвоичныеДанные.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла);
				Иначе
					Для каждого ФайлДляЗаписи Из Результат Цикл
						ФайлДляЗаписи.ДвоичныеДанные.Записать(ДиалогСохраненияФайла.Каталог + "\" + ФайлДляЗаписи.ИмяФайла);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ПараметрКоманды)

	Возврат Документы.ИсходящийДокумент.ПечатьУведомленияОбИспользованииЭДО(ПараметрКоманды);

КонецФункции