#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Параметр "Организация"
	Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		Сообщить("Параметр ""Организация"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Организация = Параметры.Организация;
	
	// Параметр "КоллекцияДанных"
	Если ТипЗнч(Параметры.КоллекцияДанных) <> Тип("Массив") Или Параметры.КоллекцияДанных.Количество() = 0 Тогда
		Сообщить("Параметр ""КоллекцияДанных"" не заполнен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаДанныхИзПараметров Из Параметры.КоллекцияДанных Цикл
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаДанныхИзПараметров);
		Если Не ЗначениеЗаполнено(СтрокаДанных.СчетДоверительногоУправления)
			Или Не ЗначениеЗаполнено(СтрокаДанных.ДатаПокупки)
			Или Не ЗначениеЗаполнено(СтрокаДанных.Облигация)
		Тогда
			Сообщить("Не заполнены обязательные данные в передаваемой коллекции.");
		КонецЕсли;
	КонецЦикла;
	
	// Свёртка и нумерация строк
	ТаблицаДанныхЗначение = ДанныеФормыВЗначение(ТаблицаДанных, Тип("ТаблицаЗначений"));
	ТаблицаДанныхЗначение.Свернуть("СчетДоверительногоУправления, ДатаПокупки, Облигация", "НомерСтроки, Выбрано");
	ТаблицаДанныхЗначение.Сортировать("СчетДоверительногоУправления, ДатаПокупки, Облигация");
	НомерСтроки = 0;
	Для Каждого СтрокаДанных Из ТаблицаДанныхЗначение Цикл
		НомерСтроки = НомерСтроки + 1;
		СтрокаДанных.НомерСтроки = НомерСтроки;
	КонецЦикла;
	ЗначениеВДанныеФормы(ТаблицаДанныхЗначение, ТаблицаДанных);
	
	// Установка поля "Выбрано" по сохранённым данных из базы
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ТаблицаДанных.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаДанных.ДатаПокупки КАК ДатаПокупки,
		|	ТаблицаДанных.Облигация КАК Облигация,
		|	ТаблицаДанных.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ТаблицаДанных.НомерСтроки КАК НомерСтроки,
		|	НЕ ОблигацииДляТестированияSPPI.Облигация ЕСТЬ NULL КАК Выбрано
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОблигацииДляТестированияSPPI КАК ОблигацииДляТестированияSPPI
		|		ПО (ОблигацииДляТестированияSPPI.Организация = &Организация)
		|			И _ТаблицаДанных.СчетДоверительногоУправления = ОблигацииДляТестированияSPPI.СчетДоверительногоУправления
		|			И _ТаблицаДанных.ДатаПокупки = ОблигацииДляТестированияSPPI.ДатаПокупки
		|			И _ТаблицаДанных.Облигация = ОблигацииДляТестированияSPPI.Облигация";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанныхЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаДанных[Выборка.НомерСтроки - 1].Выбрано = Выборка.Выбрано;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность Тогда
		Отказ = Истина;
		ПередЗакрытиемАсинх();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗакрытиемАсинх()
	Ответ = Ждать ВопросАсинх("Данные были изменены. Применить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Модифицированность = Ложь;
		КомандаЗаписатьИЗакрыть(Неопределено);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаТаблицаДанныеВыбратьВсе(Команда)
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		СтрокаДанных.Выбрано = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаТаблицаДанныеУбратьВыделение(Команда)
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		СтрокаДанных.Выбрано = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	КомандаЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьИЗакрытьНаСервере()
	Если ПараметрыСеанса.ТекущаяОрганизация <> Организация Тогда
		Сообщить("Текущая организация не соответствует редактируемым данным!");
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ОблигацииДляТестированияSPPI.СоздатьМенеджерЗаписи();
	СтруктураИзмерений = Новый Структура("Организация, СчетДоверительногоУправления, ДатаПокупки, Облигация");
	СтруктураИзмерений.Организация = Организация;
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если Не ЗначениеЗаполнено(СтрокаДанных.СчетДоверительногоУправления)
			Или Не ЗначениеЗаполнено(СтрокаДанных.ДатаПокупки)
			Или Не ЗначениеЗаполнено(СтрокаДанных.Облигация)
		Тогда
			Сообщить("Не указаны обязательные поля для записи. (СчетДоверительногоУправления: " + СтрокаДанных.СчетДоверительногоУправления
				+ ", ДатаПокупки: " + СтрокаДанных.ДатаПокупки + ", Облигации: " + СтрокаДанных.Облигации);
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураИзмерений, СтрокаДанных);
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
		МенеджерЗаписи.Прочитать();
		Если СтрокаДанных.Выбрано Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
			МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			МенеджерЗаписи.Записать(Истина);
		Иначе
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
