
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Период.Вариант 	= ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	Отчет.Организация 		= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.ДоступенСписокОрганизаций = (РольДоступна("МногофирменныйУчет") Или РольДоступна("ПолныеПрава"));
		
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ВидимостьСпискаОрганизаций = Ложь;
	
	Если КлючТекущегоВарианта = "ДействующиеДепозиты" Тогда
		
		ВидимостьСпискаОрганизаций = ЭтаФорма.ДоступенСписокОрганизаций;
		
		Если ВидимостьСпискаОрганизаций Тогда
			
			ПолучитьСписокДоступныхОрганизаций();
			
			// Удалим организации, к которым больше нет доступа
			
			Для Индекс = 1 - Отчет.СписокОрганизаций.Количество() По 0 Цикл
				
				ТекОрганизация		 = Отчет.СписокОрганизаций[-Индекс];
				ДоступнаяОрганизация = ЭтаФорма.СписокДоступныхОрганизаций.НайтиПоЗначению(ТекОрганизация.Значение);
				
				Если ДоступнаяОрганизация = Неопределено Тогда
					Отчет.СписокОрганизаций.Удалить(ТекОрганизация);
				Иначе
					ДоступнаяОрганизация.Пометка = Истина;
				КонецЕсли; 
				
			КонецЦикла; 		
			
		Иначе
			
			Отчет.СписокОрганизаций.Очистить();
			Отчет.СписокОрганизаций.Добавить(Отчет.Организация);
		
		КонецЕсли; 

	КонецЕсли;
	
	Элементы.Организация.Видимость		 = Не ВидимостьСпискаОрганизаций;
	Элементы.СписокОрганизаций.Видимость = ВидимостьСпискаОрганизаций;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта", КлючТекущегоВарианта);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура СписокОрганизацийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.СписокДоступныхОрганизаций.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("СписокОрганизацийНачалоВыбораЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийНачалоВыбораЗавершение(Список, ДополнительныеПараметры) Экспорт
	
	Если Не Список = Неопределено Тогда
	
		Отчет.СписокОрганизаций.Очистить();
		Для каждого ЭлементСписка Из Список Цикл
		
			Если ЭлементСписка.Пометка Тогда
			    Отчет.СписокОрганизаций.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли; 
		
		КонецЦикла; 		
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
				
		Значение = ПолучитьЗначениеРасшифровки(ДанныеРасшифровки, Расшифровка);
				
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			ОткрытьЗначение(Значение);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПолучитьСписокДоступныхОрганизаций()

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Организация КАК Организация,
		|	Пользователи.Организация.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И Пользователи.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
		
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", РаботаСПользователями.ТекущийПользователь().ИдентификаторПользователяИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭтаФорма.СписокДоступныхОрганизаций.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.СписокДоступныхОрганизаций.Добавить(Выборка.Организация, Выборка.Наименование);
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Не ЭтаФорма.ДоступенСписокОрганизаций Тогда
	
		Отчет.СписокОрганизаций.Очистить();
		Отчет.СписокОрганизаций.Добавить(Отчет.Организация);
	
	КонецЕсли; 
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьЗначениеРасшифровки(АдресРасшифровкиДанных, Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(АдресРасшифровкиДанных);
	
	Возврат Данные.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

#КонецОбласти 
