
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	ЭтаФорма.Сервер_1Ф = ?(ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза, "1f", "test1f") + ".g1.lan"; 
		
	ОбновитьНаСервере();
	
	Если ТипЗнч(ЭтаФорма.ДопСвойства) = Тип("Структура") И ЭтаФорма.ДопСвойства.Свойство("ОшибкаПолученияДанныхПервойФормы") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СообщитьОбОшибках();
		
КонецПроцедуры 

&НаСервере
Процедура ОбновитьНаСервере(ПараметрыПодключения = Неопределено) 
	
	НоваяСессия = (ПараметрыПодключения = Неопределено);
	
	Если НоваяСессия Тогда
		
		ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
		ПараметрыСессии = Новый Структура("Организация, Сервер", ЭтаФорма.Организация, ЭтаФорма.Сервер_1Ф);
		
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектНаСервере,, ПараметрыСессии);
		
		Механизм = ОбъектНаСервере.Метаданные().ПолноеИмя() + ".Форма.СозданиеЗадачДляПервойФормы.ОбновитьНаСервере().";
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
			
	КонецЕсли;
	
	ЭтаФорма.ПараметрыЗадач.Очистить(); 
	ЭтаФорма.ДопСвойства = Новый Структура("Ошибки", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса())); 
	
#Область Текст_Запроса	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокРаспоряжение.Организация КАК Организация,
		|	ДокРаспоряжение.Ссылка КАК Ссылка,
		|	ДокРаспоряжение.ПометкаУдаления КАК ПометкаУдаления,
		|	ДокРаспоряжение.ДатаРазмещения КАК ДатаРазмещения,
		|	ДокРаспоряжение.Банк КАК Банк,
		|	ДокРаспоряжение.Банк.ЮрФизЛицо КАК ЮрЛицоБанка,
		|	ДокРаспоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДокРаспоряжение.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	ДокРаспоряжение.Сумма КАК Сумма,
		|	ДокРаспоряжение.Процент КАК Процент,
		|	ДокРаспоряжение.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	ДокРаспоряжение.ДоВостребования КАК ДоВостребования,
		|	ДокРаспоряжение.ДатаВозврата КАК ДатаВозврата,
		|	НомераТранзакций.Номер КАК НомерЗадачи,
		|	НомераТранзакций.Ключ КАК Ключ
		|ПОМЕСТИТЬ _ДанныеРаспоряжений
		|ИЗ
		|	Документ.Распоряжение КАК ДокРаспоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераТранзакций КАК НомераТранзакций
		|		ПО ДокРаспоряжение.Ссылка = НомераТранзакций.Субъект
		|			И (НомераТранзакций.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|ГДЕ
		|	ДокРаспоряжение.Организация = &Организация
		|	И НЕ ДокРаспоряжение.ПометкаУдаления
		|	И ДокРаспоряжение.ДатаРазмещения >= &ТекущаяДата
		|	И ДокРаспоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеРаспоряжений.Банк КАК Банк,
		|	_ДанныеРаспоряжений.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	_ДанныеРаспоряжений.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _КонтрагентыГенСоглашений
		|ИЗ
		|	_ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДанныеРаспоряжений.Банк,
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо,
		|	_ДанныеРаспоряжений.СчетДоверительногоУправления
		|ИЗ
		|	_ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|				&ТекущаяДата,
		|				ЮридическоеЛицо В
		|						(ВЫБРАТЬ
		|							_ДанныеРаспоряжений.ЮрЛицоБанка
		|						ИЗ
		|							_ДанныеРаспоряжений КАК _ДанныеРаспоряжений)
		|					И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО _ДанныеРаспоряжений.ЮрЛицоБанка = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КонтрагентыГенСоглашений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КонтрагентыГенСоглашений.Банк КАК Банк
		|ПОМЕСТИТЬ _ГенСоглашения
		|ИЗ
		|	_КонтрагентыГенСоглашений КАК _КонтрагентыГенСоглашений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|				&ТекущаяДата,
		|				Организация = &Организация
		|					И (СчетДоверительногоУправления, ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).Контрагент) В
		|						(ВЫБРАТЬ
		|							_КонтрагентыГенСоглашений.СчетДоверительногоУправления,
		|							_КонтрагентыГенСоглашений.ЮрЛицоБанка
		|						ИЗ
		|							_КонтрагентыГенСоглашений КАК _КонтрагентыГенСоглашений)
		|					И ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(
		|					&ТекущаяДата,
		|					Организация = &Организация
		|						И ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО _КонтрагентыГенСоглашений.СчетДоверительногоУправления = ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ДоговорыСчетовДоверительногоУправленияСрезПоследних.Организация = &Организация)
		|			И (_КонтрагентыГенСоглашений.ЮрЛицоБанка = ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры).Контрагент)
		|ГДЕ
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.Активный
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ТекущаяДата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеРаспоряжений.Банк КАК Банк,
		|	КодыВоВнешнихСистемах.Объект КАК Объект,
		|	КодыВоВнешнихСистемах.Код КАК Код,
		|	КодыВоВнешнихСистемах.ВнешняяСистема КАК ВнешняяСистема
		|ПОМЕСТИТЬ _КодыВоВнешнихСистемах
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&ТекущаяДата,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)
		|					И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица))
		|				ИЛИ ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|					И Объект В
		|						(ВЫБРАТЬ
		|							_ДанныеРаспоряжений.ЮрЛицоБанка
		|						ИЗ
		|							_ДанныеРаспоряжений КАК _ДанныеРаспоряжений)) КАК КодыВоВнешнихСистемах
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|		ПО КодыВоВнешнихСистемах.Объект = _ДанныеРаспоряжений.ЮрЛицоБанка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРаспоряжений.Ссылка КАК Распоряжение,
		|	ПерваяФормаКодыУК.Код КАК ПерваяФормаКодУК,
		|	_ДанныеРаспоряжений.НомерЗадачи КАК НомерЗадачи,
		|	_ДанныеРаспоряжений.Ключ КАК Ключ,
		|	_ДанныеРаспоряжений.ДатаРазмещения КАК ДатаРазмещения,
		|	_ДанныеРаспоряжений.Банк КАК Банк,
		|	_ДанныеРаспоряжений.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	ПерваяФормаКодыЮрЛицБанков.Код КАК ПерваяФормаКодЮрЛицаБанка,
		|	КодыМатрихЮрЛицБанков.Код КАК КодМатриксЮрЛицаБанка,
		|	_ДанныеРаспоряжений.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеРаспоряжений.КодСчета КАК КодСчета,
		|	_ДанныеРаспоряжений.Сумма КАК Сумма,
		|	_ДанныеРаспоряжений.Процент КАК Ставка,
		|	РАЗНОСТЬДАТ(_ДанныеРаспоряжений.ДатаРазмещения, _ДанныеРаспоряжений.ДатаВозврата, ДЕНЬ) КАК Срок,
		|	_ДанныеРаспоряжений.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_ДанныеРаспоряжений.ДоВостребования КАК ДоВостребования,
		|	_ДанныеРаспоряжений.ДатаВозврата КАК ДатаВозврата,
		|	ВЫБОР
		|		КОГДА _ГенСоглашения.Банк ЕСТЬ NULL
		|			ТОГДА ""Разовый договор""
		|		ИНАЧЕ ""Ген. соглашение""
		|	КОНЕЦ КАК ВидДоговора
		|ПОМЕСТИТЬ _ДанныеУчетнойСистемы
		|ИЗ
		|	_ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГенСоглашения КАК _ГенСоглашения
		|		ПО _ДанныеРаспоряжений.СчетДоверительногоУправления = _ГенСоглашения.СчетДоверительногоУправления
		|			И _ДанныеРаспоряжений.Банк = _ГенСоглашения.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК ПерваяФормаКодыУК
		|		ПО _ДанныеРаспоряжений.Организация = ПерваяФормаКодыУК.Объект
		|			И (ПерваяФормаКодыУК.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК ПерваяФормаКодыЮрЛицБанков
		|		ПО _ДанныеРаспоряжений.ЮрЛицоБанка = ПерваяФормаКодыЮрЛицБанков.Объект
		|			И (ПерваяФормаКодыЮрЛицБанков.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК КодыМатрихЮрЛицБанков
		|		ПО _ДанныеРаспоряжений.ЮрЛицоБанка = КодыМатрихЮрЛицБанков.Объект
		|			И (КодыМатрихЮрЛицБанков.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПараметрыСозданныхЗадач.НомерЗадачи КАК НомерЗадачи,
		|	_ПараметрыСозданныхЗадач.Ключ КАК Ключ,
		|	_ДанныеПорученийБезЗадач.ДатаРазмещения КАК ДатаРазмещения,
		|	_ДанныеПорученийБезЗадач.ВидДоговора КАК ВидДоговора,
		|	_ДанныеПорученийБезЗадач.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	_ДанныеПорученийБезЗадач.Банк КАК Банк
		|ПОМЕСТИТЬ _ОсновныеПараметры
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеПорученийБезЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_ДанныеУчетнойСистемы.НомерЗадачи КАК НомерЗадачи,
		|			_ДанныеУчетнойСистемы.Ключ КАК Ключ,
		|			_ДанныеУчетнойСистемы.ДатаРазмещения КАК ДатаРазмещения,
		|			_ДанныеУчетнойСистемы.ВидДоговора КАК ВидДоговора,
		|			_ДанныеУчетнойСистемы.ЮрЛицоБанка КАК ЮрЛицоБанка
		|		ИЗ
		|			_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|		ГДЕ
		|			НЕ _ДанныеУчетнойСистемы.НомерЗадачи ЕСТЬ NULL) КАК _ПараметрыСозданныхЗадач
		|		ПО _ДанныеПорученийБезЗадач.ДатаРазмещения = _ПараметрыСозданныхЗадач.ДатаРазмещения
		|			И _ДанныеПорученийБезЗадач.ВидДоговора = _ПараметрыСозданныхЗадач.ВидДоговора
		|			И _ДанныеПорученийБезЗадач.ЮрЛицоБанка = _ПараметрыСозданныхЗадач.ЮрЛицоБанка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеУчетнойСистемы.КодМатриксЮрЛицаБанка КАК КодМатрикс,
		|	_ДанныеУчетнойСистемы.ЮрЛицоБанка КАК ЮрЛицоБанка
		|ПОМЕСТИТЬ _КодыЮрЛицБанков
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|ГДЕ
		|	_ДанныеУчетнойСистемы.ПерваяФормаКодЮрЛицаБанка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОсновныеПараметры.НомерЗадачи КАК НомерЗадачи
		|ИЗ
		|	_ОсновныеПараметры КАК _ОсновныеПараметры
		|ГДЕ
		|	НЕ _ОсновныеПараметры.НомерЗадачи ЕСТЬ NULL";
#КонецОбласти
	
	НомераЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЗадачи");
	ТаблицаЮрЛицБанков = Запрос.МенеджерВременныхТаблиц.Таблицы["_КодыЮрЛицБанков"].ПолучитьДанные().Выгрузить();
		
	ПриемникДанных = СоздатьСтруктуруДляИмпортаДанных(); 
	
	Если НомераЗадач.Количество() > 0 Или ТаблицаЮрЛицБанков.Количество() > 0 Тогда
		
		Если НоваяСессия Тогда
	
			ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения(ЭтаФорма.Сервер_1Ф);
		
			Если ПараметрыПодключения = Неопределено Тогда
				
				ЭтаФорма.ДопСвойства.Вставить("ОшибкаПолученияДанныхПервойФормы");
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Ошибка подключения к первой форме.");
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПолучитьДанныеПервойФормы(ПриемникДанных, ПараметрыПодключения, НомераЗадач, ТаблицаЮрЛицБанков, ЭтаФорма.ДопСвойства.Ошибки);
		
	ИначеЕсли НоваяСессия И Запрос.МенеджерВременныхТаблиц.Таблицы["_ОсновныеПараметры"].ПолучитьДанные().Пустой() Тогда
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
		
	КонецЕсли;
				
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыЗадач.НомерЗадачи КАК НомерЗадачи,
		|	ПараметрыЗадач.Статус КАК Статус,
		|	ПараметрыЗадач.КодУК КАК КодУК,
		|	ПараметрыЗадач.КодБанка КАК КодБанка,
		|	ПараметрыЗадач.ВидДоговора КАК ВидДоговора,
		|	ПараметрыЗадач.Закрыта КАК Закрыта,
		|	ПараметрыЗадач.ЕстьОшибки КАК ЕстьОшибки
		|ПОМЕСТИТЬ _ПерваяФормаПараметрыЗадач
		|ИЗ
		|	&ПараметрыЗадач КАК ПараметрыЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличныеДанные.НомерЗадачи КАК НомерЗадачи,
		|	ТабличныеДанные.НомерСтроки КАК НомерСтроки,
		|	ТабличныеДанные.КодСчета КАК КодСчета,
		|	ТабличныеДанные.Сумма КАК Сумма,
		|	ТабличныеДанные.Ставка КАК Ставка,
		|	ТабличныеДанные.Срок КАК Срок,
		|	ТабличныеДанные.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	ТабличныеДанные.ДоВостребования КАК ДоВостребования,
		|	ТабличныеДанные.ДатаРазмещения КАК ДатаРазмещения,
		|	ТабличныеДанные.ДатаВозврата КАК ДатаВозврата
		|ПОМЕСТИТЬ _ПерваяФормаТабличныеДанные
		|ИЗ
		|	&ТабличныеДанные КАК ТабличныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПерваяФормаПараметрыЗадач.НомерЗадачи КАК НомерЗадачи,
		|	_ПерваяФормаПараметрыЗадач.Статус КАК Статус,
		|	_ПерваяФормаПараметрыЗадач.КодУК КАК КодУК,
		|	_КодыУК.Объект КАК Организация,
		|	_ПерваяФормаПараметрыЗадач.КодБанка КАК КодБанка,
		|	_КодыЮрЛицБанков.Банк КАК Банк,
		|	_КодыЮрЛицБанков.Объект КАК ЮрЛицоБанка,
		|	_ПерваяФормаПараметрыЗадач.ВидДоговора КАК ВидДоговора,
		|	_ПерваяФормаПараметрыЗадач.Закрыта КАК Закрыта,
		|	_ПерваяФормаПараметрыЗадач.ЕстьОшибки КАК ЕстьОшибки
		|ПОМЕСТИТЬ _ПерваяФормаДополненныеПараметрыЗадач
		|ИЗ
		|	_ПерваяФормаПараметрыЗадач КАК _ПерваяФормаПараметрыЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыУК
		|		ПО _ПерваяФормаПараметрыЗадач.КодУК = _КодыУК.Код
		|			И (_КодыУК.Объект = &Организация)
		|			И (_КодыУК.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВоВнешнихСистемах КАК _КодыЮрЛицБанков
		|		ПО _ПерваяФормаПараметрыЗадач.КодБанка = _КодыЮрЛицБанков.Код
		|			И (_КодыЮрЛицБанков.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма))
		|ГДЕ
		|	НЕ _ПерваяФормаПараметрыЗадач.ЕстьОшибки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРаспоряжений.Ссылка КАК Распоряжение,
		|	ЕСТЬNULL(_ДанныеРаспоряжений.СчетДоверительногоУправления, СчетаДУ.Ссылка) КАК СчетДоверительногоУправления,
		|	_ПерваяФормаТабличныеДанные.НомерЗадачи КАК НомерЗадачи,
		|	_ПерваяФормаТабличныеДанные.НомерСтроки КАК НомерСтроки,
		|	_ПерваяФормаТабличныеДанные.КодСчета КАК КодСчета,
		|	_ПерваяФормаТабличныеДанные.Сумма КАК Сумма,
		|	_ПерваяФормаТабличныеДанные.Ставка КАК Ставка,
		|	_ПерваяФормаТабличныеДанные.Срок КАК Срок,
		|	_ПерваяФормаТабличныеДанные.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_ПерваяФормаТабличныеДанные.ДоВостребования КАК ДоВостребования,
		|	_ПерваяФормаТабличныеДанные.ДатаРазмещения КАК ДатаРазмещения,
		|	_ПерваяФормаТабличныеДанные.ДатаВозврата КАК ДатаВозврата
		|ПОМЕСТИТЬ _ПерваяФормаДополненныеТабличныеДанные
		|ИЗ
		|	_ПерваяФормаТабличныеДанные КАК _ПерваяФормаТабличныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРаспоряжений КАК _ДанныеРаспоряжений
		|		ПО _ПерваяФормаТабличныеДанные.НомерЗадачи = _ДанныеРаспоряжений.НомерЗадачи
		|			И _ПерваяФормаТабличныеДанные.КодСчета = _ДанныеРаспоряжений.КодСчета
		|			И _ПерваяФормаТабличныеДанные.ДатаРазмещения = _ДанныеРаспоряжений.ДатаРазмещения
		|			И _ПерваяФормаТабличныеДанные.ДатаВозврата = _ДанныеРаспоряжений.ДатаВозврата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДУ
		|		ПО _ПерваяФормаТабличныеДанные.КодСчета = СчетаДУ.КодСчета
		|			И (СчетаДУ.Организация = &Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи КАК НомерЗадачи,
		|	_ПерваяФормаДополненныеПараметрыЗадач.КодБанка КАК Параметр,
		|	""Задача [%1]. Не удалось определить юр. лицо банка по коду первой формы [%2]."" КАК ТекстСообщения
		|ПОМЕСТИТЬ _ОшибкиСоответствияДанных
		|ИЗ
		|	_ПерваяФормаДополненныеПараметрыЗадач КАК _ПерваяФормаДополненныеПараметрыЗадач
		|ГДЕ
		|	_ПерваяФормаДополненныеПараметрыЗадач.ЮрЛицоБанка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи,
		|	_ПерваяФормаДополненныеПараметрыЗадач.КодУК,
		|	""Задача [%1]. Не удалось определить организацию по коду первой формы [%2].""
		|ИЗ
		|	_ПерваяФормаДополненныеПараметрыЗадач КАК _ПерваяФормаДополненныеПараметрыЗадач
		|ГДЕ
		|	_ПерваяФормаДополненныеПараметрыЗадач.Организация ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	&Организация,
		|	""%1Не удалось определить код организации [%2] для формирования задач в первой форме.""
		|ИЗ
		|	_ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|ГДЕ
		|	_ДанныеУчетнойСистемы.ПерваяФормаКодУК ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПерваяФормаДополненныеТабличныеДанные.НомерЗадачи КАК НомерЗадачи,
		|	_ПерваяФормаДополненныеТабличныеДанные.НомерСтроки КАК П2,
		|	_ПерваяФормаДополненныеТабличныеДанные.СчетДоверительногоУправления КАК П3,
		|	_ПерваяФормаДополненныеТабличныеДанные.Сумма КАК П4,
		|	_ПерваяФормаДополненныеТабличныеДанные.ДатаВозврата КАК П5,
		|	""В 1С не найдено распорежение, которому соответствует запись задачи [%1]: строка [%2] счет ДУ [%3], сумма [%4], дата погашения [%5]."" КАК ТекстСообщения
		|ПОМЕСТИТЬ _ОшибкиОпределенияРаспоряжений
		|ИЗ
		|	_ПерваяФормаДополненныеТабличныеДанные КАК _ПерваяФормаДополненныеТабличныеДанные
		|ГДЕ
		|	_ПерваяФормаДополненныеТабличныеДанные.Распоряжение ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи КАК НомерЗадачи,
		|	_ПерваяФормаДополненныеПараметрыЗадач.Статус КАК Статус,
		|	_ПерваяФормаДополненныеПараметрыЗадач.Банк КАК Банк,
		|	_ПерваяФормаДополненныеПараметрыЗадач.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	_ПерваяФормаДополненныеПараметрыЗадач.ВидДоговора КАК ВидДоговора,
		|	_ПерваяФормаДополненныеПараметрыЗадач.Закрыта КАК Закрыта,
		|	_ПерваяФормаДополненныеТабличныеДанные.Распоряжение КАК Распоряжение,
		|	_ПерваяФормаДополненныеТабличныеДанные.КодСчета КАК КодСчета,
		|	_ПерваяФормаДополненныеТабличныеДанные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПерваяФормаДополненныеТабличныеДанные.НомерСтроки КАК НомерСтроки,
		|	_ПерваяФормаДополненныеТабличныеДанные.Сумма КАК Сумма,
		|	_ПерваяФормаДополненныеТабличныеДанные.Ставка КАК Ставка,
		|	_ПерваяФормаДополненныеТабличныеДанные.Срок КАК Срок,
		|	_ПерваяФормаДополненныеТабличныеДанные.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_ПерваяФормаДополненныеТабличныеДанные.ДоВостребования КАК ДоВостребования,
		|	_ПерваяФормаДополненныеТабличныеДанные.ДатаРазмещения КАК ДатаРазмещения,
		|	_ПерваяФормаДополненныеТабличныеДанные.ДатаВозврата КАК ДатаВозврата
		|ПОМЕСТИТЬ _ДанныеПервойФормы
		|ИЗ
		|	_ПерваяФормаДополненныеПараметрыЗадач КАК _ПерваяФормаДополненныеПараметрыЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПерваяФормаДополненныеТабличныеДанные КАК _ПерваяФормаДополненныеТабличныеДанные
		|		ПО _ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи = _ПерваяФормаДополненныеТабличныеДанные.НомерЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиСоответствияДанных КАК _ОшибкиСоответствияДанных
		|		ПО _ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи = _ОшибкиСоответствияДанных.НомерЗадачи
		|ГДЕ
		|	_ОшибкиСоответствияДанных.НомерЗадачи ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОсновныеПараметры.НомерЗадачи КАК НомерЗадачи,
		|	_ОсновныеПараметры.Ключ КАК Ключ,
		|	_ОсновныеПараметры.ДатаРазмещения КАК ДатаРазмещения,
		|	_ОсновныеПараметры.ВидДоговора КАК ВидДоговора,
		|	_ОсновныеПараметры.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	_ОсновныеПараметры.Банк КАК Банк,
		|	_ПерваяФормаДополненныеПараметрыЗадач.Статус КАК Статус_1Ф,
		|	_ДанныеУчетнойСистемы.Распоряжение КАК Распоряжение,
		|	_ДанныеУчетнойСистемы.ПерваяФормаКодУК КАК КодУК_1Ф,
		|	ЕСТЬNULL(_ДанныеУчетнойСистемы.ПерваяФормаКодЮрЛицаБанка, НовыеКодыЮрЛицБанков.Код) КАК КодЮрЛицаБанка_1Ф,
		|	_ДанныеУчетнойСистемы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДанныеУчетнойСистемы.КодСчета КАК КодСчета,
		|	_ДанныеУчетнойСистемы.Сумма КАК Сумма,
		|	_ДанныеУчетнойСистемы.Ставка КАК Ставка,
		|	_ДанныеУчетнойСистемы.Срок КАК Срок,
		|	_ДанныеУчетнойСистемы.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_ДанныеУчетнойСистемы.ДоВостребования КАК ДоВостребования,
		|	_ДанныеУчетнойСистемы.ДатаВозврата КАК ДатаВозврата,
		|	_ДанныеУчетнойСистемы.НомерЗадачи ЕСТЬ NULL КАК ЗафиксироватьНомерТранзакции
		|ПОМЕСТИТЬ _СводныеДанные_1С
		|ИЗ
		|	_ОсновныеПараметры КАК _ОсновныеПараметры
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеУчетнойСистемы КАК _ДанныеУчетнойСистемы
		|		ПО _ОсновныеПараметры.ДатаРазмещения = _ДанныеУчетнойСистемы.ДатаРазмещения
		|			И _ОсновныеПараметры.ВидДоговора = _ДанныеУчетнойСистемы.ВидДоговора
		|			И _ОсновныеПараметры.ЮрЛицоБанка = _ДанныеУчетнойСистемы.ЮрЛицоБанка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПерваяФормаДополненныеПараметрыЗадач КАК _ПерваяФормаДополненныеПараметрыЗадач
		|		ПО _ОсновныеПараметры.НомерЗадачи = _ПерваяФормаДополненныеПараметрыЗадач.НомерЗадачи
		|			И (_ОсновныеПараметры.ВидДоговора = _ДанныеУчетнойСистемы.ВидДоговора)
		|			И (_ОсновныеПараметры.ЮрЛицоБанка = _ДанныеУчетнойСистемы.ЮрЛицоБанка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ТекущаяДата,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|					И Объект В
		|						(ВЫБРАТЬ
		|							_КодыЮрЛицБанков.ЮрЛицоБанка
		|						ИЗ
		|							_КодыЮрЛицБанков КАК _КодыЮрЛицБанков)) КАК НовыеКодыЮрЛицБанков
		|		ПО _ОсновныеПараметры.ЮрЛицоБанка = НовыеКодыЮрЛицБанков.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(_СводныеДанные_1С.ДатаРазмещения, _ДанныеПервойФормы.ДатаРазмещения) КАК ДатаРазмещения,
		|	ЕСТЬNULL(_СводныеДанные_1С.ВидДоговора, _ДанныеПервойФормы.ВидДоговора) КАК ВидДоговора,
		|	ЕСТЬNULL(_СводныеДанные_1С.ЮрЛицоБанка, _ДанныеПервойФормы.ЮрЛицоБанка) КАК ЮрЛицоБанка,
		|	ЕСТЬNULL(_СводныеДанные_1С.Статус_1Ф, _ДанныеПервойФормы.Статус) КАК Статус_1Ф
		|ПОМЕСТИТЬ _Расхождения
		|ИЗ
		|	_СводныеДанные_1С КАК _СводныеДанные_1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеПервойФормы КАК _ДанныеПервойФормы
		|		ПО _СводныеДанные_1С.ДатаРазмещения = _ДанныеПервойФормы.ДатаРазмещения
		|			И _СводныеДанные_1С.ВидДоговора = _ДанныеПервойФормы.ВидДоговора
		|			И _СводныеДанные_1С.КодСчета = _ДанныеПервойФормы.КодСчета
		|			И _СводныеДанные_1С.ЮрЛицоБанка = _ДанныеПервойФормы.ЮрЛицоБанка
		|			И _СводныеДанные_1С.ДатаВозврата = _ДанныеПервойФормы.ДатаВозврата
		|ГДЕ
		|	(ЕСТЬNULL(_СводныеДанные_1С.СчетДоверительногоУправления, """") <> ЕСТЬNULL(_ДанныеПервойФормы.СчетДоверительногоУправления, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.Распоряжение, """") <> ЕСТЬNULL(_ДанныеПервойФормы.Распоряжение, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.Сумма, """") <> ЕСТЬNULL(_ДанныеПервойФормы.Сумма, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.Ставка, """") <> ЕСТЬNULL(_ДанныеПервойФормы.Ставка, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.Срок, """") <> ЕСТЬNULL(_ДанныеПервойФормы.Срок, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.ПериодичностьВыплатыПроцентов, """") <> ЕСТЬNULL(_ДанныеПервойФормы.ПериодичностьВыплатыПроцентов, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.ДоВостребования, """") <> ЕСТЬNULL(_ДанныеПервойФормы.ДоВостребования, """")
		|			ИЛИ ЕСТЬNULL(_СводныеДанные_1С.ДатаРазмещения, """") <> ЕСТЬNULL(_ДанныеПервойФормы.ДатаРазмещения, """"))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_СводныеДанные_1С.НомерЗадачи, _ДанныеПервойФормы.НомерЗадачи) КАК НомерЗадачи,
		|	ЕСТЬNULL(_СводныеДанные_1С.ДатаРазмещения, _ДанныеПервойФормы.ДатаРазмещения) КАК ДатаРазмещения,
		|	ЕСТЬNULL(_СводныеДанные_1С.ВидДоговора, _ДанныеПервойФормы.ВидДоговора) КАК ВидДоговора,
		|	ЕСТЬNULL(_СводныеДанные_1С.ЮрЛицоБанка, _ДанныеПервойФормы.ЮрЛицоБанка) КАК ЮрЛицоБанка,
		|	ЕСТЬNULL(_СводныеДанные_1С.КодСчета, _ДанныеПервойФормы.КодСчета) КАК КодСчета,
		|	ЕСТЬNULL(_СводныеДанные_1С.СчетДоверительногоУправления, _ДанныеПервойФормы.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_СводныеДанные_1С.Распоряжение, _ДанныеПервойФормы.Распоряжение) КАК Распоряжение,
		|	ЕСТЬNULL(_СводныеДанные_1С.Банк, _ДанныеПервойФормы.Банк) КАК Банк,
		|	ЕСТЬNULL(_ДанныеПервойФормы.Закрыта, ЛОЖЬ) КАК Закрыта,
		|	_СводныеДанные_1С.КодУК_1Ф КАК КодУК_1Ф,
		|	_СводныеДанные_1С.КодЮрЛицаБанка_1Ф КАК КодЮрЛицаБанка_1Ф,
		|	_СводныеДанные_1С.Ключ КАК Ключ,
		|	_СводныеДанные_1С.Сумма КАК Сумма,
		|	_СводныеДанные_1С.Ставка КАК Ставка,
		|	_СводныеДанные_1С.Срок КАК Срок,
		|	_СводныеДанные_1С.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_СводныеДанные_1С.ДоВостребования КАК ДоВостребования,
		|	_СводныеДанные_1С.ДатаВозврата КАК ДатаВозврата,
		|	_СводныеДанные_1С.ЗафиксироватьНомерТранзакции КАК ЗафиксироватьНомерТранзакции,
		|	_ДанныеПервойФормы.НомерЗадачи КАК НомерЗадачи_1Ф,
		|	_ДанныеПервойФормы.Статус КАК Статус_1Ф,
		|	_ДанныеПервойФормы.ЮрЛицоБанка КАК ЮрЛицоБанка_1Ф,
		|	_ДанныеПервойФормы.ВидДоговора КАК ВидДоговора_1Ф,
		|	_ДанныеПервойФормы.НомерСтроки КАК НомерСтроки_1Ф,
		|	_ДанныеПервойФормы.Сумма КАК Сумма_1Ф,
		|	_ДанныеПервойФормы.Ставка КАК Ставка_1Ф,
		|	_ДанныеПервойФормы.Срок КАК Срок_1Ф,
		|	_ДанныеПервойФормы.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов_1Ф,
		|	_ДанныеПервойФормы.ДоВостребования КАК ДоВостребования_1Ф,
		|	_ДанныеПервойФормы.ДатаРазмещения КАК ДатаРазмещения_1Ф,
		|	_ДанныеПервойФормы.ДатаВозврата КАК ДатаВозврата_1Ф
		|ПОМЕСТИТЬ _СводнаяТаблица
		|ИЗ
		|	_СводныеДанные_1С КАК _СводныеДанные_1С
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеПервойФормы КАК _ДанныеПервойФормы
		|		ПО _СводныеДанные_1С.ДатаРазмещения = _ДанныеПервойФормы.ДатаРазмещения
		|			И _СводныеДанные_1С.ДатаВозврата = _ДанныеПервойФормы.ДатаВозврата
		|			И _СводныеДанные_1С.ВидДоговора = _ДанныеПервойФормы.ВидДоговора
		|			И _СводныеДанные_1С.КодСчета = _ДанныеПервойФормы.КодСчета
		|			И _СводныеДанные_1С.ЮрЛицоБанка = _ДанныеПервойФормы.ЮрЛицоБанка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Организация КАК Организация,
		|	_СводнаяТаблица.НомерЗадачи КАК НомерЗадачи,
		|	_СводнаяТаблица.ДатаРазмещения КАК ДатаРазмещения,
		|	_СводнаяТаблица.ВидДоговора КАК ВидДоговора,
		|	_СводнаяТаблица.ЮрЛицоБанка КАК ЮрЛицоБанка,
		|	_СводнаяТаблица.КодСчета КАК КодСчета,
		|	_СводнаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СводнаяТаблица.Распоряжение КАК Распоряжение,
		|	_СводнаяТаблица.КодУК_1Ф КАК КодУК_1Ф,
		|	_СводнаяТаблица.КодЮрЛицаБанка_1Ф КАК КодЮрЛицаБанка_1Ф,
		|	_СводнаяТаблица.Ключ КАК Ключ,
		|	_СводнаяТаблица.Банк КАК Банк,
		|	_СводнаяТаблица.Сумма КАК Сумма,
		|	_СводнаяТаблица.Ставка КАК Ставка,
		|	_СводнаяТаблица.Срок КАК Срок,
		|	_СводнаяТаблица.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_СводнаяТаблица.ДоВостребования КАК ДоВостребования,
		|	_СводнаяТаблица.ДатаВозврата КАК ДатаВозврата,
		|	_СводнаяТаблица.ЗафиксироватьНомерТранзакции КАК ЗафиксироватьНомерТранзакции,
		|	_СводнаяТаблица.НомерЗадачи_1Ф КАК НомерЗадачи_1Ф,
		|	ЕСТЬNULL(_СводнаяТаблица.Статус_1Ф, _Расхождения.Статус_1Ф) КАК Статус_1Ф,
		|	_СводнаяТаблица.ЮрЛицоБанка_1Ф КАК ЮрЛицоБанка_1Ф,
		|	_СводнаяТаблица.ВидДоговора_1Ф КАК ВидДоговора_1Ф,
		|	_СводнаяТаблица.НомерСтроки_1Ф КАК НомерСтроки_1Ф,
		|	_СводнаяТаблица.Сумма_1Ф КАК Сумма_1Ф,
		|	_СводнаяТаблица.Ставка_1Ф КАК Ставка_1Ф,
		|	_СводнаяТаблица.Срок_1Ф КАК Срок_1Ф,
		|	_СводнаяТаблица.ПериодичностьВыплатыПроцентов_1Ф КАК ПериодичностьВыплатыПроцентов_1Ф,
		|	_СводнаяТаблица.ДоВостребования_1Ф КАК ДоВостребования_1Ф,
		|	_СводнаяТаблица.ДатаРазмещения_1Ф КАК ДатаРазмещения_1Ф,
		|	_СводнаяТаблица.ДатаВозврата_1Ф КАК ДатаВозврата_1Ф,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_Расхождения.Статус_1Ф, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА _СводнаяТаблица.НомерЗадачи ЕСТЬ NULL
		|						ТОГДА 0
		|					КОГДА _СводнаяТаблица.Закрыта
		|						ТОГДА 3
		|					ИНАЧЕ 2
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	_СводнаяТаблица КАК _СводнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Расхождения КАК _Расхождения
		|		ПО _СводнаяТаблица.ДатаРазмещения = _Расхождения.ДатаРазмещения
		|			И _СводнаяТаблица.ВидДоговора = _Расхождения.ВидДоговора
		|			И _СводнаяТаблица.ЮрЛицоБанка = _Расхождения.ЮрЛицоБанка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки_1Ф
		|ИТОГИ ПО
		|	Банк,
		|	ДатаРазмещения,
		|	ВидДоговора";
#КонецОбласти
	
	Запрос.УстановитьПараметр("ПараметрыЗадач", ПриемникДанных.ПараметрыЗадач);
	Запрос.УстановитьПараметр("ТабличныеДанные", ПриемникДанных.ТабличныеДанные); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиСоответствияДанных"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОшибок.Следующий() Цикл
		ЭтаФорма.ДопСвойства.Ошибки.Добавить(СтрШаблон(ВыборкаОшибок.ТекстСообщения, ВыборкаОшибок.НомерЗадачи, ВыборкаОшибок.Параметр));  	
	КонецЦикла;
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиОпределенияРаспоряжений"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОшибок.Следующий() Цикл
		ЭтаФорма.ДопСвойства.Ошибки.Добавить(СтрШаблон(ВыборкаОшибок.ТекстСообщения, ВыборкаОшибок.НомерЗадачи, ВыборкаОшибок.П2, ВыборкаОшибок.П3, ВыборкаОшибок.П4, Формат(ВыборкаОшибок.П5, "ДФ=dd.MM.yyyy")));  	
	КонецЦикла;
	
	ВыборкаГруппировкаПоБанку = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппировкаПоБанку.Следующий() Цикл
		
		ВыборкаГруппировкаПоДатеРазмещения = ВыборкаГруппировкаПоБанку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруппировкаПоДатеРазмещения.Следующий() Цикл
			
			ВыборкаГруппировкаПоВидуДоговора = ВыборкаГруппировкаПоДатеРазмещения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГруппировкаПоВидуДоговора.Следующий() Цикл
				
				ВыборкаДетальныхЗаписей = ВыборкаГруппировкаПоВидуДоговора.Выбрать(); 	
		
				НомерСтроки = 1;
				
				Пока ВыборкаДетальныхЗаписей.Следующий() Цикл 
								
					Если НомерСтроки = 1 Тогда
		
						СтрокаПараметрыЗадач = ЭтаФорма.ПараметрыЗадач.Добавить();
						СтрокаПараметрыЗадач.СтатусКартинка = ВыборкаДетальныхЗаписей.Статус;
						СтрокаПараметрыЗадач.ДатаРазмещения = ВыборкаДетальныхЗаписей.ДатаРазмещения;
						СтрокаПараметрыЗадач.Банк = ВыборкаДетальныхЗаписей.Банк; 
						СтрокаПараметрыЗадач.ВидДоговора = ВыборкаДетальныхЗаписей.ВидДоговора;
						СтрокаПараметрыЗадач.НомерЗадачи = ВыборкаДетальныхЗаписей.НомерЗадачи;
						СтрокаПараметрыЗадач.СтатусПервойФормы = ВыборкаДетальныхЗаписей.Статус_1Ф;
	
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаДетальныхЗаписей.Распоряжение) Тогда

						СформироватьДанныеДляЭкспорта(СтрокаПараметрыЗадач, ВыборкаДетальныхЗаписей);

						НоваяСтрокаДанныеРаспоряжений = СтрокаПараметрыЗадач.ДанныеРаспоряжений.Добавить();
						НоваяСтрокаДанныеРаспоряжений.Статус = ВыборкаДетальныхЗаписей.Статус;
						НоваяСтрокаДанныеРаспоряжений.СчетДоверительногоУправления = ВыборкаДетальныхЗаписей.СчетДоверительногоУправления;
						НоваяСтрокаДанныеРаспоряжений.КодСчета = ВыборкаДетальныхЗаписей.КодСчета;
			            НоваяСтрокаДанныеРаспоряжений.Сумма = ВыборкаДетальныхЗаписей.Сумма;
			            НоваяСтрокаДанныеРаспоряжений.Ставка = ВыборкаДетальныхЗаписей.Ставка;
			            НоваяСтрокаДанныеРаспоряжений.Срок = ВыборкаДетальныхЗаписей.Срок;
			            НоваяСтрокаДанныеРаспоряжений.ПериодичностьВыплатыПроцентов = ВыборкаДетальныхЗаписей.ПериодичностьВыплатыПроцентов;
						НоваяСтрокаДанныеРаспоряжений.ДоВостребования = ВыборкаДетальныхЗаписей.ДоВостребования;
			            НоваяСтрокаДанныеРаспоряжений.ДатаВозврата = ВыборкаДетальныхЗаписей.ДатаВозврата;
						НоваяСтрокаДанныеРаспоряжений.Распоряжение = ВыборкаДетальныхЗаписей.Распоряжение; 
												
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаДетальныхЗаписей.НомерЗадачи_1Ф) Тогда
						
						НоваяСтрокаДанныеПервойФормы = СтрокаПараметрыЗадач.ТабличныеДанныеПервойФормы.Добавить();
						НоваяСтрокаДанныеПервойФормы.Статус = ВыборкаДетальныхЗаписей.Статус;
						НоваяСтрокаДанныеПервойФормы.СчетДоверительногоУправления = ВыборкаДетальныхЗаписей.СчетДоверительногоУправления;
						НоваяСтрокаДанныеПервойФормы.КодСчета = ВыборкаДетальныхЗаписей.КодСчета;
			            НоваяСтрокаДанныеПервойФормы.Сумма = ВыборкаДетальныхЗаписей.Сумма_1Ф;
			            НоваяСтрокаДанныеПервойФормы.Ставка = ВыборкаДетальныхЗаписей.Ставка_1Ф;
			            НоваяСтрокаДанныеПервойФормы.Срок = ВыборкаДетальныхЗаписей.Срок_1Ф;
			            НоваяСтрокаДанныеПервойФормы.ПериодичностьВыплатыПроцентов = ВыборкаДетальныхЗаписей.ПериодичностьВыплатыПроцентов_1Ф;
						НоваяСтрокаДанныеПервойФормы.ДоВостребования = ВыборкаДетальныхЗаписей.ДоВостребования_1Ф;
						НоваяСтрокаДанныеПервойФормы.ДатаРазмещения = ВыборкаДетальныхЗаписей.ДатаРазмещения_1Ф;
			            НоваяСтрокаДанныеПервойФормы.ДатаВозврата = ВыборкаДетальныхЗаписей.ДатаВозврата_1Ф;
						
					КонецЕсли;
					
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если НоваяСессия Тогда	
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СоздатьСтруктуруДляИмпортаДанных()
	
	ПараметрыЗадач = Новый ТаблицаЗначений;
	ПараметрыЗадач.Колонки.Добавить("НомерЗадачи", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ПараметрыЗадач.Колонки.Добавить("КодУК", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ПараметрыЗадач.Колонки.Добавить("КодБанка", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ПараметрыЗадач.Колонки.Добавить("ВидДоговора", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	ПараметрыЗадач.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ПараметрыЗадач.Колонки.Добавить("Закрыта", Новый ОписаниеТипов("Булево"));
	ПараметрыЗадач.Колонки.Добавить("ЕстьОшибки",Новый ОписаниеТипов("Булево"));
	
	ТабличныеДанные = Новый ТаблицаЗначений;
	ТабличныеДанные.Колонки.Добавить("НомерЗадачи", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ТабличныеДанные.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0)));
	ТабличныеДанные.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));	
	ТабличныеДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип.Типы()));
	ТабличныеДанные.Колонки.Добавить("Ставка", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ПроцентнаяСтавка.Тип.Типы()));
	ТабличныеДанные.Колонки.Добавить("Срок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0)));
	ТабличныеДанные.Колонки.Добавить("ПериодичностьВыплатыПроцентов", Новый ОписаниеТипов("ПеречислениеСсылка.ПериодичностиВыплатыПроцентов"));
	ТабличныеДанные.Колонки.Добавить("ДоВостребования", Новый ОписаниеТипов("Булево"));
	ТабличныеДанные.Колонки.Добавить("ДатаРазмещения", Новый ОписаниеТипов("Дата"));
	ТабличныеДанные.Колонки.Добавить("ДатаВозврата", Новый ОписаниеТипов("Дата"));
	
	Возврат Новый Структура("ПараметрыЗадач, ТабличныеДанные", ПараметрыЗадач, ТабличныеДанные); 
	
КонецФункции 

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПервойФормы(ПриемникДанных, ПараметрыПодключения, МассивНомеровЗадач, ТаблицаЮрЛицБанков, Ошибки) 
		
#Область Задачи		
	Для Каждого НомерЗадачи Из  МассивНомеровЗадач Цикл
		
		ПараметрыЗадачНоваяСтрока = ПриемникДанных.ПараметрыЗадач.Добавить();
		ПараметрыЗадачНоваяСтрока.НомерЗадачи = НомерЗадачи;
		
		ТелоЗапроса = ПолучитьЗаписьJSON(Новый Структура("taskId, selectedInfoParts", НомерЗадачи, РаботаСКоллекциями.ЗначениеВМассив("ExtParams")));
		
		ТекстСообщения = "Не удалось получить данные по номеру задачи [" + НомерЗадачи + "]";
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks", ТелоЗапроса, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ПараметрыЗадачНоваяСтрока.ЕстьОшибки = Истина;
			Ошибки.Добавить(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		ОбъектЗадача_1Ф = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));	
		
		Если Не (ОбъектЗадача_1Ф.Свойство("subcatID") И ОбъектЗадача_1Ф.subcatID = 524) Тогда
			ПараметрыЗадачНоваяСтрока.ЕстьОшибки = Истина;
			Ошибки.Добавить("Ошибка получения данных из 1-ой формы. По номеру [" + НомерЗадачи + "] найдена задача с категорией [" + ОбъектЗадача_1Ф.subcatDescription + "].");
			Продолжить;	
		КонецЕсли; 
		
		ПараметрыЗадачНоваяСтрока.Закрыта = ОбъектЗадача_1Ф.isClosed;
		ПараметрыЗадачНоваяСтрока.Статус = ОбъектЗадача_1Ф.stateDescription;

		Для Каждого ТекПараметр Из ОбъектЗадача_1Ф.extParams Цикл 
			
			Если ТекПараметр.id = 51 Тогда
				
				ПараметрыЗадачНоваяСтрока.КодУК = Формат(ТекПараметр.value.taskId, "ЧГ=0");
				
			ИначеЕсли ТекПараметр.id = 410 Тогда
				
				ПараметрыЗадачНоваяСтрока.КодБанка = Формат(ТекПараметр.value.taskId, "ЧГ=0"); 
				
			ИначеЕсли ТекПараметр.id = 1538 Тогда
				
				ПараметрыЗадачНоваяСтрока.ВидДоговора = ТекПараметр.value.value;  //Разовый договор, Ген. соглашение 
				
			ИначеЕсли ТекПараметр.id = 1539 И ТекПараметр.value.values.Количество() > 0 Тогда
				
				ТабличныеДанныеНоваяСтрока = ПриемникДанных.ТабличныеДанные.Добавить();
				ТабличныеДанныеНоваяСтрока.НомерЗадачи = НомерЗадачи;
				ТабличныеДанныеНоваяСтрока.НомерСтроки = 1;
				
				Для Каждого ПараметрТабЧасти Из ТекПараметр.value.values Цикл
					
					Если ПараметрТабЧасти.rowId <> ТабличныеДанныеНоваяСтрока.НомерСтроки Тогда 
						
						Если ЗначениеЗаполнено(ТабличныеДанныеНоваяСтрока.ДатаРазмещения) Тогда
							ТабличныеДанныеНоваяСтрока = ПриемникДанных.ТабличныеДанные.Добавить();
						КонецЕсли;
						
						ТабличныеДанныеНоваяСтрока.НомерЗадачи = НомерЗадачи;
						ТабличныеДанныеНоваяСтрока.НомерСтроки = ПараметрТабЧасти.rowId; 
								
					КонецЕсли;
											
					Если ПараметрТабЧасти.columnId = 183 Тогда
						
						ТабличныеДанныеНоваяСтрока.Сумма = Число(СтрЗаменить(ПараметрТабЧасти.value, " ", ""));
					
					ИначеЕсли ПараметрТабЧасти.columnId = 184 Тогда
						
						ТабличныеДанныеНоваяСтрока.Ставка = Число(СтрЗаменить(ПараметрТабЧасти.value, " ", ""));
						
					ИначеЕсли ПараметрТабЧасти.columnId = 185 Тогда
						
						ТабличныеДанныеНоваяСтрока.Срок = Число(СтрЗаменить(ПараметрТабЧасти.value, " ", ""));
		
					ИначеЕсли ПараметрТабЧасти.columnId = 186 Тогда
						
						ТабличныеДанныеНоваяСтрока.ПериодичностьВыплатыПроцентов = ПолучитьВариантПериодичностиВыплатыПроцентов(ПараметрТабЧасти.value.value); //В конце срока/ Ежемесечно/ Авансом/ Иное
						
						Если ТабличныеДанныеНоваяСтрока.ПериодичностьВыплатыПроцентов = Неопределено Тогда
							ПараметрыЗадачНоваяСтрока.ЕстьОшибки = Истина;
							Ошибки.Добавить("Не удалось определить периодичность выплаты процентов на основании данных первой формы [" + ПараметрТабЧасти.value.value + "]");
                        Конецесли;
						
					ИначеЕсли ПараметрТабЧасти.columnId = 187 Тогда 
						
						ТабличныеДанныеНоваяСтрока.ДоВостребования = ПараметрТабЧасти.value.value; //Да/Нет
						
					ИначеЕсли ПараметрТабЧасти.columnId = 188 Тогда
						
						ТабличныеДанныеНоваяСтрока.ДатаРазмещения = Дата(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(ПараметрТабЧасти.value));
						
					ИначеЕсли ПараметрТабЧасти.columnId = 189 Тогда
						
						ТабличныеДанныеНоваяСтрока.ДатаВозврата = Дата(РаботаСоСтрокамиКлиентСервер.ОставитьТолькоЦифрыВСтроке(ПараметрТабЧасти.value));
						
					ИначеЕсли ПараметрТабЧасти.columnId = 346 Тогда
						
	                	ТабличныеДанныеНоваяСтрока.КодСчета = ПараметрТабЧасти.value;
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;	

	КонецЦикла;
#КонецОбласти

#Область Банки
	ТекстЗапроса = "/api-core/datasource/Subcat/41/data"; 
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 10);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("tasksState", "isOpened");
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam588", Новый Структура("filterType, type, filter", "text", "equals")));
	
    //ищем банк по коду матрикс (категория задач в 1Ф = 41, ID параметра 588)
	Для Каждого Строка Из ТаблицаЮрЛицБанков Цикл
	
		ТекстСообщения = "Не удалось получить код первой формы юр. лица [" + Строка.ЮрЛицоБанка + "] по коду матрикс [" + Строка.КодМатрикс + "]."; 
	
		СтруктураЗапроса.filterModel.ExtParam588.filter = Строка.КодМатрикс; 
				
		ТелоЗапроса = ПолучитьЗаписьJSON(СтруктураЗапроса);
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, ТелоЗапроса, ТекстСообщения);

		Если HTTPОтвет = Неопределено Тогда
			Ошибки.Добавить(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		РезультатЗапроса = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8")); 
		
		Если Не (РезультатЗапроса.Свойство("totalCount") И РезультатЗапроса.Свойство("tasksDataSourceResponse") И РезультатЗапроса.totalCount = 1) Тогда
			Ошибки.Добавить(ТекстСообщения);
			Продолжить;
		КонецЕсли; 
				
		НомерЗадачи = Формат(РезультатЗапроса.tasksDataSourceResponse[0].taskId, "ЧГ=0");

		УстановитьПривилегированныйРежим(Истина);
				
		Попытка
			
			ЗаписьРегистра = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.Период         = Дата(1980, 1, 1);
			ЗаписьРегистра.ВнешняяСистема = Справочники.ВнешниеСистемы.ПерваяФорма;
			ЗаписьРегистра.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица;
			ЗаписьРегистра.Объект         = Строка.ЮрЛицоБанка;
			ЗаписьРегистра.Код            = НомерЗадачи;

			ЗаписьРегистра.Записать(); 
							
		Исключение
			
			Ошибки.Добавить("Не удалось записать код [" + НомерЗадачи  + "] внешней системы [1Ф] юр лица [" + Строка.ЮрЛицоБанка + "].");
			Продолжить;
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
	
#КонецОбласти
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьДанныеДляЭкспорта(СтрокаТаблицы, Выборка)
	
	Если СтрокаТаблицы.ДанныеДляЭкспорта = Неопределено Тогда
		
		ДанныеДляЭкспорта = Новый Структура("ОсновнаяЧасть, ТабличнаяЧасть, Ключ, Распоряжения");
		
		ТекстЗадачи = "УК: " + Выборка.Организация 
					+ ", банк: " + Выборка.Банк 
					+ ", дата размещения: " + Формат(Выборка.ДатаРазмещения, "ДФ=dd.MM.yyyy") 
					+ ", вид договора: " + Выборка.ВидДоговора + ".";

		МассивПараметров = Новый Массив();
				
		МассивПараметров.Добавить(Новый Структура("id, value", 51, Выборка.КодУК_1Ф));
		МассивПараметров.Добавить(Новый Структура("id, value", 410, Выборка.КодЮрЛицаБанка_1Ф));
		МассивПараметров.Добавить(Новый Структура("id, value", 1538, Выборка.ВидДоговора));
						
		Если ЗначениеЗаполнено(Выборка.Ключ) Тогда
			КлючЗадачи = Выборка.Ключ;	
		Иначе
			
			КлючЗадачи = Новый Структура("bank_id, start_date, contract_type"
				,Выборка.КодЮрЛицаБанка_1Ф
				,Формат(Выборка.ДатаРазмещения, "ДФ=гггг-ММ-дд")
				,Выборка.ВидДоговора);
				
			КлючЗадачи = ПолучитьЗаписьJSON(КлючЗадачи);
			
		КонецЕсли;
		
		ПараметрыЗадачи = Новый Структура();
		ПараметрыЗадачи.Вставить("subcatId", 524);
		ПараметрыЗадачи.Вставить("userToMakeOwnerId", 3686); 
		ПараметрыЗадачи.Вставить("priorityId", 3); 
		ПараметрыЗадачи.Вставить("taskText", ТекстЗадачи); 
		ПараметрыЗадачи.Вставить("orderedTime", Формат(Выборка.ДатаРазмещения, "ДФ=гггг-ММ-дд") + "T18:00:00"); 
		ПараметрыЗадачи.Вставить("extParams", МассивПараметров); 
		
		ДанныеДляЭкспорта.ОсновнаяЧасть = ПараметрыЗадачи;
		ДанныеДляЭкспорта.Ключ = КлючЗадачи;
		ДанныеДляЭкспорта.ТабличнаяЧасть = Новый Массив;
		ДанныеДляЭкспорта.Распоряжения = Новый Массив;
		
	Иначе
		ДанныеДляЭкспорта = СтрокаТаблицы.ДанныеДляЭкспорта;
	КонецЕсли;
	
	МассивПараметровСтроки = Новый Массив;
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 182, Строка(Выборка.СчетДоверительногоУправления)));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 183, Выборка.Сумма));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 184, Выборка.Ставка));  
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 185, Выборка.Срок)); 
	МассивПараметровСтроки.Добавить(Новый Структура("id, value, dataSourceItemId", 186, Строка(Выборка.ПериодичностьВыплатыПроцентов), Строка(Выборка.ПериодичностьВыплатыПроцентов)));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value, dataSourceItemId", 187, Строка(Выборка.ДоВостребования), Строка(Выборка.ДоВостребования)));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 188, Формат(Выборка.ДатаРазмещения, "ДФ=гггг-ММ-дд")));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 189, Формат(Выборка.ДатаВозврата, "ДФ=гггг-ММ-дд")));
	МассивПараметровСтроки.Добавить(Новый Структура("id, value", 346, Формат(Выборка.КодСчета, "ДФ=гггг-ММ-дд")));

	ДанныеДляЭкспорта.ТабличнаяЧасть.Добавить(Новый Структура("id, modifyType, cols", 0, "create", МассивПараметровСтроки));
 	ДанныеДляЭкспорта.Распоряжения.Добавить(Новый Структура("Ссылка, ЗафиксироватьНомерТранзакции", Выборка.Распоряжение, Выборка.ЗафиксироватьНомерТранзакции));
	
	СтрокаТаблицы.ДанныеДляЭкспорта = ДанныеДляЭкспорта; 
				
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДесериализоватьJSON(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьЗаписьJSON(СтруктураДанных)
	
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВариантПериодичностиВыплатыПроцентов(Значение)
	
	Если Значение = "В конце срока" Тогда
		Возврат Перечисления.ПериодичностиВыплатыПроцентов.ВКонцеСрока;
	ИначеЕсли Значение = "Ежемесячно" Тогда
		Возврат Перечисления.ПериодичностиВыплатыПроцентов.Ежемесячно;
	ИначеЕсли Значение = "Авансом" Тогда
		Возврат Перечисления.ПериодичностиВыплатыПроцентов.Авансом
	Иначе
		Возврат Неопределено;
	КонецЕсли;
			
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	СообщитьОбОшибках();
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьИзменитьЗадачиНаСервере(МассивДанных)
	
	//Начало сессии
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ПараметрыСессии = Новый Структура("Организация, Сервер", ЭтаФорма.Организация, ЭтаФорма.Сервер_1Ф);
		
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектНаСервере,, ПараметрыСессии);
	
	Механизм = ОбъектНаСервере.Метаданные().ПолноеИмя() + ".Форма.СозданиеЗадачДляПервойФормы.СоздатьИзменитьЗадачиНаСервере().";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения(ЭтаФорма.Сервер_1Ф);
	
	Если ПараметрыПодключения = Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, "Ошибка подключения к первой форме.");
		Возврат;
	КонецЕсли; 
	
	РезультатВыполнения = Новый Массив;

	Для Каждого ТекЗапись Из МассивДанных Цикл 
				
		//Создаем задачу.				
		Если ТекЗапись.Статус = 0 Тогда 
			
			Распоряжения = Новый Массив;
			
			Для Каждого ТекРаспоряжение Из ТекЗапись.ДанныеДляЭкспорта.Распоряжения Цикл
				Распоряжения.Добавить(ТекРаспоряжение.Ссылка);	
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Распоряжение.Ссылка КАК Субъект,
				|	ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма) КАК ВнешняяСистема
				|ИЗ
				|	Документ.Распоряжение КАК Распоряжение
				|ГДЕ
				|	Распоряжение.Ссылка В (&Распоряжения)";
			
			Запрос.УстановитьПараметр("Распоряжения", Распоряжения);
			РезультатЗапроса = Запрос.Выполнить();
			
			НачатьТранзакцию();
			
			БлокировкаДанных = Новый БлокировкаДанных;
			
			БлокировкаНомеровТранзакций = БлокировкаДанных.Добавить("РегистрСведений.НомераТранзакций");
			БлокировкаНомеровТранзакций.ИсточникДанных = РезультатЗапроса;
			БлокировкаНомеровТранзакций.ИспользоватьИзИсточникаДанных("Субъект", "Субъект");
			БлокировкаНомеровТранзакций.ИспользоватьИзИсточникаДанных("ВнешняяСистема", "ВнешняяСистема");
			БлокировкаНомеровТранзакций.Режим = РежимБлокировкиДанных.Исключительный;
			
			БлокировкаДанных.Заблокировать(); 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НомераТранзакций.Субъект КАК Субъект
				|ИЗ
				|	РегистрСведений.НомераТранзакций КАК НомераТранзакций
				|ГДЕ
				|	НомераТранзакций.Субъект В (&Распоряжения)
				|	И НомераТранзакций.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФорма)";
			
			Запрос.УстановитьПараметр("Распоряжения", Распоряжения);
			
			Если Не Запрос.Выполнить().Пустой() Тогда
				Продолжить;	
			КонецЕсли;
			
			ТекстСообщения = "Ошибка постановки задачи в первой форме.";   
			 	
			ТабличнаяЧасть = СтрЗаменить(ПолучитьЗаписьJSON(Новый Структура("rows", ТекЗапись.ДанныеДляЭкспорта.ТабличнаяЧасть)), """", "\" + """");	

			ТекЗапись.ДанныеДляЭкспорта.ОсновнаяЧасть.extParams.Добавить(Новый Структура("id, value", 1539, ТабличнаяЧасть));
			
			ТелоЗапроса = ПолучитьЗаписьJSON(ТекЗапись.ДанныеДляЭкспорта.ОсновнаяЧасть);
			ТелоЗапроса = СтрЗаменить(ТелоЗапроса, "\\", "");
  
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтаФорма.УникальныйИдентификатор);   
				Продолжить;
			КонецЕсли;
			
			ОтветОбъект = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
 
			НомерЗадачи = Формат(ОтветОбъект.data.value, "ЧГ=0");
				
			Если ПустаяСтрока(НомерЗадачи) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка постановки задачи. Отсутствует номер задачи в первой форме.", ЭтаФорма.УникальныйИдентификатор);
				Продолжить;
				
			ИначеЕсли Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(НомерЗадачи) Тогда	
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка постановки задачи. Не удалось получить номер задачи. Ответ первой формы [" + НомерЗадачи + "]", ЭтаФорма.УникальныйИдентификатор);
				Продолжить;
				
			Иначе
				
				ОшибкаЗаписиНомераТранзакции = Ложь;
				
				Для Каждого ТекРаспоряжение Из ТекЗапись.ДанныеДляЭкспорта.Распоряжения Цикл
		
					Если Не ТекРаспоряжение.ЗафиксироватьНомерТранзакции Тогда
						Продолжить;
					КонецЕсли;
						
					Если Не РегистрыСведений.НомераТранзакций.ЗаписатьНомер(НомерЗадачи, Справочники.ВнешниеСистемы.ПерваяФорма, ТекРаспоряжение.Ссылка, ТекЗапись.ДанныеДляЭкспорта.Ключ) Тогда 
						ОшибкаЗаписиНомераТранзакции = Истина;
						Прервать;
					КонецЕсли;

				КонецЦикла;
				
				Если ОшибкаЗаписиНомераТранзакции Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать номер задачи [" + НомерЗадачи + "] в регистр [Номера транзакций]" + Символы.ПС + ОписаниеОшибки(), ЭтаФорма.УникальныйИдентификатор);
					ОтменитьТранзакцию();
		
					Продолжить;

				Иначе 	
					ЗафиксироватьТранзакцию();
					РезультатВыполнения.Добавить(НомерЗадачи + " (Создана)");
				КонецЕсли;
						
			КонецЕсли;
						
		ИначеЕсли ТекЗапись.Статус = 1 Тогда 
			
			//Удаление таб. части. Первый этап изменения данных.			
			НомерЗадачи = ТекЗапись.НомерЗадачи;
			
			//1539 - id реквизита таб. части (Депозитные сделки) в первой форме.
			ТекстЗапроса = "/app/v1.2/api/task/" + НомерЗадачи + "/ep/table/1539/erase?v=1.2&api_key=EpTable";
			ТекстСообщения = "Не удалось изменить данные в задаче [" + НомерЗадачи + "]. Ошибка предварительного удаления старых данных.";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса,, ТекстСообщения); 
		
			Если HTTPОтвет = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтаФорма.УникальныйИдентификатор);
				Продолжить;
			КонецЕсли;
			
			//Запись новых данных таб. части.	
			ТекстЗапроса = "/app/v1.2/api/task/" + НомерЗадачи + "/ep/table/1539/update?v=1.2&api_key=EpTable";
			ТекстСообщения = "Ошибка записи данных табличной части задачи [" + НомерЗадачи + "].";
						
			ТелоЗапроса = ПолучитьЗаписьJSON(Новый Структура("rows", ТекЗапись.ДанныеДляЭкспорта.ТабличнаяЧасть));
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, ТекстЗапроса, ТелоЗапроса, ТекстСообщения);

			Если HTTPОтвет = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтаФорма.УникальныйИдентификатор);
				Продолжить;
			Иначе
				
				РезультатВыполнения.Добавить(НомерЗадачи + " (Изменена)");
				
				НачатьТранзакцию(); 
					
				ОшибкаЗаписиНомераТранзакции = Ложь;
				
				Для Каждого ТекРаспоряжение Из ТекЗапись.ДанныеДляЭкспорта.Распоряжения Цикл
		
					Если Не ТекРаспоряжение.ЗафиксироватьНомерТранзакции Тогда
						Продолжить;
					КонецЕсли;
						
					Если Не РегистрыСведений.НомераТранзакций.ЗаписатьНомер(НомерЗадачи, Справочники.ВнешниеСистемы.ПерваяФорма, ТекРаспоряжение.Ссылка, ТекЗапись.ДанныеДляЭкспорта.Ключ) Тогда 
						ОшибкаЗаписиНомераТранзакции = Истина;
						Прервать;
					КонецЕсли;

				КонецЦикла;
				
				Если ОшибкаЗаписиНомераТранзакции Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать номер задачи [" + НомерЗадачи + "] в регистр [Номера транзакций]" + Символы.ПС + ОписаниеОшибки(), ЭтаФорма.УникальныйИдентификатор);
					ОтменитьТранзакцию();

				Иначе 	
					ЗафиксироватьТранзакцию();
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьНаСервере(ПараметрыПодключения);
	
	РезультатВыполнения = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(РезультатВыполнения, ",");
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("РезультатВыполнения", РезультатВыполнения));

КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибках()
		
	Если ТипЗнч(ЭтаФорма.ДопСвойства) = Тип("Структура") И ЭтаФорма.ДопСвойства.Свойство("Ошибки") Тогда
		
		Для Каждого ТекОшибка Из ЭтаФорма.ДопСвойства.Ошибки Цикл 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекОшибка, ЭтаФорма.УникальныйИдентификатор);	
		КонецЦикла;

	ИначеЕсли ЭтаФорма.ПараметрыЗадач.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для создания задач в первой форме.", ЭтаФорма.УникальныйИдентификатор);		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменитьЗадачи(Команда)
		
	МассивДанных = Новый Массив;                                       
	
	Для Каждого СтрокаПараметров Из ЭтаФорма.ПараметрыЗадач Цикл
		
		Если СтрокаПараметров.Флажок И Элементы.ПараметрыЗадач.ПроверитьСтроку(СтрокаПараметров.ПолучитьИдентификатор())
			И (СтрокаПараметров.СтатусКартинка = 0 Или СтрокаПараметров.СтатусКартинка = 1 И ЗначениеЗаполнено(СтрокаПараметров.НомерЗадачи)) Тогда
			
			МассивДанных.Добавить(Новый Структура("ДанныеДляЭкспорта, Статус, НомерЗадачи", СтрокаПараметров.ДанныеДляЭкспорта, СтрокаПараметров.СтатусКартинка, СтрокаПараметров.НомерЗадачи));
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если МассивДанных.Количество() > 0 Тогда 
		
		СоздатьИзменитьЗадачиНаСервере(МассивДанных);
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите строки из таблицы параметров для создания (изменения) задач в первой форме.");		
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	
	УстановитьЗначенияФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	УстановитьЗначенияФлажков(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияФлажков(Значение)
	
	Для Каждого СтрокаТаблицы Из ЭтаФорма.ПараметрыЗадач Цикл
		
		Если Значение = Ложь Тогда
			СтрокаТаблицы.Флажок = Значение;	
		Иначе
			
			Если Элементы.ПараметрыЗадач.ПроверитьСтроку(СтрокаТаблицы.ПолучитьИдентификатор())
				И (СтрокаТаблицы.СтатусКартинка = 0 Или СтрокаТаблицы.СтатусКартинка = 1) Тогда 
				
				СтрокаТаблицы.Флажок = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗадачПередНачаломИзменения(Элемент, Отказ)
	
	ТаблицаОбработкаНажатия(Элемент, Отказ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПараметрыЗадачДанныеРаспоряженийПередНачаломИзменения(Элемент, Отказ)
	ТаблицаОбработкаНажатия(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗадачТабличныеДанныеПервойФормыПередНачаломИзменения(Элемент, Отказ)
	ТаблицаОбработкаНажатия(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбработкаНажатия(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
		
	Если Не (ТекущиеДанные = Неопределено Или Элемент.ТекущийЭлемент = Неопределено) Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачФлажок" Тогда
			Возврат;
		Конецесли;
		
		СтандартнаяОбработка = Ложь;
		
		Если (Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачНомерЗадачи" Или Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачСтатус") И ЗначениеЗаполнено(ТекущиеДанные.НомерЗадачи) Тогда
			
			ЗапуститьПриложение("http://" + ЭтаФорма.Сервер_1Ф + "/maintaskform.aspx?TaskID=" + ТекущиеДанные.НомерЗадачи + "");
							
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачДанныеРаспоряженийСчетДоверительногоУправления" 
			Или Элемент.ТекущийЭлемент.Имя = "ТабличныеДанныеПервойФормыСчетДоверительногоУправления" Тогда 
			
			ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
			
		ИначеЕсли СтрНайти(Элемент.ТекущийЭлемент.Имя, "ПараметрыЗадачДанныеРаспоряжений") > 0 Тогда
			
			ОткрытьЗначение(ТекущиеДанные.Распоряжение);	
			
		КонецЕсли;
		
		Отказ = Истина;			
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗадачПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ЭтаФорма.Элементы.НомерЗадачи.Заголовок = ?(ЗначениеЗаполнено(ТекущиеДанные.НомерЗадачи), "#" + ТекущиеДанные.НомерЗадачи, "");
		
		ТекстЗаголовка = "" + ТекущиеДанные.Банк + ", дата размещения " + Формат(ТекущиеДанные.ДатаРазмещения, "ДФ=dd.MM.yyyy") + ", вид договора " + ТекущиеДанные.ВидДоговора;
		
		Если ЭтаФорма.Элементы.ОписаниеПараметров.Заголовок <> ТекстЗаголовка Тогда

			ЭтаФорма.Элементы.ОписаниеПараметров.Заголовок = ТекстЗаголовка;
			
		Иначе
				
			Если Элемент.ТекущийЭлемент <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.НомерЗадачи)
				И (Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачНомерЗадачи" Или Элемент.ТекущийЭлемент.Имя = "ПараметрыЗадачСтатус") Тогда
				
				ЗапуститьПриложение("http://" + ЭтаФорма.Сервер_1Ф + "/maintaskform.aspx?TaskID=" + ТекущиеДанные.НомерЗадачи + "");
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры