
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаСписка" Тогда
		
		// Подчиненные значениям справочников формы приходят с отбором
		
		Если Параметры.Свойство("Отбор")
			И Параметры.Отбор.Свойство("ЦеннаяБумага")
			И ЗначениеЗаполнено(Параметры.Отбор.ЦеннаяБумага)
		Тогда
		
			СтандартнаяОбработка = Ложь;	
			
			ВыбраннаяФорма = Метаданные.РегистрыСведений.АналогиЦенныхБумаг.Формы.ФормаАналоговЦеннойБумаги;
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСвязанныеСчетаДоверительногоУправления(НаборЗаписей) Экспорт

	// для Аналогов получаем счета клиента, у которых на остатках есть эта бумага
	
	СвязанныеСчетаДоверительногоУправления = Новый Массив;

	ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить(, "Клиент, Организация, Период, ЦеннаяБумага");
	
	ГруппыНаборов = ТаблицаНабораЗаписей.Скопировать(, "Клиент, Организация, Период");
	ГруппыНаборов.Свернуть("Клиент, Организация, Период");
	
	БумагиНаборов = ТаблицаНабораЗаписей.Скопировать(, "Клиент, Организация, Период, ЦеннаяБумага");
	БумагиНаборов.Свернуть("Клиент, Организация, Период, ЦеннаяБумага");
	БумагиНаборов.Индексы.Добавить("Клиент, Организация, Период");
	
	Для Каждого Группа Из ГруппыНаборов Цикл
		
		БумагиГруппы = БумагиНаборов.Скопировать(Новый Структура("Клиент, Организация, Период", Группа.Клиент, Группа.Организация, Группа.Период), "ЦеннаяБумага");
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ИмяВременнойТаблицыЦенныхБумагКлиента = РаботаСЦеннымиБумагами.ПолучитьЦенныеБумагиКлиента(Группа.Клиент, Группа.Организация, КонецДня(Группа.Период), , , Истина, Истина, , МенеджерВременныхТаблиц);
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ЦенныеБумагиКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	&ЦенныеБумагиКлиента КАК _ЦенныеБумагиКлиента
			|ГДЕ
			|	_ЦенныеБумагиКлиента.ЦеннаяБумага В (&ЦенныеБумаги)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЦенныеБумагиКлиента", ИмяВременнойТаблицыЦенныхБумагКлиента);
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ЦенныеБумаги", БумагиГруппы.ВыгрузитьКолонку("ЦеннаяБумага"));

		СчетаПоБумагамГруппы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
	
		РаботаСКоллекциями.ДополнитьМассив(СвязанныеСчетаДоверительногоУправления, СчетаПоБумагамГруппы, Истина);
		
	КонецЦикла;
	
	Возврат СвязанныеСчетаДоверительногоУправления;
	
КонецФункции

Функция ПолучитьТаблицуПроверкиДатЗапретаРедактирования(НаборЗаписей) Экспорт
	
	// Проверяем бэк-офис и партии всех счетов клиента, у которых на остатках есть эта бумага,
	// исключая счета с методикой РЭМ, т.к. считаем, что в РЭМ аналоги не используются.
	// Для группы запрета "бэк-офис" методику берем в оценке объектов в управлении и только в дни формирования СЧА,
	// для группы запрета "партии" - в оценке ЕПС
	
	ТаблицаПроверкиЗапретаРедактирования = РегистрыСведений.ДатыЗапретаРедактирования.СоздатьТаблицуПроверкиДатЗапретаРедактирования();
	
	ИсключаемыеМетодики = Новый Массив;
	ИсключаемыеМетодики.Добавить(Справочники.ВариантыРасчетаОценочнойСтоимости.РЭМ);
	ИсключаемыеМетодики.Добавить(Справочники.ВариантыРасчетаОценочнойСтоимости.ФОГФ);
	
	// Проверка нужна по каждой бумаге за каждый период
	
	ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить(, "Клиент, Организация, Период, ЦеннаяБумага, Активность").Скопировать(Новый Структура("Активность", Истина));
	
	ГруппыНаборов = ТаблицаНабораЗаписей.Скопировать(, "Клиент, Организация, Период");
	ГруппыНаборов.Свернуть("Клиент, Организация, Период");
	
	Если ГруппыНаборов.Количество() > 1 Тогда
		ВызватьИсключение "Получение таблицы проверки дат запрета редактирования для набора записей, включающего несколько клиентов, организаций или периодов, не реализована";	
	ИначеЕсли ГруппыНаборов.Количество() = 0 Тогда
		Возврат ТаблицаПроверкиЗапретаРедактирования;
	Иначе
		Группа = ГруппыНаборов[0];
	КонецЕсли;
	
	БумагиНаборов = ТаблицаНабораЗаписей.Скопировать(, "Клиент, Организация, Период, ЦеннаяБумага");
	БумагиНаборов.Свернуть("Клиент, Организация, Период, ЦеннаяБумага");
	БумагиНаборов.Индексы.Добавить("Клиент, Организация, Период");
	
	БумагиГруппы = БумагиНаборов.Скопировать(Новый Структура("Клиент, Организация, Период", Группа.Клиент, Группа.Организация, Группа.Период), "ЦеннаяБумага");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Помещаем ценные бумаги клиента в ВТ
	
	РаботаСЦеннымиБумагами.ПолучитьЦенныеБумагиКлиента(Группа.Клиент, Группа.Организация, КонецДня(Группа.Период), , , Истина, Истина, "_ЦенныеБумагиКлиента", Запрос.МенеджерВременныхТаблиц);
	
	// Оставляем только счета д/у с бумагами набора
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумагиКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДУСБумагамиНабора
		|ИЗ
		|	_ЦенныеБумагиКлиента КАК _ЦенныеБумагиКлиента
		|ГДЕ
		|	_ЦенныеБумагиКлиента.ЦеннаяБумага В(&ЦенныеБумаги)";
	
	Запрос.УстановитьПараметр("ЦенныеБумаги", БумагиГруппы.ВыгрузитьКолонку("ЦеннаяБумага"));
	Запрос.Выполнить();
	
	// Получаем даты расчета СЧА
	
	ПараметрыПериодичностиСЧА = Новый Структура("ВидДействия, ДатаС, ДатаПо, ИмяТаблицыСчетовДУ, ИмяТаблицыДатДействияЗаПериод",
		"СЧА", Группа.Период, Группа.Период, "_СчетаДУСБумагамиНабора", "_ДатыРасчетаСЧА");
	Справочники.НастройкиРегламентныхДействий.ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, ПараметрыПериодичностиСЧА);
	
	// Формируем таблицу дат запрета редактирования
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦелейРасчета.Организация КАК Организация,
		|	НастройкиЦелейРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
		|	КОНЕЦ КАК ГруппаЗапрета,
		|	ВЫБОР
		|		КОГДА НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	КОНЕЦ КАК ВидУчета,
		|	&Период КАК Период
		|ИЗ
		|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|			&Период,
		|			СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУСБумагамиНабора.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУСБумагамиНабора КАК _СчетаДУСБумагамиНабора)
		|				И ЦельРасчета В (ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении), ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов))) КАК НастройкиЦелейРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыРасчетаСЧА КАК _ДатыРасчетаСЧА
		|		ПО (_ДатыРасчетаСЧА.СчетДоверительногоУправления = НастройкиЦелейРасчета.СчетДоверительногоУправления)
		|			И (_ДатыРасчетаСЧА.Дата = &Период)
		|ГДЕ
		|	НЕ НастройкиЦелейРасчета.ВариантРасчетаОценочнойСтоимости В (&ИсключаемыеМетодики)
		|	И НЕ(НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|				И _ДатыРасчетаСЧА.Дата ЕСТЬ NULL)";		
	
	Запрос.УстановитьПараметр("Период",					НачалоДня(Группа.Период));
	Запрос.УстановитьПараметр("ИсключаемыеМетодики",	ИсключаемыеМетодики);

	ТаблицаПроверкиСчетовПоБумагамГруппы = Запрос.Выполнить().Выгрузить();

	РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТаблицаПроверкиСчетовПоБумагамГруппы, ТаблицаПроверкиЗапретаРедактирования);
		
	ТаблицаПроверкиЗапретаРедактирования.Свернуть("Организация, СчетДоверительногоУправления, ГруппаЗапрета, ВидУчета, Период");
	
	Возврат ТаблицаПроверкиЗапретаРедактирования;
	
КонецФункции