
Процедура ПриЗаписи(Отказ, Замещение)

	Если Не ЭтотОбъект.ДополнительныеСвойства.УдалениеВСоставеИзмененияНабора Тогда // проверим непротиворечивость новых данных
		
		// Не должно быть одновременно действующих одинаковых аналогов
		// с незаполненой и заполненной целью использования
		
		ПроверитьПересеченияПоЦелиИспользования(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПересеченияПоЦелиИспользования(Отказ)
	
	Если ЭтотОбъект.Количество() = 0 Тогда // Если записи удаляются, то проверку не выполняем
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ЭтотОбъект.Выгрузить(), "_ЗаписиНовогоНабора", Запрос);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаписиНовогоНабора.Регистратор КАК Регистратор,
		|	_ЗаписиНовогоНабора.НомерСтроки КАК НомерСтроки,
		|	_ЗаписиНовогоНабора.Организация КАК Организация,
		|	_ЗаписиНовогоНабора.Клиент КАК Клиент,
		|	_ЗаписиНовогоНабора.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗаписиНовогоНабора.Аналог КАК Аналог,
		|	ВЫБОР
		|		КОГДА _ЗаписиНовогоНабора.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|			ТОГДА _ЗаписиНовогоНабора.Период
		|		ИНАЧЕ ПересекающиесяЗаписи.Период
		|	КОНЕЦ КАК ДатаНачалаДействияНезаполненного,
		|	ВЫБОР
		|		КОГДА _ЗаписиНовогоНабора.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|			ТОГДА _ЗаписиНовогоНабора.ДатаОкончанияДействия
		|		ИНАЧЕ ПересекающиесяЗаписи.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияНезаполненного,
		|	ВЫБОР
		|		КОГДА _ЗаписиНовогоНабора.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|			ТОГДА ПересекающиесяЗаписи.Период
		|		ИНАЧЕ _ЗаписиНовогоНабора.Период
		|	КОНЕЦ КАК ДатаНачалаДействияЗаполненного,
		|	ВЫБОР
		|		КОГДА _ЗаписиНовогоНабора.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|			ТОГДА ПересекающиесяЗаписи.ДатаОкончанияДействия
		|		ИНАЧЕ _ЗаписиНовогоНабора.ДатаОкончанияДействия
		|	КОНЕЦ КАК ДатаОкончанияДействияЗаполненного
		|ИЗ
		|	_ЗаписиНовогоНабора КАК _ЗаписиНовогоНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЦенныхБумаг КАК ПересекающиесяЗаписи
		|		ПО (ПересекающиесяЗаписи.Организация = _ЗаписиНовогоНабора.Организация)
		|			И (ПересекающиесяЗаписи.Клиент = _ЗаписиНовогоНабора.Клиент)
		|			И (ПересекающиесяЗаписи.ЦеннаяБумага = _ЗаписиНовогоНабора.ЦеннаяБумага)
		|			И (ПересекающиесяЗаписи.Аналог = _ЗаписиНовогоНабора.Аналог)
		|			И (ПересекающиесяЗаписи.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|					И _ЗаписиНовогоНабора.Назначение <> ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|				ИЛИ ПересекающиесяЗаписи.Назначение <> ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка)
		|					И _ЗаписиНовогоНабора.Назначение = ЗНАЧЕНИЕ(Перечисление.ЦелиИспользованияАналогов.ПустаяСсылка))
		|			И (ПересекающиесяЗаписи.Период <= _ЗаписиНовогоНабора.ДатаОкончанияДействия)
		|			И (ПересекающиесяЗаписи.ДатаОкончанияДействия >= _ЗаписиНовогоНабора.Период)";

	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ТекстОшибки = СтрШаблон(
			"Ошибка регистрации аналога '%1' ценной бумаги '%2' (%3, %4): не должно быть одновременно действующих аналогов с незаполненной (%5) и заполненной (%6) целью использования",
			ВыборкаЗапроса.Аналог,
			ВыборкаЗапроса.ЦеннаяБумага,
			ВыборкаЗапроса.Клиент,
			ВыборкаЗапроса.Организация,
			Новый СтандартныйПериод(ВыборкаЗапроса.ДатаНачалаДействияНезаполненного, ВыборкаЗапроса.ДатаОкончанияДействияНезаполненного),
			Новый СтандартныйПериод(ВыборкаЗапроса.ДатаНачалаДействияЗаполненного, ВыборкаЗапроса.ДатаОкончанияДействияЗаполненного));
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки, ВыборкаЗапроса.Регистратор, СтрШаблон("Объект.Аналоги[%1].Назначение", Формат(ВыборкаЗапроса.НомерСтроки - 1, "ЧРД=; ЧН=")), , Отказ);
		
	КонецЦикла;	
	
КонецПроцедуры
