
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.Дата			= ТекущаяДата();
	ЭтаФорма.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ДокументШаблон.Оценщик = ЭтаФорма.Организация.ЮрФизЛицо;	
	
	// Видимость
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Видимость			= ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость	= Не ЭтоПолноправныйПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	СчетаДоверительногоУправления.Очистить();
	
	Если ДокументШаблон.СтоимостьЦенныхБумаг.Количество() > 0
		И Вопрос("Перезаполнить даты окончания действия?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да
	Тогда
		
		Для Каждого Строка из ДокументШаблон.СтоимостьЦенныхБумаг Цикл
			Строка.ДатаОкончанияДействия = ЭтаФорма.Дата;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СчетаДоверительногоУправления.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиБумагПриАктивизацииСтроки(Элемент)

	УстановитьОграничениеТипаПоРынкуБумаги();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиРынокПриИзменении(Элемент)

	УстановитьОграничениеТипаПоРынкуБумаги();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаЦеныПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаЦены Тогда
		ТекущиеДанные.Стоимость		= Неопределено;
		ТекущиеДанные.ВидЦены		= Неопределено;
		ТекущиеДанные.УровеньОценки	= Неопределено;
		ТекущиеДанные.Источник		= Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаКупонаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКупона Тогда
		ТекущиеДанные.СтоимостьКупона = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаСтадииОбесцененияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаСтадииОбесценения Тогда
		ТекущиеДанные.СтадияОбесценения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаЗарегистрировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьНаСервере();
	
	Предупреждение("Обработка завершена");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьКлиентовПоБумаге(Команда)

	Если ДокументШаблон.СтоимостьЦенныхБумаг.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не внесено ни одной бумаги", ЭтаФорма, "ДокументШаблон.СтоимостьЦенныхБумаг");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКлиентовПоБумагеНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	Запрос = РаботаСЦеннымиБумагами.ПолучитьЗапросПортфеляЦенныхБумаг(ЭтаФорма.Организация, КонецДня(ЭтаФорма.Дата), "Организация = &Организация", Ложь, Ложь, Истина, Истина, "_ПортфельЦенныхБумаг");
	
	Запрос.Выполнить();
	
	ЦенныеБумагиКлиентов = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПортфельЦенныхБумаг"].ПолучитьДанные().Выгрузить();
	ЦенныеБумагиКлиентов.Индексы.Добавить("ЦеннаяБумага, СчетДоверительногоУправления");
	
	// Создаем профсуждения только по бумагам, которые есть в портфелях
	
	Для Каждого СтрокаКлиента Из СчетаДоверительногоУправления Цикл

		Попытка
		
			ДокументОбъект = Документы.РегистрацияПрофсуждений.СоздатьДокумент();
			
			ДокументОбъект.Организация					= СтрокаКлиента.СчетДоверительногоУправления.Организация;
			ДокументОбъект.СчетДоверительногоУправления	= СтрокаКлиента.СчетДоверительногоУправления;
			ДокументОбъект.Дата							= ЭтаФорма.Дата;
			ДокументОбъект.Оценщик						= ДокументШаблон.Оценщик;
			ДокументОбъект.ДатаОценки					= ЭтаФорма.Дата;
			ДокументОбъект.Ответственный				= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");
			ДокументОбъект.Комментарий					= ДокументШаблон.Комментарий;
			
			Для Каждого СтрокаТабличнойЧасти Из ДокументШаблон.СтоимостьЦенныхБумаг Цикл
				
				СтруктураПоиска = Новый Структура("ЦеннаяБумага, СчетДоверительногоУправления", СтрокаТабличнойЧасти.ЦеннаяБумага, ДокументОбъект.СчетДоверительногоУправления);
				
				Если ЦенныеБумагиКлиентов.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(ДокументОбъект.СтоимостьЦенныхБумаг.Добавить(), СтрокаТабличнойЧасти);
				КонецЕсли;
					
			КонецЦикла;
			
			Если ДокументОбъект.СтоимостьЦенныхБумаг.Количество() > 0 Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
			
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлиентовПоБумагеНаСервере()
	
	Запрос = РаботаСЦеннымиБумагами.ПолучитьЗапросПортфеляЦенныхБумаг(ЭтаФорма.Организация, КонецДня(ЭтаФорма.Дата), "Организация = &Организация", Ложь, Ложь, Истина, Истина, "_ПортфельЦенныхБумаг");
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПортфельЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	_ПортфельЦенныхБумаг КАК _ПортфельЦенныхБумаг
		|ГДЕ
		|	_ПортфельЦенныхБумаг.ЦеннаяБумага В(&ЦенныеБумаги)";
	
	Запрос.УстановитьПараметр("ЦенныеБумаги", ДокументШаблон.СтоимостьЦенныхБумаг.Выгрузить(Неопределено, "ЦеннаяБумага"));
	
	СчетаДоверительногоУправления.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаПоРынкуБумаги()

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекущиеДанные.Рынок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаКредитногоРискаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКредитногоРиска Тогда
		ТекущиеДанные.PD = Неопределено;
		ТекущиеДанные.PDLifeTime = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦенныеБумагиОценкаКредитногоРискаLGDПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКредитногоРискаLGD Тогда
		ТекущиеДанные.LGD = Неопределено;
		ТекущиеДанные.LGDПредставление = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиLGDПредставлениеПриИзменении(Элемент)
	Элементы.ЦенныеБумаги.ТекущиеДанные.LGD  = Элементы.ЦенныеБумаги.ТекущиеДанные.LGDПредставление/100;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКлиентуНаСервере()
	
	МассивСчетов = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(ДокументШаблон.Оценщик,	ЭтаФорма.Организация, КонецДня(ЭтаФорма.Дата));	
	
	Для Каждого СчетДУ Из МассивСчетов Цикл
		ОтборСчетаДоверительногоУправления = Новый Структура();
		ОтборСчетаДоверительногоУправления.Вставить("СчетДоверительногоУправления", СчетДУ);
		НайденныеСтроки = СчетаДоверительногоУправления.НайтиСтроки(ОтборСчетаДоверительногоУправления);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрокаСчетаДоверительногоУправления = СчетаДоверительногоУправления.Добавить();
			НоваяСтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления = СчетДУ;
		КонецЕсли;	
	КонецЦикла;	
	
	СчетаДоверительногоУправления.Сортировать("СчетДоверительногоУправления");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКлиенту(Команда)
	ЗаполнитьПоКлиентуНаСервере();
КонецПроцедуры
