
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрКоманды = Параметры.ПараметрКоманды;
	
	Если ЗначениеЗаполнено(Параметры.ПараметрКоманды) Тогда
		
		МетаданныеПараметра = Параметры.ПараметрКоманды.Метаданные();
		
		ЭтоСправочник = Метаданные.Справочники.Содержит(МетаданныеПараметра);
		ЭтоДокумент   = Метаданные.Документы.Содержит(МетаданныеПараметра);
		
		Если Не ЭтоСправочник Тогда
			Элементы.СсылкиНаСправочники.Видимость = Ложь;
		КонецЕсли;
		
		Если Не ЭтоСправочник И Не ЭтоДокумент Тогда
			Элементы.КодыВоВнешнихСистемах.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКоманды(ФормаКоманды, ПараметрыКоманды)
	
	ОткрытьФорму(ФормаКоманды,
		ПараметрыКоманды,
		ВладелецФормы,
		Истина,
		ВладелецФормы.Окно,
		ЭтаФорма.НавигационнаяСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЖурналРегистрацииНажатие(Элемент)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Данные", ПараметрКоманды);
	ПараметрыФормы.Вставить("ДатаНачала", НачалоДня(ТекущаяДата()) - 7 * 3600 * 24);
	
	ОткрытьФормуКоманды("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПолейНажатие(Элемент)
	
	ОткрытьФормуКоманды("Обработка.ЗначенияПолейОбъекта.Форма",
		Новый Структура("Ссылка", ПараметрКоманды));
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкиНаОбъектНажатие(Элемент)

	ОткрытьФормуКоманды("Обработка.ПоискСсылокНаОбъект.Форма",
		Новый Структура("Объект", ПараметрКоманды));
	
КонецПроцедуры

&НаКлиенте
Процедура КодыВоВнешнихСистемахНажатие(Элемент)

	ОткрытьФормуКоманды("РегистрСведений.КодыВоВнешнихСистемах.ФормаСписка",
		Новый Структура("Отбор", Новый Структура("Объект", ПараметрКоманды)));
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкиНаСправочникиНажатие(Элемент)

	ОткрытьФормуКоманды("Обработка.ПоискСсылокНаОбъект.Форма",
		Новый Структура("Объект", ПараметрКоманды));
	
КонецПроцедуры

&НаКлиенте
Процедура ИменованныеОбъектыНажатие(Элемент)

	ОткрытьФормуКоманды("РегистрСведений.ИменованныеОбъекты.ФормаСписка",
		Новый Структура("Отбор", Новый Структура("Объект", ПараметрКоманды)));
	
КонецПроцедуры
