
&НаСервере
Процедура ИмпортироватьПереченьБанков580ПНаСервере()
	
	РеквизитФормыВЗначение("Объект").ИмпортироватьПереченьБанков580П();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьПереченьБанков580П(Команда)
	
	ИмпортироватьПереченьБанков580ПНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
