
Функция БрокерскаяКомпанияПоЮрЛицуИлиРасчетномуСчету(Контрагент, Период, РасчетныйСчет) Экспорт
	
	Брокер = Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Контрагент, "БрокерскиеКомпании");
	
	Если ЗначениеЗаполнено(Брокер) Тогда 
		Возврат Брокер;		
	КонецЕсли;

	// такое бывает, когда брокер работает через р/счет, не принадлежащий брокеру
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.Брокер КАК Брокер
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамБрокерские КАК ИсполнителиПоДенежнымСредствамБрокерские
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамБрокерские.РасчетныйСчет = &РасчетныйСчет
		|	И (ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия >= &ДатаЗакрытия
		|			ИЛИ ИсполнителиПоДенежнымСредствамБрокерские.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
		
	Запрос.УстановитьПараметр("РасчетныйСчет", РасчетныйСчет);
	Запрос.УстановитьПараметр("ДатаЗакрытия",  Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Брокер;
	КонецЕсли;
	
	Возврат Справочники.БрокерскиеКомпании.ПустаяСсылка();
	
КонецФункции

Функция МестоХраненияДляРасчетногоСчета(РасчетныйСчет) Экспорт
	
	НомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетныйСчет, "НомерСчета");
	Возврат ?(Лев(НомерСчета, 1) = "4", Справочники.МестаХранения.ВнебиржевойРынок, Справочники.МестаХранения.ПустаяСсылка());
	
КонецФункции

Функция СчетДоверительногоУправленияПоРасчетномуСчетуИИсполнителю(ДанныеПоРасчетномуСчетуИКонтрагенту) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчет
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &ДатаЗакрытия
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
		
	Запрос.УстановитьПараметр("Организация",   ДанныеПоРасчетномуСчетуИКонтрагенту.Организация);
	Запрос.УстановитьПараметр("РасчетныйСчет", ДанныеПоРасчетномуСчетуИКонтрагенту.РасчетныйСчет);
	Запрос.УстановитьПараметр("ДатаЗакрытия",  ДанныеПоРасчетномуСчетуИКонтрагенту.Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		
		//Значит, исполнитель используется не у одного счета ДУ и использовать первый счет ДУ некорректно
		//Если это ввод, поищем по контрагенту платежки
		Если ДанныеПоРасчетномуСчетуИКонтрагенту.ВидДокумента = "ВводДенежныхСредств" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Клиент = &Контрагент) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
			|ГДЕ
			|	(СчетаДоверительногоУправления.ДатаРасторжения >= &Период
			|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))";
			
			Запрос.УстановитьПараметр("Контрагент", ДанныеПоРасчетномуСчетуИКонтрагенту.Контрагент);
			Запрос.УстановитьПараметр("Период", 	ДанныеПоРасчетномуСчетуИКонтрагенту.Период);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 И ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Возврат ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У контрагента " + ДанныеПоРасчетномуСчетуИКонтрагенту.Контрагент + " действует более одного счета ДУ, поэтому нельзя однозначно определить счет ДУ по контрагенту из п/п.");
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет " + ДанныеПоРасчетномуСчетуИКонтрагенту.РасчетныйСчет + " используется для более одного счета ДУ, поэтому нельзя однозначно определить счет ДУ.");
		КонецЕсли;
		
	ИначеЕсли Выборка.Следующий() Тогда 
		Возврат Выборка.СчетДоверительногоУправления;
	КонецЕсли;

	Возврат Справочники.СчетаДоверительногоУправления.ПустаяСсылка();
	
КонецФункции

Функция ВремяДокументаДвиженияДенежныхСредств(ДатаВыписки, ИспользуетсяПредварительнаяВыписка, ВидДвижения = "Расход") Экспорт
	
	ТекущаяДата			= ТекущаяДатаСеанса();                                  
	НачалоТекущейДаты	= НачалоДня(ТекущаяДата);
	НачалоДатыВыписки	= НачалоДня(ДатаВыписки);
	
	// Если в организации не используется загрузка предварительной выписки,
	// то поступления д/с на расчетый счет устанавливаем в 10-30
	Если Не ИспользуетсяПредварительнаяВыписка И ВидДвижения = "Приход" Тогда
		Возврат НачалоДатыВыписки + 10 * 60 * 60 + 30 * 60;
	Иначе	
		// При загрузке выписки день в день у новых документов устанавливаем текущее время, при загрузке на следующий день - 19-30	
		Возврат ?(НачалоДатыВыписки = НачалоТекущейДаты, 
								ТекущаяДата, 
								НачалоДатыВыписки + 19 * 60 * 60 + 30 * 60);
	КонецЕсли; 

КонецФункции

Функция ОрганизацияЗагружаетПредварительнуюВыписку(Организация) Экспорт
	
	Возврат Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
		Или Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
		
КонецФункции
