
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",        КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьЗакрытые(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые",
		Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка);
	
КонецПроцедуры
