
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.РазмерЭмиссииСумма = РаботаСЦеннымиБумагамиКлиентСервер.РассчитатьРазмерЭмиссииСумма(Объект.РазмерЭмиссииШт, Объект.Номинал);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	РаботаСЦеннымиБумагамиКлиентСервер.ОтборДинамическогоСписка(Коды, Объект);	
	
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;		
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура НоминалПриИзменении(Элемент)
	
	РазмерЭмиссииСумма = РаботаСЦеннымиБумагамиКлиентСервер.РассчитатьРазмерЭмиссииСумма(Объект.РазмерЭмиссииШт, Объект.Номинал);

КонецПроцедуры

&НаКлиенте
Процедура РазмерЭмиссииШтПриИзменении(Элемент)
	
	РазмерЭмиссииСумма = РаботаСЦеннымиБумагамиКлиентСервер.РассчитатьРазмерЭмиссииСумма(Объект.РазмерЭмиссииШт, Объект.Номинал);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры
