
&НаСервере
Процедура ОбновитьТаблицуПереводовНаСервере()
	
	Для каждого СтрокаДенежныеСредства Из Объект.ДенежныеСредства Цикл
		
		// получим счет д/у
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|			&Дата,
			|			Организация = &Организация
			|				И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|ГДЕ
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код = &Код";
		
		Запрос.УстановитьПараметр("Дата",        Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Брокер",      Объект.Брокер);
		Запрос.УстановитьПараметр("Код",         СтрокаДенежныеСредства.КодКлиентаУБрокера);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтрокаДенежныеСредства.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		Иначе
			Сообщить("Не удалось получить счет д/у по коду '" + СтрокаДенежныеСредства.КодКлиентаУБрокера + "'");
			Продолжить;
		КонецЕсли;
		
		Если ЭтаФорма.ИсточникОткуда = 2 Тогда // по банку из файла
			
			Если СтрокаДенежныеСредства.КодБанка = "МКБ" Тогда
				Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_МКБ");
			ИначеЕсли СтрокаДенежныеСредства.КодБанка = "ГПБ" Тогда
				Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ");
			Иначе
				Банк = Справочники.Банки.ПустаяСсылка();
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(Банк) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
					|ИЗ
					|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
					|ГДЕ
					|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
					|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
					|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &ДатаЗакрытия
					|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
					|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк = &Банк";
				
				Запрос.УстановитьПараметр("ДатаЗакрытия",                 Объект.Дата);
				Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтрокаДенежныеСредства.СчетДоверительногоУправления);
				Запрос.УстановитьПараметр("Банк",                         Банк);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если      Выборка.Количество() = 1 Тогда
					Выборка.Следующий();
					СтрокаДенежныеСредства.РасчетныйСчетОткуда = Выборка.РасчетныйСчет;
				ИначеЕсли Выборка.Количество() > 1 Тогда
					Сообщить("Найдено более одного р/счет клиента '" + СтрокаДенежныеСредства.СчетДоверительногоУправления + "'");
					Продолжить;
				Иначе
					Сообщить("Не удалось получить р/счет клиента '" + СтрокаДенежныеСредства.СчетДоверительногоУправления + "'");
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// получим сумму остатка
		Если ЗначениеЗаполнено(СтрокаДенежныеСредства.СчетДоверительногоУправления) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период",                       Новый Граница(Объект.Дата, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтрокаДенежныеСредства.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("Брокер",                       Объект.Брокер);
			Запрос.УстановитьПараметр("МестоХранения",                Объект.МестоХраненияОткуда);
			Запрос.УстановитьПараметр("Валюта",                       Объект.Валюта);
				
			Если ЭтаФорма.ИсточникОткуда = 0 Тогда
			
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
					|				И Брокер = &Брокер
					|				И МестоХранения = &МестоХранения
					|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки";
				
			ИначеЕсли ЭтаФорма.ИсточникОткуда = 1 Тогда
				
				Запрос.УстановитьПараметр("РасчетныйСчет", Объект.РасчетныйСчетОткуда);
				
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
					|				И РасчетныйСчет = &РасчетныйСчет
					|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки";
				
			ИначеЕсли ЭтаФорма.ИсточникОткуда = 2 Тогда
				
				Запрос.УстановитьПараметр("РасчетныйСчет", СтрокаДенежныеСредства.РасчетныйСчетОткуда);
				
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
					|ИЗ
					|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
					|				И РасчетныйСчет = &РасчетныйСчет
					|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки";
				
			КонецЕсли;
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				СтрокаДенежныеСредства.СуммаОстаток = Выборка.СуммаОстаток;
			КонецЕсли;
			
		КонецЕсли;
		
		// найдем подходящий перевод
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПереводДенежныхСредств.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(ПереводДенежныхСредств.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
			|	И ПереводДенежныхСредств.Проведен
			|	И ПереводДенежныхСредств.Организация = &Организация
			|	И ПереводДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ПереводДенежныхСредств.ВариантПеревода = ЗНАЧЕНИЕ(Перечисление.ВариантыПереводаДенежныхСредств.Перевод)
			|	И ПереводДенежныхСредств.ФормаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ФормыДенежныхСредств.Безналичная)
			|	И ПереводДенежныхСредств.Брокер = &Брокер
			|	И ПереводДенежныхСредств.МестоХранения = &МестоХранения
			|	И ПереводДенежныхСредств.РасчетныйСчет = &РасчетныйСчет
			|	И ПереводДенежныхСредств.ФормаДенежныхСредствПолучатель = ЗНАЧЕНИЕ(Перечисление.ФормыДенежныхСредств.Безналичная)
			|	И ПереводДенежныхСредств.БрокерПолучатель = &БрокерПолучатель
			|	И ПереводДенежныхСредств.МестоХраненияПолучатель = &МестоХраненияПолучатель
			|	//И ПереводДенежныхСредств.РасчетныйСчетПолучатель = &РасчетныйСчетПолучатель
			|	И ПереводДенежныхСредств.Сумма = &Сумма
			|	И ПереводДенежныхСредств.Валюта = &Валюта";
		
		// т.к. при переводе д/с на брокера р/счет получателя также заполняется, а связи
		// этого счета с разделом у нас пока нет, придется искать без его участия((
		
		Запрос.УстановитьПараметр("Дата",                         Объект.Дата);
		Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СтрокаДенежныеСредства.СчетДоверительногоУправления);
		
		// откуда
		Если      ЭтаФорма.ИсточникОткуда = 0 Тогда
			Запрос.УстановитьПараметр("Брокер",        Объект.Брокер);
			Запрос.УстановитьПараметр("МестоХранения", Объект.МестоХраненияОткуда);
			Запрос.УстановитьПараметр("РасчетныйСчет", Справочники.БанковскиеСчета.ПустаяСсылка());
			
		ИначеЕсли ЭтаФорма.ИсточникОткуда = 1 Тогда
			Запрос.УстановитьПараметр("Брокер",        Справочники.БрокерскиеКомпании.ПустаяСсылка());
			Запрос.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.ВнебиржевойРынок);
			Запрос.УстановитьПараметр("РасчетныйСчет", Объект.РасчетныйСчетОткуда);
			
		ИначеЕсли ЭтаФорма.ИсточникОткуда = 2 Тогда
			Запрос.УстановитьПараметр("Брокер",        Справочники.БрокерскиеКомпании.ПустаяСсылка());
			Запрос.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.ВнебиржевойРынок);
			Запрос.УстановитьПараметр("РасчетныйСчет", СтрокаДенежныеСредства.РасчетныйСчетОткуда);
			
		КонецЕсли;
		
		// куда
		Если      ЭтаФорма.ИсточникКуда = 0 Тогда
			Запрос.УстановитьПараметр("БрокерПолучатель",        Объект.Брокер);
			Запрос.УстановитьПараметр("МестоХраненияПолучатель", Объект.МестоХраненияКуда);
			Запрос.УстановитьПараметр("РасчетныйСчетПолучатель", Объект.РасчетныйСчетКуда);
			
		ИначеЕсли ЭтаФорма.ИсточникКуда = 1 Тогда
			Запрос.УстановитьПараметр("БрокерПолучатель",        Справочники.БрокерскиеКомпании.ПустаяСсылка());
			Запрос.УстановитьПараметр("МестоХраненияПолучатель", Справочники.МестаХранения.ВнебиржевойРынок);
			Запрос.УстановитьПараметр("РасчетныйСчетПолучатель", Объект.РасчетныйСчетКуда);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Сумма",  СтрокаДенежныеСредства.Сумма);
		Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтрокаДенежныеСредства.ПереводДенежныхСредств = Выборка.Ссылка;
		КонецЕсли;
		
		// флажок
		СтрокаДенежныеСредства.Флажок = (СтрокаДенежныеСредства.СуммаОстаток >= СтрокаДенежныеСредства.Сумма)
				И Не ЗначениеЗаполнено(СтрокаДенежныеСредства.ПереводДенежныхСредств);
	
	КонецЦикла;
	
КонецПроцедуры // ОбновитьТаблицуПереводовНаСервере

&НаСервере
Процедура СформироватьПереводыНаСервере()
	
	Для каждого СтрокаДенежныеСредства Из Объект.ДенежныеСредства Цикл
		
		Если Не СтрокаДенежныеСредства.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		Перевод = Документы.ПереводДенежныхСредств.СоздатьДокумент();
		
		Перевод.Дата                         = Объект.Дата;
		Перевод.Организация                  = Объект.Организация;
		Перевод.СчетДоверительногоУправления = СтрокаДенежныеСредства.СчетДоверительногоУправления;
		Перевод.ВариантПеревода              = Перечисления.ВариантыПереводаДенежныхСредств.Перевод;
		
		// откуда
		Перевод.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная;
		
		Если ЭтаФорма.ИсточникОткуда = 0 Тогда // брокер
			
			Перевод.Брокер        = Объект.Брокер;
			Перевод.МестоХранения = Объект.МестоХраненияОткуда;
			Перевод.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
			
		ИначеЕсли ЭтаФорма.ИсточникОткуда = 1 Тогда // р/счет
			
			Перевод.Брокер        = Справочники.БрокерскиеКомпании.ПустаяСсылка();
			Перевод.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
			Перевод.РасчетныйСчет = Объект.РасчетныйСчетОткуда;
			
		ИначеЕсли ЭтаФорма.ИсточникОткуда = 2 Тогда // р/счет из файла
			
			Перевод.Брокер        = Справочники.БрокерскиеКомпании.ПустаяСсылка();
			Перевод.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
			Перевод.РасчетныйСчет = СтрокаДенежныеСредства.РасчетныйСчетОткуда;
			
		КонецЕсли;
		
		// куда
		Перевод.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная;
		
		Если ЭтаФорма.ИсточникКуда = 0 Тогда // брокер
			
			Перевод.БрокерПолучатель        = Объект.Брокер;
			Перевод.МестоХраненияПолучатель = Объект.МестоХраненияКуда;
			Перевод.РасчетныйСчетПолучатель = Объект.РасчетныйСчетКуда;
			
		ИначеЕсли ЭтаФорма.ИсточникКуда = 1 Тогда // р/счет
			
			Перевод.БрокерПолучатель        = Справочники.БрокерскиеКомпании.ПустаяСсылка();
			Перевод.МестоХраненияПолучатель = Справочники.МестаХранения.ВнебиржевойРынок;
			Перевод.РасчетныйСчетПолучатель = Объект.РасчетныйСчетКуда;
			
		КонецЕсли;
		
		Перевод.Сумма         = СтрокаДенежныеСредства.Сумма;
		Перевод.Валюта        = Объект.Валюта;
		Перевод.Ответственный = РаботаСПользователями.ТекущийПользователь();
		
		Перевод.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	ОбновитьТаблицуПереводовНаСервере();
	
КонецПроцедуры // СформироватьПереводыНаСервере

&НаКлиенте
Процедура НастроитьВидимость()
	
	Элементы.БрокерОткуда.Видимость        = (ЭтаФорма.ИсточникОткуда = 0);
	Элементы.МестоХраненияОткуда.Видимость = (ЭтаФорма.ИсточникОткуда = 0);
	Элементы.РасчетныйСчетОткуда.Видимость = (ЭтаФорма.ИсточникОткуда = 1);
	
	Элементы.ДенежныеСредстваКодБанка.Видимость            = (ЭтаФорма.ИсточникОткуда = 2);
	Элементы.ДенежныеСредстваРасчетныйСчетОткуда.Видимость = (ЭтаФорма.ИсточникОткуда = 2);
	
	Элементы.БрокерКуда.Видимость        = (ЭтаФорма.ИсточникКуда = 0);
	Элементы.МестоХраненияКуда.Видимость = (ЭтаФорма.ИсточникКуда = 0);
	
КонецПроцедуры // НастроитьВидимость

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Дата        = ТекущаяДата();
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Валюта      = Объект.Организация.ВалютаУчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСформироватьПереводы(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСформироватьПереводы");
	Попытка
		СформироватьПереводыНаСервере()
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьТаблицуПереводов(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновитьТаблицуПереводов");
	Попытка
		Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
	
		ОбновитьТаблицуПереводовНаСервере();
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРаспоряженияБрокеру(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСохранитьРаспоряженияБрокеру");
	Попытка
		ПараметрыРаспоряжений = ОткрытьФормуМодально("ВнешняяОбработка._СводныйПереводДенежныхСредств.Форма.РаспоряжениеБрокеруБКРегион");
	
		Если ТипЗнч(ПараметрыРаспоряжений) <> Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
	
		ПечатьРаспоряженийБрокеруБКРегион = ПолучитьФорму("Обработка.ПечатьРаспоряженийБрокеруБКРегион.Форма",, ЭтаФорма);
	
		ПечатьРаспоряженийБрокеруБКРегион.Объект.Дата                        = ТекущаяДата();
		ПечатьРаспоряженийБрокеруБКРегион.Объект.Подписант                   = ПараметрыРаспоряжений.Подписант;
		ПечатьРаспоряженийБрокеруБКРегион.Объект.НомерПоследнегоРаспоряжения = ПараметрыРаспоряжений.НомерПоследнегоРаспоряжения;
	
		ПечатьРаспоряженийБрокеруБКРегион.СохранятьФайл = Истина;
	
		Для каждого СтрокаДенежныеСредства Из Объект.ДенежныеСредства Цикл
		
			Если ЗначениеЗаполнено(СтрокаДенежныеСредства.ПереводДенежныхСредств) Тогда
		
				ПечатьРаспоряженийБрокеруБКРегион.Объект.Основание = СтрокаДенежныеСредства.ПереводДенежныхСредств;
		
				ФормаРаспоряжения = ПечатьРаспоряженийБрокеруБКРегион.ПолучитьФормуРаспоряженияНаСервере();
			
				Если ФормаРаспоряжения = Неопределено Тогда
					Возврат;
				КонецЕсли;
		
				ПечатьРаспоряженийБрокеруБКРегион.СформироватьРаспоряжение(ФормаРаспоряжения);
			
			КонецЕсли;
		
		КонецЦикла;
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьСписокКлиентовИзТаблицыЭксель(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗагрузитьСписокКлиентовИзТаблицыЭксель");
	Попытка
		Объект.ДенежныеСредства.Очистить();
	
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбора.Фильтр = "Таблицы EXCEL (*.xls)|*.xls*";

		Если Не ДиалогВыбора.Выбрать() Тогда
			Возврат;
		КонецЕсли;
	
		Попытка
			Excel = Новый COMОбъект("Excel.Application");
			Excel.WorkBooks.Open(ДиалогВыбора.ПолноеИмяФайла);
			Excel.Sheets(Excel.Sheets.Count()).Select();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	
		НомСтр = 0;
		МаксКолСтрок = 1000; // защита от зацикливания
	
		СтруктураТаблицыКорректна = Неопределено;
	
		КолонкиШапкиТаблицы = Новый Массив;
		КолонкиШапкиТаблицы.Добавить(ТРег("Клиент"));
		КолонкиШапкиТаблицы.Добавить(ТРег("Код"));
		КолонкиШапкиТаблицы.Добавить(ТРег("Счет"));
		КолонкиШапкиТаблицы.Добавить(ТРег("Место"));
		КолонкиШапкиТаблицы.Добавить(ТРег("ОТПРАВИТЬ"));
	
		Пока НомСтр < МаксКолСтрок Цикл
		
			НомСтр = НомСтр + 1;
		
			Если СтруктураТаблицыКорректна = Неопределено Тогда
		
				Если ВРег(СокрЛП(Excel.Cells(НомСтр, 1).Value)) = ВРег(КолонкиШапкиТаблицы[0]) Тогда // нашли шапку таблицы
				
					СтруктураТаблицыКорректна = Истина;
				
					// проверим структуру таблицы
					Для Инд = 1 По КолонкиШапкиТаблицы.Количество() - 1 Цикл
						Если ВРег(СокрЛП(Excel.Cells(НомСтр, Инд + 1).Value)) <> ВРег(КолонкиШапкиТаблицы[Инд]) Тогда
							СтруктураТаблицыКорректна = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				
					Если Не СтруктураТаблицыКорректна Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка структуры файла: шапка таблицы должна содержать колонки " + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(КолонкиШапкиТаблицы, ", "));
						Excel.ActiveWorkbook.Close();
						Возврат;
					КонецЕсли;
				
					Продолжить;
				
				КонецЕсли;
			
			ИначеЕсли СтруктураТаблицыКорректна = Истина Тогда
			
				Если ПустаяСтрока(СокрЛП(Excel.Cells(НомСтр, 1).Value)) Тогда
					Прервать;
				КонецЕсли;
			
				СтрокаДенежныеСредства = Объект.ДенежныеСредства.Добавить();
				СтрокаДенежныеСредства.КодКлиентаУБрокера = СтрЗаменить(СокрЛП(Excel.Cells(НомСтр, 2).Value), "/", "_");
				СтрокаДенежныеСредства.Сумма              = Число(СокрЛП(Excel.Cells(НомСтр, 5).Value));
				СтрокаДенежныеСредства.КодБанка           = СокрЛП(Excel.Cells(НомСтр, 3).Value)
		
			Иначе
			
				Продолжить;
			
			КонецЕсли;		
		
		КонецЦикла;
	
		Excel.ActiveWorkbook.Close();
	
		Если СтруктураТаблицыКорректна = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка структуры файла: отсуствует шапка таблицы, содержащая колонки " + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(КолонкиШапкиТаблицы, ", "));
			Возврат;
		КонецЕсли;
	
		ОбновитьТаблицуПереводовНаСервере();
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновить");
	Попытка
		ОбновитьТаблицуПереводовНаСервере();
	
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОткудаПриИзменении(Элемент)
	
	НастроитьВидимость();
	
	ОбновитьТаблицуПереводовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникКудаПриИзменении(Элемент)
	
	НастроитьВидимость();
	
	ОбновитьТаблицуПереводовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
