
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ДЛЯ ВКЛЮЧЕНИЯ В ДОП. ОТЧЕТЫ И ОБРАБОТКИ

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Выгрузка данных в личный кабинет клиента",
		"0.15",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

// Интерфейс для запуска отложенных заданий
Процедура ВыполнитьМетод(Команда, Экземпляры) Экспорт
	
	Перем Адресаты;
	
	Ошибки 		= Новый Массив;
		
	ПриВыполненииВозниклиОшибки = Ложь;
	
	Для Каждого Экземпляр Из Экземпляры Цикл
		
		ПараметрыКоманды = Экземпляр.Параметры;
		
		// Обрабатываем только известные команды
		Если НЕ СтрНачинаетсяС(Команда, "ОтправкаДанныхИИСВЛКК") Тогда  		
			ПриВыполненииВозниклиОшибки = Истина;
			Ошибки.Добавить("Неизвестный метод """ + Команда + """");
		КонецЕсли;
		
		// Заполним параметры команды	
		ЭтотОбъект.Период.ДатаОкончания = КонецДня(ПараметрыКоманды.Период);
		ЭтотОбъект.Период.ДатаНачала	= НачалоДня(ПараметрыКоманды.Период);
		ЭтотОбъект.Сервер 				= "ap54.G1.LAN";
		ЭтотОбъект.ПередатьВсехКлиентов	= Истина;
		
		ЭтотОбъект.Организация			= ПараметрыКоманды.Организация;
		
		//Проверим, что все ИИС закрыты
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(
					Период.ДатаОкончания, 
					Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(
							ЭтотОбъект.Организация,
							Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет), 
					Истина, 
					, 
					МенеджерВременныхТаблиц
				    );

		ПриВыполненииВозниклиОшибки = РаботаСОтчетами.ЕстьДатыЗапретаРедактированияСчетовДоверительногоУправленияДоДатыПроверки(
							МенеджерВременныхТаблиц, 
							ЭтотОбъект.Период.ДатаОкончания, 
							ЭтотОбъект.Организация, 
							Перечисления.ГруппыЗапретаРедактирования.БэкОфис, 
							, 
							"_ДействующиеСчетаДоверительногоУправления");
		
		// Формируем отчет
		Если Не ПриВыполненииВозниклиОшибки Тогда
			ПриВыполненииВозниклиОшибки = Не ПередатьДанныеВЛичныйКабинетКлиента();		
		КонецЕсли;
		
		// Если были ошибки, сохраняем их
		Если ПриВыполненииВозниклиОшибки И Ошибки.Количество() > 0 Тогда
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Ошибки, ПараметрыКоманды.ДополнительнаяОбработкаСсылка);
		КонецЕсли;
				
		// Фиксируем успешное выполнение задания.
		РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(Экземпляр.Идентификатор);
		
		Если ПриВыполненииВозниклиОшибки Тогда
			
			// После 16-00 оповещаем пользователей
			ТекДата = ТекущаяДатаСеанса();
			Если ТекДата > НачалоДня(ТекДата) + 16 * 60 * 60 Тогда
				
				РеквизитыОповещения = Новый Структура();								
				РеквизитыОповещения.Вставить("Организация",	ЭтотОбъект.Организация);
				РеквизитыОповещения.Вставить("Дата",		Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
				РеквизитыОповещения.Вставить("Тема",		"Не выгружены данные по ИИС в ЛКК за " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
				РеквизитыОповещения.Вставить("Текст", 		"Данные в ЛКК не выгружены: не по всем договорам ИИС проведены регламентные операции за " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
											
				Справочники.Оповещения.СформироватьОповещения(ЭтотОбъект.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
			КонецЕсли;
			
			// Создаем новое задание на полчаса позже, если такого задания нет
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Организация", 	ЭтотОбъект.Организация);
			ПараметрыЗадания.Вставить("Объект",			ПараметрыКоманды.ДополнительнаяОбработкаСсылка);
			ПараметрыЗадания.Вставить("Состояния",		Перечисления.СостоянияОтложенныхЗаданий.Ожидание);
			ПараметрыЗадания.Вставить("Команда", 		"ОтправкаДанныхИИСВЛКК");
			
			Если РегистрыСведений.ОтложенныеЗадания.ЕстьОтложенноеЗадание(ТекДата, ТекДата, ПараметрыЗадания) Тогда
				Возврат;
			КонецЕсли;
		
			Параметры = Новый Структура("Организация, Период", ЭтотОбъект.Организация, НачалоДня(ЭтотОбъект.Период.ДатаОкончания));		
					
			Параметры.Вставить("ИсточникОшибки", 				"Выгрузка данных в личный кабинет клиента");  							
			Параметры.Вставить("ТекстОшибки",					"Не удалось добавить отложенное задание 'Выгрузка данных в личный кабинет клиента'.");  
			Параметры.Вставить("ДополнительнаяОбработкаСсылка", ПараметрыКоманды.ДополнительнаяОбработкаСсылка);
							
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(ПараметрыКоманды.ДополнительнаяОбработкаСсылка, "ОтправкаДанныхИИСВЛКК", Параметры, 15, Истина, ТекДата + 1800);

		Иначе
			
			// Оповещение об успешной выгрузке
			РеквизитыОповещения = Новый Структура();								
			РеквизитыОповещения.Вставить("Организация",	ЭтотОбъект.Организация);
			РеквизитыОповещения.Вставить("Дата",		Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			РеквизитыОповещения.Вставить("Тема",		"Успешно выгружены данные по ИИС в ЛКК за " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
			РеквизитыОповещения.Вставить("Текст", 		"Данные по ИИС в ЛКК выгружены успешно");
										
			Справочники.Оповещения.СформироватьОповещения(ЭтотОбъект.Метаданные().ПолноеИмя(), Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьМетод

////////////////////////////////////////////////////////////////////////////////

Функция ПередатьДанныеВЛичныйКабинетКлиента(Сообщать = Ложь) Экспорт
	
	// Организуем сбор статистики
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация, Период, Сервер");
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьМетод()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание
	);

	Ответ = ВыгрузитьКлиентов();
	
	ДатаНачала    = ЭтотОбъект.Период.ДатаНачала;
	ДатаОкончания = ЭтотОбъект.Период.ДатаОкончания;
	
	ВсеДниВыгружены = Истина;
	Пока ДатаНачала <= ДатаОкончания Цикл
		Ответ = Выгрузить(ДатаНачала, КонецДня(ДатаНачала));
		
		ВсеДниВыгружены = ?(Ответ <> "Данные записаны успешно", Ложь, ВсеДниВыгружены);
		
		Если Сообщать Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Ответ);
		КонецЕсли;
		
		ДатаНачала = ДатаНачала + 86400;
	КонецЦикла; 
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат ВсеДниВыгружены;
	
КонецФункции

Функция Выгрузить(ДатаНачала, ДатаОкончанияДень) Экспорт
	
	ДанныеДляЗаполнения = ПолучитьДанныеДляЗаполнения(ДатаНачала, ДатаОкончанияДень);
	
	Возврат ЗаписатьДанные(ДанныеДляЗаполнения, ДатаНачала, ДатаОкончанияДень);
	
КонецФункции	

Функция ВыгрузитьКлиентов() Экспорт
	
	ДанныеДляЗаполнения = ПолучитьДанныеКлиентов();
	
	Возврат ЗаписатьДанныеКлиентов(ДанныеДляЗаполнения);
	
КонецФункции


Процедура ПолучитьСчетаДоверительногоУправления(Запрос)
	
	Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _КлиентыИСчета
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаСреза,
		|			СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|				И СчетДоверительногоУправления.Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения > &ДатаСреза
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	
	Если Не ЭтотОбъект.ПередатьВсехКлиентов Тогда
		Текст = СтрЗаменить(Текст, "ИндивидуальныйИнвестиционныйСчет)", "ИндивидуальныйИнвестиционныйСчет) И Клиент В (&Клиенты)"); 	
		Запрос.УстановитьПараметр("Клиенты", Клиенты.ВыгрузитьКолонку("Клиент"));
	КонецЕсли; 
	
	Запрос.Текст = Текст;
	
	Запрос.Выполнить();
	
КонецПроцедуры // ПолучитьСчетаДоверительногоУправления

Функция ПолучитьДанныеДляЗаполнения(ДатаНачала, ДатаОкончанияДень)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаОкончанияДень);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончанияДень);
	Запрос.УстановитьПараметр("КонецПериодаНачалоДня", НачалоДня(ДатаОкончанияДень));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	МассивАктивов = Новый Массив;
	МассивАктивов.Добавить(Перечисления.ВидыАктивов.ДебиторскаяЗадолженность);
	МассивАктивов.Добавить(Перечисления.ВидыАктивов.ДенежныеСредства);
	Запрос.УстановитьПараметр("МассивАктивов", МассивАктивов);
	
	ПолучитьСчетаДоверительногоУправления(Запрос);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыИСчета.Клиент КАК Клиент,
		|	КлиентыИСчета.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	КлиентыИСчета.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Наименование КАК Стратегия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности.Наименование КАК ВидДокумента,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаОкончанияДействияУдостоверенияЛичности КАК ДатаОкончанияДействияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительства КАК АдресМестаЖительства,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрацииФИАС КАК АдресРегистрацииФИАС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительстваФИАС КАК АдресМестаЖительстваФИАС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ПочтовыйАдресФИАС КАК ПочтовыйАдресФИАС,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ИЗ
		|	_КлиентыИСчета КАК КлиентыИСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО (СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления = КлиентыИСчета.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаСреза,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыИСчета.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ДатаСреза,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО КлиентыИСчета.Клиент = КодыВоВнешнихСистемахСрезПоследних.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыИСчета.Клиент КАК Клиент,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот) КАК Внесено,
		|	МАКСИМУМ(ФинансовыеПоказателиРыночнаяСтоимостьАктивов.Значение) КАК ОценочнаяСтоимость
		|ИЗ
		|	_КлиентыИСчета КАК КлиентыИСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|				,
		|				&ДатаСреза,
		|				Регистратор,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							КлиентыИСчета.СчетДоверительногоУправления
		|						ИЗ
		|							_КлиентыИСчета КАК КлиентыИСчета)
		|					И ВидОперацииВводаВыводаДС = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ПО (ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = КлиентыИСчета.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&ДатаСреза,
		|				Организация = &Организация
		|					И СубъектАналитики В
		|						(ВЫБРАТЬ
		|							КлиентыИСчета.СчетДоверительногоУправления
		|						ИЗ
		|							_КлиентыИСчета КАК КлиентыИСчета)
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.РыночнаяСтоимостьАктивов)) КАК ФинансовыеПоказателиРыночнаяСтоимостьАктивов
		|		ПО (ФинансовыеПоказателиРыночнаяСтоимостьАктивов.СубъектАналитики = КлиентыИСчета.СчетДоверительногоУправления)
		|
		|СГРУППИРОВАТЬ ПО
		|	КлиентыИСчета.Клиент,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК Клиент,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСчета КАК НомерСчета,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.БИК КАК БИК,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НаименованиеБанка КАК Банк,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.КоррСчет КАК КоррСчет,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Валюта.Код КАК ВалютаКод
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаСреза,
		|			Организация = &Организация
		|				И ЮрФизЛицо В
		|					(ВЫБРАТЬ
		|						КлиентыИСчета.Клиент
		|					ИЗ
		|						_КлиентыИСчета КАК КлиентыИСчета)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.БанковскиеРеквизиты КАК АнкетаФизическогоЛицаБанковскиеРеквизиты
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства"" КАК Тип,
		|	КлиентыИСчета.Клиент КАК Клиент,
		|	СУММА(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета) КАК Сумма
		|ИЗ
		|	_КлиентыИСчета КАК КлиентыИСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ПО КлиентыИСчета.СчетДоверительногоУправления = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива В(&МассивАктивов)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				КлиентыИСчета.СчетДоверительногоУправления
		|			ИЗ
		|				_КлиентыИСчета КАК КлиентыИСчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	КлиентыИСчета.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыИСчета.Клиент КАК Клиент,
		|	СтоимостьПереоценки.Рынок КАК ВидФинВложения,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, СтоимостьПереоценки.ЦеннаяБумага.Эмитент.Наименование) КАК Эмитент,
		|	СтоимостьПереоценки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	СтоимостьПереоценки.ЦеннаяБумага.ДатаПогашения КАК ДатаПогашения,
		|	СтоимостьПереоценки.Количество КАК Количество,
		|	СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета КАК СтоимостьВсего
		|ИЗ
		|	_КлиентыИСчета КАК _КлиентыИСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ПО _КлиентыИСчета.СчетДоверительногоУправления = СтоимостьПереоценки.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаСреза,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	СтоимостьПереоценки.СуммаВВалютеУчета <> 0
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.Период = &НачалоПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидФинВложения,
		|	Эмитент
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СДУ
		|ПОМЕСТИТЬ _СчетаДУСВводомАктивов
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			,
		|			&КонецПериода,
		|			Период,
		|			Организация = &Организация
		|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_КлиентыИСчета.СчетДоверительногоУправления
		|					ИЗ
		|						_КлиентыИСчета КАК _КлиентыИСчета)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыИСчета.Клиент КАК Клиент
		|ИЗ
		|	_КлиентыИСчета КАК _КлиентыИСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|		ПО _КлиентыИСчета.СчетДоверительногоУправления = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
		|			И (РегистрацияСтоимостиАктивов.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|			И (РегистрацияСтоимостиАктивов.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДУСВводомАктивов КАК _СчетаДУСВводомАктивов
		|		ПО _КлиентыИСчета.СчетДоверительногоУправления = _СчетаДУСВводомАктивов.СДУ
		|ГДЕ
		|	РегистрацияСтоимостиАктивов.Ссылка ЕСТЬ NULL
		|	И НЕ _СчетаДУСВводомАктивов.СДУ ЕСТЬ NULL";
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат МассивРезультатовЗапроса;	
	
КонецФункции	

Функция ПолучитьДанныеКлиентов()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(ЭтотОбъект.Организация), ЭтотОбъект.Организация, ПараметрыСеанса.ТекущаяОрганизация));
	
	ПолучитьСчетаДоверительногоУправления(Запрос);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	КлиентыИСчета.Клиент КАК Клиент,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ИЗ
		|	_КлиентыИСчета КАК КлиентыИСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаСреза,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыИСчета.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ДатаСреза,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО КлиентыИСчета.Клиент = КодыВоВнешнихСистемахСрезПоследних.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	РезультЗапроса = Запрос.Выполнить();
	
	Возврат РезультЗапроса;	

КонецФункции

Функция ЗаписатьДанныеКлиентов(ДанныеДляЗаполнения)
	
	Ответ = "";
	СообщениеОбОшибках = "";
	ДанныеПоФЗ = ДанныеДляЗаполнения.Выгрузить();
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение("Provider=SQLOLEDB;Server=" + ЭтотОбъект.Сервер + ";UID=svc_API_AM;PWD=p8z4gr39VAxXAfhn;Database=AMY");
	

	Если Соединение <> Неопределено Тогда
		Command_usp_Users_1C_Load = РаботаСВнешнимиСистемами.ADODBC_ПолучитьКомандуОбращенияКХранимойПроцедуре(Соединение, "usp_Users_1C_Load");
		Параметр = Command_usp_Users_1C_Load.CreateParameter("@x", 202, 1, -1, "");
		Command_usp_Users_1C_Load.Parameters.Append(Параметр);
		
		// записать данные всех клиентов
		
		Для каждого СтрокаФЗ Из ДанныеПоФЗ Цикл
			
			Телефон = ПреобразоватьТелефон(СтрокаФЗ.Телефоны);
			ДлинаТелефона = СтрДлина(Телефон);
			Если ДлинаТелефона < 2 Тогда
				СообщениеОбОшибках = СообщениеОбОшибках + СтрШаблон("У клиента %1 не заполнен телефон", СтрокаФЗ.Клиент) + Символы.ПС;
				Продолжить;
			Иначе
				Если ДлинаТелефона <> 11 Тогда
					СообщениеОбОшибках = СообщениеОбОшибках + СтрШаблон("У клиента %1 неправильно указан телефон %2", СтрокаФЗ.Клиент, СтрокаФЗ.Телефоны) + Символы.ПС;
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			
			ЗаписьXML=Новый ЗаписьXML(); 
			ЗаписьXML.УстановитьСтроку(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("Users"); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("User"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.Код, "Matrix_ID"); 
			ЗаписатьXML(ЗаписьXML,ПреобразоватьТелефон(СтрокаФЗ.Телефоны), "Phone"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.EMail, "EMail"); 
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ТекстXML = ЗаписьXML.Закрыть(); 
			
			Параметр.Value = ТекстXML;
			Попытка
				Command_usp_Users_1C_Load.Execute();
			Исключение
				Ответ = "Данные записаны с ошибками";
				ЗаписьЖурналаРегистрации("Обмен ЛКК",,,,"Ошибка записи клиента с ID " + СтрокаФЗ.Код + " по причине " + ОписаниеОшибки() + ", @x = " + ТекстXML +  ", тип @x = " + ТипЗнч(ТекстXML)); 
			КонецПопытки;

		КонецЦикла;
		
		Соединение.Close();
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СообщениеОбОшибках) Тогда
		Сообщить(СообщениеОбОшибках);
	КонецЕсли; 
	
	Возврат Ответ;

КонецФункции	

Функция ЗаписатьДанные(ДанныеДляЗаполнения, ДатаНачала, ДатаОкончанияДень)
	
	Ответ = "";
	СообщениеОбОшибках = "";
	
	ДанныеПоФЗ = ДанныеДляЗаполнения[0].Выгрузить();
	ДанныеПоОплатам = ДанныеДляЗаполнения[1].Выгрузить();
	ДанныеПоБС = ДанныеДляЗаполнения[2].Выгрузить();
	ДанныеПоДС = ДанныеДляЗаполнения[3].Выгрузить();
	ДанныеПоСоставуПортфеля = ДанныеДляЗаполнения[4].Выгрузить();                        
	ДанныеРегистрацияСтоимостиАктивов = ДанныеДляЗаполнения[6].Выгрузить();
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение("Provider=SQLOLEDB;Server=" + ЭтотОбъект.Сервер + ";UID=svc_API_AM;PWD=p8z4gr39VAxXAfhn;Database=AMY");
		
	Если Соединение <> Неопределено Тогда
		
		Command_usp_Users_Reports_Add = РаботаСВнешнимиСистемами.ADODBC_ПолучитьКомандуОбращенияКХранимойПроцедуре(Соединение, "usp_Users_Reports_Add");
		P_User = Command_usp_Users_Reports_Add.CreateParameter("@User_Matrix_ID", 202, 1, 128);
		Command_usp_Users_Reports_Add.Parameters.Append(P_User);
		
		P_Date = Command_usp_Users_Reports_Add.CreateParameter("@Date", 202, 1, 8);
		Command_usp_Users_Reports_Add.Parameters.Append(P_Date);
		
		P_XML  = Command_usp_Users_Reports_Add.CreateParameter("@XML", 202, 1, -1, "");
		Command_usp_Users_Reports_Add.Parameters.Append(P_XML);
		
		P_Report_Type = Command_usp_Users_Reports_Add.CreateParameter("@Report_Type", 202, 1, 128);
		Command_usp_Users_Reports_Add.Parameters.Append(P_Report_Type);
		
		
		ВалютаУчета = ПараметрыСеанса.ТекущаяОрганизация.ВалютаУчета;
		
		Для каждого СтрокаФЗ Из ДанныеПоФЗ Цикл
			
			Телефон = ПреобразоватьТелефон(СтрокаФЗ.Телефоны);

			СтрокиБС               = ДанныеПоБС.НайтиСтроки(Новый Структура("Клиент", СтрокаФЗ.Клиент));
			ЗаписьXML=Новый ЗаписьXML(); 
			ЗаписьXML.УстановитьСтроку(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЕжедневныйОтчет"); 
			ЗаписьXML.ЗаписатьАтрибут("тип",        "Персональные данные");
			ЗаписьXML.ЗаписатьАтрибут("ДатаОтчета",        Формат(ДатаНачала, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования",  Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("ВремяФормирования", Формат(ТекущаяДата(), "ДФ=hh:mm:ss"));
			ЗаписьXML.ЗаписатьАтрибут("ВерсияФорматаОтчета", "0,01");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Пользователь"); 
			ЗаписьXML.ЗаписатьАтрибут("КОД", СтрокаФЗ.Код);
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПерсональныеДанные"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.Стратегия, "Стратегия"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.НомерДоговора, "НомерДоговора"); 
			ЗаписатьXML(ЗаписьXML,Формат(СтрокаФЗ.ДатаДоговора, "ДФ=dd.MM.yyyy"), "ДатаДоговора"); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.Фамилия, "Фамилия"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.Имя, "Имя"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.Отчество, "Отчество");
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписатьXML(ЗаписьXML, Формат(СтрокаФЗ.ДатаРождения, "ДФ=dd.MM.yyyy"), "ДатаРождения"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.МестоРождения, "МестоРождения"); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДокументУдостоверенияЛичности"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.ВидДокумента, "ВидУдостоверенияЛичности"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.СерияУдостоверенияЛичности, "Серия"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.НомерУдостоверенияЛичности, "Номер"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.ДатаВыдачиУдостоверенияЛичности, "ДатаВыдачи"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.ОрганВыдавшийУдостоверениеЛичности, "КемВыдан"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.КодОрганаВыдавшегоУдостоверениеЛичности, "КодПодразд"); 
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.ИНН, "ИНН"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.СНИЛС, "СНИЛС"); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("БанковскиеРеквизиты"); 
			Для каждого СтрокаБС Из СтрокиБС Цикл
				ЗаписатьXML(ЗаписьXML,СтрокаБС.Банк, "НаименованиеБанка");
				ЗаписатьXML(ЗаписьXML,СтрокаБС.БИК, "БИК"); 
				ЗаписатьXML(ЗаписьXML,СтрокаБС.КоррСчет, "КС"); 
				ЗаписатьXML(ЗаписьXML,СтрокаБС.НомерСчета, "РС"); 
			КонецЦикла; 
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("КонтактнаяИнформация"); 
			ЗаписатьXML(ЗаписьXML,ПреобразоватьТелефон(СтрокаФЗ.Телефоны), "Телефоны"); 
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.EMail, "ЭлПочта"); 
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес"); 
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Место жительства");
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.АдресРегистрации, "АдресРегистрации"); 
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("Адрес"); 
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Почтовый");
			ЗаписатьXML(ЗаписьXML,СтрокаФЗ.ПочтовыйАдрес, "ПочтовыйАдрес"); 
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			ТекстXML = ЗаписьXML.Закрыть(); 
			
			P_User.Value  = СтрокаФЗ.Код;
			P_Date.Value  = Формат  (ДатаНачала, "ДФ=yyyyMMdd");
			P_XML.Value   = ТекстXML;
			P_Report_Type.Value = "Personal_Data";
			
			Попытка
				Command_usp_Users_Reports_Add.Execute();
			Исключение
				Ответ = "Данные записаны с ошибками";
				ЗаписьЖурналаРегистрации("Обмен ЛКК",,,,"Personal_Data Ошибка записи клиента с ID " + СтрокаФЗ.Код + " по причине " + ОписаниеОшибки()); 
			КонецПопытки;
			
			ЗаписьXML=Новый ЗаписьXML(); 
			ЗаписьXML.УстановитьСтроку(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПортфельКлиента"); 
			ЗаписьXML.ЗаписатьАтрибут("тип",        "Портфель клиента");
			ЗаписьXML.ЗаписатьАтрибут("ДатаОтчета",        Формат(ДатаНачала, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования",  Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("ВремяФормирования", Формат(ТекущаяДата(), "ДФ=hh:mm:ss"));
			
			СтрокиПоОплатам = ДанныеПоОплатам.НайтиСтроки(Новый Структура("Клиент", СтрокаФЗ.Клиент));
			СтрокиДС = ДанныеПоДС.НайтиСтроки(Новый Структура("Клиент", СтрокаФЗ.Клиент));
			СтрокиАкции = ДанныеПоСоставуПортфеля.НайтиСтроки(Новый Структура("Клиент, ВидФинВложения", СтрокаФЗ.Клиент, Перечисления.РынкиЦенныхБумаг.Акции));
			СтрокиОблигации = ДанныеПоСоставуПортфеля.НайтиСтроки(Новый Структура("Клиент, ВидФинВложения", СтрокаФЗ.Клиент, Перечисления.РынкиЦенныхБумаг.Облигации));
			СтрокиРегистрацияСтоимостиАктивов = ДанныеРегистрацияСтоимостиАктивов.НайтиСтроки(Новый Структура("Клиент", СтрокаФЗ.Клиент));
			
			Если СтрокиРегистрацияСтоимостиАктивов.Количество() <> 0 Тогда
				СообщениеОбОшибках = СообщениеОбОшибках + СтрШаблон("Не проведен документ Регистрация стоимости активов по клиенту %1 на дату %2", СтрокаФЗ.Клиент, Формат(ДатаНачала, "ДФ=dd.MM.yyyy")) + Символы.ПС;
			Иначе	
					ЗаписьXML.ЗаписатьНачалоЭлемента("Пользователь"); 
					ЗаписьXML.ЗаписатьАтрибут("КОД", СтрокаФЗ.Код);
					ЗаписьXML.ЗаписатьНачалоЭлемента("ГлавнаяСтраница");
					Если СтрокиПоОплатам.Количество() > 0 Тогда
						СтрокаПоОплатам = СтрокиПоОплатам[0];
						ЗаписатьXML(ЗаписьXML, Формат(СтрокаПоОплатам.Внесено, "ЧДЦ=2; ЧРД=.; ЧГ=0"), "Внесено"); 
						ЗаписатьXML(ЗаписьXML, Формат(СтрокаПоОплатам.ОценочнаяСтоимость, "ЧДЦ=2; ЧРД=.; ЧГ=0"), "ОценочнаяСтоимость"); 
					Иначе
						ЗаписатьXML(ЗаписьXML,0, "Внесено"); 
						ЗаписатьXML(ЗаписьXML,0, "ОценочнаяСтоимость"); 
					КонецЕсли;  
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("СоставПортфеля");
					// денежные средства
					ЗаписьXML.ЗаписатьНачалоЭлемента("Актив");
					ЗаписьXML.ЗаписатьАтрибут("Эмитент", "Денежные средства");
					ЗаписьXML.ЗаписатьАтрибут("ДатаПогашения", "");
					ЗаписьXML.ЗаписатьАтрибут("НомерГосРегISIN", "");
					Если СтрокиДС.Количество() > 0 Тогда
						СтрокаДС = СтрокиДС[0];
						ЗаписьXML.ЗаписатьАтрибут("Тип", СтрокаДС.Тип);
						СуммаДС = СтрокаДС.Сумма;
					Иначе
						ЗаписьXML.ЗаписатьАтрибут("Тип", "Денежные средства");
						СуммаДС = 0;
					КонецЕсли; 
					ЗаписатьXML(ЗаписьXML,"", "Количество"); 
					ЗаписьXML.ЗаписатьНачалоЭлемента("Стоимость");
					ЗаписьXML.ЗаписатьАтрибут("Валюта", ВалютаУчета.Наименование);
					ЗаписьXML.ЗаписатьТекст(Формат(СуммаДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьКонецЭлемента();
					// акции
					Для каждого СтрокаАкции Из СтрокиАкции Цикл
						ЗаписьXML.ЗаписатьНачалоЭлемента("Актив");
						ЗаписьXML.ЗаписатьАтрибут("Тип", Строка(СтрокаАкции.ВидФинВложения));
						ЗаписьXML.ЗаписатьАтрибут("НомерГосРегISIN", СтрокаАкции.ГосударственныйРегистрационныйНомер);
						ЗаписьXML.ЗаписатьАтрибут("ДатаПогашения", "");
						ЗаписьXML.ЗаписатьАтрибут("Эмитент", СтрокаАкции.Эмитент);
						
						ЗаписатьXML(ЗаписьXML,Формат(СтрокаАкции.Количество, "ЧРД=.; ЧГ=0"), "Количество"); 
						ЗаписьXML.ЗаписатьНачалоЭлемента("Стоимость");
						ЗаписьXML.ЗаписатьАтрибут("Валюта", ВалютаУчета.Наименование);
						ЗаписьXML.ЗаписатьТекст(Формат(СтрокаАкции.СтоимостьВсего, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
						ЗаписьXML.ЗаписатьКонецЭлемента();
						ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЦикла; 
					// облигации
					Для каждого СтрокаОблигации Из СтрокиОблигации Цикл
						ЗаписьXML.ЗаписатьНачалоЭлемента("Актив");
						ЗаписьXML.ЗаписатьАтрибут("Тип", Строка(СтрокаОблигации.ВидФинВложения));
						ЗаписьXML.ЗаписатьАтрибут("НомерГосРегISIN", СтрокаОблигации.ГосударственныйРегистрационныйНомер);
						ЗаписьXML.ЗаписатьАтрибут("ДатаПогашения", Формат(СтрокаОблигации.ДатаПогашения, "ДФ=dd.MM.yyyy"));
						ЗаписьXML.ЗаписатьАтрибут("Эмитент", СтрокаОблигации.Эмитент);
						
						ЗаписатьXML(ЗаписьXML, Формат(СтрокаОблигации.Количество, "ЧРД=.; ЧГ=0"), "Количество"); 
						ЗаписьXML.ЗаписатьНачалоЭлемента("Стоимость");
						ЗаписьXML.ЗаписатьАтрибут("Валюта", ВалютаУчета.Наименование);
						ЗаписьXML.ЗаписатьТекст(Формат(СтрокаОблигации.СтоимостьВсего, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
						ЗаписьXML.ЗаписатьКонецЭлемента();
						ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЦикла; 
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ТекстXML = ЗаписьXML.Закрыть(); 
					
					P_XML.Value   = ТекстXML;
					P_Report_Type.Value = "Portfolio";
					
					Попытка
						Command_usp_Users_Reports_Add.Execute();
					Исключение
						Ответ = "Данные записаны с ошибками";
						ЗаписьЖурналаРегистрации("Обмен ЛКК",,,, "Portfolio Ошибка записи клиента с ID " + СтрокаФЗ.Код + " по причине " + ОписаниеОшибки()); 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстXML);
					КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если Ответ = "" И ДанныеПоФЗ.Количество() > 0 Тогда
			Ответ = "Данные записаны успешно";
		КонецЕсли; 
		
		Соединение.Close();
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СообщениеОбОшибках) Тогда
		Сообщить(СообщениеОбОшибках);
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции 

Функция ПреобразоватьТелефон(Телефон)
	
	ПравильныйФорматТелефона = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Телефон, " ", ""), "+", ""), "-", ""), "(", ""), ")", "");
	Если Лев(ПравильныйФорматТелефона, 1) = "8" Тогда
		ПравильныйФорматТелефона = "7" + Прав(ПравильныйФорматТелефона, СтрДлина(ПравильныйФорматТелефона) - 1);
	КонецЕсли; 
	Если СтрДлина(ПравильныйФорматТелефона) < 11 Тогда
		ПравильныйФорматТелефона = "7" + ПравильныйФорматТелефона;	
	КонецЕсли;	
	
	Возврат ПравильныйФорматТелефона;
	
КонецФункции // ПреобразоватьТелефон()
