
&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтаФорма.Элементы.Клиенты.Видимость = НЕ ЭтаФорма.Объект.ПередатьВсехКлиентов;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Период               = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	Объект.Организация          = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ПередатьВсехКлиентов = Истина;
	Объект.Сервер               = "ap25.G1.LAN";
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьКлиентовПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПередатьДанныеВЛичныйКабинетКлиента(Команда)
	
	ПередатьДанныеВЛичныйКабинетКлиентаНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередатьДанныеВЛичныйКабинетКлиентаНаСервере()
	
	РеквизитФормыВЗначение("Объект").ПередатьДанныеВЛичныйКабинетКлиента(Истина);

КонецПроцедуры