
Процедура ПередЗаписью(Отказ, Замещение)
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//#422967
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
			Если Запись.ПереоцениватьВДеньОперации Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Переоценивать в день операции' противоречит настройке 'Периодичность переоценки'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);			
			КонецЕсли;
			Если Запись.ПереоцениватьВНерабочиеДни Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Переоценивать в нерабочие дни' противоречит настройке 'Периодичность переоценки'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);				
			КонецЕсли;	
		КонецЕсли;	
		
		Если Запись.ПериодичностьНачисленияПроцентныхДоходов = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать Тогда
			Если Запись.НачислятьПроцентныеДоходыВДеньОперации Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Начислять процентные доходы в день операции' противоречит настройке 'Периодичность начисления процентных доходов'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
			КонецЕсли;
			Если Запись.НачислятьПроцентныеДоходыВНерабочиеДни Тогда 
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Начислять процентные доходы в нерабочие дни' противоречит настройке 'Периодичность начисления процентных доходов'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);	
			Конецесли;	
		КонецЕсли;	
		
		Если Запись.ПериодичностьНачисленияКорректировкиЭСП = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать
			И Запись.НачислятьКорректировкуЭСПВДеньОперации Тогда
				ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'НачислятьКорректировкуЭСПВДеньОперации' противоречит настройке 'Периодичность начисления корректировки ЭСП'. Вид учета = " + Запись.ВидУчета + ", Учетный актив = " + Запись.УчетныйАктив;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;	
			
		Если Запись.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет
			И (Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения
				ИЛИ Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД)Тогда
		
			Запись.ПериодичностьПереоценки = Перечисления.ПериодичностьПереоценкиАктивов.НеПереоценивать;
			Запись.ПереоцениватьВДеньОперации = Ложь;
			Запись.ПереоцениватьВНерабочиеДни = Ложь;
		
		КонецЕсли;
		
		//#538027 Хардкод. Для этих видов Учетного актива нет методики по расчету резервов ОКУ на дату признания. Запретим пока устанавливать им этот флаг.
		Если (Запись.УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДенежныеСредстваНаРасчетномСчете 
			ИЛИ Запись.УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДенежныеСредстваУБрокера) 
			И Запись.НачислятьРезервОКУПриПервоначальномПризнании Тогда
			
			ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Начислять резерв ОКУ при первоначальном признании' для " + Справочники.УчетныеАктивыЕПС.ДенежныеСредстваНаРасчетномСчете + " по текущей методике не предусматривает значение Истина" ;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Запись.НачислятьРезервОКУПриПервоначальномПризнании = Ложь;
			
		КонецЕсли;
		
		Если (Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения
			ИЛИ Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи
			ИЛИ Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток
			ИЛИ Запись.УчетныйАктив.Родитель = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД)
			И Не Запись.СписыватьРезервОКУНаДатуПрекращенияПризнания Тогда
			
			ТекстСообщения = "" + Запись.СчетДоверительногоУправления + ": Значение настройки 'Списывать резерв ОКУ на дату прекращения признания' для долговых ценных бумаг может принимать значение только Истина";
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Запись.СписыватьРезервОКУНаДатуПрекращенияПризнания = Истина;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры
