
&НаСервереБезКонтекста
Функция СообщитьОбИсточнике(Источник)
	
	Возврат " Клиент: " + Источник.Клиент + ". Счет: " + Источник.БухСчет + ". Субконто № " + Источник.НомерСубконто;
	
КонецФункции // СообщитьОбИсточнике

&НаСервереБезКонтекста
Функция ВыделитьРеквизитыДоговораИзНаименования(Знач Наименование)

	// обычно наименование соотв. шаблону "{Договор }№{ }[НомерДоговора]{ }от{ }[ДатаДоговора]{ года}"
	
	РеквизитыДоговора = Новый Структура("Номер, ДатаЗаключения", "", "");
	
	ПозНомер = Найти(Наименование, "№");
	ПозОт    = Найти(Наименование, "от");
	
	Если ПозОт = 0 Тогда
		Сообщить("Не удалось выделить дату договора из строки '" + Наименование + "'");
		РеквизитыДоговора.Номер = СокрЛП(Сред(Наименование, ПозНомер + 1));
		Возврат РеквизитыДоговора;
	КонецЕсли;
	
	РеквизитыДоговора.Номер = СокрЛП(Сред(Наименование, ПозНомер + 1, ПозОт - ПозНомер - 1));
	
	Для Инд = ПозОт + 2 По СтрДлина(Наименование) Цикл
		ТекСимв = Сред(Наименование, Инд, 1);
		
		Если ТекСимв = " " Тогда
			Продолжить;
		ИначеЕсли Найти("0123456789.", ТекСимв) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		РеквизитыДоговора.ДатаЗаключения = РеквизитыДоговора.ДатаЗаключения + ТекСимв;
	КонецЦикла;
	
	РеквизитыДоговора.ДатаЗаключения = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(РеквизитыДоговора.ДатаЗаключения);
	
	Возврат РеквизитыДоговора;
	
КонецФункции // ВыделитьРеквизитыДоговораИзНаименования

&НаСервереБезКонтекста
Функция НайтиОбъектПоКодуМатрих(КэшОбъектов, ВидОбъекта, Идрб, Источник)
	
	Если Идрб = "0" Тогда
		Сообщить("Поиск объектов '" + ВидОбъекта + "' по коду Матрих '" + Идрб + "' не поддерживается." + СообщитьОбИсточнике(Источник));
		Возврат Неопределено;
	КонецЕсли;

	Ключ       = ВидОбъекта + "." + Идрб;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;
	
	ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию(ВидОбъекта, Истина, Ложь);
	
	Если Не ЗначениеЗаполнено(ГруппаОбъектов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемах.Объект
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах КАК КодыВоВнешнихСистемах
		|ГДЕ
		|	КодыВоВнешнихСистемах.ВнешняяСистема = &ВнешняяСистема
		|	И КодыВоВнешнихСистемах.ГруппаОбъектов = &ГруппаОбъектов
		|	И КодыВоВнешнихСистемах.Код = &Код";
		
	Запрос.Параметры.Вставить("ВнешняяСистема", Справочники.ВнешниеСистемы.Матрих);
	Запрос.Параметры.Вставить("ГруппаОбъектов", ГруппаОбъектов);
	Запрос.Параметры.Вставить("Код",            Идрб);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Знч = Выборка.Объект;
		
	Иначе
		// попытаемся загрузить объект из Х-Компани
		ОбработкаИмпортНСИ = Обработки.ИмпортНормативноСправочнойИнформации.Создать();
		
		Если Не РаботаСПользователями.ПраваДоступны(ОбработкаИмпортНСИ, "Использование") Тогда
			Сообщить("Не удалось найти объект '" + ВидОбъекта + "' по коду Матрих '" + Идрб + "'" + СообщитьОбИсточнике(Источник));
			Знч = Справочники[?(ВидОбъекта = "ЮридическиеЛица" Или ВидОбъекта = "ФизическиеЛица", "ЮрФизЛица", ВидОбъекта)].ПустаяСсылка();
			
		Иначе
			ОбработкаИмпортНСИ.Организация    = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
			ОбработкаИмпортНСИ.ГруппаПравил   = "Матрих";
			ОбработкаИмпортНСИ.ГруппаОбъектов = ГруппаОбъектов;
			
			ОбработкаИмпортНСИ.Подразделение = Справочники.Подразделения.ГруппаКомпаний;
			ОбработкаИмпортНСИ.Язык          = Справочники.Языки.Русский;
			
			СтрокаИмпортируемыеОбъекты = ОбработкаИмпортНСИ.ИмпортируемыеОбъекты.Добавить();
			СтрокаИмпортируемыеОбъекты.КодВоВнешнейСистеме = Идрб;
			
			ОбработкаИмпортНСИ.ИмпортироватьДанные();
			
			// повторно проверим наличие объекта
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Знч = Выборка.Объект;
			Иначе
				Сообщить("Не удалось найти объект '" + ВидОбъекта + "' по коду Матрих '" + Идрб + "'" + СообщитьОбИсточнике(Источник));
				Знч = Справочники[?(ВидОбъекта = "ЮридическиеЛица" Или ВидОбъекта = "ФизическиеЛица", "ЮрФизЛица", ВидОбъекта)].ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;
	
КонецФункции // НайтиОбъектПоКодуМатрих

&НаСервереБезКонтекста
Функция НайтиДепозитныйВклад(КэшОбъектов, Ид, Источник)
	
	Ключ       = "ДепозитныйВклад." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;
	
	ПозРазд = Найти(Ид, "/");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитныеВклады.Ссылка
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДепозитныеВклады.НомерПодтверждения = """"
		|				ТОГДА ДепозитныеВклады.БанковскийСчет.Договор.ДатаЗаключения
		|			ИНАЧЕ ДепозитныеВклады.ДатаПодтверждения
		|		КОНЕЦ = &ДатаДоговора
		|	И ВЫБОР
		|			КОГДА ДепозитныеВклады.НомерПодтверждения = """"
		|				ТОГДА ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора
		|			ИНАЧЕ ДепозитныеВклады.БанковскийСчет.Договор.НомерДоговора + "" ("" + ДепозитныеВклады.НомерПодтверждения + "")""
		|		КОНЕЦ = &НомерДоговора";
		
	Запрос.УстановитьПараметр("ДатаДоговора",  РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(Ид, ПозРазд - 1)));
	Запрос.УстановитьПараметр("НомерДоговора", Сред(Ид, ПозРазд + 1));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не удалось найти депозитный вклад по ИД '" + Ид + "'" + СообщитьОбИсточнике(Источник));
		Знч = Справочники.ДепозитныеВклады.ПустаяСсылка();
	Иначе
		Знч = Выборка.Ссылка;
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;
	
КонецФункции // НайтиДепозитныйВклад

&НаСервереБезКонтекста
Функция НайтиБанковскойСчет(КэшОбъектов, Ид, Источник)
	
	Ключ       = "БанковскойСчет." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;

	ПозРазд = Найти(Ид, "/");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Банк.Код = &Код";
		
	Запрос.УстановитьПараметр("НомерСчета", Лев(Ид, ПозРазд - 1));
	Запрос.УстановитьПараметр("Код",        Сред(Ид, ПозРазд + 1));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не удалось найти банковский счет по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
		Знч = Справочники.БанковскиеСчета.ПустаяСсылка();
	Иначе
		Знч = Выборка.Ссылка;
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;

КонецФункции // НайтиБанковскойСчет

&НаСервереБезКонтекста
Функция НайтиОбъектАналитикиБУ(КэшОбъектов, Ид, Источник)
	
	Ключ       = "ОбъектАналитикиБУ." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеДоходыИРасходы.Ссылка
		|ИЗ
		|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
		|ГДЕ
		|	ПрочиеДоходыИРасходы.Наименование = &Наименование";
		
	Запрос.УстановитьПараметр("Наименование", Ид);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не удалось найти объект аналитики БУ по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
		Знч = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	Иначе
		Знч = Выборка.Ссылка;
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;

КонецФункции // НайтиОбъектАналитикиБУ

&НаСервереБезКонтекста
Функция НайтиДоговорБрокерскогоОбслуживания(КэшОбъектов, Ид, Источник)
	
	Если Ид = "Договор №1768-Ю/031213Б от 03.12.13 года" Тогда //мне лень
		Ид = "БК ""РЕГИОН"", № 1768-Ю/031213Б от 03.12.2013";
	КонецЕсли;
	Если Ид = "Договор №1440-Ю/271210Б от 27.12.2010 года" Тогда //ппц мне лень
		Ид = "БК ""РЕГИОН"", № 1440-Ю/271210Б от 27.12.2010";
	КонецЕсли;
	
	Ключ       = "ДоговорБрокерскогоОбслуживания." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыБрокерскогоОбслуживания.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыБрокерскогоОбслуживания КАК ДоговорыБрокерскогоОбслуживания
		|ГДЕ
		|	НЕ ДоговорыБрокерскогоОбслуживания.ПометкаУдаления
		|	И ДоговорыБрокерскогоОбслуживания.Наименование = &Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Договоры.Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И Договоры.Наименование = &Наименование";
		
	Запрос.УстановитьПараметр("Наименование", Ид);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("Не удалось найти брок. договор по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
		Знч = Справочники.Договоры.ПустаяСсылка();
	Иначе
		Знч = Выборка.Ссылка;
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;	
	
КонецФункции // НайтиДоговорБрокерскогоОбслуживания

&НаСервереБезКонтекста
Функция НайтиДоговорБрокерскогоОбслуживания7614(Брокер, Дата, СчетДоверительногоУправления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Период,
		|			Брокер = &Брокер
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних";

	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Период", Дата);	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ДоговорБрокерскогоОбслуживания;
	Иначе
		Сообщить("Не удалось найти договор брокерского обслуживания клиента '" + СчетДоверительногоУправления + "' с брокером '" + Брокер + "' на " + Дата);
	КонецЕсли;
	
	Возврат Справочники.Договоры.ПустаяСсылка();
	
КонецФункции // НайтиДоговорБрокерскогоОбслуживания7614


&НаСервереБезКонтекста
Функция НайтиДоговорДепозитарногоОбслуживания(КэшОбъектов, Ид, Источник)
	
	Ключ       = "ДоговорБрокерскогоОбслуживания." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;

	Если Ид = "" Или ВРег(Ид) = "ВОЗНАГРАЖДЕНИЕ ДЕПО" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор КАК Договор
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|ГДЕ
			|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления";
			
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Источник.Клиент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если      Выборка.Количество() = 0 Тогда 
			Сообщить("Не удалось найти деп. договор по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
			Знч = Справочники.Договоры.ПустаяСсылка();
		ИначеЕсли Выборка.Количество() > 1 Тогда 
			Сообщить("Найдено более одного деп. договора по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
			Знч = Справочники.Договоры.ПустаяСсылка();
		ИначеЕсли Выборка.Следующий() Тогда
			Знч = Выборка.Договор;
		КонецЕсли;
		
	Иначе
		РеквизитыДоговора = ВыделитьРеквизитыДоговораИзНаименования(Ид);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Договоры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	НЕ Договоры.ПометкаУдаления
			|	И Договоры.Организация = &Организация
			|	И Договоры.Контрагент = &Контрагент
			|	И Договоры.НомерДоговора = &НомерДоговора
			|	И Договоры.ДатаЗаключения = &ДатаЗаключения";
			
		Запрос.УстановитьПараметр("Организация",    Источник.Организация);
		Запрос.УстановитьПараметр("Контрагент",    Источник.ПрочаяАналитика.Депозитарий);
		Запрос.УстановитьПараметр("НомерДоговора",  РеквизитыДоговора.Номер);
		Запрос.УстановитьПараметр("ДатаЗаключения", РеквизитыДоговора.ДатаЗаключения);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			Сообщить("Не удалось найти деп. договор по ИД '" + Ид + "'." + СообщитьОбИсточнике(Источник));
			Знч = Справочники.Договоры.ПустаяСсылка();
		Иначе
			Знч = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;	
	
КонецФункции // НайтиДоговорДепозитарногоОбслуживания

&НаСервереБезКонтекста
Функция ДесериализоватьЗначение(КэшОбъектов, Тип, Вид, Ид, Источник)
	
	Ключ = "{" + Тип + "." + Вид + "}";
	
	Если КэшОбъектов.Найти(Ключ, "Ключ") <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Тип = "Справочник" Тогда
		Если      Вид = "Акции" Или Вид = "Облигации" Или Вид = "Паи" Или Вид = "Векселя" Тогда
			Возврат НайтиОбъектПоКодуМатрих(КэшОбъектов, Вид, Ид, Источник);
		ИначеЕсли Вид = "Контрагенты" Тогда
			ПозРазд = Найти(Ид, "/");
			Возврат НайтиОбъектПоКодуМатрих(КэшОбъектов, Лев(Ид, ПозРазд - 1), Сред(Ид, ПозРазд + 1), Источник);
		ИначеЕсли Вид = "Депозиты" Тогда
			Возврат НайтиДепозитныйВклад(КэшОбъектов, Ид, Источник);
		ИначеЕсли Вид = "БанкиФирмы" Тогда
			Возврат НайтиБанковскойСчет(КэшОбъектов, Ид, Источник);
		ИначеЕсли Вид = "ПрочиеДоходыИРасходы" Тогда
			Возврат НайтиОбъектАналитикиБУ(КэшОбъектов, Ид, Источник);
		ИначеЕсли Вид = "БанкиФирмыБрокер" Тогда
			Возврат Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(
				НайтиОбъектПоКодуМатрих(КэшОбъектов, "ЮридическиеЛица", Ид, Источник), "БрокерскиеКомпании");
		ИначеЕсли Вид = "ДоговорБрокерскогоОбслуживания" Тогда
			Возврат НайтиДоговорБрокерскогоОбслуживания(КэшОбъектов, Ид, Источник);
		ИначеЕсли Вид = "ДоговорДепозитарногоОбслуживания" Тогда
			Возврат НайтиДоговорДепозитарногоОбслуживания(КэшОбъектов, Ид, Источник);
		ИначеЕсли Вид = "Договор" Или Вид = "Фирмы" Тогда // пока пропускаем, если где-то стрельнет, будем дорабатывать
			Возврат Неопределено;
		Иначе
			Возврат Неопределено; // выгружено пустое значение неопред. вида
		КонецЕсли;
		
	ИначеЕсли Тип = "Документ" Тогда
		
		ИД = Новый УникальныйИдентификатор("92b0000c-2931-cdc5-11e3-9fa3c5763c46");
		
		Возврат Документы.Сделка.ПолучитьСсылку(ИД);
		
	ИначеЕсли Тип = "Перечисление" Тогда
		Если Вид = "ПоВидуОбращенияНаОРЦБ" Тогда
			Если      Ид = "ОРЦБ" Тогда
				Возврат Истина;
			ИначеЕсли Ид = "НеОРЦБ" Тогда
				Возврат Ложь;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		ИначеЕсли Вид = "ВидОблигаций" Тогда // не актуально
			НоваяСтрокаКэша = КэшОбъектов.Добавить();
			НоваяСтрокаКэша.Ключ = Ключ;
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрокаКэша = КэшОбъектов.Добавить();
	НоваяСтрокаКэша.Ключ = Ключ;
	
	Сообщить("Не задано правило десериализации объекта " + Тип + ?(ПустаяСтрока(Вид), "", "." + Вид) + "." + СообщитьОбИсточнике(Источник));
	
	Возврат Неопределено;
	
КонецФункции // ДесериализоватьЗначение

&НаСервереБезКонтекста
Функция ДесериализоватьВалюту(КэшОбъектов, Ид, Источник)
	
	Ключ       = "Валюты." + Ид;
	СтрокаКэша = КэшОбъектов.Найти(Ключ, "Ключ");
	
	Если СтрокаКэша <> Неопределено Тогда
		Возврат СтрокаКэша.Знч;
	КонецЕсли;

	Если Ид = "руб" Тогда
		Ид = "RUB";
	КонецЕсли;
	
	Знч = Справочники.Валюты.НайтиПоНаименованию(Ид, Истина); 
	
	Если Не ЗначениеЗаполнено(Знч) Тогда
		Сообщить("Не удалось найти валюту по наименованию '" + Ид + "'" + СообщитьОбИсточнике(Источник));
		Знч = Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;

	СтрокаКэша = КэшОбъектов.Добавить();
	СтрокаКэша.Ключ = Ключ;
	СтрокаКэша.Знч  = Знч;
	
	Возврат Знч;

КонецФункции // ДесериализоватьВалюту


&НаСервереБезКонтекста
Функция ПолучитьКорректировкуРегистров(Период, Организация, Клиент, ИмяРегистра)
	
	Комментарий = "Ввод начальных бух. остатков, " + Клиент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРегистров.Ссылка
		|ИЗ
		|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|ГДЕ
		|	КорректировкаРегистров.Организация = &Организация
		|	И КорректировкаРегистров.Дата = &Дата
		|	И КорректировкаРегистров.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И КорректировкаРегистров.Комментарий ПОДОБНО &Комментарий";
		
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("Дата",                         Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Клиент);
	Запрос.УстановитьПараметр("Комментарий",                  Комментарий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		КорректировкаРегистров = Документы.КорректировкаРегистров.СоздатьДокумент();
		КорректировкаРегистров.Дата                         = Период;
		КорректировкаРегистров.Организация                  = Организация;
		КорректировкаРегистров.СчетДоверительногоУправления = Клиент;
		КорректировкаРегистров.Ответственный                = РаботаСПользователями.ТекущийПользователь();
		КорректировкаРегистров.Комментарий                  = Комментарий;
		
		СтрокаТаблицаРегистров = КорректировкаРегистров.ТаблицаРегистров.Добавить();
		СтрокаТаблицаРегистров.Имя = ИмяРегистра;
		
		КорректировкаРегистров.Записать();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + КорректировкаРегистров, КорректировкаРегистров.Ссылка);
		
	Иначе
		КорректировкаРегистров = Выборка.Ссылка;
		
		Если КорректировкаРегистров.ТаблицаРегистров.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
			КорректировкаРегистров = КорректировкаРегистров.ПолучитьОбъект();
						
			СтрокаТаблицаРегистров = КорректировкаРегистров.ТаблицаРегистров.Добавить();
			СтрокаТаблицаРегистров.Имя = ИмяРегистра;
			
			КорректировкаРегистров.Записать();
			Сообщить("Изменен состав регистров в документе " + КорректировкаРегистров + ". Клиент: " + Клиент + ".");
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат КорректировкаРегистров.Ссылка;
	
КонецФункции // ПолучитьКорректировкуРегистров

&НаСервереБезКонтекста
Функция ПолучитьНаборЗаписейРегистраДляЗаписи(Период, Организация, Клиент, ИмяРегистра)
	
	Регистратор = ПолучитьКорректировкуРегистров(Период, Организация, Клиент, ИмяРегистра);
	
	НаборЗаписей = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Возврат НаборЗаписей;
	
КонецФункции // ПолучитьНаборЗаписейРегистраДляЗаписи

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьВНабор(НаборЗаписей, РеквизитыСчета, Период, Организация, Клиент, ИмяРегистра)
	
	Если Не ЗначениеЗаполнено(РеквизитыСчета.Счет) Тогда
		Возврат;
	КонецЕсли;
	
	// по 58-м счетам возможна загрузка "зависших" остатков, т.е. тех, в которых
	//   количество задано, а сумма нулевая;
	// чтобы не загружать к себе "левые" ценные бумаги, которые уже 100 лет как
	//   не используются, проверим наличие указанного количества на бух. партиях
	Если РеквизитыСчета.Сумма = 0 И РеквизитыСчета.Количество <> 0
		И РеквизитыСчета.Счет.ПринадлежитЭлементу(ПланыСчетов.Основной.ФинансовыеВложения)
	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ЦеннаяБумага = &ЦеннаяБумага
			|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагОстатки
			|ГДЕ
			|	БухПартииЦенныхБумагОстатки.КоличествоОстаток <> 0";
			
		Запрос.УстановитьПараметр("Период",                       Новый Граница(Период, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",                  Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Клиент);
		Запрос.УстановитьПараметр("ЦеннаяБумага",                 РеквизитыСчета.Субконто1);
		Запрос.УстановитьПараметр("ВидУчета",                     Перечисления.ВидыУчета[ИмяРегистра]);
		
		Выборка = Запрос.Выполнить();
		
		Если Выборка.Пустой() Тогда
			Сообщить("Пропущен ""зависший"" остаток на счете " + РеквизитыСчета.Счет.Код + " регистра " + Перечисления.ВидыУчета[ИмяРегистра] + " по ц/б " + РеквизитыСчета.Субконто1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВидыСубконто = РеквизитыСчета.Счет.ВидыСубконто;
	
	МенеджерЗаписи = НаборЗаписей.Добавить();
	
	МенеджерЗаписи.Период                       = Период;
	МенеджерЗаписи.Организация                  = Организация;
	МенеджерЗаписи.СчетДоверительногоУправления = Клиент;
	МенеджерЗаписи.Содержание                   = "Ввод начальных остатков";
	
	Если РеквизитыСчета.Счет.Вид = ВидСчета.Активный
		Или (РеквизитыСчета.Счет.Вид = ВидСчета.АктивноПассивный И РеквизитыСчета.Сумма > 0)
	Тогда
		МенеджерЗаписи.СчетДт          = РеквизитыСчета.Счет;
		
		Если РеквизитыСчета.Счет.Количественный Тогда
			МенеджерЗаписи.КоличествоДт    = РеквизитыСчета.Количество;
		КонецЕсли;
		
		Если РеквизитыСчета.Счет.Валютный Тогда
			МенеджерЗаписи.ВалютаДт        = РеквизитыСчета.Валюта;
			МенеджерЗаписи.ВалютнаяСуммаДт = РеквизитыСчета.ВалютнаяСумма;
		КонецЕсли;
		
		МенеджерЗаписи.СчетКт = ПланыСчетов.Основной.Вспомогательный;
		
		МенеджерЗаписи.Сумма = РеквизитыСчета.Сумма;
		
		Для НомСубк = 0 По ВидыСубконто.Количество() - 1 Цикл
			МенеджерЗаписи.СубконтоДт[ВидыСубконто[НомСубк].ВидСубконто] = РеквизитыСчета["Субконто" + (НомСубк + 1)];
		КонецЦикла;
		
	ИначеЕсли РеквизитыСчета.Счет.Вид = ВидСчета.Пассивный
		Или (РеквизитыСчета.Счет.Вид = ВидСчета.АктивноПассивный И РеквизитыСчета.Сумма < 0)
	Тогда
		МенеджерЗаписи.СчетКт          = РеквизитыСчета.Счет;
		
		Если РеквизитыСчета.Счет.Количественный Тогда
			МенеджерЗаписи.КоличествоКт    = -РеквизитыСчета.Количество;
		КонецЕсли;
		
		Если РеквизитыСчета.Счет.Валютный Тогда
			МенеджерЗаписи.ВалютаКт        = РеквизитыСчета.Валюта;
			МенеджерЗаписи.ВалютнаяСуммаКт = -РеквизитыСчета.ВалютнаяСумма;
		КонецЕсли;
		
		МенеджерЗаписи.СчетДт = ПланыСчетов.Основной.Вспомогательный;
		
		МенеджерЗаписи.Сумма = -РеквизитыСчета.Сумма;
		
		Для НомСубк = 0 По ВидыСубконто.Количество() - 1 Цикл
			МенеджерЗаписи.СубконтоКт[ВидыСубконто[НомСубк].ВидСубконто] = РеквизитыСчета["Субконто" + (НомСубк + 1)];
		КонецЦикла;
		
	ИначеЕсли (РеквизитыСчета.Счет = ПланыСчетов.Основной.КупонУплаченныйПриПокупкеКорпоративныеОблигации 
			Или РеквизитыСчета.Счет = ПланыСчетов.Основной.КупонУплаченныйПриПокупкеГосударственныеОблигации
			Или РеквизитыСчета.Счет = ПланыСчетов.Основной.КупонУплаченныйПриПокупкеКорпоративныеОблигации
			Или РеквизитыСчета.Счет = ПланыСчетов.Основной.КупонУплаченныйПриПокупкеГосударственныеОблигации)
			И РеквизитыСчета.Количество <> 0 Тогда
		
		МенеджерЗаписи.СчетДт          = РеквизитыСчета.Счет;
		
		Если РеквизитыСчета.Счет.Количественный Тогда
			МенеджерЗаписи.КоличествоДт    = РеквизитыСчета.Количество;
		КонецЕсли;
		
		Если РеквизитыСчета.Счет.Валютный Тогда
			МенеджерЗаписи.ВалютаДт        = РеквизитыСчета.Валюта;
			МенеджерЗаписи.ВалютнаяСуммаДт = РеквизитыСчета.ВалютнаяСумма;
		КонецЕсли;
		
		МенеджерЗаписи.СчетКт = ПланыСчетов.Основной.Вспомогательный;
		
		МенеджерЗаписи.Сумма = РеквизитыСчета.Сумма;
		
		Для НомСубк = 0 По ВидыСубконто.Количество() - 1 Цикл
			МенеджерЗаписи.СубконтоДт[ВидыСубконто[НомСубк].ВидСубконто] = РеквизитыСчета["Субконто" + (НомСубк + 1)];
		КонецЦикла;
		
	Иначе
		НаборЗаписей.Удалить(НаборЗаписей.Количество() - 1);
		
		Сообщить("Некорректный остаток " + РеквизитыСчета.Сумма + " по счету " + РеквизитыСчета.Счет);
		
	КонецЕсли;	
	
	Если МенеджерЗаписи.СчетДт.Валютный Тогда
		Если МенеджерЗаписи.ВалютаДт = Справочники.Валюты.ПустаяСсылка() Тогда
			МенеджерЗаписи.ВалютаДт = Организация.ВалютаУчета;	
		КонецЕсли;
	КонецЕсли;
	
	Если МенеджерЗаписи.СчетКт.Валютный Тогда
		Если МенеджерЗаписи.ВалютаКт = Справочники.Валюты.ПустаяСсылка() Тогда
			МенеджерЗаписи.ВалютаКт = Организация.ВалютаУчета;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьЗаписьВНабор


&НаСервере
Функция ЗаполнитьНаборЗаписейРегистра(НеЗаписывать, ИмяРегистра = Неопределено, Источник = Неопределено)
	
	КэшОбъектов = Новый ТаблицаЗначений;
	КэшОбъектов.Колонки.Добавить("Ключ");
	КэшОбъектов.Колонки.Добавить("Знч");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Объект.ИмяФайла);
	
	ИмяРегистра          = "";
	НаборЗаписейРегистра = Неопределено;
	РеквизитыСчета       = Неопределено;
	
	Источник = Новый Структура("Организация, Клиент, БухСчет, НомерСубконто, ПрочаяАналитика", Объект.Организация);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		Если       ИмяУзла = "Остатки" Тогда
			// определим регистр бухгалтерии
			Если      ЧтениеXML.ЗначениеАтрибута("ПланСчетов") = "Бухгалтерия" Тогда
				ИмяРегистра = "БухгалтерскийУчет";
			ИначеЕсли ЧтениеXML.ЗначениеАтрибута("ПланСчетов") = "НалоговыйУчет" Тогда
				ИмяРегистра = "НалоговыйУчет";
			ИначеЕсли ЧтениеXML.ЗначениеАтрибута("ПланСчетов") = "КлиентскийУчет" Тогда
				ИмяРегистра = "УчетСпецдепа";
			Иначе
				Сообщить("Не удалось определить имя регистра, соотв. плану счетов " + ЧтениеXML.ЗначениеАтрибута("ПланСчетов"));
				Возврат Неопределено;
			КонецЕсли;
			
			// установим период
			ЭтаФорма.Период         = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(ЧтениеXML.ЗначениеАтрибута("Дата"), "23:59:59");
			ЭтаФорма.УчетныйРегистр = ИмяРегистра;
			
		ИначеЕсли ИмяУзла = "Клиент" Тогда
			Если ЗначениеЗаполнено(РеквизитыСчета) Тогда
				ДобавитьЗаписьВНабор(НаборЗаписейРегистра, РеквизитыСчета, ЭтаФорма.Период, Объект.Организация, Источник.Клиент, ИмяРегистра);
			КонецЕсли;
			
			Если Не НеЗаписывать И НаборЗаписейРегистра <> Неопределено Тогда
				Попытка
					НаборЗаписейРегистра.Записать();
				Исключение
					Сообщить("Ввод нач. бух. остатков по клиенту " + Источник.Клиент + " не создан.");
				КонецПопытки;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СчетаДоверительногоУправления.Ссылка
				|ИЗ
				|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
				|ГДЕ
				|	СчетаДоверительногоУправления.КодСчета = &КодСчета
				|	И СчетаДоверительногоУправления.Организация = &Организация";
				
			Запрос.УстановитьПараметр("КодСчета",    ЧтениеXML.ЗначениеАтрибута("КодДУ"));
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Не Выборка.Следующий() Тогда
				Сообщить("Не удалось найти счет д/у по коду " + ЧтениеXML.ЗначениеАтрибута("КодДУ"));
				Возврат Неопределено;
			КонецЕсли;
			
			Источник.Клиент = Выборка.Ссылка;
			
			Если НеЗаписывать Тогда
				НаборЗаписейРегистра = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
			Иначе
				НаборЗаписейРегистра = ПолучитьНаборЗаписейРегистраДляЗаписи(ЭтаФорма.Период, Объект.Организация, Источник.Клиент, ИмяРегистра);
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "Счет" Тогда
			Если ЗначениеЗаполнено(РеквизитыСчета) Тогда
				ДобавитьЗаписьВНабор(НаборЗаписейРегистра, РеквизитыСчета, ЭтаФорма.Период, Объект.Организация, Источник.Клиент, ИмяРегистра);
			КонецЕсли;
			
			КодСчета = ЧтениеXML.ЗначениеАтрибута("Код");
			
			Если (Лев(КодСчета, 1) = "Н") Или (Лев(КодСчета, 1) = "К") Тогда
				КодСчета = Сред(КодСчета, 2);
			КонецЕсли;
			
			Если КодСчета = "63" Тогда
				КодСчета = "63.6"; // костыль, но резервы и вправду были только по корп. облигациям
			ИначеЕсли КодСчета = "58.П.2" Тогда
				КодСчета = "58.П.1.2";
			ИначеЕсли КодСчета = "58.П.4" Тогда
				КодСчета = "58.П.6.1";
			ИначеЕсли КодСчета = "58.П.6" Тогда
				КодСчета = "58.П.10.1";
			ИначеЕсли КодСчета = "76.П.1" Тогда
				КодСчета = "76.П.6.3";
			ИначеЕсли КодСчета = "76.П.2" Тогда
				КодСчета = "76.П.10.3";
			ИначеЕсли КодСчета = "ЗБ.84" Тогда
				КодСчета = "84.5"; 
			ИначеЕсли КодСчета = ".84" Тогда
				КодСчета = "84.5"; 
			ИначеЕсли КодСчета = "ПК" Тогда
				КодСчета = "00";
			КонецЕсли;
			
			Источник.БухСчет = ПланыСчетов.Основной.НайтиПоКоду(КодСчета);
			
			Если Источник.БухСчет = Неопределено Тогда
				Сообщить("Не удалось найти бух. счет по коду " + КодСчета);
			КонецЕсли;
			
			РеквизитыСчета = Новый Структура("Счет, Субконто1, Субконто2, Субконто3, Валюта, Количество, Сумма, ВалютнаяСумма",
				Источник.БухСчет,,,,, 0, 0, 0);
				
		ИначеЕсли (ИмяУзла = "Субконто1") Или (ИмяУзла = "Субконто2") Или (ИмяУзла = "Субконто3") Или (ИмяУзла = "Субконто4") Тогда
			
			Если (ИмяУзла = "Субконто1") Или (ИмяУзла = "Субконто2") Или (ИмяУзла = "Субконто3") Тогда
				Если ЗначениеЗаполнено(РеквизитыСчета) И (РеквизитыСчета.Сумма <> 0 Или РеквизитыСчета.Количество <> 0) Тогда
					ДобавитьЗаписьВНабор(НаборЗаписейРегистра, РеквизитыСчета, ЭтаФорма.Период, Объект.Организация, Источник.Клиент, ИмяРегистра);
					РеквизитыСчета.Сумма      = 0;
					РеквизитыСчета.Количество = 0;
				КонецЕсли;
			КонецЕсли;
				
			ТипЗнчУзла = ЧтениеXML.ЗначениеАтрибута("Тип");
			ВидЗнчУзла = ЧтениеXML.ЗначениеАтрибута("Вид");
			ИдЗнчУзла  = ЧтениеXML.ЗначениеАтрибута("Ид");
			
			// структура счетов 7.7 и 8.х не всегда совпадает; выполним приведение
			Если Источник.БухСчет = ПланыСчетов.Основной.ПрибылиИУбытки Тогда // 99
				Если      ИмяУзла = "Субконто1" Тогда
					Продолжить;
				ИначеЕсли ИмяУзла = "Субконто2" Тогда
					ИмяУзла = "Субконто1";
					
					// по физикам основная сумма вешается на пустое субконто, подменим её на актуальное значение
					Если ПустаяСтрока(ИдЗнчУзла) Тогда
						ИдЗнчУзла = "Прочие внереализационные доходы и расходы"; 
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.УслугиБрокера Тогда // 60.5
				Если ВидЗнчУзла = "Договор" Тогда
					ВидЗнчУзла = "ДоговорБрокерскогоОбслуживания";
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.УслугиДепозитария Тогда // 60.6
				Если ВидЗнчУзла = "Договор" Тогда
					ВидЗнчУзла = "ДоговорДепозитарногоОбслуживания";
					Источник.ПрочаяАналитика = Новый Структура("Депозитарий", РеквизитыСчета.Субконто1);
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.НДФЛ Тогда // 68.1
				Если ВидЗнчУзла = "Фирмы" Тогда
					РеквизитыСчета[ИмяУзла] = Источник.Клиент.Клиент;
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.АвансыПоЧастичномуПогашениюОблигаций Тогда // 76.56
				Если ИмяУзла = "Субконто3" Или ИмяУзла = "Субконто4" Тогда
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.Выручка Тогда // 90.1.1
				Если ИмяУзла = "Субконто3" Или ИмяУзла = "Субконто4" Тогда
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.РасчетыПоКомиссии Тогда // 76.16
				Если ИмяУзла = "Субконто3" Тогда
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку Тогда // 76.67
				Если ИмяУзла = "Субконто2" Или ИмяУзла = "Субконто3" Тогда
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.РасчетыЧерезБрокера
				  	ИЛИ Источник.БухСчет = ПланыСчетов.Основной.РасчетыЧерезБрокераВВалюте
				  	ИЛИ Источник.БухСчет = ПланыСчетов.Основной.ДенежныеСредстваУБрокера
				  	ИЛИ Источник.БухСчет = ПланыСчетов.Основной.ВалютныеСредстваУБрокера
				Тогда // 76.14
				
				Если ИмяУзла = "Субконто1" Тогда
					
					Источник.НомерСубконто = СтрЗаменить(ИмяУзла, "Субконто", "");
					РеквизитыСчета[ИмяУзла] = ДесериализоватьЗначение(КэшОбъектов, ТипЗнчУзла, ВидЗнчУзла, ИдЗнчУзла, Источник);
					
					Источник.НомерСубконто = 3;
					РеквизитыСчета["Субконто3"] = НайтиДоговорБрокерскогоОбслуживания7614(РеквизитыСчета[ИмяУзла], ЭтаФорма.Период, Источник.Клиент);
					
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли Источник.БухСчет = ПланыСчетов.Основной.ПроцентыПоДепозитнымВкладам Тогда // 76.57
				Если      ИмяУзла = "Субконто1" Тогда // в 7.7 здесь хранится банк, которого в 8-ке нет
					Продолжить;
				ИначеЕсли ИмяУзла = "Субконто2" Тогда
					РеквизитыСчета["Субконто1"] = ДесериализоватьЗначение(КэшОбъектов, ТипЗнчУзла, ВидЗнчУзла, ИдЗнчУзла, Источник);
				КонецЕсли;
				
			КонецЕсли;
			
			Источник.НомерСубконто = СтрЗаменить(ИмяУзла, "Субконто", "");
			
			РеквизитыСчета[ИмяУзла] = ДесериализоватьЗначение(КэшОбъектов, ТипЗнчУзла, ВидЗнчУзла, ИдЗнчУзла, Источник);
			
			Если ИмяУзла = "Субконто1" И РеквизитыСчета.Счет = ПланыСчетов.Основной.Вспомогательный Тогда
				
				Попытка
					
					Если РеквизитыСчета[ИмяУзла].Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда
						РеквизитыСчета.Счет = ПланыСчетов.Основной.ПереоценкаЦенныхБумагКорпоративныеОблигацииКупонНачисленный;
					Иначе	
						РеквизитыСчета.Счет = ПланыСчетов.Основной.ПереоценкаЦенныхБумагГосударственныеОблигацииКупонНачисленный;
					КонецЕсли;
					
				Исключение
					
				КонецПопытки;
			
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "Остаток" Тогда
			ТипОстатка = ЧтениеXML.ЗначениеАтрибута("Тип");
			
			Если      ТипОстатка = "Количество" Тогда
				РеквизитыСчета.Количество = Число(ЧтениеXML.ЗначениеАтрибута("Количество"));
			ИначеЕсли ТипОстатка = "Сумма" Тогда
				РеквизитыСчета.Сумма = Число(ЧтениеXML.ЗначениеАтрибута("Сумма"));
			ИначеЕсли ТипОстатка = "ВалютнаяСумма" Тогда
				РеквизитыСчета.Валюта        = ДесериализоватьВалюту(КэшОбъектов, ЧтениеXML.ЗначениеАтрибута("Валюта"), Источник);
				РеквизитыСчета.ВалютнаяСумма = Число(ЧтениеXML.ЗначениеАтрибута("СуммаВал"));
				РеквизитыСчета.Сумма         = Число(ЧтениеXML.ЗначениеАтрибута("Сумма"));
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РеквизитыСчета) Тогда
		ДобавитьЗаписьВНабор(НаборЗаписейРегистра, РеквизитыСчета, ЭтаФорма.Период, Объект.Организация, Источник.Клиент, ИмяРегистра);
	КонецЕсли;
	
	Если Не НеЗаписывать И НаборЗаписейРегистра <> Неопределено Тогда
		Попытка
			НаборЗаписейРегистра.Записать();
		Исключение
			Сообщить("Ввод нач. бух. остатков по клиенту " + Источник.Клиент + " не создан.");
		КонецПопытки;
	КонецЕсли;
	
	Возврат НаборЗаписейРегистра;
	
КонецФункции // ЗаполнитьНаборЗаписейРегистра

&НаСервере
Процедура ИмпортироватьДанныеНаСервере()
	
	ЗаполнитьНаборЗаписейРегистра(Ложь);
	
КонецПроцедуры // ИмпортироватьДанныеНаСервере

&НаСервере
Функция СверитьДанныеНаСервере()
	
	ИмяРегистра = Неопределено;
	Источник    = Неопределено;
	
	НаборЗаписейРегистра = ЗаполнитьНаборЗаписейРегистра(Истина, ИмяРегистра, Источник);
	
	Если НаборЗаписейРегистра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокРасхождений = Новый СписокЗначений;
	
	Остатки77 = НаборЗаписейРегистра.Выгрузить();
	
	Остатки77ПоСчетам = Остатки77.Скопировать();
	Остатки77ПоСчетам.Свернуть("СчетДт,СчетКт", "Сумма");
	
	Для каждого Остаток77ПоСчетам Из Остатки77ПоСчетам Цикл
		Если Остаток77ПоСчетам.СчетДт = ПланыСчетов.Основной.Вспомогательный Тогда
			Остаток77ПоСчетам.СчетДт = Остаток77ПоСчетам.СчетКт;
			Остаток77ПоСчетам.СчетКт = ПланыСчетов.Основной.Вспомогательный;
			Остаток77ПоСчетам.Сумма = -Остаток77ПоСчетам.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Остатки77ПоСчетам.Свернуть("СчетДт", "Сумма");
	
	НулевыеСтроки = Остатки77ПоСчетам.НайтиСтроки(Новый Структура("Сумма", 0));
	Для каждого НулеваяСтрока Из НулевыеСтроки Цикл
		Остатки77ПоСчетам.Удалить(НулеваяСтрока);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Остатки77ПоСчетам.СчетДт КАК Счет,
		|	Остатки77ПоСчетам.Сумма
		|ПОМЕСТИТЬ Остатки77ПоСчетам
		|ИЗ
		|	&Остатки77ПоСчетам КАК Остатки77ПоСчетам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Счет КАК Счет8,
		|	ЕСТЬNULL(БухгалтерскийУчетОстатки.СуммаОстатокДт - БухгалтерскийУчетОстатки.СуммаОстатокКт, 0) КАК СуммаОстаток8,
		|	Остатки77ПоСчетам.Счет КАК Счет77,
		|	ЕСТЬNULL(Остатки77ПоСчетам.Сумма, 0) КАК СуммаОстаток77
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ Остатки77ПоСчетам КАК Остатки77ПоСчетам
		|		ПО БухгалтерскийУчетОстатки.Счет = Остатки77ПоСчетам.Счет";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", ИмяРегистра);
		
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("Период",                       Новый Граница(ЭтаФорма.Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Источник.Клиент);
	Запрос.УстановитьПараметр("Остатки77ПоСчетам",            Остатки77ПоСчетам);

	СверкаПоСчетам = Запрос.Выполнить().Выгрузить();

	Если ИмяРегистра = "НалоговыйУчет" Тогда
		//Своя специфика
		Для каждого СтрокаСверки Из СверкаПоСчетам Цикл //Всё спихаем на прибыли и убытки
			Если СтрокаСверки.Счет8 = ПланыСчетов.Основной.ПрочиеРасходы
				 ИЛИ СтрокаСверки.Счет8 = ПланыСчетов.Основной.ПереоценкаЦенныхБумагКорпоративныеОблигацииКупонНачисленный
				 ИЛИ СтрокаСверки.Счет8 = ПланыСчетов.Основной.ПереоценкаЦенныхБумагГосударственныеОблигацииКупонНачисленный
				 ИЛИ СтрокаСверки.Счет8 = ПланыСчетов.Основной.ПрочиеДоходы
				 ИЛИ СтрокаСверки.Счет8 = ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов
			Тогда
				СтрокаСверки.Счет8 = ПланыСчетов.Основной.ПрибылиИУбытки;
				СтрокаСверки.Счет77 = ПланыСчетов.Основной.ПрибылиИУбытки;
			КонецЕсли;
		КонецЦикла;
		СверкаПоСчетам.Свернуть("Счет8,Счет77", "СуммаОстаток8,СуммаОстаток77");
	КонецЕсли;
	
	Для каждого ОшибкаПоСчетам Из СверкаПоСчетам Цикл
		
		Если (ОшибкаПоСчетам.Счет8 = ОшибкаПоСчетам.Счет77 И ОшибкаПоСчетам.СуммаОстаток8 = ОшибкаПоСчетам.СуммаОстаток77)
			 ИЛИ ОшибкаПоСчетам.Счет8 = ПланыСчетов.Основной.Вспомогательный
			 ИЛИ ОшибкаПоСчетам.Счет77 = ПланыСчетов.Основной.Вспомогательный
		Тогда
			Продолжить;
		КонецЕсли;
		
		Расхождение = Новый Структура("Счет8,СуммаОстаток8,Счет77,СуммаОстаток77",
			ОшибкаПоСчетам.Счет8,  ОшибкаПоСчетам.СуммаОстаток8,
			ОшибкаПоСчетам.Счет77, ОшибкаПоСчетам.СуммаОстаток77);
		
		СписокРасхождений.Добавить(Расхождение);
	
	КонецЦикла;

	Для каждого СтрокаОстатки77ПоСчетам Из Остатки77ПоСчетам Цикл
		КодРодительскогоСчета = Лев(СтрокаОстатки77ПоСчетам.СчетДт.Код, 2);
		КодРодительскогоПодСчета = Лев(СтрокаОстатки77ПоСчетам.СчетДт.Код, 4);
		
		Если (КодРодительскогоСчета = "58" ИЛИ КодРодительскогоСчета = "91")
			 И(СтрокаОстатки77ПоСчетам.СчетДт <> ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов)
			 И(КодРодительскогоПодСчета <> "58.П")
		Тогда
			Если СтрокаОстатки77ПоСчетам.СчетДт.Вид = ВидСчета.Пассивный Тогда
				ОтборПоСчету = Новый Структура("СчетКт", СтрокаОстатки77ПоСчетам.СчетДт);
			Иначе
				ОтборПоСчету = Новый Структура("СчетДт", СтрокаОстатки77ПоСчетам.СчетДт);
			КонецЕсли;
			
			ОстаткиПоСчету = Остатки77.Скопировать(Остатки77.НайтиСтроки(ОтборПоСчету));
			
			Запрос = Новый Запрос;
			
			Если КодРодительскогоСчета = "58" Тогда
				ОстаткиПоСчету.Свернуть("СубконтоДт1", "Сумма");
				
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиПоСчету.СубконтоДт1 КАК Субконто1,
					|	ОстаткиПоСчету.Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету77
					|ИЗ
					|	&ОстаткиПоСчету КАК ОстаткиПоСчету
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	БухгалтерскийУчетОстатки.Субконто1,
					|	БухгалтерскийУчетОстатки.СуммаОстатокДт - БухгалтерскийУчетОстатки.СуммаОстатокКт КАК Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету8
					|ИЗ
					|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
					|			&Период,
					|			Счет = &Счет,
					|			,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(ОстаткиПоСчету77.Сумма, 0) КАК Сумма77,
					|	ЕСТЬNULL(ОстаткиПоСчету8.Сумма, 0) КАК Сумма8,
					|	ОстаткиПоСчету77.Субконто1 КАК Субконто771,
					|	"""" КАК Субконто772,
					|	"""" КАК Субконто773,
					|	"""" КАК Субконто81,
					|	"""" КАК Субконто82,
					|	"""" КАК Субконто83
					|ИЗ
					|	ОстаткиПоСчету77 КАК ОстаткиПоСчету77
					|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчету8 КАК ОстаткиПоСчету8
					|		ПО ОстаткиПоСчету77.Субконто1 = ОстаткиПоСчету8.Субконто1";
				
			ИначеЕсли СтрокаОстатки77ПоСчетам.СчетДт.Вид = ВидСчета.Пассивный Тогда
				ОстаткиПоСчету.Свернуть("СубконтоКт1,СубконтоКт2,СубконтоКт3", "Сумма");
				
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиПоСчету.СубконтоКт1 КАК Субконто1,
					|	ОстаткиПоСчету.СубконтоКт2 КАК Субконто2,
					|	ОстаткиПоСчету.СубконтоКт3 КАК Субконто3,
					|	ОстаткиПоСчету.Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету77
					|ИЗ
					|	&ОстаткиПоСчету КАК ОстаткиПоСчету
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	БухгалтерскийУчетОстатки.Субконто1,
					|	БухгалтерскийУчетОстатки.Субконто2,
					|	БухгалтерскийУчетОстатки.Субконто3,
					|	БухгалтерскийУчетОстатки.СуммаОстатокКт - БухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету8
					|ИЗ
					|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
					|			&Период,
					|			Счет = &Счет,
					|			,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(ОстаткиПоСчету77.Сумма, 0) КАК Сумма77,
					|	ЕСТЬNULL(ОстаткиПоСчету8.Сумма, 0) КАК Сумма8,
					|	ОстаткиПоСчету77.Субконто1 КАК Субконто771,
					|	ОстаткиПоСчету77.Субконто2 КАК Субконто772,
					|	ОстаткиПоСчету77.Субконто3 КАК Субконто773,
					|	ОстаткиПоСчету8.Субконто1 КАК Субконто81,
					|	ОстаткиПоСчету8.Субконто2 КАК Субконто82,
					|	ОстаткиПоСчету8.Субконто3 КАК Субконто83
					|ИЗ
					|	ОстаткиПоСчету77 КАК ОстаткиПоСчету77
					|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчету8 КАК ОстаткиПоСчету8
					|		ПО ОстаткиПоСчету77.Субконто1 = ОстаткиПоСчету8.Субконто1
					|			И ОстаткиПоСчету77.Субконто2 = ОстаткиПоСчету8.Субконто2
					|			И (ОстаткиПоСчету77.Субконто3 = ОстаткиПоСчету8.Субконто3
					|				ИЛИ ОстаткиПоСчету77.Субконто3 = НЕОПРЕДЕЛЕНО)";
					
			Иначе
				ОстаткиПоСчету.Свернуть("СубконтоДт1,СубконтоДт2,СубконтоДт3", "Сумма");
				
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОстаткиПоСчету.СубконтоДт1 КАК Субконто1,
					|	ОстаткиПоСчету.СубконтоДт2 КАК Субконто2,
					|	ОстаткиПоСчету.СубконтоДт3 КАК Субконто3,
					|	ОстаткиПоСчету.Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету77
					|ИЗ
					|	&ОстаткиПоСчету КАК ОстаткиПоСчету
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	БухгалтерскийУчетОстатки.Субконто1,
					|	БухгалтерскийУчетОстатки.Субконто2,
					|	БухгалтерскийУчетОстатки.Субконто3,
					|	БухгалтерскийУчетОстатки.СуммаОстатокДт - БухгалтерскийУчетОстатки.СуммаОстатокКт КАК Сумма
					|ПОМЕСТИТЬ ОстаткиПоСчету8
					|ИЗ
					|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
					|			&Период,
					|			Счет = &Счет,
					|			,
					|			Организация = &Организация
					|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(ОстаткиПоСчету77.Сумма, 0) КАК Сумма77,
					|	ЕСТЬNULL(ОстаткиПоСчету8.Сумма, 0) КАК Сумма8,
					|	ОстаткиПоСчету77.Субконто1 КАК Субконто771,
					|	ОстаткиПоСчету77.Субконто2 КАК Субконто772,
					|	ОстаткиПоСчету77.Субконто3 КАК Субконто773,
					|	ОстаткиПоСчету8.Субконто1 КАК Субконто81,
					|	ОстаткиПоСчету8.Субконто2 КАК Субконто82,
					|	ОстаткиПоСчету8.Субконто3 КАК Субконто83
					|ИЗ
					|	ОстаткиПоСчету77 КАК ОстаткиПоСчету77
					|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиПоСчету8 КАК ОстаткиПоСчету8
					|		ПО ОстаткиПоСчету77.Субконто1 = ОстаткиПоСчету8.Субконто1
					|			И ОстаткиПоСчету77.Субконто2 = ОстаткиПоСчету8.Субконто2
					|			И (ОстаткиПоСчету77.Субконто3 = ОстаткиПоСчету8.Субконто3
					|				ИЛИ ОстаткиПоСчету77.Субконто3 = НЕОПРЕДЕЛЕНО)";
				
			КонецЕсли;

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", ИмяРегистра);
				
			Запрос.УстановитьПараметр("ОстаткиПоСчету", ОстаткиПоСчету);
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			Запрос.УстановитьПараметр("Период", Новый Граница(ЭтаФорма.Период, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Счет", СтрокаОстатки77ПоСчетам.СчетДт);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", Источник.Клиент);

			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Сумма77 = ВыборкаДетальныеЗаписи.Сумма8 Тогда
					Продолжить;
				КонецЕсли;
				Если ИмяРегистра = "НалоговыйУчет" 
					 И (СтрокаОстатки77ПоСчетам.СчетДт = ПланыСчетов.Основной.ПрочиеДоходы
					 	ИЛИ СтрокаОстатки77ПоСчетам.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы)
				Тогда
					Если Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Дооценка НКД (начисление процентов на отчетную дату) (корп.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Дооценка НКД (начисление процентов на отчетную дату) (гос. и муницип.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Доход от погашения НКД (корп.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Доход от реализации НКД (корп.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Доход от погашения НКД (гос. и муницип.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Доход от реализации НКД (гос. и муницип.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Погашение облигации (НКД) (гос.)"
						 ИЛИ Строка(ВыборкаДетальныеЗаписи.Субконто81) = "Погашение облигации (НКД) (корп.)"
					Тогда
						Продолжить;	
					КонецЕсли;
				КонецЕсли;
				
				Расхождение = Новый Структура("Счет8,Счет77,Субконто771,Субконто772,Субконто773,Субконто81,Субконто82,Субконто83,СуммаОстаток77,СуммаОстаток8",
					СтрокаОстатки77ПоСчетам.СчетДт,
					СтрокаОстатки77ПоСчетам.СчетДт,
					ВыборкаДетальныеЗаписи.Субконто771,
					ВыборкаДетальныеЗаписи.Субконто772,
					ВыборкаДетальныеЗаписи.Субконто773,
					ВыборкаДетальныеЗаписи.Субконто81,
					ВыборкаДетальныеЗаписи.Субконто82,
					ВыборкаДетальныеЗаписи.Субконто83,
					ВыборкаДетальныеЗаписи.Сумма77,
					ВыборкаДетальныеЗаписи.Сумма8);
				
				СписокРасхождений.Добавить(Расхождение);
			КонецЦикла;
		
		КонецЕсли;
	КонецЦикла;

	Возврат СписокРасхождений;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	// заполним список учетных регистров
	Элементы.УчетныйРегистр.СписокВыбора.Очистить();
	
	Для каждого РегистрБухгалтерии Из Метаданные.РегистрыБухгалтерии Цикл
		Элементы.УчетныйРегистр.СписокВыбора.Добавить(РегистрБухгалтерии.Имя, РегистрБухгалтерии.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаИмпортировать");
	Попытка
		ИмпортироватьДанныеНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСверить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСверить");
	Попытка
		СверитьДанныеНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция СверитьСФайлом(ИмяФайла) Экспорт

	Объект.ИмяФайла = ИмяФайла;
	
	Возврат СверитьДанныеНаСервере();

КонецФункции

&НаКлиенте
Процедура ИмпортироватьИзФайла(ИмяФайла) Экспорт

	Объект.ИмяФайла = ИмяФайла;
	
	ИмпортироватьДанныеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
