
Функция СформироватьСводноеПоручение(ПереводыЦенныхБумаг) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПереводыЦенныхБумаг",	ПереводыЦенныхБумаг);
	Запрос.УстановитьПараметр("Период",					ТекущаяДата());
	Запрос.УстановитьПараметр("НСД",					ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_НСД"));
	Запрос.УстановитьПараметр("НФОТехнологии",			ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_НФО_Технологии"));
	Запрос.УстановитьПараметр("ПроизошлоСлияниеНСД",	Запрос.Параметры.Период >= '20260720');
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Зачисление"" КАК ТипОперации,
		|	ЕСТЬNULL(РеквизитыОрганизации.КраткоеНаименованиеПоУставу, ПереводЦенныхБумаг.Организация.ЮрФизЛицо.Наименование) КАК ОтправительСообщения,
		|	ВЫБОР
		|		КОГДА &ПроизошлоСлияниеНСД
		|			ТОГДА ""АО """"НФО Технологии""""""
		|		ИНАЧЕ ""АО """"НСД""""""
		|	КОНЕЦ КАК ПолучательСообщения,
		|	ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.НаименованиеВладельцаДляДокументов КАК НаименованиеДепонента,
		|	""Договор об оказании и СД услуг УК"" КАК ДокументОснование,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.НомерДоговора
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.Договор.НомерДоговора
		|	КОНЕЦ КАК НомерДокументаОснования,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Договор.ДатаЗаключения
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.Договор.ДатаЗаключения
		|	КОНЕЦ КАК ДатаДокументаОснования,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.НомерСчета
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель.НомерСчета
		|	КОНЕЦ КАК НомерСчетаДепо,
		|	""220001"" КАК НомерРаздела,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ""00000000000000000""
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.НомерСчета
		|	КОНЕЦ КАК Раздел,
		|	""НКО АО НРД"" КАК ДепозитарийРегистратор,
		|	ЕСТЬNULL(РеквизитыДепозитарияОтправителя.КраткоеНаименованиеПоУставу, ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо.Наименование) КАК Владедец,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ""00000000000000000""
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчет.НомерСчета
		|	КОНЕЦ КАК РазделСчетаВДепозитарии,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаСделки,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаРасчетов,
		|	""Свободная поставка"" КАК ТипРасчетов,
		|	НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ) КАК ДатаПоручения,
		|	ПереводЦенныхБумаг.Ссылка КАК ПереводЦенныхБумаг,
		|	ПереводЦенныхБумаг.Дата КАК Дата,
		|	ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий КАК Депозитарий,
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель = ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|			ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.ВидСчета
		|		ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчет.Родитель.ВидСчета
		|	КОНЕЦ КАК ВидДепозитарногоСчетаСчетаОтправителя,
		|	ПереводЦенныхБумаг.СчетДоверительногоУправления.СпециализированныйДепозитарий КАК СпециализированныйДепозитарий
		|ПОМЕСТИТЬ _ДанныеДокумента
		|ИЗ
		|	Документ.ПереводЦенныхБумаг КАК ПереводЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО ПереводЦенныхБумаг.Организация.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо
		|			И ПереводЦенныхБумаг.Организация = РеквизитыОрганизации.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыДепозитарияОтправителя
		|		ПО ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий.ЮрФизЛицо = РеквизитыДепозитарияОтправителя.ЮрФизЛицо
		|ГДЕ
		|	ПереводЦенныхБумаг.Ссылка В(&ПереводыЦенныхБумаг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигация""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|			ТОГДА ""Вексель""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Закладные)
		|			ТОГДА ""Закладная""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА ""Депозитарная расписка""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
		|			ТОГДА ""Фьючерс""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
		|			ТОГДА ""Опцион""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
		|			ТОГДА ""Валютная пара""
		|		КОГДА ПереводЦенныхБумагЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|			ТОГДА ""Доля""
		|	КОНЕЦ КАК ТипЦеннойБумаги,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НаименованиеЭмитентаЦБ,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ЦеннаяБумага,
		|	ПереводЦенныхБумагЦенныеБумаги.Количество КАК Количество,
		|	ПереводЦенныхБумагЦенныеБумаги.НомерСтроки КАК ИсходящийНомерПоручения,
		|	ПереводЦенныхБумагЦенныеБумаги.Ссылка КАК ПереводЦенныхБумаг
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	Документ.ПереводЦенныхБумаг.ЦенныеБумаги КАК ПереводЦенныхБумагЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|					ТОГДА ВЫРАЗИТЬ(ПереводЦенныхБумагЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	ПереводЦенныхБумагЦенныеБумаги.Ссылка В(&ПереводыЦенныхБумаг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСЦентральнымДепозитарием.ДепозитарнаяКомпания КАК Депозитарий,
		|	ДоговорыСЦентральнымДепозитарием.Период КАК Период,
		|	ДоговорыСЦентральнымДепозитарием.НомерТорговогоСчета КАК НомерТорговогоСчета,
		|	ДоговорыСЦентральнымДепозитарием.НомерОсновногоСчета КАК НомерОсновногоСчета,
		|	ДоговорыСЦентральнымДепозитарием.Идентификатор КАК Идентификатор,
		|	ДоговорыСЦентральнымДепозитарием.ДатаДоговора КАК ДатаМеждепозитарногоДоговора,
		|	ДоговорыСЦентральнымДепозитарием.НомерДоговора КАК НомерМеждепозитарногоДоговора
		|ПОМЕСТИТЬ _ДоговорыДепозитариевСЦентральнымДепозитарием
		|ИЗ
		|	РегистрСведений.ДоговорыСЦентральнымДепозитарием КАК ДоговорыСЦентральнымДепозитарием
		|ГДЕ
		|	ДоговорыСЦентральнымДепозитарием.ДепозитарнаяКомпания В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ДанныеДокумента.Депозитарий КАК Депозитарий
		|			ИЗ
		|				_ДанныеДокумента КАК _ДанныеДокумента
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				&НСД
		|		
		|			ОБЪЕДИНИТЬ
		|		
		|			ВЫБРАТЬ
		|				&НФОТехнологии)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий КАК Депозитарий,
		|	_ДанныеДокумента.Дата КАК Дата,
		|	МИНИМУМ(_ДоговорыДепозитариевСЦентральнымДепозитарием.Период) КАК Период
		|ПОМЕСТИТЬ _ПериодыНачалаИспользованияДоговоров
		|ИЗ
		|	_ДанныеДокумента КАК _ДанныеДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыДепозитариевСЦентральнымДепозитарием КАК _ДоговорыДепозитариевСЦентральнымДепозитарием
		|		ПО (_ДанныеДокумента.Депозитарий = _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|				ИЛИ _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий В (&НСД, &НФОТехнологии))
		|			И _ДанныеДокумента.Дата >= _ДоговорыДепозитариевСЦентральнымДепозитарием.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеДокумента.Дата,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыНачалаИспользованияДоговоров.Депозитарий КАК Депозитарий,
		|	_ПериодыНачалаИспользованияДоговоров.Дата КАК Дата,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерТорговогоСчета КАК НомерТорговогоСчета,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерОсновногоСчета КАК НомерОсновногоСчета,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.Идентификатор КАК Идентификатор,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.НомерМеждепозитарногоДоговора КАК НомерМеждепозитарногоДоговора,
		|	_ДоговорыДепозитариевСЦентральнымДепозитарием.ДатаМеждепозитарногоДоговора КАК ДатаМеждепозитарногоДоговора
		|ПОМЕСТИТЬ _ДанныеДоговоровСЦД
		|ИЗ
		|	_ПериодыНачалаИспользованияДоговоров КАК _ПериодыНачалаИспользованияДоговоров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДоговорыДепозитариевСЦентральнымДепозитарием КАК _ДоговорыДепозитариевСЦентральнымДепозитарием
		|		ПО _ПериодыНачалаИспользованияДоговоров.Депозитарий = _ДоговорыДепозитариевСЦентральнымДепозитарием.Депозитарий
		|			И _ПериодыНачалаИспользованияДоговоров.Период = _ДоговорыДепозитариевСЦентральнымДепозитарием.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДанныеДокумента.ТипОперации КАК ТипОперации,
		|	_ДанныеДокумента.ОтправительСообщения КАК ОтправительСообщения,
		|	_ДанныеДокумента.ПолучательСообщения КАК ПолучательСообщения,
		|	_ДанныеДокумента.НаименованиеДепонента КАК НаименованиеДепонента,
		|	_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
		|	_ДанныеДокумента.НомерДокументаОснования КАК НомерДокументаОснования,
		|	_ДанныеДокумента.ДатаДокументаОснования КАК ДатаДокументаОснования,
		|	_ДанныеДоговоровСЦД_Междепозитарный.НомерМеждепозитарногоДоговора КАК НомерМеждепозитарногоДоговора,
		|	_ДанныеДоговоровСЦД_Междепозитарный.ДатаМеждепозитарногоДоговора КАК ДатаМеждепозитарногоДоговора,
		|	_ДанныеДокумента.НомерСчетаДепо КАК НомерСчетаДепо,
		|	_ДанныеДокумента.НомерРаздела КАК НомерРаздела,
		|	_ДанныеДокумента.Раздел КАК Раздел,
		|	_ЦенныеБумаги.ТипЦеннойБумаги КАК ТипЦеннойБумаги,
		|	_ЦенныеБумаги.НаименованиеЭмитентаЦБ КАК НаименованиеЭмитентаЦБ,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Количество КАК Количество,
		|	_ДанныеДокумента.ДепозитарийРегистратор КАК ДепозитарийРегистратор,
		|	_ДанныеДокумента.Владедец КАК Владедец,
		|	ВЫБОР
		|		КОГДА _ДанныеДокумента.ВидДепозитарногоСчетаСчетаОтправителя = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Торговый)
		|			ТОГДА _ДанныеДоговоровСЦД.НомерТорговогоСчета
		|		ИНАЧЕ _ДанныеДоговоровСЦД.НомерОсновногоСчета
		|	КОНЕЦ КАК НомерСчетаВДепозитарии,
		|	_ДанныеДоговоровСЦД.Идентификатор КАК КодДепонента,
		|	_ДанныеДокумента.РазделСчетаВДепозитарии КАК РазделСчетаВДепозитарии,
		|	_ДанныеДокумента.ДатаСделки КАК ДатаСделки,
		|	_ДанныеДокумента.ДатаРасчетов КАК ДатаРасчетов,
		|	_ДанныеДокумента.ТипРасчетов КАК ТипРасчетов,
		|	_ЦенныеБумаги.ИсходящийНомерПоручения КАК ИсходящийНомерПоручения,
		|	_ДанныеДокумента.ДатаПоручения КАК ДатаПоручения,
		|	_ДанныеДокумента.Дата КАК Дата
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеДокумента КАК _ДанныеДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДоговоровСЦД КАК _ДанныеДоговоровСЦД
		|			ПО _ДанныеДокумента.Депозитарий = _ДанныеДоговоровСЦД.Депозитарий
		|				И _ДанныеДокумента.Дата = _ДанныеДоговоровСЦД.Дата
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДоговоровСЦД КАК _ДанныеДоговоровСЦД_Междепозитарный
		|			ПО (_ДанныеДоговоровСЦД_Междепозитарный.Депозитарий В (&НСД, &НФОТехнологии))
		|				И _ДанныеДокумента.Дата = _ДанныеДоговоровСЦД_Междепозитарный.Дата
		|		ПО _ЦенныеБумаги.ПереводЦенныхБумаг = _ДанныеДокумента.ПереводЦенныхБумаг
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	#КонецОбласти
	
	Макет = Документы.ПереводЦенныхБумаг.ПолучитьМакет("СводноеПоручение");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	Результат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.ИсходящийНомерПоручения = НомерСтроки;
		Результат.Вывести(ОбластьСтрока);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции