#Область Взаимодействие_со_СМЭВ

&НаСервере 
Функция ОтправитьЗапросНаСервере()

	НайденныеСтроки = ЭтаФорма.ФизическиеЛица.НайтиСтроки(Новый Структура("Флаг", Истина));
	ОписаниеОшибки = "";
	
	Для каждого ТекСтрока Из НайденныеСтроки Цикл
		Результат = РегистрыСведений.ЖурналСверкиСоСписками.СверитьПоСМЭВ(Объект.Организация, ТекСтрока.ФизическоеЛицо);
		ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + Результат;
	КонецЦикла; 
	
	Возврат Сред(ОписаниеОшибки, 2);
	
КонецФункции

&НаСервере 
Функция ПолучитьРезультатыНаСервере()

	НайденныеСтроки = ЭтаФорма.ФизическиеЛица.НайтиСтроки(Новый Структура("Флаг", Истина));
	ОписаниеОшибки = "";
	
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		МассивФизЛиц = Новый Массив;
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
			МассивФизЛиц.Добавить(ТекСтрока.ФизическоеЛицо);
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
		Запрос.УстановитьПараметр("Период", 		Объект.ДатаПроверки);
		Запрос.УстановитьПараметр("ФизЛица", 		МассивФизЛиц);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналСверкиСоСпискамиСрезПоследних.ИдентификаторПакета КАК ИдентификаторПакета
			|ИЗ
			|	РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(&Период
			|			,
			|			Организация = &Организация
			|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СМЭВ)
			|				И ЮрФизЛицо В (&ФизЛица)) КАК ЖурналСверкиСоСпискамиСрезПоследних
			|ГДЕ
			|	НЕ ЖурналСверкиСоСпискамиСрезПоследних.Пройдена";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивИдентификаторов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
		
		ОписаниеОшибки = РегистрыСведений.ЖурналСверкиСоСписками.ПроверитьСтатус(Объект.Организация, МассивИдентификаторов);
	
	КонецЕсли; 
	
	Возврат ОписаниеОшибки;
	
КонецФункции

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаСнятьФлаги(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьФлаги");
	Попытка
		ИзменитьВсеФлаги(Ложь);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлаги(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьФлаги");
	Попытка
		ИзменитьВсеФлаги(Истина);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьЗапрос(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОтправитьЗапрос");
	Попытка
		ВыполнитьКомандаОтправитьЗапрос(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаОтправитьЗапрос(ПараметрыСессии)
	ОписаниеОшибки = ОтправитьЗапросНаСервере();
	ОбновитьСписокНаСервере(Истина);
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьРезультаты(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПолучитьРезультаты");
	Попытка
		ВыполнитьКомандаПолучитьРезультаты(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПолучитьРезультаты(ПараметрыСессии)
	ОписаниеОшибки = ПолучитьРезультатыНаСервере();
	ОбновитьСписокНаСервере(Истина);
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновитьСписок");
	Попытка
		ОбновитьСписокНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВидСравнения(Команда)

	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ПоказатьВидСравнения");
	Попытка
		ВыполнитьПоказатьВидСравнения(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоказатьВидСравнения(ПараметрыСессии)
	Элементы[Команда.Имя].Пометка = Не Элементы[Команда.Имя].Пометка;
	Элементы[СтрЗаменить(Команда.Имя, "ЗначениеПоказатьВидСравнения", "ВидСравненияЭлементаОтбора")].Видимость = Элементы[Команда.Имя].Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьСоставОтборов(Команда)
	
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаИзменитьСоставОтборов");
	Попытка
		ВыполнитьКомандаИзменитьСоставОтборов(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаИзменитьСоставОтборов(ПараметрыСессии)
	ДоступныеПоляОтбора = Новый СписокЗначений;
	ВыбранныеПоляОтбора = Новый Массив;	
	
	Отбор = ЭтаФорма.КомпоновщикНастроек.Настройки.Отбор;
	ДоступныеПоля = Отбор.ДоступныеПоляОтбора;
	
	Для каждого Элемент Из Отбор.Элементы Цикл
	    Если ЗначениеЗаполнено(Элемент.ИдентификаторПользовательскойНастройки) Тогда
			ВыбранныеПоляОтбора.Добавить(Элемент.ЛевоеЗначение);
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Элемент Из ДоступныеПоля.Элементы Цикл
		Если Не Элемент.Папка Тогда
			ДоступныеПоляОтбора.Добавить(Элемент.Поле, Элемент.Заголовок, Не ВыбранныеПоляОтбора.Найти(Элемент.Поле) = Неопределено);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ДоступныеПоляОтбора.ОтметитьЭлементы() Тогда
		
		Для каждого Элемент Из ДоступныеПоляОтбора Цикл
		
			НайденныйЭлемент = НайтиСоздатьЭлементОтбора(Отбор, Новый ПолеКомпоновкиДанных(Элемент.Значение));
			
			Если Не Элемент.Пометка Тогда
				НайденныйЭлемент.Использование = Ложь;
				НайденныйЭлемент.ИдентификаторПользовательскойНастройки = "";
			КонецЕсли; 
		
		КонецЦикла; 
		ПриОбновленииСоставаПользовательскихНастроекНаСервере(Ложь);
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	
	Элементы.Организация.Видимость = Не ЭтоПолныеПрава;
	Элементы.ОбъектОрганизация.Видимость = ЭтоПолныеПрава;
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ДатаПроверки = ТекущаяДатаСеанса();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СКД	= ОбработкаОбъект.ПолучитьМакет("СКД");
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.Параметры.ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	ЭтаФорма.Параметры.Настройки = СКД.НастройкиПоУмолчанию;
	
	ЭтаФорма.КомпоновщикНастроек.Инициализировать(ЭтаФорма.Параметры.ИсточникДоступныхНастроек);
	//ЭтаФорма.КомпоновщикНастроек.ЗагрузитьНастройки(ЭтаФорма.Параметры.Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Для каждого Форма Из ЭтаФорма.Окно.Содержимое Цикл
	
		Если Форма.ИмяФормы = "РегистрСведений.ЖурналСверкиСоСписками.Форма.ФормаСписка" Тогда
		
			Форма.Закрыть();
			Отказ = Истина;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("ПользовательскиеНастройки", ЭтаФорма.КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ЭтаФорма.КомпоновщикНастроек.ЗагрузитьНастройки(ЭтаФорма.Параметры.Настройки);
	
	ПользовательскиеНастройки = Настройки.Получить("ПользовательскиеНастройки");
	Если Не ПользовательскиеНастройки = Неопределено Тогда
		ЭтаФорма.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
		ЭтаФорма.Параметры.ПользовательскиеНастройки = ПользовательскиеНастройки;
	КонецЕсли; 
	
	ЭтаФорма.КомпоновщикНастроек.Восстановить();
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СоздатьЭлементыФормыПользовательскихНастроек(,РежимОтображенияНастроекКомпоновкиДанных.Все, 4);
	
	Элементы.ГруппаОтбор.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	УстановитьДействияЭлементовОтбора(Элементы.ГруппаОтбор);
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов

&НаКлиенте
Процедура ОбъектОрганизацияПриИзменении(Элемент)
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроверкиПриИзменении(Элемент)
	
	ОбновитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораПриИзменении(Элемент)

	ОбновитьСписокНаСервере();

КонецПроцедуры
 
&НаКлиенте
Процедура ФизическиеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = ЭтаФорма.ФизическиеЛица.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	СтандартнаяОбработка = Ложь;
	
	Если Не Элементы.ФизическиеЛицаГруппаРезультаты.ПодчиненныеЭлементы.Найти(Поле.Имя) = Неопределено Тогда
		
		Отбор = Новый Структура("ЮрФизЛицо, ВидПеречня", 
			ТекСтрока.ФизическоеЛицо,
			ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СМЭВ")); 
		ПараметрыФормы = Новый Структура("Отбор", Отбор); 
		
		ОткрытьФорму("РегистрСведений.ЖурналСверкиСоСписками.ФормаСписка", ПараметрыФормы, ЭтаФорма, Истина, ЭтаФорма.Окно);
		
	ИначеЕсли Не Элементы.ФизическиеЛицаГруппаАнкетныеДанные.ПодчиненныеЭлементы.Найти(Поле.Имя) = Неопределено  Тогда
		
		ОткрытьЗначение(ТекСтрока.ФизическоеЛицо);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервереБезКонтекста
Функция ПолучитьРезультатКомпоновки(СКД, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	ДанныеРасшифровки = Неопределено;
	
	Результат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки,,, ТипГенератора);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//ЗаписатьРезультатВФайлы(СКД, Настройки, МакетКомпоновки, "");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокНаСервере(СброситьФлаги = Ложь)

	НайденныеСтроки = ЭтаФорма.ФизическиеЛица.НайтиСтроки(Новый Структура("Флаг", Истина));
	ВыбранныеФизЛица = ЭтаФорма.ФизическиеЛица.Выгрузить(НайденныеСтроки).ВыгрузитьКолонку("ФизическоеЛицо");
	
	СКД 		= ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСКД);
	Настройки 	= ЭтаФорма.КомпоновщикНастроек.ПолучитьНастройки();
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 				Объект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 					Объект.ДатаПроверки);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыбранныеФизическиеЛица", 	ВыбранныеФизЛица);
	
	ТаблицаФизЛиц = ПолучитьРезультатКомпоновки(СКД, Настройки);
	
	Если СброситьФлаги Тогда
		ТаблицаФизЛиц.ЗаполнитьЗначения(Ложь, "Флаг");
	КонецЕсли; 
	
	ЭтаФорма.ФизическиеЛица.Загрузить(ТаблицаФизЛиц);

КонецПроцедуры

&НаКлиенте 
Процедура ИзменитьВсеФлаги(Флаг)
	
	Если Элементы.ФизическиеЛица.ВыделенныеСтроки.Количество() > 1 Тогда
		Для каждого Идентификатор Из Элементы.ФизическиеЛица.ВыделенныеСтроки Цикл
			ТекСтрока = ЭтаФорма.ФизическиеЛица.НайтиПоИдентификатору(Идентификатор);
			ТекСтрока.Флаг = Флаг;
		КонецЦикла; 
	Иначе
		Для каждого ТекСтрока Из ЭтаФорма.ФизическиеЛица Цикл
			Если Элементы.ФизическиеЛица.ПроверитьСтроку(ТекСтрока.ПолучитьИдентификатор()) Тогда
				ТекСтрока.Флаг = Флаг;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДействияЭлементовОтбора(Элемент)

	МассивЭлементов = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
	
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
		
			УстановитьДействияЭлементовОтбора(ПодчиненныйЭлемент);
			
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
			
			ПодчиненныйЭлемент.УстановитьДействие("ПриИзменении", "ПолеОтбораПриИзменении");
			
			Если СтрЗаканчиваетсяНа(ПодчиненныйЭлемент.Имя, "Значение") Тогда
			
				Если ЭтаФорма.Команды.Найти(ПодчиненныйЭлемент.Имя + "ПоказатьВидСравнения") = Неопределено Тогда
				
					Команда = ЭтаФорма.Команды.Добавить(ПодчиненныйЭлемент.Имя + "ПоказатьВидСравнения");
					Команда.Действие = "ПоказатьВидСравнения";
					Команда.Заголовок = "Показать вид сравнения";					
				
				КонецЕсли; 

				Кнопка = Элементы.Добавить(ПодчиненныйЭлемент.Имя + "ПоказатьВидСравнения", Тип("КнопкаФормы"), ПодчиненныйЭлемент.КонтекстноеМеню);
				Кнопка.ИмяКоманды = ПодчиненныйЭлемент.Имя + "ПоказатьВидСравнения";
				
			ИначеЕсли СтрЗаканчиваетсяНа(ПодчиненныйЭлемент.Имя, "ВидСравненияЭлементаОтбора") Тогда
				
				//МассивЭлементов.Добавить(СтрЗаменить(ПодчиненныйЭлемент.Имя, "ВидСравненияЭлементаОтбора", ""));
				МассивЭлементов.Добавить(ПодчиненныйЭлемент);
				
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла;
	
	Для каждого Элемент Из МассивЭлементов Цикл
		
		ИмяЭлемента = Элемент.Имя;
		
		НачалоИднекса = СтрДлина("КомпоновщикНастроекПользовательскиеНастройкиЭлемент")+1;
		КонецИндекса = СтрНайти(ИмяЭлемента, "ВидСравненияЭлементаОтбора");
		Индекс = Число(Сред(ИмяЭлемента, НачалоИднекса, КонецИндекса-НачалоИднекса));
		
		ЗначениеНастройки = ЭтаФорма.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[Индекс].ВидСравнения;
		ЗначениеВидимости = Не (ЗначениеНастройки = ВидСравненияКомпоновкиДанных.Равно);
				
		Элемент.Видимость = ЗначениеВидимости;
		
		ИмяКнопки = СтрЗаменить(ИмяЭлемента, "ВидСравненияЭлементаОтбора", "ЗначениеПоказатьВидСравнения");
		Кнопка = Элементы.Найти(ИмяКнопки);
		Если Не Кнопка = Неопределено Тогда
			Кнопка.Пометка = ЗначениеВидимости;
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Функция НайтиСоздатьЭлементОтбора(Отбор, Поле)

	НайденныйЭлемент = Неопределено;
	
	Для каждого Элемент Из Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = Поле Тогда
			НайденныйЭлемент = Элемент;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлемент.ЛевоеЗначение = Поле;
		НайденныйЭлемент.Использование = Ложь;
	КонецЕсли; 
	
	Если НайденныйЭлемент.ИдентификаторПользовательскойНастройки = "" Тогда
		НайденныйЭлемент.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	КонецЕсли; 
	
	Возврат НайденныйЭлемент;

КонецФункции
 

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
 
 ОбъектОбработки = РеквизитФормыВЗначение("Объект");
 
 ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
 
 Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
 Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
  Механизм,
  ПараметрыВыполненияДляСбораСтатистики.Хранилище,
  ПараметрыВыполненияДляСбораСтатистики.Описание);
  
 ПараметрыСессии = Новый Структура;
 ПараметрыСессии.Вставить("Механизм",     Механизм);
 ПараметрыСессии.Вставить("Сессия",        Сессия);
 ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
 ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
  
 Возврат ПараметрыСессии;
 
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
 
 РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
  ПараметрыСессии.Механизм,
  ПараметрыСессии.Сессия,,
  ПараметрыСессии.ДопПараметры,
  ПараметрыСессии.ТекстОшибки);
 
КонецПроцедуры

#КонецОбласти
