&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = СформироватьАктПИТрНаСервере(ПараметрКоманды);
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать(Строка(ПараметрКоманды) + " (Приложение к акту)");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьАктПИТрНаСервере(ВыводЦенныхБумаг)

	ТабличныйДокумент = Документы.ВыводЦенныхБумаг.СформироватьПриложениеКАкту(ВыводЦенныхБумаг, "Налоговый");
	
	Если ТабличныйДокумент <> Неопределено Тогда
		
		НачалоОбласти = Формат(ТабличныйДокумент.ВысотаТаблицы-3, "ЧГ=0");
		КонецОбласти = Формат(ТабличныйДокумент.ВысотаТаблицы, "ЧГ=0");
		Если ТабличныйДокумент.Область("R" + НачалоОбласти + "C1").Текст = "Валютные ценные бумаги" Тогда 
			//валютных бумаг нет. Удалим секцию
			ТабличныйДокумент.Область("R" + НачалоОбласти + ":R"+ КонецОбласти).Очистить(Истина, Истина, Истина);
		КонецЕсли;	
		
	КонецЕсли;
	
	
	Возврат  ТабличныйДокумент;
	
КонецФункции	