
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ВыполнитьПроверкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()

	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	РеквизитОбъект.ПроверитьБанковскиеСчета(ДатаПроверки);
	РеквизитОбъект.ПроверитьДепозитныеВклады(ДатаПроверки);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ДатаПроверки = ТекущаяДатаСеанса();

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
