#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда

		Возврат; 
		
	КонецЕсли;
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда

		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, , , Ложь);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокиТЧДляУдаления = Объект.ИнформационныеСистемы.НайтиСтроки(Новый Структура("Удалить", Истина));
	Для Каждого СтрокаТЧ Из СтрокиТЧДляУдаления Цикл
		
		ТекущийОбъект.ИнформационныеСистемы.Удалить(
			ТекущийОбъект.ИнформационныеСистемы.Найти(СтрокаТЧ.ИдентификаторСтроки, "ИдентификаторСтроки"));
		
	КонецЦикла;	
	СтрокиТЧДляУдаления = Объект.ТехнологическиеПроцессы.НайтиСтроки(Новый Структура("Удалить", Истина));
	Для Каждого СтрокаТЧ Из СтрокиТЧДляУдаления Цикл
		
		СтрокаТабЧасти = ТекущийОбъект.ТехнологическиеПроцессы.Найти(СтрокаТЧ.ТехнологическийПроцесс, "ТехнологическийПроцесс"); 
		Если СтрокаТабЧасти <> Неопределено Тогда
			
			ТекущийОбъект.ТехнологическиеПроцессы.Удалить(СтрокаТабЧасти);	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтрокиТЧДляУдаления = Объект.ИнформационныеСистемы.НайтиСтроки(Новый Структура("Удалить", Истина));
	Если СтрокиТЧДляУдаления.Количество() Тогда
		
		Ответ = Вопрос("Имеются помеченные на удаление строки и они будут удалены при записи. 
			|Вы уверены, что хотите записать документ?", 
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Да);
									
		Если Ответ = КодВозвратаДиалога.Нет Тогда
										
			Отказ = Истина;
										
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПредставлениеПериодаОтчета(ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ИнформационныеСистемыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Элемент.ТекущиеДанные.Удалить = Не Элемент.ТекущиеДанные.Удалить;
	ЭтаФорма.Модифицированность = Истина;
	ОбновитьТехнологическиеПроцессы();
	Если Не ОбучениеПройдено Тогда

		ТекстСообщенияПользователю = "Вместо удаления строка помечена для удаления при записи документа.
									|Снять пометку для удаления строки можно повторной командой удаления.";
		ПоказатьПредупреждение(, ТекстСообщенияПользователю);
		ОбучениеПройдено = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеСистемыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ИнформационныеСистемыПриАктивизацииСтрокиОбработчик", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеСистемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ИдентификаторНовойСтроки			      = Новый УникальныйИдентификатор;
		ИдентификаторКопируемойСтроки		      = Элемент.ТекущиеДанные.ИдентификаторСтроки;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = ИдентификаторНовойСтроки;
		
		Если Копирование Тогда			
			
			СкопироватьСвязанныеДанные("ТехнологическиеУчастки", 
				ИдентификаторНовойСтроки, ИдентификаторКопируемойСтроки);
			СкопироватьСвязанныеДанные("ИсточникиДанных",        
				ИдентификаторНовойСтроки, ИдентификаторКопируемойСтроки);
			СкопироватьСвязанныеДанные("ПолучателиДанных",       
				ИдентификаторНовойСтроки, ИдентификаторКопируемойСтроки);
			
		КонецЕсли;
		УстановитьОтборСтрокСвязанныхДанных(ИдентификаторНовойСтроки);	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеСистемыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если НоваяСтрока И ОтменаРедактирования Тогда
		
		ИдентификаторТекущейСтроки = Элемент.ТекущиеДанные.ИдентификаторСтроки;
		УдалитьСвязанныеДанные("ТехнологическиеУчастки", ИдентификаторТекущейСтроки);
		УдалитьСвязанныеДанные("ИсточникиДанных",        ИдентификаторТекущейСтроки);
		УдалитьСвязанныеДанные("ПолучателиДанных",       ИдентификаторТекущейСтроки);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвязанныеТехнологическиеУчасткиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = 
			Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИсточникиДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = 
			Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеПолучателиДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = 
			Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеТехнологическиеУчасткиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент, 
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИсточникиДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент, Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеПолучателиДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеТехнологическиеУчасткиПослеУдаления(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИсточникиДанныхПослеУдаления(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеПолучателиДанныхПослеУдаления(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеТехнологическиеУчасткиПриИзменении(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИсточникиДанныхПриИзменении(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеПолучателиДанныхПриИзменении(Элемент)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеСистемыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

    ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, Элемент,
		Элементы.ИнформационныеСистемы.ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ЗаполнитьПредставлениеПериодаОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	
	ИзменитьПериод(-1);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийПериод(Команда)
	
	ИзменитьПериод(1);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеСистемыПриИзменении(Элемент)

	ОбновитьТехнологическиеПроцессы();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура АнализИзменений(Команда)

	Если ЭтаФорма.Модифицированность Тогда
		
		Если Ждать ВопросАсинх("Данные документа не сохранены. Записать документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ЭтаФорма.Записать();	
			
		Иначе
			
			Возврат;
	
		КонецЕсли;
		
	КонецЕсли;
    ОткрытьФорму("Документ.ПоказателиОперационнойНадежности.Форма.ФормаАнализаИзменений", Новый Структура("Ссылка", Объект.Ссылка), , Новый УникальныйИдентификатор);
	
КонецПроцедуры


#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ЗаполнитьПредставлениеСвязанныхДанных(ЭтаФорма, , , Объект.Ссылка.Пустая());
    ЗаполнитьПредставлениеПериодаОтчета(ЭтаФорма);
	ОбновитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступность(Форма)
	
	Форма.Элементы.ИнформационныеСистемыПредставлениеИС.ТолькоПросмотр = Не РаботаСПользователями.РолиДоступны("ПолныеПрава");
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьПредставлениеПериодаОтчета(Форма)

	Форма.ПредставлениеПериодаОтчета = 
		ПредставлениеПериода(НачалоКвартала(Форма.Объект.Дата), 
		КонецКвартала(Форма.Объект.Дата), "ДФ=к 'квартал' гггг 'г.'");
	                                
КонецФункции	

&НаСервереБезКонтекста
Функция РеквизитыИнформационныхСистем(ИнформационныеСистемы)
	
	ДанныеИС = Новый Соответствие;
	ПоляИС   = Новый ФиксированнаяСтруктура("Наименование,
		|БизнесФункция,
		|РазработчикАС,
		|УровеньКритичности,
		|НаименованиеИТПродукта,
		|Принадлежность,
		|РазработчикИТПродукта,
		|КлассОборудования,
		|КлассПрограммногоОбеспечения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнформационныеСистемы", ИнформационныеСистемы);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнформационныеСистемы.Ссылка КАК ИнформационнаяСистема,
		|	ИнформационныеСистемы.Наименование КАК Наименование,
		|	ИнформационныеСистемы.КодБизнесФункции + ""-"" + ИнформационныеСистемы.НаименованиеБизнесФункции КАК БизнесФункция,
		|	ИнформационныеСистемы.РазработчикАС КАК РазработчикАС,
		|	ИнформационныеСистемы.УровеньКритичности КАК УровеньКритичности,
		|	ИнформационныеСистемы.НаименованиеИТПродукта КАК НаименованиеИТПродукта,
		|	ИнформационныеСистемы.Принадлежность КАК Принадлежность,
		|	ИнформационныеСистемы.РазработчикИТПродукта КАК РазработчикИТПродукта,
		|	ИнформационныеСистемы.КлассОборудования КАК КлассОборудования,
		|	ИнформационныеСистемы.КлассПрограммногоОбеспечения КАК КлассПрограммногоОбеспечения
		|ИЗ
		|	Справочник.ИнформационныеСистемы КАК ИнформационныеСистемы
		|ГДЕ
		|	ИнформационныеСистемы.Ссылка В(&ИнформационныеСистемы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеИнформационнойСистемы = Новый Структура(ПоляИС);
		ЗаполнитьЗначенияСвойств(ДанныеИнформационнойСистемы, Выборка);
		ДанныеИС.Вставить(Выборка.ИнформационнаяСистема, ДанныеИнформационнойСистемы);
		
	КонецЦикла;	
	Возврат ДанныеИС;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеСвязанныхДанных(Форма, Элемент, ИдентификаторСтроки = Неопределено, ФормироватьПредставлениеИС = Истина)
	
	ИСДляЧтенияРеквизитов = Новый Массив;
	Если ИдентификаторСтроки = Неопределено Тогда
		
		ИнформационныеСистемы = Форма.Объект.ИнформационныеСистемы;
		Для Каждого СтрокаИС Из ИнформационныеСистемы Цикл
				
			ИСДляЧтенияРеквизитов.Добавить(СтрокаИС.ИнформационнаяСистема);
			
		КонецЦикла;	
		
	Иначе
		
		Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		ИнформационныеСистемы = Форма.Объект.ИнформационныеСистемы.НайтиСтроки(Отбор);
		ИСДляЧтенияРеквизитов.Добавить(ИнформационныеСистемы[0].ИнформационнаяСистема);
		
	КонецЕсли;	
	
	РеквизитыИС = РеквизитыИнформационныхСистем(ИСДляЧтенияРеквизитов);
	
	СвязанныеДанные = Новый Структура("ТехнологическиеУчастки, ИсточникиДанных, ПолучателиДанных"); 
	Для Каждого СтрокаТЧ Из ИнформационныеСистемы Цикл
		
		РеквизитыИнформационнойСистемы = РеквизитыИС.Получить(СтрокаТЧ.ИнформационнаяСистема);
		Для Каждого КлючИЗначение Из СвязанныеДанные Цикл
			
			ДанныеДляПредставления = Новый Массив;
			Отбор = Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки);
			Для Каждого СтрокаДанных Из Форма.Объект[КлючИЗначение.Ключ].НайтиСтроки(Отбор) Цикл
			
				ДанныеДляПредставления.Добавить(СтрокаДанных.Значение);	
				
			КонецЦикла;
			Представление = СтрСоединить(ДанныеДляПредставления, "-");
			Если КлючИЗначение.Ключ <> "ТехнологическиеУчастки" Тогда
				
				СвязанныеДанные[КлючИЗначение.Ключ]	= ?(ПустаяСтрока(Представление), "Не применимо", Представление);
				
			Иначе
				
				СвязанныеДанные[КлючИЗначение.Ключ]	= Представление;
				
			КонецЕсли;	

		КонецЦикла;	
		РеквизитыСтрокиТЧ = Новый Структура("ТехнологическийПроцесс, 
			|ФункциональноеЗначение",
			СтрокаТЧ.ТехнологическийПроцесс,
			СтрокаТЧ.ФункциональноеЗначение);
		СтрокаТЧ.ТехнологическиеУчастки = СвязанныеДанные.ТехнологическиеУчастки;

		Если ФормироватьПредставлениеИС И Не 
			(Элемент = Форма.Элементы.ИнформационныеСистемы И 
			Форма.Элементы.ИнформационныеСистемы.ТекущийЭлемент <> Неопределено И 
			Форма.Элементы.ИнформационныеСистемы.ТекущийЭлемент.Имя = "ИнформационныеСистемыПредставлениеИС") Тогда

			Если ЗначениеЗаполнено(СтрокаТЧ.ИнформационнаяСистема) Тогда

				СтрокаТЧ.ПредставлениеИС = ПредставлениеСтроки(РеквизитыСтрокиТЧ, 
				РеквизитыИнформационнойСистемы, 
				СвязанныеДанные);
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСтроки(РеквизитыСтрокиТЧ, РеквизитыИС, СвязанныеДанные)

	ДанныеДляСвертки = Новый Массив;
	ДанныеДляСвертки.Добавить(РеквизитыСтрокиТЧ.ТехнологическийПроцесс);
	ДанныеДляСвертки.Добавить(РеквизитыИС.Наименование);
	ДанныеДляСвертки.Добавить(СвязанныеДанные.ТехнологическиеУчастки);
	ДанныеДляСвертки.Добавить(РеквизитыИС.БизнесФункция);
	ДанныеДляСвертки.Добавить(РеквизитыСтрокиТЧ.ФункциональноеЗначение);
	ДанныеДляСвертки.Добавить(РеквизитыИС.РазработчикАС);
	ДанныеДляСвертки.Добавить(РеквизитыИС.УровеньКритичности);
	ДанныеДляСвертки.Добавить(СвязанныеДанные.ИсточникиДанных);
	ДанныеДляСвертки.Добавить(СвязанныеДанные.ПолучателиДанных);
	ДанныеДляСвертки.Добавить(РеквизитыИС.НаименованиеИТПродукта);
	ДанныеДляСвертки.Добавить(РеквизитыИС.Принадлежность);
	ДанныеДляСвертки.Добавить(РеквизитыИС.РазработчикИТПродукта);
	ДанныеДляСвертки.Добавить(РеквизитыИС.КлассОборудования);
	ДанныеДляСвертки.Добавить(РеквизитыИС.КлассПрограммногоОбеспечения);
	Возврат СтрСоединить(ДанныеДляСвертки, "|");
	
КонецФункции	

&НаКлиенте
Процедура УстановитьОтборСтрокСвязанныхДанных(ИдентификаторСтроки)

	Элементы.СвязанныеТехнологическиеУчастки.ОтборСтрок = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторСтроки);
	Элементы.СвязанныеИсточникиДанных.ОтборСтрок        = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторСтроки);
	Элементы.СвязанныеПолучателиДанных.ОтборСтрок       = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторСтроки);
	
КонецПроцедуры 	

&НаКлиенте
Процедура СкопироватьСвязанныеДанные(ИмяТаблицы, ИдентификаторНовойСтроки, ИдентификаторКопируемойСтроки)
	
	КопируемыеДанные = Объект[ИмяТаблицы].НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ИдентификаторКопируемойСтроки));
	Для Каждого СтрокаТаблицы Из КопируемыеДанные Цикл
		
		НоваяСтрока = Объект[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "ИдентификаторСтроки");
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторНовойСтроки;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьСвязанныеДанные(ИмяТаблицы, ИдентификаторСтроки)
	
	УдаляемыеДанные = Объект[ИмяТаблицы].НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	Для Каждого СтрокаТаблицы Из УдаляемыеДанные Цикл
		
		Объект[ИмяТаблицы].Удалить(СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ИзменитьПериод(Шаг)
	
	Объект.Дата = КонецКвартала(ДобавитьМесяц(Объект.Дата, Шаг * 3));
	ЗаполнитьПредставлениеПериодаОтчета(ЭтаФорма);
	РабочееВремя = РабочееВремяПериода(НачалоКвартала(Объект.Дата + 1), КонецКвартала(Объект.Дата + 1));
	Если Объект.Ссылка.Пустая() Тогда
		
		Для Каждого СтрокаТЧ Из Объект.ТехнологическиеПроцессы Цикл
			
			СтрокаТЧ.ПродолжительностьВремениРаботы = РабочееВремя;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция РабочееВремяПериода(ДатаНачалаПериода, ДатаОкончанияПериода)

	КоличествоМинут = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",	   ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияПериода);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				ТОГДА ВЫБОР ДанныеКалендаря.ВидДня
		|						КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)
		|							ТОГДА 7
		|						ИНАЧЕ 8
		|					КОНЕЦ
		|		КОНЕЦ) КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		КоличествоМинут = Выборка.КоличествоЧасов * 60;
		
	КонецЕсли;	
	Возврат КоличествоМинут;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТехнологическиеПроцессы()

	Для Каждого СтрокаТЧ Из Объект.ИнформационныеСистемы Цикл
		
		Если Объект.ТехнологическиеПроцессы.НайтиСтроки(Новый Структура("ТехнологическийПроцесс", 
			СтрокаТЧ.ТехнологическийПроцесс)).Количество() = 0 
			И ЗначениеЗаполнено(СтрокаТЧ.ТехнологическийПроцесс) Тогда
			
			ЗаполнитьЗначенияСвойств(Объект.ТехнологическиеПроцессы.Добавить(), СтрокаТЧ, , "Удалить");
			
		КонецЕсли;	
		
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Объект.ТехнологическиеПроцессы Цикл
		
		СтрокаТЧ.Удалить = Объект.ИнформационныеСистемы.НайтиСтроки(Новый Структура("ТехнологическийПроцесс, Удалить", 
			СтрокаТЧ.ТехнологическийПроцесс, Ложь)).Количество() = 0;
		
	КонецЦикла;	
 	
КонецПроцедуры	

&НаКлиенте
Процедура ИнформационныеСистемыПриАктивизацииСтрокиОбработчик() Экспорт

	ТекущиеДанные = Элементы.ИнформационныеСистемы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		
		ИдентификаторТекущейСтроки = Неопределено;
		Элементы.СвязанныеТехнологическиеУчастки.Доступность = Ложь;
		Элементы.СвязанныеИсточникиДанных.Доступность        = Ложь;
		Элементы.СвязанныеПолучателиДанных.Доступность       = Ложь;
		
	Иначе	
		
		ИдентификаторТекущейСтроки = ТекущиеДанные.ИдентификаторСтроки;
		Элементы.СвязанныеТехнологическиеУчастки.Доступность = Истина;
		Элементы.СвязанныеИсточникиДанных.Доступность        = Истина;
		Элементы.СвязанныеПолучателиДанных.Доступность       = Истина;
		
	КонецЕсли;	
	Элементы.СвязанныеТехнологическиеУчастки.ОтборСтрок = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторТекущейСтроки);
	Элементы.СвязанныеИсточникиДанных.ОтборСтрок        = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторТекущейСтроки);
	Элементы.СвязанныеПолучателиДанных.ОтборСтрок       = 
		Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ИдентификаторТекущейСтроки);

КонецПроцедуры	


#КонецОбласти 



