
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Стандартная Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДоговораДоверительногоУправления");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОкончаниеДействияСтратегии) Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаПриказаПрекращенияСтратегии");
		ПроверяемыеРеквизиты.Добавить("НомерПриказаПрекращенияСтратегии");
	КонецЕсли;
	
КонецПроцедуры

