
&НаКлиенте
Функция Квартал(_Дата)
	
	Возврат Цел((Месяц(_Дата) + 2) / 3);
	
КонецФункции // Квартал

&НаКлиенте
Процедура ОпределитьВариантВыбораПериода()

	Если ЭтаФорма.Период.Вариант <> ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		ЭтаФорма.ПериодСтандартный = 1;

	Иначе
		// время посылаем нахер, все равно в журнале им никто не пользуется
		ЭтаФорма.Период.ДатаНачала    = НачалоДня(ЭтаФорма.Период.ДатаНачала);
		ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.Период.ДатаОкончания);
		
		// установим наиболее подхоядщий вариант выбора периода
		Если ЭтаФорма.Период.ДатаНачала = НачалоКвартала(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецКвартала(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодКвартал = 1;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоГода(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецКвартала(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодКвартал = 1;
			ЭтаФорма.СНачалаГода   = Истина;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоМесяца(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецМесяца(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодМесяц = 1;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоГода(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецМесяца(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодМесяц = 1;
			ЭтаФорма.СНачалаГода = Истина;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоКвартала(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецМесяца(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодМесяц     = 1;
			ЭтаФорма.СНачалаКвартала = Истина;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоДня(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодДень = 1;
		
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоГода(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодДень  = 1;
			ЭтаФорма.СНачалаГода = Истина;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоКвартала(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодДень      = 1;
			ЭтаФорма.СНачалаКвартала = Истина;
			
		ИначеЕсли ЭтаФорма.Период.ДатаНачала = НачалоМесяца(ЭтаФорма.Период.ДатаОкончания)
			И ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.Период.ДатаОкончания)
		Тогда
			ЭтаФорма.ПериодДень    = 1;
			ЭтаФорма.СНачалаМесяца = Истина;
			
		Иначе
			ЭтаФорма.ПериодИнтервал = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// установим даты вариантов выбора периода
	ЭтаФорма.ДатаДень = ЭтаФорма.Период.ДатаОкончания;
	
	ЭтаФорма.ДатаМесяц    = Элементы.ДатаМесяц.СписокВыбора[Месяц(ЭтаФорма.ДатаДень) - 1];
	ЭтаФорма.ДатаМесяцГод = Формат(Год(ЭтаФорма.ДатаДень), "ЧГ=");
	
	ЭтаФорма.ДатаКвартал    = Элементы.ДатаКвартал.СписокВыбора[Квартал(ЭтаФорма.ДатаДень) - 1];
	ЭтаФорма.ДатаКварталГод = Формат(Год(ЭтаФорма.ДатаДень), "ЧГ=");

	// для ускорения выбора, дополним список выбора выбором с года, следующего за текущим, до 5-ти лет назад
	Для НомГода = -1 - Год(ТекущаяДата()) По 5 - Год(ТекущаяДата()) Цикл
		Элементы.ДатаМесяцГод.СписокВыбора.Добавить(Формат(-НомГода, "ЧГ="));
		Элементы.ДатаКварталГод.СписокВыбора.Добавить(Формат(-НомГода, "ЧГ="));
	КонецЦикла;	
	
КонецПроцедуры // ОпределитьВариантВыбораПериода


&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	// достуность элементов ввода даты
	Элементы.ДатаДень.Доступность       = (ЭтаФорма.ПериодДень = 1);
	Элементы.ГруппаМесяц.Доступность    = (ЭтаФорма.ПериодМесяц = 1);
	Элементы.ГруппаКвартал.Доступность  = (ЭтаФорма.ПериодКвартал = 1);
	Элементы.ГруппаИнтервал.Доступность = (ЭтаФорма.ПериодИнтервал = 1);
	Элементы.ПериодВариант.Доступность  = (ЭтаФорма.ПериодСтандартный = 1);
	
	// достуность модификаторов периода
	Элементы.СНачалаГода.Доступность     = (ЭтаФорма.ПериодДень = 1 Или ЭтаФорма.ПериодМесяц = 1 Или ЭтаФорма.ПериодКвартал = 1);
	Элементы.СНачалаКвартала.Доступность = (ЭтаФорма.ПериодДень = 1 Или ЭтаФорма.ПериодМесяц = 1);
	Элементы.СНачалаМесяца.Доступность   = (ЭтаФорма.ПериодДень = 1);
	
КонецПроцедуры // НастроитьВидимостьДоступность


&НаКлиенте
Функция ОпределитьОкончаниеВыбМесяца()
	
	НомерМесяца = 1 + Элементы.ДатаМесяц.СписокВыбора.Индекс(
		Элементы.ДатаМесяц.СписокВыбора.НайтиПоЗначению(ЭтаФорма.ДатаМесяц));
	
	Возврат КонецМесяца(Дата(Число(ЭтаФорма.ДатаМесяцГод), НомерМесяца, 1));
		
КонецФункции // ОпределитьОкончаниеВыбМесяца

&НаКлиенте
Функция ОпределитьОкончаниеВыбКвартала()
	
	НомерМесяца = 3 * (1 + Элементы.ДатаКвартал.СписокВыбора.Индекс(
		Элементы.ДатаКвартал.СписокВыбора.НайтиПоЗначению(ЭтаФорма.ДатаКвартал)));
		
	Возврат КонецМесяца(Дата(Число(ЭтаФорма.ДатаКварталГод), НомерМесяца, 1));
		
КонецФункции // ОпределитьОкончаниеВыбКвартала

&НаКлиенте
Процедура УстановитьПериод()
	
	Если ЭтаФорма.ПериодСтандартный = 1 Тогда // границы будут установлены автоматически
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Если      ЭтаФорма.ПериодДень = 1 Тогда
		Если      ЭтаФорма.СНачалаГода Тогда
			ЭтаФорма.Период.ДатаНачала    = НачалоГода(ЭтаФорма.ДатаДень);
			ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.ДатаДень);
		ИначеЕсли ЭтаФорма.СНачалаКвартала Тогда
			ЭтаФорма.Период.ДатаНачала    = НачалоКвартала(ЭтаФорма.ДатаДень);
			ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.ДатаДень);
		ИначеЕсли ЭтаФорма.СНачалаМесяца Тогда
			ЭтаФорма.Период.ДатаНачала    = НачалоМесяца(ЭтаФорма.ДатаДень);
			ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.ДатаДень);
		Иначе
			ЭтаФорма.Период.ДатаНачала    = НачалоДня(ЭтаФорма.ДатаДень);
			ЭтаФорма.Период.ДатаОкончания = КонецДня(ЭтаФорма.ДатаДень);
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.ПериодМесяц = 1 Тогда
		Если      ЭтаФорма.СНачалаГода Тогда
			ЭтаФорма.Период.ДатаОкончания = ОпределитьОкончаниеВыбМесяца();
			ЭтаФорма.Период.ДатаНачала    = НачалоГода(ЭтаФорма.Период.ДатаОкончания);
		ИначеЕсли ЭтаФорма.СНачалаКвартала Тогда
			ЭтаФорма.Период.ДатаОкончания = ОпределитьОкончаниеВыбМесяца();
			ЭтаФорма.Период.ДатаНачала    = НачалоКвартала(ЭтаФорма.Период.ДатаОкончания);
		Иначе
			ЭтаФорма.Период.ДатаОкончания = ОпределитьОкончаниеВыбМесяца();
			ЭтаФорма.Период.ДатаНачала    = НачалоМесяца(ЭтаФорма.Период.ДатаОкончания);
		КонецЕсли;
			
	ИначеЕсли ЭтаФорма.ПериодКвартал = 1 Тогда
		Если ЭтаФорма.СНачалаГода Тогда
			ЭтаФорма.Период.ДатаОкончания = ОпределитьОкончаниеВыбКвартала();
			ЭтаФорма.Период.ДатаНачала    = НачалоГода(ЭтаФорма.Период.ДатаОкончания);
		Иначе
			ЭтаФорма.Период.ДатаОкончания = ОпределитьОкончаниеВыбКвартала();
			ЭтаФорма.Период.ДатаНачала    = НачалоКвартала(ЭтаФорма.Период.ДатаОкончания);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьПериод

&НаКлиенте
Процедура ПриИзмененииПериода(Элемент = Неопределено)
	
	Если Элемент <> Неопределено Тогда
	
		Если     Элемент.Родитель = Элементы.ГруппаВариантыВыбораПериода Тогда // скинем предыдущий вариант
			
			Для каждого ПодчЭлемент Из Элементы.ГруппаВариантыВыбораПериода.ПодчиненныеЭлементы Цикл
				ЭтаФорма[ПодчЭлемент.Имя] = ?(ПодчЭлемент = Элемент, 1, 0);
			КонецЦикла;
			
			Если ЭтаФорма.ПериодИнтервал Или ЭтаФорма.ПериодСтандартный Тогда // очистим модификаторы
				Для каждого ПодчЭлемент Из Элементы.ГруппаМодификаторыПериода.ПодчиненныеЭлементы Цикл
					ЭтаФорма[ПодчЭлемент.Имя] = 0;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли Элемент.Родитель = Элементы.ГруппаМодификаторыПериода И ЭтаФорма[Элемент.Имя] Тогда // скинем предыдущий модификатор
			
			Для каждого ПодчЭлемент Из Элементы.ГруппаМодификаторыПериода.ПодчиненныеЭлементы Цикл
				Если ПодчЭлемент <> Элемент Тогда
					ЭтаФорма[ПодчЭлемент.Имя] = Ложь;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	
		НастроитьВидимостьДоступность();
		
	КонецЕсли;
	
	УстановитьПериод();
	
КонецПроцедуры // ПриИзмененииПериода


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("Период") Тогда
		ЭтаФорма.Период = ЭтаФорма.Параметры.Период;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОпределитьВариантВыбораПериода();
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ЭтаФорма.ПериодСтандартный = 1 Тогда
		Если ЭтаФорма.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
			Предупреждение("Выбор стандартного произвольного периода не поддерживается. Измените тип периода на Интервал и укажите границы [С … По …].");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Закрыть(ЭтаФорма.Период);
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодДеньПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодМесяцПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодКварталПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодИнтервалПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтандартныйПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СНачалаГодаПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СНачалаКварталаПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СНачалаМесяцаПриИзменении(Элемент)
	
	ПриИзмененииПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДеньПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаМесяцПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаМесяцГодПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКварталПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКварталГодПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры
