
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль вывода активов ДУ",
		"0.11",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация"  , ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОтчета"   , ЭтотОбъект.Период.Дата);
	ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПлюс5рд", Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.Дата+24*3600, 5));
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры
