
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КомментарийКВыполнению = "";
	Если ВвестиСтроку(КомментарийКВыполнению, "Введите комментарий к выполнению", , Истина) Тогда
		Если ЗначениеЗаполнено(КомментарийКВыполнению) Тогда
			ВыполнитьЗадачи(ПараметрКоманды, КомментарийКВыполнению);	
			ОповеститьОбИзменении(Тип("ЗадачаСсылка.ОшибкиРегламентыхЗаданий"));
		Иначе
			Предупреждение("Для выполнения задачи необходимо указать комментарий");
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачи(МассивЗадач, КомментарийКВыполнению)

	Для Каждого Задача Из МассивЗадач Цикл
		
		ЗадачаВыполнена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Выполнена"); 
		
		Если Не ЗадачаВыполнена Тогда
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			ЗадачаОбъект.КомментарийКВыполнению = КомментарийКВыполнению;
			ЗадачаОбъект.ВыполнитьЗадачу();
			
		КонецЕсли;
		
	КонецЦикла;		

КонецПроцедуры