Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"ЗадолженностьКакВ502ф",
		"0.07",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;

	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", 						ЭтотОбъект.НаДату);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГраницаОкончания", 				Новый Граница(КонецДня(ЭтотОбъект.НаДату), ВидГраницы.Включая));
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыЗадолженностиСПредварительнымНачислением", 
																							Справочники.ВидыЗадолженности.ВидыЗадолженностиСПредварительнымНачислением(ЭтотОбъект.Организация, ЭтотОбъект.НаДату));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НКО_НКЦ", 						ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры
