
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОбстоятельствоПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозникновенияПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.События.Отбор, 
		"КонфликтИнтересов", 
		, 
		ВидСравненияКомпоновкиДанных.Равно,
		Объект.Ссылка,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование()

	Объект.Наименование = СтрШаблон("%1 %2 от %3",
		Объект.Обстоятельство,
		Объект.СчетДоверительногоУправления,
		Формат(Объект.ДатаВозникновения, "ДФ=dd.MM.yyyy"));

КонецПроцедуры

&НаКлиенте
Процедура ПредметКонфликтаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти 


