
&НаСервереБезКонтекста
Функция ПолучитьПредставлениеПайщика(ЗаявкаПайщика, Дата)
	
	Если ТипЗнч(ЗаявкаПайщика) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Представление
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = &Язык
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = &Язык
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Подразделение", Справочники.Подразделения.ГруппаКомпаний);
		Запрос.УстановитьПараметр("Язык",          Справочники.Языки.Русский);
		Запрос.УстановитьПараметр("Организация",   ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаПайщика, "Организация"));
		Запрос.УстановитьПараметр("ЮрФизЛицо",     ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаПайщика, "Пайщик"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПредставлениеПайщика = " Пайщик: " + Выборка.Представление;
		Иначе
			ПредставлениеПайщика = "";
		КонецЕсли;
		
	Иначе
		ПредставлениеПайщика = "";	
	КонецЕсли;
	
	Возврат ПредставлениеПайщика;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНазначениеПлатежа(ТипЗаявки, Выборка, ПредставлениеКлиента)
	
	Если      ТипЗаявки = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
		
		Если ЗначениеЗаполнено(Выборка.НазначениеПлатежа) Тогда
			Возврат Выборка.НазначениеПлатежа;
		Иначе
			Если Выборка.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
				Возврат "Возврат денежных средств. Без НДС.";
			Иначе	
				Возврат "Возврат денежных средств по договору ДУ № " + Выборка.НомерДоговораДУ + " от " + Формат(Выборка.ДатаДоговораДУ, "ДФ=dd.MM.yyyy") + ". Без НДС.";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗаявки = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
		
		Если Выборка.ПереводПоЗаявкеПайщика Тогда
			
			Возврат "Перевод ДС с транзитного счета за паи " + Выборка.ПИФЗаявкиПайщика + " по заявке № " + Выборка.НомерЗаявкиПайщика + " от "
			+ Формат(Выборка.ДатаЗаявкиПайщика, "ДФ=dd.MM.yyyy") + ". Без НДС." + ПолучитьПредставлениеПайщика(Выборка.Основание, Выборка.Дата);
			
		Иначе
			
			Если Выборка.ВидДоговораДУ = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") Тогда
				ФИО = ". " + ПолучитьСокращенныеФИО(ПредставлениеКлиента);
			Иначе
				ФИО = ".";
			КонецЕсли;
			
			ИнвестСчетКлиента = ?(Выборка.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет, " Инв. сч. №" + Выборка.КодСчетаДУБО, "");
			
			Если Выборка.БрокерПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ГПБ") Тогда
				Возврат "Код ТС 002. Перечисление средств для покупки ценных бумаг на ФБ ММВБ согласно договору № "
				+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
				
			ИначеЕсли Выборка.БрокерПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион") Тогда
				Если Выборка.МестоХраненияПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_Торговый") Тогда
					Возврат "Перечисление денежных средств по брокерскому соглашению № "
					+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
				ИначеЕсли Выборка.МестоХраненияПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ_Торговый+") Тогда
					Возврат "Перечисление денежных средств обеспечения ФРОРК" + Выборка.ФРОРК + " по соглашению о брокерском обслуживании № "
					+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
				ИначеЕсли Выборка.МестоХраненияПолучатель = Справочники.МестаХранения.ВнебиржевойРынок Тогда	
					Возврат "Перечисление денежных средств по брокерскому соглашению № "
					+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
				КонецЕсли;	
			ИначеЕсли Выборка.БрокерПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_КИТ_Финанс") Тогда
				Возврат "Средства на операции с ценными бумагами по Договору обслуживания на рынке ценных бумаг "
				+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
			ИначеЕсли Выборка.БрокерПолучатель = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_ВБРР") Тогда
	            Возврат "Перечисление средств для покупки ценных бумаг на ФБ ММВБ в рамках договора об оказании брокерских услуг №" 
				+ Выборка.НомерДоговораБО + " от " + Формат(Выборка.ДатаДоговораБО, "ДФ=dd.MM.yyyy") + ИнвестСчетКлиента + ФИО + " Без НДС.";
			ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.БрокерПолучатель) Тогда
				Если Выборка.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
					Возврат "Перевод денежных средств с одного расчетного счета на другой расчетный счет" + ФИО + " Без НДС.";
				Иначе	
					Возврат "Перевод денежных средств по договору ДУ № " + Выборка.НомерДоговораДУ + " от " + Формат(Выборка.ДатаДоговораДУ, "ДФ=dd.MM.yyyy") + ФИО + " Без НДС.";
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ПолучитьНазначениеПлатежа

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыЗаявки(Заявка)
	
	ТипЗаявки = ТипЗнч(Заявка);
	
	РеквизитыЗаявки = Новый Структура("ПечНомерДоговора, ПечДатаПроплаты, ПечСуммаПроплаты, ПечПолучатель, ПечИНН, ПечРасчСчет, ПечБанкПолучателя, ПечБИК, ПечКоррСчет, ПечБанк, ПечНазначение");
	
	Запрос = Новый Запрос;
	
	Если ТипЗаявки = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда // перевод с собственного р/счета на р/счет контрагента
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВыводДенежныхСредств.Организация КАК Организация,
			|	ВыводДенежныхСредств.Дата КАК Дата,
			|	ВыводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ПРЕДСТАВЛЕНИЕ(ВыводДенежныхСредств.СчетДоверительногоУправления) КАК СчетДоверительногоУправленияПредставление,
			|	ВыводДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
			|	ВыводДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
			|	ВыводДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
			|	ВыводДенежныхСредств.РасчетныйСчет.НомерСчета КАК РасчетныйСчетНомерСчета,
			|	ПРЕДСТАВЛЕНИЕ(ВыводДенежныхСредств.РасчетныйСчет.Банк) КАК РасчетныйСчетБанкПредставление,
			|	ВЫБОР
			|		КОГДА ВыводДенежныхСредств.ВидОперации В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ))
			|			ТОГДА ВыводДенежныхСредств.Сумма - ВыводДенежныхСредств.СуммаНДФЛ
			|		ИНАЧЕ ВыводДенежныхСредств.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ВыводДенежныхСредств.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу
			|		КОГДА ВыводДенежныхСредств.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество
			|	КОНЕЦ КАК ПечПолучатель,
			|	ВЫБОР
			|		КОГДА ВыводДенежныхСредств.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.ИНН
			|		КОГДА ВыводДенежныхСредств.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицСрезПоследних.ИНН
			|	КОНЕЦ КАК ПечИНН,
			|	ВыводДенежныхСредств.РасчетныйСчетКонтрагента.НомерСчета КАК ПечРасчСчет,
			|	ПРЕДСТАВЛЕНИЕ(ВыводДенежныхСредств.РасчетныйСчетКонтрагента.Банк) КАК ПечБанкПолучателя,
			|	ВыводДенежныхСредств.РасчетныйСчетКонтрагента.Банк.Код КАК ПечБИК,
			|	ВыводДенежныхСредств.РасчетныйСчетКонтрагента.Банк.КоррСчет КАК ПечКоррСчет,
			|	ВыводДенежныхСредств.НазначениеПлатежа КАК НазначениеПлатежа
			|ИЗ
			|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
			|		ПО ВыводДенежныхСредств.Контрагент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
			|			И ВыводДенежныхСредств.Организация = РеквизитыЮридическихЛицСрезПоследних.Организация
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
			|		ПО ВыводДенежныхСредств.Контрагент = РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо
			|			И ВыводДенежныхСредств.Организация = РеквизитыФизическихЛицСрезПоследних.Организация
			|ГДЕ
			|	ВыводДенежныхСредств.Ссылка = &Ссылка";
			
	ИначеЕсли ТипЗаявки = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда 
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПереводДенежныхСредств.Основание ССЫЛКА Документ.ЗаявкаПайщика
			|		И ПереводДенежныхСредств.Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.ПустаяСсылка) КАК ПереводПоЗаявкеПайщика,
			|	ПереводДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговораДУ,
			|	ПереводДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговораДУ,
			|	ПереводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДУ,
			|	ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика).НомерЗаявки КАК НомерЗаявкиПайщика,
			|	ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика).Дата КАК ДатаЗаявкиПайщика,
			|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК ПИФЗаявкиПайщика,
			|	ПереводДенежныхСредств.Организация КАК Организация,
			|	ПереводДенежныхСредств.Дата КАК Дата,
			|	ПереводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ПРЕДСТАВЛЕНИЕ(ПереводДенежныхСредств.СчетДоверительногоУправления) КАК СчетДоверительногоУправленияПредставление,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК КодСчетаДУБО,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговораБО,
			|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаДоговораБО,
			|	УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних.ФРОРК КАК ФРОРК,
			|	ПереводДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
			|	ПереводДенежныхСредств.РасчетныйСчет.НомерСчета КАК РасчетныйСчетНомерСчета,
			|	ПРЕДСТАВЛЕНИЕ(ПереводДенежныхСредств.РасчетныйСчет.Банк) КАК РасчетныйСчетБанкПредставление,
			|	ПереводДенежныхСредств.МестоХраненияПолучатель КАК МестоХраненияПолучатель,
			|	ПереводДенежныхСредств.БрокерПолучатель КАК БрокерПолучатель,
			|	ПереводДенежныхСредств.Сумма КАК Сумма,
			|	ВЫБОР
			|		КОГДА ПереводДенежныхСредств.Основание ССЫЛКА Документ.ЗаявкаПайщика
			|				И ПереводДенежныхСредств.Основание <> ЗНАЧЕНИЕ(Документ.ЗаявкаПайщика.ПустаяСсылка)
			|			ТОГДА ПереводДенежныхСредств.РасчетныйСчетПолучатель.Договор.НаименованиеВладельцаДляДокументов
			|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу
			|	КОНЕЦ КАК ПечПолучатель,
			|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ПечИНН,
			|	ПереводДенежныхСредств.РасчетныйСчетПолучатель.НомерСчета КАК ПечРасчСчет,
			|	ПРЕДСТАВЛЕНИЕ(ПереводДенежныхСредств.РасчетныйСчетПолучатель.Банк) КАК ПечБанкПолучателя,
			|	ПереводДенежныхСредств.РасчетныйСчетПолучатель.Банк.Код КАК ПечБИК,
			|	ПереводДенежныхСредств.РасчетныйСчетПолучатель.Банк.КоррСчет КАК ПечКоррСчет,
			|	ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика) КАК Основание
			|ИЗ
			|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
			|				&Период,
			|				СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровБрокерскогоОбслуживания.СрезПоследних(&Период, ) КАК УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних
			|			ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних.Договор
			|		ПО ПереводДенежныхСредств.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
			|			И ПереводДенежныхСредств.БрокерПолучатель = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&Период,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
			|		ПО ПереводДенежныхСредств.РасчетныйСчетПолучатель.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (ВЫРАЗИТЬ(ПереводДенежныхСредств.Основание КАК Документ.ЗаявкаПайщика).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
			|ГДЕ
			|	ПереводДенежныхСредств.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Брокер", Заявка.БрокерПолучатель);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Ссылка",                       Заявка.Ссылка);
	Запрос.УстановитьПараметр("Период",                       Заявка.Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Заявка.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыЗаявки, Выборка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Заявка.СчетДоверительногоУправления, Заявка.Дата);
	
	ПредставлениеКлиента = ПолучитьПредставлениеКлиентаДоверительногоУправления(Заявка.СчетДоверительногоУправления, КлиентДоверительногоУправления, Заявка.Дата);
	
	РеквизитыЗаявки.ПечДатаПроплаты  = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	РеквизитыЗаявки.ПечСуммаПроплаты = Формат(Выборка.Сумма, "ЧДЦ=2; ЧРД=-; ЧРГ=''''");
	РеквизитыЗаявки.ПечБанк          = ?(ЗначениеЗаполнено(Выборка.РасчетныйСчет), Выборка.РасчетныйСчетНомерСчета + Символы.ПС + "(" + Выборка.РасчетныйСчетБанкПредставление + ?(ЗначениеЗаполнено(ПредставлениеКлиента), ", " + ПредставлениеКлиента, "") + ")", "");
	РеквизитыЗаявки.ПечНазначение    = ПолучитьНазначениеПлатежа(ТипЗаявки, Выборка, ПредставлениеКлиента);

	Возврат РеквизитыЗаявки;
	
КонецФункции // ПолучитьРеквизитыЗаявки

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыНаПроплатуВБюджет(Заявка)
	
	РеквизитыЗаявки = Новый Структура("ПечНомерДоговора, ПечДатаПроплаты, ПечСуммаПроплаты, ПечПолучатель, ПечИНН, ПечРасчСчет, ПечБанкПолучателя, ПечБИК, ПечКоррСчет, ПечБанк, ПечНазначение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыводДенежныхСредств.Организация КАК Организация,
		|	ВыводДенежныхСредств.Дата КАК Дата,
		|	ВыводДенежныхСредств.СуммаНДФЛ КАК Сумма,
		|	ВыводДенежныхСредств.СчетДоверительногоУправления.Представление КАК СчетДоверительногоУправленияПредставление,
		|	ВыводДенежныхСредств.РасчетныйСчет.НомерСчета КАК РасчетныйСчет,
		|	ВыводДенежныхСредств.РасчетныйСчет.Банк.Наименование КАК Банк
		|ПОМЕСТИТЬ _ДанныеДокумента
		|ИЗ
		|	Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|ГДЕ
		|	ВыводДенежныхСредств.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИФНСОрганизацийСрезПоследних.Организация КАК Организация,
		|	ИФНСОрганизацийСрезПоследних.ИФНС КАК ИФНС,
		|	ИФНСОрганизацийСрезПоследних.БанковскийСчет КАК БанковскийСчет
		|ПОМЕСТИТЬ _ИФНС
		|ИЗ
		|	РегистрСведений.ИФНСОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И НЕ ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИФНС.Организация КАК Организация,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ИФНС,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.КодПоОКТМО КАК ОКТМО,
		|	_ИФНС.БанковскийСчет.НомерСчета КАК НомерСчета,
		|	_ИФНС.БанковскийСчет.Банк.Наименование КАК Банк,
		|	_ИФНС.БанковскийСчет.Банк.Код КАК БИК,
		|	_ИФНС.БанковскийСчет.Банк.КоррСчет КАК КоррСчет
		|ПОМЕСТИТЬ _ДанныеИФНС
		|ИЗ
		|	_ИФНС КАК _ИФНС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							_ИФНС.ИФНС КАК ИФНС
		|						ИЗ
		|							_ИФНС КАК _ИФНС)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ИФНС.ИФНС = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДокумента.Организация КАК Организация,
		|	_ДанныеДокумента.Дата КАК Дата,
		|	_ДанныеДокумента.Сумма КАК Сумма,
		|	_ДанныеИФНС.ИФНС КАК ПечПолучатель,
		|	_ДанныеИФНС.ИНН КАК ПечИНН,
		|	_ДанныеИФНС.ОКТМО КАК ОКТМО,
		|	_ДанныеИФНС.НомерСчета КАК ПечРасчСчет,
		|	_ДанныеИФНС.Банк КАК ПечБанкПолучателя,
		|	_ДанныеИФНС.БИК КАК ПечБИК,
		|	_ДанныеИФНС.КоррСчет КАК ПечКоррСчет,
		|	_ДанныеДокумента.СчетДоверительногоУправленияПредставление КАК СчетДоверительногоУправленияПредставление,
		|	_ДанныеДокумента.РасчетныйСчет КАК РасчетныйСчет,
		|	_ДанныеДокумента.Банк КАК Банк
		|ИЗ
		|	_ДанныеДокумента КАК _ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеИФНС КАК _ДанныеИФНС
		|		ПО _ДанныеДокумента.Организация = _ДанныеИФНС.Организация";
	
	Запрос.УстановитьПараметр("Ссылка",			Заявка);
	Запрос.УстановитьПараметр("Период",			Заявка.Дата);
	Запрос.УстановитьПараметр("Организация",	Заявка.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыЗаявки, Выборка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Заявка.СчетДоверительногоУправления, Заявка.Дата);
	
	ПредставлениеКлиента = ПолучитьПредставлениеКлиентаДоверительногоУправления(Заявка.СчетДоверительногоУправления, КлиентДоверительногоУправления, Заявка.Дата);
	
	РеквизитыЗаявки.ПечДатаПроплаты  = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
	РеквизитыЗаявки.ПечСуммаПроплаты = Формат(Выборка.Сумма, "ЧДЦ=2; ЧРД=-; ЧРГ=''''");
	РеквизитыЗаявки.ПечБанк          = Выборка.РасчетныйСчет + Символы.ПС + " (" + Выборка.Банк + ?(ЗначениеЗаполнено(ПредставлениеКлиента), ", " + ПредставлениеКлиента, "") + ")";
		
	Если ТипЗнч(КлиентДоверительногоУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		РеквизитыЗаявки.ПечНазначение    = "18210102010011000110 ; " + Выборка.ОКТМО + ";ТП;МС." + Формат(Выборка.Дата, "ДФ=ММ.гггг") + ";0;НС;" + """НДФЛ при выплате компенсации за паи " + ПредставлениеКлиента + """ как налоговый агент. БезНДС";
	КонецЕсли;

	Возврат РеквизитыЗаявки;
	
КонецФункции // ПолучитьРеквизитыНаПроплатуВБюджет

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеКлиентаДоверительногоУправления(СчетДоверительногоУправления, КлиентДоверительногоУправления, Период)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Если ТипЗнч(КлиентДоверительногоУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		
		РеквизитыПИФ = РегистрыСведений.РеквизитыПИФ.ПолучитьРеквизитыПИФ(КлиентДоверительногоУправления, Период);
		
		Результат = РеквизитыПИФ.ПолноеНаименованиеФонда;
		
	Иначе
				
		Запрос.УстановитьПараметр("ЮрФизЛицо",	КлиентДоверительногоУправления);
		Запрос.УстановитьПараметр("Период",		Период);
		
		Если КлиентДоверительногоУправления.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Реквизиты.СокращенноеНаименование КАК Наименование
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|			&Период,
			|			ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК Реквизиты";
		Иначе
			Запрос.УстановитьПараметр("Организация", СчетДоверительногоУправления.Организация);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Реквизиты.Фамилия + "" "" + Реквизиты.Имя + "" "" + Реквизиты.Отчество КАК Наименование
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			&Период,
			|			ЮрФизЛицо = &ЮрФизЛицо
			|				И Организация = &Организация
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК Реквизиты";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Наименование;
		КонецЕсли; 
		
	КонецЕсли;
				
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьЗаявкуНаСервере()
	
	ЭтаФорма.ТабличныйДокумент.Очистить();
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ЗаявкаНаПроплатуПоДоговору");
	
	РеквизитыЗаявки = ПолучитьРеквизитыЗаявки(Объект.ЗаявкаНаПроплатуПоДоговору);
	ЗаполнитьЗначенияСвойств(Макет.Параметры, РеквизитыЗаявки);
	
	ЭтаФорма.ТабличныйДокумент.Вывести(Макет);
	
	Если ТипЗнч(Объект.ЗаявкаНаПроплатуПоДоговору) = Тип("ДокументСсылка.ВыводДенежныхСредств") 
		и Объект.ЗаявкаНаПроплатуПоДоговору.СуммаНДФЛ <> 0 Тогда
		
		ЭтаФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ЗаявкаНаПроплатуВБюджет");
	
		РеквизитыЗаявки = ПолучитьРеквизитыНаПроплатуВБюджет(Объект.ЗаявкаНаПроплатуПоДоговору);
		ЗаполнитьЗначенияСвойств(Макет.Параметры, РеквизитыЗаявки);
	
		ЭтаФорма.ТабличныйДокумент.Вывести(Макет);
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьЗаявкуНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("ЗаявкаНаПроплатуПоДоговору") Тогда
		Объект.ЗаявкаНаПроплатуПоДоговору = ЭтаФорма.Параметры.ЗаявкаНаПроплатуПоДоговору;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ТипЗаявки") Тогда
		Объект.ТипЗаявки = ЭтаФорма.Параметры.ТипЗаявки;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ЗаявкаНаПроплатуПоДоговору) И ТипЗнч(Объект.ЗаявкаНаПроплатуПоДоговору) = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
		Если ЗначениеЗаполнено(Объект.ЗаявкаНаПроплатуПоДоговору.Брокер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать заявки не возможна, т.к. перевод не соответствует переводу д/с с расчетного счета.",,,,Отказ);
			Возврат;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ЗаявкаНаПроплатуПоДоговору) Тогда
		КомандаСформироватьЗаявку(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьЗаявку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСформироватьЗаявку");
	Попытка
		ВыполнитьСформироватьЗаявку(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСформироватьЗаявку(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ПараметрыСессии.ТекстОшибки = "Проверка заполнения не пройдена";
		Возврат;
	КонецЕсли;
	
	СформироватьЗаявкуНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСокращенныеФИО(Знач ПредставлениеКлиента)
	
	Если ПустаяСтрока(ПредставлениеКлиента) Тогда
		Возврат "";
	КонецЕсли;
	
	ПозицияПробела = СтрНайти(ПредставлениеКлиента, " ");
	
	Если ПозицияПробела > 0 Тогда
		
		Результат = Лев(ПредставлениеКлиента, ПозицияПробела);
		
		ПредставлениеКлиента = Сред(ПредставлениеКлиента, ПозицияПробела + 1);
		
		Если ПустаяСтрока(ПредставлениеКлиента) Тогда
			Возврат Результат;
		КонецЕсли;
		
		ПозицияПробела = СтрНайти(ПредставлениеКлиента, " ");
		
		Если ПозицияПробела > 0 Тогда
			
			Результат = Результат + Лев(ПредставлениеКлиента, 1) + ".";
			
			ПредставлениеКлиента = Сред(ПредставлениеКлиента, ПозицияПробела + 1);
			
			Если ПустаяСтрока(ПредставлениеКлиента) Тогда
				Возврат Результат;
			КонецЕсли;
			
			Возврат Результат + Лев(ПредставлениеКлиента, 1) + ".";
			
		Иначе
			Возврат Результат + Лев(ПредставлениеКлиента, 1) + ".";
		КонецЕсли;
		
	Иначе
		Возврат ПредставлениеКлиента;
	КонецЕсли;
	
КонецФункции

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти