
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мСкопированаФорма = Неопределено;
	мСохраненныйДок	  = Параметры.ЗначениеКопирования;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ВыбраннаяФорма) Тогда
		
		мСкопированаФорма = Объект.ВыбраннаяФорма;
		
	КонецЕсли;
	
	ИсточникОтчета = "";
	Объект.Свойство("ИсточникОтчета", ИсточникОтчета);
	
	// Временно. При обнаружении - уведомить
	Если Объект.ИсточникОтчета = "РегламентированныйОтчетБалансНПФ" Тогда
		Объект.ИсточникОтчета = "РегламентированныйОтчетБаланс";		
	КонецЕсли;
	
	Если Не(РеквизитФормыВЗначение("Объект").ЭтоНовый()) ИЛИ (мСкопированаФорма <> Неопределено) Тогда
		                     		
		ОбъектОтчет = Отчеты[Объект.ИсточникОтчета];
		
		Если ОбъектОтчет = Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть сохраненные данные. Отчет не найден.",,,,Отказ);
			Возврат;
			
		КонецЕсли;
		
		ОткрытьФормуОтчета = Истина;
		
	ИначеЕсли РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		ОткрытьФормуОтчета = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если ОткрытьФормуОтчета Тогда
		
		СтандартнаяОбработка = Истина;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", 	НачалоДня(Объект.ДатаНачала));
		ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  	КонецДня(Объект.ДатаОкончания));
		ПараметрыФормы.Вставить("Организация",              	Объект.Организация);
		ПараметрыФормы.Вставить("СчетДоверительногоУправления",	Объект.СчетДоверительногоУправления);
		ПараметрыФормы.Вставить("мВыбраннаяФорма",          	Объект.ВыбраннаяФорма);
		ПараметрыФормы.Вставить("мРедакцияФормы",				Объект.РедакцияФормы);
		ПараметрыФормы.Вставить("ПредставлениеВидаОтчета", 		Объект.НаименованиеОтчета);
		ПараметрыФормы.Вставить("мСкопированаФорма",        	мСкопированаФорма);
		ПараметрыФормы.Вставить("мСохраненныйДок", 				мСохраненныйДок);
		ПараметрыФормы.Вставить("ОтчетЗаПоследнийКвартал", 		Объект.ОтчетЗаПоследнийКвартал);
		ПараметрыФормы.Вставить("НестандартныйПериод", 			Объект.НестандартныйПериод);
		ПараметрыФормы.Вставить("ПереходНаМСФО9", 				Объект.ПереходНаМСФО9);
		
		ВыбраннаяФорма = Объект.ВыбраннаяФорма;
		
		СтартоваяФорма = "ОсновнаяФорма";
		ЭтоСтартоваяФорма = ВыбраннаяФорма = СтартоваяФорма;
		
		Если мСкопированаФорма <> Неопределено Тогда
			Если (ВладелецФормы.ИмяФормы = "Документ.РегламентированныйОтчет.Форма.ФормаСписка") Тогда
				ЭтоСтартоваяФорма = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			
			КлючУникальности = Объект.Ссылка;
			
			Если мСкопированаФорма = Неопределено Тогда
				
				ПараметрыФормы.Вставить("мСохраненныйДок", Объект.Ссылка);
				
				ИмяФормыОтчета = "Отчет." + Объект.ИсточникОтчета + ".Форма." + ВыбраннаяФорма;
				
				Если ЭтоСтартоваяФорма Тогда
					ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , ИмяФормыОтчета);
				Иначе
					ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , КлючУникальности);
				КонецЕсли;
				
			Иначе
				
				ИмяФормыОтчета = "Отчет." + Объект.ИсточникОтчета + ".Форма.ОсновнаяФорма";
				ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , ИмяФормыОтчета);
				ФормаОтчета.Организация = Объект.Организация;
				ФормаОтчета.СчетДоверительногоУправления = Объект.СчетДоверительногоУправления;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ИнформацияОбОшибке.Причина = Неопределено Тогда
				Сообщение.Текст = НСтр("ru='При открытии формы регламентированного отчета произошла ошибка.'");
			ИначеЕсли СтрНайти(ИнформацияОбОшибке.Причина.Описание, ".Форма.") > 0 Тогда
				Сообщение.Текст = НСтр("ru='Отчет не может быть открыт. Устаревшая редакция формы отчета не поддерживается текущей версией конфигурации.'");
			Иначе
				Сообщение.Текст = ИнформацияОбОшибке.Причина.Описание;
			КонецЕсли;
			
			Сообщение.Сообщить();
			Возврат;
			
		КонецПопытки;
		
		Если ЭтоСтартоваяФорма Тогда
			
			ФормаОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			
		КонецЕсли;
		
		ФормаОтчета.ЗакрыватьПриЗакрытииВладельца = Ложь;
		
		ИсторияРаботыПользователя.Добавить(ФормаОтчета.НавигационнаяСсылка);
		
		ФормаОтчета.Открыть();
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти