Процедура ОткрытьПрисоединенныеФайлы(ВладелецФайлов) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  ВладелецФайлов);
	
	ОткрытьФормуМодально("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы);

КонецПроцедуры
 
Процедура ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, Знач ИмяСобытия, Знач Параметр, Источник, ИмяСписка = "Список") Экспорт
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		
		ЭтотОбъект.Элементы[ИмяСписка].Обновить();
		
	КонецЕсли;
	
КонецПроцедуры