
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		ПараметрыФормы.Вставить("СчетДоверительногоУправления", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РасчетНДФЛ") Тогда 
		ПараметрыФормы.Вставить("СчетДоверительногоУправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "СчетДоверительногоУправления"));	
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПечатьСведенийОФизЛицеИЕгоИИС.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	
КонецПроцедуры
