&НаСервере
Процедура ЗаполнитьЗаписиПоРегистру(Регистр, Реквизитформы)

	НаборЗаписей = Регистр.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтаФорма.Регистратор);
	НаборЗаписей.Прочитать();

	ЗначениеВРеквизитФормы(НаборЗаписей, Реквизитформы);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЗаписи()

	ЗаполнитьЗаписиПоРегистру(РегистрыБухгалтерии.БухгалтерскийУчет, "ПроводкиБухгалтерскийУчет");
	ЗаполнитьЗаписиПоРегистру(РегистрыБухгалтерии.НалоговыйУчет, "ПроводкиНалоговыйУчет");
	ЗаполнитьЗаписиПоРегистру(РегистрыБухгалтерии.ЕдиныйБухгалтерскийУчет, "ПроводкиЕдиныйБухгалтерскийУчет");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтаФорма.Параметры.Свойство("Регистратор") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан регистратор!",,,, Отказ);
		
		Возврат;
	
	КонецЕсли;
	
	ЭтаФорма.Регистратор = ЭтаФорма.Параметры.Регистратор;
	
	ЗаполнитьЗаписи();
	
	Если БухгалтерскийУчет.ВедетсяУчетЕПС(ТекущаяДата(), ПараметрыСеанса.ТекущаяОрганизация, ЭтаФорма.Параметры.Регистратор.СчетДоверительногоУправления)  Тогда
	
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаУчетЕПС;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьЗаписи();
	
КонецПроцедуры
