#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОрганизацияПараметр.Видимость	= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.Организация.Видимость			= Не Элементы.ОрганизацияПараметр.Видимость;
	
	ЭтаФорма.Организация				= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Период.ДатаОкончания		= НачалоДня(ТекущаяДата()) - 1;
	ЭтаФорма.Период.ДатаНачала			= НачалоДня(ЭтаФорма.Период.ДатаОкончания);
	ЭтаФорма.ВремяПодтвержденияОперации	= '00010101180000';
	
	ЭтаФорма.ПроверкаОперацийСПодтверждениемДоИлиПослеОперации	= Истина;	
	ЭтаФорма.ПроверкаОперацийИзОтчетаБрокера					= Истина;
	
	// Теперь время будет генерироваться для разных дней свое 
	Элементы.НовоеВремяПодтвержденияОперацииСБрокером.Видимость = Ложь;
	
	Если ЭтаФорма.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		ЭтаФорма.НачалоСверкиСОтчетомБрокера				= '00010101161500';
		ЭтаФорма.КонецСверкиСОтчетомБрокера					= '00010101173000';
		ЭтаФорма.НовоеВремяПодтвержденияОперацииСБрокером	= '00010101170000';
	Иначе
		ЭтаФорма.НачалоСверкиСОтчетомБрокера				= '00010101154500';
		ЭтаФорма.КонецСверкиСОтчетомБрокера					= '00010101162000';
		ЭтаФорма.НовоеВремяПодтвержденияОперацииСБрокером	= '00010101160000';
	КонецЕсли;
	
	ДоступныеОснования = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьДоступныеОснования();	
	Элементы.ПодтверждаемыеОперацииОснование.СписокВыбора.ЗагрузитьЗначения(ДоступныеОснования);
	
	Если ЭтаФорма.Параметры.Свойство("ПараметрыЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры.ПараметрыЗаполнения);
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ОбновитьСписокПриОткрытии") И ЭтаФорма.Параметры.ОбновитьСписокПриОткрытии Тогда
		//ОбновитьСписокОперацийНаСервере();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.РежимОтбора = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДеятельности"); 
	КонецЕсли;
	
	Если Не (ЭтаФорма.ПроверкаОперацийСПодтверждениемДоИлиПослеОперации ИЛИ ЭтаФорма.ПроверкаОперацийИзОтчетаБрокера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Должна быть выбрана хотя бы одна проверка!", , "ПроверкаОперацийСПодтверждениемДоИлиПослеОперации", , Отказ);	
	КонецЕсли;
	
	Если ЭтаФорма.ПроверкаОперацийСПодтверждениемДоИлиПослеОперации Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяПодтвержденияОперации");
	КонецЕсли;
	
	Если ЭтаФорма.ПроверкаОперацийИзОтчетаБрокера Тогда
		ПроверяемыеРеквизиты.Добавить("НачалоСверкиСОтчетомБрокера");
		ПроверяемыеРеквизиты.Добавить("КонецСверкиСОтчетомБрокера");
		ПроверяемыеРеквизиты.Добавить("НовоеВремяПодтвержденияОперацииСБрокером");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВремяПодтвержденияОперацииПриИзменении(Элемент)
	Если ПодтверждаемыеОперации.Количество() > 0 Тогда
		Если Вопрос("Обновить время подтверждения выбранных операций?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если СтрокаОперации.Выбрано Тогда
			СтрокаОперации.Период						= НачалоДня(СтрокаОперации.Период) + (ЭтаФорма.ВремяПодтвержденияОперации - '00010101');
			СтрокаОперации.ПодтверждениеРаньшеОтмены	= (СтрокаОперации.Период <= СтрокаОперации.ОтменаПодтверждения);	
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПодтверждаемыеОперацииОперация" Тогда
		ОткрытьЗначение(Элементы.ПодтверждаемыеОперации.ТекущиеДанные["Операция"]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииДатаПодтвержденияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ПодтверждаемыеОперации.ТекущиеДанные;
	
	ВыделенныеСтроки = Элементы.ПодтверждаемыеОперации.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ИзменяемаяСтрока = ПодтверждаемыеОперации.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменяемаяСтрока.Период						= ТекущиеДанные.Период;
		ИзменяемаяСтрока.ПодтверждениеРаньшеОтмены	= (ТекущиеДанные.Период <= ТекущиеДанные.ОтменаПодтверждения);	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииОснованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПодтверждаемыеОперации.ТекущиеДанные;
	
	ВыделенныеСтроки = Элементы.ПодтверждаемыеОперации.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ИзменяемаяСтрока = ПодтверждаемыеОперации.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменяемаяСтрока.Основание				= ТекущиеДанные.Основание;
		ИзменяемаяСтрока.ОснованиеОпределено	= ЗначениеЗаполнено(ТекущиеДанные.Основание);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОперацийСПодтверждениемДоИлиПослеОперацииПриИзменении(Элемент)
	
	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОперацийИзОтчетаБрокераПриИзменении(Элемент)
	
	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьПодтверждения(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонеЦЕсли;
	
	Если ПодтверждаемыеОперации.Количество() > 0 И ЭтаФорма.Модифицированность Тогда
		Если Вопрос("При обновлении внесенные в список изменения будут потеряны. Продолжить?", РежимДиалогаВопрос.ОКОтмена) <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодтверждаемыеОперации.Очистить(); // чтобы на сервер уходил пустой список
	
	ОбновитьСписокОперацийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьВыбранныеПодтверждения(Команда)
	
	// Проверяем данные	
	
	НекорректныеЗаписи = ПодтверждаемыеОперации.НайтиСтроки(Новый Структура("Выбрано, ПодтверждениеРаньшеОтмены", Истина, Истина));
	Если НекорректныеЗаписи.Количество() > 0 Тогда
		Если Вопрос("Время отмены подтверждения нескольких записей позже времени подтверждения, такие записи будут пропущены." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Для Каждого СтрокаОперации Из НекорректныеЗаписи Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время отмены подтверждения позже времени подтверждения: " + Строка(СтрокаОперации.Операция), , "ПодтверждаемыеОперации[" + Формат(ПодтверждаемыеОперации.Индекс(СтрокаОперации), "ЧГ=") + "].ОтменаПодтверждения");	
			КонецЦикла;
			
			Возврат;	
		КонецЕсли;
	КонецЕсли;	
	
	ПодтвердитьОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	ЗаполнитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	ЗаполнитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= ЭтаФорма.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= ЭтаФорма.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		ЭтаФорма.Период.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		ЭтаФорма.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьРучнойРежим(Команда)
	
	ИзменитьРучнойРежим(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьРучнойРежим(Команда)
	
	ИзменитьРучнойРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсторияПодтверждения(Команда)
	
	ТекущиеДанные = Элементы.ПодтверждаемыеОперации.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Операция", ТекущиеДанные.Операция);		
		ОткрытьФорму("РегистрСведений.ПодтверждениеОперацийБэкОфиса.Форма.ФормаИсторияПодтвержденияОперации", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьСписокОперацийНаСервере()
	ПодтверждаемыеОперации.Очистить();

	// Пробегусь по журналу операций бэк-офиса и только по тем документам, для которых требуется подтверждение
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК ДеньОперации,
		|	КОНЕЦПЕРИОДА(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), ДЕНЬ) КАК КонецСледующегоРабочегоДня,
		|	ДОБАВИТЬКДАТЕ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &ВремяПодтвержденияОперации, СЕКУНДА) + (ДЕНЬГОДА(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата)) - 1) / 365 * 1100 - 550 + (ДЕНЬНЕДЕЛИ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата)) - 1) / 7 * 700 - 350) КАК НовоеВремяПодтвержденияОпераций,
		|	ДОБАВИТЬКДАТЕ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &НачалоСверкиСОтчетомБрокера, СЕКУНДА)) КАК НачалоСверкиСОтчетомБрокера,
		|	ДОБАВИТЬКДАТЕ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &КонецСверкиСОтчетомБрокера, СЕКУНДА)) КАК КонецСверкиСОтчетомБрокера,
		|	ДОБАВИТЬКДАТЕ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &НачалоСверкиСОтчетомБрокера, СЕКУНДА) + (ДЕНЬГОДА(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата)) - 1) / 365 * РАЗНОСТЬДАТ(&НачалоСверкиСОтчетомБрокера, &КонецСверкиСОтчетомБрокера, СЕКУНДА) / 2 + (ДЕНЬНЕДЕЛИ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата)) - 1) / 7 * РАЗНОСТЬДАТ(&НачалоСверкиСОтчетомБрокера, &КонецСверкиСОтчетомБрокера, СЕКУНДА) / 2) КАК НовоеВремяПодтвержденияОперацийСБрокером
		|ПОМЕСТИТЬ _ВремяКорректныхПодтверждений
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаряСледующиеДни
		|		ПО (ДанныеКалендаряСледующиеДни.Календарь = ДанныеКалендаря.Календарь)
		|			И (ДанныеКалендаряСледующиеДни.Дата > ДанныеКалендаря.Дата)
		|			И (ДанныеКалендаряСледующиеДни.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКалендаря.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует) КАК Действует
		|ПОМЕСТИТЬ _ДействиеЛицензии
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И &СчетДоверительногоУправления В (СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|				И Лицензия.ВидДеятельности = &ВидДеятельности) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Выбрано,
		|	ИСТИНА КАК ОснованиеОпределено,
		|	ПодтверждениеОперацийБэкОфиса.Организация КАК Организация,
		|	ПодтверждениеОперацийБэкОфиса.Операция КАК Операция,
		|	ПодтверждениеОперацийБэкОфиса.Основание КАК Основание,
		|	ПодтверждениеОперацийБэкОфиса.РучнойРежим КАК РучнойРежим,
		|	ПодтверждениеОперацийБэкОфиса.Примечание КАК Примечание,
		|	ПодтверждениеОперацийБэкОфиса.Операция.Дата КАК ВремяОперации,
		|	ПодтверждениеОперацийБэкОфиса.Период КАК ТекущаяДатаПодтверждения,
		|	ВЫБОР
		|		КОГДА &ПроверкаОперацийИзОтчетаБрокера
		|				И ПодтверждениеОперацийБэкОфиса.Основание = ""Отчет брокера""
		|				И (ПодтверждениеОперацийБэкОфиса.Операция ССЫЛКА Документ.НачислениеЗадолженности
		|					ИЛИ ПодтверждениеОперацийБэкОфиса.Операция ССЫЛКА Документ.Оплата
		|						И ВЫРАЗИТЬ(ПодтверждениеОперацийБэкОфиса.Операция КАК Документ.Оплата).ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия)))
		|			ТОГДА _ВремяКорректныхПодтверждений.НовоеВремяПодтвержденияОперацийСБрокером
		|		ИНАЧЕ _ВремяКорректныхПодтверждений.НовоеВремяПодтвержденияОпераций
		|	КОНЕЦ КАК Период
		|ПОМЕСТИТЬ _ПодтвержденныеОперации
		|ИЗ
		|	РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(, Организация = &Организация) КАК ПодтверждениеОперацийБэкОфиса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = ПодтверждениеОперацийБэкОфиса.Операция.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействиеЛицензии КАК _ДействиеЛицензии
		|		ПО СчетаДоверительногоУправления.Ссылка = _ДействиеЛицензии.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВремяКорректныхПодтверждений КАК _ВремяКорректныхПодтверждений
		|		ПО (_ВремяКорректныхПодтверждений.ДеньОперации = НАЧАЛОПЕРИОДА(ПодтверждениеОперацийБэкОфиса.Операция.Дата, ДЕНЬ))
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Организация = &Организация
		|	И ПодтверждениеОперацийБэкОфиса.Подтверждена = ИСТИНА
		|	И &СчетДоверительногоУправления В (СчетаДоверительногоУправления.Ссылка, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|	И (&ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.ПустаяСсылка)
		|			ИЛИ ЕСТЬNULL(_ДействиеЛицензии.Действует, ЛОЖЬ))
		|	И ПодтверждениеОперацийБэкОфиса.Операция.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (&ПроверкаОперацийСПодтверждениемДоИлиПосле
		|				И (НАЧАЛОПЕРИОДА(ПодтверждениеОперацийБэкОфиса.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(ПодтверждениеОперацийБэкОфиса.Операция.Дата, ДЕНЬ)
		|					ИЛИ ПодтверждениеОперацийБэкОфиса.Период > _ВремяКорректныхПодтверждений.КонецСледующегоРабочегоДня)
		|			ИЛИ &ПроверкаОперацийИзОтчетаБрокера
		|				И ПодтверждениеОперацийБэкОфиса.Основание = ""Отчет брокера""
		|				И (ПодтверждениеОперацийБэкОфиса.Операция ССЫЛКА Документ.НачислениеЗадолженности
		|					ИЛИ ПодтверждениеОперацийБэкОфиса.Операция ССЫЛКА Документ.Оплата
		|						И ВЫРАЗИТЬ(ПодтверждениеОперацийБэкОфиса.Операция КАК Документ.Оплата).ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия)))
		|				И НЕ(ПодтверждениеОперацийБэкОфиса.Период МЕЖДУ _ВремяКорректныхПодтверждений.НачалоСверкиСОтчетомБрокера И _ВремяКорректныхПодтверждений.КонецСверкиСОтчетомБрокера))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПодтвержденныеОперации.Выбрано КАК Выбрано,
		|	_ПодтвержденныеОперации.ОснованиеОпределено КАК ОснованиеОпределено,
		|	_ПодтвержденныеОперации.Организация КАК Организация,
		|	_ПодтвержденныеОперации.Операция КАК Операция,
		|	_ПодтвержденныеОперации.Основание КАК Основание,
		|	_ПодтвержденныеОперации.РучнойРежим КАК РучнойРежим,
		|	_ПодтвержденныеОперации.Примечание КАК Примечание,
		|	_ПодтвержденныеОперации.ВремяОперации КАК ВремяОперации,
		|	_ПодтвержденныеОперации.ТекущаяДатаПодтверждения КАК ТекущаяДатаПодтверждения,
		|	_ПодтвержденныеОперации.Период КАК Период,
		|	ПоследниеОтменыПодтверждения.Период КАК ОтменаПодтверждения,
		|	_ПодтвержденныеОперации.Период <= ПоследниеОтменыПодтверждения.Период КАК ПодтверждениеРаньшеОтмены
		|ИЗ
		|	_ПодтвержденныеОперации КАК _ПодтвержденныеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтменыПодтверждения.Операция КАК Операция,
		|			МАКСИМУМ(ОтменыПодтверждения.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.ПодтверждениеОперацийБэкОфиса КАК ОтменыПодтверждения
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПодтвержденныеОперации КАК _ПодтвержденныеОперации
		|				ПО (_ПодтвержденныеОперации.Операция = ОтменыПодтверждения.Операция)
		|					И (_ПодтвержденныеОперации.Организация = ОтменыПодтверждения.Организация)
		|		ГДЕ
		|			ОтменыПодтверждения.Подтверждена = ЛОЖЬ
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОтменыПодтверждения.Операция) КАК ПоследниеОтменыПодтверждения
		|		ПО (ПоследниеОтменыПодтверждения.Операция = _ПодтвержденныеОперации.Операция)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ПодтвержденныеОперации.ВремяОперации");
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",				?(ЭтаФорма.РежимОтбора = 1, ЭтаФорма.СчетДоверительногоУправления, Справочники.СчетаДоверительногоУправления.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ВидДеятельности",							?(ЭтаФорма.РежимОтбора = 2, ЭтаФорма.ВидДеятельности, Справочники.ВидыДеятельности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("НачалоПериода",								ЭтаФорма.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",								ЭтаФорма.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПроверкаОперацийСПодтверждениемДоИлиПосле",	ЭтаФорма.ПроверкаОперацийСПодтверждениемДоИлиПослеОперации);
	Запрос.УстановитьПараметр("ВремяПодтвержденияОперации",					ЭтаФорма.ВремяПодтвержденияОперации);
	Запрос.УстановитьПараметр("ПроверкаОперацийИзОтчетаБрокера",			ЭтаФорма.ПроверкаОперацийИзОтчетаБрокера);
	Запрос.УстановитьПараметр("НачалоСверкиСОтчетомБрокера",				ЭтаФорма.НачалоСверкиСОтчетомБрокера);
	Запрос.УстановитьПараметр("КонецСверкиСОтчетомБрокера",					ЭтаФорма.КонецСверкиСОтчетомБрокера);
	Запрос.УстановитьПараметр("НовоеВремяПодтвержденияОперацииСБрокером",	ЭтаФорма.НовоеВремяПодтвержденияОперацииСБрокером);
		
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ПодтверждаемыеОперации.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьОперацииНаСервере()
	ПодтверждениеОпераций = ПодтверждаемыеОперации.НайтиСтроки(Новый Структура("Выбрано, ОснованиеОпределено, ПодтверждениеРаньшеОтмены", Истина, Истина, Ложь));
	
	Если ПодтверждениеОпераций.Количество() > 0 Тогда
		Для Каждого ОписаниеПодтверждения Из ПодтверждениеОпераций Цикл			
			рсПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(рсПодтверждениеОперацийБэкОфиса, ОписаниеПодтверждения);
			рсПодтверждениеОперацийБэкОфиса.Период = ОписаниеПодтверждения.ТекущаяДатаПодтверждения;
			рсПодтверждениеОперацийБэкОфиса.Прочитать();
			
			Если Не рсПодтверждениеОперацийБэкОфиса.Выбран() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подтверждение операции """ + Строка(ОписаниеПодтверждения.Операция) + """ было изменено другим пользователем!");
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(рсПодтверждениеОперацийБэкОфиса, ОписаниеПодтверждения);
			
			Попытка
				рсПодтверждениеОперацийБэкОфиса.Записать(Истина);
			Исключение
				Сообщить("Ошибка подтверждения операции '" + Строка(ОписаниеПодтверждения.Операция) + "':" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
		
		ОбновитьСписокОперацийНаСервере();
	Иначе
		Сообщить("Нет отмеченных операций с заполненным основанием!");
	КонецЕсли;		
КонецПроцедуры

#Область Вспомогательные_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма)

	Элементы = ЭтаФорма.Элементы;		
	
	Элементы.СчетДоверительногоУправления.Видимость	= (ЭтаФорма.РежимОтбора = 1);
	Элементы.ВидДеятельности.Видимость				= (ЭтаФорма.РежимОтбора = 2);
	
	Элементы.ГруппаПараметрыПодтверждения.Доступность			= ЭтаФорма.ПроверкаОперацийСПодтверждениемДоИлиПослеОперации;
	Элементы.ГруппаПараметрыОперацийИзОтчетаБрокера.Доступность	= ЭтаФорма.ПроверкаОперацийИзОтчетаБрокера;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФлажки(Значение)
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если Элементы.ПодтверждаемыеОперации.ПроверитьСтроку(СтрокаОперации.ПолучитьИдентификатор()) Тогда 
			СтрокаОперации.Выбрано = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРучнойРежим(Значение)
	Если ПодтверждаемыеОперации.Количество() > 0 Тогда
		Если Вопрос("Обновить режим подтверждения выбранных операций?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если СтрокаОперации.Выбрано Тогда
			СтрокаОперации.РучнойРежим = Значение;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти