
&НаКлиенте
Процедура НайтиСлучаи(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("НайтиСлучаи");
	Попытка
		НайтиНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Обработать");
	Попытка
		ОбработатьНаСервере();
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура Пометить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Пометить");
	Попытка
		ВыполнитьПометку(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПометку(ПараметрыСессии)
	Для каждого СтрокаДокументы Из ЭтаФорма.Регистрации Цикл
		СтрокаДокументы.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("СнятьПометку");
	Попытка
		ВыполнитьСнятиеПометки(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСнятиеПометки(ПараметрыСессии)
	Для каждого СтрокаДокументы Из ЭтаФорма.Регистрации Цикл
		СтрокаДокументы.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = НачалоДня(ТекущаяДата());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НайтиНаСервере()

	Результат = РеквизитФормыВЗначение("Объект").НайтиСлучаиОферт(ЭтаФорма.Организация, ЭтаФорма.Период);
	
	ЭтаФорма.Регистрации.Загрузить(Результат.Регистрации);
	ЭтаФорма.Партии.Загрузить(Результат.Партии);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	
	Для каждого СтрокаРегистрации Из ЭтаФорма.Регистрации Цикл
		Если НЕ СтрокаРегистрации.Пометка ИЛИ СтрокаРегистрации.Соответствует Тогда
			Продолжить;
		КонецЕсли;
		РеквизитФормыВЗначение("Объект").СформироватьОбновитьДокументСведений(ЭтаФорма.Организация, ЭтаФорма.Период, СтрокаРегистрации.Облигация, СтрокаРегистрации.Клиент, СтрокаРегистрации.ДокументСведений, ЭтаФорма.Партии);
	КонецЦикла;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
