&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	
	Для Каждого СтрокаОрганизации Из Объект.Организации Цикл
		НоваяСтрока = Организации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОрганизации);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименить(Команда)
	Объект.Организации.Очистить();
	Для Каждого СтрокаОрганизации Из Организации Цикл
		НоваяСтрока = Объект.Организации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОрганизации);
	КонецЦикла;
	
	Закрыть(Объект);
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	Закрыть();
КонецПроцедуры

#КонецОбласти