&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начальное заполнение формы
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Валюта = Организация.ВалютаУчета;
	ЭтаФорма.Дата = ТекущаяДата();
	
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ЭтаФорма.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеИСозданныеРаспоряженияНаСервере()

	ЗаполнитьСозданныеРаспоряженияНаСервере();
	
	ЗаполнитьПлановыеРаспоряженияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеРаспоряженияНаСервере()
	
	РаспоряженияМНОПлановые.ПолучитьЭлементы().Очистить();
	РаспоряженияМНОПлановыеНаСервере = РеквизитФормыВЗначение("РаспоряженияМНОПлановые");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Валюта", ЭтаФорма.Валюта);
	Запрос.УстановитьПараметр("ДатаВозврата", ЭтаФорма.ДатаВозврата);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ОрганизацияЮрЛицо", ЭтаФорма.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПериодКонец", Новый Граница(КонецДня(ЭтаФорма.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодНачало", Новый Граница(НачалоДня(ЭтаФорма.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодМНОНачало", Новый Граница(НачалоДня(ЭтаФорма.Дата), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Дата", ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("Процент", ЭтаФорма.Процент);
	Запрос.УстановитьПараметр("Срок", ЭтаФорма.Срок);
	Запрос.УстановитьПараметр("БезОтбораПоБанку", (Не ЗначениеЗаполнено(ЭтаФорма.Банк)));
	Запрос.УстановитьПараметр("Банк", ЭтаФорма.Банк);

#Область ТЕКСТ_ЗАПРОСА	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _РасчетныеСчета
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	НЕ &БезОтбораПоБанку
		|	И БанковскиеСчета.Банк = &Банк
		|	И БанковскиеСчета.Организация = &Организация
		|	И БанковскиеСчета.ЮрФизЛицо = &ОрганизацияЮрЛицо
		|	И БанковскиеСчета.Валюта = &Валюта
		|	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ БанковскиеСчета.ДатаЗакрытия > &Дата)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|ГДЕ
		|	НЕ &БезОтбораПоБанку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментовСрезПоследних.Действует КАК Действует,
		|	УсловияКредитныхИнструментовСрезПоследних.Период КАК Период,
		|	ВЫБОР
		|		КОГДА УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|		ИНАЧЕ УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств
		|	КОНЕЦ КАК МестоХранения
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладов
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&ПериодКонец, Организация = &Организация) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|				&ПериодКонец,
		|				Организация = &Организация
		|					И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПО (ДенежныеСредстваВКредитныхИнструментахОстатки.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
		|			И (ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|			И (ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток <> 0)
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Действует
		|	И НЕ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ПометкаУдаления
		|	И ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Валюта = &Валюта
		|	И (&БезОтбораПоБанку
		|			ИЛИ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияДепозитныхВкладов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияДепозитныхВкладов.МестоХранения КАК МестоХранения,
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент КАК Депозит,
		|	_УсловияДепозитныхВкладов.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент._НачальныйНоминал КАК Сумма
		|ПОМЕСТИТЬ _ЗакрытияДепозитныхВкладов
		|ИЗ
		|	_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.Период) КАК Период,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|		ИЗ
		|			_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ГДЕ
		|			_УсловияДепозитныхВкладов.Действует
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент) КАК ВложенныйЗапрос
		|		ПО _УсловияДепозитныхВкладов.КредитныйИнструмент = ВложенныйЗапрос.КредитныйИнструмент
		|			И _УсловияДепозитныхВкладов.Период = ВложенныйЗапрос.Период
		|			И _УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий = ВложенныйЗапрос.ДатаНачалаДействияУсловий
		|ГДЕ
		|	_УсловияДепозитныхВкладов.ДатаПогашения = &Дата";
#КонецОбласти
		
	Запрос.Выполнить();

	ВыборкаДепозитов = Запрос.МенеджерВременныхТаблиц.Таблицы["_ЗакрытияДепозитныхВкладов"].ПолучитьДанные().Выбрать();
	
	ТаблицаПроцентовПоДепозитам = Новый ТаблицаЗначений;
	
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("КредитныйИнструмент", Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Проценты", Новый ОписаниеТипов("Число"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка"));
	ТаблицаПроцентовПоДепозитам.Колонки.Добавить("ДатаДенежногоПотока", Новый ОписаниеТипов("Дата"));
	
	Пока ВыборкаДепозитов.Следующий() Цикл
		
		Попытка
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(РаботаСКредитнымиИнструментами.ПолучитьПроцентыКредитныхИнструментовПоСчетуДоверительногоУправления(ВыборкаДепозитов.СчетДоверительногоУправления, ВыборкаДепозитов.ДатаПогашения,,,,,ВыборкаДепозитов.Депозит), ТаблицаПроцентовПоДепозитам);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(ВыборкаДепозитов.ПериодичностьВыплатыПроцентов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить сумму процентов по депозиту [" + ВыборкаДепозитов.Депозит + "]. В условиях депозита не указана периодичность выплаты процентов.");
		КонецЕсли;
		
	КонецЦикла;        
	
	Запрос.УстановитьПараметр("ТаблицаПроцентовПоДепозитам", ТаблицаПроцентовПоДепозитам);
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПроцентовПоДепозитам.КредитныйИнструмент КАК Депозит,
		|	ТаблицаПроцентовПоДепозитам.Проценты КАК Проценты,
		|	ТаблицаПроцентовПоДепозитам.Операция КАК Операция,
		|	ТаблицаПроцентовПоДепозитам.ДатаДенежногоПотока КАК ДатаДенежногоПотока
		|ПОМЕСТИТЬ _ПроцентыПоДепозитнымВкладам
		|ИЗ
		|	&ТаблицаПроцентовПоДепозитам КАК ТаблицаПроцентовПоДепозитам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗакрытияДепозитныхВкладов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗакрытияДепозитныхВкладов.МестоХранения КАК МестоХранения,
		|	СУММА(_ЗакрытияДепозитныхВкладов.Сумма + ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0)) КАК Сумма
		|ПОМЕСТИТЬ _ОжидаемыеПоступленияПоДепозитам
		|ИЗ
		|	_ЗакрытияДепозитныхВкладов КАК _ЗакрытияДепозитныхВкладов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПроцентыПоДепозитнымВкладам.Депозит КАК Депозит,
		|			СУММА(_ПроцентыПоДепозитнымВкладам.Проценты) КАК Сумма
		|		ИЗ
		|			_ПроцентыПоДепозитнымВкладам КАК _ПроцентыПоДепозитнымВкладам
		|		ГДЕ
		|			_ПроцентыПоДепозитнымВкладам.ДатаДенежногоПотока = &Дата
		|			И ПОДСТРОКА(_ПроцентыПоДепозитнымВкладам.Операция, 1, 10) = ""Начисление""
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПроцентыПоДепозитнымВкладам.Депозит) КАК ВложенныйЗапрос
		|		ПО _ЗакрытияДепозитныхВкладов.Депозит = ВложенныйЗапрос.Депозит
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗакрытияДепозитныхВкладов.СчетДоверительногоУправления,
		|	_ЗакрытияДепозитныхВкладов.МестоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|			ТОГДА ЕСТЬNULL((ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Значение КАК СТРОКА(20))) + "" (счет клиринга)"", """")
		|		ИНАЧЕ ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет
		|	КОНЕЦ КАК МестоХранения,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток КАК НаНачалоДня,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток КАК НаКонецДня
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|			&ПериодНачало,
		|			&ПериодКонец,
		|			,
		|			,
		|			Организация = &Организация
		|				И Валюта = &Валюта
		|				И (&БезОтбораПоБанку
		|					ИЛИ РасчетныйСчет В
		|						(ВЫБРАТЬ
		|							_Т.Ссылка
		|						ИЗ
		|							_РасчетныеСчета КАК _Т))) КАК ОстаткиДенежныхСредствОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""НомерСчетаКлирингаВНКО_НКЦ"")
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваМНООстаткиИОбороты.РасчетныйСчет КАК РасчетныйСчет,
		|	ДенежныеСредстваМНООстаткиИОбороты.СуммаНачальныйОстаток КАК МНОНаНачало,
		|	ДенежныеСредстваМНООстаткиИОбороты.СуммаКонечныйОстаток КАК МНОНаКонец
		|ПОМЕСТИТЬ _ОстаткиВМНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.ОстаткиИОбороты(
		|			&ПериодМНОНачало,
		|			&ПериодКонец,
		|			,
		|			,
		|			Организация = &Организация
		|				И (&БезОтбораПоБанку
		|					ИЛИ РасчетныйСчет В
		|						(ВЫБРАТЬ
		|							_Т.Ссылка
		|						ИЗ
		|							_РасчетныеСчета КАК _Т))) КАК ДенежныеСредстваМНООстаткиИОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления,
		|	РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	Распоряжение.ВидОперации КАК ВидОперации,
		|	СУММА(Распоряжение.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _НеисполненныеРаспоряжения
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|ГДЕ
		|	НЕ Распоряжение.ПометкаУдаления
		|	И Распоряжение.Организация = &Организация
		|	И Распоряжение.Валюта = &Валюта
		|	И (Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|				И Распоряжение.ДатаВозврата > &Дата
		|				И НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ) <= &Дата
		|			ИЛИ Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|				И Распоряжение.ДатаРазмещения = &Дата)
		|	И (&БезОтбораПоБанку
		|			ИЛИ Распоряжение.РасчетныйСчет.Банк = &Банк)
		|	И НЕ Распоряжение.Ссылка В
		|				(ВЫБРАТЬ
		|					МНО.Основание КАК Основание
		|				ИЗ
		|					Документ.МНО КАК МНО
		|				ГДЕ
		|					МНО.ДатаВозврата > &Дата
		|					И НАЧАЛОПЕРИОДА(МНО.Дата, ДЕНЬ) <= &Дата
		|					И МНО.Проведен
		|					И МНО.Организация = &Организация
		|		
		|				ОБЪЕДИНИТЬ
		|		
		|				ВЫБРАТЬ
		|					РазмещениеКредитногоИнструмента.Основание КАК Основание
		|				ИЗ
		|					Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|				ГДЕ
		|					РазмещениеКредитногоИнструмента.Проведен
		|					И РазмещениеКредитногоИнструмента.Организация = &Организация
		|					И НАЧАЛОПЕРИОДА(РазмещениеКредитногоИнструмента.Дата, ДЕНЬ) = &Дата)
		|
		|СГРУППИРОВАТЬ ПО
		|	Распоряжение.СчетДоверительногоУправления,
		|	Распоряжение.РасчетныйСчет,
		|	Распоряжение.ВидОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриходПроцентовМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПриходПроцентовМНО.РасчетныйСчет КАК РасчетныйСчет,
		|	СУММА(ПриходПроцентовМНО.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _ОжидаемыеПриходыПроцентовМНО
		|ИЗ
		|	Документ.ПриходПроцентовМНО КАК ПриходПроцентовМНО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокМНО
		|		ПО (ДокМНО.Проведен)
		|			И (ДокМНО.Организация = &Организация)
		|			И (ДокМНО.ДатаВозврата = &Дата)
		|			И (ДокМНО.Ссылка = ПриходПроцентовМНО.МНО)
		|			И (ПриходПроцентовМНО.РасчетныйСчет.Валюта = &Валюта)
		|			И (&БезОтбораПоБанку
		|				ИЛИ ПриходПроцентовМНО.РасчетныйСчет.Банк = &Банк)
		|			И (НЕ(ПриходПроцентовМНО.ПометкаУдаления
		|					ИЛИ ПриходПроцентовМНО.Проведен))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходПроцентовМНО.СчетДоверительногоУправления,
		|	ПриходПроцентовМНО.РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоручение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДокПоручение.РасчетныйСчет КАК РасчетныйСчет,
		|	ДокПоручение.МестоХранения КАК МестоХранения,
		|	ДокПоручение.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	ДокПоручение.МестоХраненияПолучатель КАК МестоХраненияПолучатель,
		|	ДокПоручение.Сумма КАК Сумма,
		|	ДокПоручение.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ПорученияНаПереводы
		|ИЗ
		|	Документ.ПоручениеНаПереводДенежныхСредств КАК ДокПоручение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
		|		ПО ДокПоручение.Ссылка = СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ПО ДокПоручение.Ссылка = ПереводДенежныхСредств.Основание
		|			И (ПереводДенежныхСредств.Проведен)
		|ГДЕ
		|	ДокПоручение.Проведен
		|	И ДокПоручение.Организация = &Организация
		|	И ДокПоручение.Валюта = &Валюта
		|	И НАЧАЛОПЕРИОДА(ДокПоручение.Дата, ДЕНЬ) = &Дата
		|	И (ДокПоручение.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И ДокПоручение.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ИЛИ ДокПоручение.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И ДокПоручение.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|	И НЕ ЕСТЬNULL(СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) В (ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.Снято), ЗНАЧЕНИЕ(Перечисление.СтатусыПорученийНаПереводДенежныхСредств.ОшибкаПриЭкспорте))
		|	И ПереводДенежныхСредств.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.РасчетныйСчет КАК РасчетныйСчет,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|ПОМЕСТИТЬ _НеисполненыеПорученияНаПереводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПорученияНаПереводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ПорученияНаПереводы.РасчетныйСчет КАК РасчетныйСчет,
		|		-_ПорученияНаПереводы.Сумма КАК Сумма,
		|		_ПорученияНаПереводы.Валюта КАК Валюта
		|	ИЗ
		|		_ПорученияНаПереводы КАК _ПорученияНаПереводы
		|	ГДЕ
		|		_ПорученияНаПереводы.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ПорученияНаПереводы.СчетДоверительногоУправления,
		|		_ПорученияНаПереводы.РасчетныйСчетПолучатель,
		|		_ПорученияНаПереводы.Сумма,
		|		_ПорученияНаПереводы.Валюта
		|	ИЗ
		|		_ПорученияНаПереводы КАК _ПорученияНаПереводы
		|	ГДЕ
		|		_ПорученияНаПереводы.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.РасчетныйСчет,
		|	ВложенныйЗапрос.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.РасчетныйСчет КАК РасчетныйСчет,
		|	ВложенныйЗапрос.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	ВложенныйЗапрос.ПереводМеждуСчетамиДУ КАК ПереводМеждуСчетамиДУ,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности,
		|	ВложенныйЗапрос.ДатаИсполненияПо КАК ДатаИсполненияПо,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ЗадолженностьПоПоручениям
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ДокПоручение.Ссылка, ДокПоручениеПоОснованию.Ссылка) КАК Поручение,
		|		ЕСТЬNULL(ДокПоручение.РасчетныйСчет, ДокПоручениеПоОснованию.РасчетныйСчет) КАК РасчетныйСчет,
		|		ЕСТЬNULL(ДокПоручение.РасчетныйСчетПолучатель, ДокПоручениеПоОснованию.РасчетныйСчетПолучатель) КАК РасчетныйСчетПолучатель,
		|		ЕСТЬNULL(ДокПоручение.ПоручениеНаПереводМеждуСчетамиДУ, ДокПоручениеПоОснованию.ПоручениеНаПереводМеждуСчетамиДУ) КАК ПереводМеждуСчетамиДУ,
		|		ЕСТЬNULL(ДокПоручение.ДатаИсполненияПо, ДокПоручениеПоОснованию.ДатаИсполненияПо) КАК ДатаИсполненияПо,
		|		ЗадолженностиПоПоручениямОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ЗадолженностиПоПоручениямОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|		ЗадолженностиПоПоручениямОстатки.СуммаОстаток КАК Сумма,
		|		ЗадолженностиПоПоручениямОстатки.Валюта КАК Валюта
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
		|				&ПериодКонец,
		|				Организация = &Организация
		|					И Валюта = &Валюта) КАК ЗадолженностиПоПоручениямОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеНаДвижениеДенежныхСредств КАК ДокПоручение
		|			ПО ЗадолженностиПоПоручениямОстатки.Организация = ДокПоручение.Организация
		|				И ЗадолженностиПоПоручениямОстатки.Основание = ДокПоручение.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеНаДвижениеДенежныхСредств КАК ДокПоручениеПоОснованию
		|			ПО ЗадолженностиПоПоручениямОстатки.Организация = ДокПоручениеПоОснованию.Организация
		|				И ЗадолженностиПоПоручениямОстатки.Основание = ДокПоручениеПоОснованию.Основание) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|				&ПериодКонец,
		|				Организация = &Организация
		|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)) КАК АкцептованиеОперацийСрезПоследних
		|		ПО ВложенныйЗапрос.Поручение = АкцептованиеОперацийСрезПоследних.Операция
		|			И (ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская))
		|ГДЕ
		|	(ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И (&БезОтбораПоБанку
		|					ИЛИ ВложенныйЗапрос.РасчетныйСчетПолучатель.Банк = &Банк)
		|			ИЛИ ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И НЕ АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
		|				И НАЧАЛОПЕРИОДА(АкцептованиеОперацийСрезПоследних.Период, ДЕНЬ) = &Дата
		|				И (&БезОтбораПоБанку
		|					ИЛИ ВложенныйЗапрос.РасчетныйСчет.Банк = &Банк))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.РасчетныйСчет КАК РасчетныйСчет,
		|	ВложенныйЗапрос.Валюта КАК Валюта,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _НеисполненыеПорученияНаВводыВыводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЗадолженностьПоПоручениям.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ЗадолженностьПоПоручениям.РасчетныйСчет КАК РасчетныйСчет,
		|		-_ЗадолженностьПоПоручениям.Сумма КАК Сумма,
		|		_ЗадолженностьПоПоручениям.Валюта КАК Валюта
		|	ИЗ
		|		_ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениям
		|	ГДЕ
		|		_ЗадолженностьПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЗадолженностьПоПоручениям.СчетДоверительногоУправления,
		|		_ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель,
		|		_ЗадолженностьПоПоручениям.Сумма,
		|		_ЗадолженностьПоПоручениям.Валюта
		|	ИЗ
		|		_ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениям
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениямНаВывод
		|			ПО _ЗадолженностьПоПоручениям.РасчетныйСчет = _ЗадолженностьПоПоручениямНаВывод.РасчетныйСчет
		|				И _ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель = _ЗадолженностьПоПоручениямНаВывод.РасчетныйСчетПолучатель
		|				И _ЗадолженностьПоПоручениям.Сумма = _ЗадолженностьПоПоручениямНаВывод.Сумма
		|				И _ЗадолженностьПоПоручениям.Валюта = _ЗадолженностьПоПоручениямНаВывод.Валюта
		|				И _ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ = _ЗадолженностьПоПоручениямНаВывод.ПереводМеждуСчетамиДУ
		|				И (_ЗадолженностьПоПоручениямНаВывод.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|			ПО _ЗадолженностьПоПоручениям.РасчетныйСчет = ВыводДенежныхСредств.РасчетныйСчет
		|				И _ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель = ВыводДенежныхСредств.РасчетныйСчетКонтрагента
		|				И _ЗадолженностьПоПоручениям.Сумма = ВыводДенежныхСредств.Сумма
		|				И (_ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ)
		|				И (НАЧАЛОПЕРИОДА(ВыводДенежныхСредств.Дата, ДЕНЬ) = &Дата)
		|	ГДЕ
		|		_ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ
		|		И _ЗадолженностьПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		И (_ЗадолженностьПоПоручениям.ДатаИсполненияПо = &Дата
		|				ИЛИ НЕ(_ЗадолженностьПоПоручениямНаВывод.СчетДоверительногоУправления ЕСТЬ NULL
		|						И ВыводДенежныхСредств.СчетДоверительногоУправления ЕСТЬ NULL))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления,
		|		ВложенныйЗапрос.РасчетныйСчетПолучатель,
		|		ВложенныйЗапрос.Сумма,
		|		ВложенныйЗапрос.Валюта
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|			_ЗадолженностьПоПоручениям.Сумма КАК Сумма,
		|			_ЗадолженностьПоПоручениям.Валюта КАК Валюта
		|		ИЗ
		|			_ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениям
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоПоручениям КАК _ЗадолженностьПоПоручениямНаВвод
		|				ПО _ЗадолженностьПоПоручениям.РасчетныйСчет = _ЗадолженностьПоПоручениямНаВвод.РасчетныйСчет
		|					И _ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель = _ЗадолженностьПоПоручениямНаВвод.РасчетныйСчетПолучатель
		|					И _ЗадолженностьПоПоручениям.Сумма = _ЗадолженностьПоПоручениямНаВвод.Сумма
		|					И _ЗадолженностьПоПоручениям.Валюта = _ЗадолженностьПоПоручениямНаВвод.Валюта
		|					И _ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ = _ЗадолженностьПоПоручениямНаВвод.ПереводМеждуСчетамиДУ
		|					И (_ЗадолженностьПоПоручениямНаВвод.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская))
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|				ПО _ЗадолженностьПоПоручениям.РасчетныйСчет = ВводДенежныхСредств.РасчетныйСчетКонтрагента
		|					И _ЗадолженностьПоПоручениям.РасчетныйСчетПолучатель = ВводДенежныхСредств.РасчетныйСчет
		|					И _ЗадолженностьПоПоручениям.Сумма = ВводДенежныхСредств.Сумма
		|					И _ЗадолженностьПоПоручениям.Валюта = ВводДенежныхСредств.Валюта
		|					И (_ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ)
		|					И (НАЧАЛОПЕРИОДА(ВводДенежныхСредств.Дата, ДЕНЬ) = &Дата)
		|		ГДЕ
		|			_ЗадолженностьПоПоручениям.ПереводМеждуСчетамиДУ
		|			И _ЗадолженностьПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			И _ЗадолженностьПоПоручениямНаВвод.СчетДоверительногоУправления ЕСТЬ NULL
		|			И ВводДенежныхСредств.СчетДоверительногоУправления ЕСТЬ NULL) КАК ВложенныйЗапрос
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|			ПО ВложенныйЗапрос.РасчетныйСчетПолучатель = ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
		|				И (ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация)
		|				И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &Дата)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.РасчетныйСчет,
		|	ВложенныйЗапрос.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.МестоХранения КАК МестоХранения,
		|	ЕСТЬNULL(_ОстаткиДенежныхСредств.НаНачалоДня, 0) КАК РСНаНачало,
		|	ЕСТЬNULL(_ОстаткиДенежныхСредств.НаКонецДня, 0) КАК РСНаКонец,
		|	ЕСТЬNULL(_ОстаткиУБрокеров.НаНачалоДня, 0) КАК БСНаНачало,
		|	ЕСТЬNULL(_ОстаткиУБрокеров.НаКонецДня, 0) КАК БСНаКонец,
		|	ЕСТЬNULL(_ОстаткиВМНО.МНОНаНачало, 0) КАК МНОНаНачало,
		|	ЕСТЬNULL(_ОстаткиВМНО.МНОНаКонец, 0) + ЕСТЬNULL(_НеисполненныеРаспоряженияМНО.Сумма, 0) КАК МНОНаКонец,
		|	ЕСТЬNULL(_ОстаткиДенежныхСредств.НаНачалоДня, 0) - ЕСТЬNULL(_ОстаткиВМНО.МНОНаНачало, 0) КАК ДоступноНаНачало,
		|	ЕСТЬNULL(_ОстаткиДенежныхСредств.НаКонецДня, 0) + ЕСТЬNULL(_ОжидаемыеПриходыПроцентовМНО.Сумма, 0) + ЕСТЬNULL(_ОжидаемыеПоступленияПоДепозитам.Сумма, 0) + ЕСТЬNULL(_НеисполненыеПорученияНаПереводы.Сумма, 0) + ЕСТЬNULL(_НеисполненыеПорученияНаВводыВыводы.Сумма, 0) - ЕСТЬNULL(_ОстаткиВМНО.МНОНаКонец, 0) - ЕСТЬNULL(_НеисполненныеРаспоряженияМНО.Сумма, 0) - ЕСТЬNULL(_НеисполненныеРаспоряженияНаРазмещениеДепозитов.Сумма, 0) КАК ДоступноНаКонец
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ОстаткиДенежныхСредств.МестоХранения КАК МестоХранения
		|	ИЗ
		|		_ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредств
		|	ГДЕ
		|		_ОстаткиДенежныхСредств.МестоХранения <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_НеисполненныеРаспоряжения.СчетДоверительногоУправления,
		|		_НеисполненныеРаспоряжения.РасчетныйСчет
		|	ИЗ
		|		_НеисполненныеРаспоряжения КАК _НеисполненныеРаспоряжения
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ОстаткиВМНО.СчетДоверительногоУправления,
		|		_ОстаткиВМНО.РасчетныйСчет
		|	ИЗ
		|		_ОстаткиВМНО КАК _ОстаткиВМНО
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_НеисполненыеПорученияНаПереводы.СчетДоверительногоУправления,
		|		_НеисполненыеПорученияНаПереводы.РасчетныйСчет
		|	ИЗ
		|		_НеисполненыеПорученияНаПереводы КАК _НеисполненыеПорученияНаПереводы
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_НеисполненыеПорученияНаВводыВыводы.СчетДоверительногоУправления,
		|		_НеисполненыеПорученияНаВводыВыводы.РасчетныйСчет
		|	ИЗ
		|		_НеисполненыеПорученияНаВводыВыводы КАК _НеисполненыеПорученияНаВводыВыводы
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_ОжидаемыеПоступленияПоДепозитам.СчетДоверительногоУправления,
		|		_ОжидаемыеПоступленияПоДепозитам.МестоХранения
		|	ИЗ
		|		_ОжидаемыеПоступленияПоДепозитам КАК _ОжидаемыеПоступленияПоДепозитам) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредств
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиДенежныхСредств.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _ОстаткиДенежныхСредств.МестоХранения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			СУММА(_ОстаткиДенежныхСредств.НаНачалоДня) КАК НаНачалоДня,
		|			СУММА(_ОстаткиДенежныхСредств.НаКонецДня) КАК НаКонецДня
		|		ИЗ
		|			_ОстаткиДенежныхСредств КАК _ОстаткиДенежныхСредств
		|		ГДЕ
		|			_ОстаткиДенежныхСредств.МестоХранения = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ОстаткиДенежныхСредств.СчетДоверительногоУправления) КАК _ОстаткиУБрокеров
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиУБрокеров.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиВМНО КАК _ОстаткиВМНО
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиВМНО.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _ОстаткиВМНО.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НеисполненныеРаспоряжения КАК _НеисполненныеРаспоряженияМНО
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _НеисполненныеРаспоряженияМНО.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _НеисполненныеРаспоряженияМНО.РасчетныйСчет
		|			И (_НеисполненныеРаспоряженияМНО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НеисполненныеРаспоряжения КАК _НеисполненныеРаспоряженияНаРазмещениеДепозитов
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _НеисполненныеРаспоряженияНаРазмещениеДепозитов.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _НеисполненныеРаспоряженияНаРазмещениеДепозитов.РасчетныйСчет
		|			И (_НеисполненныеРаспоряженияНаРазмещениеДепозитов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОжидаемыеПриходыПроцентовМНО КАК _ОжидаемыеПриходыПроцентовМНО
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ОжидаемыеПриходыПроцентовМНО.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _ОжидаемыеПриходыПроцентовМНО.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НеисполненыеПорученияНаПереводы КАК _НеисполненыеПорученияНаПереводы
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _НеисполненыеПорученияНаПереводы.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _НеисполненыеПорученияНаПереводы.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НеисполненыеПорученияНаВводыВыводы КАК _НеисполненыеПорученияНаВводыВыводы
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _НеисполненыеПорученияНаВводыВыводы.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _НеисполненыеПорученияНаВводыВыводы.РасчетныйСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОжидаемыеПоступленияПоДепозитам КАК _ОжидаемыеПоступленияПоДепозитам
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ОжидаемыеПоступленияПоДепозитам.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.МестоХранения = _ОжидаемыеПоступленияПоДепозитам.МестоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер КАК ОсновнойБрокер
		|ПОМЕСТИТЬ _КодыУБрокера
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Т.СчетДоверительногоУправления
		|					ИЗ
		|						_ИтоговаяТаблица КАК _Т)) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Дата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Дата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КодыУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыУБрокера.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокера
		|ИЗ
		|	_КодыУБрокера КАК _КодыУБрокера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КодыУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			_КодыУБрокера КАК _КодыУБрокера
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КодыУБрокера.СчетДоверительногоУправления
		|		
		|		ИМЕЮЩИЕ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _КодыУБрокера.Код) = 1) КАК ВложенныйЗапрос
		|		ПО _КодыУБрокера.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_КодыУБрокера.СчетДоверительногоУправления,
		|	_КодыУБрокера.Код
		|ИЗ
		|	_КодыУБрокера КАК _КодыУБрокера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КодыУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			_КодыУБрокера КАК _КодыУБрокера
		|		ГДЕ
		|			_КодыУБрокера.ОсновнойБрокер
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КодыУБрокера.СчетДоверительногоУправления
		|		
		|		ИМЕЮЩИЕ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _КодыУБрокера.Код) = 1) КАК ВложенныйЗапрос
		|		ПО _КодыУБрокера.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И (_КодыУБрокера.ОсновнойБрокер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Флажок,
		|	0 КАК Сумма,
		|	&Процент КАК Процент,
		|	&Срок КАК Срок,
		|	&ДатаВозврата КАК ДатаВозврата,
		|	_ИтоговаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЕдиничныеКодыУБрокера.Код КАК Коды,
		|	_ИтоговаяТаблица.МестоХранения КАК РасчетныйСчет,
		|	_ИтоговаяТаблица.РСНаНачало КАК РСНаНачало,
		|	_ИтоговаяТаблица.РСНаКонец КАК РСНаКонец,
		|	_ИтоговаяТаблица.БСНаНачало КАК БСНаНачало,
		|	_ИтоговаяТаблица.БСНаКонец КАК БСНаКонец,
		|	_ИтоговаяТаблица.МНОНаНачало КАК СуммаМНОНаНачало,
		|	_ИтоговаяТаблица.МНОНаКонец КАК СуммаМНОНаКонец,
		|	_ИтоговаяТаблица.ДоступноНаНачало КАК ДоступноНаНачало,
		|	_ИтоговаяТаблица.ДоступноНаКонец КАК ДоступноНаКонец,
		|	ЕСТЬNULL(СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия, НЕОПРЕДЕЛЕНО) КАК Стратегия,
		|	ВЫБОР
		|		КОГДА СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ПериодНачало, ) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО _ИтоговаяТаблица.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|			И _ИтоговаяТаблица.СчетДоверительногоУправления.Организация = СтратегииИндивидуальногоИнвестированияСрезПоследних.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокера КАК _ЕдиничныеКодыУБрокера
		|		ПО _ИтоговаяТаблица.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокера.СчетДоверительногоУправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Наименование,
		|	_ИтоговаяТаблица.СчетДоверительногоУправления.Наименование
		|ИТОГИ ПО
		|	Стратегия,
		|	СчетДоверительногоУправления";
#КонецОбласти
		
	ВыборкаСтратегии = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтратегии.Следующий() Цикл
		
		Если ВыборкаСтратегии.Стратегия <> Неопределено Тогда
			РаспоряженияМНОПлановыеНаСервереСтрока0 = РаспоряженияМНОПлановыеНаСервере.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(РаспоряженияМНОПлановыеНаСервереСтрока0, ВыборкаСтратегии);
			РаспоряженияМНОПлановыеНаСервереСтрока0.МестоХраненияСтратегияСчетДУ = ВыборкаСтратегии.Стратегия;
			РаспоряженияМНОПлановыеНаСервереСтрока0.Коды = ВыборкаСтратегии.Стратегия.ОсновнойКодУБрокера;
		Иначе
			РаспоряженияМНОПлановыеНаСервереСтрока0 = РаспоряженияМНОПлановыеНаСервере;
		КонецЕсли;
		
		Выборка = ВыборкаСтратегии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			РаспоряженияМНОПлановыеНаСервереСтрока1 = РаспоряженияМНОПлановыеНаСервереСтрока0.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(РаспоряженияМНОПлановыеНаСервереСтрока1, Выборка);
			РаспоряженияМНОПлановыеНаСервереСтрока1.МестоХраненияСтратегияСчетДУ = Выборка.СчетДоверительногоУправления;
			
			ВыборкаРаспоряжения = Выборка.Выбрать();
			
			Пока ВыборкаРаспоряжения.Следующий() Цикл
				
				Если ВыборкаРаспоряжения.Количество() = 1 Тогда
					
					ЗаполнитьЗначенияСвойств(РаспоряженияМНОПлановыеНаСервереСтрока1, ВыборкаРаспоряжения);	
					
				Иначе
					
					Если РаспоряженияМНОПлановыеНаСервереСтрока1.Строки.Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(РаспоряженияМНОПлановыеНаСервереСтрока1, ВыборкаРаспоряжения, "Коды");	
					КонецЕсли;	
					
					РаспоряженияМНОПлановыеНаСервереСтрока2 = РаспоряженияМНОПлановыеНаСервереСтрока1.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(РаспоряженияМНОПлановыеНаСервереСтрока2, ВыборкаРаспоряжения,, "Коды");
							
					РаспоряженияМНОПлановыеНаСервереСтрока2.МестоХраненияСтратегияСчетДУ = ВыборкаРаспоряжения.РасчетныйСчет;
					РаспоряженияМНОПлановыеНаСервереСтрока2.СтрокаРС = Истина;
					
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РаспоряженияМНОПлановыеНаСервере, "РаспоряженияМНОПлановые");
	
	ОбновитьНадписьРаспоряженияМНОПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьРаспоряженияМНО(Команда)
	
	КлючиРазвернутыхСтрокРаспоряженияМНОПлановые = Неопределено;
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.РаспоряженияМНОПлановые, Элементы.РаспоряженияМНОПлановые, "МестоХраненияСтратегияСчетДУ", КлючиРазвернутыхСтрокРаспоряженияМНОПлановые);
	
	КлючТекущейСтрокиРаспоряженияМНОСозданные = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.РаспоряженияМНОСозданные, "Документ");
	КлючТекущейСтрокиМНОСозданные = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.МНОСозданные, "Документ");
	КлючТекущейСтрокиРаспоряженияМНОПлановые  = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.РаспоряженияМНОПлановые,  "МестоХраненияСтратегияСчетДУ");
	
	ПроверитьЗаполнение();
	
	ЗаполнитьПлановыеИСозданныеРаспоряженияНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.РаспоряженияМНОПлановые, Элементы.РаспоряженияМНОПлановые, "МестоХраненияСтратегияСчетДУ", КлючиРазвернутыхСтрокРаспоряженияМНОПлановые);
	
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.РаспоряженияМНОСозданные, Элементы.РаспоряженияМНОСозданные, "Документ", КлючТекущейСтрокиРаспоряженияМНОСозданные);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.МНОСозданные, Элементы.МНОСозданные, "Документ", КлючТекущейСтрокиМНОСозданные);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.РаспоряженияМНОПлановые, Элементы.РаспоряженияМНОПлановые, "МестоХраненияСтратегияСчетДУ", КлючТекущейСтрокиРаспоряженияМНОПлановые);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьРаспоряженияНаРазмещениеДепозитов(Команда)
	
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);

КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОПлановыеСнятьВсеФлажки(Команда)
	
	УстановитьЗначенияФлажков(Ложь);
	ОбновитьНадписьРаспоряженияМНОПлановыеИтого(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОПлановыеУстановитьВсеФлажки(Команда)
	
	УстановитьЗначенияФлажков(Истина);
	ОбновитьНадписьРаспоряженияМНОПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияФлажков(Значение, ЭлементыДерева = Неопределено)
	
	Если ЭлементыДерева = Неопределено Тогда
		ЭлементыДерева = ЭтаФорма.РаспоряженияМНОПлановые.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из ЭлементыДерева Цикл
		
		ДочерниеЭлементы = ТекЭлемент.ПолучитьЭлементы();
		
		Если ДочерниеЭлементы.Количество() = 0 Тогда
			ТекЭлемент.Флажок = Значение;
		Иначе
			УстановитьЗначенияФлажков(Значение, ДочерниеЭлементы);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
 
&НаКлиенте
Функция СоздатьПлановыеРаспоряженияМНО(ЕстьОшибки, ЭлементыДерева = Неопределено)
	
	Результат = Новый Массив;
	
	Если ЭлементыДерева = Неопределено Тогда
		ЭлементыДерева = ЭтаФорма.РаспоряженияМНОПлановые.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из ЭлементыДерева Цикл
		
		ДочерниеЭлементы = ТекЭлемент.ПолучитьЭлементы();
		
		Если ДочерниеЭлементы.Количество() = 0 Тогда
			
			Если ТекЭлемент.Флажок Тогда
				
				ПроверитьЗаполнениеСтроки(ТекЭлемент, ЕстьОшибки);
			    
				Распоряжение = Новый Структура;
				Распоряжение.Вставить("СчетДоверительногоУправления", ТекЭлемент.СчетДоверительногоУправления);
				Распоряжение.Вставить("РасчетныйСчет",                ТекЭлемент.РасчетныйСчет);
				Распоряжение.Вставить("Сумма",                        ТекЭлемент.Сумма);
				Распоряжение.Вставить("Валюта",                       ЭтаФорма.Валюта);
				Распоряжение.Вставить("Процент",                      ТекЭлемент.Процент);
				Распоряжение.Вставить("ДатаВозврата",                 ТекЭлемент.ДатаВозврата);
				Распоряжение.Вставить("ПодКупон",					  ТекЭлемент.ПодКупон);
				Распоряжение.Вставить("Организация",                  ЭтаФорма.Организация);
				Распоряжение.Вставить("ВидОперации",                  ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО"));
				Распоряжение.Вставить("Дата",                         ЭтаФорма.Дата);
				Распоряжение.Вставить("Коды",                         ТекЭлемент.Коды);
				
				Результат.Добавить(Распоряжение);
				
			КонецЕсли;
					
		Иначе
			РаботаСКоллекциями.ДополнитьМассив(Результат, СоздатьПлановыеРаспоряженияМНО(ЕстьОшибки, ДочерниеЭлементы));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаСоздатьРаспоряженияМНО(Команда)
	
	ЕстьОшибки = Ложь;
	
	ВыбПлановыеРаспоряжения = СоздатьПлановыеРаспоряженияМНО(ЕстьОшибки); 
	
	Если ЕстьОшибки Тогда
		Возврат;
	ИначеЕсли ВыбПлановыеРаспоряжения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны плановые распоряжения.");
		Возврат;
	КонецЕсли;
	
	СоздатьРаспоряжения(ВыбПлановыеРаспоряжения);
	
	КомандаОбновитьРаспоряженияМНО(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеСтроки(СтрокаПлановыеРаспоряжения, ЕстьОшибки)

	СтрокаРодитель = СтрокаПлановыеРаспоряжения.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда
		КодКлиента = СтрокаПлановыеРаспоряжения.Коды;
	Иначе
		КодКлиента = СтрокаРодитель.Коды;
	КонецЕсли; 
	
	Если СтрокаПлановыеРаспоряжения.Сумма = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Сумма МНО"" по клиенту с кодом: " + КодКлиента + "'"), ЭтотОбъект,,, ЕстьОшибки);
	КонецЕсли;
	
	Если СтрокаПлановыеРаспоряжения.Процент = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Процент"" по клиенту с кодом: " + КодКлиента + "'"), ЭтотОбъект,,, ЕстьОшибки);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПлановыеРаспоряжения.ДатаВозврата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Дата возврата"" по клиенту с кодом: " + КодКлиента + "'"), ЭтотОбъект,,, ЕстьОшибки);
	КонецЕсли;
	
	Если СтрокаПлановыеРаспоряжения.ДатаВозврата - Дата <= 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата возврата МНО меньше даты документа по клиенту с кодом: " + КодКлиента + "'"), ЭтотОбъект,,, ЕстьОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьРаспоряжения(ВыбПлановыеРаспоряжения)
					
	Обработки.Распоряжения.СоздатьРаспоряжения(ВыбПлановыеРаспоряжения);
	
КонецФункции

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ПриИзмененииРеквизитовШапки("Дата", ВыбранноеЗначение);
	
	ДатаВозврата = ВыбранноеЗначение + Срок * 24 * 3600;

КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ПриИзмененииРеквизитовШапки("Банк", ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовШапки(ИмяРеквизита, ВыбранноеЗначение)
	
	ТекущееЗначение = ЭтаФорма[ИмяРеквизита];

	Если Вопрос("Перезаполнить таблицы плановых и созданных распоряжений?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма[ИмяРеквизита] = ВыбранноеЗначение; 
		
		ДатаВозврата = ЭтаФорма.Дата + Срок * 24 * 3600;

		КомандаОбновитьРаспоряженияМНО(Неопределено);
		
	Иначе
		ВыбранноеЗначение = ТекущееЗначение;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроцентПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыПлановыхРазмещений(Новый Структура("Процент", Процент));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПлановыхРазмещений(ЗаполняемыеПоля, ЭлементыДерева = Неопределено)
	
	Если ЭлементыДерева = Неопределено Тогда
		ЭлементыДерева = ЭтаФорма.РаспоряженияМНОПлановые.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из ЭлементыДерева Цикл
		
		ДочерниеЭлементы = ТекЭлемент.ПолучитьЭлементы();
		
		Если ДочерниеЭлементы.Количество() = 0 Тогда
			
			Если ТекЭлемент.Флажок Тогда
				
				Для Каждого ЗаполняемоеПоле Из ЗаполняемыеПоля Цикл
					ТекЭлемент[ЗаполняемоеПоле.Ключ] = ЗаполняемоеПоле.Значение;
				КонецЦикла;
				
			КонецЕсли;
		Иначе
			ЗаполнитьРеквизитыПлановыхРазмещений(ЗаполняемыеПоля, ДочерниеЭлементы);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СрокПриИзменении(Элемент)
	
	ДатаВозврата = Дата + Срок * 24 * 3600;
	ЗаполнитьРеквизитыПлановыхРазмещений(Новый Структура("Срок, ДатаВозврата", Срок, ДатаВозврата));
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаПриИзменении(Элемент)
	
	Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ДатаВозврата, Дата);
	ЗаполнитьРеквизитыПлановыхРазмещений(Новый Структура("Срок, ДатаВозврата", Срок, ДатаВозврата));

КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОПлановыеРазвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.РазвернутьВсеЭлементыДерева(ЭтаФорма.РаспоряженияМНОПлановые, Элементы.РаспоряженияМНОПлановые);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОПлановыеСвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.СвернутьВсеЭлементыДерева(ЭтаФорма.РаспоряженияМНОПлановые, Элементы.РаспоряженияМНОПлановые);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОСозданныеПечать(Команда)
	
	МассивРаспоряжений = Новый Массив;
	
	Для Каждого СтрокаРаспоряжений Из РаспоряженияМНОСозданные Цикл
	
		МассивРаспоряжений.Добавить(СтрокаРаспоряжений.Документ);
		
	КонецЦикла;
	
	Если МассивРаспоряжений.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны распоряжения для печати.");
		
	Иначе
	
		ПараметрыФормы = Новый Структура("МассивРаспоряжений, Дата, Банк, Организация, ВидПечати", МассивРаспоряжений, ЭтаФорма.Дата, ЭтаФорма.Банк, ЭтаФорма.Организация, "ПечатьРаспоряженийМНО");
		
		ОткрытьФормуМодально("Обработка.Распоряжения.Форма.Печать",
			ПараметрыФормы,
			ЭтаФорма);
			
	КонецЕсли;
	
КонецПроцедуры
	
	&НаКлиенте
Процедура КомандаРаспоряженияНаРазмещениеДепозитовПечать(Команда)
	
	МассивРаспоряжений = ЭтаФорма.СписокОтмеченных.ВыгрузитьЗначения();
			
	Если МассивРаспоряжений.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны распоряжения для печати.");
		
	Иначе	
	
		ПараметрыФормы = Новый Структура("МассивРаспоряжений, Дата, Банк, Организация, ВидПечати", МассивРаспоряжений, ЭтаФорма.Дата, ЭтаФорма.Банк, ЭтаФорма.Организация, "ПечатьРаспоряженийНаРазмещениеДепозитов");
	
		ОткрытьФормуМодально("Обработка.Распоряжения.Форма.Печать",
			ПараметрыФормы,
			ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияМНОПлановыеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИменаРедактируемыхПолей = Новый Массив;
	ИменаРедактируемыхПолей.Добавить("РаспоряженияМНОПлановыеСумма");
	ИменаРедактируемыхПолей.Добавить("РаспоряженияМНОПлановыеПроцент");
	ИменаРедактируемыхПолей.Добавить("РаспоряженияМНОПлановыеСрок");
	ИменаРедактируемыхПолей.Добавить("РаспоряженияМНОПлановыеДатаВозврата");
	
	Если Поле.Имя = "РаспоряженияМНОПлановыеСчетДоверительногоУправления" Тогда
	
		ОткрытьЗначение(Элемент.ТекущиеДанные.СчетДоверительногоУправления);
		
	ИначеЕсли Не ИменаРедактируемыхПолей.Найти(Поле.Имя) = Неопределено и ЗначениеЗаполнено(Элементы.РаспоряженияМНОПлановые.ТекущиеДанные.РасчетныйСчет) Тогда
		
		Элементы.РаспоряженияМНОПлановые.ТекущиеДанные.Флажок = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуИКоличествоРаспоряжений(Количество, Сумма, ЭлементыДерева)
	
	Для Каждого ТекЭлемент Из ЭлементыДерева Цикл
		
		ДочерниеЭлементы = ТекЭлемент.ПолучитьЭлементы();
		
		Если ДочерниеЭлементы.Количество() = 0 Тогда
			
			Если ТекЭлемент.Флажок Тогда
				Количество	= Количество + 1;
				Сумма		= Сумма + ТекЭлемент.Сумма;
			КонецЕсли;
			
		Иначе
			РассчитатьСуммуИКоличествоРаспоряжений(Количество, Сумма, ДочерниеЭлементы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписьРаспоряженияМНОПлановыеИтого(Форма)
	
	ТекстНадписи = "";
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	РассчитатьСуммуИКоличествоРаспоряжений(ИтогоКоличество, ИтогоСумма, Форма.РаспоряженияМНОПлановые.ПолучитьЭлементы());
	
	ТекстНадписи = "Итого будет создано " + ИтогоКоличество + " " + РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(ИтогоКоличество, "распоряжение", "распоряжения", "распоряжений") + ", на сумму " + ИтогоСумма;
			
	Форма.Элементы.НадписьРаспоряженияМНОПлановыеИтого.Заголовок = ТекстНадписи;
	
КонецПроцедуры 

&НаКлиенте
Процедура РаспоряженияМНОПлановыеСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РаспоряженияМНОПлановые.ТекущиеДанные;
	Если ТекСтрока.Сумма = 0 Тогда
	
		ТекСтрока.Флажок = Ложь;
	
	КонецЕсли; 
	ОбновитьНадписьРаспоряженияМНОПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияМНОПлановыеФлажокПриИзменении(Элемент)
	
	ОбновитьНадписьРаспоряженияМНОПлановыеИтого(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	ЗаполнитьПлановыеИСозданныеРаспоряженияНаСервере();
	
	ТаблицыЗаполнены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияМНОПлановыеСрокПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РаспоряженияМНОПлановые.ТекущиеДанные;
	ТекСтрока.ДатаВозврата = Дата + ТекСтрока.Срок * 24 * 3600;
	
КонецПроцедуры

&НаКлиенте
Процедура МНОСозданныеПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.МНОСозданные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Документ, "Просмотр") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.Документ);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ТаблицыЗаполнены Тогда
	
		ЗаполнитьПлановыеИСозданныеРаспоряженияНаСервере();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияМНОПлановыеОтображатьНачальныеОстатки(Команда)
	
	ОтображатьНачальныеОстатки = НЕ Элементы.КомандаРаспоряженияМНОПлановыеОтображатьНачальныеОстатки.Пометка;
	Элементы.КомандаРаспоряженияМНОПлановыеОтображатьНачальныеОстатки.Пометка = ОтображатьНачальныеОстатки;
	Элементы.ГруппаНачальныеОстатки.Видимость = ОтображатьНачальныеОстатки;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРаспоряженияМНОИзExcel(Команда)
	
	ЗагрузитьРаспоряженияИзExcel(ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО"));
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьРаспоряженияНаРазмещениеДепозитовИзExcel(Команда)
	
	ЗагрузитьРаспоряженияИзExcel(ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента"));
	
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРаспоряженияИзExcel(ВидОперации)
	
	ПараметрыФормы = Новый Структура("Дата, Организация, Валюта, ВидОперации", ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.Валюта, ВидОперации);	
	РезультатЗагрузки = ОткрытьФормуМодально("Обработка.Распоряжения.Форма.ЗагрузкаИзExcel", ПараметрыФормы, ЭтаФорма);
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Для Каждого Сообщение Из РезультатЗагрузки.СообщенияПользователю Цикл
			Сообщение.Сообщить();
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.МНО") Тогда 
		КомандаОбновитьРаспоряженияМНО(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСозданныеРаспоряженияНаСервере()
	
	ПросроченныеРаспоряженияМНО.Очистить();
	РаспоряженияМНОСозданные.Очистить();
	МНОСозданные.Очистить();
	
	ПросроченныеРаспоряжения = РеквизитФормыВЗначение("Объект").ПолучитьПросроченныеРаспоряженияМНО(ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.Банк);
	
	ПросроченныеРаспоряженияМНО.Загрузить(ПросроченныеРаспоряжения);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.ПометкаУдаления КАК ПометкаУдаления,
		|	Документ.Дата КАК ДатаРаспоряжения,
		|	Документ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Документ.СчетДоверительногоУправления.КодСчета КАК СчетДоверительногоУправленияКодСчета,
		|	Документ.Сумма КАК Сумма,
		|	Документ.Валюта КАК Валюта,
		|	Документ.ДатаВозврата КАК ДатаВозврата,
		|	РАЗНОСТЬДАТ(&ТекущаяДата, Документ.ДатаВозврата, ДЕНЬ) КАК ДоПогашения,
		|	ВЫБОР
		|		КОГДА Документ.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДанныеКартинкиСтроки,
		|	ВЫБОР
		|		КОГДА Документ.Проведен
		|			ТОГДА 1
		|		КОГДА Документ.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеДокумента,
		|	Документ.Процент КАК Ставка,
		|	Документ.РасчетныйСчет КАК РасчетныйСчет,
		|	Документ.РасчетныйСчет.Банк КАК Банк
		|ПОМЕСТИТЬ _Распоряжения
		|ИЗ
		|	Документ.Распоряжение КАК Документ
		|ГДЕ
		|	Документ.ДатаВозврата > &ТекущаяДата
		|	И НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) <= &ТекущаяДата
		|	И Документ.Организация = &Организация
		|	И Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|	И (&Банк = ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
		|			ИЛИ Документ.РасчетныйСчет.Банк = &Банк)
		|	И Не Документ.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Документ.Сумма КАК Сумма,
		|	Документ.РасчетныйСчет.Банк КАК Банк,
		|	Документ.ДатаВозврата КАК ДатаВозврата,
		|	Документ.Основание КАК Основание,
		|	РАЗНОСТЬДАТ(&ТекущаяДата, Документ.ДатаВозврата, ДЕНЬ) КАК ДоПогашения,
		|	ВЫБОР
		|		КОГДА Документ.Проведен
		|			ТОГДА 1
		|		КОГДА Документ.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеДокумента,
		|	Документ.Дата КАК ДатаРазмещения,
		|	Документ.Процент КАК Ставка,
		|	СторнированиеМНО.Ссылка ЕСТЬ NULL КАК Действует
		|ПОМЕСТИТЬ _МНО
		|ИЗ
		|	Документ.МНО КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеМНО КАК СторнированиеМНО
		|		ПО (СторнированиеМНО.МНО = Документ.Ссылка)
		|ГДЕ
		|	Документ.ДатаВозврата > &ТекущаяДата
		|	И НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) <= &ТекущаяДата
		|	И Документ.Проведен
		|	И Документ.Организация = &Организация
		|	И (&Банк = ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
		|			ИЛИ Документ.РасчетныйСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_МНО.Ссылка КАК Документ,
		|	_МНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_МНО.Сумма КАК Сумма,
		|	_МНО.ДатаВозврата КАК ДатаВозврата,
		|	_МНО.ДоПогашения КАК ДоПогашения,
		|	_МНО.СостояниеДокумента КАК СостояниеДокумента,
		|	_МНО.СостояниеДокумента КАК ДанныеКартинкиСтроки,
		|	_МНО.СчетДоверительногоУправления.Наименование КАК СчетДоверительногоУправленияНаименование,
		|	_МНО.ДатаРазмещения КАК ДатаРазмещения,
		|	_МНО.Ставка КАК Ставка,
		|	_МНО.Банк КАК Банк,
		|	NULL КАК Истекло
		|ИЗ
		|	_МНО КАК _МНО
		|ГДЕ
		|	_МНО.Действует
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Распоряжения.Ссылка,
		|	_Распоряжения.СчетДоверительногоУправления,
		|	_Распоряжения.Сумма,
		|	_Распоряжения.ДатаВозврата,
		|	_Распоряжения.ДоПогашения,
		|	_Распоряжения.СостояниеДокумента,
		|	_Распоряжения.ДанныеКартинкиСтроки,
		|	_Распоряжения.СчетДоверительногоУправления.Наименование,
		|	NULL,
		|	_Распоряжения.Ставка,
		|	_Распоряжения.Банк,
		|	_Распоряжения.ДатаРаспоряжения < &ТекущаяДата 
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МНО КАК _МНО
		|		ПО _Распоряжения.Ссылка = _МНО.Основание
		|ГДЕ
		|	_МНО.Основание ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправленияНаименование";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Банк", ЭтаФорма.Банк);
	
	Выборка = Запрос.Выполнить().Выбрать();
				
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	                                           
	ИтогоКоличествоМНО = 0;
	ИтогоСуммаМНО = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.МНО") Тогда 
			НоваяСтрока = МНОСозданные.Добавить();
			Если НЕ Выборка.Документ.ПометкаУдаления Тогда
			
				ИтогоКоличествоМНО = ИтогоКоличествоМНО + 1;
				ИтогоСуммаМНО = ИтогоСуммаМНО + Выборка.Сумма;
			
			КонецЕсли;
		Иначе
			НоваяСтрока = РаспоряженияМНОСозданные.Добавить();
			Если НЕ Выборка.Документ.ПометкаУдаления Тогда
			
				ИтогоКоличество = ИтогоКоличество + 1;
				ИтогоСумма = ИтогоСумма + Выборка.Сумма;
			
			КонецЕсли;
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	ТекстНадписи = "Итого " + ИтогоКоличество + " " + РаботаСоСтрокамиКлиентСервер.ФормаМножественногоЧисла(ИтогоКоличество, "распоряжение", "распоряжения", "распоряжений") + ", на сумму " + ИтогоСумма;
		
	Элементы.НадписьРаспоряженияМНОСозданныеИтого.Заголовок = ТекстНадписи;
	
	ТекстНадписи = "Итого " + ИтогоКоличествоМНО + " МНО, на сумму " + ИтогоСуммаМНО;
			
	Элементы.НадписьМНОСозданныеИтого.Заголовок = ТекстНадписи;
	Элементы.ГруппаПросроченныеРаспоряженияМНО.Заголовок = "Просроченные (" + Формат(ПросроченныеРаспоряжения.Количество(), "ЧГ=0") + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыУстановитьСнятьПометкуУдаление(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда		
		
		РаботаСоСпискомДокументовКлиент.УстановитьСнятьПометкуУдаления(ДанныеВыбранныхДокументов);
		
		КомандаОбновитьРаспоряженияМНО(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбранныхДокументов()
	
	ДанныеВыбранныхДокументов = Новый Массив;
	
	ВыделенныеСтрокиСписка = Элементы.РаспоряженияМНОСозданные.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиСписка = Неопределено Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;
	
	Если ВыделенныеСтрокиСписка.Количество() = 0 Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;	
	
	Для каждого ВыделеннаяСтрокаСписка Из ВыделенныеСтрокиСписка Цикл
		
		ДанныеВыделеннойСтрокиСписка = Элементы.РаспоряженияМНОСозданные.ДанныеСтроки(ВыделеннаяСтрокаСписка);
		
		Состояние = Неопределено;
		
		Если      ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 0 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 1 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Проведен");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 2 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан");
		КонецЕсли;
		
		ДанныеВыбранныхДокументов.Добавить(
			Новый Структура("Документ, Состояние", ДанныеВыделеннойСтрокиСписка.Документ, Состояние));
		
	КонецЦикла;

	Возврат ДанныеВыбранныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура РаспоряженияМНОСозданныеПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.РаспоряженияМНОСозданные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Документ, "Просмотр") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияМНОПлановыеДатаВозвратаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РаспоряженияМНОПлановые.ТекущиеДанные;
	ТекСтрока.Срок = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(ТекСтрока.ДатаВозврата, Дата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БанкНачалоВыбораНаСервере(Период, Организация)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БанковскиеСчета.Банк КАК Банк
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&Период, Организация = &Организация) КАК ОстаткиДенежныхСредствОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО ОстаткиДенежныхСредствОстатки.РасчетныйСчет = БанковскиеСчета.Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

&НаКлиенте
Процедура БанкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(БанкНачалоВыбораНаСервере(ЭтаФорма.Дата, ЭтаФорма.Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьРаспоряжениеНаРазмещениеДепозита(Команда)
		
	ОткрытьФорму("Документ.Распоряжение.Форма.ФормаДокумента",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
	РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДатеПриИзменении(Элемент)
	
	ЗаполнитьСозданныеРаспоряженияНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РаспоряженияНаРазмещениеДепозитов.Обновить" Тогда
		РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаРазмещениеДепозитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РаспоряженияНаРазмещениеДепозитовФлаг" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элементы.РаспоряженияНаРазмещениеДепозитов.ТекущиеДанные <> Неопределено Тогда
			
			ЭлементСпискаОтмеченных = ЭтаФорма.СписокОтмеченных.НайтиПоЗначению(Элементы.РаспоряженияНаРазмещениеДепозитов.ТекущиеДанные.Ссылка);
			
			Если ЭлементСпискаОтмеченных = Неопределено Тогда
				
				ЭтаФорма.СписокОтмеченных.Добавить(Элементы.РаспоряженияНаРазмещениеДепозитов.ТекущиеДанные.Ссылка);

			Иначе
				
				ЭтаФорма.СписокОтмеченных.Удалить(ЭлементСпискаОтмеченных);
				
			КонецЕсли;
		
			РаспоряженияНаРазмещениеДепозитов.Параметры.УстановитьЗначениеПараметра("СписокОтмеченных", ЭтаФорма.СписокОтмеченных);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаРазмещениеДепозитовУстановитьФлажки(Команда)
	
	РаспоряженияНаРазмещениеДепозитовУстановитьЗначенияФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаРазмещениеДепозитовСнятьФлажки(Команда)
	
	РаспоряженияНаРазмещениеДепозитовУстановитьЗначенияФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаРазмещениеДепозитовУстановитьЗначенияФлажков(Значение)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачиПоДепозитамВПервойФорме(Команда)
	
	ОткрытьФормуМодально("Обработка.Распоряжения.Форма.СозданиеЗадачДляПервойФормы",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеРаспоряженияМНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПросроченныеРаспоряженияМНО.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Документ, "Просмотр") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.Документ);
	
КонецПроцедуры

