&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы      = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Элементы.КоэффициентРаспределения.Видимость = НЕ ДанныеОбъекта.ТолькоЗаписиКнигиПокупок;
	Элементы.ОснованияКРаспределению.Видимость = НЕ ДанныеОбъекта.ТолькоЗаписиКнигиПокупок;
	
КонецПроцедуры // НастроитьВидимостьИДоступность

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПризнакРаспределения(ТекущаяСтрока = Неопределено)
	
	Строки = Неопределено;
	Если ТекущаяСтрока <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(Объект.Основания.НайтиПоИдентификатору(ТекущаяСтрока));
	КонецЕсли;
	
	ИсходнаяТаблица		= Объект.Основания.Выгрузить(Строки);
	ВыгружаемыеКолонки	= РаботаСКоллекциями.ПолучитьПоляТаблицыДляЗапроса(ИсходнаяТаблица, "_ИсходнаяТаблица", "КРаспределению"); 	
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ
		|	_ИсходнаяТаблица
		|ИЗ
		|	&ИсходнаяТаблица КАК _ИсходнаяТаблица
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИсходнаяТаблица.*,
		|	ВЫБОР
		|		КОГДА _ИсходнаяТаблица.Основание ССЫЛКА Документ.АктПриемаПередачиОбъектовНедвижимости
		|			ТОГДА ЛОЖЬ
		|		КОГДА _ИсходнаяТаблица.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|			ТОГДА ВЫРАЗИТЬ(_ИсходнаяТаблица.Основание КАК Документ.НачислениеЗадолженности).НДСПоОбщимРасходам
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КРаспределению		
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|УПОРЯДОЧИТЬ ПО
		|	_ИсходнаяТаблица.НомерСтроки
		|;
		|");
	Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблица);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИсходнаяТаблица.*", ВыгружаемыеКолонки);	
	
	ДополненнаяТаблица = Запрос.Выполнить().Выгрузить();		
	Если Строки = Неопределено Тогда
		Объект.Основания.Загрузить(ДополненнаяТаблица);
	ИначеЕсли Строки.Количество() = ДополненнаяТаблица.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Строки[0], ДополненнаяТаблица[0]);   
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьПризнакРаспределения();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоЗаписиКнигиПокупокПриИзменении(Элемент)
	
	Если ЭтаФорма.Объект.ТолькоЗаписиКнигиПокупок Тогда
		ЭтаФорма.Объект.КоэффициентРаспределения = 0;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПризнакРаспределения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборОснований(Команда)
	
	// обязательные поля отбора
	ПараметрыПодбора = Новый Структура("МножественныйВыбор", Истина);
	
	// не обязательные поля отбора, передача которых определяется заполненными полями
	ПоляОтбораЗадолженности = "Организация, СчетДоверительногоУправления";
	ПоляОтбораЗадолженности = СтрЗаменить(ПоляОтбораЗадолженности, ", ", Символы.ПС);
	
	Для НомСтр = 1 По СтрЧислоСтрок(ПоляОтбораЗадолженности) Цикл
		ПолеОтбораЗадолженности = СтрПолучитьСтроку(ПоляОтбораЗадолженности, НомСтр);
		Если ЗначениеЗаполнено(Объект[ПолеОтбораЗадолженности]) Тогда
			ПараметрыПодбора.Вставить(ПолеОтбораЗадолженности, Объект[ПолеОтбораЗадолженности]);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("Период", РаботаСДокументами.ПолучитьМоментВремени(Объект.Ссылка));
	
	ПараметрыПодбора.Вставить("ВидЗадолженности", ПредопределенноеЗначение("Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям"));
	
	ПараметрыПодбора.Вставить("ТипЗадолженности", ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская"));
	
	//Если Не ЭтаФорма.ОплатаЧерезБрокера Или (ЭтаФорма.ОплатаЧерезБрокера И ЗначениеЗаполнено(Объект.Брокер)) Тогда
	//	ПараметрыПодбора.Вставить("Брокер", Объект.Брокер);
	//КонецЕсли;
	//
	//// Также при подборе учтем банковский счет
	//Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда 
	//	ПараметрыПодбора.Вставить("РасчетныйСчет", Объект.РасчетныйСчет);
	//КонецЕсли;
	//
	// собственно, подбор
	ХранилищеВыбЗадолженности = ОткрытьФормуМодально("ОбщаяФорма.ПодборЗадолженностиПоДенежнымСредствам", ПараметрыПодбора, ЭтаФорма);
	
	Если ТипЗнч(ХранилищеВыбЗадолженности) = Тип("ХранилищеЗначения") Тогда
		ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере(ХранилищеВыбЗадолженности, Истина);
		Модифицированность = Истина;
		ЗаполнитьПризнакРаспределения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере(ХранилищеВыбЗадолженности, ОбновитьРеквизитыШапки = Ложь)
	
	ОстаткиЗадолженности = ХранилищеВыбЗадолженности.Получить();
		
	//// при подборе, в ряде случаев, возможен неуникальный ключ тип + вид задолженности
	//ВариантыЗадолженности = ОстаткиЗадолженности.Скопировать(, "СчетДоверительногоУправления, ТипЗадолженности, ВидЗадолженности");
	//ВариантыЗадолженности.Свернуть("СчетДоверительногоУправления, ТипЗадолженности, ВидЗадолженности", "");
	//
	//Если ВариантыЗадолженности.Количество() > 1 Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	// заполним документ
	ОбъектНаСервере = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	
	Для НомСтр = 0 По ОстаткиЗадолженности.Количество() - 1 Цикл
		СтрокаОстаткиЗадолженности = ОстаткиЗадолженности[НомСтр];
		
		НоваяСтрокаОснования = Объект.Основания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОснования, СтрокаОстаткиЗадолженности);
		
		НоваяСтрокаОснования.СуммаНДС = СтрокаОстаткиЗадолженности.Сумма;
		
		ОбъектНаСервере.ЗаполнитьСчетНДСВСтрокеОснования(НоваяСтрокаОснования);
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьОснованияОстаткамиЗадолженностиНаСервере

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры
