
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Тестирование подключения к RU DATA",
		"0.01",
		"",
		Истина);
		
	// Команды
	
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция СоединениеРуДата(Сервер)
	
	Возврат Новый HTTPСоединение(Сервер, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
КонецФункции

Функция УчетнаяЗаписьJson(Логин, Пароль)
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	
	УчетнаяЗапись = Новый Структура;
	УчетнаяЗапись.Вставить("login", Логин);
	УчетнаяЗапись.Вставить("password", Пароль);
	
	ЗаписатьJSON(Запись, УчетнаяЗапись);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ЗапросТокена(Логин, Пароль)
	
	Запрос = ЗапросРудата();
	
	Запрос.АдресРесурса = "/v2/Account/Login";
	Запрос.УстановитьТелоИзСтроки(УчетнаяЗаписьJson(Логин, Пароль), КодировкаТекста.UTF8);
	
	Возврат Запрос;
	
КонецФункции

Процедура ПолучитьТокен(Сервер, Логин, Пароль) Экспорт
	
	Соединение = СоединениеРуДата(Сервер);
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросТокена(Логин, Пароль));
		Если Ответ.КодСостояния = 200 Тогда
			Результат = ОбъектИзОтвета(Ответ);
			Токен = Результат["token"];
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция СтрокаJson(Структура)
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	Настройки = Новый НастройкиСериализацииJSON;
	Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	ЗаписатьJSON(Запись, Структура, Настройки);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ЗапросРудата(Токен = Неопределено)
	
	Запрос = Новый HTTPЗапрос;
	
	Запрос.Заголовки.Вставить("Accept", "application/json");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Если Токен <> Неопределено Тогда
		Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросИстории(Токен, ПараметрыЗапроса)
	
	ПараметрыЗапросаJson = СтрокаJson(ПараметрыЗапроса);
	Запрос = ЗапросРудата(Токен);
	Запрос.АдресРесурса = "/v2/Moex/History";
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапросаJson, КодировкаТекста.UTF8);
	
	Возврат Запрос;
	
КонецФункции

Функция МассивЗначений(Значение) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Значение);
	Возврат Массив;
	
КонецФункции

Функция ОбъектИзОтвета(Ответ, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = "tradedate")
	
	МассивСвойствСоЗначениямиДата =
		?(ИменаСвойствСоЗначениямиДата = Неопределено,
			Неопределено,
			СтрРазделить(ИменаСвойствСоЗначениямиДата, ", ", Ложь));		
	
	Чтение = Новый ЧтениеJSON();
	
	Чтение.ОткрытьПоток(Ответ.ПолучитьТелоКакПоток());
	
	Возврат ПрочитатьJSON(Чтение, ПрочитатьВСоответствие, МассивСвойствСоЗначениямиДата, ФорматДатыJSON.ISO);
	
КонецФункции

Функция ТаблицаИсторииИзМассива(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("secid");
	Таблица.Колонки.Добавить("boardid");
	Таблица.Колонки.Добавить("isin");
	Таблица.Колонки.Добавить("shortname");
	Таблица.Колонки.Добавить("tradedate");
	Таблица.Колонки.Добавить("open");
	Таблица.Колонки.Добавить("high");
	Таблица.Колонки.Добавить("low");
	Таблица.Колонки.Добавить("close");
	
	Для каждого Элемент Из Массив Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.secid = Элемент["secid"];
		СтрокаТаблицы.boardid = Элемент["boardid"];
		СтрокаТаблицы.isin = Элемент["isin"];
		СтрокаТаблицы.shortname = Элемент["shortname"];
		СтрокаТаблицы.tradedate = Элемент["tradedate"];
		СтрокаТаблицы.open = Элемент["open"];
		СтрокаТаблицы.high = Элемент["high"];
		СтрокаТаблицы.low = Элемент["low"];
		СтрокаТаблицы.close = Элемент["close"];
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция История(Сервер, Параметры) Экспорт
	
	Соединение = СоединениеРуДата(Сервер);
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросИстории(Токен, Параметры));
		Если Ответ.КодСостояния = 200 Тогда
			Результат = ОбъектИзОтвета(Ответ);
			Сообщить("Ответ = " + Результат);
			Возврат ТаблицаИсторииИзМассива(Результат);
		Иначе
			Сообщить("Ошибка при запросе истории по инструменту. Код ответа = " + Ответ.КодСостояния);
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ТаблицаДанныхИнструментаИзМассива(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("fintoolId");
	
	Для каждого Элемент Из Массив Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.fintoolId = Элемент["fintoolId"];
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗапросДанныхИнструмента(Токен, ПараметрыЗапроса)
	
	ПараметрыЗапросаJson = СтрокаJson(ПараметрыЗапроса);
	Запрос = ЗапросРудата(Токен);
	Запрос.АдресРесурса = "/v2/Info/Instruments";
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапросаJson, КодировкаТекста.UTF8);
	
	Возврат Запрос;
	
КонецФункции

Функция ДанныеИнструмента(Сервер, Параметры) Экспорт
	
	Соединение = СоединениеРуДата(Сервер);
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросДанныхИнструмента(Токен, Параметры));
		Если Ответ.КодСостояния = 200 Тогда
			Результат = ОбъектИзОтвета(Ответ);
			//Сообщить("Ответ = " + Результат);
			Возврат ТаблицаДанныхИнструментаИзМассива(Результат);
		Иначе
			Сообщить("Ошибка при запросе данных по инструменту. Код ответа = " + Ответ.КодСостояния);
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ТаблицаНКДИзМассива(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("accruedInterest");
	
	Для каждого Элемент Из Массив Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.accruedInterest = Элемент["accruedInterest"];
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗапросНКД(Токен, ПараметрыЗапроса)
	
	ПараметрыЗапросаJson = СтрокаJson(ПараметрыЗапроса);
	Запрос = ЗапросРудата(Токен);
	Запрос.АдресРесурса = "/v2/AccruedInterest/AccruedInterestOnDate";
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапросаJson, КодировкаТекста.UTF8);
	
	Возврат Запрос;
	
КонецФункции

Функция ДанныеНКД(Сервер, Параметры) Экспорт
	
	Соединение = СоединениеРуДата(Сервер);
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросНКД(Токен, Параметры));
		Если Ответ.КодСостояния = 200 Тогда
			Результат = ОбъектИзОтвета(Ответ);
			//Сообщить("Ответ = " + Результат);
			Возврат ТаблицаНКДИзМассива(Результат);
		Иначе
			Сообщить("Ошибка при запросе НКД инструменту. Код ответа = " + Ответ.КодСостояния);
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Получить иерархию торговых площадок/источников, используемых Интерфакс
Функция ТорговыеПлощадки(Сервер) Экспорт
	
	РезультатФункции = Неопределено;
	
	ПрефиксОшибки = "Ошибка получения списка торговых площадок, используемых Интерфакс. ";
	
	Попытка
		
		Запрос = ЗапросРудата(Токен);
		
		Запрос.АдресРесурса = "/v2/Info/ExchangeTree";
		
		Соединение = СоединениеРуДата(Сервер);
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Результат = ОбъектИзОтвета(Ответ, Ложь, "update_date");

			РезультатФункции = ТаблицаЗначенийИзМассиваСтруктур(Результат);
			
		Иначе
			
			Сообщить(ПрефиксОшибки + "Код ответа = " + Ответ.КодСостояния);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ПрефиксОшибки + ОписаниеОшибки());
		
	КонецПопытки;
		
	Возврат РезультатФункции;
	
КонецФункции

// Получить данные по результатам торгов на заданную дату:
//
// Результат:
//
Функция ДанныеПоРезультатамТоргов(Сервер, ПараметрыЗапроса, ОписаниеРезультата = Неопределено) Экспорт 
	
	РезультатФункции = Неопределено;
	
	ПрефиксОшибки = "Ошибка получения данных по результатам торгов на заданную дату. ";
	
	Попытка
		
		Запрос = ЗапросРудата(Токен);
		
		Запрос.АдресРесурса = "/v2/Archive/EndOfDay";
		Запрос.УстановитьТелоИзСтроки(СтрокаJson(ПараметрыЗапроса), КодировкаТекста.UTF8);
		
		Соединение = СоединениеРуДата(Сервер);
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Результат = ОбъектИзОтвета(Ответ, Ложь, "time");

			РезультатФункции = ТаблицаЗначенийИзМассиваСтруктур(Результат);
			
		Иначе
			
			Сообщить(ПрефиксОшибки + "Код ответа = " + Ответ.КодСостояния);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ПрефиксОшибки + ОписаниеОшибки());
		
	КонецПопытки;
	
	// Формируем описание полей результата
	
	Если РезультатФункции <> Неопределено И ОписаниеРезультата <> Неопределено Тогда
		
		ОжидаемыеПоля = ПолучитьОписаниеРезультатаЗапросаДанныхПоРезультатамТоргов();
		
		Для Каждого Колонка Из РезультатФункции.Колонки Цикл
			
			ОписаниеПоля = ОжидаемыеПоля.НайтиПоЗначению(Колонка.Имя); 
			
			ОписаниеРезультата.Добавить(Колонка.Имя, ?(ОписаниеПоля = Неопределено, Неопределено, ОписаниеПоля.Представление));	
			
		КонецЦикла;	
			
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьОписаниеРезультатаЗапросаДанныхПоРезультатамТоргов()
	
	ОписаниеРезультата = Новый СписокЗначений;
	
	#Область Строка_описания	
	
	СтрокаОписания =
		"accruedint	number(decimal(20,8))		Накопленный купонный доход (= ставка купона * количество дней с момента начала очередного купонного периода)
		|admquote	number(decimal(16,8))		Признаваемая котировка, рассчитываемая в соответствии Положением о порядке и сроках определения стоимости чистых активов акционерных инвестиционных фондов, стоимости чистых активов паевых инвестиционных фондов, расчетной стоимости инвестиционных паев паевых инвестиционных фондов, а также стоимости чистых активов акционерных инвестиционных фондов в расчете на одну акцию (утв. приказом Федеральной службы по финансовым рынкам от 15 июня 2005 г. № 05-21/пз-н)
		|akm_bl_n	string		Рейтинг облигационного займа по национальной шкале - AK&M
		|akm_e_n	string		Кредитный рейтинг эмитента по национальной шкале - AK&M
		|ask	number(decimal(16,8))		Лучшая цена продажи в валюте торгов
		|ask_price_change	number(double)		Изменение цены продажи
		|ask_size	integer(int64)		Объем по лучшей цене продажи в штуках
		|ask_size_total	integer(int64)		Полный объем предложения
		|ask_yield_change	number(double)		Изменение доходности продажи
		|avge_chng	number(decimal(16,2))		Изменение средневзвешенной цены за текущий торговый день к средневзвешенной цене предыдущего торгового дня в пунктах (= средневзвешенная цена - цена закрытия предыдущего торгового дня)
		|avge_chng_pct	number(decimal(16,2))		Относительное изменение средневзвешенной цены к средневзвешенной предыдущего дня в % (= Средневзвешенная цена / Средневзвешенная цена на закрытие предыдущего торгового дня - 1)
		|avge_prce	number(decimal(16,8))		Средневзвешенная цена за текущий торговый день
		|avge_yield	number(decimal(16,8))		Доходность по средневзвешенной цене текущего торгового дня
		|bid	number(decimal(16,8))		Лучшая цена покупки в валюте торгов
		|bid_price_change	number(double)		Изменение цены покупки
		|bid_size	integer(int64)		Объем по лучшей цене покупки в штуках
		|bid_size_total	integer(int64)		Полный объем спроса
		|bid_yield_change	number(double)		Изменение доходности покупки
		|boardid	string		Код режима торгов
		|boardname	string		Режим торгов и/или Котировальный лист
		|buybackdate	string(date-time)		Дата обратного выкупа
		|buybackprice	number(decimal(16,8))		Дата обратного выкупа
		|cbr_lombard	number(decimal(16,8))		Ломбард
		|cbr_pledge	number(decimal(16,8))		Залог РЕПО
		|chng	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия предыдущего дня в пунктах (= цена последней сделки - цена закрытия предыдущего торгового дня)
		|chng_m	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия месяц назад в пунктах
		|chng_m_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия месяц назад в %
		|chng_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия предыдущего дня в % (= Цена последней сделки / Цена закрытия предыдущего торгового дня - 1)
		|chng_w	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия неделю назад в пунктах
		|chng_w_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия неделю назад в %
		|chng_y	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия год назад в пунктах
		|chng_y_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия год назад в %
		|close	number(decimal(16,8))		Цена закрытия предыдущего дня в валюте торгов
		|consensus_num_est	integer(int32)		Количество рекомендаций
		|consensus_time	string(date-time)		Дата последней оценки (подтверждение , изменение и т.д.)
		|convexity	number(decimal(16,8))		Выпуклость к погашению
		|convexity_agg	number(decimal(16,8))		Выпуклость сводная
		|convexity_o	number(decimal(16,8))		Выпуклость к оферте
		|cpn	number(decimal(16,8))		Размер ближайшего купона (облигации)
		|cpn_date	string(date-time)		Дата очередной купонной выплаты (облигации)
		|cpn_period	integer(int64)		Купонный период в днях
		|cpprice	number(decimal(16,8))		Цена периода закрытия в валюте торгов
		|currency	string		Валюта торгов
		|deal_acc	integer(int64)		Количество сделок за текущий торговый день
		|discount	number(decimal(16,8))		Дисконт
		|dnt06beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО до 6 дней
		|dnt06max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО до 6 дней
		|dnt06min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО до 6 дней
		|dnt120beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt120max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt120min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt14beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt14max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt14min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt200beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt200max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt200min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt365beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 201 до 365 дней
		|dnt365max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 201 до 365 дней
		|dnt365min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 201 до 365 дней
		|duration	integer(int64)		Дюрация по Маколею
		|duration_agg	integer(int64)		Сводная дюрация
		|duration_n	number(decimal(16,8))		Дюрация к погашению модифицированная
		|duration_o	integer(int64)		Дюрация к оферте
		|duration_on	number(decimal(16,8))		Дюрация к оферте модифицированная
		|exch	string		Краткое наименование торговой площадки
		|exp_bl_n	string		Рейтинг облигационного займа по национальной шкале - Эксперт РА
		|exp_e_n	string		Кредитный рейтинг эмитента по национальной шкале - Эксперт РА
		|facevalue	number(decimal(38,20))		Номинал
		|facevalue_currency	string		Валюта номинала
		|fact_frcst_chng	string		Абсолютное изменение между фактом и прогнозом
		|fch_b_i	string		Кредитный рейтинг облигации по международной шкале - Fitch
		|fch_b_n	string		Кредитный рейтинг облигации по национальной шкале - Fitch
		|fch_e_dlti	string		Долгосрочный рейтинг дефолта эмитента по международной шкале - Fitch
		|fch_e_lti	string		Долгосрочный кредитный рейтинг эмитента по международной шкале - Fitch
		|fintoolId	integer(int64)		Числовой идентификатор инструмента в базе Интерфакс
		|forecast	number(decimal(16,8))		Прогноз
		|frcst_chng	string		Абсолютное изменение прогноза
		|full_price_pct	number(decimal(20,8))		Полная цена, %
		|high	number(decimal(16,8))		Максимальная цена в валюте торгов за текущий торговый день
		|id_iss	integer(int64)		Числовой идентификатор торгового инструмента в БД Интерфакс
		|id_trade_site	integer(int32)		Идентификатор биржи
		|ifx_b_i	string		Сводный кредитный рейтинг облигации по международной шкале (построен по рекомендациям МинФина) - Интерфакс
		|ifx_b_n	string		Сводный кредитный рейтинг облигации по национальной шкале (построен по рекомендациям МинФина) - Интерфакс
		|ifx_e_i	string		Сводный долгосрочный кредитный рейтинг эмитента по международной шкале (построен по рекомендациям МинФина) - Интерфакс
		|ifx_e_n	string		Сводный долгосрочный кредитный рейтинг эмитента по национальной шкале (построен по рекомендациям МинФина) - Интерфакс
		|isin	string		Код инструмента ISIN
		|issuer	string		Эмитент
		|issuesize	integer(int64)		Объем выпуска в штуках
		|last	number(decimal(16,8))		Цена последней сделки в валюте торгов
		|last_time	string(date-time)		Время последней сделки (= ЧЧ.ММ.СС, если в ходе последних торогов, ДД.ММ.ГГ, если ранее)
		|last_yield	number(decimal(16,8))		Доходность к погашению по последней сделке в % годовых
		|last2avge	number(decimal(16,8))		Изменение последней цены к средневзвзвешенной на закрытие предыдущего торгового дня в пунктах
		|lastsettlecode	string		Код расчетов последней сделки
		|lclose	number(decimal(16,8))		Официальная текущая цена закрытия
		|lcp_chng	number(double)		Изменение текущей цены
		|lcp_chng_pct	number(double)		Изменение текущей цены, %
		|lcurrentprice	number(double)		Текущая цена
		|lnkcurrency	string		Сопряженная валюта
		|lotsize	integer(int64)		Лот в штуках
		|low	number(decimal(16,8))		Минимальная цена в валюте торгов за текущий торговый день
		|mat_date	string		Дата погашения (экспирации) типа String
		|mat_date_dt	string(date-time)		Дата погашения (экспирации) типа DateTime
		|mcap	number(decimal(20,2))		Капитализация (= Рыночная цена * количество бумаг в обращении)
		|mds_b_i	string		Кредитный рейтинг облигации по международной шкале - Moody’s
		|mds_b_n	string		Кредитный рейтинг облигации по национальной шкале - Moody’s-Interfax
		|mds_e_lti	string		Долгосрочный кредитный рейтинг эмитента по международной шкале - Moody’s
		|mds_e_ltn	string		Долгосрочный кредитный рейтинг эмитента по национальной шкале - Moody’s-Interfax
		|mprice	number(decimal(16,8))		Рыночная цена3 в валюте торгов, рассчитываемая в соответствии с с Приказом ФСФР от 09 ноября 2010 г. № 10-65/пз-н “Об утверждении Порядка определения рыночной цены ценных бумаг, расчетной цены ценных бумаг, а также предельной границы колебаний рыночной цены ценных бумаг в целях 23 главы Налогового кодекса Российской Федерации”
		|mprice2	number(decimal(16,8))		Рыночная цена2 в валюте торгов, рассчитываемая в соответствии с Порядком расчета рыночной стоимости активов и стоимости чистых активов, в которые инвестированы средства пенсионных накоплений (утв. приказом Федеральной службы по финансовым рынкам от 26 декабря 2006 г. № 06-155/пз-н) и Порядком расчета рыночной стоимости активов и стоимости чистых активов, в которые инвестированы накопления для жилищного обеспечения военнослужащих (утв. приказом Федеральной службы по финансовым рынкам от 15 декабря 2005 г. № 05-82/пз-н)
		|name	string		Краткое наименование инструмента на площадке
		|open	number(decimal(16,8))		Цена открытия (обычно = цена первой сделки) в валюте торгов
		|open_inst	integer(int64)		Количество открытых позиций
		|opprice	number(decimal(16,8))		Цена периода открытия в валюте торгов
		|period	string		Период в текстовом представлении
		|potential	number(decimal(38,8))		Относительное изменение Прогнозной к Рыночной цене
		|prevlclose	number(double)		Предыдущее официальное закрытие
		|prevmprice	number(decimal(16,8))		Предыдущая рыночная цена цена3 в валюте торгов
		|publication_date	string(date-time)		Дата публикации факта следующего периода
		|pvbp	number(decimal(38,8))		PVBP к погашению
		|pvbp_agg	number(decimal(38,8))		PVBP сводная
		|pvbp_o	number(decimal(38,8))		PVBP к оферте
		|rec_buy_pct	number(decimal(16,2))		Доля рекомендаций “Покупать”
		|rec_change	integer(int32)		Изменение рекомендации
		|rec_hold_pct	number(decimal(16,2))		Доля рекомендаций “Держать”
		|rec_sell_pct	number(decimal(16,2))		Доля рекомендаций “Продавать”
		|rec_val	number(decimal(8,1))		Оценка рекомендации в масштабе от -1 до 1
		|recommendation	string		Рекомендация по бумаге
		|rus_b_n	string		Кредитный рейтинг облигаций по национальной шкале - Рус-Рейтинг
		|rus_e_i	string		Кредитный рейтинг эмитента по международной шкале - Рус-Рейтинг
		|rus_e_n	string		Кредитный рейтинг эмитента по национальной шкале - Рус-Рейтинг
		|seccode	string		Торговый код инструмента на площадке
		|secname	string		Полное русское наименование
		|secname_e	string		Полное английское наименование
		|sector	string		Сектор
		|settlecode	string		Код расчетов (определяет временные параметры сделки)
		|shortname_eng	string		Краткое английское наименование
		|shortname_rus	string		Краткое русское наименование
		|snp_b_i	string		Кредитный рейтинг облигации по международной шкале - S&P
		|snp_b_n	string		Кредитный рейтинг облигации по национальной шкале - S&P
		|snp_e_lti	string		Долгосрочный кредитный рейтинг эмитента по международной шкале - S&P
		|snp_e_n	string		Кредитный рейтинг эмитента по национальной шкале - S&P
		|spread	number(decimal(16,8))		Спред
		|status	string		Торговый статус инструмента (торгуется ли он на площадке в текущий торговый день)
		|target_price	number(decimal(18,6))		Прогнозная цена
		|tick_acc	string		Количество изменений
		|time	string(date-time)		Время последнего события по инструменту (сделки или котировки)
		|total_return	number(decimal(20,8))		Накопленная стоимость
		|tp_chng	number(decimal(38,8))		Абсолютное изменение Прогнозной цены
		|tp_chng_m	number(decimal(38,8))		Абсолютное изменение Прогнозной цены за месяц
		|tp_chng_m_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за месяц
		|tp_chng_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены
		|tp_chng_q	number(decimal(38,8))		Относительное изменение Прогнозной цены
		|tp_chng_q_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за 3 месяца
		|tp_chng_time	string(date-time)		Дата последнего ненулевого изменения Прогнозной цены
		|tp_chng_y	number(decimal(38,8))		Абсолютное изменение Прогнозной цены за год
		|tp_chng_y_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за год
		|tp_deviation	number(decimal(18,6))		Стандартное отклонение по оценкам Прогнозной цены
		|tp_high	number(decimal(18,6))		Максимальная из оценок Прогнозной цены
		|tp_low	number(decimal(18,6))		Минимальная из оценок Прогнозной цены
		|tp_median	number(decimal(18,6))		Медианная оценка прогнозной цены
		|val	number(decimal(32,8))		Оборот последней сделки в валюте торгов (= цена последней сделки * объем последней сделки)
		|val_acc	number(decimal(26,2))		Дневной оборот в валюте торгов за текущий торговый день
		|val_acc_usd	number(decimal(38,8))		Суммарный оборот в долларах США
		|val_usd	number(decimal(38,8))		Оборот последней сделки в долларах США
		|vol	integer(int64)		Объём последней сделки в штуках
		|vol_acc	integer(int64)		Дневной объем в штуках за текущий торговый день
		|vol_lots	integer(int64)		Объем последней сделки в лотах
		|y2o_ask	number(decimal(16,8))		Доходность к оферте по предложению
		|y2o_bid	number(decimal(16,8))		Доходность к оферте по спросу
		|y2o_change	number(decimal(16,8))		Изменение доходности к оферте абс.
		|y2o_change_pct	number(decimal(16,3))		Изменение доходности к оферте отн.
		|y2o_last	number(decimal(16,8))		Доходность к оферте по цене последней сделки
		|y2o_prev	number(decimal(16,8))		Доходность к оферте по цене пред.дня
		|y2o_wap	number(decimal(16,8))		Доходность к оферте по средневзвешенной цене
		|yield_2	number(decimal(16,8))		Доходность к аукциону в % годовых
		|yield_agg	number(decimal(16,8))		Сводная доходность
		|yield_ask	number(decimal(16,8))		Доходность к погашению по предложению
		|yield_average_12m	number(decimal(16,8))		Средняя доходность за 12 месяцев
		|yield_average_1m	number(decimal(16,8))		Средняя доходность за 1 месяц
		|yield_average_2m	number(decimal(16,8))		Средняя доходность за 2 месяца
		|yield_average_2w	number(decimal(16,8))		Средняя доходность за 2 недели
		|yield_average_3m	number(decimal(16,8))		Средняя доходность за 3 месяца
		|yield_average_6m	number(decimal(16,8))		Средняя доходность за 6 месяцев
		|yield_average_o12m	number(decimal(16,8))		Средняя доходность к оферте за 12 месяцев
		|yield_average_o1m	number(decimal(16,8))		Средняя доходность к оферте за 1 месяц
		|yield_average_o2m	number(decimal(16,8))		Средняя доходность к оферте за 2 месяца
		|yield_average_o2w	number(decimal(16,8))		Средняя доходность к оферте за 2 недели
		|yield_average_o3m	number(decimal(16,8))		Средняя доходность к оферте за 3 месяца
		|yield_average_o6m	number(decimal(16,8))		Средняя доходность к оферте за 6 месяцев
		|yield_bid	number(decimal(16,8))		Доходность к погашению по спросу
		|yield_chng	number(decimal(16,8))		Изменение доходности последней сделки к доходности по закрытию предыдущих торгов
		|yield_cpprice	number(decimal(16,8))		Доходность к погашению по цене закрытия
		|yield_cwa	number(decimal(16,8))		Доходность текущая по средневзвешенной
		|yield_high	number(decimal(16,8))		Максимальная доходность
		|yield_low	number(decimal(16,8))		Минимальная доходность
		|yield_o_cwa	number(decimal(16,8))		Доходность к оферте текущая по средневзвешенной
		|yield_o_swa	number(decimal(16,8))		Доходность к оферте простая по средневзвешенной
		|yield_open	number(decimal(16,8))		Доходность первой сделки
		|yield_prev	number(decimal(16,8))		Доходность к погашению по цене пред. дня
		|yield_swa	number(decimal(16,8))		Доходность простая по средневзвешенной
		|zspread	number(decimal(20,8))		Z-спрэд";
	
	#КонецОбласти
	
	МассивСтрок = СтрРазделить(СтрокаОписания, Символы.ПС, Ложь);
	
	Для каждого СтрокаПоля Из МассивСтрок Цикл
		
		// ИмяПоля [Таб] ТипПоля [Таб] Описание
		
		Свойства = СтрРазделить(СтрокаПоля, Символы.Таб, Ложь);
		
		ОписаниеРезультата.Добавить(Свойства[0], Свойства[2]); 
		
	КонецЦикла;
	
	Возврат ОписаниеРезультата;
	
КонецФункции

// Итоги торгов по инструментам за период на различных площадках
Функция ДанныеПоИтогамТорговПоИнструментам(Сервер, ПараметрыЗапроса, ОписаниеРезультата = Неопределено) Экспорт
	
	РезультатФункции = Неопределено;
	
	ПрефиксОшибки = "Ошибка получения данных по итогам торгов по инструментам. ";
	
	Попытка
		
		Запрос = ЗапросРудата(Токен);
		
		Запрос.АдресРесурса = "/v2/Archive/EndOfDayOnExchanges";
		Запрос.УстановитьТелоИзСтроки(СтрокаJson(ПараметрыЗапроса), КодировкаТекста.UTF8);
		
		Соединение = СоединениеРуДата(Сервер);
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Результат = ОбъектИзОтвета(Ответ, Ложь, "time");

			РезультатФункции = ТаблицаЗначенийИзМассиваСтруктур(Результат);
			
		Иначе
			
			Сообщить(ПрефиксОшибки + "Код ответа = " + Ответ.КодСостояния);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ПрефиксОшибки + ОписаниеОшибки());
		
	КонецПопытки;
	
	// Формируем описание полей результата
	
	Если РезультатФункции <> Неопределено И ОписаниеРезультата <> Неопределено Тогда
		
		ОжидаемыеПоля = ПолучитьОписаниеРезультатаЗапросаДанныхПоИтогамТорговПоИнструментам();
		
		Для Каждого Колонка Из РезультатФункции.Колонки Цикл
			
			ОписаниеПоля = ОжидаемыеПоля.НайтиПоЗначению(Колонка.Имя); 
			
			ОписаниеРезультата.Добавить(Колонка.Имя, ?(ОписаниеПоля = Неопределено, Неопределено, ОписаниеПоля.Представление));	
			
		КонецЦикла;	
			
	КонецЕсли;
	
	Возврат РезультатФункции;	
	
КонецФункции

Функция ПолучитьОписаниеРезультатаЗапросаДанныхПоИтогамТорговПоИнструментам() Экспорт
	
	ОписаниеРезультата = Новый СписокЗначений;
	
	#Область Строка_описания	
	
	СтрокаОписания =
		"accruedint	number(decimal(20,8))		Накопленный купонный доход (= ставка купона * количество дней с момента начала очередного купонного периода)
		|admquote	number(decimal(16,8))		Признаваемая котировка, рассчитываемая в соответствии Положением о порядке и сроках определения стоимости чистых активов акционерных инвестиционных фондов, стоимости чистых активов паевых инвестиционных фондов, расчетной стоимости инвестиционных паев паевых инвестиционных фондов, а также стоимости чистых активов акционерных инвестиционных фондов в расчете на одну акцию (утв. приказом Федеральной службы по финансовым рынкам от 15 июня 2005 г. № 05-21/пз-н)
		|ask	number(decimal(16,8))		Лучшая цена продажи в валюте торгов
		|ask_price_change	number(double)		Изменение цены продажи
		|ask_size	integer(int64)		Объем по лучшей цене продажи в штуках
		|ask_size_total	integer(int64)		Полный объем предложения
		|ask_yield_change	number(double)		Изменение доходности продажи
		|avge_chng	number(decimal(16,2))		Изменение средневзвешенной цены за текущий торговый день к средневзвешенной цене предыдущего торгового дня в пунктах (= средневзвешенная цена - цена закрытия предыдущего торгового дня)
		|avge_chng_pct	number(decimal(16,2))		Относительное изменение средневзвешенной цены к средневзвешенной предыдущего дня в % (= Средневзвешенная цена / Средневзвешенная цена на закрытие предыдущего торгового дня - 1)
		|avge_prce	number(decimal(16,8))		Средневзвешенная цена за текущий торговый день
		|avge_yield	number(decimal(16,8))		Доходность по средневзвешенной цене текущего торгового дня
		|bid	number(decimal(16,8))		Лучшая цена покупки в валюте торгов
		|bid_price_change	number(double)		Изменение цены покупки
		|bid_size	integer(int64)		Объем по лучшей цене покупки в штуках
		|bid_size_total	integer(int64)		Полный объем спроса
		|bid_yield_change	number(double)		Изменение доходности покупки
		|boardid	string		Код режима торгов
		|boardname	string		Режим торгов и/или Котировальный лист
		|buybackdate	string(date-time)		Дата обратного выкупа
		|buybackprice	number(decimal(16,8))		Цена обратного выкупа
		|cbr_lombard	number(decimal(16,8))		Ломбард
		|cbr_pledge	number(decimal(16,8))		Залог РЕПО
		|chng	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия предыдущего дня в пунктах (= цена последней сделки - цена закрытия предыдущего торгового дня)
		|chng_m	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия месяц назад в пунктах
		|chng_m_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия месяц назад в %
		|chng_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия предыдущего дня в % (= Цена последней сделки / Цена закрытия предыдущего торгового дня - 1)
		|chng_w	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия неделю назад в пунктах
		|chng_w_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия неделю назад в %
		|chng_y	number(decimal(16,8))		Изменение цены последней сделки к цене закрытия год назад в пунктах
		|chng_y_pct	number(decimal(16,2))		Относительное изменение цены последней сделки к цене закрытия год назад в %
		|close	number(decimal(16,8))		Цена закрытия предыдущего дня в валюте торгов
		|comment	string		
		|consensus_num_est	integer(int32)		Количество рекомендаций
		|consensus_time	string(date-time)		Дата последней оценки (подтверждение , изменение и т.д.)
		|convexity	number(decimal(16,8))		Выпуклость к погашению
		|convexity_agg	number(decimal(16,8))		Выпуклость сводная
		|convexity_o	number(decimal(16,8))		Выпуклость к оферте
		|cpn	number(decimal(16,8))		Размер ближайшего купона (облигации)
		|cpn_date	string(date-time)		Дата очередной купонной выплаты (облигации)
		|cpn_period	integer(int64)		Купонный период в днях
		|cpprice	number(decimal(16,8))		Цена периода закрытия в валюте торгов
		|currency	string		Валюта торгов
		|deal_acc	integer(int64)		Количество сделок за текущий торговый день
		|discount	number(decimal(16,8))		Дисконт
		|dnt06beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО до 6 дней
		|dnt06max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО до 6 дней
		|dnt06min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО до 6 дней
		|dnt120beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt120max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt120min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 15 до 90 дней
		|dnt14beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt14max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt14min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 7 до 14 дней
		|dnt200beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt200max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt200min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 91 до 180 дней
		|dnt365beg	number(decimal(16,8))		Начальный дисконт для сроков РЕПО от 201 до 365 дней
		|dnt365max	number(decimal(16,8))		Максимальный дисконт для сроков РЕПО от 201 до 365 дней
		|dnt365min	number(decimal(16,8))		Минимальный дисконт для сроков РЕПО от 201 до 365 дней
		|duration	integer(int64)		Дюрация по Маколею
		|duration_agg	integer(int64)		Сводная дюрация
		|duration_n	number(decimal(16,8))		Дюрация к погашению модифицированная
		|duration_o	integer(int64)		Дюрация к оферте
		|duration_on	number(decimal(16,8))		Дюрация к оферте модифицированная
		|exch	string		Краткое наименование торговой площадки
		|facevalue	number(decimal(38,20))		Номинал
		|facevalue_currency	string		Валюта номинала
		|fact_frcst_chng	number(double)		Абсолютное изменение между фактом и прогнозом
		|fintoolId	integer(int64)		Числовой идентификатор инструмента в базе Интерфакс
		|forecast	number(decimal(16,8))		Прогноз
		|frcst_chng	number(double)		Абсолютное изменение прогноза
		|full_price_pct	number(decimal(20,8))		Полная цена, %
		|high	number(decimal(16,8))		Максимальная цена в валюте торгов за текущий торговый день
		|highbid	number(double)		
		|id	integer(int64)		Числовой идентификатор торгового инструмента в БД Интерфакс (iss_id)
		|id_trade_site	integer(int32)		Идентификатор биржи
		|isin	string		Код инструмента ISIN
		|issuer	string		Эмитент
		|issuesize	integer(int64)		Объем выпуска в штуках
		|last	number(decimal(16,8))		Цена последней сделки в валюте торгов
		|last_quote_time	string(date-time)		
		|last_time	string(date-time)		Время последней сделки (= ЧЧ.ММ.СС, если в ходе последних торогов, ДД.ММ.ГГ, если ранее)
		|last_trade_time	string(date-time)		
		|last_yield	number(decimal(16,8))		Доходность к погашению по последней сделке в % годовых
		|last2avge	number(decimal(16,8))		Изменение последней цены к средневзвзвешенной на закрытие предыдущего торгового дня в пунктах
		|lastsettlecode	string		Код расчетов последней сделки
		|lclose	number(decimal(16,8))		Официальная текущая цена закрытия
		|lcp_chng	number(double)		
		|lcp_chng_pct	number(double)		
		|lcurrentprice	number(double)		
		|lnkcurrency	string		Сопряженная валюта
		|lotsize	integer(int64)		Лот в штуках
		|low	number(decimal(16,8))		Минимальная цена в валюте торгов за текущий торговый день
		|lowoffer	number(double)		
		|mat_date	string(date-time)		Дата погашения (экспирации) типа String
		|mcap	number(decimal(20,2))		Капитализация (= Рыночная цена * количество бумаг в обращении)
		|mprice	number(decimal(16,8))		Рыночная цена3 в валюте торгов, рассчитываемая в соответствии с с Приказом ФСФР от 09 ноября 2010 г. № 10-65/пз-н “Об утверждении Порядка определения рыночной цены ценных бумаг, расчетной цены ценных бумаг, а также предельной границы колебаний рыночной цены ценных бумаг в целях 23 главы Налогового кодекса Российской Федерации”
		|mprice2	number(decimal(16,8))		Рыночная цена2 в валюте торгов, рассчитываемая в соответствии с Порядком расчета рыночной стоимости активов и стоимости чистых активов, в которые инвестированы средства пенсионных накоплений (утв. приказом Федеральной службы по финансовым рынкам от 26 декабря 2006 г. № 06-155/пз-н) и Порядком расчета рыночной стоимости активов и стоимости чистых активов, в которые инвестированы накопления для жилищного обеспечения военнослужащих (утв. приказом Федеральной службы по финансовым рынкам от 15 декабря 2005 г. № 05-82/пз-н)
		|name	string		Краткое наименование инструмента на площадке
		|open	number(decimal(16,8))		Цена открытия (обычно = цена первой сделки) в валюте торгов
		|open_inst	integer(int64)		Количество открытых позиций
		|opprice	number(decimal(16,8))		Цена периода открытия в валюте торгов
		|period	string		Период в текстовом представлении
		|potential	number(decimal(38,8))		Относительное изменение Прогнозной к Рыночной цене
		|prevlclose	number(double)		
		|prevmprice	number(decimal(16,8))		Предыдущая рыночная цена цена3 в валюте торгов
		|publication_date	string(date-time)		Дата публикации факта следующего периода
		|pvbp	number(decimal(38,8))		PVBP к погашению
		|pvbp_agg	number(decimal(38,8))		PVBP сводная
		|pvbp_o	number(decimal(38,8))		PVBP к оферте
		|rec_buy_pct	number(decimal(16,2))		Доля рекомендаций “Покупать”
		|rec_change	number(double)		Изменение рекомендации
		|rec_hold_pct	number(decimal(16,2))		Доля рекомендаций “Держать”
		|rec_sell_pct	number(decimal(16,2))		Доля рекомендаций “Продавать”
		|rec_val	number(decimal(8,1))		Оценка рекомендации в масштабе от -1 до 1
		|recommendation	string		Рекомендация по бумаге
		|seccode	string		Торговый код инструмента на площадке
		|secname	string		Полное русское наименование
		|secname_e	string		Полное английское наименование
		|sector	string		Сектор
		|settlecode	string		Код расчетов (определяет временные параметры сделки)
		|shortname_eng	string		Краткое английское наименование
		|shortname_rus	string		Краткое русское наименование
		|spread	number(decimal(16,8))		Спред
		|status	string		Торговый статус инструмента (торгуется ли он на площадке в текущий торговый день)
		|step	string		
		|target_price	number(decimal(18,6))		Прогнозная цена
		|time	string(date-time)		Время последнего события по инструменту (сделки или котировки)
		|total_return	number(decimal(20,8))		Накопленная стоимость
		|tp_chng	number(decimal(38,8))		Абсолютное изменение Прогнозной цены
		|tp_chng_m	number(decimal(38,8))		Абсолютное изменение Прогнозной цены за месяц
		|tp_chng_m_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за месяц
		|tp_chng_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены
		|tp_chng_q	number(decimal(38,8))		Относительное изменение Прогнозной цены
		|tp_chng_q_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за 3 месяца
		|tp_chng_time	string(date-time)		Дата последнего ненулевого изменения Прогнозной цены
		|tp_chng_y	number(decimal(38,8))		Абсолютное изменение Прогнозной цены за год
		|tp_chng_y_pct	number(decimal(38,8))		Относительное изменение Прогнозной цены за год
		|tp_deviation	number(decimal(18,6))		Стандартное отклонение по оценкам Прогнозной цены
		|tp_high	number(decimal(18,6))		Максимальная из оценок Прогнозной цены
		|tp_low	number(decimal(18,6))		Минимальная из оценок Прогнозной цены
		|tp_median	number(decimal(18,6))		Медианная оценка прогнозной цены
		|tradeSite	integer(int32)		Id торговой площадки
		|val	number(decimal(32,8))		Оборот последней сделки в валюте торгов (= цена последней сделки * объем последней сделки)
		|val_acc	number(decimal(26,2))		Дневной оборот в валюте торгов за текущий торговый день
		|val_acc_usd	number(decimal(38,8))		Суммарный оборот в долларах США
		|val_usd	number(decimal(38,8))		Оборот последней сделки в долларах США
		|vol	integer(int64)		Объём последней сделки в штуках
		|vol_acc	integer(int64)		Дневной объем в штуках за текущий торговый день
		|vol_currency	string		Валюта объема
		|vol_lots	integer(int64)		Объем последней сделки в лотах
		|y2o_ask	number(decimal(16,8))		Доходность к оферте по предложению
		|y2o_bid	number(decimal(16,8))		Доходность к оферте по спросу
		|y2o_change	number(decimal(16,8))		Изменение доходности к оферте абс.
		|y2o_change_pct	number(decimal(16,3))		Изменение доходности к оферте отн.
		|y2o_last	number(decimal(16,8))		Доходность к оферте по цене последней сделки
		|y2o_prev	number(decimal(16,8))		Доходность к оферте по цене пред.дня
		|y2o_wap	number(decimal(16,8))		Доходность к оферте по средневзвешенной цене
		|yield_2	number(decimal(16,8))		Доходность к аукциону в % годовых
		|yield_agg	number(decimal(16,8))		Сводная доходность
		|yield_ask	number(decimal(16,8))		Доходность к погашению по предложению
		|yield_average_12m	number(decimal(16,8))		Средняя доходность за 12 месяцев
		|yield_average_1m	number(decimal(16,8))		Средняя доходность за 1 месяц
		|yield_average_2m	number(decimal(16,8))		Средняя доходность за 2 месяца
		|yield_average_2w	number(decimal(16,8))		Средняя доходность за 2 недели
		|yield_average_3m	number(decimal(16,8))		Средняя доходность за 3 месяца
		|yield_average_6m	number(decimal(16,8))		Средняя доходность за 6 месяцев
		|yield_average_o12m	number(decimal(16,8))		Средняя доходность к оферте за 12 месяцев
		|yield_average_o1m	number(decimal(16,8))		Средняя доходность к оферте за 1 месяц
		|yield_average_o2m	number(decimal(16,8))		Средняя доходность к оферте за 2 месяца
		|yield_average_o2w	number(decimal(16,8))		Средняя доходность к оферте за 2 недели
		|yield_average_o3m	number(decimal(16,8))		Средняя доходность к оферте за 3 месяца
		|yield_average_o6m	number(decimal(16,8))		Средняя доходность к оферте за 6 месяцев
		|yield_bid	number(decimal(16,8))		Доходность к погашению по спросу
		|yield_chng	number(decimal(16,8))		Изменение доходности последней сделки к доходности по закрытию предыдущих торгов
		|yield_cpprice	number(decimal(16,8))		Доходность к погашению по цене закрытия
		|yield_cwa	number(decimal(16,8))		Доходность текущая по средневзвешенной
		|yield_high	number(decimal(16,8))		Максимальная доходность
		|yield_low	number(decimal(16,8))		Минимальная доходность
		|yield_o_cwa	number(decimal(16,8))		Доходность к оферте текущая по средневзвешенной
		|yield_o_swa	number(decimal(16,8))		Доходность к оферте простая по средневзвешенной
		|yield_open	number(decimal(16,8))		Доходность первой сделки
		|yield_prev	number(decimal(16,8))		Доходность к погашению по цене пред. дня
		|yield_swa	number(decimal(16,8))		Доходность простая по средневзвешенной
		|z_spread_ofz	number(decimal(20,8))		Z-спрэд к ОФЗ";
	
	#КонецОбласти
	
	МассивСтрок = СтрРазделить(СтрокаОписания, Символы.ПС, Ложь);
	
	Для каждого СтрокаПоля Из МассивСтрок Цикл
		
		// ИмяПоля [Таб] ТипПоля [Таб] Описание
		
		Свойства = СтрРазделить(СтрокаПоля, Символы.Таб, Ложь);
		
		Поле		= Свойства[0];
		Описание	= ?(Свойства.Количество() > 2, Свойства[2], ""); 
		
		ОписаниеРезультата.Добавить(Поле, Описание); 
		
	КонецЦикла;
	
	Возврат ОписаниеРезультата;
	
КонецФункции

// Получить данные о торгах за указанный период
Функция ДанныеОТоргах(Сервер, ПараметрыЗапроса, ОписаниеРезультата = Неопределено) Экспорт
	
	РезультатФункции = Неопределено;
	
	ПрефиксОшибки = "Ошибка получения данных о торгах. ";
	
	Попытка
		
		Запрос = ЗапросРудата(Токен);
		
		Запрос.АдресРесурса = "/v2/Archive/History";
		Запрос.УстановитьТелоИзСтроки(СтрокаJson(ПараметрыЗапроса), КодировкаТекста.UTF8);
		
		Соединение = СоединениеРуДата(Сервер);
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Результат = ОбъектИзОтвета(Ответ, Ложь);

			РезультатФункции = ТаблицаЗначенийИзМассиваСтруктур(Результат);
			
		Иначе
			
			Сообщить(ПрефиксОшибки + "Код ответа = " + Ответ.КодСостояния);
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ПрефиксОшибки + ОписаниеОшибки());
		
	КонецПопытки;
	
	// Формируем описание полей результата
	
	Если РезультатФункции <> Неопределено И ОписаниеРезультата <> Неопределено Тогда
		
		ОжидаемыеПоля = ПолучитьОписаниеРезультатаЗапросаДанныхПоРезультатамТоргов();
		
		Для Каждого Колонка Из РезультатФункции.Колонки Цикл
			
			ОписаниеПоля = ОжидаемыеПоля.НайтиПоЗначению(Колонка.Имя); 
			
			ОписаниеРезультата.Добавить(Колонка.Имя, ?(ОписаниеПоля = Неопределено, Неопределено, ОписаниеПоля.Представление));	
			
		КонецЦикла;	
			
	КонецЕсли;
	
	Возврат РезультатФункции;	
	
КонецФункции

Функция ТаблицаЗначенийИзМассиваСтруктур(Массив)
	
	Таблица = Новый ТаблицаЗначений;
	
	Если Массив.Количество() > 0 Тогда
		
		Структура = Массив[0]; 
	
		Для Каждого Элемент Из Структура Цикл
			Таблица.Колонки.Добавить(Элемент.Ключ);
		КонецЦикла; 
		
		Для Каждого Элемент Из Массив Цикл
			ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Элемент); 
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции
