
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьОтборыПоВедомымРегистрам(ЭтаФорма);
	
	ЭтаФорма.Элементы.УсловияРасчетныйСчетВозвратаДенежныхСредств.Видимость =
		РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(Объект.Организация, Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыЗалогаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать займ");
			Возврат;
		КонецЕсли;
		
		СписокВыбораВидаДоговора = Новый СписокЗначений;
		СписокВыбораВидаДоговора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Залога"));
		СписокВыбораВидаДоговора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Поручительства"));
		
		ВыбранныйЭлемент = СписокВыбораВидаДоговора.ВыбратьЭлемент("Выберите вид договора");
		
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ПараметрыЗалога = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, ВидДоговора",Объект.Ссылка, ВыбранныйЭлемент.Значение));
			ОткрытьФормуМодально("Справочник.Договоры.ФормаОбъекта",ПараметрыЗалога,, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать займ");
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидКредитногоИнструмента = ПредопределенноеЗначение("Перечисление.ВидыКредитныхИнструментов.Выданный") Тогда
		УчетныйАктив = ПредопределенноеЗначение("Справочник.УчетныеАктивыЕПС.ПолученныеЗаймы");
	Иначе
		УчетныйАктив = ПредопределенноеЗначение("Справочник.УчетныеАктивыЕПС.ПредоставленныеЗаймы");
	КонецЕсли;
	
	ПараметрыЗайма = Новый Структура("ЗначенияЗаполнения", Новый Структура("КредитныйИнструмент, УчетныйАктив",Объект.Ссылка, УчетныйАктив));
	ОткрытьФормуМодально("РегистрСведений.УсловияКредитныхИнструментов.ФормаЗаписи",ПараметрыЗайма,, ЭтаФорма);
	
	ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.УсловияЗайма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыПоВедомымРегистрам(Форма)

	Объект = Форма.Объект;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.ДоговорыЗалогаИПоручительства.Отбор, "Основание",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма.Условия.Отбор, "КредитныйИнструмент",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры


