&НаСервере
Функция СформироватьДокументыСЭД(Организация, СчетДоверительногоУправления, Период, КаталогФайлов, Ответственный) Экспорт
	
	Отказ = Ложь;
	
	КаталогФайлов = КаталогФайлов + ?(Прав(КаталогФайлов, 1) = "\", "", "\") + Формат(Период, "ДФ=dd.MM.yyyy");
	
	РаботаСФайламиКлиентСервер.ПроверитьСоздатьКаталог(КаталогФайлов, Отказ, Истина);
	
	Если Отказ Тогда	
		Возврат Ложь;
	КонецЕсли;
	
	НачислениеСписаниеРезервовСсылка = Документы.НачислениеСписаниеРезервов.ПолучитьСуществующийДокумент(Организация, СчетДоверительногоУправления, Период, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	
	Если НачислениеСписаниеРезервовСсылка = Неопределено Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить документ [Начисление списание резервов] на дату [" + Формат(Период, "ДФ=dd.MM.yyyy") + "] для формирования расшифровки расчета резервов. Счет ду [" + СчетДоверительногоУправления + "].");
		Возврат Ложь;	
	КонецЕсли;
	
	Попытка
		ОбработкаВыгрузки = Обработки.ПечатьИВыгрузка_СЧА_РСА.Создать();	
		МассивРасшифровок = ОбработкаВыгрузки.ПолучитьРасшифровкуРасчетаРезервов(РаботаСКоллекциями.ЗначениеВМассив(НачислениеСписаниеРезервовСсылка));
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формирования расшифровки расчета резервов. Документ [" + НачислениеСписаниеРезервовСсылка + "]. Счет ду [" + СчетДоверительногоУправления + "]." + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;	
	КонецПопытки;
		
	Если МассивРасшифровок = Неопределено Или МассивРасшифровок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать расшифровку расчета резервов табличной части документа [" + НачислениеСписаниеРезервовСсылка + "]. Счет ду [" + СчетДоверительногоУправления + "].");
		Возврат Ложь;	
	КонецЕсли;
		
	ПолноеИмяФайла = КаталогФайлов + "\" + РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(СтрЗаменить(Строка(МассивРасшифровок[0].СчетДоверительногоУправления), " ", "_") + "_" + Формат(Период, "ДФ=dd.MM.yyyy")) + ".xlsx";	
				
	Попытка	
		МассивРасшифровок[0].ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);						
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выгрузки расшифровки расчета резервов по счету ду [" + СчетДоверительногоУправления + "]." + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
			
	Возврат Истина;
			
КонецФункции
#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

