
#Область Работа_с_сообщениями_пользователю

// Выводит сообщения из переданного массива сообщений (вызывает метод Сообщить)
// 
// Параметры:
//  МассивСообщенийПользователю - Массив, ФиксированныйМассив - массив объектов СообщениеПользователю
// 
Процедура ВывестиСообщенияПользователю(МассивСообщенийПользователю) Экспорт
	
	Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

// Выводит сообщения из переданного массива сообщений (вызывает метод Сообщить) перед еще не выведенными сообщениями
// 
// Параметры:
//  МассивСообщенийПользователю - Массив, ФиксированныйМассив - массив объектов СообщениеПользователю
// 
Процедура ВосстановитьСообщенияПользователю(МассивСообщенийПользователю) Экспорт
	
	ТекущиеСообщения = ПолучитьСообщенияПользователю(Истина);
	
	ВывестиСообщенияПользователю(МассивСообщенийПользователю);	
	ВывестиСообщенияПользователю(ТекущиеСообщения);	
	
КонецПроцедуры

// Очищает буфер еще не выведенных сообщений пользователю и возвращает его в виде массива
// 
// Параметры:
//  МассивСообщенийПользователю - Массив		- массив объектов СообщениеПользователю, который будет дополнен текущим буфером сообщений 
//								- Неопределено	- если требуется, чтобы функция вернула текущий буфер сообщений
//
// Возвращаемое значение:
//	Неопределено - если заполнен параметр МассивСообщенийПользователю,
//	иначе Массив - массив объектов СообщениеПользователю
//
Функция ОчиститьБуферСообщенийПользователю(МассивСообщенийПользователю = Неопределено) Экспорт
	
	БуферСообщений = ПолучитьСообщенияПользователю(Истина);
	
	Если МассивСообщенийПользователю = Неопределено Тогда
		РезультатФункции = Новый Массив(БуферСообщений);
	Иначе
		РаботаСКоллекциями.ДополнитьМассив(МассивСообщенийПользователю, БуферСообщений);
		РезультатФункции = Неопределено;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

// Возвращает строку сообщений пользователю, разделенных переданным разделителем
// 
// Параметры:
//  Разделитель			- Строка				- разделитель сообщений
//  УдалятьПолученные	- Булево				- признак необходимости удаления полученных сообщений из списка сообщений пользователю
//  ПолученныеСообщения	- ФиксированныйМассив	- выходной параметр, заполняется массивом объектов СообщениеПользователю, из которых сформирована возвращаемая строка сообщений
// 
// Возвращаемое значение:
//	ТекстСообщений - Строка - строка сообщений
//
Функция ПолучитьТекстСообщенийПользователю(Разделитель = Неопределено, УдалятьПолученные = Истина, ПолученныеСообщения = Неопределено) Экспорт
	
	Если Разделитель = Неопределено Тогда
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	ТекстыСообщений		= Новый Массив;
	ПолученныеСообщения	= ПолучитьСообщенияПользователю(УдалятьПолученные);
	
	Для Каждого Сообщение Из ПолученныеСообщения Цикл
		ТекстыСообщений.Добавить(Сообщение.Текст);
	КонецЦикла;
	
	Возврат СтрСоединить(ТекстыСообщений, Разделитель);
	
КонецФункции

#КонецОбласти

#Область Обработка_исключений

// Дополняет исключение подробным описанием ошибки и текстом сообщений пользователю и выводит его в ЖР или массив
// 
// Параметры:
//  ОписаниеИсключения	- Строка				- категория исключения (имя события в ЖР, если параметр Исключения не указан)
//  ИнформацияОбОшибке	- ИнформацияОбОшибке	- структурированная информация об ошибке (исключении)
//  КлючДанных			- ЛюбаяСсылка			- Данные, с которыми связано событие
//  Отказ				- Булево				- Выходной параметр. Всегда устанавливается в значение Истина
//  Исключения			- Массив				- Исключение будет помещено в этот массив
//  					- Неопределено			- Исключение будет записано в журнал регистрации
//
Процедура ОбработатьИсключение(ОписаниеИсключения, ИнформацияОбОшибке, КлючДанных, Отказ, Исключения = Неопределено) Экспорт
	
	ТекстСообщенийДоИсключения = ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Ложь);
	
	// Текст записи в журнал
	
	ТекстИсключения = ОписаниеИсключения + " Система сообщает: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	
	Если Не ПустаяСтрока(ТекстСообщенийДоИсключения) Тогда
		ТекстИсключения = ТекстИсключения
			+ ?(СтрЗаканчиваетсяНа(ТекстИсключения, Символы.ПС), Символы.ПС, Символы.ПС + Символы.ПС)
			+ "Сообщения пользователю:" + Символы.ПС + ТекстСообщенийДоИсключения;	
	КонецЕсли;
	
	Если Исключения = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ОписаниеИсключения, УровеньЖурналаРегистрации.Ошибка, , КлючДанных, ТекстИсключения);
	Иначе	
		Исключения.Добавить(ТекстИсключения);
	КонецЕсли;
	
	// Сообщение пользователю
	
	ТекстСообщенияПользователю = ОписаниеИсключения + " Система сообщает: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, , , Отказ);
	
КонецПроцедуры

// Регистрирует исключения в журнале ошибок (создает задачи в ОшибкиРегламентыхЗаданий)
// 
// Параметры:
//  Исключения	- Массив													- массив строк с текстом исключений
//  Источник	- СправочникСсылка.ДополнительныеОтчетыИОбработки, Строка	- источник ошибки
//
Процедура ЗарегистрироватьИсключения(Исключения, Источник) Экспорт
	
	Для Каждого ТекстИсключения Из Исключения Цикл
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ТекстИсключения, Источник);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
// 
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
	      Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
	      Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
		
	Иначе
		ВызватьИсключение РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
			Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	Результат = Новый Структура;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Ключ));
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		Результат.Вставить(Псевдоним);
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ТекстПолей = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + Символы.ПС + "	" + ИмяПоля + " КАК " + Псевдоним;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ссылка); // чтобы получить типизированные значения, где это возможно
		Возврат Результат;
	КонецЕсли;	

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|" + ТекстПолей + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
		|";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - Ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код" или "РасчетныйСчет.Валюта".
// 
// Возвращаемое значение:
//  Произвольный - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Если Найти(ИмяРеквизита, ".") <> 0 Тогда
		Псевдоним = СтрЗаменить(ИмяРеквизита, ".", "");
	Иначе
		Псевдоним = ИмяРеквизита;
	КонецЕсли;
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъекта(Ссылка, Новый Структура(Псевдоним, ИмяРеквизита));
	
	Возврат ЗначенияРеквизитов[Псевдоним];
	
КонецФункции 

// Возвращает значение указанного параметра сеанса
//  Используется, например, для вызова с клиента
//
// Параметры:
//  ИмяПараметраСеанса - Строка, соответствующая имена параметра сеанса.
//
// Возвращаемое значение:
//  Произвольный       - зависит от типа значения прочитанного параметра сеанса.
// 
Функция ЗначениеПараметраСеанса(ИмяПараметраСеанса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса[ИмяПараметраСеанса];
	
КонецФункции // ЗначениеПараметраСеанса

// Возвращает ссылку на объект, которому в регистре сведений "ИменованныеОбъекты"
//  поставлено в соответствие указанное имя, если таковой существует
//	если объект не найден, вызывается исключение
// 
// Параметры:
//  ИмяОбъекта                 - Строка, например, "Брокер_БК_Регион".
// 
// Возвращаемое значение:
//  Произвольный - Ссылка на объект.
// 
Функция ПолучитьИменованныйОбъект(ИмяОбъекта) Экспорт
	
	Возврат ОбщегоНазначенияПовтИсп.ПолучитьИменованныйОбъект(ИмяОбъекта);
	
КонецФункции // ПолучитьИменованныйОбъект

// Проверяет наличие ссылок на объект в информационной базе.
//
// Параметры:
//  Ссылка       - ЛюбаяСсылка
//               - Массив значений типа ЛюбаяСсылка
//
//  ИскатьСредиСлужебныхОбъектов - Булево - начальное значение Ложь,
//                 когда установлено Истина, тогда не будет учитываться
//                 исключения поиска ссылок, заданные при разработке конфигурации.
//
// Возвращаемое значение:
//  Булево.
//
Функция ОбъектИспользуетсяВБазеДанных(Знач Ссылка, Знач ИскатьСредиСлужебныхОбъектов = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Ссылка) = Тип("Массив") Или ТипЗнч(Ссылка) = Тип("ФиксированныйМассив") Тогда
		МассивСсылок = Ссылка;
	Иначе
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Ссылка);
	КонецЕсли;
	
	ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок);
	
	Если НЕ ИскатьСредиСлужебныхОбъектов Тогда
		
		СлужебныеОбъекты = ПолучитьОбщийСписокИсключенийПоискаСсылок();
		Исключения = Новый Массив;
		
		Для каждого ОписаниеСсылки Из ТаблицаСсылок Цикл
			Если СлужебныеОбъекты.Найти(ОписаниеСсылки.Метаданные.ПолноеИмя()) <> Неопределено Тогда
				Исключения.Добавить(ОписаниеСсылки);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаИсключение Из Исключения Цикл
			ТаблицаСсылок.Удалить(СтрокаИсключение);
		КонецЦикла;
	КонецЕсли;
	
	
	Возврат ТаблицаСсылок.Количество() > 0;
	
КонецФункции

// Проверяет, является ли ссылка на объект битой
Функция ОбъектСуществуетВБазеДанных(Знач Ссылка) Экспорт
	
	МД = Ссылка.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Акции", МД.ПолноеИмя());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Акции",            МД.Имя);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ОбъектСуществуетВБазеДанных

// Возвращает менеджер объекта по ссылке на объект
//
// Не обрабатываются точки маршрутов бизнес-процессов
//
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ...
// 
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Документы[ИмяОбъекта];
		
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат БизнесПроцессы[ИмяОбъекта];
		
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];
		
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];
		
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовРасчета[ИмяОбъекта];
		
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Задачи[ИмяОбъекта];
		
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыОбмена[ИмяОбъекта];
		
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Перечисления[ИмяОбъекта];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // МенеджерОбъектаПоСсылке

// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер.
// 
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ   = ЧастиИмени[1];
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		Если ЧастиИмени.Количество() = 2 Тогда
			// Регистр расчета
			Менеджер = РегистрыРасчета;
		Иначе
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда
				// Перерасчет
				Попытка
					Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
					ИмяОм = ИмяПодчиненногоОМ;
				Исключение
					Менеджер = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
	КонецЕсли;
	
	Если Менеджер <> Неопределено Тогда
		Попытка
			Возврат Менеджер[ИмяОМ];
		Исключение
			Менеджер = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВызватьИсключение РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неизвестный тип объекта метаданных ""%1""'"), ПолноеИмя);
	
КонецФункции

// Возвращает значение в виде XML-строки.
// Преобразованы в XML-строку (сериализованы) могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
//   Значение - Произвольный. Значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//   Строка - XML-строка представления значения в сериализованном виде.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Возвращает значение, полученное из XML-строки. 
// Получены из XML-строки могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
// СтрокаXML - строка представления значения в сериализованном виде.
//
// Возвращаемое значение:
// Значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

// Объединяет исключения поиска ссылок.
//
Функция ПолучитьОбщийСписокИсключенийПоискаСсылок()
	
	ОбщийМассивИсключенийСсылок = Новый Массив;
	
	// как вариант, вместо фиксированного списка, можно получить регистры сведений,
	// в котором указанный объект является ведущим измерением
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.КодыВоВнешнихСистемах.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.КодыВТорговыхСистемах.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.КодыСчетовДоверительногоУправленияУБрокеров.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.КонтактнаяИнформация.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.КурсыВалют.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.НоминалыЦенныхБумаг.ПолноеИмя());
	ОбщийМассивИсключенийСсылок.Добавить(Метаданные.РегистрыСведений.РеквизитыЮридическихЛиц.ПолноеИмя());
	
	// в типовой конфигурации в список исключения включаются регистры сведений, относящихся к версионированию, управлению доступом и т.п.х.
	// см. функции ПолучитьИсключенияПоискаСсылок()
		
	Возврат ОбщийМассивИсключенийСсылок;
	
КонецФункции

// Установить текст запроса, основную таблицу или динамическое считывание в динамическом списке.
// Устанавливать эти свойства следует за один вызов этой процедуры, чтобы не снижалась производительность.
//
// Параметры:
//  Список - ТаблицаФормы - элемент формы динамического списка, для которого устанавливаются свойства.
//  СтруктураПараметров - Структура - см. СтруктураСвойствДинамическогоСписка().
//
Процедура УстановитьСвойстваДинамическогоСписка(Список, СтруктураПараметров) Экспорт
	
	Форма = Список.Родитель;
	ТипФормаКлиентскогоПриложения = Тип("ФормаКлиентскогоПриложения");
	
	Пока ТипЗнч(Форма) <> ТипФормаКлиентскогоПриложения Цикл
		Форма = Форма.Родитель;
	КонецЦикла;
	
	ДинамическийСписок = Форма[Список.ПутьКДанным];
	
	Если СтруктураПараметров.Свойство("ТекстЗапроса") И ЗначениеЗаполнено(СтруктураПараметров.ТекстЗапроса) Тогда
		ДинамическийСписок.ТекстЗапроса = СтруктураПараметров.ТекстЗапроса;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ОсновнаяТаблица") И ЗначениеЗаполнено(СтруктураПараметров.ОсновнаяТаблица) Тогда
		ДинамическийСписок.ОсновнаяТаблица = СтруктураПараметров.ОсновнаяТаблица;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ДинамическоеСчитываниеДанных") Тогда
		ДинамическийСписок.ДинамическоеСчитываниеДанных = СтруктураПараметров.ДинамическоеСчитываниеДанных;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГиперссылкуНаОбъект(Объект, ТекстСсылки = "") Экспорт
	
	ТипСсылки	  = ТипЗнч(Объект.Ссылка);
	ВнешняяСсылка = ВнешняяНавигационнаяСсылка(Объект.Ссылка);
	
	Если НЕ ПустаяСтрока(ТекстСсылки) Тогда 
		Гиперссылка = "<A href=""" + ВнешняяСсылка + """>" + ТекстСсылки + "</A>";
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) ИЛИ Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Реквизиты = ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Номер, Дата");
		Гиперссылка = "<A href=""" + ВнешняяСсылка + """>№" + Реквизиты.Номер + " от " + Реквизиты.Дата + "</A>";
	Иначе
		Гиперссылка = "<A href=""" + ВнешняяСсылка + """>" + Строка(Объект.Ссылка) + "</A>";
	КонецЕсли;
	
	Возврат Гиперссылка;
	
КонецФункции

// Возвращает внешнюю навигационную ссылку в формате 1С:Предприятия на объект информационной базы, на его реквизит, на обсуждение или сообщение системы взаимодействия
// Параметры соответствуют параметрам встроенной функции ПолучитьНавигационнуюСсылку
//
// Возвращаемое значение:
//	Строка - навигационная ссылка, дополненная адресом информационной базы
//
Функция ВнешняяНавигационнаяСсылка(Объект, ИмяРеквизита = Неопределено, Индекс = Неопределено) Экспорт
	
	// Собственная реализация, т.к. встроенные ПолучитьВнешнююНавигационнуюСсылку и ПолучитьНавигационнуюСсылкуИнформационнойБазы
	// в фоновых и регламентных заданиях вместо базы возвращают пустое значение
	
	Возврат ОбщегоНазначенияПовтИсп.ПолучитьСсылкуИнформационнойБазы() + "#" + ПолучитьНавигационнуюСсылку(Объект, ИмяРеквизита, Индекс);
	
КонецФункции
