
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.СписокШаблонов = Параметры.СписокШаблонов;
	ЭтаФорма.АдресСоответствияВидовДоговоров = Параметры.АдресСоответствияВидовДоговоров;
	
	Элементы.ДекорацияОписание.Заголовок = Новый ФорматированнаяСтрока("Задайте перечень шаблонов " + Параметры.ОписаниеВидаШаблонов + Символы.ПС, Элементы.ДекорацияОписание.Заголовок);
	
	СоответствиеВидовДоговоров = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСоответствияВидовДоговоров);
	Если ТипЗнч(СоответствиеВидовДоговоров) = Тип("Соответствие") Тогда
		Для каждого КлючИЗначение Из СоответствиеВидовДоговоров Цикл
			НоваяСтрока = СоответствиеВидовДоговоровТаблица.Добавить();
			НоваяСтрока.ВидДоговораДоверительногоУправления = КлючИЗначение.Ключ;
			НоваяСтрока.ТекстЗамены = КлючИЗначение.Значение;
		КонецЦикла; 		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИзменения(Команда)
	
	СоответствиеВидовДоговоров = Новый Соответствие;
	Для каждого Строка Из СоответствиеВидовДоговоровТаблица Цикл
		СоответствиеВидовДоговоров.Вставить(Строка.ВидДоговораДоверительногоУправления, Строка.ТекстЗамены);
	КонецЦикла; 
	ПоместитьВоВременноеХранилище(СоответствиеВидовДоговоров, ЭтаФорма.АдресСоответствияВидовДоговоров);
	Закрыть(ЭтаФорма.СписокШаблонов);
	
КонецПроцедуры
