
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Данные.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Если Данные.Довнесение Тогда
			Представление = "Довнесение д/с на депозитный вклад ";
		Иначе
			Представление = "Размещение д/с на депозитном вкладе ";
		КонецЕсли; 
	Иначе
		
		ЭтоВыданныйЗайм = Данные.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный;
		
		Если Данные.Довнесение Тогда
			Представление = "Дополнительная " + ?(ЭтоВыданныйЗайм,"выдача", "получение") + " д/с по займу ";
		Иначе
			Представление = ?(ЭтоВыданныйЗайм,"Выдача", "Получение") + " займа ";
		КонецЕсли; 
		
	КонецЕсли;

	Представление = Представление + Данные.Номер + " от "+ Данные.Дата;
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Довнесение");
	Поля.Добавить("КредитныйИнструмент");
	
КонецПроцедуры
