
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	// депозитный счет имеет смысл заполнять из данных заполнения только при довнесении
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("КредитныйИнструмент") И ЗначениеЗаполнено(ДанныеЗаполнения.КредитныйИнструмент) Тогда
		
		Если ДанныеЗаполнения.Свойство("Довнесение") Тогда
			ДанныеЗаполнения.Довнесение = Истина;
		Иначе
			ДанныеЗаполнения.Вставить("Довнесение", Истина);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Распоряжение") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "СчетДоверительногоУправления, Сумма, РасчетныйСчет");
		ЭтотОбъект.Основание = ДанныеЗаполнения;
		
		// Проверяем дополнительные свойства
		Если Не ЗначениеЗаполнено(ЭтотОбъект.КредитныйИнструмент)
			И ЭтотОбъект.ДополнительныеСвойства.Свойство("ДепозитныйВклад") 
			И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ДепозитныйВклад) Тогда
			ЭтотОбъект.КредитныйИнструмент = ЭтотОбъект.ДополнительныеСвойства.ДепозитныйВклад;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.КредитныйИнструмент) Тогда
			
			// Ищем депозит с нашим распоряжением
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДепозитныеВклады.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
				|ГДЕ
				|	ДепозитныеВклады.Организация = &Организация
				|	И НЕ ДепозитныеВклады.ПометкаУдаления
				|	И ДепозитныеВклады.Распоряжение = &Распоряжение");
			
			Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("Распоряжение",	ЭтотОбъект.Основание);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ЭтотОбъект.КредитныйИнструмент = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		           	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "СтрокаБанковскойВыписки");
	
	Если Не ЭтотОбъект.Довнесение Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "КредитныйИнструмент, Сумма");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоРазмещениеБиржевогоДепозита = РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(ЭтотОбъект.КредитныйИнструмент);
	
	Если РаботаСДокументами.ТребуетсяЗаполнениеОснованияДокументаРазмещениеКредитногоИнструмента(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтоРазмещениеБиржевогоДепозита) Тогда
		ПроверяемыеРеквизиты.Добавить("Основание");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("РасчетныйСчет") <> Неопределено И ЭтоРазмещениеБиржевогоДепозита Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РасчетныйСчет"));
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
		
		Если ЭтоДепозитныйВклад Тогда
			ЭтоРазмещениеБиржевогоДепозита = РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(ЭтотОбъект.КредитныйИнструмент);
		Иначе
			ЭтоРазмещениеБиржевогоДепозита = Ложь;
		КонецЕсли;
		
		// Проверим связь договора депозитного вклада со счетом доверительного управления
		Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.КредитныйИнструмент, "БанковскийСчет.Договор");
		Если ЭтоДепозитныйВклад И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") = Перечисления.ВидыДоговоров.БанковскогоДепозита Тогда
			
			Если Не РегистрыСведений.ДоговорыСчетовДоверительногоУправления.ЕстьСвязьДоговораСоСчетомДоверительногоУправления(
							ЭтотОбъект.Дата,
							Договор,
							ЭтотОбъект.Организация,
							ЭтотОбъект.СчетДоверительногоУправления) Тогда
							
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Отсутствует связь депозитного договора '%1' со счетом ДУ '%2'",
								Договор,
								ЭтотОбъект.СчетДоверительногоУправления),
					Договор,,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтотОбъект.РасчетныйСчет <> Справочники.БанковскиеСчета.ДенежныеСредстваВПути
			И Не (ЭтоДепозитныйВклад И РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(ЭтотОбъект.КредитныйИнструмент)) 
		Тогда
			
			Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта р/счета " + ЭтотОбъект.РасчетныйСчет + " не совпадает с валютой банковского счета " + ЭтотОбъект.КредитныйИнструмент.БанковскийСчет + " депозитного вклада " + ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект, "КредитныйИнструмент",, Отказ);
			КонецЕсли;
			
			Если РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(ЭтотОбъект.Организация, ЭтотОбъект.КредитныйИнструмент) Тогда
				
				СчетВозвратаДенежныхСредств = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.КредитныйИнструмент);
				
				Если ЭтотОбъект.РасчетныйСчет <> СчетВозвратаДенежныхСредств Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет [" + ЭтотОбъект.РасчетныйСчет + "] не совпадает со счетом возврата денежных средств [" + СчетВозвратаДенежныхСредств + "] в условиях кредитного инструмента.", ЭтотОбъект, "РасчетныйСчет",, Отказ);	
				КонецЕсли;
				
			Иначе
			
				Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", ЭтотОбъект) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет [" + ЭтотОбъект.РасчетныйСчет + "] отсутствует в исполнителях (собственных) счета ДУ [" + ЭтотОбъект.СчетДоверительногоУправления + "].", ЭтотОбъект, "РасчетныйСчет",, Отказ);		
				КонецЕсли;
				
			Конецесли;
	
		КонецЕсли;
		
		Если Не ЭтотОбъект.Довнесение Тогда // это первоначальное размещение
			Если ЭтоДепозитныйВклад Тогда
				Если НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.КредитныйИнструмент.ДатаРегистрации Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата, размещения средств на депозитном вкладе " + НачалоДня(ЭтотОбъект.Дата) + ", отличается от даты размещения, указанной в депозитном вкладе " + ЭтотОбъект.КредитныйИнструмент.ДатаРегистрации, ЭтотОбъект, "КредитныйИнструмент",, Отказ);
				КонецЕсли;
				Если ЭтотОбъект.Сумма <> ЭтотОбъект.КредитныйИнструмент._НачальныйНоминал Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма, размещаемая на депозитном вкладе " + ЭтотОбъект.Сумма + ", отличается от суммы " + ЭтотОбъект.КредитныйИнструмент._НачальныйНоминал + " начального номинала", ЭтотОбъект, "Сумма",, Отказ);
				КонецЕсли;
			Иначе
				Если НачалоДня(ЭтотОбъект.Дата) < ЭтотОбъект.КредитныйИнструмент.ДатаЗаключения Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата выплаты средств по займу " + НачалоДня(ЭтотОбъект.Дата) + " раньше даты договора займа " + ЭтотОбъект.КредитныйИнструмент.ДатаЗаключения, ЭтотОбъект, "КредитныйИнструмент",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект, НачалоДня(ЭтотОбъект.Дата));
		
		Если ЭтоДепозитныйВклад
			И ЭтотОбъект.КредитныйИнструмент.ДоВостребования И НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.ДатаПогашения) Тогда
			//Для депозитов "до востребования" дата погашения не контролируется
		ИначеЕсли ДанныеКредитногоИнструмента.ДатаПогашения = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У "+?(ЭтоДепозитныйВклад, "депозитного вклада", "займа") + " " + ЭтотОбъект.КредитныйИнструмент + " не указана дата погашения " , ЭтотОбъект, "КредитныйИнструмент",, Отказ);
		Иначе
			Если ДанныеКредитногоИнструмента.ДатаПогашения < НачалоДня(ЭтотОбъект.Дата) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " не может быть больше даты погашения " + Формат(ДанныеКредитногоИнструмента.ДатаПогашения, "ДФ=dd.MM.yyyy"), ЭтотОбъект, "Дата",, Отказ);
			КонецЕсли; 
		КонецЕсли;	

		Если ЭтотОбъект.Довнесение И ДанныеКредитногоИнструмента.ТекущийНоминал = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует текущий номинал " + ?(ЭтоДепозитныйВклад, "депозитного вклада ", "займа ") + ЭтотОбъект.КредитныйИнструмент + ".
				|Для размещения нового вклада снимите флаг «Довнесение».", ЭтотОбъект, "КредитныйИнструмент",, Отказ);
		ИначеЕсли Не ЭтотОбъект.Довнесение И ДанныеКредитногоИнструмента.ТекущийНоминал <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + ?(ЭтоДепозитныйВклад, "депозитного вклада ", "займа ") + ЭтотОбъект.КредитныйИнструмент + " присутствует текущий номинал.
				|Для довнесения д/с установите флаг «Довнесение».", ЭтотОбъект, "КредитныйИнструмент",, Отказ);
		КонецЕсли; 

		Если НЕ ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Полученный Тогда
			ВидДвиженияДС = Перечисления.ВидыДвижений.Приход;
		Иначе
			ВидДвиженияДС = Перечисления.ВидыДвижений.Расход;
		КонецЕсли;
		
		РаботаСБанковскимиВыпискамиКлиентСервер.ПроверитьСоответствиеСтрокиБанковскойВыпискиИПлатежногоДокумента(ЭтотОбъект,
			ЭтотОбъект.СтрокаБанковскойВыписки, ВидДвиженияДС, Отказ);
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание)
				Или РаботаСДокументами.ТребуетсяЗаполнениеОснованияДокументаРазмещениеКредитногоИнструмента(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтоРазмещениеБиржевогоДепозита)
		Тогда
			РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииРаспоряжения(ЭтотОбъект, Отказ);
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);

	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти 

Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;	
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", 					ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет", 				ЭтотОбъект.РасчетныйСчет);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",          	ЭтотОбъект.КредитныйИнструмент);
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияКредитныхИнструментов");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",               ЭтотОбъект.КредитныйИнструмент);

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки()

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
	
	Движения.ДенежныеСредстваВКредитныхИнструментах.Записывать 	= Истина;
	Движения.ОстаткиДенежныхСредств.Записывать              	= Истина;
	Движения.НоминалыКредитныхИнструментов.Записывать			= Истина;
	
	Если ЭтоДепозитныйВклад Тогда
		ВидДвижения = Перечисления.ВидыДвижений.Расход;
		ВидДвиженияДенежныхСредств = Перечисления.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе;
	Иначе
		Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Полученный Тогда
			ВидДвиженияДенежныхСредств = Перечисления.ВидыДвиженийДенежныхСредств.ПолучениеЗайма;
			ВидДвижения = Перечисления.ВидыДвижений.Приход;
		Иначе
			ВидДвиженияДенежныхСредств = Перечисления.ВидыДвиженийДенежныхСредств.ВыдачаЗайма;
			ВидДвижения = Перечисления.ВидыДвижений.Расход;
		КонецЕсли;
	КонецЕсли;
	
	// остатки д/с
	
	Если НЕ ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Полученный Тогда
		Движение = Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
	Иначе
		Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
	КонецЕсли;
	
	МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
	Если ЭтоДепозитныйВклад Тогда
		РеквизитыДепозитногоВклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.КредитныйИнструмент, "МестоХранения");
		Если ЗначениеЗаполнено(РеквизитыДепозитногоВклада.МестоХранения) Тогда
			МестоХранения = РеквизитыДепозитногоВклада.МестоХранения;	
		КонецЕсли;
	КонецЕсли;
	
	Движение.Период                       = ЭтотОбъект.Дата;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РасчетныйСчет                = ЭтотОбъект.РасчетныйСчет;
	Движение.МестоХранения                = МестоХранения;
	Движение.Валюта                       = ?(ЭтоДепозитныйВклад, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.КредитныйИнструмент.Валюта); // т.к. при размещении из пути валюта в р/счете не заполнена
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	Движение.ВидДвиженияДенежныхСредств   = ВидДвиженияДенежныхСредств;
	
	// д/с на депозитах
	
	Движение = Движения.ДенежныеСредстваВКредитныхИнструментах.ДобавитьПриход();
	
	Движение.Период 					  = ЭтотОбъект.Дата;
	Движение.Организация 				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.КредитныйИнструмент 		  = ЭтотОбъект.КредитныйИнструмент;
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	Движение.ВидКредитногоИнструмента	  = ?(ЭтоДепозитныйВклад, Перечисления.ВидыКредитныхИнструментов.Выданный,		  ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента);
	Движение.ТипКредитногоИнструмента	  = ?(ЭтоДепозитныйВклад, Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад, Перечисления.ТипыКредитныхИнструментов.Займ);
	
	Движения.Записать();
	
	// реестр платежей
	РегистрыСведений.РеестрПлатежей.ЗарегистрироватьПлатеж(ЭтотОбъект,
		РегистрыСведений.РеестрПлатежей.СкомпоноватьСведенияОСтрокеБанковскойВыписки(
			ЭтотОбъект.СтрокаБанковскойВыписки, ВидДвижения, ЭтотОбъект.Сумма, ВидДвиженияДенежныхСредств));
				
	// проверим наличие остатков д/с
	РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
	
	РегистрыСведений.НоминалыКредитныхИнструментов.УстановитьНоминалКредитногоИнструмента(ЭтотОбъект);
			
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по ЕПС размещения ДС по займу", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ЭтоБиржевойДепозит = РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(ЭтотОбъект.КредитныйИнструмент);
	
	// проверка ставки на рыночность
	Если НЕ ЭтотОбъект.Довнесение
		И НЕ ЭтоБиржевойДепозит Тогда // для них пока не понятно - нужно ли проверять на рыночность
	
		ТаблицаДепозит = Новый ТаблицаЗначений;
		ТаблицаДепозит.Колонки.Добавить("КредитныйИнструмент",  Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады"));
		ТаблицаДепозит.Колонки.Добавить("ВидАктива", 			Новый ОписаниеТипов("ПеречислениеСсылка.ВидыАктивовДляПроверкиНаРыночность"));
		ТаблицаДепозит.Колонки.Добавить("Номинал",         Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		ТаблицаДепозит.Колонки.Добавить("Проценты",        Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		ТаблицаДепозит.Колонки.Добавить("Задолженность",   Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);
		
		НоваяСтрокаТаблицаДепозит = ТаблицаДепозит.Добавить();
		НоваяСтрокаТаблицаДепозит.КредитныйИнструмент 	= ЭтотОбъект.КредитныйИнструмент;
		НоваяСтрокаТаблицаДепозит.ВидАктива 			= Перечисления.ВидыАктивовДляПроверкиНаРыночность.Депозиты;
		НоваяСтрокаТаблицаДепозит.Номинал         = ЭтотОбъект.Сумма;
		НоваяСтрокаТаблицаДепозит.Проценты        = 0;
		
		ДепозитыПоРыночнойСтавке = РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке(
			ТаблицаДепозит,
			ЭтотОбъект.СчетДоверительногоУправления,
			КонецДня(ЭтотОбъект.Дата), // т.к. СЧА оценивает не конец дня
			Справочники.ЦелиРасчета.ЕдиныйПланСчетов,
			Неопределено,
			Отказ);
			
			// Вот така таблицца будет и нужно будет первоначальное признание по ней пробить
			//
			//СтавкаДляПроверкиНаРыночность
			//НеПоказыватьОтрицательныеПроценты
			//КоэффициентыВолатильностиРычнонойСтавки
			//МаксимумКредитногоСпреда
			//МинимумКредитногоСпреда
			//Медиана
			//БезрисковаяСтавкаДоходности
			//ВерхняяГраницаСреднерыночнойСтавки
			//НижняяГраницаСреднерыночнойСтавки
			//СрокДепозита
			//КлючеваяСтавкаНаДатуРасчета
			//КлючеваяСтавкаНаДатуРыночной
			//ПериодСреднерыночнойСтавки
			//СреднерыночнаяСтавкаНаДату
			//СреднерыночнаяСтавка
			//ДатаРазмещения
			//ДоВостребования
			//ПериодичностьВыплатыПроцентов
			//ДатаПогашения
			//ДатаРегистрации
			//ПроцентПоДепозиту - БЕРЕМ ЕГО
			//СтавкаПоДоговору
			//ОцениватьДепозитныйВкладвСЧАПоНоминалу
			//ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП
			//СхемаПроверкиСущественностиОтклонений
			//МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета
			//ВариантОтклоненияОтРыночнойСтавки
			//ОтклонениеКредитногоСпреда
			//ИсточникТаблицыСоответствияРейтингов
			//ПроверкаНаРыночностьТолькоПриПервоначальномПризнании
			//ПроцентСущественностиВПроцентныхПунктах
			//ТочностьРыночнойСтавки
			//ВидСтавкиДляПроверкиНаРыночность
			//ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения
			//МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки
			//МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки
			//ПроцентСущественностиОтклоненияОтРыночнойСтавки
			//ВариантыРасчетаРыночнойСтавки
			//ВариантПолученияКлючевойСтавки
			//ВидШкалы
			//ВариантРасчетаСрока
			//ГруппаБанков
			//ВалютаДепозита
			//ПроцентыЭСП - КОРРЕКТИРОВКА
			//Проценты - ЛИНЕЙНЫЕ
			//Номинал - СУММА РАЗМЕЩЕНИЯ
			//ДепозитныйВклад
			
		Для каждого ДепозитПоРыночнойСтавке Из ДепозитыПоРыночнойСтавке Цикл
		
			Если ДепозитПоРыночнойСтавке.ПроцентыЭСП <> 0 Тогда
			
				 БухгалтерскийУчетЕПС.ПровестиКорректировкуПП(
				 	ЭтотОбъект,
					ДепозитПоРыночнойСтавке.КредитныйИнструмент,
					ДепозитПоРыночнойСтавке.Номинал,
					ДепозитПоРыночнойСтавке.Номинал + ДепозитПоРыночнойСтавке.ПроцентыЭСП);
			
			КонецЕсли;	
		
		КонецЦикла;
			
	КонецЕсли;
	// проверка ставки на рыночность
	
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата);
	
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Открытие депозитного вклада");
	
	Проводка.СчетДт = УчетныйАктив.СчетУчета;
	
	Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
	Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
	
	Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
	Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
	
	Если ЭтоБиржевойДепозит Тогда
		Проводка.СчетКт = ПланыСчетов.Единый.СчетаДляКлиринга24;
		Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
	Иначе
		Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата) Тогда
			Проводка.СчетКт = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			Проводка.СчетКт = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.ВалютаКт  = ЭтотОбъект.РасчетныйСчет.Валюта;
	КонецЕсли;
	Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.РазмещениеДСНаДепозитномВкладе;
	
	
	Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;

	РасчетныеДанныеДепозита = Новый Структура("ЭффективнаяСтавкаПроцента,ИспользоватьЭффективнуюПроцентнуюСтавку,СтоимостьПоЭффективнойПроцентнойСтавке", 0, Ложь, ЭтотОбъект.Сумма);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ЭффективнаяСтавкаПроцента КАК ЭффективнаяСтавкаПроцента,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ИспользоватьЭффективнуюПроцентнуюСтавку КАК ИспользоватьЭффективнуюПроцентнуюСтавку,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.СтоимостьПоЭффективнойПроцентнойСтавке КАК СтоимостьПоЭффективнойПроцентнойСтавке
		|ИЗ
		|	РегистрСведений.РасчетныеПоказателиДепозитногоВклада.СрезПоследних(
		|			&Период,
		|			ДепозитныйВклад = &ДепозитныйВклад
		|				И ЦельРасчета = &ЦельРасчета) КАК РасчетныеПоказателиДепозитногоВкладаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДепозитныйВклад", КредитныйИнструмент);
	Запрос.УстановитьПараметр("ЦельРасчета", Справочники.ЦелиРасчета.ЕдиныйПланСчетов);		
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РасчетныеДанныеДепозита, ВыборкаДетальныеЗаписи);
	КонецЕсли;

	СуммаКорректировки = РасчетныеДанныеДепозита.СтоимостьПоЭффективнойПроцентнойСтавке - ЭтотОбъект.Сумма;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКорректировки, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Если СуммаКорректировки > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Корректировка");
			
			Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокА;
			
			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
			Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
			
			Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = СуммаКорректировки;
			
			
			Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
				Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций01;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтОпераций;
			Иначе
				Проводка.СчетКт = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаДоходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаДоходовОтКорректировки;
			КонецЕсли;
			
			Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.КредитныйИнструмент;
			
		ИначеЕсли СуммаКорректировки < 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -СуммаОперации, "Корректировка");
			
			
			Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций02;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтОпераций;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.НайтиПоКоду(УчетныйАктив.АналитикаРасходовОтКорректировки.НомерСчетаБухгалтерскогоУчета);
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаРасходовОтКорректировки;
			КонецЕсли;
			
			Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.КредитныйИнструмент;
			
			
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокП;
			
			Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
			Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
			
			Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаКт = -СуммаКорректировки;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	ЭтоБиржевойДепозит = РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(ЭтотОбъект.КредитныйИнструмент);
	
	Если ЭтотОбъект.РасчетныйСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ДенежныеСредстваВПути") Тогда
		СчетУчетаДС = ПланыСчетов.Основной.ПереводыВПути;
	ИначеЕсли ЭтоБиржевойДепозит Тогда
	    СчетУчетаДС = БухгалтерскийУчет.ОпределитьНастройкуУчета(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			"СчетУчетаДенежныхСредствНаБирже");
	Иначе
		СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления,
			ЭтотОбъект.РасчетныйСчет.Валюта,
			Справочники.БрокерскиеКомпании.ПустаяСсылка());
	КонецЕсли;
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата,, ЭтотОбъект.КредитныйИнструмент);
	СчетУчетаАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);
		
	Если ЭтотОбъект.Сумма <> 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.Сумма, "Открытие " + РаботаСКредитнымиИнструментами.НазваниеКредитногоИнструментаРодительныйПадеж(ЭтотОбъект.КредитныйИнструмент));
		
		СторонаКредитногоИнструмента = ?(УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные ИЛИ УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные, "Кт", "Дт");
		СторонаДС = ?(СторонаКредитногоИнструмента = "Дт", "Кт", "Дт");
		
		// дебет
		Проводка["Счет"+СторонаКредитногоИнструмента] = СчетУчетаАктивов;
		Если УчетныйАктив = Справочники.УчетныеАктивы.ДепозитныеВклады Тогда
			Проводка["Субконто"+СторонаКредитногоИнструмента].ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		Иначе
			ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата); 
			Проводка["Субконто"+СторонаКредитногоИнструмента].Контрагенты = ДанныеКредитногоИнструмента.Контрагент;
			Проводка["Субконто"+СторонаКредитногоИнструмента].Займы = ЭтотОбъект.КредитныйИнструмент;
		КонецЕсли;
		
		// кредит
		Проводка["Счет"+СторонаДС] = СчетУчетаДС;
		Если ЭтотОбъект.РасчетныйСчет <> ПредопределенноеЗначение("Справочник.БанковскиеСчета.ДенежныеСредстваВПути")
			И СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
			Проводка["Субконто"+СторонаДС].БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		КонецЕсли;
		
		Если СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда 
			Если УчетныйАктив = Справочники.УчетныеАктивы.ДепозитныеВклады Тогда 
				Проводка["Субконто"+СторонаДС].ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.РазмещениеДСНаДепозитномВкладе;
			ИначеЕсли  УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыВыданные Тогда 
				Проводка["Субконто"+СторонаДС].ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВыдачаЗайма;
			ИначеЕсли УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные ИЛИ УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные Тогда 
				Проводка["Субконто"+СторонаДС].ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПолучениеЗайма;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЭтоБиржевойДепозит И СчетУчетаДС.Валютный Тогда
		
			Проводка["Валюта"+СторонаДС] = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
			Проводка["ВалютнаяСумма"+СторонаДС] = ЭтотОбъект.Сумма;
		
		КонецЕсли;
		
		НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления, 
			УчетныйАктив, 
			УчетныйРегистр); 
		
		Если НастройкиУчетаАктива.ПереоцениватьВДеньОперации 
			И ЗначениеЗаполнено(НастройкиУчетаАктива.АналитикаПервоначальногоПризнания)
			И НастройкиУчетаАктива.АналитикаДоходовОтПереоценки <> НастройкиУчетаАктива.АналитикаПервоначальногоПризнания Тогда
			
			СтоимостьКакВРСА = Документы.ПереоценкаКредитныхИнструментов.ОпределятьСтоимостьКредитныхИнструментовКакВРСА(Перечисления.ВидыУчета[УчетныйРегистр], ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);
			
			СтоимостьКредитныхИнструментов = Документы.ПереоценкаКредитныхИнструментов.ОпределитьСтоимостьКредитныхИнструментов(
				ЭтотОбъект.Организация,
				ЭтотОбъект.СчетДоверительногоУправления,
				КонецДня(ЭтотОбъект.Дата),
				Перечисления.ВидыУчета[УчетныйРегистр],
				СтоимостьКакВРСА,
				Отказ);
				
			Для каждого СтрокаСтоимости Из СтоимостьКредитныхИнструментов Цикл
				Если СтрокаСтоимости.КредитныйИнструмент = ЭтотОбъект.КредитныйИнструмент Тогда
					ОценочнаяСумма = СтрокаСтоимости.Номинал + СтрокаСтоимости.Проценты;
					Если СтоимостьКакВРСА Тогда
						ОценочнаяСумма = ОценочнаяСумма + СтрокаСтоимости.СуммаРезерва;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], МатематическиеФункции.МодульЧисла(ОценочнаяСумма - ЭтотОбъект.Сумма), "Переоценка при размещении " + РаботаСКредитнымиИнструментами.НазваниеКредитногоИнструментаРодительныйПадеж(ЭтотОбъект.КредитныйИнструмент));
			
			Если ОценочнаяСумма < ЭтотОбъект.Сумма Тогда
                СторонаКредитногоИнструмента = ?(СторонаКредитногоИнструмента = "Дт", "Кт", "Дт");
			КонецЕсли;
			СторонаДоходаРасхода = ?(СторонаКредитногоИнструмента = "Дт", "Кт", "Дт");
			
			Проводка["Счет"+СторонаКредитногоИнструмента] = НастройкиУчетаАктива.СчетУчетаПереоценки;
			Если УчетныйАктив = Справочники.УчетныеАктивы.ДепозитныеВклады Тогда
				Проводка["Субконто"+СторонаКредитногоИнструмента].ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
			Иначе
				ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата); 
				Проводка["Субконто"+СторонаКредитногоИнструмента].Контрагенты = ДанныеКредитногоИнструмента.Контрагент;
				Проводка["Субконто"+СторонаКредитногоИнструмента].Займы = ЭтотОбъект.КредитныйИнструмент;
			КонецЕсли;
			
			Проводка["Счет"+СторонаДоходаРасхода] = ?(СторонаДоходаРасхода = "Дт", ПланыСчетов.Основной.ПрочиеРасходы, ПланыСчетов.Основной.ПрочиеДоходы);
			Проводка["Субконто"+СторонаДоходаРасхода].ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаПервоначальногоПризнания;
			Проводка["Субконто"+СторонаДоходаРасхода].ЦенныеБумаги = ЭтотОбъект.КредитныйИнструмент;
			
		КонецЕсли;	
																	  
	КонецЕсли;
	
КонецПроцедуры
