
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Пояснения к балансу. Наличие и движение финансовых вложений, ДЗ, КЗ.",
		"0.21",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период = НастройкиОтчета.Период;
	
	Если НастройкиОтчета.Свойство("ЕдиницаИзмерения")
		И ЗначениеЗаполнено(НастройкиОтчета.ЕдиницаИзмерения) Тогда 
		ЕдиницаИзмерения = НастройкиОтчета.ЕдиницаИзмерения;
	Иначе
		ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1");
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("ТочностьЕдиницыИзмерения") Тогда
		ТочностьЕдиницыИзмерения = НастройкиОтчета.ТочностьЕдиницыИзмерения;
	Иначе
		ТочностьЕдиницыИзмерения = 2;
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("УчитыватьПереводыДолгосрочных") Тогда
		УчитыватьПереводыДолгосрочных = НастройкиОтчета.УчитыватьПереводыДолгосрочных;
	Иначе
		УчитыватьПереводыДолгосрочных = Истина;
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("ЗадолженностьПоМетодикеФОГФ") Тогда
		ЗадолженностьПоМетодикеФОГФ = НастройкиОтчета.ЗадолженностьПоМетодикеФОГФ;
	Иначе
		ЗадолженностьПоМетодикеФОГФ = Ложь;
	КонецЕсли;
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	Если НастройкиОтчета.Свойство("Подписант") Тогда
		Если ТипЗнч(НастройкиОтчета.Подписант) = Тип("Структура") Тогда
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
		Иначе	
			СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.Подписант);
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
		КонецЕсли;
	КонецЕсли;	
	
	Если НастройкиОтчета.Свойство("ПодписантРуководитель") Тогда
		Если ТипЗнч(НастройкиОтчета.ПодписантРуководитель) = Тип("Структура") Тогда
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", НастройкиОтчета.ПодписантРуководитель);
		Иначе	
			СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("ПодписантГлавбух") Тогда
		Если ТипЗнч(НастройкиОтчета.ПодписантГлавбух) = Тип("Структура") Тогда
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", НастройкиОтчета.ПодписантГлавбух);
		Иначе	
			СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантГлавбух);
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
		КонецЕсли;
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	Расшифровка = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Расшифровка);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьДолгосрочныеИКраткосрочныеДвиженияАктивов(Организация, СчетДоверительногоУправления, НачалоПериода, ОкончаниеПериода) Экспорт
	
	// описание запросов
	// См. РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы Методы сбора и классификации данных аналогичны, только там Остатки, а тут Обороты. 
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.КлассификацияАктиваПоСрочности КАК КлассификацияАктиваПоСрочности,
	|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ДепозитныеВклады)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.Акции)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.АкцииИностранныхЭмитентов)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.Паи)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяДисконтные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.Векселя)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяПроцентные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.Векселя)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигацииТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигацииКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииКупон)
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ДепозитныеВклады)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаАкций)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаАкцийИностранныхЭмитентов)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаПаев)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяДисконтные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаВекселей)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяПроцентные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаВекселей)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаКорпоративныхОблигацийТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаГосударственныхОблигацийТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаКорпоративныхОблигацийКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаГосударственныхОблигацийКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЕврооблигацийТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЕврооблигацийКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЕврооблигацийТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЕврооблигацийКупон)
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки
	|	КОНЕЦ КАК СчетУчетаПереоценки,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчетаВЗалоге = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.АкцииВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.АкцииИностранныхЭмитентовВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПаиВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяДисконтные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ВекселяВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяПроцентные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ВекселяВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигациивЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигацииВЗалогеКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииВЗалогеКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеКупон)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеТело)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеКупон)
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчетаВЗалоге
	|	КОНЕЦ КАК СчетУчетаВЗалоге,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценкиВЗалоге = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.АкцииВЗалогеПереоценка)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.АкцииИностранныхЭмитентовВЗалогеПереоценка)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ПаиВЗалогеПереоценка)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяДисконтные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ВекселяВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяПроцентные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ВекселяВЗалоге)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигациивЗалогеПереоценкаТела)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииВЗалогеПереоценкаТела)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.КорпоративныеОблигацииВЗалогеКупонНачисленный)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ГосударственныеОблигацииВЗалогеКупонНачисленный)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеПереоценкаТела)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеКупонНачисленный)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеПереоценкаТела)
	|					КОГДА НастройкиУчетаАктивовСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Основной.ЕврооблигацииВЗалогеКупонНачисленный)
	|				КОНЕЦ
	|		ИНАЧЕ НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценкиВЗалоге
	|	КОНЕЦ КАК СчетУчетаПереоценкиВЗалоге
	|ПОМЕСТИТЬ _Настройка
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&ПериодЗапроса,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК НастройкиУчетаАктивовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ПартииЦенныхБумаг.Партия КАК Партия,
	|	ПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
	|	СУММА(ПартииЦенныхБумаг.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ПартииЦенныхБумаг.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииЦенныхБумаг.КоличествоПриход = 0
	|					И ПартииЦенныхБумаг.КоличествоРасход = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПартииЦенныхБумаг.СтоимостьВВалютеУчетаПриход
	|		КОНЕЦ + ПартииЦенныхБумаг.ИндексацияНоминалаЗаВремяВладенияПриход) КАК СтоимостьПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииЦенныхБумаг.КоличествоПриход = 0
	|					И ПартииЦенныхБумаг.КоличествоРасход = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПартииЦенныхБумаг.СтоимостьВВалютеУчетаРасход
	|		КОНЕЦ + ПартииЦенныхБумаг.ИндексацияНоминалаЗаВремяВладенияРасход) КАК СтоимостьРасход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаВВалютеУчетаПриход + ВЫБОР
	|			КОГДА ПартииЦенныхБумаг.КоличествоПриход = 0
	|					И ПартииЦенныхБумаг.КоличествоРасход = 0
	|				ТОГДА ПартииЦенныхБумаг.СтоимостьВВалютеУчетаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьПереоценкиПриход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаВВалютеУчетаРасход + ВЫБОР
	|			КОГДА ПартииЦенныхБумаг.КоличествоПриход = 0
	|					И ПартииЦенныхБумаг.КоличествоРасход = 0
	|				ТОГДА ПартииЦенныхБумаг.СтоимостьВВалютеУчетаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьПереоценкиРасход,
	|	СУММА(ПартииЦенныхБумаг.СуммаРезервовПодОбесценениеПриход) КАК РезервПодОбесцениеПриход,
	|	СУММА(ПартииЦенныхБумаг.СуммаРезервовПодОбесценениеРасход) КАК РезервПодОбесцениеРасход,
	|	СУММА(ПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчетаПриход) КАК СтоимостьКупонаПриход,
	|	СУММА(ПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчетаРасход) КАК СтоимостьКупонаРасход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчетаПриход) КАК СтоимостьПереоценкиКупонаПриход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчетаРасход) КАК СтоимостьПереоценкиКупонаРасход,
	|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, ДЕНЬ), НАЧАЛОПЕРИОДА(ПартииЦенныхБумаг.Партия.Дата, ДЕНЬ)) КАК ДатаПокупки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(ПартииЦенныхБумаг.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаПогашения,
	|	НАЧАЛОПЕРИОДА(&ОкончаниеПериода, ДЕНЬ) КАК ОтчетнаяДата,
	|	ЕСТЬNULL(КупонныйДоходПоОблигациям.Период, &ОкончаниеПериода) КАК ДатаНачалаКупона,
	|	ЕСТЬNULL(КупонныйДоходПоОблигациям.ДатаОкончанияКупона, &ОкончаниеПериода) КАК ДатаОкончанияКупона,
	|	ПартииЦенныхБумаг.Рынок КАК Рынок,
	|	ЛОЖЬ КАК вРЕПО,
	|	ЛОЖЬ КАК поРЕПО,
	|	СУММА(ПартииЦенныхБумаг.СтоимостьПокупкиПриход * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) + ПартииЦенныхБумаг.РасходыПриПокупкеВСтоимостиВВалютеУчетаПриход) КАК СтоимостьПокупкиСРасходамиПриПокупкеПриход,
	|	СУММА(ПартииЦенныхБумаг.СтоимостьПокупкиРасход * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) + ПартииЦенныхБумаг.РасходыПриПокупкеВСтоимостиВВалютеУчетаРасход) КАК СтоимостьПокупкиСРасходамиПриПокупкеРасход,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) КАК ОтчетнаяДатаНаНачалоПериода,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаКупонаВСтоимостиПриход) КАК ПереоценкаКупонаВСтоимостиПриход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаКупонаВСтоимостиРасход) КАК ПереоценкаКупонаВСтоимостиРасход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаВСтоимостиПриход) КАК ПереоценкаВСтоимостиПриход,
	|	СУММА(ПартииЦенныхБумаг.ПереоценкаВСтоимостиРасход) КАК ПереоценкаВСтоимостиРасход,
	|	СУММА(ПартииЦенныхБумаг.ИндексацияНоминалаЗаВремяВладенияПриход) КАК ИндексацияНоминалаЗаВремяВладенияПриход,
	|	СУММА(ПартииЦенныхБумаг.ИндексацияНоминалаЗаВремяВладенияРасход) КАК ИндексацияНоминалаЗаВремяВладенияРасход
	|ПОМЕСТИТЬ _Партии
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК ПартииЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
	|		ПО ПартииЦенныхБумаг.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
	|			И ПартииЦенныхБумаг.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|		ПО ПартииЦенныхБумаг.ЦеннаяБумага = КупонныйДоходПоОблигациям.Облигация
	|			И (КупонныйДоходПоОблигациям.Период <= &ОкончаниеПериода)
	|			И (КупонныйДоходПоОблигациям.ДатаОкончанияКупона > &ОкончаниеПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ПартииЦенныхБумаг.Партия) = ТИП(Документ.ВводЦенныхБумаг)
	|					ТОГДА ВЫБОР
	|							КОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки ЕСТЬ NULL
	|									ИЛИ ВводЦенныхБумагЦенныеБумаги.ДатаПокупки = ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ПартииЦенныхБумаг.Партия КАК Документ.ВводЦенныхБумаг).Дата, ДЕНЬ)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, ДЕНЬ)
	|						КОНЕЦ
	|				КОГДА ТИПЗНАЧЕНИЯ(ПартииЦенныхБумаг.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
	|					ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ПартииЦенныхБумаг.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание.Дата, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ПартииЦенныхБумаг.Партия.Дата, ДЕНЬ)
	|			КОНЕЦ = КурсыВалют.Период)
	|			И ПартииЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииЦенныхБумаг.ЦеннаяБумага,
	|	ПартииЦенныхБумаг.Партия,
	|	ПартииЦенныхБумаг.СтрокаПартии,
	|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, ДЕНЬ), НАЧАЛОПЕРИОДА(ПартииЦенныхБумаг.Партия.Дата, ДЕНЬ)),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииЦенныхБумаг.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(ПартииЦенныхБумаг.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ,
	|	ЕСТЬNULL(КупонныйДоходПоОблигациям.Период, &ОкончаниеПериода),
	|	ЕСТЬNULL(КупонныйДоходПоОблигациям.ДатаОкончанияКупона, &ОкончаниеПериода),
	|	ПартииЦенныхБумаг.Рынок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КоличествоРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьВВалютеУчетаПриход + БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВВалютеУчетаРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СуммаРезервовПодОбесценениеРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьКупонаВВалютеУчетаРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВВалютеУчетаРасход,
	|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, ДЕНЬ), НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия.Дата, ДЕНЬ)),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(&ОкончаниеПериода, ДЕНЬ),
	|	КупонныйДоходПоОблигациям.Период,
	|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиПриход + БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтоимостьПокупкиРасход + БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеВСтоимостиВВалютеУчетаРасход,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВСтоимостиПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаВСтоимостиРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВСтоимостиПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаВСтоимостиРасход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияПриход,
	|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ИндексацияНоминалаЗаВремяВладенияРасход
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК БухПартииЦенныхБумагПроданныеВРепоОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
	|		ПО БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
	|			И БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|		ПО БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага = КупонныйДоходПоОблигациям.Облигация
	|			И (КупонныйДоходПоОблигациям.Период <= &ОкончаниеПериода)
	|			И (КупонныйДоходПоОблигациям.ДатаОкончанияКупона > &ОкончаниеПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент,
	|	"""",
	|	1,
	|	1,
	|	1,
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаПриход,
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаРасход,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ДатаРегистрации,
	|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения,
	|	НАЧАЛОПЕРИОДА(&ОкончаниеПериода, ДЕНЬ),
	|	NULL,
	|	NULL,
	|	""Депозиты"",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаПриход,
	|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаРасход,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения
	|		ИЗ
	|			(ВЫБРАТЬ
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
	|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
	|			ИЗ
	|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&ОкончаниеПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
	|			ГДЕ
	|				УсловияКредитныхИнструментовСрезПоследних.Действует
	|			
	|			СГРУППИРОВАТЬ ПО
	|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&ОкончаниеПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
	|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
	|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтрокаПартии,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоПриход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.КоличествоРасход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаПриход + ЕСТЬNULL(БухгалтерскийУчетОбороты.СуммаОборотКт, 0),
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаРасход + ЕСТЬNULL(БухгалтерскийУчетОбороты.СуммаОборотКт, 0),
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаВВалютеУчетаРасход,
	|	0,
	|	0,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьКупонаВВалютеУчетаРасход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ПереоценкаКупонаВВалютеУчетаРасход,
	|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(&ОкончаниеПериода, ДЕНЬ),
	|	КупонныйДоходПоОблигациям.Период,
	|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Рынок,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаПриход,
	|	БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СтоимостьВВалютеУчетаРасход,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			Период,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК БухПартииЦенныхБумагКупленныеПоРЕПООстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|		ПО БухПартииЦенныхБумагКупленныеПоРЕПООстатки.ЦеннаяБумага = КупонныйДоходПоОблигациям.Облигация
	|			И (КупонныйДоходПоОблигациям.Период <= &ОкончаниеПериода)
	|			И (КупонныйДоходПоОблигациям.ДатаОкончанияКупона > &ОкончаниеПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
	|				&НачалоПериода,
	|				&ОкончаниеПериода,
	|				Период,
	|				Счет = ЗНАЧЕНИЕ(ПЛАНСЧЕТОВ.Основной.НалоговыеНачисленияПоРЕПО),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СделкаРЕПО),
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления,
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ФинансовыеВложения)),
	|				) КАК БухгалтерскийУчетОбороты
	|		ПО БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Организация = БухгалтерскийУчетОбороты.Организация
	|			И БухПартииЦенныхБумагКупленныеПоРЕПООстатки.СчетДоверительногоУправления = БухгалтерскийУчетОбороты.СчетДоверительногоУправления
	|			И БухПартииЦенныхБумагКупленныеПоРЕПООстатки.Партия = БухгалтерскийУчетОбороты.Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Партии.Рынок КАК Рынок,
	|	_Партии.вРЕПО КАК вРЕПО,
	|	_Партии.поРЕПО КАК поРЕПО
	|ПОМЕСТИТЬ _ЦенныеБумаги
	|ИЗ
	|	_Партии КАК _Партии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ЦенныеБумаги.Рынок КАК Рынок,
	|	_ЦенныеБумаги.вРЕПО КАК вРЕПО,
	|	_ЦенныеБумаги.поРЕПО КАК поРЕПО,
	|	ВЫБОР
	|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитныеВклады
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ДепозитныеВклады)
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ТипВекселя = ЗНАЧЕНИЕ(Перечисление.ТипыВекселей.Дисконтный)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяДисконтные)
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).ТипВекселя = ЗНАЧЕНИЕ(Перечисление.ТипыВекселей.Процентный)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ВекселяПроцентные)
	|				КОНЕЦ
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Доли)
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Фьючерсы)
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала = &Рубль
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПаиИностранныхЭмитентов)
	|				КОНЕЦ
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала = &Рубль
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов)
	|				КОНЕЦ
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|			ТОГДА ВЫБОР
	|					КОГДА Облигации.ВалютаНоминала = &Рубль
	|						ТОГДА ВЫБОР
	|								КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
	|										ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративные)
	|								ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Еврооблигации)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте)
	|						КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваЦБ,
	|	ВЫБОР
	|		КОГДА _ЦенныеБумаги.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|			ТОГДА ВЫБОР
	|					КОГДА Облигации.ВалютаНоминала = &Рубль
	|						ТОГДА ВЫБОР
	|								КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
	|										ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон)
	|								ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон)
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон)
	|						КОНЕЦ
	|				КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваКупон
	|ПОМЕСТИТЬ _ЦенныеБумагиИУчетныеАктивы
	|ИЗ
	|	_ЦенныеБумаги КАК _ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО _ЦенныеБумаги.ЦеннаяБумага = Облигации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_УчетныеАктивы.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_УчетныеАктивы.Рынок КАК Рынок,
	|	_УчетныеАктивы.вРЕПО КАК вРЕПО,
	|	_УчетныеАктивы.поРЕПО КАК поРЕПО,
	|	_УчетныеАктивы.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_УчетныеАктивы.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_Настройка.КлассификацияАктиваПоСрочности КАК КлассификацияПоСрочностиЦБ,
	|	_НастройкаКупон.КлассификацияАктиваПоСрочности КАК КлассификацияПоСрочностиКупон,
	|	ВЫБОР
	|		КОГДА _УчетныеАктивы.вРЕПО
	|			ТОГДА _Настройка.СчетУчетаВЗалоге
	|		ИНАЧЕ _Настройка.СчетУчета
	|	КОНЕЦ КАК СчетУчетаЦБ,
	|	ВЫБОР
	|		КОГДА _УчетныеАктивы.вРЕПО
	|			ТОГДА _НастройкаКупон.СчетУчетаВЗалоге
	|		ИНАЧЕ _НастройкаКупон.СчетУчета
	|	КОНЕЦ КАК СчетУчетаКупон,
	|	ВЫБОР
	|		КОГДА _УчетныеАктивы.вРЕПО
	|			ТОГДА _Настройка.СчетУчетаПереоценкиВЗалоге
	|		ИНАЧЕ _Настройка.СчетУчетаПереоценки
	|	КОНЕЦ КАК СчетПереоценкиЦБ,
	|	ВЫБОР
	|		КОГДА _УчетныеАктивы.вРЕПО
	|			ТОГДА _НастройкаКупон.СчетУчетаПереоценкиВЗалоге
	|		ИНАЧЕ _НастройкаКупон.СчетУчетаПереоценки
	|	КОНЕЦ КАК СчетПереоценкиКупон
	|ПОМЕСТИТЬ _ПараметрыЦенныхБумаг
	|ИЗ
	|	_ЦенныеБумагиИУчетныеАктивы КАК _УчетныеАктивы
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Настройка КАК _Настройка
	|		ПО _УчетныеАктивы.ВидАктиваЦБ = _Настройка.УчетныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Настройка КАК _НастройкаКупон
	|		ПО _УчетныеАктивы.ВидАктиваКупон = _НастройкаКупон.УчетныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Партии.Партия КАК Партия,
	|	_Партии.СтрокаПартии КАК СтрокаПартии,
	|	_Партии.КоличествоПриход КАК КоличествоПриход,
	|	_Партии.КоличествоРасход КАК КоличествоРасход,
	|	_Партии.ДатаПокупки КАК ДатаПокупки,
	|	ВЫБОР
	|		КОГДА _Партии.Партия ССЫЛКА Документ.СделкаРЕПО
	|			ТОГДА ВЫБОР
	|					КОГДА УсловияСделокРЕПОСрезПоследних.ДатаОплаты > УсловияСделокРЕПОСрезПоследних.ДатаПоставки
	|						ТОГДА УсловияСделокРЕПОСрезПоследних.ДатаОплаты
	|					ИНАЧЕ УсловияСделокРЕПОСрезПоследних.ДатаПоставки
	|				КОНЕЦ
	|		ИНАЧЕ _Партии.ДатаПогашения
	|	КОНЕЦ КАК ДатаПогашения,
	|	_Партии.ОтчетнаяДата КАК ОтчетнаяДата,
	|	_Партии.ДатаНачалаКупона КАК ДатаНачалаКупона,
	|	_Партии.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_Партии.Рынок КАК Рынок,
	|	_ЦБ.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ЦБ.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_ЦБ.СчетПереоценкиЦБ КАК СчетПереоценкиЦБ,
	|	_ЦБ.СчетПереоценкиКупон КАК СчетПереоценкиКупон,
	|	_ЦБ.СчетУчетаКупон КАК СчетУчетаКупон,
	|	_ЦБ.КлассификацияПоСрочностиЦБ КАК КлассификацияПоСрочностиЦБ,
	|	_ЦБ.КлассификацияПоСрочностиКупон КАК КлассификацияПоСрочностиКупон,
	|	ВЫБОР
	|		КОГДА _ЦБ.СчетПереоценкиЦБ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|			ТОГДА _Партии.СтоимостьПриход
	|		ИНАЧЕ _Партии.СтоимостьПриход + _Партии.СтоимостьПереоценкиПриход
	|	КОНЕЦ КАК СтоимостьПриход,
	|	ВЫБОР
	|		КОГДА _ЦБ.СчетПереоценкиЦБ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|			ТОГДА _Партии.СтоимостьРасход
	|		ИНАЧЕ _Партии.СтоимостьРасход + _Партии.СтоимостьПереоценкиРасход
	|	КОНЕЦ КАК СтоимостьРасход,
	|	_Партии.РезервПодОбесцениеПриход КАК РезервПодОбесцениеПриход,
	|	_Партии.РезервПодОбесцениеРасход КАК РезервПодОбесцениеРасход,
	|	ВЫБОР
	|		КОГДА _ЦБ.СчетУчетаКупон В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И НЕ _Партии.поРЕПО
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _ЦБ.СчетПереоценкиКупон В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|						И НЕ _Партии.поРЕПО
	|					ТОГДА _Партии.СтоимостьКупонаПриход
	|				ИНАЧЕ _Партии.СтоимостьКупонаПриход + _Партии.СтоимостьПереоценкиКупонаПриход
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьКупонаПриход,
	|	ВЫБОР
	|		КОГДА _ЦБ.СчетУчетаКупон В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И НЕ _Партии.поРЕПО
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА _ЦБ.СчетПереоценкиКупон В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|						И НЕ _Партии.поРЕПО
	|					ТОГДА _Партии.СтоимостьКупонаРасход
	|				ИНАЧЕ _Партии.СтоимостьКупонаРасход + _Партии.СтоимостьПереоценкиКупонаРасход
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьКупонаРасход,
	|	_Партии.вРЕПО КАК вРЕПО,
	|	ВЫБОР
	|		КОГДА _Партии.Партия ССЫЛКА Документ.СделкаРЕПО
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ _Партии.поРЕПО
	|	КОНЕЦ КАК поРЕПО,
	|	_Партии.СтоимостьПокупкиСРасходамиПриПокупкеПриход КАК СтоимостьПокупкиСРасходамиПриПокупкеПриход,
	|	_Партии.СтоимостьПокупкиСРасходамиПриПокупкеРасход КАК СтоимостьПокупкиСРасходамиПриПокупкеРасход,
	|	_Партии.ОтчетнаяДатаНаНачалоПериода КАК ОтчетнаяДатаНаНачалоПериода,
	|	_Партии.ПереоценкаКупонаВСтоимостиПриход КАК ПереоценкаКупонаВСтоимостиПриход,
	|	_Партии.ПереоценкаКупонаВСтоимостиРасход КАК ПереоценкаКупонаВСтоимостиРасход,
	|	_Партии.ПереоценкаВСтоимостиПриход КАК ПереоценкаВСтоимостиПриход,
	|	_Партии.ПереоценкаВСтоимостиРасход КАК ПереоценкаВСтоимостиРасход,
	|	_Партии.СтоимостьПереоценкиПриход КАК СтоимостьПереоценкиПриход,
	|	_Партии.СтоимостьПереоценкиРасход КАК СтоимостьПереоценкиРасход,
	|	_Партии.ИндексацияНоминалаЗаВремяВладенияПриход КАК ИндексацияНоминалаЗаВремяВладенияПриход,
	|	_Партии.ИндексацияНоминалаЗаВремяВладенияРасход КАК ИндексацияНоминалаЗаВремяВладенияРасход
	|ПОМЕСТИТЬ _ПартииИСрочность
	|ИЗ
	|	_Партии КАК _Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыЦенныхБумаг КАК _ЦБ
	|		ПО _Партии.ЦеннаяБумага = _ЦБ.ЦеннаяБумага
	|			И _Партии.вРЕПО = _ЦБ.вРЕПО
	|			И _Партии.поРЕПО = _ЦБ.поРЕПО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
	|				&ОкончаниеПериода,
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследних
	|		ПО _Партии.Партия = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииИСрочность.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииИСрочность.Партия КАК Партия,
	|	_ПартииИСрочность.СтрокаПартии КАК СтрокаПартии,
	|	_ПартииИСрочность.вРЕПО КАК вРЕПО,
	|	_ПартииИСрочность.поРЕПО КАК поРЕПО,
	|	_ПартииИСрочность.КоличествоПриход КАК КоличествоПриход,
	|	_ПартииИСрочность.КоличествоРасход КАК КоличествоРасход,
	|	_ПартииИСрочность.ДатаПокупки КАК ДатаПокупки,
	|	_ПартииИСрочность.ДатаПогашения КАК ДатаПогашения,
	|	_ПартииИСрочность.ОтчетнаяДата КАК ОтчетнаяДата,
	|	_ПартииИСрочность.ДатаНачалаКупона КАК ДатаНачалаКупона,
	|	_ПартииИСрочность.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_ПартииИСрочность.Рынок КАК Рынок,
	|	_ПартииИСрочность.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ПартииИСрочность.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_ПартииИСрочность.СчетПереоценкиЦБ КАК СчетПереоценкиЦБ,
	|	_ПартииИСрочность.СчетПереоценкиКупон КАК СчетПереоценкиКупон,
	|	_ПартииИСрочность.КлассификацияПоСрочностиЦБ КАК КлассификацияПоСрочностиЦБ,
	|	_ПартииИСрочность.КлассификацияПоСрочностиКупон КАК КлассификацияПоСрочностиКупон,
	|	_ПартииИСрочность.СтоимостьПриход КАК СтоимостьПриход,
	|	_ПартииИСрочность.СтоимостьРасход КАК СтоимостьРасход,
	|	_ПартииИСрочность.РезервПодОбесцениеПриход КАК РезервПодОбесцениеПриход,
	|	_ПартииИСрочность.РезервПодОбесцениеРасход КАК РезервПодОбесцениеРасход,
	|	_ПартииИСрочность.СтоимостьКупонаПриход КАК СтоимостьКупонаПриход,
	|	_ПартииИСрочность.СтоимостьКупонаРасход КАК СтоимостьКупонаРасход,
	|	ВЫБОР
	|		КОГДА НЕ _ПартииИСрочность.поРЕПО
	|			ТОГДА ВЫБОР
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|							ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|						ТОГДА ИСТИНА
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|						ТОГДА ЛОЖЬ
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДата, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДата
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДата, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|	КОНЕЦ КАК ЦБКраткосрочная,
	|	ВЫБОР
	|		КОГДА НЕ _ПартииИСрочность.поРЕПО
	|			ТОГДА ВЫБОР
	|					КОГДА _ПартииИСрочность.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|						ТОГДА ВЫБОР
	|								КОГДА _ПартииИСрочность.КлассификацияПоСрочностиКупон = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|										ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиКупон = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
	|									ТОГДА ВЫБОР
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|													ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|													ИЛИ _ПартииИСрочность.ДатаПогашения <= _ПартииИСрочность.ОтчетнаяДата
	|												ТОГДА ИСТИНА
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|												ТОГДА ЛОЖЬ
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДата, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДата
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|												ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|												ИЛИ _ПартииИСрочность.ДатаПогашения <= _ПартииИСрочность.ОтчетнаяДата
	|											ТОГДА ИСТИНА
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|											ТОГДА ЛОЖЬ
	|										КОГДА ВЫРАЗИТЬ(_ПартииИСрочность.ЦеннаяБумага КАК Справочник.Облигации).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.Дисконтная)
	|											ТОГДА ЛОЖЬ
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|											ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДата, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|											ТОГДА ВЫБОР
	|													КОГДА _ПартииИСрочность.ДатаПокупки > _ПартииИСрочность.ДатаНачалаКупона
	|														ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|													ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаНачалаКупона, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|												КОНЕЦ
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|											ТОГДА ВЫБОР
	|													КОГДА _ПартииИСрочность.ДатаПокупки > _ПартииИСрочность.ДатаНачалаКупона
	|														ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДата
	|													ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаНачалаКупона, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДата
	|												КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДата, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|	КОНЕЦ КАК КупонКраткосрочный,
	|	_ПартииИСрочность.СтоимостьПокупкиСРасходамиПриПокупкеПриход КАК СтоимостьПокупкиСРасходамиПриПокупкеПриход,
	|	_ПартииИСрочность.СтоимостьПокупкиСРасходамиПриПокупкеРасход КАК СтоимостьПокупкиСРасходамиПриПокупкеРасход,
	|	ВЫБОР
	|		КОГДА НЕ _ПартииИСрочность.поРЕПО
	|			ТОГДА ВЫБОР
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|							ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|						ТОГДА ИСТИНА
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|						ТОГДА ЛОЖЬ
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|					КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|						ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВЫБОР
	|					КОГДА _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода < _ПартииИСрочность.ДатаПокупки
	|						ТОГДА _ПартииИСрочность.ДатаПокупки
	|					ИНАЧЕ _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|				КОНЕЦ, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|	КОНЕЦ КАК ЦБКраткосрочнаяНаНачалоПериода,
	|	ВЫБОР
	|		КОГДА НЕ _ПартииИСрочность.поРЕПО
	|			ТОГДА ВЫБОР
	|					КОГДА _ПартииИСрочность.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|						ТОГДА ВЫБОР
	|								КОГДА _ПартииИСрочность.КлассификацияПоСрочностиКупон = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|										ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиКупон = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПоСрокуПогашенияТела)
	|									ТОГДА ВЫБОР
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|													ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|													ИЛИ _ПартииИСрочность.ДатаПогашения <= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|												ТОГДА ИСТИНА
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|												ТОГДА ЛОЖЬ
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|											КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|												ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ПустаяСсылка)
	|												ИЛИ _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаКраткосрочные)
	|												ИЛИ _ПартииИСрочность.ДатаПогашения <= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|											ТОГДА ИСТИНА
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ВсегдаДолгосрочные)
	|											ТОГДА ЛОЖЬ
	|										КОГДА ВЫРАЗИТЬ(_ПартииИСрочность.ЦеннаяБумага КАК Справочник.Облигации).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.Дисконтная)
	|											ТОГДА ЛОЖЬ
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтОтчетнойДоПогашения)
	|											ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоПогашения)
	|											ТОГДА ВЫБОР
	|													КОГДА _ПартииИСрочность.ДатаПокупки > _ПартииИСрочность.ДатаНачалаКупона
	|														ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|													ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаНачалаКупона, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаОкончанияКупона
	|												КОНЕЦ
	|										КОГДА _ПартииИСрочность.КлассификацияПоСрочностиЦБ = ЗНАЧЕНИЕ(Справочник.КлассификаторАктивовПоСрочности.ОтПокупкиДоОтчетной)
	|											ТОГДА ВЫБОР
	|													КОГДА _ПартииИСрочность.ДатаПокупки > _ПартииИСрочность.ДатаНачалаКупона
	|														ТОГДА ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаПокупки, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|													ИНАЧЕ ДОБАВИТЬКДАТЕ(_ПартииИСрочность.ДатаНачалаКупона, МЕСЯЦ, 12) >= _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|												КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВЫБОР
	|					КОГДА _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода < _ПартииИСрочность.ДатаПокупки
	|						ТОГДА _ПартииИСрочность.ДатаПокупки
	|					ИНАЧЕ _ПартииИСрочность.ОтчетнаяДатаНаНачалоПериода
	|				КОНЕЦ, МЕСЯЦ, 12) >= _ПартииИСрочность.ДатаПогашения
	|	КОНЕЦ КАК КупонКраткосрочныйНаНачалоПериода,
	|	_ПартииИСрочность.ПереоценкаКупонаВСтоимостиПриход КАК ПереоценкаКупонаВСтоимостиПриход,
	|	_ПартииИСрочность.ПереоценкаКупонаВСтоимостиРасход КАК ПереоценкаКупонаВСтоимостиРасход,
	|	_ПартииИСрочность.ПереоценкаВСтоимостиПриход КАК ПереоценкаВСтоимостиПриход,
	|	_ПартииИСрочность.ПереоценкаВСтоимостиРасход КАК ПереоценкаВСтоимостиРасход,
	|	_ПартииИСрочность.СтоимостьПереоценкиПриход КАК СтоимостьПереоценкиПриход,
	|	_ПартииИСрочность.СтоимостьПереоценкиРасход КАК СтоимостьПереоценкиРасход,
	|	_ПартииИСрочность.ИндексацияНоминалаЗаВремяВладенияПриход КАК ИндексацияНоминалаЗаВремяВладенияПриход,
	|	_ПартииИСрочность.ИндексацияНоминалаЗаВремяВладенияРасход КАК ИндексацияНоминалаЗаВремяВладенияРасход
	|ПОМЕСТИТЬ _ИтоговаяТаблица
	|ИЗ
	|	_ПартииИСрочность КАК _ПартииИСрочность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ИтоговаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ИтоговаяТаблица.Партия КАК Партия,
	|	_ИтоговаяТаблица.СтрокаПартии КАК СтрокаПартии,
	|	_ИтоговаяТаблица.вРЕПО КАК вРЕПО,
	|	_ИтоговаяТаблица.поРЕПО КАК поРЕПО,
	|	_ИтоговаяТаблица.КоличествоПриход КАК КоличествоПриход,
	|	_ИтоговаяТаблица.КоличествоРасход КАК КоличествоРасход,
	|	_ИтоговаяТаблица.ДатаПокупки КАК ДатаПокупки,
	|	_ИтоговаяТаблица.ДатаПогашения КАК ДатаПогашения,
	|	_ИтоговаяТаблица.ОтчетнаяДата КАК ОтчетнаяДата,
	|	_ИтоговаяТаблица.ДатаНачалаКупона КАК ДатаНачалаКупона,
	|	_ИтоговаяТаблица.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_ИтоговаяТаблица.Рынок КАК Рынок,
	|	_ИтоговаяТаблица.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ИтоговаяТаблица.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_ИтоговаяТаблица.СчетПереоценкиЦБ КАК СчетПереоценкиЦБ,
	|	_ИтоговаяТаблица.СчетПереоценкиКупон КАК СчетПереоценкиКупон,
	|	_ИтоговаяТаблица.КлассификацияПоСрочностиЦБ КАК КлассификацияПоСрочностиЦБ,
	|	_ИтоговаяТаблица.КлассификацияПоСрочностиКупон КАК КлассификацияПоСрочностиКупон,
	|	_ИтоговаяТаблица.СтоимостьПриход КАК СтоимостьПриход,
	|	_ИтоговаяТаблица.СтоимостьРасход КАК СтоимостьРасход,
	|	_ИтоговаяТаблица.РезервПодОбесцениеПриход КАК РезервПодОбесцениеПриход,
	|	_ИтоговаяТаблица.РезервПодОбесцениеРасход КАК РезервПодОбесцениеРасход,
	|	_ИтоговаяТаблица.СтоимостьКупонаПриход КАК СтоимостьКупонаПриход,
	|	_ИтоговаяТаблица.СтоимостьКупонаРасход КАК СтоимостьКупонаРасход,
	|	_ИтоговаяТаблица.ЦБКраткосрочная КАК ЦБКраткосрочная,
	|	_ИтоговаяТаблица.КупонКраткосрочный КАК КупонКраткосрочный,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПриход - _ИтоговаяТаблица.РезервПодОбесцениеПриход + _ИтоговаяТаблица.СтоимостьКупонаПриход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПриход - _ИтоговаяТаблица.РезервПодОбесцениеПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьКупонаПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК СуммаКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьРасход - _ИтоговаяТаблица.РезервПодОбесцениеРасход + _ИтоговаяТаблица.СтоимостьКупонаРасход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьРасход - _ИтоговаяТаблица.РезервПодОбесцениеРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьКупонаРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК СуммаКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.СтоимостьПриход - _ИтоговаяТаблица.РезервПодОбесцениеПриход + _ИтоговаяТаблица.СтоимостьКупонаПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПриход - _ИтоговаяТаблица.РезервПодОбесцениеПриход + _ИтоговаяТаблица.СтоимостьКупонаПриход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПриход - _ИтоговаяТаблица.РезервПодОбесцениеПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьКупонаПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК СуммаДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.СтоимостьРасход - _ИтоговаяТаблица.РезервПодОбесцениеРасход + _ИтоговаяТаблица.СтоимостьКупонаРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьРасход - _ИтоговаяТаблица.РезервПодОбесцениеРасход + _ИтоговаяТаблица.СтоимостьКупонаРасход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьРасход - _ИтоговаяТаблица.РезервПодОбесцениеРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.СтоимостьКупонаРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК СуммаДолгосрочнаяРасход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиПриход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК ПереоценкаКупонаКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиРасход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК ПереоценкаКупонаКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиПриход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиПриход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК ПереоценкаКупонаДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиРасход
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаКупонаВСтоимостиРасход
	|		КОГДА НЕ _ИтоговаяТаблица.ЦБКраткосрочная
	|				И НЕ _ИтоговаяТаблица.КупонКраткосрочный
	|			ТОГДА 0
	|	КОНЕЦ КАК ПереоценкаКупонаДолгосрочнаяРасход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаВСтоимостиПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПереоценкаВСтоимостиКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаВСтоимостиРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПереоценкаВСтоимостиКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.ПереоценкаВСтоимостиПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаВСтоимостиПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПереоценкаВСтоимостиДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.ПереоценкаВСтоимостиРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ПереоценкаВСтоимостиРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПереоценкаВСтоимостиДолгосрочнаяРасход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПереоценкиПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПереоценкиКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПереоценкиРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПереоценкиКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.СтоимостьПереоценкиПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПереоценкиПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПереоценкиДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.СтоимостьПереоценкиРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.СтоимостьПереоценкиРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПереоценкиДолгосрочнаяРасход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход,
	|	ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяРасход,
	|	_ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияПриход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход,
	|	_ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияРасход - ВЫБОР
	|		КОГДА _ИтоговаяТаблица.ЦБКраткосрочная
	|			ТОГДА _ИтоговаяТаблица.ИндексацияНоминалаЗаВремяВладенияРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяРасход
	|ПОМЕСТИТЬ _Активы
	|ИЗ
	|	_ИтоговаяТаблица КАК _ИтоговаяТаблица";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПериодЗапроса", Новый Граница(КонецДня(ОкончаниеПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	
	Запрос.УстановитьПараметр("Рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	Запрос.Выполнить();
	
	Настройка = МВТ.Таблицы.Найти("_Настройка").ПолучитьДанные().Выгрузить();
	Активы = МВТ.Таблицы.Найти("_Активы").ПолучитьДанные().Выгрузить();
	
	Результат = Новый Структура;
	Результат.Вставить("Настройка", Настройка);
	Результат.Вставить("Активы", Активы);
	
	Возврат Результат;
		
КонецФункции	

Функция ПолучитьНаименованиеФинансовогоВложения(ВидАктиваЦБ, поРЕПО, вРЕПО)
	
	Если поРЕПО ИЛИ вРЕПО Тогда
		Возврат "Депозиты и прочие размещенные средства в кредитных организациях и банках-нерезидентах (обратное РЕПО)";	
		// В будущем может пригодится чтобы различать виды РЕПО. Пока не понятно как если что их делить.
		//Если ВыборкаПартия.вРЕПО И ВыборкаПартия.ПоРЕПО  Тогда
		//	Возврат = "Куплена по РЕПО и продана в РЕПО";
		//ИначеЕсли ВыборкаПартия.вРЕПО И НЕ ВыборкаПартия.ПоРЕПО  Тогда
		//	Возврат = "Продана в РЕПО";
		//ИначеЕсли НЕ ВыборкаПартия.вРЕПО И ВыборкаПартия.ПоРЕПО  Тогда	
		//	Возврат = "Куплена по РЕПО";
		//КонецЕсли;	
	Иначе
		Если ВидАктиваЦБ = Справочники.УчетныеАктивы.Акции ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов Тогда
			Возврат "Долевые ценные бумаги (акции)";
		ИначеЕсли ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииКорпоративные ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.Еврооблигации Тогда
			Возврат "Долговые ценные бумаги (корпоративные облигации)";
		ИначеЕсли ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте Тогда
			Возврат "Долговые ценные бумаги (гос. облигации)";
		ИначеЕсли ВидАктиваЦБ = Справочники.УчетныеАктивы.ДепозитныеВклады Тогда
			Возврат "Депозиты и прочие размещенные средства в кредитных организациях и банках-нерезидентах (депозиты)";
		Иначе
			Возврат "Долговые ценные бумаги";			
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции	

Функция УчитыватьНачальнуюКорректировку(ВидАктиваЦБ, поРЕПО, вРЕПО)
	
	Если поРЕПО ИЛИ вРЕПО Тогда
		Возврат Ложь;	
	Иначе
		Если ВидАктиваЦБ = Справочники.УчетныеАктивы.Акции ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов Тогда
			Возврат Истина; // Татьяна Капашилова 16.04.24 по телефону сказала что по акциям ей тоже необходимо выделять накопленную корректировку
		ИначеЕсли ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииКорпоративные ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.Еврооблигации ИЛИ
			ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные ИЛИ ВидАктиваЦБ = Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;			
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции

Процедура ЗаполнитьЗначениеСвойствСтроки(Приемник, Источник, СтрокаФормат, ИтоговаяСтрока = Ложь)
	
	Если Не ИтоговаяСтрока Тогда
		Приемник.ВидФинансовогоВложения = Источник.ВидФинансовогоВложения;	
	КонецЕсли;	
	Приемник.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод = Формат(Источник.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод, СтрокаФормат);
	Приемник.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод = Формат(Источник.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод, СтрокаФормат);
	Приемник.ПоступилоСтоимостьТекущийГод = Формат(Источник.ПоступилоСтоимостьТекущийГод, СтрокаФормат);
	Приемник.ПоступилоКорректировкаТекущийГод = Формат(Источник.ПоступилоКорректировкаТекущийГод, СтрокаФормат);
	Приемник.СписаноСтоимостьТекущийГод = Формат(Источник.СписаноСтоимостьТекущийГод, СтрокаФормат);
	Приемник.СписаноКорректировкаТекущийГод = Формат(Источник.СписаноКорректировкаТекущийГод, СтрокаФормат);
	Приемник.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод = Формат(Источник.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод, СтрокаФормат);
	Приемник.НакопленнаяКорректировкаНаКонецПериодаТекущийГод = Формат(Источник.НакопленнаяКорректировкаНаКонецПериодаТекущийГод, СтрокаФормат);
	Приемник.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод = Формат(Источник.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод, СтрокаФормат);
	Приемник.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод = Формат(Источник.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод, СтрокаФормат);
	Приемник.ПоступилоСтоимостьПрошлыйГод = Формат(Источник.ПоступилоСтоимостьПрошлыйГод, СтрокаФормат);
	Приемник.ПоступилоКорректировкаПрошлыйГод = Формат(Источник.ПоступилоКорректировкаПрошлыйГод, СтрокаФормат);
	Приемник.СписаноСтоимостьПрошлыйГод = Формат(Источник.СписаноСтоимостьПрошлыйГод, СтрокаФормат);
	Приемник.СписаноКорректировкаПрошлыйГод = Формат(Источник.СписаноКорректировкаПрошлыйГод, СтрокаФормат);
	Приемник.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод = Формат(Источник.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод, СтрокаФормат);
	Приемник.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод = Формат(Источник.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод, СтрокаФормат);
	Приемник.ПроцентыТекущийГод = Формат(Источник.ПроцентыТекущийГод, СтрокаФормат);
	Приемник.ПроцентыПрошлыйГод = Формат(Источник.ПроцентыПрошлыйГод, СтрокаФормат);
	Приемник.ПереклассифицированноТекущийГод = Формат(Источник.ПереклассифицированноТекущийГод, СтрокаФормат);
	Приемник.ПереклассифицированноПрошлыйГод = Формат(Источник.ПереклассифицированноПрошлыйГод, СтрокаФормат);
	
КонецПроцедуры	

Процедура ЗаполнитьЗначениеСвойствСтрокиДЗ(Приемник, Источник, СтрокаФормат, ИтоговаяСтрока = Ложь, ОбщийИтог = Ложь)
	
	Если Не ИтоговаяСтрока Тогда
		Приемник.ВидЗадолженности = Источник.ВидЗадолженности;	
	КонецЕсли;	
	Приемник.ДЗНаНачалоПериодаТекущийГод = Формат(Источник.ДЗНаНачалоПериодаТекущийГод, СтрокаФормат);
	Приемник.ДЗРезервНаНачалоПериодаТекущийГод = Формат(0, СтрокаФормат);
	Приемник.ДЗПоступилоТекущийГод = Формат(Источник.ДЗПоступилоТекущийГод, СтрокаФормат);
	Приемник.ДЗИныеПоступилоТекущийГод = Формат(0, СтрокаФормат);
	Приемник.ДЗСписаноПогашеноТекущийГод = Формат(Источник.ДЗСписаноПогашеноТекущийГод, СтрокаФормат);
	Приемник.ДЗСписаноРасходыТекущийГод = Формат(0, СтрокаФормат);
	Приемник.ДЗСписаноРезервТекущийГод = Формат(0, СтрокаФормат);
	Если Не ОбщийИтог Тогда
		Приемник.ДЗПереклассифицированноТекущийГод = Формат(0, СтрокаФормат);
	КонецЕсли;	
	Приемник.ДЗНаКонецПериодаТекущийГод = Формат(Источник.ДЗНаКонецПериодаТекущийГод, СтрокаФормат);
	Приемник.ДЗРезервНаКонецПериодаТекущийГод = Формат(0, СтрокаФормат);
	
	
	Приемник.ДЗНаНачалоПериодаПрошлыйГод = Формат(Источник.ДЗНаНачалоПериодаПрошлыйГод, СтрокаФормат);
	Приемник.ДЗРезервНаНачалоПериодаПрошлыйГод = Формат(0, СтрокаФормат);
	Приемник.ДЗПоступилоПрошлыйГод = Формат(Источник.ДЗПоступилоПрошлыйГод, СтрокаФормат);
	Приемник.ДЗИныеПоступилоПрошлыйГод = Формат(0, СтрокаФормат);
	Приемник.ДЗСписаноПогашеноПрошлыйГод = Формат(Источник.ДЗСписаноПогашеноПрошлыйГод, СтрокаФормат);
	Приемник.ДЗСписаноРасходыПрошлыйГод = Формат(0, СтрокаФормат);
	Приемник.ДЗСписаноРезервПрошлыйГод = Формат(0, СтрокаФормат);
	Если Не ОбщийИтог Тогда
		Приемник.ДЗПереклассифицированноПрошлыйГод = Формат(0, СтрокаФормат);
	КонецЕсли;	
	Приемник.ДЗНаКонецПериодаПрошлыйГод = Формат(Источник.ДЗНаКонецПериодаПрошлыйГод, СтрокаФормат);
	Приемник.ДЗРезервНаКонецПериодаПрошлыйГод = Формат(0, СтрокаФормат);
	
КонецПроцедуры

Процедура ЗаполнитьЗначениеСвойствСтрокиКЗ(Приемник, Источник, СтрокаФормат, ИтоговаяСтрока = Ложь, ОбщийИтог = Ложь)
	
	Если Не ИтоговаяСтрока Тогда
		Приемник.ВидЗадолженности = Источник.ВидЗадолженности;	
	КонецЕсли;	
	Приемник.КЗНаНачалоПериодаТекущийГод = Формат(Источник.КЗНаНачалоПериодаТекущийГод, СтрокаФормат);
	Приемник.КЗПоступилоТекущийГод = Формат(Источник.КЗПоступилоТекущийГод, СтрокаФормат);
	Приемник.КЗИныеПоступилоТекущийГод = Формат(0, СтрокаФормат);
	Приемник.КЗСписаноПогашеноТекущийГод = Формат(Источник.КЗСписаноПогашеноТекущийГод, СтрокаФормат);
	Приемник.КЗСписаноДоходыТекущийГод = Формат(0, СтрокаФормат);
	Если Не ОбщийИтог Тогда
		Приемник.КЗПереклассифицированноТекущийГод = Формат(0, СтрокаФормат);
	КонецЕсли;	
	Приемник.КЗНаКонецПериодаТекущийГод = Формат(Источник.КЗНаКонецПериодаТекущийГод, СтрокаФормат);
	
	Приемник.КЗНаНачалоПериодаПрошлыйГод = Формат(Источник.КЗНаНачалоПериодаПрошлыйГод, СтрокаФормат);
	Приемник.КЗПоступилоПрошлыйГод = Формат(Источник.КЗПоступилоПрошлыйГод, СтрокаФормат);
	Приемник.КЗИныеПоступилоПрошлыйГод = Формат(0, СтрокаФормат);
	Приемник.КЗСписаноПогашеноПрошлыйГод = Формат(Источник.КЗСписаноПогашеноПрошлыйГод, СтрокаФормат);
	Приемник.КЗСписаноДоходыПрошлыйГод = Формат(0, СтрокаФормат);
	Если Не ОбщийИтог Тогда
		Приемник.КЗПереклассифицированноПрошлыйГод = Формат(0, СтрокаФормат);
	КонецЕсли;	
	Приемник.КЗНаКонецПериодаПрошлыйГод = Формат(Источник.КЗНаКонецПериодаПрошлыйГод, СтрокаФормат);
	
КонецПроцедуры

Процедура ДобавитьСтрокуРасшифровки(СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, ДолгосрочноеВложение, УчитыватьКорректировку, Период, ВыборкаИтог)
	
	СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
	СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = ДолгосрочноеВложение;
	СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ЦеннаяБумага = ВыборкаИтог.ЦеннаяБумага;
	СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Период = Период;
	
	Если ДолгосрочноеВложение Тогда
		СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Стоимость = ВыборкаИтог.СуммаДолгосрочная;
		Если УчитыватьКорректировку Тогда
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимость = (ВыборкаИтог.СуммаДолгосрочная - (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная));
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировка = (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная);
		Иначе
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимость = ВыборкаИтог.СуммаДолгосрочная;
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировка = 0;
		КонецЕсли;	
	Иначе
		СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Стоимость = ВыборкаИтог.СуммаКраткосрочная;
		Если УчитыватьКорректировку Тогда
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимость = (ВыборкаИтог.СуммаКраткосрочная - (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная));
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировка = (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная);
		Иначе
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимость = ВыборкаИтог.СуммаКраткосрочная;
			СтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировка = 0;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура Сформировать(ДокументРезультат, Расшифровка) Экспорт
		
	Если Не (ЗначениеЗаполнено(ЭтотОбъект.ЮрФизЛицо) 
			ИЛИ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан клиент или счет ДУ!");
		Возврат;
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления)) И (Не ЗначениеЗаполнено(ЭтотОбъект.ЮрФизЛицо)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать юр. лицо клиента или счет ДУ!");
		Возврат;
	КонецЕсли;

	// Фиксируем старт операции
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,КлючТекущегоВарианта");
	
	Попытка
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;
	
	ДокументРезультат.Очистить();
	Расшифровка.Очистить();
	
	КолЗнак = ТочностьЕдиницыИзмерения;
	
	Коэффициент = 1;				
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда 
		КодЕИ = "383";
		НазвЕИ = "руб";
		Коэффициент = 1;				
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		КодЕИ = "384";
		НазвЕИ = "тыс. руб";
		Коэффициент = 1000;		
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда 
		КодЕИ = "385";
		НазвЕИ = "млн. руб";
		Коэффициент = 1000000;	
	КонецЕсли;	
	СтрокаФормат = "ЧДЦ="+КолЗнак+"; ЧРГ=' '; ЧН=-; ЧГ=3,0";//"ЧДЦ="+КолЗнак+"; ЧРД=.; ЧРГ=' '; ЧН=-; ЧГ=3,0; ЧО=0";
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = КонецДня(Период.ДатаОкончания);	
	
	//даты прошлого года
	ДатаКонечнаяПрошлыйГод = ДобавитьМесяц(ДатаКонечная, -12);
	ДатаНачальнаяПрошлыйГод = НачалоГода(ДатаКонечнаяПрошлыйГод); 
	
	КС = Новый КвалификаторыСтроки(150);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , , , КС);
	
	КЧ = Новый КвалификаторыЧисла(17,ТочностьЕдиницыИзмерения);;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ОписаниеТиповЧисло = Новый ОписаниеТипов(МассивТипов, , , КЧ);
	
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений = Новый ТаблицаЗначений;
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ВидФинансовогоВложения", ОписаниеТиповСтрока);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ДолгосрочноеВложение", Новый ОписаниеТипов("Булево"));
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("НакопленнаяКорректировкаНаНачалоПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПоступилоСтоимостьТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПоступилоКорректировкаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("СписаноСтоимостьТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("СписаноКорректировкаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("НакопленнаяКорректировкаНаКонецПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПереклассифицированноТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПроцентыТекущийГод", ОписаниеТиповЧисло);
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПоступилоСтоимостьПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПоступилоКорректировкаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("СписаноСтоимостьПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("СписаноКорректировкаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПереклассифицированноПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПроцентыПрошлыйГод", ОписаниеТиповЧисло);
	
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = Новый ТаблицаЗначений;
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ВидФинансовогоВложения", ОписаниеТиповСтрока);
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ДолгосрочноеВложение", Новый ОписаниеТипов("Булево"));
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("Стоимость", ОписаниеТиповЧисло);
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ПервоначальнаяСтоимость", ОписаниеТиповЧисло);
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("НакопленнаяКорректировка", ОписаниеТиповЧисло);
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);
	
	
	Запрос_Активы_Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВнешняяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ВнешняяТаблица.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ВнешняяТаблица.поРЕПО КАК поРЕПО,
	|	_ВнешняяТаблица.вРЕПО КАК вРЕПО,
	|	_ВнешняяТаблица.СуммаКраткосрочная КАК СуммаКраткосрочная,
	|	_ВнешняяТаблица.СуммаДолгосрочная КАК СуммаДолгосрочная,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная
	|ПОМЕСТИТЬ _Активы
	|ИЗ
	|	&ВнешняяТаблица КАК _ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Активы.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Активы.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_Активы.вРЕПО КАК вРЕПО,
	|	_Активы.поРЕПО КАК поРЕПО,
	|	СУММА(_Активы.СуммаКраткосрочная) КАК СуммаКраткосрочная,
	|	СУММА(_Активы.СуммаДолгосрочная) КАК СуммаДолгосрочная,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная) КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная) КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная
	|ИЗ
	|	_Активы КАК _Активы
	|
	|СГРУППИРОВАТЬ ПО
	|	_Активы.ЦеннаяБумага,
	|	_Активы.ВидАктиваЦБ,
	|	_Активы.вРЕПО,
	|	_Активы.поРЕПО";
	
	
	ДанныеСрочностьЦБ = РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаКонечная);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Активы_Текст;
	
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод = (ВыборкаИтог.СуммаКраткосрочная - (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаТекущийГод = (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод = ВыборкаИтог.СуммаКраткосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаТекущийГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаКонечная, ВыборкаИтог);
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод = (ВыборкаИтог.СуммаДолгосрочная - (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаТекущийГод = (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод = ВыборкаИтог.СуммаДолгосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаТекущийГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаКонечная, ВыборкаИтог);
			
		КонецЕсли;
	КонецЦикла;	
	
	ДанныеСрочностьЦБ = РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальная);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Активы_Текст;
	
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод = (ВыборкаИтог.СуммаКраткосрочная - (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод = (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод = ВыборкаИтог.СуммаКраткосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаНачальная, ВыборкаИтог);
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод = (ВыборкаИтог.СуммаДолгосрочная - (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод = (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод = ВыборкаИтог.СуммаДолгосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаНачальная, ВыборкаИтог);
			
		КонецЕсли;
	КонецЦикла;	
	
	ДанныеСрочностьЦБ = РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаКонечнаяПрошлыйГод);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Активы_Текст;
	
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочная - (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод = ВыборкаИтог.СуммаКраткосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаКонечнаяПрошлыйГод, ВыборкаИтог);
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочная - (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод = ВыборкаИтог.СуммаДолгосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаКонечнаяПрошлыйГод, ВыборкаИтог);
			
		КонецЕсли;
	КонецЦикла;		
	
	ДанныеСрочностьЦБ = РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальнаяПрошлыйГод);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Активы_Текст;
	
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочная - (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод = ВыборкаИтог.СуммаКраткосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаНачальнаяПрошлыйГод, ВыборкаИтог);
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочная) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочная - (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочная - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочная)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод = ВыборкаИтог.СуммаДолгосрочная/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод = 0;
			КонецЕсли;	
			
			НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений = ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений.Добавить();
			ДобавитьСтрокуРасшифровки(НоваяСтрокаТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений, ВидФинансовогоВложения, НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение, УчитыватьКорректировку, ДатаНачальнаяПрошлыйГод, ВыборкаИтог);
			
		КонецЕсли;
	КонецЦикла;		
	
	// Просто обороты без переклассификации активов. Долгосрочное/краткосрочное по состоянию на конец периода.
	ДанныеСрочностьЦБ = ПолучитьДолгосрочныеИКраткосрочныеДвиженияАктивов(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная);//РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеДвиженияАктивов(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос_Текст_Обороты = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВнешняяТаблица.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ВнешняяТаблица.поРЕПО КАК поРЕПО,
	|	_ВнешняяТаблица.вРЕПО КАК вРЕПО,
	|	_ВнешняяТаблица.СуммаКраткосрочнаяПриход КАК СуммаКраткосрочнаяПриход,
	|	_ВнешняяТаблица.СуммаКраткосрочнаяРасход КАК СуммаКраткосрочнаяРасход,
	|	_ВнешняяТаблица.СуммаДолгосрочнаяПриход КАК СуммаДолгосрочнаяПриход,
	|	_ВнешняяТаблица.СуммаДолгосрочнаяРасход КАК СуммаДолгосрочнаяРасход,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход,
	|	_ВнешняяТаблица.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход,
	|	_ВнешняяТаблица.ПереоценкаКупонаКраткосрочнаяПриход КАК ПереоценкаКупонаКраткосрочнаяПриход,
	|	_ВнешняяТаблица.ПереоценкаКупонаКраткосрочнаяРасход КАК ПереоценкаКупонаКраткосрочнаяРасход,
	|	_ВнешняяТаблица.ПереоценкаКупонаДолгосрочнаяПриход КАК ПереоценкаКупонаДолгосрочнаяПриход,
	|	_ВнешняяТаблица.ПереоценкаКупонаДолгосрочнаяРасход КАК ПереоценкаКупонаДолгосрочнаяРасход,
	|	_ВнешняяТаблица.ПереоценкаВСтоимостиКраткосрочнаяПриход КАК ПереоценкаВСтоимостиКраткосрочнаяПриход,
	|	_ВнешняяТаблица.ПереоценкаВСтоимостиКраткосрочнаяРасход КАК ПереоценкаВСтоимостиКраткосрочнаяРасход,
	|	_ВнешняяТаблица.ПереоценкаВСтоимостиДолгосрочнаяПриход КАК ПереоценкаВСтоимостиДолгосрочнаяПриход,
	|	_ВнешняяТаблица.ПереоценкаВСтоимостиДолгосрочнаяРасход КАК ПереоценкаВСтоимостиДолгосрочнаяРасход,
	|	_ВнешняяТаблица.СтоимостьПереоценкиКраткосрочнаяПриход КАК СтоимостьПереоценкиКраткосрочнаяПриход,
	|	_ВнешняяТаблица.СтоимостьПереоценкиКраткосрочнаяРасход КАК СтоимостьПереоценкиКраткосрочнаяРасход,
	|	_ВнешняяТаблица.СтоимостьПереоценкиДолгосрочнаяПриход КАК СтоимостьПереоценкиДолгосрочнаяПриход,
	|	_ВнешняяТаблица.СтоимостьПереоценкиДолгосрочнаяРасход КАК СтоимостьПереоценкиДолгосрочнаяРасход,
	|	_ВнешняяТаблица.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход,
	|	_ВнешняяТаблица.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяРасход КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяРасход,
	|	_ВнешняяТаблица.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход,
	|	_ВнешняяТаблица.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяРасход КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяРасход
	|ПОМЕСТИТЬ _Активы
	|ИЗ
	|	&ВнешняяТаблица КАК _ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Активы.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_Активы.вРЕПО КАК вРЕПО,
	|	_Активы.поРЕПО КАК поРЕПО,
	|	СУММА(_Активы.СуммаКраткосрочнаяПриход) КАК СуммаКраткосрочнаяПриход,
	|	СУММА(_Активы.СуммаКраткосрочнаяРасход) КАК СуммаКраткосрочнаяРасход,
	|	СУММА(_Активы.СуммаДолгосрочнаяПриход) КАК СуммаДолгосрочнаяПриход,
	|	СУММА(_Активы.СуммаДолгосрочнаяРасход) КАК СуммаДолгосрочнаяРасход,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход) КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход) КАК СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход) КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход,
	|	СУММА(_Активы.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход) КАК СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход,
	|	СУММА(_Активы.ПереоценкаКупонаКраткосрочнаяПриход) КАК ПереоценкаКупонаКраткосрочнаяПриход,
	|	СУММА(_Активы.ПереоценкаКупонаКраткосрочнаяРасход) КАК ПереоценкаКупонаКраткосрочнаяРасход,
	|	СУММА(_Активы.ПереоценкаКупонаДолгосрочнаяПриход) КАК ПереоценкаКупонаДолгосрочнаяПриход,
	|	СУММА(_Активы.ПереоценкаКупонаДолгосрочнаяРасход) КАК ПереоценкаКупонаДолгосрочнаяРасход,
	|	СУММА(_Активы.ПереоценкаВСтоимостиКраткосрочнаяПриход) КАК ПереоценкаВСтоимостиКраткосрочнаяПриход,
	|	СУММА(_Активы.ПереоценкаВСтоимостиКраткосрочнаяРасход) КАК ПереоценкаВСтоимостиКраткосрочнаяРасход,
	|	СУММА(_Активы.ПереоценкаВСтоимостиДолгосрочнаяПриход) КАК ПереоценкаВСтоимостиДолгосрочнаяПриход,
	|	СУММА(_Активы.ПереоценкаВСтоимостиДолгосрочнаяРасход) КАК ПереоценкаВСтоимостиДолгосрочнаяРасход,
	|	СУММА(_Активы.СтоимостьПереоценкиКраткосрочнаяПриход) КАК СтоимостьПереоценкиКраткосрочнаяПриход,
	|	СУММА(_Активы.СтоимостьПереоценкиКраткосрочнаяРасход) КАК СтоимостьПереоценкиКраткосрочнаяРасход,
	|	СУММА(_Активы.СтоимостьПереоценкиДолгосрочнаяПриход) КАК СтоимостьПереоценкиДолгосрочнаяПриход,
	|	СУММА(_Активы.СтоимостьПереоценкиДолгосрочнаяРасход) КАК СтоимостьПереоценкиДолгосрочнаяРасход,
	|	СУММА(_Активы.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход) КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход,
	|	СУММА(_Активы.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяРасход) КАК ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяРасход,
	|	СУММА(_Активы.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход) КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход,
	|	СУММА(_Активы.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяРасход) КАК ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяРасход
	|ИЗ
	|	_Активы КАК _Активы
	|
	|СГРУППИРОВАТЬ ПО
	|	_Активы.ВидАктиваЦБ,
	|	_Активы.вРЕПО,
	|	_Активы.поРЕПО";
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Текст_Обороты;
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочнаяПриход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			Если УчитыватьКорректировку Тогда
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход - (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход))/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход)/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - (ВыборкаИтог.ПереоценкаВСтоимостиКраткосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиКраткосрочнаяПриход) - (ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = (ВыборкаИтог.ПереоценкаВСтоимостиКраткосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиКраткосрочнаяПриход)/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = (ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход)/Коэффициент;
				
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = ВыборкаИтог.СуммаКраткосрочнаяПриход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = 0;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочнаяРасход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьТекущийГод = -(ВыборкаИтог.СуммаКраткосрочнаяРасход - (ВыборкаИтог.СуммаКраткосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаТекущийГод = -(ВыборкаИтог.СуммаКраткосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьТекущийГод = -ВыборкаИтог.СуммаКраткосрочнаяРасход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаТекущийГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочнаяПриход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			Если УчитыватьКорректировку Тогда
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход - (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход))/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход)/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - (ВыборкаИтог.ПереоценкаВСтоимостиДолгосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиДолгосрочнаяПриход) - (ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = (ВыборкаИтог.ПереоценкаВСтоимостиДолгосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиДолгосрочнаяПриход)/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = (ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод = ВыборкаИтог.СуммаДолгосрочнаяПриход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод = 0;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочнаяРасход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьТекущийГод = -(ВыборкаИтог.СуммаДолгосрочнаяРасход - (ВыборкаИтог.СуммаДолгосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаТекущийГод = -(ВыборкаИтог.СуммаДолгосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьТекущийГод = -ВыборкаИтог.СуммаДолгосрочнаяРасход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаТекущийГод = 0;
			КонецЕсли;	
		КонецЕсли;	
	
	КонецЦикла;
	
	ДанныеСрочностьЦБ = ПолучитьДолгосрочныеИКраткосрочныеДвиженияАктивов(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальнаяПрошлыйГод, ДатаКонечнаяПрошлыйГод);//РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеДвиженияАктивов(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ДатаНачальнаяПрошлыйГод, ДатаКонечнаяПрошлыйГод);
	Активы = ДанныеСрочностьЦБ.Активы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос_Текст_Обороты;
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВидФинансовогоВложения = ПолучитьНаименованиеФинансовогоВложения(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		УчитыватьКорректировку = УчитыватьНачальнуюКорректировку(ВыборкаИтог.ВидАктиваЦБ, ВыборкаИтог.поРЕПО, ВыборкаИтог.вРЕПО);
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочнаяПриход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			Если УчитыватьКорректировку Тогда
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход - (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход))/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяПриход)/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = (ВыборкаИтог.СуммаКраткосрочнаяПриход - (ВыборкаИтог.ПереоценкаВСтоимостиКраткосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиКраткосрочнаяПриход) - (ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = (ВыборкаИтог.ПереоценкаВСтоимостиКраткосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиКраткосрочнаяПриход)/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = (ВыборкаИтог.ПереоценкаКупонаКраткосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияКраткосрочнаяПриход)/Коэффициент;
				
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = ВыборкаИтог.СуммаКраткосрочнаяПриход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = 0;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаКраткосрочнаяРасход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьПрошлыйГод = -(ВыборкаИтог.СуммаКраткосрочнаяРасход - (ВыборкаИтог.СуммаКраткосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаПрошлыйГод = -(ВыборкаИтог.СуммаКраткосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеКраткосрочнаяРасход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьПрошлыйГод = -ВыборкаИтог.СуммаКраткосрочнаяРасход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаПрошлыйГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочнаяПриход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			Если УчитыватьКорректировку Тогда
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход - (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход))/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяПриход)/Коэффициент;
				//НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = (ВыборкаИтог.СуммаДолгосрочнаяПриход - (ВыборкаИтог.ПереоценкаВСтоимостиДолгосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиДолгосрочнаяПриход) - (ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = (ВыборкаИтог.ПереоценкаВСтоимостиДолгосрочнаяПриход + ВыборкаИтог.СтоимостьПереоценкиДолгосрочнаяПриход)/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = (ВыборкаИтог.ПереоценкаКупонаДолгосрочнаяПриход + ВыборкаИтог.ИндексацияНоминалаЗаВремяВладенияДолгосрочнаяПриход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод = ВыборкаИтог.СуммаДолгосрочнаяПриход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод = 0;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод = 0;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаИтог.СуммаДолгосрочнаяРасход) ИЛИ (ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход) Тогда
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = ВидФинансовогоВложения;
			НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Истина;
			Если УчитыватьКорректировку Тогда
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьПрошлыйГод = -(ВыборкаИтог.СуммаДолгосрочнаяРасход - (ВыборкаИтог.СуммаДолгосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход))/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаПрошлыйГод = -(ВыборкаИтог.СуммаДолгосрочнаяРасход - ВыборкаИтог.СтоимостьПокупкиСРасходамиПриПокупкеДолгосрочнаяРасход)/Коэффициент;
			Иначе
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьПрошлыйГод = -ВыборкаИтог.СуммаДолгосрочнаяРасход/Коэффициент;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаПрошлыйГод = 0;
			КонецЕсли;	
		КонецЕсли;	
	
	КонецЦикла;
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Свернуть("ВидФинансовогоВложения,ДолгосрочноеВложение",
	"ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод,НакопленнаяКорректировкаНаНачалоПериодаТекущийГод,ПоступилоСтоимостьТекущийГод,ПоступилоКорректировкаТекущийГод,СписаноСтоимостьТекущийГод,СписаноКорректировкаТекущийГод,ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод,НакопленнаяКорректировкаНаКонецПериодаТекущийГод,ПереклассифицированноТекущийГод,ПроцентыТекущийГод,
	|ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод,НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод,ПоступилоСтоимостьПрошлыйГод,ПоступилоКорректировкаПрошлыйГод,СписаноСтоимостьПрошлыйГод,СписаноКорректировкаПрошлыйГод,ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод,НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод,ПереклассифицированноПрошлыйГод,ПроцентыПрошлыйГод");
	
	// И теперь переводы между долгосрочными и краткосрочными.
	Для Каждого Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений Из ТЗОтчетаНаличие_и_движение_финансовых_вложений Цикл
		Если Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение Тогда
			
			РазностьЗаПериод = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыТекущийГод - Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаТекущийГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаТекущийГод - Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаТекущийГод;
			Если ЗначениеЗаполнено(РазностьЗаПериод) Тогда
				Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноТекущийГод = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноТекущийГод - РазностьЗаПериод;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноТекущийГод = РазностьЗаПериод;
				
			КонецЕсли;	
			
			РазностьЗаПериодПрошлый = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоСтоимостьПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноСтоимостьПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПроцентыПрошлыйГод - Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПоступилоКорректировкаПрошлыйГод + Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.СписаноКорректировкаПрошлыйГод - Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод;
			Если ЗначениеЗаполнено(РазностьЗаПериодПрошлый) Тогда
				Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноПрошлыйГод = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноПрошлыйГод - РазностьЗаПериодПрошлый;
				
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Добавить();	
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения = Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ВидФинансовогоВложения;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ДолгосрочноеВложение = Ложь;
				НоваяСтрока_ТЗОтчетаНаличие_и_движение_финансовых_вложений.ПереклассифицированноПрошлыйГод = РазностьЗаПериодПрошлый;
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Свернуть("ВидФинансовогоВложения,ДолгосрочноеВложение",
	"ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод,НакопленнаяКорректировкаНаНачалоПериодаТекущийГод,ПоступилоСтоимостьТекущийГод,ПоступилоКорректировкаТекущийГод,СписаноСтоимостьТекущийГод,СписаноКорректировкаТекущийГод,ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод,НакопленнаяКорректировкаНаКонецПериодаТекущийГод,ПереклассифицированноТекущийГод,ПроцентыТекущийГод,
	|ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод,НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод,ПоступилоСтоимостьПрошлыйГод,ПоступилоКорректировкаПрошлыйГод,СписаноСтоимостьПрошлыйГод,СписаноКорректировкаПрошлыйГод,ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод,НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод,ПереклассифицированноПрошлыйГод,ПроцентыПрошлыйГод");
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги = ТЗОтчетаНаличие_и_движение_финансовых_вложений.Скопировать();
	ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги.Свернуть("ДолгосрочноеВложение",
	"ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод,НакопленнаяКорректировкаНаНачалоПериодаТекущийГод,ПоступилоСтоимостьТекущийГод,ПоступилоКорректировкаТекущийГод,СписаноСтоимостьТекущийГод,СписаноКорректировкаТекущийГод,ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод,НакопленнаяКорректировкаНаКонецПериодаТекущийГод,ПереклассифицированноТекущийГод,ПроцентыТекущийГод,
	|ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод,НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод,ПоступилоСтоимостьПрошлыйГод,ПоступилоКорректировкаПрошлыйГод,СписаноСтоимостьПрошлыйГод,СписаноКорректировкаПрошлыйГод,ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод,НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод,ПереклассифицированноПрошлыйГод,ПроцентыПрошлыйГод");
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений.Сортировать("ДолгосрочноеВложение ВОЗР, ВидФинансовогоВложения ВОЗР");

	// Макет	
	Макет = ПолучитьМакет("Наличие_и_движение_финансовых_вложений");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаДолгосрочные = Макет.ПолучитьОбласть("ШапкаДолгосрочные");
	ОбластьШапкаКраткосрочные = Макет.ПолучитьОбласть("ШапкаКраткосрочные");
	ОбластьПерваяСтрока = Макет.ПолучитьОбласть("ПерваяСтрока");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПериодТекущийГод = ПредставлениеПериода(ДатаНачальная,ДатаКонечная,"Л=ru_RU; ФП=Истина");
	ПериодПрошлыйГод = ПредставлениеПериода(ДатаНачальнаяПрошлыйГод,ДатаКонечнаяПрошлыйГод,"Л=ru_RU; ФП=Истина");
	
	ОбластьШапкаДолгосрочные.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаДолгосрочные.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьШапкаКраткосрочные.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаКраткосрочные.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПерваяСтрока.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПерваяСтрока.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьСтрока.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьСтрока.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПодвал.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПодвал.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	
	СведенияОбОрганизации = КонсолидированнаяОтчетность.СведенияОЮрФизЛице(СчетДоверительногоУправления, ДатаКонечная);
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьШапка.Параметры.Клиент = СведенияОбОрганизации.ПолноеНаименование;
	ОбластьШапка.Параметры.СчетДоверительногоУправления = "по договору №" + СведенияОбОрганизации.НомерДоговора + ?(ЗначениеЗаполнено(СведенияОбОрганизации.ДатаДоговора), " от " + Формат(СведенияОбОрганизации.ДатаДоговора, "ДФ=dd.MM.yyyy"),"");
	ОбластьШапка.Параметры.ЗаПериод = "за период " + ПредставлениеПериода(ДатаНачальная,ДатаКонечная,"Л=ru_RU; ФП=Истина");
	ОбластьШапка.Параметры.ДоверительныйУправляющийПолноеНаименование = ПараметрыШапки.ДоверительныйУправляющийПолноеНаименование;
	ОбластьШапка.Параметры.ЕдиницаИзмерения = НазвЕИ;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Истина);
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиДолгосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги Из СтрокиДолгосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтроки(ОбластьШапкаДолгосрочные.Параметры, СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаДолгосрочные);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаДолгосрочные);
	КонецЕсли;	
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаНаличие_и_движение_финансовых_вложений.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений Из СтрокиДолгосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтроки(ОбластьПерваяСтрока.Параметры, Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрока);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтроки(ОбластьСтрока.Параметры, Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЕсли;	
	КонецЦикла;	
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Ложь);
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиКраткосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги Из СтрокиКраткосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтроки(ОбластьШапкаКраткосрочные.Параметры, СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаКраткосрочные);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаКраткосрочные);
	КонецЕсли;	
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаНаличие_и_движение_финансовых_вложений.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений Из СтрокиКраткосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтроки(ОбластьПерваяСтрока.Параметры, Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрока);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтроки(ОбластьСтрока.Параметры, Строка_ТЗОтчетаНаличие_и_движение_финансовых_вложений, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЕсли;	
	КонецЦикла;	
	
	ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги.Свернуть("",
	"ПервоначальнаяСтоимостьНаНачалоПериодаТекущийГод,НакопленнаяКорректировкаНаНачалоПериодаТекущийГод,ПоступилоСтоимостьТекущийГод,ПоступилоКорректировкаТекущийГод,СписаноСтоимостьТекущийГод,СписаноКорректировкаТекущийГод,ПервоначальнаяСтоимостьНаКонецПериодаТекущийГод,НакопленнаяКорректировкаНаКонецПериодаТекущийГод,ПереклассифицированноТекущийГод,ПроцентыТекущийГод,
	|ПервоначальнаяСтоимостьНаНачалоПериодаПрошлыйГод,НакопленнаяКорректировкаНаНачалоПериодаПрошлыйГод,ПоступилоСтоимостьПрошлыйГод,ПоступилоКорректировкаПрошлыйГод,СписаноСтоимостьПрошлыйГод,СписаноКорректировкаПрошлыйГод,ПервоначальнаяСтоимостьНаКонецПериодаПрошлыйГод,НакопленнаяКорректировкаНаКонецПериодаПрошлыйГод,ПереклассифицированноПрошлыйГод,ПроцентыПрошлыйГод");
	
	Для Каждого СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги Из ТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги Цикл 
		ЗаполнитьЗначениеСвойствСтроки(ОбластьПодвал.Параметры, СтрокаТЗОтчетаНаличие_и_движение_финансовых_вложений_Итоги, СтрокаФормат, Истина);
	КонецЦикла;	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Расшифровка
	МакетРасшифровка = ПолучитьМакет("Расшифровка");
	ОбластьШапкаРасшифровки = МакетРасшифровка.ПолучитьОбласть("Шапка");
	ОбластьСтрокаРасшифровки = МакетРасшифровка.ПолучитьОбласть("Строка");
	
	ОбластьШапкаЗадолженностьРасшифровки = МакетРасшифровка.ПолучитьОбласть("ШапкаЗадолженность");
	ОбластьСтрокаЗадолженностьРасшифровки = МакетРасшифровка.ПолучитьОбласть("СтрокаЗадолженность");
	
	ЗапросРасшифровка = Новый Запрос;
	ЗапросРасшифровка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВнешняяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ВнешняяТаблица.ВидФинансовогоВложения КАК ВидФинансовогоВложения,
	|	_ВнешняяТаблица.ДолгосрочноеВложение КАК ДолгосрочноеВложение,
	|	_ВнешняяТаблица.Период КАК Период,
	|	_ВнешняяТаблица.Стоимость КАК Стоимость,
	|	_ВнешняяТаблица.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	_ВнешняяТаблица.НакопленнаяКорректировка КАК НакопленнаяКорректировка
	|ПОМЕСТИТЬ _Активы
	|ИЗ
	|	&ВнешняяТаблица КАК _ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Активы.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Активы.ВидФинансовогоВложения КАК ВидФинансовогоВложения,
	|	_Активы.ДолгосрочноеВложение КАК ДолгосрочноеВложение,
	|	_Активы.Период КАК Период,
	|	_Активы.Стоимость КАК Стоимость,
	|	_Активы.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	_Активы.НакопленнаяКорректировка КАК НакопленнаяКорректировка
	|ИЗ
	|	_Активы КАК _Активы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	ДолгосрочноеВложение,
	|	ВидФинансовогоВложения,
	|	ЦеннаяБумага
	|ИТОГИ
	|	СУММА(Стоимость),
	|	СУММА(ПервоначальнаяСтоимость),	
	|	СУММА(НакопленнаяКорректировка)
	|ПО
	|	ОБЩИЕ,
	|	Период,
	|	ДолгосрочноеВложение,
	|	ВидФинансовогоВложения,
	|	ЦеннаяБумага
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросРасшифровка.Параметры.Вставить("ВнешняяТаблица", ТЗРасшифровкаОтчетаНаличие_и_движение_финансовых_вложений);
	
	ВыборкаИтог = ЗапросРасшифровка.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Расшифровка.Вывести(ОбластьШапкаРасшифровки);
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВыборкаПериод = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПериод.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаРасшифровки.Параметры, ВыборкаПериод);
			ОбластьСтрокаРасшифровки.Параметры.ТипДолга = "";
			
			Расшифровка.Вывести(ОбластьСтрокаРасшифровки);
			Расшифровка.НачатьГруппуСтрок("Период", Ложь);
			ВыборкаДолгосрочноеВложение = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДолгосрочноеВложение.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаРасшифровки.Параметры, ВыборкаДолгосрочноеВложение);
				ОбластьСтрокаРасшифровки.Параметры.ТипДолга = ?(ВыборкаДолгосрочноеВложение.ДолгосрочноеВложение, "Долгосрочные", "Краткосрочные");
				
				Расшифровка.Вывести(ОбластьСтрокаРасшифровки);
				Расшифровка.НачатьГруппуСтрок("ДолгосрочноеВложение", Ложь);
				ВыборкаВидФинансовогоВложения = ВыборкаДолгосрочноеВложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаВидФинансовогоВложения.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ОбластьСтрокаРасшифровки.Параметры, ВыборкаВидФинансовогоВложения);
					ОбластьСтрокаРасшифровки.Параметры.ТипДолга = ?(ВыборкаВидФинансовогоВложения.ДолгосрочноеВложение, "Долгосрочные", "Краткосрочные");
					
					Расшифровка.Вывести(ОбластьСтрокаРасшифровки);
					Расшифровка.НачатьГруппуСтрок("ВидФинансовогоВложения", Ложь);
					ВыборкаЦеннаяБумага = ВыборкаВидФинансовогоВложения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЦеннаяБумага.Следующий() Цикл
						ЗаполнитьЗначенияСвойств(ОбластьСтрокаРасшифровки.Параметры, ВыборкаЦеннаяБумага);
						ОбластьСтрокаРасшифровки.Параметры.ТипДолга = ?(ВыборкаЦеннаяБумага.ДолгосрочноеВложение, "Долгосрочные", "Краткосрочные");
						
						Расшифровка.Вывести(ОбластьСтрокаРасшифровки);
						
					КонецЦикла;	
					
					Расшифровка.ЗакончитьГруппуСтрок();
					
				КонецЦикла;	
				
				Расшифровка.ЗакончитьГруппуСтрок();
				
			КонецЦикла;	
			
			Расшифровка.ЗакончитьГруппуСтрок();
			
		КонецЦикла;	
	КонецЦикла;
	
	// Задолженность
	
	// Макет	
	Макет = ПолучитьМакет("Задолженность");
	
	ОбластьШапкаДЗ = Макет.ПолучитьОбласть("ШапкаДЗ");
	ОбластьШапкаДолгосрочныеДЗ = Макет.ПолучитьОбласть("ШапкаДолгосрочныеДЗ");
	ОбластьШапкаКраткосрочныеДЗ = Макет.ПолучитьОбласть("ШапкаКраткосрочныеДЗ");
	ОбластьПерваяСтрокаДЗ = Макет.ПолучитьОбласть("ПерваяСтрокаДЗ");
	ОбластьСтрокаДЗ = Макет.ПолучитьОбласть("СтрокаДЗ");
	ОбластьПодвалДЗ = Макет.ПолучитьОбласть("ПодвалДЗ");
	
	ОбластьШапкаКЗ = Макет.ПолучитьОбласть("ШапкаКЗ");
	ОбластьШапкаДолгосрочныеКЗ = Макет.ПолучитьОбласть("ШапкаДолгосрочныеКЗ");
	ОбластьШапкаКраткосрочныеКЗ = Макет.ПолучитьОбласть("ШапкаКраткосрочныеКЗ");
	ОбластьПерваяСтрокаКЗ = Макет.ПолучитьОбласть("ПерваяСтрокаКЗ");
	ОбластьСтрокаКЗ = Макет.ПолучитьОбласть("СтрокаКЗ");
	ОбластьПодвалКЗ = Макет.ПолучитьОбласть("ПодвалКЗ");
	
	ОбластьШапкаДолгосрочныеДЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаДолгосрочныеДЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьШапкаКраткосрочныеДЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаКраткосрочныеДЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПерваяСтрокаДЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПерваяСтрокаДЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьСтрокаДЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьСтрокаДЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПодвалДЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПодвалДЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	
	ОбластьШапкаДолгосрочныеКЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаДолгосрочныеКЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьШапкаКраткосрочныеКЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьШапкаКраткосрочныеКЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПерваяСтрокаКЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПерваяСтрокаКЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьСтрокаКЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьСтрокаКЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	ОбластьПодвалКЗ.Параметры.ТекущийГод = ПериодТекущийГод;
	ОбластьПодвалКЗ.Параметры.ПрошлыйГод = ПериодПрошлыйГод;
	
	ТЗОтчетаДебиторская_задолженность = Новый ТаблицаЗначений;
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ВидЗадолженности", ОписаниеТиповСтрока);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДолгосрочноеВложение", Новый ОписаниеТипов("Булево"));
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗНаНачалоПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗПоступилоТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗСписаноПогашеноТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗНаКонецПериодаТекущийГод", ОписаниеТиповЧисло);
	
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗНаНачалоПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗПоступилоПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗСписаноПогашеноПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаДебиторская_задолженность.Колонки.Добавить("ДЗНаКонецПериодаПрошлыйГод", ОписаниеТиповЧисло);
	
	ТЗОтчетаКредиторская_задолженность = Новый ТаблицаЗначений;
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("ВидЗадолженности", ОписаниеТиповСтрока);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("ДолгосрочноеВложение", Новый ОписаниеТипов("Булево"));
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗНаНачалоПериодаТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗПоступилоТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗСписаноПогашеноТекущийГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗНаКонецПериодаТекущийГод", ОписаниеТиповЧисло);
	
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗНаНачалоПериодаПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗПоступилоПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗСписаноПогашеноПрошлыйГод", ОписаниеТиповЧисло);
	ТЗОтчетаКредиторская_задолженность.Колонки.Добавить("КЗНаКонецПериодаПрошлыйГод", ОписаниеТиповЧисло);
	
	ЗапросЗадолженность = Новый Запрос;
	ЗапросЗадолженность.Текст = 
		"ВЫБРАТЬ
		|	Основной.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Счета
		|ИЗ
		|	ПланСчетов.Основной КАК Основной
		|ГДЕ
		|	Основной.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиГруппа))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ ВТ_Банки
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ДатаКонечная, &ЗадолженностьПоМетодикеФОГФ) КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.Отрасль.Наименование = ""Банки""
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	БухгалтерскийУчетОстаткиИОбороты.Счет.Наименование КАК СчетНаименование,
		|	ВЫБОР
		|		КОГДА &ЗадолженностьПоМетодикеФОГФ
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокера)
		|						ТОГДА ""Расчеты через брокера""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях)
		|						ТОГДА ""Расчеты с разными дебиторами и кредиторами""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона)
		|						ТОГДА ""Расчеты с разными дебиторами и кредиторами""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
		|						ТОГДА ""Расчеты с разными дебиторами и кредиторами""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам)
		|						ТОГДА ""Проценты по банковским вкладам и МНО""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку)
		|						ТОГДА ""Проценты по банковским вкладам и МНО""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоВознаграждениюУК)
		|						ТОГДА ""Расчеты по вознаграждению управляющего""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.УслугиДепозитария)
		|						ТОГДА ""Расчеты с поставщиками и подрядчиками (услуги банков, аудиторов)""
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщикамиВРублях)
		|							И ВЫРАЗИТЬ(БухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ЮрФизЛица) В
		|								(ВЫБРАТЬ
		|									ВТ_Банки.ЮрФизЛицо
		|								ИЗ
		|									ВТ_Банки КАК ВТ_Банки)
		|						ТОГДА ""Расчеты с поставщиками и подрядчиками (услуги банков, аудиторов)""
		|					ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Счет.Наименование
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
		|					ТОГДА ""Проценты начисленные по РЕПО""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку)
		|					ТОГДА ""Проценты по банковским вкладам и МНО""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам)
		|					ТОГДА ""Проценты по банковским вкладам и МНО""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумаг))
		|					ТОГДА ""Купонный доход по облигациям""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона)
		|					ТОГДА ""Купонный доход по облигациям""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупонаЕврооблигации)
		|					ТОГДА ""Купонный доход по облигациям""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
		|					ТОГДА ""Прочие расчеты с дебиторами и кредиторами""
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщикамиВРублях)
		|					ТОГДА ""Расчеты с поставщиками и подрядчиками (услуги банков, аудиторов)""
		|				ИНАЧЕ БухгалтерскийУчетОстаткиИОбороты.Счет.Наименование
		|			КОНЕЦ
		|	КОНЕЦ КАК НаименованиеЗадолженности,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт КАК СуммаНачальныйРазвернутыйОстатокДт,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт КАК СуммаНачальныйРазвернутыйОстатокКт,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК СуммаКонечныйРазвернутыйОстатокДт,
		|	БухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК СуммаКонечныйРазвернутыйОстатокКт,
		|	ВЫБОР
		|		КОГДА &ЗадолженностьПоМетодикеФОГФ
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокера)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НалоговыеНачисленияПоРЕПО)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоМинимальномуНеснижаемомуОстатку)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЭтоДебиторскаяЗадолженность,
		|	ВЫБОР
		|		КОГДА &ЗадолженностьПоМетодикеФОГФ
		|			ТОГДА ВЫБОР
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоВознаграждениюУК)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.УслугиДепозитария)
		|						ТОГДА ИСТИНА
		|					КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщикамиВРублях)
		|							И ВЫРАЗИТЬ(БухгалтерскийУчетОстаткиИОбороты.Субконто1 КАК Справочник.ЮрФизЛица) В
		|								(ВЫБРАТЬ
		|									ВТ_Банки.ЮрФизЛицо
		|								ИЗ
		|									ВТ_Банки КАК ВТ_Банки)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА БухгалтерскийУчетОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками))
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЭтоКредиторскаяЗадолженность
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.ОстаткиИОбороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Период,
		|			,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ВТ_Счета.Ссылка
		|				ИЗ
		|					ВТ_Счета КАК ВТ_Счета),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итоговая.Счет КАК Счет,
		|	ВТ_Итоговая.СчетНаименование КАК СчетНаименование,
		|	ВТ_Итоговая.НаименованиеЗадолженности КАК НаименованиеЗадолженности,
		|	СУММА(ВТ_Итоговая.СуммаНачальныйРазвернутыйОстатокДт) КАК СуммаНачальныйРазвернутыйОстатокДт,
		|	СУММА(ВТ_Итоговая.СуммаНачальныйРазвернутыйОстатокКт) КАК СуммаНачальныйРазвернутыйОстатокКт,
		|	СУММА(ВТ_Итоговая.СуммаОборотДт) КАК СуммаОборотДт,
		|	СУММА(ВТ_Итоговая.СуммаОборотКт) КАК СуммаОборотКт,
		|	СУММА(ВТ_Итоговая.СуммаКонечныйРазвернутыйОстатокДт) КАК СуммаКонечныйРазвернутыйОстатокДт,
		|	СУММА(ВТ_Итоговая.СуммаКонечныйРазвернутыйОстатокКт) КАК СуммаКонечныйРазвернутыйОстатокКт,
		|	ВТ_Итоговая.ЭтоДебиторскаяЗадолженность КАК ЭтоДебиторскаяЗадолженность,
		|	ВТ_Итоговая.ЭтоКредиторскаяЗадолженность КАК ЭтоКредиторскаяЗадолженность
		|ИЗ
		|	ВТ_Итоговая КАК ВТ_Итоговая
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итоговая.Счет,
		|	ВТ_Итоговая.СчетНаименование,
		|	ВТ_Итоговая.НаименованиеЗадолженности,
		|	ВТ_Итоговая.ЭтоДебиторскаяЗадолженность,
		|	ВТ_Итоговая.ЭтоКредиторскаяЗадолженность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	СчетНаименование
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросЗадолженность.УстановитьПараметр("ДатаКонечная", ДатаКонечная);
	ЗапросЗадолженность.УстановитьПараметр("ДатаНачальная", ДатаНачальная);
	ЗапросЗадолженность.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросЗадолженность.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЗапросЗадолженность.УстановитьПараметр("ЗадолженностьПоМетодикеФОГФ", ЭтотОбъект.ЗадолженностьПоМетодикеФОГФ);
	
	РезультатЗапросаЗадолженность = ЗапросЗадолженность.Выполнить();
	
	ВыборкаДетальныеЗаписиЗадолженность = РезультатЗапросаЗадолженность.Выбрать();
	
	ОбластьШапкаЗадолженностьРасшифровки.Параметры.НаименованиеПериода = ПериодТекущийГод;
	Расшифровка.Вывести(ОбластьШапкаЗадолженностьРасшифровки);
	Расшифровка.НачатьГруппуСтрок("Период", Ложь);
	
	Пока ВыборкаДетальныеЗаписиЗадолженность.Следующий() Цикл
		Если ВыборкаДетальныеЗаписиЗадолженность.ЭтоДебиторскаяЗадолженность Тогда
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность = ТЗОтчетаДебиторская_задолженность.Добавить();	
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ВидЗадолженности = ВыборкаДетальныеЗаписиЗадолженность.НаименованиеЗадолженности;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДолгосрочноеВложение = Ложь;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗНаНачалоПериодаТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаНачальныйРазвернутыйОстатокДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗПоступилоТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗСписаноПогашеноТекущийГод = -ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗНаКонецПериодаТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаКонечныйРазвернутыйОстатокДт/Коэффициент;
		ИначеЕсли ВыборкаДетальныеЗаписиЗадолженность.ЭтоКредиторскаяЗадолженность Тогда
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность = ТЗОтчетаКредиторская_задолженность.Добавить();	
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.ВидЗадолженности = ВыборкаДетальныеЗаписиЗадолженность.НаименованиеЗадолженности;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.ДолгосрочноеВложение = Ложь;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗНаНачалоПериодаТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаНачальныйРазвернутыйОстатокКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗПоступилоТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗСписаноПогашеноТекущийГод = -ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗНаКонецПериодаТекущийГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаКонечныйРазвернутыйОстатокКт/Коэффициент;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаЗадолженностьРасшифровки.Параметры, ВыборкаДетальныеЗаписиЗадолженность);
		Расшифровка.Вывести(ОбластьСтрокаЗадолженностьРасшифровки);
	КонецЦикла;
	Расшифровка.ЗакончитьГруппуСтрок();
	
	ЗапросЗадолженность.УстановитьПараметр("ДатаКонечная", ДатаКонечнаяПрошлыйГод);
	ЗапросЗадолженность.УстановитьПараметр("ДатаНачальная", ДатаНачальнаяПрошлыйГод);
	ЗапросЗадолженность.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	ЗапросЗадолженность.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапросаЗадолженность = ЗапросЗадолженность.Выполнить();
	
	ВыборкаДетальныеЗаписиЗадолженность = РезультатЗапросаЗадолженность.Выбрать();
	
	ОбластьШапкаЗадолженностьРасшифровки.Параметры.НаименованиеПериода = ПериодПрошлыйГод;
	Расшифровка.Вывести(ОбластьШапкаЗадолженностьРасшифровки);
	Расшифровка.НачатьГруппуСтрок("Период", Ложь);
	
	Пока ВыборкаДетальныеЗаписиЗадолженность.Следующий() Цикл
		Если ВыборкаДетальныеЗаписиЗадолженность.ЭтоДебиторскаяЗадолженность Тогда
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность = ТЗОтчетаДебиторская_задолженность.Добавить();	
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ВидЗадолженности = ВыборкаДетальныеЗаписиЗадолженность.НаименованиеЗадолженности;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДолгосрочноеВложение = Ложь;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗНаНачалоПериодаПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаНачальныйРазвернутыйОстатокДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗПоступилоПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗСписаноПогашеноПрошлыйГод = -ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаДебиторская_задолженность.ДЗНаКонецПериодаПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаКонечныйРазвернутыйОстатокДт/Коэффициент;
		ИначеЕсли ВыборкаДетальныеЗаписиЗадолженность.ЭтоКредиторскаяЗадолженность Тогда
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность = ТЗОтчетаКредиторская_задолженность.Добавить();	
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.ВидЗадолженности = ВыборкаДетальныеЗаписиЗадолженность.НаименованиеЗадолженности;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.ДолгосрочноеВложение = Ложь;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗНаНачалоПериодаПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаНачальныйРазвернутыйОстатокКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗПоступилоПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотКт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗСписаноПогашеноПрошлыйГод = -ВыборкаДетальныеЗаписиЗадолженность.СуммаОборотДт/Коэффициент;
			НоваяСтрока_ТЗОтчетаКредиторская_задолженность.КЗНаКонецПериодаПрошлыйГод = ВыборкаДетальныеЗаписиЗадолженность.СуммаКонечныйРазвернутыйОстатокКт/Коэффициент;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаЗадолженностьРасшифровки.Параметры, ВыборкаДетальныеЗаписиЗадолженность);
		Расшифровка.Вывести(ОбластьСтрокаЗадолженностьРасшифровки);
	КонецЦикла;
	Расшифровка.ЗакончитьГруппуСтрок();
	
	ТЗОтчетаДебиторская_задолженность.Свернуть("ВидЗадолженности,ДолгосрочноеВложение",
	"ДЗНаНачалоПериодаТекущийГод,ДЗПоступилоТекущийГод,ДЗСписаноПогашеноТекущийГод,ДЗНаКонецПериодаТекущийГод,
	|ДЗНаНачалоПериодаПрошлыйГод,ДЗПоступилоПрошлыйГод,ДЗСписаноПогашеноПрошлыйГод,ДЗНаКонецПериодаПрошлыйГод");
	
	ТЗОтчетаДебиторская_задолженность_Итоги = ТЗОтчетаДебиторская_задолженность.Скопировать();
	ТЗОтчетаДебиторская_задолженность_Итоги.Свернуть("ДолгосрочноеВложение",
	"ДЗНаНачалоПериодаТекущийГод,ДЗПоступилоТекущийГод,ДЗСписаноПогашеноТекущийГод,ДЗНаКонецПериодаТекущийГод,
	|ДЗНаНачалоПериодаПрошлыйГод,ДЗПоступилоПрошлыйГод,ДЗСписаноПогашеноПрошлыйГод,ДЗНаКонецПериодаПрошлыйГод");
	
	ТЗОтчетаДебиторская_задолженность.Сортировать("ДолгосрочноеВложение ВОЗР, ВидЗадолженности ВОЗР");
	
	
	ТЗОтчетаКредиторская_задолженность.Свернуть("ВидЗадолженности,ДолгосрочноеВложение",
	"КЗНаНачалоПериодаТекущийГод,КЗПоступилоТекущийГод,КЗСписаноПогашеноТекущийГод,КЗНаКонецПериодаТекущийГод,
	|КЗНаНачалоПериодаПрошлыйГод,КЗПоступилоПрошлыйГод,КЗСписаноПогашеноПрошлыйГод,КЗНаКонецПериодаПрошлыйГод");
	
	ТЗОтчетаКредиторская_задолженность_Итоги = ТЗОтчетаКредиторская_задолженность.Скопировать();
	ТЗОтчетаКредиторская_задолженность_Итоги.Свернуть("ДолгосрочноеВложение",
	"КЗНаНачалоПериодаТекущийГод,КЗПоступилоТекущийГод,КЗСписаноПогашеноТекущийГод,КЗНаКонецПериодаТекущийГод,
	|КЗНаНачалоПериодаПрошлыйГод,КЗПоступилоПрошлыйГод,КЗСписаноПогашеноПрошлыйГод,КЗНаКонецПериодаПрошлыйГод");
	
	ТЗОтчетаКредиторская_задолженность.Сортировать("ДолгосрочноеВложение ВОЗР, ВидЗадолженности ВОЗР");
	
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ДокументРезультат.Вывести(ОбластьШапкаДЗ);
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Истина);
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаДебиторская_задолженность_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиДолгосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаДебиторская_задолженность_Итоги Из СтрокиДолгосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьШапкаДолгосрочныеДЗ.Параметры, СтрокаТЗОтчетаДебиторская_задолженность_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаДолгосрочныеДЗ);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаДолгосрочныеДЗ);
	КонецЕсли;	
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаДебиторская_задолженность.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаДебиторская_задолженность Из СтрокиДолгосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьПерваяСтрокаДЗ.Параметры, Строка_ТЗОтчетаДебиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрокаДЗ);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьСтрокаДЗ.Параметры, Строка_ТЗОтчетаДебиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрокаДЗ);
		КонецЕсли;	
	КонецЦикла;	
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Ложь);
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаДебиторская_задолженность_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиКраткосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаДебиторская_задолженность_Итоги Из СтрокиКраткосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьШапкаКраткосрочныеДЗ.Параметры, СтрокаТЗОтчетаДебиторская_задолженность_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаКраткосрочныеДЗ);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаКраткосрочныеДЗ);
	КонецЕсли;	
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаДебиторская_задолженность.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаДебиторская_задолженность Из СтрокиКраткосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьПерваяСтрокаДЗ.Параметры, Строка_ТЗОтчетаДебиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрокаДЗ);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьСтрокаДЗ.Параметры, Строка_ТЗОтчетаДебиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрокаДЗ);
		КонецЕсли;	
	КонецЦикла;	
	
	ТЗОтчетаДебиторская_задолженность_Итоги.Свернуть("",
	"ДЗНаНачалоПериодаТекущийГод,ДЗПоступилоТекущийГод,ДЗСписаноПогашеноТекущийГод,ДЗНаКонецПериодаТекущийГод,
	|ДЗНаНачалоПериодаПрошлыйГод,ДЗПоступилоПрошлыйГод,ДЗСписаноПогашеноПрошлыйГод,ДЗНаКонецПериодаПрошлыйГод");
	
	Для Каждого СтрокаТЗОтчетаДебиторская_задолженность_Итоги Из ТЗОтчетаДебиторская_задолженность_Итоги Цикл 
		ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьПодвалДЗ.Параметры, СтрокаТЗОтчетаДебиторская_задолженность_Итоги, СтрокаФормат, Истина, Истина);
	КонецЦикла;	
	ДокументРезультат.Вывести(ОбластьПодвалДЗ);
	
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ДокументРезультат.Вывести(ОбластьШапкаКЗ);
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Истина);
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаКредиторская_задолженность_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиДолгосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаКредиторская_задолженность_Итоги Из СтрокиДолгосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтрокиДЗ(ОбластьШапкаДолгосрочныеКЗ.Параметры, СтрокаТЗОтчетаКредиторская_задолженность_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаДолгосрочныеКЗ);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаДолгосрочныеКЗ);
	КонецЕсли;	
	
	СтрокиДолгосрочноеВложение = ТЗОтчетаКредиторская_задолженность.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаКредиторская_задолженность Из СтрокиДолгосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьПерваяСтрокаКЗ.Параметры, Строка_ТЗОтчетаКредиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрокаКЗ);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьСтрокаКЗ.Параметры, Строка_ТЗОтчетаКредиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрокаКЗ);
		КонецЕсли;	
	КонецЦикла;	
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ДолгосрочноеВложение", Ложь);
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаКредиторская_задолженность_Итоги.НайтиСтроки(ОтборСтрок);
	Если СтрокиКраткосрочноеВложение.Количество() > 0 Тогда
		Для Каждого СтрокаТЗОтчетаКредиторская_задолженность_Итоги Из СтрокиКраткосрочноеВложение Цикл 
			ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьШапкаКраткосрочныеКЗ.Параметры, СтрокаТЗОтчетаКредиторская_задолженность_Итоги, СтрокаФормат, Истина);
			ДокументРезультат.Вывести(ОбластьШапкаКраткосрочныеКЗ);
		КонецЦикла;	
	Иначе
		ДокументРезультат.Вывести(ОбластьШапкаКраткосрочныеКЗ);
	КонецЕсли;	
	
	СтрокиКраткосрочноеВложение = ТЗОтчетаКредиторская_задолженность.НайтиСтроки(ОтборСтрок);
	ЭтоПерваяСтрока = Истина;
	Для Каждого Строка_ТЗОтчетаКредиторская_задолженность Из СтрокиКраткосрочноеВложение Цикл 
		Если ЭтоПерваяСтрока Тогда
			ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьПерваяСтрокаКЗ.Параметры, Строка_ТЗОтчетаКредиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьПерваяСтрокаКЗ);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьСтрокаКЗ.Параметры, Строка_ТЗОтчетаКредиторская_задолженность, СтрокаФормат);
			ДокументРезультат.Вывести(ОбластьСтрокаКЗ);
		КонецЕсли;	
	КонецЦикла;	
	
	ТЗОтчетаКредиторская_задолженность_Итоги.Свернуть("",
	"КЗНаНачалоПериодаТекущийГод,КЗПоступилоТекущийГод,КЗСписаноПогашеноТекущийГод,КЗНаКонецПериодаТекущийГод,
	|КЗНаНачалоПериодаПрошлыйГод,КЗПоступилоПрошлыйГод,КЗСписаноПогашеноПрошлыйГод,КЗНаКонецПериодаПрошлыйГод");
	
	Для Каждого СтрокаТЗОтчетаКредиторская_задолженность_Итоги Из ТЗОтчетаКредиторская_задолженность_Итоги Цикл 
		ЗаполнитьЗначениеСвойствСтрокиКЗ(ОбластьПодвалКЗ.Параметры, СтрокаТЗОтчетаКредиторская_задолженность_Итоги, СтрокаФормат, Истина, Истина);
	КонецЦикла;	
	ДокументРезультат.Вывести(ОбластьПодвалКЗ);
	
	// Подписи	
	Если Не ЗадолженностьПоМетодикеФОГФ Тогда
		// По ФОГФ Попросили другой подвал
		СтруктураДанныхКонтактногоЛица = Неопределено;
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		
		ПараметрыВыводаПодписей = Новый Структура;
		ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
		ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
		
		Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
			ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
			ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
			ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
		КонецЕсли; 
		
		РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	Иначе
		ОбластьПодвалПодписи = Макет.ПолучитьОбласть("ПодписиФОГФ");
		//параметры подписей
		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда
			СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;
		Иначе
			СтруктураДанныхРуководитель = Неопределено;
		КонецЕсли;	
		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух") Тогда
			СтруктураДанныхГлавбух = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлавбух;
		Иначе	
			СтруктураДанныхГлавбух = Неопределено;
		КонецЕсли;	
		
		
		Если СтруктураДанныхРуководитель <> Неопределено Тогда 
			ОбластьПодвалПодписи.Параметры.ДолжностьРуководитель = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";
			ОбластьПодвалПодписи.Параметры.Руководитель = СтруктураДанныхРуководитель.КонтактноеЛицо;
		КонецЕсли;
		Если СтруктураДанныхГлавбух <> Неопределено Тогда 	
			ОбластьПодвалПодписи.Параметры.ДолжностьГлавбух = СтруктураДанныхГлавбух.Должность;
			ОбластьПодвалПодписи.Параметры.ГлавБух = СтруктураДанныхГлавбух.КонтактноеЛицо;
		КонецЕсли;	
		
		ДокументРезультат.Вывести(ОбластьПодвалПодписи);
				
	КонецЕсли;
	
	// Для регулировки автовысоты в подписи
	Для Сч = 1 По ДокументРезультат.ВысотаТаблицы Цикл
		Если ДокументРезультат.Область(Сч,,Сч,).АвтоВысотаСтроки Тогда
			ДокументРезультат.Область(Сч,,Сч,).ВысотаСтроки	= 0;	
		КонецЕсли;	
	КонецЦикла;	
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
КонецПроцедуры

#Область Дополнительные_функции

Процедура ОчиститьПараметрыОбласти(Область)
	Для Параметр = 0 По Область.Параметры.Количество() - 1 Цикл
		Область.Параметры[Параметр] = Неопределено;
	КонецЦикла; 
КонецПроцедуры

Процедура УстановитьПараметрОбласти(Область, Параметр, Значение)
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Область.Параметры, Параметр) Тогда
		Область.Параметры[Параметр] = Значение;	 	
	КонецЕсли;
КонецПроцедуры

Функция ПрочитатьПараметрОбласти(Область, Параметр)	
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(Область.Параметры, Параметр) Тогда
		Возврат Область.Параметры[Параметр];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти