&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начальное заполнение формы
	Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Дата		= ТекущаяДата();
	ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
	ЗаполнитьПросроченныеРаспоряженияМНОНаСервере();  
	
	Если РаботаСДокументами.ИспользуетсяВыгрузкаПлатежныхПорученийВКлиентБанк(Организация, Дата) Тогда
		Элементы.РаспоряженияНаДепозитыКомандаСоздатьРазмещенияДепозитов.Заголовок	= "Создать депозиты";
		Элементы.ГруппаСозданныеРазмещения.Заголовок								= "Депозиты";
		Элементы.СозданныеРазмещенияДепозитовРазмещенияДепозиты.Заголовок			= "Депозит/Распоряжение";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеСозданныеИсполненияНаСервере()

	ЗаполнитьПлановыеИсполненияНаСервере();
	ЗаполнитьСозданныеИсполненияНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеИсполненияНаСервере()

	ЭтаФорма.РаспоряженияНаМНО.Очистить();
	ЭтаФорма.РаспоряженияНаДепозиты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Основание КАК Распоряжение
		|ПОМЕСТИТЬ _ИсключаемыеРаспоряженияМНО
		|ИЗ
		|	Документ.МНО КАК Документ
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) = &Дата
		|	И НЕ Документ.ПометкаУдаления
		|	И Документ.Организация = &Организация
		|	И (&БезОтбораПоБанку
		|			ИЛИ Документ.РасчетныйСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмещениеКредитногоИнструмента.Основание КАК Распоряжение
		|ПОМЕСТИТЬ _ИсключаемыеРаспоряженияНаДепозиты
		|ИЗ
		|	Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(РазмещениеКредитногоИнструмента.Дата, ДЕНЬ) >= &Дата
		|	И НЕ РазмещениеКредитногоИнструмента.ПометкаУдаления
		|	И РазмещениеКредитногоИнструмента.Организация = &Организация
		|	И (&БезОтбораПоБанку
		|			ИЛИ РазмещениеКредитногоИнструмента.РасчетныйСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Документ.Ссылка КАК Документ,
		|	Документ.ВидОперации КАК ВидОперации,
		|	Документ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Документ.РасчетныйСчет КАК РасчетныйСчет,
		|	Документ.Процент КАК Процент,
		|	Документ.ДатаВозврата КАК ДатаВозврата,
		|	Документ.ДатаРазмещения КАК ДатаРазмещения,
		|	Документ.Сумма КАК Сумма,
		|	Документ.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА Документ.РасчетныйСчет.Банк
		|		КОГДА Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА Документ.Банк
		|	КОНЕЦ КАК Банк,
		|	ВЫБОР
		|		КОГДА Документ.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеДокумента,
		|	НомераПодтверждений.Номер КАК НомерПодтверждения,
		|	Документ.Биржевой КАК Биржевой
		|ПОМЕСТИТЬ _Распоряжения
		|ИЗ
		|	Документ.Распоряжение КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИсключаемыеРаспоряженияМНО КАК _ИсключаемыеРаспоряженияМНО
		|		ПО Документ.Ссылка = _ИсключаемыеРаспоряженияМНО.Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИсключаемыеРаспоряженияНаДепозиты КАК _ИсключаемыеРаспоряженияНаДепозиты
		|		ПО Документ.Ссылка = _ИсключаемыеРаспоряженияНаДепозиты.Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераПодтверждений
		|		ПО Документ.Ссылка = НомераПодтверждений.Объект
		|			И (НомераПодтверждений.Организация = &Организация)
		|			И (НомераПодтверждений.ВидНумерации В (ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.ПодтвержденияСбербанка), ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.ПодтвержденияВТБ), ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО)))
		|ГДЕ
		|	(Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|				И НАЧАЛОПЕРИОДА(Документ.Дата, ДЕНЬ) = &Дата
		|			ИЛИ Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|				И НАЧАЛОПЕРИОДА(Документ.ДатаРазмещения, ДЕНЬ) >= &Дата)
		|	И НЕ Документ.ПометкаУдаления
		|	И Документ.Организация = &Организация
		|	И _ИсключаемыеРаспоряженияМНО.Распоряжение ЕСТЬ NULL
		|	И _ИсключаемыеРаспоряженияНаДепозиты.Распоряжение ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиАкцептованияОперацийСрезПоследних.Организация КАК Организация,
		|	НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиАкцептованияОперацийСрезПоследних.ВидАкцепта КАК ВидАкцепта,
		|	_Распоряжения.Документ КАК Документ,
		|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет
		|ПОМЕСТИТЬ _НастройкиАкцептования
		|ИЗ
		|	РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Распоряжения.СчетДоверительногоУправления
		|					ИЗ
		|						_Распоряжения КАК _Распоряжения
		|					ГДЕ
		|						_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|				И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО)) КАК НастройкиАкцептованияОперацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Распоряжения КАК _Распоряжения
		|		ПО (_Распоряжения.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления)
		|			И (_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|ГДЕ
		|	НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиАкцептования.Документ КАК Документ,
		|	АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
		|		ИЛИ АкцептованиеОперацийСрезПоследних.Срок <> ДАТАВРЕМЯ(1, 1, 1)
		|			И АкцептованиеОперацийСрезПоследних.Срок <= &Дата КАК ТребуетсяАкцепт
		|ПОМЕСТИТЬ _УсловияАкцептования
		|ИЗ
		|	_НастройкиАкцептования КАК _НастройкиАкцептования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО)
		|					И Операция В
		|						(ВЫБРАТЬ
		|							_НастройкиАкцептования.Документ
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования
		|				
		|						ОБЪЕДИНИТЬ
		|				
		|						ВЫБРАТЬ
		|							_НастройкиАкцептования.РасчетныйСчет
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования)) КАК АкцептованиеОперацийСрезПоследних
		|		ПО _НастройкиАкцептования.Организация = АкцептованиеОперацийСрезПоследних.Организация
		|			И _НастройкиАкцептования.ВидАкцепта = АкцептованиеОперацийСрезПоследних.ВидАкцепта
		|			И (_НастройкиАкцептования.Документ = АкцептованиеОперацийСрезПоследних.Операция
		|				ИЛИ _НастройкиАкцептования.РасчетныйСчет = АкцептованиеОперацийСрезПоследних.Операция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НЕ ЕСТЬNULL(_УсловияАкцептования.ТребуетсяАкцепт, ЛОЖЬ) КАК Флажок,
		|	_Распоряжения.Документ КАК Документ,
		|	_Распоряжения.НомерПодтверждения КАК НомерПодтверждения,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет,
		|	_Распоряжения.Процент КАК Процент,
		|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.Валюта КАК Валюта,
		|	_Распоряжения.СостояниеДокумента КАК СостояниеДокумента,
		|	ЕСТЬNULL(_УсловияАкцептования.ТребуетсяАкцепт, ЛОЖЬ) КАК ТребуетсяАкцепт
		|ПОМЕСТИТЬ _РаспоряженияНаМНО
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАкцептования КАК _УсловияАкцептования
		|		ПО _Распоряжения.Документ = _УсловияАкцептования.Документ
		|ГДЕ
		|	_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|	И (&БезОтбораПоБанку
		|			ИЛИ _Распоряжения.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Распоряжения.Банк В (&МассивБанков)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КартинкаПечать,
		|	_Распоряжения.ДатаРазмещения = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) КАК Флажок,
		|	_Распоряжения.Документ КАК Документ,
		|	_Распоряжения.НомерПодтверждения КАК НомерПодтверждения,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет,
		|	_Распоряжения.Процент КАК Процент,
		|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
		|	_Распоряжения.ДатаРазмещения КАК ДатаРазмещения,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.Валюта КАК Валюта,
		|	_Распоряжения.Банк КАК Банк,
		|	_Распоряжения.СостояниеДокумента КАК СостояниеДокумента,
		|	_Распоряжения.Биржевой КАК Биржевой,
		|	НАЧАЛОПЕРИОДА(_Распоряжения.ДатаРазмещения, ДЕНЬ) КАК ДатаПодтверждения
		|ПОМЕСТИТЬ _РаспоряженияНаДепозиты
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|ГДЕ
		|	_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|	И (&БезОтбораПоБанку
		|			ИЛИ _Распоряжения.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментовСрезПоследних.Действует КАК Действует,
		|	УсловияКредитныхИнструментовСрезПоследних.Реинвестировать КАК Реинвестировать,
		|	УсловияКредитныхИнструментовСрезПоследних.Период КАК Период,
		|	УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств
		|ПОМЕСТИТЬ _УсловияДепозитныхВкладов
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|				,
		|				Организация = &Организация
		|					И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ПО (ДенежныеСредстваВКредитныхИнструментахОстатки.Организация = УсловияКредитныхИнструментовСрезПоследних.Организация)
		|			И (ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|			И (ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток <> 0)
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Действует
		|	И НЕ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).ПометкаУдаления
		|	И (&БезОтбораПоБанку
		|			ИЛИ ВЫРАЗИТЬ(УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияДепозитныхВкладов.ДатаПогашения = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) КАК Флажок,
		|	_УсловияДепозитныхВкладов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	_УсловияДепозитныхВкладов.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияДепозитныхВкладов.КредитныйИнструмент._НачальныйНоминал КАК Сумма
		|ПОМЕСТИТЬ _ДепозитныеВкладыДляЗакрытия
		|ИЗ
		|	_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент КАК КредитныйИнструмент,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.Период) КАК Период,
		|			МАКСИМУМ(_УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|		ИЗ
		|			_УсловияДепозитныхВкладов КАК _УсловияДепозитныхВкладов
		|		ГДЕ
		|			_УсловияДепозитныхВкладов.Действует
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УсловияДепозитныхВкладов.КредитныйИнструмент) КАК ВложенныйЗапрос
		|		ПО _УсловияДепозитныхВкладов.КредитныйИнструмент = ВложенныйЗапрос.КредитныйИнструмент
		|			И _УсловияДепозитныхВкладов.Период = ВложенныйЗапрос.Период
		|			И _УсловияДепозитныхВкладов.ДатаНачалаДействияУсловий = ВложенныйЗапрос.ДатаНачалаДействияУсловий
		|ГДЕ
		|	_УсловияДепозитныхВкладов.ДатаПогашения = &Дата";
#КонецОбласти
			
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("БезОтбораПоБанку", (Не ЗначениеЗаполнено(ЭтаФорма.Банк)));
	Запрос.УстановитьПараметр("Банк", ЭтаФорма.Банк);
	
	МассивБанков = Новый Массив;
	
	Для Каждого ЭлементБанк Из Обработки.Распоряжения.ПолучитьСтруктуруБанковДляКоторыхНастроеныФормыПодтверждений() Цикл
		МассивБанков.Добавить(ЭлементБанк.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивБанков", МассивБанков);

	Запрос.Выполнить();
	
	ТабРаспоряженияНаМНО = Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаМНО"].ПолучитьДанные().Выгрузить();
	
	ЭтаФорма.РаспоряженияНаМНО.Загрузить(ТабРаспоряженияНаМНО.Скопировать(Новый Структура("ТребуетсяАкцепт", Ложь)));
	ЭтаФорма.РаспоряженияОжидающиеАкцепта.Загрузить(ТабРаспоряженияНаМНО.Скопировать(Новый Структура("ТребуетсяАкцепт", Истина)));
	
	ЭтаФорма.РаспоряженияНаДепозиты.Загрузить(Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаДепозиты"].ПолучитьДанные().Выгрузить());
	ЭтаФорма.ДепозитныеВкладыДляЗакрытия.Загрузить(Запрос.МенеджерВременныхТаблиц.Таблицы["_ДепозитныеВкладыДляЗакрытия"].ПолучитьДанные().Выгрузить());
	
	МассивТаблиц = РаботаСКоллекциями.ЗначенияВМассив("РаспоряженияНаМНО", "РаспоряженияНаДепозиты", "РаспоряженияОжидающиеАкцепта");  
	
	Для Инд = 0 По МассивТаблиц.Количество() - 1 Цикл 
		
		ТекТаблица = ЭтаФорма[МассивТаблиц[Инд]]; 
	
		Для Каждого СтрокаРаспоряжение Из ТекТаблица Цикл
			
			Если ЗначениеЗаполнено(СтрокаРаспоряжение.НомерПодтверждения) Тогда
				СтрокаРаспоряжение.НомерПодтверждения = РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(СтрокаРаспоряжение.НомерПодтверждения);	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЭтаФорма.Элементы.СтраницаМНО.Заголовок = "МНО (" + ЭтаФорма.РаспоряженияНаМНО.Количество() + ")"; 
	ЭтаФорма.Элементы.СтраницаРазмещениеДепозитов.Заголовок = "Размещение депозитов (" + ЭтаФорма.РаспоряженияНаДепозиты.Количество() + ")";
	ЭтаФорма.Элементы.СтраницаЗакрытиеДепозитов.Заголовок = "Закрытие депозитов (" + ЭтаФорма.ДепозитныеВкладыДляЗакрытия.Количество() + ")"; 
	
	ОжидаютАкцепта = ЭтаФорма.РаспоряженияОжидающиеАкцепта.Количество(); 
			
	ЭтаФорма.Элементы.КомандаПоказатьРаспоряженияОжидающиеАкцепта.Заголовок = "Ожидают акцепта" + ?(ОжидаютАкцепта > 0, " (" + ОжидаютАкцепта + ")", "");  
	ЭтаФорма.Элементы.КомандаПоказатьРаспоряженияОжидающиеАкцепта.Видимость = (ОжидаютАкцепта > 0); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСозданныеИсполненияНаСервере()

#Область МНО
	СозданныеМНО.ПолучитьЭлементы().Очистить();
	
	СозданныеМНОНаСервере = РеквизитФормыВЗначение("СозданныеМНО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументМНО.Ссылка КАК ДокументМНО,
		|	ДокументМНО.Основание КАК Распоряжение,
		|	ПриходПроцентовМНО.Ссылка КАК ПриходПроцентов,
		|	ДокументМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДокументМНО.РасчетныйСчет КАК РасчетныйСчет,
		|	ДокументМНО.Сумма КАК Сумма,
		|	ДокументМНО.Процент КАК Процент,
		|	ДокументМНО.ДатаВозврата КАК ДатаВозврата,
		|	ВЫБОР
		|		КОГДА ДокументМНО.Основание.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеРаспоряжения,
		|	ВЫБОР
		|		КОГДА ДокументМНО.Проведен
		|			ТОГДА 1
		|		КОГДА ДокументМНО.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеМНО,
		|	ВЫБОР
		|		КОГДА ПриходПроцентовМНО.Проведен
		|			ТОГДА 1
		|		КОГДА ПриходПроцентовМНО.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеПриходаПроцентов,
		|	ЕСТЬNULL(ПриходПроцентовМНО.Сумма, 0) КАК СуммаПроцентов,
		|	Распоряжение.Сумма КАК СуммаРаспоряжения,
		|	Распоряжение.Процент КАК ПроцентРаспоряжения,
		|	Распоряжение.ДатаВозврата КАК ДатаВозвратаРаспоряжения,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправленияРаспоряжения,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчетРаспоряжения
		|ИЗ
		|	Документ.МНО КАК ДокументМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходПроцентовМНО КАК ПриходПроцентовМНО
		|		ПО (ПриходПроцентовМНО.МНО = ДокументМНО.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Распоряжение КАК Распоряжение
		|		ПО (ДокументМНО.Основание = Распоряжение.Ссылка)
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ДокументМНО.Дата, ДЕНЬ) = &Дата
		|	И ДокументМНО.Организация = &Организация
		|	И (&БезОтбораПоБанку ИЛИ ДокументМНО.РасчетныйСчет.Банк = &Банк)
		|ИТОГИ ПО
		|	ДокументМНО
		|	
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("БезОтбораПоБанку", (Не ЗначениеЗаполнено(ЭтаФорма.Банк)));
	Запрос.УстановитьПараметр("Банк", ЭтаФорма.Банк);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМНО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМНО.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаМНО.ДокументМНО) Тогда
		
			СозданныеМНОНаСервереСтрока1 = СозданныеМНОНаСервере.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СозданныеМНОНаСервереСтрока1, ВыборкаМНО);
			СозданныеМНОНаСервереСтрока1.Документ 				= ВыборкаМНО.ДокументМНО;
			СозданныеМНОНаСервереСтрока1.СостояниеДокумента 	= ВыборкаМНО.СостояниеМНО;
		
		КонецЕсли; 
		
		Выборка = ВыборкаМНО.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Распоряжение) Тогда
			
				СозданныеМНОНаСервереСтрока2 = СозданныеМНОНаСервереСтрока1.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СозданныеМНОНаСервереСтрока2, Выборка);
				СозданныеМНОНаСервереСтрока2.Документ 						= Выборка.Распоряжение;
				СозданныеМНОНаСервереСтрока2.СостояниеДокумента 			= Выборка.СостояниеРаспоряжения;
				СозданныеМНОНаСервереСтрока2.Сумма 							= Выборка.СуммаРаспоряжения;
				СозданныеМНОНаСервереСтрока2.Процент 						= Выборка.ПроцентРаспоряжения;
				СозданныеМНОНаСервереСтрока2.ДатаВозврата 					= Выборка.ДатаВозвратаРаспоряжения;
				СозданныеМНОНаСервереСтрока2.СчетДоверительногоУправления 	= Выборка.СчетДоверительногоУправленияРаспоряжения;
				СозданныеМНОНаСервереСтрока2.РасчетныйСчет 					= Выборка.РасчетныйСчетРаспоряжения;
				
				ЗаполнитьЗначенияСвойств(СозданныеМНОНаСервереСтрока1, Выборка, "СуммаРаспоряжения, ПроцентРаспоряжения, ДатаВозвратаРаспоряжения");
				
				СозданныеМНОНаСервереСтрока1.РасхождениеПоСумма							= (Выборка.Сумма 		<> Выборка.СуммаРаспоряжения);
				СозданныеМНОНаСервереСтрока1.РасхождениеПоПроцент      					= (Выборка.Процент      <> Выборка.ПроцентРаспоряжения);
				СозданныеМНОНаСервереСтрока1.РасхождениеПоДатаВозврата 					= (Выборка.ДатаВозврата <> Выборка.ДатаВозвратаРаспоряжения); 
				СозданныеМНОНаСервереСтрока1.РасхождениеПоСчетДоверительногоУправления 	= (Выборка.СчетДоверительногоУправления <> Выборка.СчетДоверительногоУправленияРаспоряжения); 
				СозданныеМНОНаСервереСтрока1.РасхождениеПоРасчетныйСчет				 	= (Выборка.РасчетныйСчет <> Выборка.РасчетныйСчетРаспоряжения); 
				
				Если СозданныеМНОНаСервереСтрока1.РасхождениеПоСумма Тогда
					СозданныеМНОНаСервереСтрока1.СуммаСРасхождением = Формат(СозданныеМНОНаСервереСтрока1.Сумма, "ЧДЦ=2") + " (" + Формат(СозданныеМНОНаСервереСтрока2.Сумма, "ЧДЦ=2") + ")";
				КонецЕсли; 
				Если СозданныеМНОНаСервереСтрока1.РасхождениеПоПроцент Тогда
					СозданныеМНОНаСервереСтрока1.ПроцентСРасхождением = Формат(СозданныеМНОНаСервереСтрока1.Процент, "ЧДЦ=2") + " (" + Формат(СозданныеМНОНаСервереСтрока2.Процент, "ЧДЦ=2") + ")";
				КонецЕсли; 
				Если СозданныеМНОНаСервереСтрока1.РасхождениеПоДатаВозврата Тогда
					СозданныеМНОНаСервереСтрока1.ДатаВозвратаСРасхождением = Формат(СозданныеМНОНаСервереСтрока1.ДатаВозврата, "ДФ=dd.MM.yyyy") + " (" + Формат(СозданныеМНОНаСервереСтрока2.ДатаВозврата, "ДФ=dd.MM.yyyy") + ")";
				КонецЕсли; 
				Если СозданныеМНОНаСервереСтрока1.РасхождениеПоСчетДоверительногоУправления Тогда
					СозданныеМНОНаСервереСтрока1.СчетДоверительногоУправленияСРасхождением = Строка(СозданныеМНОНаСервереСтрока1.СчетДоверительногоУправления) + " (" + Строка(СозданныеМНОНаСервереСтрока2.СчетДоверительногоУправления) + ")";
				КонецЕсли;
				Если СозданныеМНОНаСервереСтрока1.РасхождениеПоРасчетныйСчет Тогда
					СозданныеМНОНаСервереСтрока1.РасчетныйСчетСРасхождением = Строка(СозданныеМНОНаСервереСтрока1.РасчетныйСчет) + " (" + Строка(СозданныеМНОНаСервереСтрока2.РасчетныйСчет) + ")";
				КонецЕсли;
			
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ПриходПроцентов) Тогда
				
				СозданныеМНОНаСервереСтрока3 = СозданныеМНОНаСервереСтрока1.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СозданныеМНОНаСервереСтрока3, Выборка, , "ДатаВозврата, Процент");
				СозданныеМНОНаСервереСтрока3.Документ 				= Выборка.ПриходПроцентов;
				СозданныеМНОНаСервереСтрока3.СостояниеДокумента 	= Выборка.СостояниеПриходаПроцентов;
				СозданныеМНОНаСервереСтрока3.Сумма 					= Выборка.СуммаПроцентов;
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СозданныеМНОНаСервере, "СозданныеМНО");
#КонецОбласти

#Область Депозиты

	СозданныеРазмещенияДепозитов.ПолучитьЭлементы().Очистить();
	
	СозданныеРазмещенияДепозитовНаСервере = РеквизитФормыВЗначение("СозданныеРазмещенияДепозитов");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗакрытиеКредитногоИнструмента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗакрытиеКредитногоИнструмента.Ссылка КАК Закрытие,
		|	ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Депозит,
		|	ЗакрытиеКредитногоИнструмента.Сумма КАК СуммаДепозита,
		|	ВЫБОР
		|		КОГДА ЗакрытиеКредитногоИнструмента.ПометкаУдаления
		|			ТОГДА 0
		|		КОГДА ЗакрытиеКредитногоИнструмента.Проведен
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ДанныеКартинкиСтроки
		|ПОМЕСТИТЬ _ЗакрытияДепозитов
		|ИЗ
		|	Документ.ЗакрытиеКредитногоИнструмента КАК ЗакрытиеКредитногоИнструмента
		|ГДЕ
		|	ЗакрытиеКредитногоИнструмента.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(ЗакрытиеКредитногоИнструмента.Дата, ДЕНЬ) = &Дата
		|	И НЕ ЗакрытиеКредитногоИнструмента.ПометкаУдаления
		|	И ЗакрытиеКредитногоИнструмента.КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|	И (&БезОтбораПоБанку
		|			ИЛИ ВЫРАЗИТЬ(ЗакрытиеКредитногоИнструмента.КредитныйИнструмент КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк = &Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.Ссылка, ДепозитныеВклады.Ссылка) КАК ПолеИтогов,
		|	РазмещениеКредитногоИнструмента.Ссылка КАК РазмещениеКредитногоИнструмента,
		|	Распоряжения.Ссылка КАК Распоряжение,
		|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.СчетДоверительногоУправления, Распоряжения.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.РасчетныйСчет, Распоряжения.РасчетныйСчет) КАК РасчетныйСчетСписания,
		|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.Сумма, ДепозитныеВклады._НачальныйНоминал) КАК Сумма,
		|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад,
		|	ДепозитныеВклады.БанковскийСчет КАК РасчетныйСчет,
		|	ДепозитныеВклады.БанковскийСчет.Валюта КАК Валюта,
		|	ДепозитныеВклады._НачальныйНоминал КАК НоминалДепозитногоВклада,
		|	УсловияКредитныхИнструментовСрезПервых.Процент КАК ПроцентДепозитногоВклада,
		|	УсловияКредитныхИнструментовСрезПервых.ДатаПогашения КАК ДатаВозвратаДепозитногоВклада,
		|	Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправленияРаспоряжения,
		|	Распоряжения.Сумма КАК СуммаРаспоряжения,
		|	Распоряжения.Валюта КАК ВалютаРаспоряжения,
		|	Распоряжения.Процент КАК ПроцентРаспоряжения,
		|	Распоряжения.ДатаВозврата КАК ДатаВозвратаРаспоряжения,
		|	Распоряжения.РасчетныйСчет КАК РасчетныйСчетРаспоряжения,
		|	ВЫБОР
		|		КОГДА Распоряжения.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеРаспоряжения,
		|	ВЫБОР
		|		КОГДА РазмещениеКредитногоИнструмента.Проведен
		|			ТОГДА 1
		|		КОГДА РазмещениеКредитногоИнструмента.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СостояниеРазмещения,
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.ПометкаУдаления
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СостояниеДепозитногоВклада
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПервых(&Дата, Организация = &Организация) КАК УсловияКредитныхИнструментовСрезПервых
		|		ПО ДепозитныеВклады.Ссылка = УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
		|		ПО (РазмещениеКредитногоИнструмента.КредитныйИнструмент = ДепозитныеВклады.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Распоряжение КАК Распоряжения
		|		ПО (ЕСТЬNULL(РазмещениеКредитногоИнструмента.Основание, ДепозитныеВклады.Распоряжение) = Распоряжения.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РазмещениеКредитногоИнструмента.Ссылка ЕСТЬ НЕ NULL 
		|				ТОГДА НАЧАЛОПЕРИОДА(РазмещениеКредитногоИнструмента.Дата, ДЕНЬ) >= &Дата
		|						И РазмещениеКредитногоИнструмента.Организация = &Организация
		|						И НЕ РазмещениеКредитногоИнструмента.ПометкаУдаления
		|						И НЕ РазмещениеКредитногоИнструмента.Довнесение
		|						И РазмещениеКредитногоИнструмента.КредитныйИнструмент ССЫЛКА Справочник.ДепозитныеВклады
		|			ИНАЧЕ ДепозитныеВклады.Организация = &Организация
		|					И НЕ ДепозитныеВклады.ПометкаУдаления
		|					И Распоряжения.ДатаРазмещения >= &Дата
		|		КОНЕЦ
		|	И (&БезОтбораПоБанку
		|			ИЛИ ДепозитныеВклады.БанковскийСчет.Банк = &Банк)
		|ИТОГИ
		|	МАКСИМУМ(СчетДоверительногоУправления),
		|	МАКСИМУМ(РасчетныйСчетСписания),
		|	МАКСИМУМ(Сумма),
		|	МАКСИМУМ(Валюта),
		|	МАКСИМУМ(СостояниеРаспоряжения),
		|	МАКСИМУМ(СостояниеРазмещения),
		|	МАКСИМУМ(СостояниеДепозитногоВклада)
		|ПО
		|	ПолеИтогов
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("БезОтбораПоБанку", (Не ЗначениеЗаполнено(ЭтаФорма.Банк)));
	Запрос.УстановитьПараметр("Банк", ЭтаФорма.Банк);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРазмещений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРазмещений.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаРазмещений.ПолеИтогов) Тогда  
			Если ТипЗнч(ВыборкаРазмещений.ПолеИтогов) = Тип("ДокументСсылка.РазмещениеКредитногоИнструмента") Тогда
		
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока = СозданныеРазмещенияДепозитовНаСервере.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока, ВыборкаРазмещений);
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Документ = ВыборкаРазмещений.ПолеИтогов;
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.СостояниеДокумента = ВыборкаРазмещений.СостояниеРазмещения;
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.РасчетныйСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Документ.КредитныйИнструмент, "БанковскийСчет");
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.РасчетныйСчет, "Валюта");
				
			ИначеЕсли ТипЗнч(ВыборкаРазмещений.ПолеИтогов) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
			
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока = СозданныеРазмещенияДепозитовНаСервере.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока, ВыборкаРазмещений);
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Документ = ВыборкаРазмещений.ПолеИтогов;
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.СостояниеДокумента = ВыборкаРазмещений.СостояниеДепозитногоВклада;
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.РасчетныйСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Документ, "БанковскийСчет");
				СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.РасчетныйСчет, "Валюта");
								
			КонецЕсли; 
		КонецЕсли; 
		
		Выборка = ВыборкаРазмещений.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Распоряжение) Тогда
				
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1 = СозданныеРазмещенияДепозитовНаСервереНоваяСтрока.Строки.Добавить();
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.Документ = Выборка.Распоряжение;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправленияРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.СостояниеДокумента = Выборка.СостояниеРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.РасчетныйСчетСписания = Выборка.РасчетныйСчетРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.Сумма = Выборка.СуммаРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.Валюта = Выборка.ВалютаРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.Процент = Выборка.ПроцентРаспоряжения;
				СозданныеРазмещенияДепозитовНаСервереНоваяПодстрока_1.ДатаВозврата = Выборка.ДатаВозвратаРаспоряжения;
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СозданныеРазмещенияДепозитовНаСервере, "СозданныеРазмещенияДепозитов");
	
	ЭтаФорма.СозданныеЗакрытияДепозитов.Загрузить(Запрос.МенеджерВременныхТаблиц.Таблицы["_ЗакрытияДепозитов"].ПолучитьДанные().Выгрузить());

#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПросроченныеРаспоряженияМНОНаСервере()

	ПросроченныеРаспоряженияМНО.Очистить();
	
	ПросроченныеРаспоряжения = РеквизитФормыВЗначение("Объект").ПолучитьПросроченныеРаспоряженияМНО(ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.Банк);
	
	ПросроченныеРаспоряженияМНО.Загрузить(ПросроченныеРаспоряжения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	КлючиРазвернутыхСтрокСозданныеМНО = Неопределено;
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.СозданныеМНО, Элементы.СозданныеМНО, "Документ", КлючиРазвернутыхСтрокСозданныеМНО);
	
	КлючТекущейСтрокиСозданныеМНО = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.СозданныеМНО, "Документ");
	КлючТекущейСтрокиРаспоряженияНаМНО = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.РаспоряженияНаМНО, "Документ");
	КлючТекущейСтрокиПросроченныеРаспоряженияМНО = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ПросроченныеРаспоряженияМНО, "Документ");
	
	ПроверитьЗаполнение();
	ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
	ЗаполнитьПросроченныеРаспоряженияМНОНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.СозданныеМНО, Элементы.СозданныеМНО, "Документ", КлючиРазвернутыхСтрокСозданныеМНО);
	
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.СозданныеМНО, Элементы.СозданныеМНО, "Документ", КлючТекущейСтрокиСозданныеМНО);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.РаспоряженияНаМНО, Элементы.РаспоряженияНаМНО, "Документ", КлючТекущейСтрокиРаспоряженияНаМНО);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ПросроченныеРаспоряженияМНО, Элементы.ПросроченныеРаспоряженияМНО, "Документ", КлючТекущейСтрокиПросроченныеРаспоряженияМНО);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ПриИзмененииРеквизитовШапки("Дата", ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ПриИзмененииРеквизитовШапки("Банк", ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовШапки(ИмяРеквизита, ВыбранноеЗначение)
	
	ТекущееЗначение = ЭтаФорма[ИмяРеквизита];	

	Если Вопрос("Перезаполнить таблицы плановых и созданных распоряжений?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма[ИмяРеквизита] = ВыбранноеЗначение; 
		КомандаОбновить(Неопределено);
		
	Иначе
		ВыбранноеЗначение = ТекущееЗначение; 	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыПровести(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
		
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		РаботаСоСпискомДокументовКлиент.Провести(ДанныеВыбранныхДокументов);
	
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыОтменитьПроведение(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		РаботаСоСпискомДокументовКлиент.ОтменитьПроведение(ДанныеВыбранныхДокументов);
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыУстановитьСнятьПометкуУдаление(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда		
		
		РаботаСоСпискомДокументовКлиент.УстановитьСнятьПометкуУдаления(ДанныеВыбранныхДокументов);
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыСоздатьНаОсновании(Команда)
	
	ТекущиеДанныеСписка = Элементы.СозданныеМНО.ТекущиеДанные;
	
	Если ТекущиеДанныеСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанныеСписка.Документ) = Тип("ДокументСсылка.МНО") Тогда
		
		РаботаСоСпискомДокументовКлиент.СоздатьНаОсновании(ТекущиеДанныеСписка.Документ, "МНО");
		
		КомандаОбновить(Неопределено);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбранныхДокументов()
	
	ДанныеВыбранныхДокументов = Новый Массив;
	
	ВыделенныеСтрокиСписка = Элементы.СозданныеМНО.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиСписка = Неопределено Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;
	
	Если ВыделенныеСтрокиСписка.Количество() = 0 Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;	
	
	Для каждого ВыделеннаяСтрокаСписка Из ВыделенныеСтрокиСписка Цикл
		
		ДанныеВыделеннойСтрокиСписка = Элементы.СозданныеМНО.ДанныеСтроки(ВыделеннаяСтрокаСписка);
		
		// не выполняем дейсвия над Распоряжениями на МНО
		Если ТипЗнч(ДанныеВыделеннойСтрокиСписка.Документ) = Тип("ДокументСсылка.Распоряжение") Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Состояние = Неопределено;
		
		Если      ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 0 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 1 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Проведен");
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.СостояниеДокумента = 2 Тогда
			Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан");
		КонецЕсли;
		
		ДанныеВыбранныхДокументов.Добавить(
			Новый Структура("Документ, Состояние", ДанныеВыделеннойСтрокиСписка.Документ, Состояние));
		
	КонецЦикла;

	Возврат ДанныеВыбранныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура КомандаРаспоряженияСозданныеРазвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.РазвернутьВсеЭлементыДерева(ЭтаФорма.СозданныеМНО, Элементы.СозданныеМНО);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияСозданныеСвернутьВсе(Команда)
	
	РаботаСФормамиКлиент.СвернутьВсеЭлементыДерева(ЭтаФорма.СозданныеМНО, Элементы.СозданныеМНО);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаМНОУстановитьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.РаспоряженияНаМНО, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаМНОСнятьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.РаспоряженияНаМНО, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаДепозитыУстановитьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.РаспоряженияНаДепозиты, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаДепозитыСнятьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.РаспоряженияНаДепозиты, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитныеВкладыДляЗакрытияУстановитьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.ДепозитныеВкладыДляЗакрытия, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитныеВкладыДляЗакрытияСнятьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.ДепозитныеВкладыДляЗакрытия, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияОжидающиеАкцептаУстановитьВсеФлажки(Команда)

	ИзменитьФлажки(ЭтаФорма.РаспоряженияОжидающиеАкцепта, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияОжидающиеАкцептаСнятьВсеФлажки(Команда)
	
	ИзменитьФлажки(ЭтаФорма.РаспоряженияОжидающиеАкцепта, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(ТаблицыФормы, ЗначениеФлажка)
	
	Для Каждого СтрокаТаблицыФормы Из ТаблицыФормы Цикл
		
		СтрокаТаблицыФормы.Флажок = ЗначениеФлажка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьМНО(Команда)
	
	ЕстьОшибки = Ложь;
	
	// проверим заполнение
	ВыбРаспоряженияНаМНО = Новый Массив();
	
	Для НомСтр = 0 По РаспоряженияНаМНО.Количество() - 1 Цикл
			
		СтрокаПлановыеРаспоряжения = РаспоряженияНаМНО[НомСтр];
		
		Если Не СтрокаПлановыеРаспоряжения.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПлановыеРаспоряжения.СчетДоверительногоУправления) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Счет д/у"" в строке № " + (НомСтр + 1),,,, ЕстьОшибки);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаПлановыеРаспоряжения.РасчетныйСчет) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Р/счет"" в строке № " + (НомСтр + 1),,,, ЕстьОшибки);
		КонецЕсли;
	
		Если СтрокаПлановыеРаспоряжения.Сумма = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Сумма МНО"" в строке № " + (НомСтр + 1),,,, ЕстьОшибки);
		КонецЕсли;
		
		Если СтрокаПлановыеРаспоряжения.Процент = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Процент"" в строке № " + (НомСтр + 1),,,, ЕстьОшибки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПлановыеРаспоряжения.ДатаВозврата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Дата возврата"" в строке № " + (НомСтр + 1),,,, ЕстьОшибки);
		КонецЕсли;
		
		ВыбРаспоряженияНаМНО.Добавить(
			Новый Структура("НомерСтроки, Документ", 
			НомСтр + 1,
			СтрокаПлановыеРаспоряжения.Документ));
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	ИначеЕсли ВыбРаспоряженияНаМНО.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны распоряжения на МНО.");
		Возврат;
	КонецЕсли;
	
	Если СоздатьМНО(ВыбРаспоряженияНаМНО) Тогда
		КомандаОбновить(Неопределено);
		РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении()
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьМНО(ВыбРаспоряженияНаМНО)

	Для каждого СтрокаМНО Из ВыбРаспоряженияНаМНО Цикл
	
		МНО = Документы.МНО.СоздатьДокумент();
		МНО.Заполнить(СтрокаМНО.Документ);
		
		МНО.Ответственный = РаботаСПользователями.ТекущийПользователь();
		
		ЕстьОшибки = Ложь;
		
		Если Не МНО.ПроверитьЗаполнение() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проверке заполнения МНО по строке № " + (СтрокаМНО.НомерСтроки) + " обнаружены ошибки",,,, ЕстьОшибки);
		КонецЕсли;
		
		Если Не ЕстьОшибки Тогда
		
			Попытка
				МНО.Записать(РежимЗаписиДокумента.Проведение);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + МНО);
				СоздатьПриходПроцентовМНО(МНО.Ссылка);
			Исключение
				МНО.Записать(РежимЗаписиДокумента.Запись);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести МНО " + МНО,,,, ЕстьОшибки);
			КонецПопытки;
			
		Иначе
			
			МНО.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + МНО,,,, ЕстьОшибки);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьПриходПроцентовМНО(МНО)

	ПриходПроцентовМНО = Документы.ПриходПроцентовМНО.СоздатьДокумент();
	ПриходПроцентовМНО.Заполнить(МНО);
	
	Если Не ПриходПроцентовМНО.ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ прихода процентов по МНО");
	КонецЕсли;
	
	Попытка
		ПриходПроцентовМНО.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + ПриходПроцентовМНО, ПриходПроцентовМНО.Ссылка);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ прихода процентов по МНО. Система сообщает: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДепозитыИРазмещенияНаСервере()
	
	ДанныеДляСозданияДепозитов = РаспоряженияНаДепозиты.Выгрузить(
		Новый Структура("Флажок", Истина),
		"Документ, УчетныйАктив, РасчетныйСчетДепозита, НомерПодтверждения, ДатаПодтверждения, ДепозитЗаключенПоДоговору, Биржевой");
	
	Обработки.Распоряжения.СоздатьДепозитыИРазмещения(ЭтаФорма.Организация, 
									ДанныеДляСозданияДепозитов, 
									?(РаботаСДокументами.ИспользуетсяВыгрузкаПлатежныхПорученийВКлиентБанк(ЭтаФорма.Организация, ЭтаФорма.Дата), Ложь, Истина));
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЗакрытияДепозитовНаСервере()
	
	ДанныеДляЗакрытияДепозитов = ДепозитныеВкладыДляЗакрытия.Выгрузить(Новый Структура("Флажок", Истина), "КредитныйИнструмент");
	
	Справочники.ДепозитныеВклады.СоздатьЗакрытияКредитныхИнструментов(ЭтаФорма.Организация, ЭтаФорма.Дата, ДанныеДляЗакрытияДепозитов); 
	
КонецПроцедуры
 
&НаКлиенте
Процедура СозданныеМНОПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОткрытьДокумент(Элементы.СозданныеМНО.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаМНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокумент(Элементы.РаспоряженияНаМНО.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаДепозитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокумент(Элементы.РаспоряженияНаДепозиты.ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеРаспоряженияМНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокумент(Элементы.ПросроченныеРаспоряженияМНО.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеМНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьДокумент(Элементы.СозданныеМНО.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеРазмещенияДепозитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокумент(Элементы.СозданныеРазмещенияДепозитов.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Документ, "Просмотр") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаДепозитыПечатьПодтверждений(Команда)
	
	ПечатьРаспоряженийНаДепозиты("ПечатьБанковскихПодтверждений");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспоряженияНаДепозитыПечатьЗаявленийНаРазмещение(Команда)
	
	ПечатьРаспоряженийНаДепозиты("ПечатьЗаявленийНаРазмещениеДепозитов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРаспоряженийНаДепозиты(ВидПечати)
		
	МассивРаспоряжений	= Новый Массив;
	МассивБанков		= Новый Массив;
	
	// Для формы подтверждений отдельная проверка
	Если ВидПечати = "ПечатьБанковскихПодтверждений" Тогда 
		
		МассивЗаписей = ЭтаФорма.РаспоряженияНаДепозиты.НайтиСтроки(Новый Структура("Флажок, КартинкаПечать", Истина, 0));
		
		Для Каждого СтрокаРаспоряжений Из МассивЗаписей Цикл 		
			МассивРаспоряжений.Добавить(СтрокаРаспоряжений.Документ);
		КонецЦикла;
		
		Для Каждого СтрокаРаспоряжений Из ЭтаФорма.РаспоряженияНаДепозиты Цикл
			
			Если СтрокаРаспоряжений.Флажок И СтрокаРаспоряжений.КартинкаПечать = 1 Тогда
				
				МассивБанков.Добавить(СтрокаРаспоряжений.Банк);
				СтрокаРаспоряжений.Флажок = Ложь;
				
			КонецЕсли;
					
		КонецЦикла;
		
	Иначе
		МассивЗаписей = ЭтаФорма.РаспоряженияНаДепозиты.НайтиСтроки(Новый Структура("Флажок", Истина));
		
		БанкВТБ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ВТБ");
		Для Каждого СтрокаРаспоряжений Из МассивЗаписей Цикл 
			Если СтрокаРаспоряжений.Банк <> БанкВТБ Тогда 
				МассивБанков.Добавить(СтрокаРаспоряжений.Банк);
				СтрокаРаспоряжений.Флажок = Ложь;
			Иначе	
				МассивРаспоряжений.Добавить(СтрокаРаспоряжений.Документ);
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивБанков);
	      		
	Для Каждого ЭлементБанк Из МассивБанков Цикл
		
		Если Вопрос("Для Банка [" + ЭлементБанк + "] не настроена выбранная форма печати", РежимДиалогаВопрос.ОК) = КодВозвратаДиалога.ОК Тогда	
			Продолжить;	
		КонецЕсли;	
		
	КонецЦикла;  

	Если МассивРаспоряжений.Количество() > 0 Тогда	
	
		ПараметрыФормы = Новый Структура("МассивРаспоряжений, Дата, Банк, Организация, ВидПечати", 
								МассивРаспоряжений, 
								ЭтаФорма.Дата, 
								ЭтаФорма.Банк, 
								ЭтаФорма.Организация, 
								ВидПечати);
	
		ОткрытьФормуМодально("Обработка.Распоряжения.Форма.Печать",
			ПараметрыФормы,
			ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьРазмещенияДепозитов(Команда)
	
	РаспоряженияВыбраны = Ложь;
	ПолученыНовыеПараметры = Ложь;
	
	Для Каждого СтрокаРаспоряженияНаДепозиты Из ЭтаФорма.РаспоряженияНаДепозиты Цикл
		
		Если СтрокаРаспоряженияНаДепозиты.Флажок = Истина Тогда
			
			Если СтрокаРаспоряженияНаДепозиты.ДатаРазмещения <> НачалоДня(ТекущаяДата()) Тогда
		
				Если Вопрос("Дата размещения [" + Формат(СтрокаРаспоряженияНаДепозиты.ДатаРазмещения, "ДФ=dd.MM.yyyy") + "] в распоряжении [" + СтрокаРаспоряженияНаДепозиты.Документ + "] отличается от текущей даты. Продолжить создание размещения депозитного вклада?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда	
					Продолжить;	
				КонецЕсли;
				
			КонецЕсли;

			ПараметрыФормы = Новый Структура("Организация, СчетДоверительногоУправления, Банк, РасчетныйСчетДепозита, НомерПодтверждения, ДатаПодтверждения, УчетныйАктив, Процент, Сумма, Валюта, ДатаРазмещения, ДатаВозврата, Биржевой, ДепозитЗаключенПоДоговору");
	
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаРаспоряженияНаДепозиты);
			ПараметрыФормы.Организация = ЭтаФорма.Организация;

			НовыеПараметрыДепозита = ОткрытьФормуМодально("Обработка.Распоряжения.Форма.ПараметрыКредитныхИнструментов", ПараметрыФормы, ЭтаФорма);
	
			Если НовыеПараметрыДепозита <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряженияНаДепозиты, НовыеПараметрыДепозита, "РасчетныйСчетДепозита, НомерПодтверждения, ДатаПодтверждения, УчетныйАктив, Биржевой, ДепозитЗаключенПоДоговору");		
				ПолученыНовыеПараметры = Истина;	
			КонецЕсли;
	
			РаспоряженияВыбраны = Истина;
	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолученыНовыеПараметры Тогда
		
		СоздатьДепозитыИРазмещенияНаСервере();
		ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
		
	КонецЕсли;
	
	Если Не РаспоряженияВыбраны Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите распоряжения для создания депозитных вкладов.");
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитныеВкладыДляЗакрытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДепозитныеВкладыДляЗакрытия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ДепозитныеВкладыДляЗакрытияСчетДоверительногоУправления" И ЗначениеЗаполнено(ТекущиеДанные.СчетДоверительногоУправления) Тогда
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);	
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.КредитныйИнструмент) И РаботаСПользователями.ПраваДоступны(ТекущиеДанные.КредитныйИнструмент, "Просмотр") Тогда
		ОткрытьЗначение(ТекущиеДанные.КредитныйИнструмент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданныеЗакрытияДепозитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СозданныеЗакрытияДепозитов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СозданныеЗакрытияДепозитовСчетДоверительногоУправления" И ЗначениеЗаполнено(ТекущиеДанные.СчетДоверительногоУправления) Тогда
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);	
	ИначеЕсли Поле.Имя = "СозданныеЗакрытияДепозитовЗакрытие" И ЗначениеЗаполнено(ТекущиеДанные.Закрытие) И РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Закрытие, "Просмотр") Тогда 
		ОткрытьЗначение(ТекущиеДанные.Закрытие);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Депозит) И РаботаСПользователями.ПраваДоступны(ТекущиеДанные.Депозит, "Просмотр") Тогда
		ОткрытьЗначение(ТекущиеДанные.Депозит);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗакрытияДепозитов(Команда)
		
	Для Каждого ДепозитныйВкладДляЗакрытия Из ЭтаФорма.ДепозитныеВкладыДляЗакрытия Цикл
		
		Если ДепозитныйВкладДляЗакрытия.Флажок = Истина Тогда
			
			Если ДепозитныйВкладДляЗакрытия.ДатаПогашения <> НачалоДня(ТекущаяДата()) Тогда
		
				Если Вопрос("Дата погашения [" + Формат(ДепозитныйВкладДляЗакрытия.ДатаПогашения, "ДФ=dd.MM.yyyy") + "] депозитного вклада [" + ДепозитныйВкладДляЗакрытия.КредитныйИнструмент + "] отличается от текущей даты. Продолжить создание закрытия депозитного вклада?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда	
					
					ДепозитныйВкладДляЗакрытия.Флажок = Ложь;
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СоздатьЗакрытияДепозитовНаСервере();
	ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьРаспоряженияОжидающиеАкцепта(Команда)
	
	ЭтаФорма.Элементы.ГруппаРаспоряженияОжидающиеАкцепта.Видимость = Не ЭтаФорма.Элементы.ГруппаРаспоряженияОжидающиеАкцепта.Видимость; 	

КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьПодтвержденияБанка(Команда)
	
	ОтправитьРаспоряженияНаПечать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЗапросаСогласияНаРаспоряжениеИмуществом(Команда)
	
	ОтправитьРаспоряженияНаПечать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьУведомленияОНамерении(Команда)
	
	ОтправитьРаспоряженияНаПечать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРаспоряженияНаПечать(ИмяКоманды) 
	
	МассивДокументов = Новый Массив;
	
	ТекСчетДУ = Неопределено;
	
	Для Каждого ТекСтрока Из ЭтаФорма.РаспоряженияОжидающиеАкцепта Цикл 
		
		Если Не ТекСтрока.Флажок Тогда
			Продолжить;	
		КонецЕсли;

		ТекСчетДУ = ?(ТекСчетДУ = Неопределено, ТекСтрока.СчетДоверительногоУправления, ТекСчетДУ);  
				
		Если ИмяКоманды = "КомандаПечатьУведомленияОНамерении" И ТекСчетДУ <> ТекСтрока.СчетДоверительногоУправления Тогда  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать уведомления о намерении возможно в рамках только одного счета ДУ.");
			Возврат
		КонецЕсли;
		
		МассивДокументов.Добавить(ТекСтрока.Документ);
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны распоряжения на МНО для печати");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("МассивДокументов", МассивДокументов);

	Если ИмяКоманды = "КомандаПечатьПодтвержденияБанка" Тогда	
		ОткрытьФорму("Обработка.ПечатьМНО.Форма.ФормаПечатьПодтверждений", ПараметрыФормы, ЭтаФорма);	
	ИначеЕсли ИмяКоманды = "КомандаПечатьУведомленияОНамерении" Тогда
		ОткрытьФорму("Обработка.ПечатьМНО.Форма.ФормаПечатьУведомленияОНамерении", ПараметрыФормы, ЭтаФорма);	
	ИначеЕсли ИмяКоманды = "КомандаПечатьЗапросаСогласияНаРаспоряжениеИмуществом" Тогда
		ОткрытьФорму("Обработка.ПечатьЗапросаСогласияНаРаспоряжениеИмуществом.Форма.ФормаПечатьЗапросаСогласия", ПараметрыФормы, ЭтаФорма);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияОжидающиеАкцептаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокумент(Элементы.РаспоряженияОжидающиеАкцепта.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьАкцепт(Команда)
	
	МассивСтрок = ЭтаФорма.РаспоряженияОжидающиеАкцепта.НайтиСтроки(Новый Структура("Флажок", Истина));
	
	Если МассивСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать распоряжение для создания акцепта.");	
	ИначеЕсли Вопрос("Вы хотите акцептовать распоряжения (" + МассивСтрок.Количество() + " шт.)?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда

		Для Каждого ТекСтрока Из МассивСтрок Цикл	
			
			СтруктураЗаполнения = Новый Структура("Объект", ТекСтрока.Документ);
			РезультатСоздания = ОткрытьФормуМодально("Документ.Акцепт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения), ЭтаФорма);
		
		КонецЦикла;
		
		ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
						
	КонецЕсли; 
					
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьДлинныйАкцепт(Команда)
		
	МассивСтрок = ЭтаФорма.РаспоряженияОжидающиеАкцепта.НайтиСтроки(Новый Структура("Флажок", Истина));
	
	Если МассивСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать распоряжение для создания акцепта.");	
	ИначеЕсли Вопрос("Вы хотите создать длинные акцепты (" + МассивСтрок.Количество() + " шт.)?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда

		Для Каждого ТекСтрока Из МассивСтрок Цикл	
			
			СтруктураЗаполнения = Новый Структура("Объект, ДлинныйАкцепт", ТекСтрока.Документ);
			РезультатСоздания = ОткрытьФормуМодально("Документ.Акцепт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения), ЭтаФорма);
		
		КонецЦикла;
		
		ЗаполнитьПлановыеСозданныеИсполненияНаСервере();
						
	КонецЕсли; 
					
КонецПроцедуры
