
&НаСервере
Процедура РасшифроватьНаСервере(Отчет)
	
	Отказ = Ложь;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления);
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент", Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Дата));
	ПараметрыОценки.Вставить("Организация", СчетДоверительногоУправления.Организация);
	ПараметрыОценки.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, Дата, Облигация, Отказ);
	
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения",		СчитаемДоПогашения);
	ПараметрыДенежногоПотока.Вставить("УчитыватьКупонКОферте",	НастройкиУчета.УчитыватьКупонКОферте);

	ПараметрыДенежногоПотока.Вставить("Дата",				Дата);
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",		Дата);
	
	ПараметрыДенежногоПотока.Вставить("НеУчитыватьРешенияКлиентовПоПотокам", НЕ УчитыватьРешенияКлиентов);
	
	РасшифровкаРасчета = Новый Структура();
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	Облигация);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	Поток = Справочники.Облигации.ПолучитьДенежныйПоток(Облигация, ПараметрыДенежногоПотока, ПараметрыОценки, Отказ, РасшифровкаРасчета);
	
	Если Поток <> Неопределено Тогда
	
		Поток.Свернуть("Дата", "Поток");
		Поток.Сортировать("Дата");
		
		ДенежныПоток.Очистить();
		
		ДенежныПоток.Загрузить(Поток);
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(СтрШаблон("Расшифровка формирования потока для облигации: %1 по счету д/у: %2", Облигация, СчетДоверительногоУправления),,, Отчет);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Расшифровать");
	Попытка
		ВыполнитьРасшифровку(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасшифровку(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, "Не заполнены обязательные поля");
		Возврат;
	КонецЕсли;
	
	Отчет = Неопределено;
	РасшифроватьНаСервере(Отчет);
	Если Отчет <> Неопределено Тогда
		Отчет.Показать(СтрШаблон("Расшифровка формирования потока для облигации: %1 по счету д/у: %2", Облигация, СчетДоверительногоУправления));		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);	
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти