
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Субъект, ВнешняяСистема", ПараметрКоманды, ПредопределенноеЗначение("Справочник.ВнешниеСистемы.QUIK")));
	ОткрытьФорму("РегистрСведений.НомераТранзакций.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
