
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыСверки();
	
КонецПроцедуры

Процедура ДобавитьРеквизитыСверки()
	
	РеквизитыСверки = РеквизитФормыВЗначение("Запись").РеквизитыСверки.Получить();
	
	Если ТипЗнч(РеквизитыСверки) = Тип("Структура") И РеквизитыСверки.Количество() > 0 Тогда
	
		ДобавляемыеРеквизиты = Новый Массив();
		Для Каждого Реквизит Из РеквизитыСверки Цикл
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Ключ, Новый ОписаниеТипов("Строка"),, ));
		КонецЦикла;
		
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		Для Каждого Реквизит Из РеквизитыСверки Цикл
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить(Реквизит.Ключ, Тип("ПолеФормы"), Элементы.ГруппаРеквизитыСверки);
			
			НовыйЭлемент.ПутьКДанным		= Реквизит.Ключ;
			НовыйЭлемент.Вид         		= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
			НовыйЭлемент.ТолькоПросмотр		= Истина;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, РеквизитыСверки);
		
	КонецЕсли;
	
КонецПроцедуры