
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	// для ПИФов, физиков и ИИС (на всякий случай) разницу между суммой объявленной и суммой не учитываем в качестве налога
	СписокВидовСчетовДУБезНДФЛ = Новый Массив;
	СписокВидовСчетовДУБезНДФЛ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
	СписокВидовСчетовДУБезНДФЛ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	СписокВидовСчетовДУБезНДФЛ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	// Проверка наличия бумаг в портфеле на дату реестра
	Если НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ЭтотОбъект.ДатаРеестра) Тогда 
		ДатаПроверки = ЭтотОбъект.Дата;
	ИначеЕсли НачалоДня(ЭтотОбъект.Дата) > НачалоДня(ЭтотОбъект.ДатаРеестра) Тогда 
		ДатаПроверки = КонецДня(ЭтотОбъект.ДатаРеестра);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата Реестра " + Формат(ЭтотОбъект.ДатаРеестра, "ДФ=dd.MM.yyyy") + " больще даты документа " + Формат(ЭтотОбъект.ДатаРеестра, "ДФ=dd.MM.yyyy"), ЭтотОбъект.Ссылка, , , Отказ);
		Возврат;
	КонецЕсли;	
	ОстаткиЦенныхБумаг = РаботаСЦеннымиБумагами.ПолучитьПортфельЦенныхБумаг(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Новый Структура("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага), ДатаПроверки);
	Если ЭтотОбъект.Количество <> (ОстаткиЦенныхБумаг.Итог("КоличествоОстаток") + ОстаткиЦенныхБумаг.Итог("ПроданоВРЕПО")) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Количество ценных бумаг в документе отличается от имеющегося в портфеле: остаток (в т.ч. купленных по РЕПО) - "
				+ Строка(ОстаткиЦенныхБумаг.Итог("КоличествоОстаток")) + " (" + Строка(ОстаткиЦенныхБумаг.Итог("КупленоПоРЕПО"))
				+ "), проданно в РЕПО - " + Строка(ОстаткиЦенныхБумаг.Итог("ПроданоВРЕПО")),
			ЭтотОбъект.Ссылка, , ,
			Отказ
		);
		Возврат;
	КонецЕсли;
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;
	
	// задолженности по д/с
	Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
	
	Движение.Период                       = ЭтотОбъект.Дата;
	Движение.Основание                    = ЭтотОбъект.Ссылка;
	Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
	
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.ВидЗадолженности             = РаботаСЦеннымиБумагамиКлиентСервер.ВидЗадолженностиДивидендыПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага);
	Движение.Контрагент					  = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага, ЭтотОбъект.Дата);	
	Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
	//ПИФ-ы не отражают задолженность по НДФЛ
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		Движение.Сумма	= ЭтотОбъект.Сумма;
	Иначе		
		Движение.Сумма	= ЭтотОбъект.СуммаОбъявленная;
	КонецЕсли;	
	
	// операции с ц/б
	Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
	
	Движение.Операция                     = ЭтотОбъект.Ссылка;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.Рынок	                      = ЭтотОбъект.Рынок;
	Движение.ЦеннаяБумага	              = ЭтотОбъект.ЦеннаяБумага;
	Движение.Количество	                  = ЭтотОбъект.Количество;
	//ПИФ-ы не отражают задолженность по НДФЛ
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		Движение.Сумма	= ЭтотОбъект.Сумма;
	Иначе		
		Движение.Сумма	= ЭтотОбъект.СуммаОбъявленная;
	КонецЕсли;
	
	Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
	Движение.ДатаОперации                 = ЭтотОбъект.Дата;
	
	// Разница по сумме объявленной и сумме - предполагается НДФЛ или налог на прибыль - ПИФы и физики не учитывают
	// С 2026 г добавляем проверку настройки НачислятьОбязательстваПоОплатеНалогаСДивидендов - используется только у Волги
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Если (ЭтотОбъект.Дата < '20260101' Или НастройкиУчетаОбщие.НачислятьОбязательстваПоОплатеНалогаСДивидендов)
		И ЭтотОбъект.СуммаОбъявленная <> ЭтотОбъект.Сумма
		И СписокВидовСчетовДУБезНДФЛ.Найти(ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления)	= Неопределено Тогда

		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
		
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	    Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль;
		Движение.Контрагент					  = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага, ЭтотОбъект.Дата);	
		Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
		// Согласно п. 6 ст. 52 НК РФ нужно округлять сумму налога
		Движение.Сумма                        = Окр(ЭтотОбъект.СуммаОбъявленная - ЭтотОбъект.Сумма);
	
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага);
		
	МассивУчетныхАктивов = Новый Массив;
	МассивЦенныхБумаг = Новый Массив;
	
	Если МассивЦенныхБумаг.Найти(ЭтотОбъект.ЦеннаяБумага) = Неопределено Тогда
		МассивЦенныхБумаг.Добавить(ЭтотОбъект.ЦеннаяБумага);
	КонецЕсли;
	
	ТаблицаРаспределенияАктивовЕПС = Неопределено;
	БухгалтерскийУчетЕПС.ПолучитьРаспределениеУчетныхАктивовЕПСПоДивидендам(ЭтотОбъект.Ссылка, ТаблицаРаспределенияАктивовЕПС);
	КоличествоОстаток = 	ТаблицаРаспределенияАктивовЕПС.Итог("Количество");
	
	Если КоличествоОстаток <> Количество Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество в остатках ("+КоличествоОстаток+") не соответствует количеству при начислении дивидендов ("+Количество + ") в "+ Ссылка);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
		
	СуммаНачисленияОстаток = ЭтотОбъект.СуммаОбъявленная;
	КоличествоНачисленияОстаток = ЭтотОбъект.Количество;
	СуммаНачисленияБезНалогаОстаток = ЭтотОбъект.Сумма;
	
	Для Каждого СтрокаУчетногоАктива из ТаблицаРаспределенияАктивовЕПС Цикл
		
		УчетныйАктивЕПС = СтрокаУчетногоАктива.УчетныйАктивЕПС;
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
		КонецЕсли;
		
		СуммаНачисления = Окр(СуммаНачисленияОстаток * СтрокаУчетногоАктива.Количество / КоличествоНачисленияОстаток, 2);
		СуммаНачисленияОстаток = СуммаНачисленияОстаток - СуммаНачисления;
		
		СуммаНачисленияБезНалога = Окр(СуммаНачисленияБезНалогаОстаток * СтрокаУчетногоАктива.Количество / КоличествоНачисленияОстаток, 2);
		СуммаНачисленияБезНалогаОстаток = СуммаНачисленияБезНалогаОстаток - СуммаНачисленияБезНалога;
		
					
		КоличествоНачисленияОстаток = КоличествоНачисленияОстаток - СтрокаУчетногоАктива.Количество;
		
		//Начисление дивидендов
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаНачисления, ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Начисление дивидендов");
		
		Проводка.СчетДт = ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами47;
		
		Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
			УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ЭтотОбъект.Дата, ЭтотОбъект.ЦеннаяБумага);
			Проводка.СубконтоДт.Контрагенты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		Иначе		
	    	Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
		КонецЕсли;
		Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
		
		Проводка.ВалютаДт  = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
		Проводка.ВалютнаяСуммаДт = СуммаНачисления;
		
		ГФУДивидендов = УчетныйАктивЕПС.АналитикаДивидендов;
		Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
			Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дивиденды;
			ГФУДивидендов = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду(СтрЗаменить(ГФУДивидендов.Код, "3450", "3480"));
			Проводка.Содержание = "Начисление дивидендов по ИСУ";
		ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
			ГФУДивидендов = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду(СтрЗаменить(ГФУДивидендов.Код, "346", "347"));
		КонецЕсли;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций05;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУДивидендов;
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
		
		Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дивиденды;
		
		
		Если НастройкиУчетаОбщие.НачислятьОбязательстваПоОплатеНалогаСДивидендов Тогда // для волги
		
			//Расчетный налог
			// Согласно п. 6 ст. 52 НК РФ нужно округлять сумму налога
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Окр(СуммаНачисления - СуммаНачисленияБезНалога), ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Резерв по налогу на дивиденды");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности02;
				
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("55501");
			
			
			Проводка.СчетКт = ПланыСчетов.Единый.РезервыОценочныеОбязательстваНекредитногоХарактера;
			
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
			Проводка.СубконтоКт.Резервы = Справочники.Резервы.ПоНалогуНаПрибыльСДивидендов;
			
		КонецЕсли;
		
		//Закрытие парных счетов
		БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Ложь, Ложь, МассивЦенныхБумаг, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.НачислениеДивидендов.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		,
		УчетныйРегистр, 
		Отказ, Истина);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  
		
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект,
		"Количество, СуммаОбъявленная, Сумма, ПроцентНалога");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.Дата < ЭтотОбъект.ДатаРеестра Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа не может быть меньше даты фиксации", ЭтотОбъект, "ДатаРеестра",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ВалютаОплаты <> ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта оплаты отличается от валюты номинала ценной бумаги", ЭтотОбъект, "ВалютаОплаты",, Отказ);
		КонецЕсли;

		ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект);
		
		Если ДетализацияПоРасчетномуСчету Тогда
			Если Не ЗначениеЗаполнено(РасчетныйСчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Расчетный счёт"" не заполнено", ЭтотОбъект, "РасчетныйСчет",, Отказ);			
			Иначе
				Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета отличается от валюты номинала ценной бумаги", ЭтотОбъект, "РасчетныйСчет",, Отказ);
				КонецЕсли;
				Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.ВалютаОплаты Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета отличается от валюты оплаты", ЭтотОбъект, "РасчетныйСчет",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);

	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
