Процедура ПоместитьОбъектыНедвижимостиДляСЧАВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц,
	Организация, СчетДоверительногоУправления, Период, Отказ) Экспорт
																
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА СделкаСНедвижимостью.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА СделкаСНедвижимостью.ВидПраваНаНедвижимость
		|		КОГДА ЗаявкаПайщика.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.ПустаяСсылка)
		|	КОНЕЦ КАК ВидПраваНаНедвижимость,
		|	ВЫБОР
		|		КОГДА СделкаСНедвижимостью.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА СделкаСНедвижимостью.ВидСделки
		|		КОГДА ЗаявкаПайщика.Ссылка ЕСТЬ НЕ NULL 
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСделок.ПустаяСсылка)
		|	КОНЕЦ КАК ВидСделки,
		|	УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи <> ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.) КАК ЕстьАктПриемаПередачи,
		|	УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности <> ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.) КАК ЕстьСведенияОГосРегистрацииПраваСобственности,
		|	СделкаСНедвижимостью.Договор КАК Договор
		|ПОМЕСТИТЬ _НедвижимостьПоРегистру
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|			&ДатаОценки,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО УсловияСделокСНедвижимостьюСрезПоследних.Основание = СделкаСНедвижимостью.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ПО УсловияСделокСНедвижимостьюСрезПоследних.Основание = ЗаявкаПайщика.Ссылка
		|ГДЕ
		|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|	И УсловияСделокСНедвижимостьюСрезПоследних.Активность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _НедвижимостьПоРегистру.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Инвестконтракт)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ _НедвижимостьПоРегистру.ЕстьАктПриемаПередачи
		|							И НЕ _НедвижимостьПоРегистру.ЕстьСведенияОГосРегистрацииПраваСобственности
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Инвестконтракт)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|				КОНЕЦ
		|		КОГДА _НедвижимостьПоРегистру.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.ДДУ)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ _НедвижимостьПоРегистру.ЕстьАктПриемаПередачи
		|							И НЕ _НедвижимостьПоРегистру.ЕстьСведенияОГосРегистрацииПраваСобственности
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.ДДУ)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|				КОНЕЦ
		|		КОГДА _НедвижимостьПоРегистру.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ _НедвижимостьПоРегистру.ЕстьАктПриемаПередачи
		|							И НЕ _НедвижимостьПоРегистру.ЕстьСведенияОГосРегистрацииПраваСобственности
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|				КОНЕЦ
		|		ИНАЧЕ _НедвижимостьПоРегистру.ВидПраваНаНедвижимость
		|	КОНЕЦ КАК ВидПраваНаНедвижимость,
		|	_НедвижимостьПоРегистру.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_НедвижимостьПоРегистру.Основание КАК Основание,
		|	_НедвижимостьПоРегистру.ВидСделки КАК ВидСделки,
		|	_НедвижимостьПоРегистру.ЕстьСведенияОГосРегистрацииПраваСобственности КАК ЕстьСведенияОГосРегистрацииПраваСобственности,
		|	_НедвижимостьПоРегистру.ЕстьАктПриемаПередачи КАК ЕстьАктПриемаПередачи,
		|	ДатыПризнанияИмущественныхПрав.Значение КАК ДатаПризнанияИмущественныхПрав
		|ПОМЕСТИТЬ _НедвижимостьПоУсловиямПСЧА
		|ИЗ
		|	_НедвижимостьПоРегистру КАК _НедвижимостьПоРегистру
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДатыПризнанияИмущественныхПрав
		|		ПО _НедвижимостьПоРегистру.Договор = ДатыПризнанияИмущественныхПрав.Объект
		|			И (ДатыПризнанияИмущественныхПрав.Свойство.Ключ = ""ДатаПризнанияИмущественныхПравПоДоговору"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НедвижимостьПоУсловиямПСЧА.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА _НедвижимостьПоУсловиямПСЧА.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ) КАК Количество
		|ПОМЕСТИТЬ _ВСобственности
		|ИЗ
		|	_НедвижимостьПоУсловиямПСЧА КАК _НедвижимостьПоУсловиямПСЧА
		|ГДЕ
		|	_НедвижимостьПоУсловиямПСЧА.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность)
		|
		|СГРУППИРОВАТЬ ПО
		|	_НедвижимостьПоУсловиямПСЧА.ОбъектНедвижимости
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА _НедвижимостьПоУсловиямПСЧА.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НедвижимостьПоУсловиямПСЧА.ВидПраваНаНедвижимость КАК ВидПраваНаНедвижимость,
		|	_НедвижимостьПоУсловиямПСЧА.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_НедвижимостьПоУсловиямПСЧА.Основание КАК Основание,
		|	_НедвижимостьПоУсловиямПСЧА.ВидСделки КАК ВидСделки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ИмущественныеПрава) КАК ВидАктива
		|ПОМЕСТИТЬ _ОбъектыНедвижимости
		|ИЗ
		|	_НедвижимостьПоУсловиямПСЧА КАК _НедвижимостьПоУсловиямПСЧА
		|ГДЕ
		|	_НедвижимостьПоУсловиямПСЧА.ВидПраваНаНедвижимость В (ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Инвестконтракт), ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.ДДУ))
		|	И ЕСТЬNULL(_НедвижимостьПоУсловиямПСЧА.ДатаПризнанияИмущественныхПрав, &ДатаОценки) <= &ДатаОценки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_НедвижимостьПоУсловиямПСЧА.ВидПраваНаНедвижимость,
		|	_НедвижимостьПоУсловиямПСЧА.ОбъектНедвижимости,
		|	_НедвижимостьПоУсловиямПСЧА.Основание,
		|	_НедвижимостьПоУсловиямПСЧА.ВидСделки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ПраваАренды)
		|ИЗ
		|	_НедвижимостьПоУсловиямПСЧА КАК _НедвижимостьПоУсловиямПСЧА
		|ГДЕ
		|	_НедвижимостьПоУсловиямПСЧА.ВидПраваНаНедвижимость В (ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Собственность),
		|	_ВСобственности.ОбъектНедвижимости,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)
		|ИЗ
		|	_ВСобственности КАК _ВСобственности";
	
	Запрос.УстановитьПараметр("ДатаОценки", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"УНИЧТОЖИТЬ _НедвижимостьПоРегистру
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _НедвижимостьПоУсловиямПСЧА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ _ВСобственности";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПоместитьСтоимостиОбъектовНедвижимостиПоСчетуДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, 
	ВариантРасчетаОценочнойСтоимости, Организация, СчетДоверительногоУправления, Период, Отказ) Экспорт 
			
	ПоместитьОбъектыНедвижимостиДляСЧАВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц,Организация, СчетДоверительногоУправления, Период, Отказ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОбъектыНедвижимости.ВидПраваНаНедвижимость КАК ВидПраваНаНедвижимость,
		|	_ОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	_ОбъектыНедвижимости.Основание КАК Основание,
		|	_ОбъектыНедвижимости.ВидСделки КАК ВидСделки,
		|	_ОбъектыНедвижимости.ВидАктива КАК ВидАктива,
		|	&Рубли КАК Валюта,
		|	ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0) КАК Стоимость,
		|	ЛОЖЬ КАК ЕстьОбесценение,
		|	ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия, 0) КАК ДатаОкончанияДействия
		|ПОМЕСТИТЬ _СтоимостиОбъектовНедвижимости
		|ИЗ
		|	_ОбъектыНедвижимости КАК _ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
		|				&ДатаОценки,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И (Основание, СубъектАналитики) В
		|						(ВЫБРАТЬ
		|							_ОбъектыНедвижимости.Основание,
		|							_ОбъектыНедвижимости.ОбъектНедвижимости
		|						ИЗ
		|							_ОбъектыНедвижимости)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
		|			И _ОбъектыНедвижимости.Основание = ОценкиСтоимостиПрочихАктивовСрезПоследних.Основание
		|			И (ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия >= &ДатаОценки)";
	
	Запрос.УстановитьПараметр("ДатаОценки", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Рубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	Запрос.Выполнить();

	Запрос.Текст = "УНИЧТОЖИТЬ _ОбъектыНедвижимости";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьОбъектИмуществаДляКодаОКТМО(Организация, СчетДоверительногоУправления, КодОКТМО, Период) Экспорт
	
	//объект недвижимости должен считаться по средней и быть в наличии на указанную дату
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ТОГДА 1
		|			КОГДА УсловияСделокСНедвижимостьюСрезПоследних.Основание ССЫЛКА Документ.ЗаявкаПайщика
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ) КАК Остаток
		|ПОМЕСТИТЬ _ОбъектыНедвижимости
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ОбъектНедвижимости.ВидОбъектаНедвижимости <> ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.ЗемельныйУчасток)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|ГДЕ
		|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|	И ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности КАК Документ.СведенияОРегистрацииПраваСобственности).Дата < &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|				ТОГДА 1
		|			КОГДА УсловияСделокСНедвижимостьюСрезПоследних.Основание ССЫЛКА Документ.ЗаявкаПайщика
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости
		|ИЗ
		|	_ОбъектыНедвижимости КАК _ОбъектыНедвижимости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО _ОбъектыНедвижимости.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|			И (РеквизитыОбъектовНедвижимостиСрезПоследних.КодОКТМО = &КодОКТМО)
		|ГДЕ
		|	НЕ ВЫБОР
		|			КОГДА РеквизитыОбъектовНедвижимостиСрезПоследних.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ТоварыКвартирыПомещения)
		|				ТОГДА ИСТИНА
		|			КОГДА РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.ВидОбъектаНедвижимости = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.Помещение)
		|					И РеквизитыОбъектовНедвижимостиСрезПоследних.НазначениеОбъектаНедвижимости <> &Жилое
		|				ТОГДА ИСТИНА
		|			КОГДА РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.ВидОбъектаНедвижимости = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовНедвижимости.МашиноМесто)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("КодОКТМО", КодОКТМО);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Жилое", ОбщегоНазначения.ПолучитьИменованныйОбъект("НазначениеНедвижимости_ЖилоеПомещение"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
	Иначе
		Возврат Справочники.ОбъектыНедвижимости.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции