&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПоказатьИсториюИзменений(ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьИсториюИзменений(Команда)

	Элементы.ФормаПоказатьИсториюИзменений.Пометка = Не Элементы.ФормаПоказатьИсториюИзменений.Пометка;
	
	ПоказатьИсториюИзменений(ЭтаФорма);		

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьИсториюИзменений(ЭтаФорма)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("История", ЭтаФорма.Элементы.ФормаПоказатьИсториюИзменений.Пометка); 	
	
КонецПроцедуры


