
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Состояние(НСтр("ru = 'Проверка учетной записи'"),, НСтр("ru = 'Выполняется проверка учетной записи. Подождите...'"));
	
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Пароль")) Тогда
		ПарольПараметр = Неопределено;
	Иначе
		ПараметрУчетнаяЗапись = Новый Структура("УчетнаяЗапись", ПараметрКоманды);
		
		ПарольПараметр = ОткрытьФормуМодально("ОбщаяФорма.ПодтверждениеПароляУчетнойЗаписи", ПараметрУчетнаяЗапись);
		Если ТипЗнч(ПарольПараметр) <> Тип("Строка") Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	СообщениеОбОшибке       = "";
	ДополнительноеСообщение = "";
	
	РаботаСЭлектроннойПочтой.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(ПараметрКоманды, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Предупреждение(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Проверка параметров учетной записи завершилась с ошибками:
								   |%1'"), СообщениеОбОшибке),,
						НСтр("ru = 'Проверка учетной записи'"));
	Иначе
		Предупреждение(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Проверка параметров учетной записи завершилась успешно. %1'"),
						ДополнительноеСообщение),,
						НСтр("ru = 'Проверка учетной записи'"));
	КонецЕсли;
	
КонецПроцедуры
