
Функция СформироватьНаименование(РеквизитыДоговора, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Контрагент, НомерДоговора, ДатаЗаключения, ВидДоговора, Основание, ВидДокументаДляПредставления";
	
	Если РеквизитыДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Наименование = "";
	
	Если Не ПустаяСтрока(РеквизитыДоговора.НомерДоговора) 
	 ИЛИ ЗначениеЗаполнено(РеквизитыДоговора.Контрагент)
	 ИЛИ ЗначениеЗаполнено(РеквизитыДоговора.ДатаЗаключения) Тогда
	
		Контрагент = РеквизитыДоговора.Контрагент;
		Если ЗначениеЗаполнено(РеквизитыДоговора.ВидДокументаДляПредставления) Тогда
			ВидДоговора = НРег(РеквизитыДоговора.ВидДокументаДляПредставления);
			
		ИначеЕсли      РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
	    	ВидДоговора	= "доп. согл.";
			
		ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.ДополнениеПравил Тогда	
			ВидДоговора	= "дополн. правил";
			Контрагент = РеквизитыДоговора.Основание;
			
		ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.Прочее Тогда
			ВидДоговора	= "договор";
			
		ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.БанковскогоОбслуживания
			ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.БанковскогоДепозита
			ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.КомплексногоОбслуживания 
			ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоров.Цессии Тогда
				ВидДоговора	= "договор " + НРег(РеквизитыДоговора.ВидДоговора);

		Иначе
			ВидДоговора	= НРег(РеквизитыДоговора.ВидДоговора);
		КонецЕсли;
		
		Если ПустаяСтрока(РеквизитыДоговора.НомерДоговора) Тогда
			Наименование = "" + Контрагент + ", " + ВидДоговора + " от " + Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yy");
		Иначе
			Наименование = "" + Контрагент + ", " + ВидДоговора + " № " + РеквизитыДоговора.НомерДоговора + " от " + Формат(РеквизитыДоговора.ДатаЗаключения, "ДФ=dd.MM.yy");
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименование

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ВидыДоговоровБанковскогоОбслуживания = ВидыДоговоровБанковскогоОбслуживания();
	
	Если (ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаСписка") 
		И Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("ВидДоговора")
		И (ВидыДоговоровБанковскогоОбслуживания.Найти(Параметры.Отбор.ВидДоговора) <> Неопределено
			ИЛИ (ТипЗнч(Параметры.Отбор.ВидДоговора) = Тип("Массив") ИЛИ ТипЗнч(Параметры.Отбор.ВидДоговора) = Тип("ФиксированныйМассив"))
				И РаботаСКоллекциями.ЭлементыПервогоСпискаВходятВоВторойСписок(Параметры.Отбор.ВидДоговора, ВидыДоговоровБанковскогоОбслуживания))
	Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма		 = Метаданные.Справочники.Договоры.Формы.ДоговорыБанковскогоОбслуживания;					
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДатуРасторженияДоговора(Договор, Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения КАК ДатаРасторжения
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, Договор = &Договор) КАК УсловияДоговоровОбщиеСрезПоследних";
	
	Запрос.УстановитьПараметр("Период"	, Период);
	Запрос.УстановитьПараметр("Договор"	, Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаРасторжения;
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции

Функция ВидыДоговоровБанковскогоОбслуживания(ВидБанковскогоСчета = Неопределено) Экспорт
	
	ВидыДоговоров = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ВидБанковскогоСчета) Тогда
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоОбслуживания);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоДепозита);
	
	ИначеЕсли ВидБанковскогоСчета = Перечисления.ВидыБанковскихСчетов.ДепозитныйСчет Тогда
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоДепозита);
		
	Иначе
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
		ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоОбслуживания);
		
	КонецЕсли;
		
	Возврат ВидыДоговоров;		
	
КонецФункции

Функция КонтрольПериодаУсловийДопСоглашения(НаборЗаписей, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей.Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Договор КАК Договор
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК _НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Договор КАК Договор,
		|	Основания.ВидДоговора КАК ВидДоговораОснования
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДопСоглашения
		|		ПО _НаборЗаписей.Договор = ДопСоглашения.Ссылка
		|			И (ДопСоглашения.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДополнительноеСоглашение))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Основания
		|		ПО (ДопСоглашения.Основание = Основания.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Основания.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОказанияАудиторскихУслуг)
		|				ТОГДА _НаборЗаписей.Период <> ДопСоглашения.ДатаЗаключения
		|			ИНАЧЕ _НаборЗаписей.Период < ДопСоглашения.ДатаЗаключения
		|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДоговораОснования = Перечисления.ВидыДоговоров.ОказанияАудиторскихУслуг Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Период условий доп.соглашения к договору %1 должен быть равен дате заключения. Доп.соглашение %2 Период %3", Выборка.ВидДоговораОснования, Выборка.Договор, Выборка.Период), Выборка.Договор,,, Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Период условий доп.соглашения не может быть раньше даты заключения. Доп.соглашение %1 Период %2", Выборка.Договор, Выборка.Период), Выборка.Договор,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ОрганизацииБезКонтроляУсловийАудиторскихУслуг() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	
	Возврат Результат;
	
КонецФункции	

Процедура КонтрольУсловийОказанияАудиторскихУслугПоВидуСчетаДУ(НаборЗаписей, Отказ) Экспорт
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	

	Если ОрганизацииБезКонтроляУсловийАудиторскихУслуг().Найти(НаборЗаписей[0].Организация) <> Неопределено Тогда 		
		
		Возврат;
		
	КонецЕсли;	
	
	СчетВнутреннегоУчета = СчетВнутреннегоУчетаПоДоговору(НаборЗаписей[0].Организация, НаборЗаписей[0].Договор);
	Если СчетВнутреннегоУчета = Неопределено Тогда
		
		ТекстСообщения = "Контроль видов отчетности по виду договора счета Д/У:
							|Перед добавлением условий оказания аудиторских услуг "
							+ "необходимо связать договор со счетом внутреннего учета!";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
		
	КонецЕсли;	
	
	КонтролируемыеВидыОтчетности = КонтролируемыеВидыОтчетностиПоСчетуДоверительногоУправления(СчетВнутреннегоУчета);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей",                 НаборЗаписей.Выгрузить());
	Запрос.УстановитьПараметр("КонтролируемыеВидыОтчетности", КонтролируемыеВидыОтчетности);
	Запрос.Текст = ТекстЗапросаКонтроляВидовОтчетностиУсловийДоговоровОказанияАудиторскихУслуг();
	
	Запрос.Выполнить();
	
	СистемныеФункции.ПоместитьРезультатСравненияТаблицЗначенийВМенеджерВременныхТаблиц(Запрос, 
																						"_ВидыОтчетностиНаборЗаписей", 
																						"_ВидыОтчетностиКонтроль", 
																						"_РазличияВидыОтчетности", 
																						СтрРазделить("ВидОтчетности", ",", ЛОЖЬ));
	
	ВыборкаРасхождения = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_РазличияВидыОтчетности").Выбрать();
	
	Если ВыборкаРасхождения.Количество() Тогда
		
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетВнутреннегоУчета, "ВидДоговораДоверительногоУправления");
		
		ТекстСообщения = СтрШаблон("Для счета доверительного учета с видом договора ""%1"" в условиях договоров оказания "
									+ "аудиторских услуг должны быть выбраны следующие виды отчетности: %2%3.%4",
									ВидДоговора,
									Символы.ПС,
									СтрСоединить(КонтролируемыеВидыОтчетности.ВыгрузитьКолонку("ВидОтчетности"), ", "),
									Символы.ПС + Символы.ПС);
			
		Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		Иначе
			
			Пока ВыборкаРасхождения.Следующий() Цикл
				
				ТекстСообщения = ТекстСообщения 
					+ СтрШаблон("Вид отчетности ""%1"" необходимо %2", 
								ВыборкаРасхождения.ВидОтчетности, 
								?(ВыборкаРасхождения.Статус = 1, "добавить в условия.", "удалить из условий.")) 
					+ Символы.ПС + Символы.ПС;
				
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаКонтроляВидовОтчетностиУсловийДоговоровОказанияАудиторскихУслуг()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.ВидОтчетности КАК ВидОтчетности,
		|	0 КАК Техническая
		|ПОМЕСТИТЬ _ВидыОтчетностиНаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтролируемыеВидыОтчетности.ВидОтчетности КАК ВидОтчетности,
		|	0 КАК Техническая
		|ПОМЕСТИТЬ _ВидыОтчетностиКонтроль
		|ИЗ
		|	&КонтролируемыеВидыОтчетности КАК КонтролируемыеВидыОтчетности";
	
	Возврат ТекстЗапроса;	

КонецФункции

Процедура КонтрольУсловийОказанияАудиторскихУслугДопСоглашения(НаборЗаписей, Отказ) Экспорт
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаборЗаписей[0].Договор, "ВидДоговора") <> Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей.Выгрузить());
	Запрос.УстановитьПараметр("Договор",      НаборЗаписей[0].Договор);
	Запрос.Текст = ТекстЗапросаКонтроляВидовОтчетностиДопСоглашения();
	
	Запрос.Выполнить();
	
	СистемныеФункции.ПоместитьРезультатСравненияТаблицЗначенийВМенеджерВременныхТаблиц(Запрос, 
																						"_ВидыОтчетностиНаборЗаписей", 
																						"_ВидыОтчетностиКонтроль", 
																						"_РазличияВидыОтчетности", 
																						СтрРазделить("ВидОтчетности", ",", ЛОЖЬ));
	
	ВыборкаРасхождения = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_РазличияВидыОтчетности").Выбрать();
	
	КонтролируемыеВидыОтчетности = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ВидыОтчетностиКонтроль").Выгрузить().ВыгрузитьКолонку("ВидОтчетности");
	
	Если ВыборкаРасхождения.Количество() Тогда
		
		ТекстСообщения = СтрШаблон("В условиях оказания аудиторских услуг дополнительного соглашения " 
									+ "должны быть выбраны такие же виды отчетности, как и в договоре-основании: %1%2.%3",
									Символы.ПС,
									СтрСоединить(КонтролируемыеВидыОтчетности, ", "),
									Символы.ПС + Символы.ПС);
			
		Пока ВыборкаРасхождения.Следующий() Цикл
			
			ТекстСообщения = ТекстСообщения 
				+ СтрШаблон("Вид отчетности ""%1"" необходимо %2", 
							ВыборкаРасхождения.ВидОтчетности, 
							?(ВыборкаРасхождения.Статус = 1, "добавить в условия.", "удалить из условий."))
				+ Символы.ПС + Символы.ПС;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаКонтроляВидовОтчетностиДопСоглашения()

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.ВидОтчетности КАК ВидОтчетности,
		|	0 КАК Техническая
		|ПОМЕСТИТЬ _ВидыОтчетностиНаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровОказанияАудиторскихУслуг.ВидОтчетности КАК ВидОтчетности,
		|	0 КАК Техническая
		|ПОМЕСТИТЬ _ВидыОтчетностиКонтроль
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(УсловияДоговоровОказанияАудиторскихУслуг.Период) КАК Период,
		|			УсловияДоговоровОказанияАудиторскихУслуг.Организация КАК Организация,
		|			УсловияДоговоровОказанияАудиторскихУслуг.Договор КАК Договор
		|		ИЗ
		|			РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|		ГДЕ
		|			УсловияДоговоровОказанияАудиторскихУслуг.Договор = ВЫРАЗИТЬ(&Договор КАК Справочник.Договоры).Основание
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Период <= ВЫРАЗИТЬ(&Договор КАК Справочник.Договоры).ДатаЗаключения
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Организация = ВЫРАЗИТЬ(&Договор КАК Справочник.Договоры).Организация
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияДоговоровОказанияАудиторскихУслуг.Организация,
		|			УсловияДоговоровОказанияАудиторскихУслуг.Договор) КАК ПериодУсловийОснования
		|		ПО УсловияДоговоровОказанияАудиторскихУслуг.Период = ПериодУсловийОснования.Период
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Договор = ПериодУсловийОснования.Договор
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Организация = ПериодУсловийОснования.Организация";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция СчетВнутреннегоУчетаПоДоговору(Организация, Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Договор",     Договор);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|			,
		|			Активный
		|				И Организация = &Организация
		|				И Договор = &Договор) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда

		Возврат Выборка.СчетДоверительногоУправления;

	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция КонтролируемыеВидыОтчетностиПоСчетуДоверительногоУправления(СчетВнутреннегоУчета)
	
	КонтролируемыеВидыОтчетности = Новый ТаблицаЗначений;
	КонтролируемыеВидыОтчетности.Колонки.Добавить("ВидОтчетности", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОтчетностиПодлежащиеАудиторскойПроверке"));
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетВнутреннегоУчета, "ВидДоговораДоверительногоУправления");
	
	Если ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
		
		НоваяСтрока = КонтролируемыеВидыОтчетности.Добавить();
		НоваяСтрока.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяБухгалтерская;
		НоваяСтрока = КонтролируемыеВидыОтчетности.Добавить();
		НоваяСтрока.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяФинансоваяОтчетность;
		
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда

		НоваяСтрока = КонтролируемыеВидыОтчетности.Добавить();
		НоваяСтрока.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ОтчетностьВОтношенииИмуществаПИФ;
		
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР Тогда

		НоваяСтрока = КонтролируемыеВидыОтчетности.Добавить();
		НоваяСтрока.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.БухгалтерскаяФинансоваяПоФормированиюИИнвестированиюПН;
		
	КонецЕсли;	
	
	Возврат КонтролируемыеВидыОтчетности;
	
КонецФункции	

Функция ПериодУсловийДопСоглашенияНеРавенДатеЗаключения(Договор, ДатаЗаключения) Экспорт
	
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("ДатаЗаключения", ДатаЗаключения);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УсловияДоговоровОбщие.Период КАК Период
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|ГДЕ
		|	УсловияДоговоровОбщие.Договор = &Договор
		|	И УсловияДоговоровОбщие.Период <> &ДатаЗаключения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияДоговоровОказанияАудиторскихУслуг.Период
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|ГДЕ
		|	УсловияДоговоровОказанияАудиторскихУслуг.Договор = &Договор
		|	И УсловияДоговоровОказанияАудиторскихУслуг.Период <> &ДатаЗаключения";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура УстановитьПериодУсловийДопСоглашенияРавныйДатеЗаключения(Договор, ДатаЗаключения) Экспорт
	
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УсловияДоговоровОбщие.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Договор);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Период = ДатаЗаключения;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УсловияДоговоровОказанияАудиторскихУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Договор);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Период = ДатаЗаключения;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоИнвестконтракт(Актив) Экспорт
	
	Возврат ТипЗнч(Актив) = Тип("СправочникСсылка.Договоры") 
		И (Актив.ВидДоговора = Перечисления.ВидыДоговоров.СтроительствоНаСвоемУчастке 
			ИЛИ Актив.ВидДоговора = Перечисления.ВидыДоговоров.СтроительствоНаЧужомУчастке);
			
КонецФункции
