
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ВидДоговора") Тогда
			
		Если ДанныеЗаполнения.ВидДоговора = Перечисления.ВидыДоговоров.ДополнениеПравил Тогда
			
			Если ДанныеЗаполнения.Свойство("Основание") Тогда
				Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
					УправляющаяКомпания 	= Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФНаДату(ТекущаяДатаСеанса(), ДанныеЗаполнения.Основание);
					ЭтотОбъект.Контрагент 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
			
			Если ДанныеЗаполнения.Свойство("Основание") Тогда
				Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда 
					Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ДанныеЗаполнения.Основание, ТекущаяДата());
					Если ТипЗнч(Клиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
						ЭтотОбъект.Контрагент = Клиент;
					ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
						УправляющаяКомпания 	= Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФНаДату(ТекущаяДатаСеанса(), Клиент);
						ЭтотОбъект.Контрагент 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
					КонецЕсли;
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.Основание) = Тип("СправочникСсылка.Договоры") Тогда 
					ЭтотОбъект.Контрагент = ДанныеЗаполнения.Основание.Контрагент;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Наименование, НомерДоговора, ДатаЗаключения");

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение
	 ИЛИ ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнениеПравил
	 ИЛИ ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Залога
	 ИЛИ ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Поручительства Тогда
		
		ПроверяемыеРеквизиты.Добавить("Основание");
		
	КонецЕсли;
	
	Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение
	   И ПроверяемыеРеквизиты.Найти("НомерДоговора") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерДоговора"));	
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЭтоДопСоглашениеСчетаДУ = (ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение
		И ТипЗнч(ЭтотОбъект.Основание) = Тип("СправочникСсылка.СчетаДоверительногоУправления"));
		
	Если Не ЭтоДопСоглашениеСчетаДУ Тогда
		ЭтотОбъект.ДатаИзмененияВознаграждения = Неопределено;		
	КонецЕсли;
		
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		// Блокирующие проверки
		
		Если Не ЭтотОбъект.ОбменДанными.Загрузка Тогда
			
			УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
			
			Если ТипЗнч(ЭтотОбъект.Основание) = Тип("СправочникСсылка.СчетаДоверительногоУправления")
				И ЭтотОбъект.Основание.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
			Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В качестве основания доп.правил следует выбрать ПИФ!", ЭтотОбъект, "Основание",, Отказ);
			КонецЕсли;
			
			Если Не РаботаСНормативноСправочнойИнформацией.ЭтоУникальныйДоговор(ЭтотОбъект) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор с такими номером и датой уже был заключен", ЭтотОбъект, "НомерДоговора",, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Прочее
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Залога
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Поручительства
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДоговорКуплиПродажи 
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДоговорМНО
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.АгентскийДоговор
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДополнительноеСоглашение
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДополнениеПравил
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.МировоеСоглашение
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ПоручениеНаПроведениеИдентификации
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДоговорСтрахования
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ВедениеРеестраВладельцевИменныхЦенныхБумаг
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ОказанияАудиторскихУслуг
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.БанковскогоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.БанковскогоДепозита
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ГенСоглашениеПоКонверсионнымОперациям
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Оценки
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СоглашениеОбЭДО
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.БрокерскогоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ВеденияРеестра
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ОтветственногоХранения
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.КомплексногоОбслуживания
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ЗаявкаНаПогашениеПаев
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ТрудовойДоговор
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СоглашениеОбОтступном
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Цессии
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СтроительствоНаСвоемУчастке
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.СтроительствоНаЧужомУчастке
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.ДДУ
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.Аренды
				И ЭтотОбъект.ВидДоговора <> Перечисления.ВидыДоговоров.КоммунальныеУслуги
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид договора '" + ЭтотОбъект.ВидДоговора + "' ведется в других справочниках учетной системы", ЭтотОбъект, "ВидДоговора",, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.КомплексногоОбслуживания 
				И Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(ЭтотОбъект.Контрагент, "Банки") = Неопределено
			Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагентом по договорам комплексного обслуживания может быть только банк", ЭтотОбъект, "ВидДоговора", , Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Залога
				ИЛИ ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Поручительства
			Тогда
			
				Если ТипЗнч(ЭтотОбъект.Основание) <> Тип("СправочникСсылка.Займы") Тогда
					ТекстСообщения = СтрШаблон("Для договора %1 основанием может быть только займ", ЭтотОбъект.ВидДоговора);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Основание", , Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
			// Проверка изменений вознаграждения
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИзмененияВознаграждения) И ЭтотОбъект.ДатаИзмененияВознаграждения < ЭтотОбъект.ДатаЗаключения Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата изменения вознаграждения должна быть не ранее даты соглашения", ЭтотОбъект, "ДатаИзмененияВознаграждения", , Отказ);
				
			КонецЕсли;
			
			Если Не ЭтотОбъект.ЭтоНовый() И ЭтоДопСоглашениеСчетаДУ Тогда
				
				КлючНастроекРасчетаВознаграждения = РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего.ПолучитьКлючНастроекРасчетаВознагражденияПоОснованию(ЭтотОбъект.Ссылка); 		
				
				Если КлючНастроекРасчетаВознаграждения <> Неопределено Тогда
					
					Если ЗначениеЗаполнено(ЭтотОбъект.ДатаИзмененияВознаграждения) Тогда
						
						Если ЭтотОбъект.ДатаИзмененияВознаграждения <> КлючНастроекРасчетаВознаграждения.Период Тогда
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								"Дата изменения вознаграждения должна совпадать с датой связанных с данным соглашением настроек расчета вознаграждения.",
								КлючНастроекРасчетаВознаграждения, "Основание", , Отказ);
							
						КонецЕсли;
						
					Иначе
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"В настройках расчета вознаграждения добавлена связь с данным соглашением. "
							"Необходимо изменить основание в настройках расчета или заполнить дату изменения вознаграждения в данном соглашении.",
							КлючНастроекРасчетаВознаграждения, "Основание", , Отказ);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДоговорСчетаДоверительногоУправления") Тогда
		РегистрыСведений.ДоговорыСчетовДоверительногоУправления.ДобавитьСвязьДоговораИСчетаДоверительногоУправления(
			ЭтотОбъект.ДатаЗаключения,
			ЭтотОбъект,
			ЭтотОбъект.ДополнительныеСвойства.ДоговорСчетаДоверительногоУправления,
			Отказ);
	КонецЕсли;	
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДатаРасторжения") Тогда
		РегистрыСведений.УсловияДоговоровОбщие.ДобавитьДатуРасторжения(ЭтотОбъект.ДатаЗаключения, ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства.ДатаРасторжения);
	КонецЕсли;
	
	Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
		Справочники.Договоры.УстановитьПериодУсловийДопСоглашенияРавныйДатеЗаключения(ЭтотОбъект.Ссылка, ЭтотОбъект.ДатаЗаключения);
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ВидДоговораАренды") Тогда
		РегистрыСведений.УсловияДоговоровАренды.УстановитьВидДоговораАренды(ЭтотОбъект.ДатаЗаключения, ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства.ВидДоговораАренды);
	КонецЕсли;
	
	ПроверитьСоответствиеСоглашенияИНастроекРасчетаВознаграждения(Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	ПроверитьСоответствиеСоглашенияИНастроекРасчетаВознаграждения(Отказ);
	
КонецПроцедуры

Процедура ПроверитьСоответствиеСоглашенияИНастроекРасчетаВознаграждения(Отказ)
	
	// При успешной записи доп.соглашения с изменениями вознаграждения добавим проверку наличия настроек расчета вознаграждения
	
	Если Не Отказ Тогда
	
		ЭтоДопСоглашениеСчетаДУ = (ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение
			И ТипЗнч(ЭтотОбъект.Основание) = Тип("СправочникСсылка.СчетаДоверительногоУправления"));

		Если ЭтоДопСоглашениеСчетаДУ И ЗначениеЗаполнено(ЭтотОбъект.ДатаИзмененияВознаграждения) Тогда
			
			ПланируемаяДатаЗапуска = НачалоДня(ТекущаяДата()) + 86400 + 10 * 60 * 60; // 10:00 завтрашнего дня
			
			ПараметрыКоманды = Новый Структура;
			ПараметрыКоманды.Вставить("Соглашение", ЭтотОбъект.Ссылка);
			
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(
				"Обработки.РасчетВознагражденияУправляющего", "ВыполнитьКонтрольСоответствияСоглашенияИНастроекРасчетаВУК", ПараметрыКоманды, , , ПланируемаяДатаЗапуска);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры