
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	ОпределитьИсходящийДокументНаСервере();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////


&НаСервере
Процедура ОпределитьИсходящийДокументНаСервере()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходящийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИсходящийДокумент КАК ИсходящийДокумент
		|ГДЕ
		|	ИсходящийДокумент.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	ИсходящиеДокументы = Запрос.Выполнить().Выбрать();
	
	Если ИсходящиеДокументы.Следующий() Тогда
		УведомлениеОбУстранении =  ИсходящиеДокументы.Ссылка;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры
