
Функция ПолучитьГруппуИсполнителей(Родитель, Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Родитель", 		Родитель);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыПользователей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыПользователей КАК ГруппыПользователей
		|ГДЕ
		|	ГруппыПользователей.Организация = &Организация
		|	И ГруппыПользователей.Родитель = &Родитель";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		ВызватьИсключение "Не найдена группа пользователей для организации " + СокрЛП(Организация) + " в группе " + СокрЛП(Родитель);
	КонецЕсли;
	
КонецФункции	