// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Проверка параметров начисления дивидендов",
		"1.20",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПроверкаПараметровДивидендов", "Проверка параметров начисления дивидендов",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
		
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	Если Найти(ИдентификаторКоманды, "ПроверкаПараметровДивидендов") = 1  Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		Попытка
			ЭтотОбъект.Период = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ТекущаяДата()); 
			ПроверитьИЗаписатьИзмененияПоДивидендам(ПараметрыСессии);
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура Пауза(Секунды)
	 
	ВремяОкончания = ТекущаяДата() + Секунды;
	Пока ТекущаяДата() <= ВремяОкончания Цикл	
	КонецЦикла;
	
КонецПроцедуры 

Функция ВернутьСписокОжидаемыхВыплат()
	
	Результат = Новый Структура();
	
	МВТ = Новый	 МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДивидендыПоАкциямСрезПоследних.Период КАК Период,
	|	ДивидендыПоАкциямСрезПоследних.Акция КАК Акция,
	|	ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
	|	ДивидендыПоАкциямСрезПоследних.ДатаФиксации КАК ДатаФиксации,
	|	ДивидендыПоАкциямСрезПоследних.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
	|	ДивидендыПоАкциямСрезПоследних.Валюта КАК Валюта,
	|	ДивидендыПоАкциямСрезПоследних.Д1 КАК Д1,
	|	ДивидендыПоАкциямСрезПоследних.Д2 КАК Д2,
	|	ДивидендыПоАкциямСрезПоследних.Источник КАК Источник,
	|	ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов КАК ПлановаяДатаОплатыДивидендов,
	|	ДивидендыПоАкциямСрезПоследних.ДатаПубликации КАК ДатаПубликации,
	|	ДивидендыПоАкциямСрезПоследних.СтатусСобытия КАК СтатусСобытия
	|ПОМЕСТИТЬ _ДивидендыПоАкциям
	|ИЗ
	|	РегистрСведений.ДивидендыПоАкциям.СрезПоследних(&ДатаПроверки, ) КАК ДивидендыПоАкциямСрезПоследних
	|ГДЕ
	|	ДивидендыПоАкциямСрезПоследних.ДатаФиксации <= &ДатаПроверки
	|	И &ДатаПроверки <= ВЫБОР
	|			КОГДА ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДивидендыПоАкциямСрезПоследних.ДатаФиксации, МЕСЯЦ, 2)
	|			ИНАЧЕ ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(_ДивидендыПоАкциям.ДатаФиксации) КАК ДатаМинимум
	|ПОМЕСТИТЬ _ДатаМинимум
	|ИЗ
	|	_ДивидендыПоАкциям КАК _ДивидендыПоАкциям";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ЭтотОбъект.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = МВТ.Таблицы["_ДивидендыПоАкциям"].ПолучитьДанные().Выбрать();	
	
	Если Выборка.Количество() = 0 Тогда 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ЭтотОбъект.Период,"ДФ=dd.MM.yyyy") + " нет сведений о выплате дивидендов");
		Результат.Вставить("Статус", "Нет выплат дивидендов");
		Результат.Вставить("Данные", Неопределено);
		Возврат Результат;
	КонецЕсли;	
	
	МинДатаВыборка = МВТ.Таблицы["_ДатаМинимум"].ПолучитьДанные().Выбрать();
	Пока МинДатаВыборка.Следующий() Цикл 
		ДатаНачала = МинДатаВыборка.ДатаМинимум;
		Прервать;
	КонецЦикла;	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеНСД.NSD_ID КАК NSD_ID,
	|	ДанныеНСД.Reg_Number КАК Reg_Number,
	|	ДанныеНСД.Dividend_Paid КАК Dividend_Paid,
	|	ДанныеНСД.Dividend_Earned КАК Dividend_Earned,
	|	ДанныеНСД.CashAmount КАК CashAmount,
	|	ДанныеНСД.PaymentDate2 КАК PaymentDate,
	|	ДанныеНСД.State_Type КАК State_Type
	|ПОМЕСТИТЬ _ДанныеНСД
	|ИЗ
	|	&ДанныеНСД КАК ДанныеНСД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДивидендыПоАкциям.Период КАК Период,
	|	_ДивидендыПоАкциям.Акция КАК Акция,
	|	_ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
	|	_ДивидендыПоАкциям.ДатаФиксации КАК ДатаФиксации,
	|	_ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
	|	_ДивидендыПоАкциям.Валюта КАК Валюта,
	|	_ДивидендыПоАкциям.Д1 КАК Д1,
	|	_ДивидендыПоАкциям.Д2 КАК Д2,
	|	_ДивидендыПоАкциям.Источник КАК Источник,
	|	_ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов КАК ПлановаяДатаОплатыДивидендов,
	|	_ДивидендыПоАкциям.ДатаПубликации КАК ДатаПубликации,
	|	_ДивидендыПоАкциям.СтатусСобытия КАК СтатусСобытия,
	|	ЕСТЬNULL(_ДанныеНСД.Dividend_Paid, 0) КАК Dividend_Paid,
	|	ЕСТЬNULL(_ДанныеНСД.Dividend_Earned, 0) КАК Dividend_Earned,
	|	ЕСТЬNULL(_ДанныеНСД.PaymentDate, ДАТАВРЕМЯ(1, 1, 1)) КАК PaymentDate,
	|	ВЫБОР
	|		КОГДА _ДанныеНСД.State_Type = ""A""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Состоялось)
	|		КОГДА _ДанныеНСД.State_Type = ""C""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Отменено)
	|		КОГДА _ДанныеНСД.State_Type = ""N""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.НеСостоялось)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.ПустаяСсылка)
	|	КОНЕЦ КАК State_Type_Name
	|ИЗ
	|	_ДивидендыПоАкциям КАК _ДивидендыПоАкциям
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеНСД КАК _ДанныеНСД
	|		ПО _ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов = _ДанныеНСД.NSD_ID
	|			И _ДивидендыПоАкциям.Акция.ГосударственныйРегистрационныйНомер = _ДанныеНСД.Reg_Number";
		
	
	ДанныеНСД = ПолучитьПараметрыДивидендовНСД(ДатаНачала, ЭтотОбъект.Период);
	Если ДанныеНСД = Неопределено Тогда 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка выполнения запроса к серверу НСД.");	
		Результат.Вставить("Статус", "Ошибка выполнения запроса к серверу НСД");
		Результат.Вставить("Данные", Неопределено);
		Возврат Результат;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДанныеНСД", ДанныеНСД);	
	
	НачисленияДивидендов = Запрос.Выполнить().Выгрузить();
	
	Если НачисленияДивидендов.Количество()=0 Тогда 
		НачисленияДивидендов = Неопределено;
		Статус = "Нет данных из НСД";
	Иначе 
		Статус = "Ок";
	КонецЕсли;	
		
	Результат.Вставить("Статус", Статус);
	Результат.Вставить("Данные", НачисленияДивидендов);
		
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьПараметрыДивидендовНСД(ДатаНачала, ДатаОкончания)
		
	// Поля 
	// 
	//NSD_ID	
	//Action_Type	
	//Action_Type_Name	
	//ISIN	            - Код
	//Reg_Number	
	//NSD_Code	
	//Name	
	//RecordDate	
	//ExDate	
	//RecordDate	   -  Дата фиксации?
	//ExDate	       -  Дата начада торгов без права на получение дивидендов? 	RecordDate=ExDate в большинстве случаев. 	
	//PaymentDate	   -  ПлановаяДатаОплатыДивидендов
	//CashAmount	   -  РазмерДивидендовНаОднуАкцию
	//Currency	
	//Dividend_Period_Type	
	//Dividend_Period_Lenght	
	//Dividend_Period_Descr	
	//Dividend_Year	
	//Dividend_Paid	   - Д1
	//Dividend_Earned  - Д2
	//Dividend_TaxRate
	
	ДатаНачалаЗапроса = Формат(ДатаНачала,"ДФ=yyyy-MM-dd");
	ДатаОкончанияЗапроса = Формат(ДатаОкончания,"ДФ=yyyy-MM-dd");
	
	//ТекстЗапроса = СтрШаблон("exec AP15.Matrix_External.NSD.API_Get_Corp_Action_Dividend_1C @Date_From = '%1', @Date_To = '%2', @API_Key_UID = 'NSD.API.Key.BC'", ДатаНачалаЗапроса, ДатаОкончанияЗапроса);
	ТекстЗапроса = СтрШаблон("exec AM.usp_NSD_Corporate_Actions_Dividends @Date_From = '%1', @Date_To = '%2'", ДатаНачалаЗапроса, ДатаОкончанияЗапроса);
		
	СтрокаСоединения		= "Driver={SQL Server};Server=AP15.G1.LAN;UID=svc_API_AM;PWD=p8z4gr39VAxXAfhn;Database=MatriX_External";
	
	ТипыКолонок = Новый Структура;
	ТипыКолонок.Вставить("NSD_ID",					Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТипыКолонок.Вставить("Action_Type",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(4)));
	ТипыКолонок.Вставить("Action_Type_Name",		Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
	ТипыКолонок.Вставить("ISIN",					Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(12)));
	ТипыКолонок.Вставить("Reg_Number",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25)));
	ТипыКолонок.Вставить("NSD_Code",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25)));	
	ТипыКолонок.Вставить("Name",					Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));	
	ТипыКолонок.Вставить("RecordDate",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТипыКолонок.Вставить("ExDate",					Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));	
	ТипыКолонок.Вставить("PaymentDate",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТипыКолонок.Вставить("CashAmount",				Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(27,17)));      // тип ЦенныеБумагиЦенаДивиденды. На самом деле 20 знаков после запятой
	ТипыКолонок.Вставить("Currency",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(3)));		
	ТипыКолонок.Вставить("Dividend_Period_Type",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25)));	
	ТипыКолонок.Вставить("Dividend_Period_Lenght",	Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Dividend_Period_Descr",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25)));	
	ТипыКолонок.Вставить("Dividend_Year",			Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Dividend_Paid",			Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("Dividend_Earned",			Новый ОписаниеТипов("Число"));	
	ТипыКолонок.Вставить("Dividend_TaxRate",		Новый ОписаниеТипов("Число"));
	ТипыКолонок.Вставить("State_Type",				Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1)));
	ТипыКолонок.Вставить("State_Type_Name",			Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(15)));
	
	ДополнительныеПараметры = Новый Структура("ВозвращатьПустуюТаблицу", Истина);
	
	КоличествоПопыток = 5;	
	Пока КоличествоПопыток > 0 Цикл
		Попытка
			Данные = РаботаСВнешнимиСистемами.ADODBC_ПолучитьТаблицуДанныхССервера(СтрокаСоединения, ТекстЗапроса, ТипыКолонок,,ДополнительныеПараметры);
			КоличествоПопыток = 0;
		Исключение
			Данные = Неопределено;
			КоличествоПопыток = КоличествоПопыток - 1;
			Пауза(300);
		КонецПопытки;	
	КонецЦикла;	
		
	Данные.Колонки.Добавить("RecordDate2",		Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("ExDate2",		Новый ОписаниеТипов("Дата"));	
	Данные.Колонки.Добавить("PaymentDate2",		Новый ОписаниеТипов("Дата"));
	
	Для Каждого СтрокаДанные из Данные Цикл 
		Если ЗначениеЗаполнено(СтрокаДанные.RecordDate) Тогда 
			СтрокаДанные.RecordDate2 = Дата(СтрЗаменить(СтрокаДанные.RecordDate, "-", "")); 
		Иначе
			СтрокаДанные.RecordDate2 = Дата(1,1,1);	
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтрокаДанные.ExDate) Тогда 
			СтрокаДанные.ExDate2 = Дата(СтрЗаменить(СтрокаДанные.ExDate, "-", "")); 
		Иначе
			СтрокаДанные.ExDate2 = Дата(1,1,1);	
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтрокаДанные.PaymentDate) Тогда 
			СтрокаДанные.PaymentDate2 = Дата(СтрЗаменить(СтрокаДанные.PaymentDate, "-", "")); 
		Иначе
			СтрокаДанные.PaymentDate2 = Дата(1,1,1);	
		КонецЕсли;	
	КонецЦикла;	
		
	Возврат Данные;
		
КонецФункции

Функция Проверка() Экспорт
	
	ДанныеПроверки = ВернутьСписокОжидаемыхВыплат();
	Возврат ДанныеПроверки;
	
КонецФункции

Процедура ПроверитьИЗаписатьИзмененияПоДивидендам(ПараметрыСессии = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДивидендыПоАкциямСрезПоследних.Период КАК Период,
	|	ДивидендыПоАкциямСрезПоследних.Акция КАК Акция,
	|	ДивидендыПоАкциямСрезПоследних.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
	|	ДивидендыПоАкциямСрезПоследних.ДатаФиксации КАК ДатаФиксации,
	|	ДивидендыПоАкциямСрезПоследних.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
	|	ДивидендыПоАкциямСрезПоследних.Валюта КАК Валюта,
	|	ДивидендыПоАкциямСрезПоследних.Д1 КАК Д1,
	|	ДивидендыПоАкциямСрезПоследних.Д2 КАК Д2,
	|	ДивидендыПоАкциямСрезПоследних.Источник КАК Источник,
	|	ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов КАК ПлановаяДатаОплатыДивидендов,
	|	ДивидендыПоАкциямСрезПоследних.ДатаПубликации КАК ДатаПубликации,
	|	ДивидендыПоАкциямСрезПоследних.СтатусСобытия КАК СтатусСобытия
	|ПОМЕСТИТЬ _ДивидендыПоАкциям
	|ИЗ
	|	РегистрСведений.ДивидендыПоАкциям.СрезПоследних(&ДатаПроверки, ) КАК ДивидендыПоАкциямСрезПоследних
	|ГДЕ
	|	ДивидендыПоАкциямСрезПоследних.ДатаФиксации <= &ДатаПроверки
	|	И &ДатаПроверки <= ВЫБОР
	|			КОГДА ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДивидендыПоАкциямСрезПоследних.ДатаФиксации, МЕСЯЦ, 2)
	|			ИНАЧЕ ДивидендыПоАкциямСрезПоследних.ПлановаяДатаОплатыДивидендов
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеНСД.NSD_ID КАК NSD_ID,
	|	ДанныеНСД.Reg_Number КАК Reg_Number,
	|	ДанныеНСД.Dividend_Paid КАК Dividend_Paid,
	|	ДанныеНСД.Dividend_Earned КАК Dividend_Earned,
	|	ДанныеНСД.CashAmount КАК CashAmount,
	|	ДанныеНСД.RecordDate2 КАК RecordDate,
	|	ДанныеНСД.PaymentDate2 КАК PaymentDate,
	|	ДанныеНСД.State_Type КАК State_Type
	|ПОМЕСТИТЬ _ДанныеНСД
	|ИЗ
	|	&ДанныеНСД КАК ДанныеНСД
	|ГДЕ
	|	ДанныеНСД.Reg_Number <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДивидендыПоАкциям.Период КАК Период,
	|	_ДивидендыПоАкциям.Акция КАК Акция,
	|	_ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов КАК ИдСобытияПоВыплатеДивидендов,
	|	_ДивидендыПоАкциям.ДатаФиксации КАК ДатаФиксации,
	|	_ДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию КАК РазмерДивидендовНаОднуАкцию,
	|	_ДивидендыПоАкциям.Валюта КАК Валюта,
	|	_ДивидендыПоАкциям.Д1 КАК Д1,
	|	_ДивидендыПоАкциям.Д2 КАК Д2,
	|	_ДивидендыПоАкциям.Источник КАК Источник,
	|	_ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов КАК ПлановаяДатаОплатыДивидендов,
	|	_ДивидендыПоАкциям.ДатаПубликации КАК ДатаПубликации,
	|	_ДивидендыПоАкциям.СтатусСобытия КАК СтатусСобытия,
	|	ЕСТЬNULL(_ДанныеНСД.Dividend_Paid, 0) КАК Dividend_Paid,
	|	ЕСТЬNULL(_ДанныеНСД.Dividend_Earned, 0) КАК Dividend_Earned,
	|	ЕСТЬNULL(_ДанныеНСД.PaymentDate, ДАТАВРЕМЯ(1, 1, 1)) КАК PaymentDate,
	|	ВЫБОР
	|		КОГДА _ДанныеНСД.State_Type = ""A""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Состоялось)
	|		КОГДА _ДанныеНСД.State_Type = ""C""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Отменено)
	|		КОГДА _ДанныеНСД.State_Type = ""N""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.НеСостоялось)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.ПустаяСсылка)
	|	КОНЕЦ КАК State_Type_Name
	|ПОМЕСТИТЬ _Изменения
	|ИЗ
	|	_ДивидендыПоАкциям КАК _ДивидендыПоАкциям
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеНСД КАК _ДанныеНСД
	|		ПО _ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов = _ДанныеНСД.NSD_ID
	|			И _ДивидендыПоАкциям.Акция.ГосударственныйРегистрационныйНомер = _ДанныеНСД.Reg_Number
	|ГДЕ
	|	ВЫБОР
	|			КОГДА _ДивидендыПоАкциям.Д1 <> ЕСТЬNULL(_ДанныеНСД.Dividend_Paid, 0)
	|					ИЛИ _ДивидендыПоАкциям.Д2 <> ЕСТЬNULL(_ДанныеНСД.Dividend_Earned, 0)
	|					ИЛИ _ДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов <> ЕСТЬNULL(_ДанныеНСД.PaymentDate, ДАТАВРЕМЯ(1, 1, 1))
	|					ИЛИ _ДивидендыПоАкциям.СтатусСобытия <> ВЫБОР
	|						КОГДА _ДанныеНСД.State_Type = ""A""
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Состоялось)
	|						КОГДА _ДанныеНСД.State_Type = ""C""
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Отменено)
	|						КОГДА _ДанныеНСД.State_Type = ""N""
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.НеСостоялось)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.ПустаяСсылка)
	|					КОНЕЦ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ДанныеНСД.NSD_ID КАК NSD_ID,
	|	_ДанныеНСД.CashAmount КАК CashAmount,
	|	_ДанныеНСД.RecordDate КАК RecordDate,
	|	_ДанныеНСД.PaymentDate КАК PaymentDate,
	|	_ДанныеНСД.Dividend_Paid КАК Dividend_Paid,
	|	_ДанныеНСД.Dividend_Earned КАК Dividend_Earned,
	|	ВЫБОР
	|		КОГДА _ДанныеНСД.State_Type = ""A""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Состоялось)
	|		КОГДА _ДанныеНСД.State_Type = ""C""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Отменено)
	|		КОГДА _ДанныеНСД.State_Type = ""N""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.НеСостоялось)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.ПустаяСсылка)
	|	КОНЕЦ КАК State_Type_Name,
	|	Акции.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
	|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	ВЫБОР
	|		КОГДА _ДанныеНСД.NSD_ID = _ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСведения
	|ПОМЕСТИТЬ _Остатки
	|ИЗ
	|	_ДанныеНСД КАК _ДанныеНСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(&ДатаПроверки, Организация В (&Организации)) КАК ОстаткиЦенныхБумагОстатки
	|			ПО Акции.Ссылка = ОстаткиЦенныхБумагОстатки.ЦеннаяБумага
	|		ПО _ДанныеНСД.Reg_Number = Акции.ГосударственныйРегистрационныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДивидендыПоАкциям КАК _ДивидендыПоАкциям
	|		ПО _ДанныеНСД.NSD_ID = _ДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов
	|ГДЕ
	|	НЕ Акции.Ссылка ЕСТЬ NULL
	|	И ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) > 0
	|	И _ДанныеНСД.PaymentDate > &ДатаПроверки
	|	И _ДанныеНСД.RecordDate < &ДатаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	_Остатки.NSD_ID КАК NSD_ID,
	|	_Остатки.CashAmount КАК CashAmount,
	|	_Остатки.RecordDate КАК RecordDate,
	|	_Остатки.PaymentDate КАК PaymentDate,
	|	_Остатки.Dividend_Paid КАК Dividend_Paid,
	|	_Остатки.Dividend_Earned КАК Dividend_Earned,
	|	_Остатки.State_Type_Name КАК State_Type_Name,
	|	_Остатки.Ссылка КАК Акция
	|ПОМЕСТИТЬ _НетСведений
	|ИЗ
	|	_Остатки КАК _Остатки
	|ГДЕ
	|	НЕ _Остатки.ЕстьСведения
	|	И _Остатки.State_Type_Name <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытийПоВыплатеДивидендов.Отменено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_Остатки.Ссылка КАК Акция,
	|	_Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	_Остатки.Организация КАК Организация,
	|	_Остатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	_Остатки КАК _Остатки
	|ГДЕ
	|	_Остатки.Ссылка В
	|			(ВЫБРАТЬ
	|				_Изменения.Акция КАК Акция
	|			ИЗ
	|				_Изменения КАК _Изменения
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				_НетСведений.Акция КАК Акция
	|			ИЗ
	|				_НетСведений КАК _НетСведений)
	|ИТОГИ ПО
	|	Акция"; 
	
	ДанныеНСД = ПолучитьПараметрыДивидендовНСД(ДобавитьМесяц(ЭтотОбъект.Период, -1), ЭтотОбъект.Период);
	Если ДанныеНСД = Неопределено Тогда 
		ТекстСообщения = "Ошибка выполнения запроса к серверу НСД";
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстСообщения);
	Иначе	
		
		Запрос.УстановитьПараметр("ДанныеНСД", ДанныеНСД);	
		Запрос.УстановитьПараметр("ДатаПроверки", КонецДня(ЭтотОбъект.Период)) ;
		
		МассивОрганизации = Новый Массив;
		МассивОрганизации.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
		МассивОрганизации.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
		
		Запрос.УстановитьПараметр("Организации", МассивОрганизации);
		
		ВыборкаОстаткиАкции = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// 1. Проверим изменившиеся данные. 
		ТекстСообщения = "";
		ТекстСообщенияДляБЭК = "";
		
		ТаблицаИзменений = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Изменения").ПолучитьДанные().Выгрузить();
		
		Если ТаблицаИзменений.Количество() > 0 Тогда 
			ТаблицаИзменений.Сортировать("ИдСобытияПоВыплатеДивидендов, Акция"); 
			
			ТекстСообщения = ТекстСообщения + "<p><h3>Изменились следующие параметры начисления дивидендов</h3></p>";
			
			ШаблонИзмененияПараметры = "<table border = 1>" + 
			"<tr><td></td><td><p align=""center""><pre>      Д1      </pre></p></td><td><p align=""center""><pre>      Д2      </pre></p></td><td><p align=""center"">Плановая дата оплаты</p></td><td><p align=""center"">Статус события</p></td></tr>" + 
			"<tr><td>Было</td><td><p align=""right"">%1</p></td><td><p align=""right"">%2</p></td><td><p align=""center"">%3</p></td><td><p align=""center"">%7</p></td></tr>" +
			"<tr><td>Стало</td><td><p align=""right"">%4</p></td><td><p align=""right"">%5</p></td><td><p align=""center"">%6</p></td><td><p align=""center"">%8</p></td></tr>" +
			"</table>";
			
			ТекИД = "";
			ТекстИзмененения = "";
			ТекстИзменененияДляБЭК = "";
			ИзмененияПоИд = "";  ИзмененияАкции = ""; ИзмененияПараметры = ""; 
			СобытиеОтменено = Ложь; 
			ПредыдущееСобытиеОтменено = Ложь;
			Для Каждого СтрокаИзменения ИЗ ТаблицаИзменений Цикл 
				Если СтрокаИзменения.State_Type_Name = Перечисления.СтатусыСобытийПоВыплатеДивидендов.Отменено Тогда
					СтрокаСтатус = "<font color = ""red"">" + СтрокаИзменения.State_Type_Name + "</font>";
					СобытиеОтменено = Истина;
				Иначе    
					СтрокаСтатус = СтрокаИзменения.State_Type_Name;
					Если СобытиеОтменено Тогда 
						ПредыдущееСобытиеОтменено = Истина;
					Иначе
						ПредыдущееСобытиеОтменено = Ложь;
					КонецЕсли;
					СобытиеОтменено = Ложь;  
				КонецЕсли;
				
				Если ТекИД <> СтрокаИзменения.ИдСобытияПоВыплатеДивидендов Тогда 
					
					Если ТекИД <> "" Тогда
						ТекстИзмененения =  ТекстИзмененения + ИзмененияПоИд + ИзмененияАкции + ИзмененияПараметры;
						Если ПредыдущееСобытиеОтменено Тогда
							ТекстИзменененияДляБЭК =  ТекстИзменененияДляБЭК + ИзмененияПоИд + ИзмененияАкции + ИзмененияПараметры;
						КонецЕсли;
					КонецЕсли;
					
					ИзмененияПоИд = "";  ИзмененияАкции = ""; ИзмененияПараметры = "";
						
					ИзмененияПоИд = ИзмененияПоИд + "<p>(<b>" + СтрокаИзменения.ИдСобытияПоВыплатеДивидендов + "</b>)</p>";
					ИзмененияАкции = ИзмененияАкции + "<p>" + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(СтрокаИзменения.Акция) + "</p>"; 
					
					ИзмененияПараметры = СтрШаблон(ШаблонИзмененияПараметры, 
					СтрокаИзменения.Д1,
					СтрокаИзменения.Д2,
					Формат(СтрокаИзменения.ПлановаяДатаОплатыДивидендов,"ДФ=dd.MM.yyyy"),
					СтрокаИзменения.Dividend_Paid,
					СтрокаИзменения.Dividend_Earned,
					Формат(СтрокаИзменения.PaymentDate,"ДФ=dd.MM.yyyy"),
					СтрокаИзменения.СтатусСобытия,
					СтрокаСтатус); 
					
				Иначе 
					// фиксируем только новую акцию. для обычной и привелегированной акций в одном Событии параметры одинаковые. 
					ИзмененияАкции = ИзмененияАкции + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(СтрокаИзменения.Акция); 
				КонецЕсли;
				ТекИД = СтрокаИзменения.ИдСобытияПоВыплатеДивидендов; 
				
				// запись в регистр
				ЗаписьДивидендыПоАкциям = РегистрыСведений.ДивидендыПоАкциям.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьДивидендыПоАкциям, СтрокаИзменения);
				ЗаписьДивидендыПоАкциям.Период 							= ЭтотОбъект.Период;
				ЗаписьДивидендыПоАкциям.Д1 								= СтрокаИзменения.Dividend_Paid;
				ЗаписьДивидендыПоАкциям.Д2 								= СтрокаИзменения.Dividend_Earned;
				ЗаписьДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов 	= СтрокаИзменения.PaymentDate;
				ЗаписьДивидендыПоАкциям.СтатусСобытия 					= СтрокаИзменения.State_Type_Name;
				ЗаписьДивидендыПоАкциям.Записать();
				
			КонецЦикла;	
			ТекстИзмененения =  ТекстИзмененения + ИзмененияПоИд + ИзмененияАкции + ИзмененияПараметры;
			ТекстСообщения = ТекстСообщения + ТекстИзмененения; 
			Если СобытиеОтменено Тогда 
				ТекстИзменененияДляБЭК =  ТекстИзменененияДляБЭК + ИзмененияПоИд + ИзмененияАкции + ИзмененияПараметры;
				ТекстСообщенияДляБЭК = "<p><h3>Поступили сведения об отмене выплаты дивидендов</h3></p>" + ТекстИзменененияДляБЭК;
			КонецЕсли;
		КонецЕсли;
				
		// 2. Проверим акции, по котором есть сведения в НСД, акция есть на остатках, но в регистре Дивиденды нет записи 
		ВыборкаНетСведений = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НетСведений").ПолучитьДанные().Выбрать(); 
		
		СообщениеОДобавленииВыплаты = "";
		Если ВыборкаНетСведений.Количество() > 0 Тогда 
			СообщениеОДобавленииВыплаты = "<h3>Добавлены сведения о выплате дивидендов</h3>";
			СообщениеОДобавленииВыплаты = СообщениеОДобавленииВыплаты + "<p>Обнаружены сведения о выплате дивидендов по акциям, которые есть на остатках, но нет записи в регистре 'Дивиденды по акциям'</p>";
			
			СтрокаШаблонСведения = "<p>(%7) Акция <i>%1</i>; Дата фиксации = %2; Плановая дата оплаты = %3</p><p>Размер дивидендов на одну акцию = %4;  Д1 = %5; Д2 = %6</p>";
			
			Пока ВыборкаНетСведений.Следующий() Цикл 
				
				СообщениеОДобавленииВыплаты = СообщениеОДобавленииВыплаты 
				+ СтрШаблон(СтрокаШаблонСведения, 
				ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ВыборкаНетСведений.Акция), 
				Формат(ВыборкаНетСведений.RecordDate, "ДФ=dd.MM.yyyy"), 
				Формат(ВыборкаНетСведений.PaymentDate, "ДФ=dd.MM.yyyy"), 
				ВыборкаНетСведений.CashAmount, 
				ВыборкаНетСведений.Dividend_Paid, 
				ВыборкаНетСведений.Dividend_Earned, 
				ВыборкаНетСведений.NSD_ID);
				
				ЗаписьДивидендыПоАкциям = РегистрыСведений.ДивидендыПоАкциям.СоздатьМенеджерЗаписи();
				
				ЗаписьДивидендыПоАкциям.Период 							= ЭтотОбъект.Период;
				ЗаписьДивидендыПоАкциям.Акция 							= ВыборкаНетСведений.Акция;
				ЗаписьДивидендыПоАкциям.ИдСобытияПоВыплатеДивидендов 	= ВыборкаНетСведений.NSD_ID;
				ЗаписьДивидендыПоАкциям.ДатаФиксации 					= ВыборкаНетСведений.RecordDate;
				ЗаписьДивидендыПоАкциям.РазмерДивидендовНаОднуАкцию 	= ВыборкаНетСведений.CashAmount;
				ЗаписьДивидендыПоАкциям.Валюта 							= ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
				ЗаписьДивидендыПоАкциям.Д1 								= ВыборкаНетСведений.Dividend_Paid;
				ЗаписьДивидендыПоАкциям.Д2 								= ВыборкаНетСведений.Dividend_Earned;
				ЗаписьДивидендыПоАкциям.Источник 						= "Проверка параметров начисления дивидендов";
				ЗаписьДивидендыПоАкциям.ПлановаяДатаОплатыДивидендов 	= ВыборкаНетСведений.PaymentDate;
				ЗаписьДивидендыПоАкциям.СтатусСобытия 					= ВыборкаНетСведений.State_Type_Name;
				
				ЗаписьДивидендыПоАкциям.Записать();	
			КонецЦикла;	
			СообщениеОДобавленииВыплаты = СообщениеОДобавленииВыплаты + "<p>Сведения записаны в регистр сведений Дивиденды по акциям</p>"; 
			
			ТекстСообщения = ТекстСообщения + СообщениеОДобавленииВыплаты;   
			ТекстСообщенияДляБЭК = ТекстСообщенияДляБЭК + СообщениеОДобавленииВыплаты;
		КонецЕсли;	
		
		// 3. Сведения об остатках       
		// БЭК офису об остатках не сообщаю. Необходимо разделитить по организациям. 
		Если ВыборкаОстаткиАкции.Количество() > 0 Тогда 
			
			ТекстСообщения = ТекстСообщения + "<p><h3>Сведения об остатках ценных бумаг</h3></p>";
			
			ШаблонСтрокаТаблицы = "<tr><td><p>%1</p></td><td><p>%2</p></td><td><p align=""right"">%3</p></td></tr>";
			
			Пока ВыборкаОстаткиАкции.Следующий()  Цикл 
				
				ТекстСообщения = ТекстСообщения +  ВыборкаОстаткиАкции.Акция;
				
				ТекстСообщения = ТекстСообщения + "<table border = 1>";
				ТекстСообщения = ТекстСообщения + СтрШаблон(ШаблонСтрокаТаблицы, "Организация", "Счет ДУ", "Остаток");
				
				Выборка = ВыборкаОстаткиАкции.Выбрать(); 
				Пока Выборка.Следующий() Цикл 
					ТекстСообщения = ТекстСообщения + СтрШаблон(ШаблонСтрокаТаблицы, Выборка.Организация, ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(Выборка.СчетДоверительногоУправления), Выборка.КоличествоОстаток); 
				КонецЦикла;	 
				ТекстСообщения = ТекстСообщения +  "</table><br>";
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда 	
		ТекстСообщения = "<html><body>" + ТекстСообщения +  "</body></html>";
		
		ТемаПисьма = Строка("Проверка параметров начисления дивидендов на " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));	
		РеквизитыОповещения = Новый Структура("Тема, Текст", 
			ТемаПисьма, 
			ТекстСообщения);
						
		Справочники.Оповещения.СформироватьОповещения("Обработка._ПроверкаПараметровНачисленияДивидендов", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
			
	КонецЕсли;

	Если Не ПустаяСтрока(ТекстСообщенияДляБЭК) Тогда 	
		ТекстСообщенияДляБЭК = "<html><body>" + ТекстСообщенияДляБЭК +  "</body></html>";
		
		ТемаПисьма = Строка("Проверка параметров начисления дивидендов на " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));	
		РеквизитыОповещения = Новый Структура("Тема, Текст", 
			ТемаПисьма, 
			ТекстСообщенияДляБЭК);
						
		Справочники.Оповещения.СформироватьОповещения("Обработка._ПроверкаПараметровНачисленияДивидендовДляБэкофиса", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
			
	КонецЕсли;
	
КонецПроцедуры	

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",       Сессия);
	ПараметрыСессии.Вставить("ДопПараметры", Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",  Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
