Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчёт о регистрациях инвестиционных профилей",
		"0.3",
		"",
		Истина);
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, "АвтоматическаяВыгрузка", "Автоматическая выгрузка",, Ложь, "ВызовСерверногоМетода");
	
	Возврат РегистрационныеДанные;
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//	ИдентификаторКоманды (строка)  - идентификатор команды
//	ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//		элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	// Пропуск выполнения в выходной день
	КалендарьКотировок = ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
	ЭтоРабочийДень = Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДатаСеанса()));
	ЭтоТорговыйДень = Справочники.Календари.ЭтоРабочийДень(КалендарьКотировок, НачалоДня(ТекущаяДатаСеанса()));
	Если Не (ЭтоРабочийДень Или ЭтоТорговыйДень) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	// Команда "Автоматическая выгрузка"
	Если ИдентификаторКоманды = "АвтоматическаяВыгрузка" Тогда
		АвтоматическаяВыгрузка(ПараметрыКоманды);
	КонецЕсли;
КонецПроцедуры

Процедура АвтоматическаяВыгрузка(ПараметрыКоманды)
	Период = Неопределено;
	Если Не ПараметрыКоманды.Свойство("Период", Период) Тогда
		Период = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	// Параметр "Период"
	ПараметрДанных = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПараметрДанных.Значение = Период;
	ПараметрДанных.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	// Выгрузка данных отчёта в SQL
	//Сообщить("ОбщиеПараметрыСоединения: " + ВнешниеИсточникиДанных.RiskControl.ПолучитьОбщиеПараметрыСоединения().СтрокаСоединения);
	//Сообщить("ПараметрыСоединенияСеанса: " + ВнешниеИсточникиДанных.RiskControl.ПолучитьПараметрыСоединенияСеанса().СтрокаСоединения);
	НаборЗаписей = ВнешниеИсточникиДанных.RiskControl.Таблицы.T_Investment_Portfolio_Registrations.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.AssetDate.Установить(Период);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Отбор.AssetDate.Установить(Период);
	Для Каждого СтрокаЗначений Из ТаблицаЗначений Цикл
		СтрокаЗаписей = НаборЗаписей.Добавить();
		СтрокаЗаписей.AssetDate = Период;
		СтрокаЗаписей.ClientCode = СтрокаЗначений.КодКлиента;
		СтрокаЗаписей.AcceptableRiskPercent = СтрокаЗначений.ПроцентДопустимогоРиска;
		СтрокаЗаписей.IsQualifiedInvestor = СтрокаЗначений.ЭтоКвалифицированныйИнвестор;
		СтрокаЗаписей.RegistrationDate = СтрокаЗначений.ДатаРегистрации;
		СтрокаЗаписей.CurrencyCode = СтрокаЗначений.КодВалюты;
		СтрокаЗаписей.StartOfInvestmentHorizonPeriod = СтрокаЗначений.НачалоПериодаИнвестиционногоГоризонта;
		СтрокаЗаписей.EndOfInvestmentHorizonPeriod = СтрокаЗначений.ОкончаниеПериодаИнвестиционногоГоризонта;
	КонецЦикла;
	НаборЗаписей.Записать();
	Сообщить("Записано строк: " + НаборЗаписей.Количество());
КонецПроцедуры
