Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",  						Перечисления.РынкиЦенныхБумаг.Доли);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",  				ЭтотОбъект.Доля);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоЦеннымБумагам");

	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",  					ЭтотОбъект.Ссылка);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности",  			Справочники.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",  						Перечисления.РынкиЦенныхБумаг.Доли);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",  				ЭтотОбъект.Доля);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.СостоянияРешенийОбИзмененияхУставныхКапиталовООО.Записывать  = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать  = Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать  = Истина;
	
	Движение = Движения.СостоянияРешенийОбИзмененияхУставныхКапиталовООО.Добавить();
	Движение.Период 								= ЭтотОбъект.Дата;
	Движение.Организация 							= ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления 			= ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РешениеОбИзмененииУставногоКапитала 	= ЭтотОбъект.Ссылка;
	Движение.Состояние 								= Перечисления.СостоянияПоручений.ПустаяСсылка();
	
	Если ЭтотОбъект.ВзносВУставныйКапитал Тогда
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		Движение.Период 						= ЭтотОбъект.Дата;
		Движение.Организация 					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Основание 						= ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности 				= Перечисления.ТипыЗадолженности.Кредиторская;
		Движение.ВидЗадолженности 				= Справочники.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО;
		Движение.Валюта 						= ЭтотОбъект.Доля.ВалютаНоминала;
		Движение.Контрагент 					= ЭтотОбъект.Доля.ЮрЛицо;
		Движение.Аванс 							= Ложь;
		Движение.Сумма 							= ЭтотОбъект.СуммаОплаты;
		
	КонецЕсли;
	
	//проверим изменится ли размер доли
	ТекущийРазмерДоли = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Дата,
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.Доля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекущийРазмерДоли = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЕсли;
	
	Если ТекущийРазмерДоли <> ЭтотОбъект.РазмерДолиПослеИзменения И ТекущийРазмерДоли <> 0 Тогда
		
		ИзменениеДоли = ЭтотОбъект.РазмерДолиПослеИзменения - ТекущийРазмерДоли;
		Движение = Движения.ЗадолженностиПоЦеннымБумагам.ДобавитьПриход();	
		
		Движение.Период 						= ЭтотОбъект.Дата;
		Движение.Организация 					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Основание               		= ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности 				= ?(ИзменениеДоли > 0, Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская);
		Движение.ВидЗадолженности 				= Справочники.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО;
		Движение.Рынок                   		= Перечисления.РынкиЦенныхБумаг.Доли;
		Движение.ЦеннаяБумага                   = ЭтотОбъект.Доля;
		Движение.Валюта                   		= ЭтотОбъект.Доля.ВалютаНоминала;
		
		Движение.Количество 					= МатематическиеФункции.МодульЧисла(ИзменениеДоли);
		Движение.Сумма 							= 0;//ЭтотОбъект.Основание.СуммаОплаты;
		
	КонецЕсли;
	
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ВзносВУставныйКапитал Тогда
		ПроверяемыеРеквизиты.Добавить("СуммаОплаты");
		ПроверяемыеРеквизиты.Добавить("ДатаОплатыПлановая");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
	
		Если ЭтотОбъект.Дата < ЭтотОбъект.ДатаРешения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа не может быть раньше даты решения!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
		КонецЕсли;
		
		Если НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.ДатаРешения И НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.ДатаПолученияСведений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа должна совпадать с датой решения или с датой получения сведений!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти 
