
Функция ПолучитьДолжностноеЛицоИОснование(Период, Организация, ВидДолжностногоЛица) Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник КАК ДолжностноеЛицо,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Регистратор.НаименованиеДокумента КАК Основание,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Регистратор КАК ОснованиеСсылка,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВнутреннихДокументов.НазначениеИсполняющегоОбязанности) КАК НазначениеИО
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидДолжностногоЛица = &ВидДолжностногоЛица) КАК ДолжностныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	(ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания, ДЕНЬ) >= &Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ИсполняющийОбязанности УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период",				 Период);
	Запрос.УстановитьПараметр("Организация",		 Организация);
	Запрос.УстановитьПараметр("ВидДолжностногоЛица", ВидДолжностногоЛица);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДолжностноеЛицоИОснование = Новый Структура("ДолжностноеЛицо, Основание, ОснованиеСсылка, НазначениеИО", , , , Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДолжностноеЛицоИОснование, Выборка);
	КонецЕсли;
	
	Возврат ДолжностноеЛицоИОснование;

КонецФункции 

Функция ПолучитьДолжностноеЛицо(Период, Организация, ВидДолжностногоЛица) Экспорт

	Возврат ПолучитьДолжностноеЛицоИОснование(Период, Организация, ВидДолжностногоЛица).ДолжностноеЛицо;

КонецФункции 

Функция ПолучитьТаблицуДолжностныхЛиц(Период, Организация) Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ИО.ВидДолжностногоЛица, ДолжностныеЛица.ВидДолжностногоЛица) КАК ВидДолжностногоЛица,
		|	ЕСТЬNULL(ИО.Сотрудник, ДолжностныеЛица.Сотрудник) КАК Сотрудник,
		|	ЕСТЬNULL(ИО.ДатаОкончания, ДолжностныеЛица.ДатаОкончания) КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И НЕ ИсполняющийОбязанности) КАК ДолжностныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДолжностныеЛицаОрганизацийСрезПоследних.ВидДолжностногоЛица КАК ВидДолжностногоЛица,
		|			ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|			ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|		ИЗ
		|			РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И ИсполняющийОбязанности) КАК ДолжностныеЛицаОрганизацийСрезПоследних) КАК ИО
		|		ПО ДолжностныеЛица.ВидДолжностногоЛица = ИО.ВидДолжностногоЛица
		|			И (ИО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КОНЕЦПЕРИОДА(ИО.ДатаОкончания, ДЕНЬ) >= &Период)
		|ГДЕ
		|	(ДолжностныеЛица.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(ДолжностныеЛица.ДатаОкончания, ДЕНЬ) >= &Период
		|			ИЛИ ИО.Сотрудник ЕСТЬ НЕ NULL )";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", 	 Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();

КонецФункции 

Функция Используется(Период, Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",		 Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДолжностныеЛицаОрганизаций.Период КАК Период
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций КАК ДолжностныеЛицаОрганизаций
		|ГДЕ
		|	ДолжностныеЛицаОрганизаций.Организация = &Организация
		|	И ДолжностныеЛицаОрганизаций.Период <= &Период
		|	И ДолжностныеЛицаОрганизаций.Активность";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции