
&НаСервере
Процедура ЭкспортКонтактнойИнформацииНаСервере()
	
	МассивАнкет = Новый Массив;
	
	Для Каждого СтрокаАнкет Из Объект.АнкетыФизическихЛиц Цикл
		МассивАнкет.Добавить(СтрокаАнкет.АнкетаФизическогоЛица);
	КонецЦикла;
	
	РеквизитФормыВЗначение("Объект").ЭкспортКонтактнойИнформации(МассивАнкет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортКонтактнойИнформации(Команда)
	
	ЭкспортКонтактнойИнформацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАнкетамиТекущихДоговровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК АнкетаФизическогоЛица
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ГДЕ
		|	(РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail <> """"
		|			ИЛИ РеквизитыФизическихЛицАнкетныеСрезПоследних.ТелефонДляОповещения <> """")
		|	И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Период)";
	
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	
	Объект.АнкетыФизическихЛиц.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАнкетамиТекущихДоговров(Команда)
	
	ЗаполнитьАнкетамиТекущихДоговровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасхождения(Команда)
	
	ПоказатьРасхожденияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьРасхожденияНаСервере()
	
	РеквизитФормыВЗначение("Объект").КонтактнаяИнформацияФизиковВыгруженаВБухгалтерию(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
