
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.Сотрудники.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Сотрудники""",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Отказ = (РаботаССотрудниками.СотрудникиУволены(ЭтотОбъект.Организация, ЭтотОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник"), ЭтотОбъект.Дата, Истина)
			ИЛИ РаботаССотрудниками.СотрудникиВОтпускеПоУходуЗаРебенком(ЭтотОбъект.Организация, ЭтотОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник"), ЭтотОбъект.Дата, Истина));	
	
	КонтрольУникальностиСотрудника(Отказ);
	
	Если Документы.ОбучениеСотрудников.ИспользуютсяПростыеПодписи(ЭтотОбъект.Организация, ЭтотОбъект.ВидПеречня, ЭтотОбъект.Дата) Тогда
		КонтрольПользователяУСотрудника(Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьСтартоватьБизнесПроцессы(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда // блокирующие проверки
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура СоздатьСтартоватьБизнесПроцессы(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сотрудники", ЭтотОбъект.Сотрудники.Выгрузить());
	Запрос.УстановитьПараметр("Основание",  ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",  ЭтотОбъект.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ _Сотрудники
		|ИЗ
		|	&Сотрудники КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудника.Сотрудник КАК Сотрудник,
		|	ОбучениеСотрудника.Ссылка КАК БизнесПроцесс
		|ПОМЕСТИТЬ _КонтрольУдаленияСотрудникаПриЗапущенномБизнесПроцессе
		|ИЗ
		|	БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Сотрудники КАК _Сотрудники
		|		ПО ОбучениеСотрудника.Сотрудник = _Сотрудники.Сотрудник
		|ГДЕ
		|	НЕ ОбучениеСотрудника.ПометкаУдаления
		|	И НЕ ОбучениеСотрудника.Отменен
		|	И ОбучениеСотрудника.Основание = &Основание
		|	И _Сотрудники.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ _СоздатьБизнесПроцессы
		|ИЗ
		|	_Сотрудники КАК _Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ПО _Сотрудники.Сотрудник = ОбучениеСотрудника.Сотрудник
		|			И (НЕ ОбучениеСотрудника.ПометкаУдаления)
		|			И (НЕ ОбучениеСотрудника.Отменен)
		|			И (ОбучениеСотрудника.Организация = &Организация)
		|			И (ОбучениеСотрудника.Основание = &Основание)
		|ГДЕ
		|	ОбучениеСотрудника.Ссылка ЕСТЬ NULL";
	
	
	Запрос.Выполнить();
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КонтрольУдаленияСотрудникаПриЗапущенномБизнесПроцессе").ПолучитьДанные().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Для сотрудника %1 запущен бизнес-процесс %2. Для исключения сотрудника из списка обучения необходимо отменить бизнес-процесс", 
				Выборка.Сотрудник,
				Выборка.БизнесПроцесс), Выборка.БизнесПроцесс,,, Отказ);
				
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура("Основание, Организация, Дата", ЭтотОбъект.Ссылка, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СоздатьБизнесПроцессы").ПолучитьДанные().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыЗаполнения.Вставить("Сотрудник", Выборка.Сотрудник);
	
		БизнесПроцессОбучение = БизнесПроцессы.ОбучениеСотрудника.СоздатьБизнесПроцесс();
		БизнесПроцессОбучение.Заполнить(ПараметрыЗаполнения);
		БизнесПроцессОбучение.Записать();
		БизнесПроцессОбучение.Старт();
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура КонтрольУникальностиСотрудника(Отказ)
	
	ВыбранныеСотрудники = Новый Соответствие;
	
	Для Каждого СтрокаСотрудники Из ЭтотОбъект.Сотрудники Цикл
		Если ВыбранныеСотрудники.Получить(СтрокаСотрудники.Сотрудник) = Неопределено Тогда
			ВыбранныеСотрудники.Вставить(СтрокаСотрудники.Сотрудник, СтрокаСотрудники.НомерСтроки);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Сотрудник %1 уже выбран в строке %2. Дублирование сотрудников ни к чему хорошему не приведёт.",
					СтрокаСотрудники.Сотрудник,
					ВыбранныеСотрудники.Получить(СтрокаСотрудники.Сотрудник)), ЭтотОбъект, СтрШаблон("Сотрудники[%1].Сотрудник", СтрокаСотрудники.НомерСтроки - 1),, Отказ);
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтрольПользователяУСотрудника(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ОбучениеСотрудниковСотрудники.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ОбучениеСотрудников.Сотрудники КАК ОбучениеСотрудниковСотрудники
		|ГДЕ
		|	ОбучениеСотрудниковСотрудники.Сотрудник.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.)
		|	И ОбучениеСотрудниковСотрудники.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Для сотрудника %1 не задана связь с пользователем 1с.",
				Выборка.Сотрудник), ЭтотОбъект, СтрШаблон("Сотрудники[%1].Сотрудник", Выборка.НомерСтроки - 1),, Отказ);
	КонецЦикла;
			
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для установки связи сотрудника и пользователя необходимо:
			|	1. Создать учётную запись в 1с
			|	2. Импортировать данные о сотрудниках");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидПеречня = Справочники.ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ 
	   И ЭтотОбъект.ВидОбучения = Перечисления.ВидыОбученийСотрудников.Первичное Тогда
		ПроверяемыеРеквизиты.Добавить("ВидПервичногоОбучения");
		
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ВидПервичногоОбучения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид первичного обучения заполняется только для первичного обучения и вида перечня " + Справочники.ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ , ЭтотОбъект, "ВидПервичногоОбучения",, Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.НачалоПроверкиЗнаний) ИЛИ ЗначениеЗаполнено(ОкончаниеПроверкиЗнаний) Тогда
		ПроверяемыеРеквизиты.Добавить("НачалоПроверкиЗнаний");
		ПроверяемыеРеквизиты.Добавить("ОкончаниеПроверкиЗнаний");
	КонецЕсли;
	
	КонтрольДатОбученияИПроверкиЗнаний(Отказ);
	
	РаботаССотрудниками.СотрудникиВходятВПеречень(ЭтотОбъект.Организация, ЭтотОбъект.ВидПеречня, ЭтотОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник"), ЭтотОбъект.Дата, Отказ)
	
КонецПроцедуры

Процедура КонтрольДатОбученияИПроверкиЗнаний(Отказ)
	
	Если ЭтотОбъект.ОкончаниеОбучения < НачалоДня(ЭтотОбъект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания обучения не может быть меньше даты документа", ЭтотОбъект, "ОкончаниеОбучения",, Отказ);
	КонецЕсли;
	
	Если ЭтотОбъект.ОкончаниеОбучения > ДобавитьМесяц(ЭтотОбъект.Дата, 2) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания обучения не может быть позднее даты документа более чем на 2 месяца", ЭтотОбъект, "ОкончаниеОбучения",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.НачалоПроверкиЗнаний) Тогда
		
		Если ЭтотОбъект.НачалоПроверкиЗнаний < НачалоДня(ЭтотОбъект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала проверки знаний не может быть меньше даты документа", ЭтотОбъект, "НачалоПроверкиЗнаний",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.НачалоПроверкиЗнаний > ДобавитьМесяц(ЭтотОбъект.Дата, 2) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала проверки знаний не может быть позднее даты документа более чем на 2 месяца", ЭтотОбъект, "НачалоПроверкиЗнаний",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ОкончаниеПроверкиЗнаний < ЭтотОбъект.НачалоПроверкиЗнаний Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания проверки знаний не может быть меньше даты начала проверки знаний", ЭтотОбъект, "ОкончаниеПроверкиЗнаний",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.ОкончаниеПроверкиЗнаний > ДобавитьМесяц(ЭтотОбъект.Дата, 2) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания проверки знаний не может быть позднее даты документа более чем на 2 месяца", ЭтотОбъект, "ОкончаниеПроверкиЗнаний",, Отказ);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры
