
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ПоступлениеДенежныхСредств", ПараметрКоманды);
	Форма = ПолучитьФорму("Документ.ПереводДенежныхСредств.Форма.ФормаСпискаЗачисленийНаСчетПИФ", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	Форма.Заголовок = "Зачисление д/с на счет ПИФ";
	
	Форма.Открыть();
	
КонецПроцедуры
