
////////////////////////////////////////////////////////////////////////////////
// КЭШИРОВАНИЕ

Функция Кэширование_СоздатьКэш(КлючПоиска) Экспорт
	
	КэшОбъектов = Новый ТаблицаЗначений;
		
	// поля, входящие в состав ключа
	ИндексируемыеПоля = "";
	
	Для каждого СвойствоКлючаПоиска Из КлючПоиска Цикл
		КэшОбъектов.Колонки.Добавить(СвойствоКлючаПоиска.Ключ);
		ИндексируемыеПоля = ИндексируемыеПоля + ?(ПустаяСтрока(ИндексируемыеПоля), "", ",") + СвойствоКлючаПоиска.Ключ;
	КонецЦикла;
	
	КэшОбъектов.Индексы.Добавить(ИндексируемыеПоля);
	
	// предопределенное поле
	КэшОбъектов.Колонки.Добавить("Значение");
	
	Возврат КэшОбъектов;

КонецФункции // Кэширование_СоздатьКэш

Процедура Кэширование_ДобавитьЗначение(КэшОбъектов, КлючПоиска, Значение) Экспорт
	
	СтрокаКэшОбъектов = КэшОбъектов.Добавить();
	
	Для каждого СвойствоКлючаПоиска Из КлючПоиска Цикл
		СтрокаКэшОбъектов[СвойствоКлючаПоиска.Ключ] = СвойствоКлючаПоиска.Значение;
	КонецЦикла;
	
	СтрокаКэшОбъектов.Значение = Значение;
	
КонецПроцедуры // Кэширование_ДобавитьЗначение

Функция Кэширование_НайтиЗначение(КэшОбъектов, КлючПоиска, ЗнчНайдено) Экспорт

	ЗнчНайдено = Ложь;
	
	СтрокиКэшОбъектов = КэшОбъектов.НайтиСтроки(КлючПоиска);
	Если СтрокиКэшОбъектов.Количество() > 0 Тогда
		ЗнчНайдено = Истина;
		
		Возврат СтрокиКэшОбъектов[0].Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // Кэширование_НайтиЗначение

////////////////////////////////////////////////////////////////////////////////
// СТРУКТУРА

// Возвращает копию структуры
//
// Параметры:
//   Структура			- Структура					- коллекция, из которой будут считываться свойства для копирования
//   ТолькоКлючи		- Булево					- при Истина копируются только ключи свойств
//   СписокСвойств		- Массив, Структура, Строка	- копируемые свойства (если строка, то список имен свойств, разделенный запятыми)
//   ИсключаяСвойства	- Массив, Структура, Строка	- исключаемые свойства (если строка, то список имен свойств, разделенный запятыми)
//
// Возвращаемое значение:
//	Структура - скопированная структура
//
Функция СкопироватьСтруктуру(Структура, ТолькоКлючи = Ложь, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	#Область Заполняем_структуры_включаемых_или_исключаемых_свойств
	
	Если ТипЗнч(СписокСвойств) = Тип("Массив") Тогда
		ВключаемыеСвойства = Новый Структура;
		Для Каждого Ключ Из СписокСвойств Цикл
			ВключаемыеСвойства.Вставить(Ключ);
		КонецЦикла;
	ИначеЕсли ТипЗнч(СписокСвойств) = Тип("Строка") Тогда
		ВключаемыеСвойства = Новый Структура(СписокСвойств);
	Иначе
		ВключаемыеСвойства = СписокСвойств;
	КонецЕсли;	
	
	Если ТипЗнч(ИсключаяСвойства) = Тип("Массив") Тогда
		ИсключаемыеСвойства = Новый Структура;
		Для Каждого Ключ Из ИсключаяСвойства Цикл
			ИсключаемыеСвойства.Вставить(Ключ);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ИсключаяСвойства) = Тип("Строка") Тогда
		ИсключаемыеСвойства = Новый Структура(ИсключаяСвойства);
	Иначе
		ИсключаемыеСвойства = ИсключаяСвойства;
	КонецЕсли;
	
	#КонецОбласти
	
	КопияСтруктуры = Новый Структура;
	
	Для каждого КлючЗнч Из Структура Цикл
		Если (ВключаемыеСвойства = Неопределено ИЛИ ВключаемыеСвойства.Свойство(КлючЗнч.Ключ))
			И (ИсключаемыеСвойства = Неопределено ИЛИ Не ИсключаемыеСвойства.Свойство(КлючЗнч.Ключ))
		Тогда
			КопияСтруктуры.Вставить(КлючЗнч.Ключ, ?(ТолькоКлючи, Неопределено, КлючЗнч.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Возврат КопияСтруктуры;
	
КонецФункции

Функция СтруктурыИдентичны(Структура1, Структура2, ТолькоПоЗначениямОбщихКлючей = Ложь) Экспорт
	
	Для каждого КлючЗнч Из Структура1 Цикл
		Если Не Структура2.Свойство(КлючЗнч.Ключ) Тогда // отсутствует во 2-й структуре
			Если ТолькоПоЗначениямОбщихКлючей Тогда
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Структура1[КлючЗнч.Ключ] <> Структура2[КлючЗнч.Ключ] Тогда // значения различаются
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТолькоПоЗначениямОбщихКлючей Тогда
		Для каждого КлючЗнч Из Структура2 Цикл
			Если Не Структура1.Свойство(КлючЗнч.Ключ) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СтруктурыИдентичны

Процедура ДобавитьНовыйЭлементВСтруктуру(Структура, Ключ, Значение) Экспорт
	
	Если Не Структура.Свойство(Ключ) Тогда
		Структура.Вставить(Ключ, Значение);
	КонецЕсли;
	
КонецПроцедуры // ДобавитьНовыйЭлементВСтруктуру

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Результат = ЗначениеПоУмолчанию;
	Если Структура.Свойство(Ключ, Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Дополняет структуру значениями из другой структуры.
//
// Параметры:
//   Приемник - Структура - коллекция, в которую будут добавляться новые значения.
//   Источник - Структура - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - Что делать в местах пересечения ключей источника и приемника:
//                                       Истина - Заменять значения приемника (самый быстрый способ),
//                                       Ложь   - Не заменять значения приемника (пропускать),
//                                       Неопределено - Значение по умолчанию. Бросать исключение.
//
Процедура ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	Для Каждого Элемент Из Источник Цикл
		Если Заменять <> Истина И Приемник.Свойство(Элемент.Ключ) Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ВызватьИсключение РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'"), Элемент.Ключ);
			КонецЕсли
		КонецЕсли;
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// МАССИВЫ

Функция ЗначениеВМассив(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Возврат Значение;
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(Значение);
		Возврат Массив;
	КонецЕсли;
КонецФункции

Функция ЗначенияВМассив(Значение1 = "#ЗначениеНеПередано#", Значение2 = "#ЗначениеНеПередано#", Значение3 = "#ЗначениеНеПередано#", Значение4 = "#ЗначениеНеПередано#", Значение5 = "#ЗначениеНеПередано#", Значение6 = "#ЗначениеНеПередано#", Значение7 = "#ЗначениеНеПередано#", Значение8 = "#ЗначениеНеПередано#", Значение9 = "#ЗначениеНеПередано#") Экспорт

	Массив = Новый Массив;
	
	Если Значение1 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение1) КонецЕсли;
	Если Значение2 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение2) КонецЕсли;
	Если Значение3 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение3) КонецЕсли;
	Если Значение4 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение4) КонецЕсли;
	Если Значение5 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение5) КонецЕсли;
	Если Значение6 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение6) КонецЕсли;
	Если Значение7 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение7) КонецЕсли;
	Если Значение8 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение8) КонецЕсли;
	Если Значение9 <> "#ЗначениеНеПередано#" Тогда Массив.Добавить(Значение9) КонецЕсли;
	
	Возврат Массив;

КонецФункции

Процедура УдалитьПовторяющиесяЗначенияМассива(Массив) Экспорт
	
	НовыйМассив = Новый Массив;
	
	ДополнитьМассив(НовыйМассив, Массив, Истина);
	
	Массив = НовыйМассив;
	
КонецПроцедуры

// Дополняет массив отдельным значением или значениями из другого массива
//
// Параметры:
//  МассивПриемник				- Массив									- массив, в который необходимо добавить значения
//  Источник					- Произвольный, Массив, ФиксированныйМассив	- отдельное значение или массив значений для заполнения
//  ТолькоУникальныеЗначения	- Булево									- если истина, то в массив будут включены только уникальные значения
//
Процедура ДополнитьМассив(МассивПриемник, Источник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТипЗнч(Источник) = Тип("Массив") ИЛИ ТипЗнч(Источник) = Тип("ФиксированныйМассив") Тогда
		
		// Дополняется массивом
		
		Если ТолькоУникальныеЗначения Тогда
			
			УникальныеЗначения = Новый Соответствие;
			
			Для Каждого Значение Из МассивПриемник Цикл
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЦикла;
			
			Для Каждого Значение Из Источник Цикл
				Если УникальныеЗначения[Значение] = Неопределено Тогда
					МассивПриемник.Добавить(Значение);
					УникальныеЗначения.Вставить(Значение, Истина);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Для Каждого Значение Из Источник Цикл
				МассивПриемник.Добавить(Значение);
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе

		// Дополняется отдельным значением	
		
		Если Не ТолькоУникальныеЗначения
			ИЛИ МассивПриемник.Найти(Источник) = Неопределено
		Тогда
			МассивПриемник.Добавить(Источник);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СПИСКИ ЗНАЧЕНИЙ

Функция ЗначенияСписком(Значения) Экспорт
	Если ТипЗнч(Значения) = Тип("СписокЗначений") Тогда
		Возврат Значения;
	Иначе
		СписокЗначений = Новый СписокЗначений;
		Если ТипЗнч(Значения) = Тип("Массив") Тогда
			СписокЗначений.ЗагрузитьЗначения(Значения);
		ИначеЕсли Значения <> Неопределено Тогда
			СписокЗначений.Добавить(Значения);
		КонецЕсли;
		Возврат СписокЗначений;
	КонецЕсли;
КонецФункции

Функция НайтиЗначениеСпискаПоПредставлению(СписокЗначений, ПредставлениеДляПоиска) Экспорт
	
	Для каждого ЭлементСписка Из СписокЗначений Цикл
		Если ВРег(СокрЛП(ЭлементСписка.Представление)) = ВРег(СокрЛП(ПредставлениеДляПоиска)) Тогда
			Возврат ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // СписокЗначений_НайтиЗначениеПоПредставлению

// Сравнивает элементы списков значений или массивов по значениям
//
Функция СпискиЗначенийИдентичны(Список1, Список2) Экспорт
	
	СпискиИдентичны = Истина;
	
	Для Каждого ЭлементСписка1 Из Список1 Цикл
		Если НайтиВСписке(Список2, ЭлементСписка1) = Неопределено Тогда
			СпискиИдентичны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СпискиИдентичны Тогда
		Для Каждого ЭлементСписка2 Из Список2 Цикл
			Если НайтиВСписке(Список1, ЭлементСписка2) = Неопределено Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СпискиИдентичны;
	
КонецФункции // СпискиЗначенийИдентичны

// Проверяет, что элементы первого списка входят в второй список
Функция ЭлементыПервогоСпискаВходятВоВторойСписок(Список1, Список2) Экспорт
	
	СпискиИдентичны = Истина;
	
	Для Каждого ЭлементСписка1 Из Список1 Цикл
		Если НайтиВСписке(Список2, ЭлементСписка1) = Неопределено Тогда
			СпискиИдентичны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СпискиИдентичны;
	
КонецФункции

// Дополняет список отдельным значением или значениями из другого списка
//
// Параметры:
//  СписокПриемник				- СписокЗначений										- список значений, в который необходимо добавить значения
//  Источник					- Произвольный, ЭлементСпискаЗначений, СписокЗначений	- отдельное значение или список значений для заполнения
//  ТолькоУникальныеЗначения	- Булево												- если истина, то в список значений будут включены только уникальные значения
//
Процедура ДополнитьСписок(СписокПриемник, Источник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СписокЗначений") Тогда
		
		// Дополняется списком значений	
		
		Если ТолькоУникальныеЗначения Тогда
			
			УникальныеЗначения = Новый Соответствие;
			
			Для Каждого Элемент Из СписокПриемник Цикл
				УникальныеЗначения.Вставить(Элемент.Значение, Истина);
			КонецЦикла;
			
			Для Каждого Элемент Из Источник Цикл
				Если УникальныеЗначения[Элемент.Значение] = Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СписокПриемник.Добавить(), Элемент);
					УникальныеЗначения.Вставить(Элемент.Значение, Истина);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Для Каждого Элемент Из Источник Цикл
				ЗаполнитьЗначенияСвойств(СписокПриемник.Добавить(), Элемент);
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		// Дополняется отдельным значением	
		
		Если Не ТолькоУникальныеЗначения
			ИЛИ НайтиВСписке(СписокПриемник, Источник) = Неопределено
		Тогда
		
			Если ТипЗнч(Источник) = Тип("ЭлементСпискаЗначений") Тогда
				ЗаполнитьЗначенияСвойств(СписокПриемник.Добавить(), Источник);
			Иначе
				СписокПриемник.Добавить(Источник);
			КонецЕсли;
		
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТАБЛИЦЫ ЗНАЧЕНИЙ

// Функция создает структуру со свойствами, как колонки таблицы значений передаваемой строки
//  и устанавливает этим свойствам значения из строки таблицы значений
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// ВозвращаемоеЗначение:
//  Структура
//
Функция ТаблицаЗначений_СтрокаВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Возвращает массив ключей, по которым можно получить неуникальные строки таблицы значений
// 
// Параметры:
//  ТабЗнч			- ТаблицаЗначений	- таблица значений
//	КолонкиТабЗнч	- Строка			- колонки таблицы значений, разделенные запятой
//
// Возвращаемое значение:
//  Массив - массив структур, содержащих поля:
//		- ключ			- значение колонки, если в КолонкиТабЗнч передана одна колонка
//						- структура, где ключи - имена колонок, значения - соответствующие им значения
//		- количество	- количество строк таблицы значений с данным ключом
//
Функция ТаблицаЗначений_НайтиНеУникальныеЗначения(ТабЗнч, КолонкиТабЗнч) Экспорт
	
	// определим имя суммируемой колонки
	ИмяСуммируемойКолонки = "СуммируемоеПоле" + СтрЗаменить(XMLСтрока(Новый УникальныйИдентификатор), "-", "");
	
	// свернем таблицу значений по указанному ключу
	ГруппируемыеЗнч = ТабЗнч.Скопировать(, КолонкиТабЗнч);
	
	ГруппируемыеЗнч.Колонки.Добавить(ИмяСуммируемойКолонки, Новый ОписаниеТипов("Число"));
	ГруппируемыеЗнч.ЗаполнитьЗначения(1, ИмяСуммируемойКолонки);
	
	ГруппируемыеЗнч.Свернуть(КолонкиТабЗнч, ИмяСуммируемойКолонки);
	ГруппируемыеЗнч.Сортировать(ИмяСуммируемойКолонки + " УБЫВ");
	
	// выделим не уникальные значения в массив
	НеУникальныеЗначения = Новый Массив;
	
	Для каждого СтрокаГруппируемыеЗнч Из ГруппируемыеЗнч Цикл
		Если СтрокаГруппируемыеЗнч[ИмяСуммируемойКолонки] = 1 Тогда
			Прервать;
		Иначе
			СтруктураКлюча = Новый Структура(КолонкиТабЗнч);
			Если СтруктураКлюча.Количество() > 1 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураКлюча, СтрокаГруппируемыеЗнч);
				НеУникальныеЗначения.Добавить(Новый Структура("Ключ, Количество", СтруктураКлюча, СтрокаГруппируемыеЗнч[ИмяСуммируемойКолонки]));
			Иначе
				НеУникальныеЗначения.Добавить(Новый Структура("Ключ, Количество", СтрокаГруппируемыеЗнч[КолонкиТабЗнч], СтрокаГруппируемыеЗнч[ИмяСуммируемойКолонки]));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеУникальныеЗначения;
	
КонецФункции

// Дополняет таблицу значений-приемник данными из таблицы значений-источник
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений - таблица, из которой будут браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений - таблица, в которую будут добавлены строки из таблицы-источника.
//  
Процедура ТаблицаЗначений_Дополнить(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры // ТаблицаЗначений_Дополнить

// Преобразует текст формата XML в таблицу значений, при этом колонки таблицы формируются на основе описания в XML
//
// Параметры:
//  XML     - текст в формате XML или ЧтениеXML.
//
// Схема XML:
//<?xml version="1.0" encoding="utf-8"?>
//<xs:schema attributeFormDefault="unqualified" elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema">
//  <xs:element name="Items">
//	<xs:complexType>
//	  <xs:sequence>
//		<xs:element maxOccurs="unbounded" name="Item">
//		  <xs:complexType>
//			<xs:attribute name="Code" type="xs:integer" use="required" />
//			<xs:attribute name="Name" type="xs:string" use="required" />
//			<xs:attribute name="Socr" type="xs:string" use="required" />
//			<xs:attribute name="Index" type="xs:string" use="required" />
//		  </xs:complexType>
//		</xs:element>
//	  </xs:sequence>
//	  <xs:attribute name="Description" type="xs:string" use="required" />
//	  <xs:attribute name="Columns" type="xs:string" use="required" />
//	</xs:complexType>
//  </xs:element>
//</xs:schema>
//
// Примеры XML-файлов см. в демонстрационной конфигурации.
// 
// Пример использования:
//   КлассификаторТаблица = ПрочитатьXMLВТаблицу(РегистрыСведений.АдресныйКлассификатор.
//       ПолучитьМакет("КлассификаторАдресныхОбъектовРоссии").ПолучитьТекст());
//
// Возвращаемое значение:
//  Структура с полями 
//   ИмяТаблицы - Строка
//   Данные - ТаблицаЗначений.
//
Функция ПрочитатьXMLВТаблицу(Знач XML) Экспорт
	
	Если ТипЗнч(XML) <> Тип("ЧтениеXML") Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(XML);
	Иначе
		Чтение = XML;
	КонецЕсли;
	
	// Прочитаем первый узел и проверим его
	Если Не Чтение.Прочитать() Тогда
		ВызватьИсключение("Пустой XML");
	ИначеЕсли Чтение.Имя <> "Items" Тогда
		ВызватьИсключение("Ошибка в структуре XML");
	КонецЕсли;
	
	// Получим описание таблицы и создадим ее
	ИмяТаблицы = Чтение.ПолучитьАтрибут("Description");
	ИменаКолонок = СтрЗаменить(Чтение.ПолучитьАтрибут("Columns"), ",", Символы.ПС);
	Колонок = СтрЧислоСтрок(ИменаКолонок);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Для Сч = 1 По Колонок Цикл
		ТаблицаЗначений.Колонки.Добавить(СтрПолучитьСтроку(ИменаКолонок, Сч), Новый ОписаниеТипов("Строка"));
	КонецЦикла;
	
	// Заполним значения в таблице
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента И Чтение.Имя = "Items" Тогда
			Прервать;
		ИначеЕсли Чтение.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		ИначеЕсли Чтение.Имя <> "Item" Тогда
			ВызватьИсключение("Ошибка в структуре XML");
		КонецЕсли;
		
		новСтр = ТаблицаЗначений.Добавить();
		Для Сч = 1 По Колонок Цикл
			ИмяКолонки = СтрПолучитьСтроку(ИменаКолонок, Сч);
			новСтр[Сч-1] = Чтение.ПолучитьАтрибут(ИмяКолонки);
		КонецЦикла;
		
	КонецЦикла;
	
	// Заполним результат
	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицы", ИмяТаблицы);
	Результат.Вставить("Данные", ТаблицаЗначений);
	
	Возврат Результат;
	
КонецФункции // ПрочитатьXMLВТаблицу()

Функция ПолучитьПоляТаблицыДляЗапроса(Таблица, ИмяТаблицы, Знач НеВключатьПоля = Неопределено) Экспорт
	
	ПоляТаблицыДляЗапроса = "";
	
	// нормализуем строковый список полей
	НеВключатьПоля = ВРег(СокрЛП(НеВключатьПоля)) + ",";
	
	Пока Найти(НеВключатьПоля, " ") > 0 Цикл
		НеВключатьПоля = СтрЗаменить(НеВключатьПоля, " ", "");
	КонецЦикла;
	
	// выделим поля таблицы в строку для запроса
	ЭтоПервоеПолеВЗапросе = Истина;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если Найти(НеВключатьПоля, ВРег(Колонка.Имя) + ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляТаблицыДляЗапроса = ПоляТаблицыДляЗапроса
			+ ?(ЭтоПервоеПолеВЗапросе, "", ",") + Символы.ПС + Символы.Таб
			+ ?(ПустаяСтрока(ИмяТаблицы), "", ИмяТаблицы  + ".") + Колонка.Имя;
			
		ЭтоПервоеПолеВЗапросе = Ложь;
	КонецЦикла;
	
	Возврат ПоляТаблицыДляЗапроса;
	
КонецФункции // ПолучитьПоляТаблицыДляЗапроса

Функция ТаблицаЗначений_ИзменитьТипЗначенияКолонки(Таблица, ИмяКолонки, НовыйТипЗначения) Экспорт
	
	СлужебнаяКолонка = Таблица.Колонки.Добавить("_СлужебнаяКолонка_", НовыйТипЗначения);
	
	Таблица.ЗагрузитьКолонку(Таблица.ВыгрузитьКолонку(ИмяКолонки), "_СлужебнаяКолонка_");
	
	Таблица.Колонки.Удалить(ИмяКолонки);
	
	СлужебнаяКолонка.Имя = ИмяКолонки;	
	
КонецФункции

// Исправление фичи платформы: при помещении во временную таблицу SQL числовые колонки, для которых не определена точность,
//  округляются до 9 знаков после запятой
//
// Параметры:
//  Таблица - ТаблицаЗначений - проверяемая таблица
//  ПроверяемыеКолонки - Структура - ключ: имя колонки, значение: описание типа с нужной точностью
//
Процедура ТаблицаЗначений_ОбновитьТочностьКолонок(Таблица, ПроверяемыеКолонки) Экспорт 
	
	Для Каждого ПроверяемаяКолонка Из ПроверяемыеКолонки Цикл
		
		Колонка = Таблица.Колонки.Найти(ПроверяемаяКолонка.Ключ);			
		
		Если Колонка <> Неопределено
			И Колонка.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти < ПроверяемаяКолонка.Значение.КвалификаторыЧисла.РазрядностьДробнойЧасти
		Тогда 
			РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(Таблица, ПроверяемаяКолонка.Ключ, ПроверяемаяКолонка.Значение);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив структур
// 
// Параметры:
//  ТабЗнч			- ТаблицаЗначений	- таблица значений
//	КолонкиТабЗнч	- Строка			- колонки таблицы значений, разделенные запятой
//
// Возвращаемое значение:
//  Массив - массив каждый элемент которого это структура, соответствующая строке таблицы значений
//
Функция ТаблицаЗначений_В_МассивСтруктур(ТабЗнч, КолонкиТабЗнч = Неопределено) Экспорт
	
	Если КолонкиТабЗнч = Неопределено Тогда
		ОписаниеСтруктуры = "";
		Для каждого Колонка Из ТабЗнч.Колонки Цикл
			ОписаниеСтруктуры = ОписаниеСтруктуры + ?(ОписаниеСтруктуры = "", "", ",") + Колонка.Имя;
		КонецЦикла;
	Иначе
		ОписаниеСтруктуры = КолонкиТабЗнч;
	КонецЕсли;
	
	Массив = Новый Массив();
	Для каждого СтрокаТабЗнч Из ТабЗнч Цикл
		СтрокаМассива = Новый Структура(ОписаниеСтруктуры);
		ЗаполнитьЗначенияСвойств(СтрокаМассива, СтрокаТабЗнч, ОписаниеСтруктуры);
	    Массив.Добавить(СтрокаМассива);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДЕРЕВЬЯ ЗНАЧЕНИЙ

Процедура ДеревоЗначений_ЗаполнитьИзДерева(ДеревоПриемник, ДеревоИсточник, ОчищатьПередЗаполнением = Истина) Экспорт
	
	Если ОчищатьПередЗаполнением Тогда
		ДеревоПриемник.Строки.Очистить();
	КонецЕсли;
	
	Для каждого СтрокаДеревоИсточник Из ДеревоИсточник.Строки Цикл
		СтрокаДеревоПриемник = ДеревоПриемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДеревоПриемник, СтрокаДеревоИсточник);
		
		ДеревоЗначений_ЗаполнитьИзДерева(СтрокаДеревоПриемник, СтрокаДеревоИсточник, Ложь);
	КонецЦикла;
		
КонецПроцедуры // ДеревоЗначений_ЗаполнитьИзДерева

Процедура ДеревоЗначений_ЗаполнитьИзВыборки(Дерево, Выборка) Экспорт
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаНастройки = Дерево.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНастройки, Выборка);
		//НоваяСтрокаНастройки.Значение = Выборка.Настройка.ТипЗначения.ПривестиЗначение(Выборка.Значение);
		
		СтрокиВыборки = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если СтрокиВыборки.Количество() > 0 Тогда
			ДеревоЗначений_ЗаполнитьИзВыборки(НоваяСтрокаНастройки.ПолучитьЭлементы(), СтрокиВыборки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДеревоЗначений_ЗаполнитьИзВыборки

Функция ДеревоЗначений_ПолучитьВетку(Дерево, УзелВетки, ВключатьКорневойУзелВетки = Истина, УдалитьВеткуИзДерева = Ложь) Экспорт
	
	НовоеДерево = Дерево.Скопировать();
	НовоеДерево.Строки.Очистить();
	
	Если ТипЗнч(УзелВетки) = Тип("СтрокаДереваЗначений") Тогда
		НайденныеВетки = Новый Массив;
		НайденныеВетки.Добавить(УзелВетки);
	Иначе	
		НайденныеВетки = Дерево.Строки.НайтиСтроки(УзелВетки, Истина);
	КонецЕсли;
	
	Для Каждого НайденнаяВетка Из НайденныеВетки Цикл
		НовыйУзел = НовоеДерево;
		
		Если ВключатьКорневойУзелВетки Тогда
			НовыйУзел = НовоеДерево.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйУзел, НайденнаяВетка);
		КонецЕсли;
		
		ДеревоЗначений_ЗаполнитьИзДерева(НовыйУзел, НайденнаяВетка, Ложь);
	КонецЦикла;
	
	Если УдалитьВеткуИзДерева Тогда
		Для Каждого НайденнаяВетка Из НайденныеВетки Цикл
			// В попытке, т.к. не нашел, как определить удалена строка ранее или нет
			Попытка
				РодительскийУзел = НайденнаяВетка.Родитель;	
			Исключение
				Продолжить;	
			КонецПопытки;
			
			Если РодительскийУзел = Неопределено Тогда
				Дерево.Строки.Удалить(НайденнаяВетка);
			Иначе
				НайденнаяВетка.Родитель.Строки.Удалить(НайденнаяВетка);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НовоеДерево;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция выполняет поиск элемента в коллекции: списке значений или массиве
//
Функция НайтиВСписке(Список, Элемент)
	
	Перем ЭлементВСписке;
	
	Если ТипЗнч(Список) = Тип("СписокЗначений") Тогда
		
		Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений") Тогда
			ЭлементВСписке = Список.НайтиПоЗначению(Элемент.Значение);
		Иначе
			ЭлементВСписке = Список.НайтиПоЗначению(Элемент);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Список) = Тип("Массив") ИЛИ ТипЗнч(Список) = Тип("ФиксированныйМассив") Тогда
		
		ЭлементВСписке = Список.Найти(Элемент);
		
	КонецЕсли;
	
	Возврат ЭлементВСписке;
	
КонецФункции // ЭлементПрисутствуетВСписке
