
Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Возврат "БизнесПроцесс.ОбменПаев.Форма.ФормаЗадачи";
	
КонецФункции

Функция ЗаявкаНаПриобретениеПоЗаявкеНаОбменПаев(Организация, ЗаявкаНаОбмен) Экспорт
	
	ЗаявкаНаПриобретение = Неопределено;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаПайщика.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|ГДЕ
		|	ЗаявкаПайщика.Организация = &Организация
		|	И ЗаявкаПайщика.ЗаявкаНаОбмен = &ЗаявкаНаОбмен
		|	И НЕ ЗаявкаПайщика.ПометкаУдаления");

	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ЗаявкаНаОбмен",	ЗаявкаНаОбмен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаНаПриобретение = Выборка.Ссылка;			
	КонецЕсли;
	
	Возврат ЗаявкаНаПриобретение;
	
КонецФункции