
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидОперации");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидДокумента = "Распоряжение";
	
	Если Данные.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.МНО Тогда
		
		ВидДокумента = ВидДокумента + " на МНО";
		
	ИначеЕсли Данные.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда 
	
		ВидДокумента = ВидДокумента + " на открытие депозитного вклада";
					
	КонецЕсли;
	
	Представление = ВидДокумента + " " + Данные.Номер + " от " + Данные.Дата;
	
КонецПроцедуры