
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДоговорДепозитарногоОбслуживания	= ПараметрКоманды;
	ЭтаФорма							= ПараметрыВыполненияКоманды.Источник;
	
	АдресДереваДочернихЭлементов = РаботаСИсполнителями.ПолучитьДочерниеЭлементы(ДоговорДепозитарногоОбслуживания, , "ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)", , ЭтаФорма.УникальныйИдентификатор);
	Если ЗначениеЗаполнено(АдресДереваДочернихЭлементов) Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидимыеКолонки",				"Представление");
		ДополнительныеПараметры.Вставить("ОтмеченныеЭлементы",			Новый Структура("Элемент", ДоговорДепозитарногоОбслуживания));
		ДополнительныеПараметры.Вставить("ПолеКлючевогоЗначенияСтроки", "Элемент");
		ДополнительныеПараметры.Вставить("ПутьКДаннымКартинкиСтроки",	"ДеревоЗначений.ДанныеКартинки");
		ДополнительныеПараметры.Вставить("КартинкаСтрок",				БиблиотекаКартинок.РегистрСведенийЗапись);
		
		РезультатВопроса = РаботаСФормамиКлиент.ПоказатьДеревоЗначений(АдресДереваДочернихЭлементов, , ЭтаФорма, "Закрыть", "Закрыть", "Договор депозитарного обслуживания", ДополнительныеПараметры);
	КонецЕсли;	
	
КонецПроцедуры
