
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ТипЗадолженности");
	Поля.Добавить("ВыводВсехАктивов"); 
	Поля.Добавить("СпособПередачи");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидДокумента = "Поручение";
	
	Если Данные.ВыводВсехАктивов Тогда
		
		ВидДокумента = ВидДокумента + " на вывод всех активов";
		
	Иначе
		
		Если Данные.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
			
			ВидДокумента = ВидДокумента + " на предоставление денежных средств";	
	
		ИначеЕсли  Данные.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
			
			ВидДокумента = ВидДокумента + " на ввод денежных средств";
		
			
		ИначеЕсли Данные.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
			
			ВидДокумента = ВидДокумента + " на вывод денежных средств";
				
		Иначе 
			
			ВидДокумента = ВидДокумента + " на движение денежных средств";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Представление = ВидДокумента + " " + Данные.Номер + " от " + Данные.Дата;
	
КонецПроцедуры
