
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Обстоятельство = ЭтотОбъект.ОбстоятельствоВозникновенияКонфликтаИнтересов;
	Если ЗначениеЗаполнено(Обстоятельство) И Обстоятельство.ПринадлежитЭлементу(Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.КодексПрофессиональнойЭтики) Тогда
	
		Если Не ЭтотОбъект.Статус = Перечисления.СтатусыСлужебныхРасследований.НаРассмотрении Тогда
			РеквизитыСтрока = "УсловияВозниковенияКонфликта, УсловияВозниковенияКонфликта.ОписаниеУсловий, Обоснование, РуководительОрганизации";
			Если ЭтотОбъект.Статус = Перечисления.СтатусыСлужебныхРасследований.ВыявленКонфликтИнтересов Тогда
				РеквизитыСтрока = РеквизитыСтрока + ", ПринятыеМеры";
			КонецЕсли;
			РаботаСКоллекциями.ДополнитьМассив(ПроверяемыеРеквизиты, СтрРазделить(РеквизитыСтрока, ", ", Ложь));
		КонецЕсли; 
		
	Иначе
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	
	КонецЕсли; 
	
КонецПроцедуры
