
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого ЭлементОтбора Из Параметры.Отбор Цикл
		Если ЭлементОтбора.Ключ = "ДатаЗаключения"
		 ИЛИ ЭлементОтбора.Ключ = "ДатаРасторжения" Тогда
			Параметры.Отбор.Вставить(ЭлементОтбора.Ключ, НачалоДня(ЭлементОтбора.Значение));
			Параметры.Отбор.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ОтображатьЗакрытые = Ложь;
	
	ДатаРасторжения = Неопределено;
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		ДатаРасторжения = Справочники.Договоры.ПолучитьДатуРасторженияДоговора(Параметры.ТекущаяСтрока);
		ОтображатьЗакрытые = (ЗначениеЗаполнено(ДатаРасторжения) И ДатаРасторжения < ТекущаяДата());
		
	ИначеЕсли Параметры.Отбор.Свойство("ДатаРасторжения", ДатаРасторжения) Тогда	
		ОтображатьЗакрытые = (ЗначениеЗаполнено(ДатаРасторжения) И ДатаРасторжения < ТекущаяДата());
		
	КонецЕсли;
	
	Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка = ОтображатьЗакрытые;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",        КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые", ОтображатьЗакрытые);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьЗакрытые(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьЗакрытые",
		Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка);
	
КонецПроцедуры
