
////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ И ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ИсполнителиСобственные.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ИсполнителиБрокерские.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	УстановитьОтборСписковПоРасчетномуСчету(ЭтаФорма, Неопределено);	
	
	// По умолчанию скрываем закрытых
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.Список.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиСобственные.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиБрокерские.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	РасчетныйСчет = Элементы.Список.ТекущаяСтрока;		
	
	УстановитьОтборСписковПоРасчетномуСчету(ЭтаФорма, РасчетныйСчет);		
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура КомандаБанковскиеСчетаПоказатьСкрытьЗакрытые(Команда)
	
	ПоказыватьЗакрытых = Не Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка;	
	
	Элементы.ФормаКомандаПоказатьСкрытьЗакрытые.Пометка = ПоказыватьЗакрытых;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.Список.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Не ПоказыватьЗакрытых, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых(Команда)
	
	ПоказыватьЗакрытых = Не Элементы.КомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка;	
	
	Элементы.КомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка = ПоказыватьЗакрытых;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиСобственные.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Не ПоказыватьЗакрытых, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых(Команда)
	
	ПоказыватьЗакрытых = Не Элементы.КомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка;
	
	Элементы.КомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка = ПоказыватьЗакрытых;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиБрокерские.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"), "ПредопределенныйОтборЗакрыт",
		ВидСравненияКомпоновкиДанных.Равно, Ложь, Не ПоказыватьЗакрытых, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто
	);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписковПоРасчетномуСчету(ЭтаФорма, РасчетныйСчет)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиСобственные.Отбор, "РасчетныйСчет", ,
		ВидСравненияКомпоновкиДанных.Равно, РасчетныйСчет, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ
	);

	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(
		ЭтаФорма.ИсполнителиБрокерские.Отбор, "РасчетныйСчет", ,
		ВидСравненияКомпоновкиДанных.Равно, РасчетныйСчет, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ
	);
		
КонецПроцедуры