
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// В паевые инвест. фонды у нас заведены в т.ч. и ETF. У них, как и у Еврооблигаций,  нет рег. номера
	// и даты гос. регистрации. Явного признака для выделения таких ПИФ в Матрихе и у нас пока нет.
	// В Матрихе есть страна, но ее к себе мы не грузим. Т.к. задача срочная, будем проводить проверку по стране эмитента
	ЭтоИностранныйПИФ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации КАК СтранаРегистрации
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
	
	УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФНаДату(ТекущаяДатаСеанса(), ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтоИностранныйПИФ = (Выборка.СтранаРегистрации <> Справочники.СтраныМира.Россия);
	КонецЕсли;
	
	Если ЭтоИностранныйПИФ Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ГосударственныйРегистрационныйНомер"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаРегистрации"));
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаПроверкиЗаполнения

Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда  		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);						
	КонецЕсли;
		
КонецПроцедуры // ПередЗаписью
