
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресСКД) Тогда
		
		Настройки = Компоновщик.ПолучитьНастройки();
		Для каждого Параметр Из Настройки.ПараметрыДанных.Элементы Цикл
		
			Параметр.Использование = Истина;
			
		КонецЦикла;
		
		ТекущийОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
		ТекущийОбъект.ХранилищеСКД = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД)); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда		
		
		ТекущиеПараметры = ЭтаФорма.Компоновщик.ПолучитьНастройки();
		
		Модифицированность = Истина;
		ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(ВыбранноеЗначение);
		ЭтаФорма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
		ЭтаФорма.Компоновщик.ЗагрузитьНастройки(ТекущиеПараметры);
		ЭтаФорма.Компоновщик.Восстановить();
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаборДанныхПриИзменении(Элемент)
	ПолучитьСКДИзКонфигурацииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.ПолноеИмяФайла = "";
	ВыборФайла.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
	ВыборФайла.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗагрузитьСхемуИзФайлаВыборФайла",
		ЭтотОбъект);
	
	ВыборФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСКД(Команда)
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСКД);
		
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		Сообщить("Редактирование СКД доступно только в режиме толстого клиета");
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.МножественныйВыбор = Ложь;
	Фильтр = НСтр("ru = 'Файл схемы компоновки данных (*.xml)|*.xml|Все файлы (*.*)|*.*'");
	ВыборФайла.Фильтр = Фильтр;
	ВыборФайла.Расширение = "xml";
	
	Если Не ВыборФайла.Выбрать() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ВыборФайла.ПолноеИмяФайла, ПоместитьСхемуКомпоновкиДанныхВоВременноеХранилище()));
	ПолучитьФайлы(ПолучаемыеФайлы, , "c:\", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзКонфигурации(Команда)
	Если Вопрос("Текущая схема будет заменена стандартной. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ПолучитьСКДИзКонфигурацииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиПоУмолчанию(Команда)
	Если Вопрос("Настройки параметров и отборов будут загружены из схемы компоновки данных. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
		ПолучитьНастройкиПоУмолчаниюНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайлаВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ВыбранныеФайлы[0], КодировкаТекста.UTF8);
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	ЗагрузитьСхемуИзФайлаНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстXML)
	
	Попытка
		
		ТекущиеПараметры = ЭтаФорма.Компоновщик.ПолучитьНастройки();
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		
		Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
		Компоновщик.ЗагрузитьНастройки(ТекущиеПараметры);
		Компоновщик.Восстановить();

		Модифицированность = Истина;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСхемуКомпоновкиДанныхВоВременноеХранилище()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
	ЗаписьТекста.Записать(ПолучитьСхемуНаСервере());
	ЗаписьТекста.Закрыть();
	Результат = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла));
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСхемуНаСервере()

	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСКД);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СхемаКомпоновкиДанных, "DataCompositionSchema", "http://v8.1c.ru/8.1/data-composition-system/schema");
	Возврат ЗаписьXML.Закрыть();

КонецФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Для каждого НаборДанных Из Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСписокНаборовДанных() Цикл
		ЗаполнитьЗначенияСвойств(Элементы.НаборДанных.СписокВыбора.Добавить(), НаборДанных);
	КонецЦикла; 
		
	Если Не (Объект.Ссылка.Пустая() 
		И Параметры.ЗначениеКопирования.Пустая()) Тогда
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.БазисыКонтроляИнвестиционныхДеклараций"));
		
		Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
		
			ТекущийОбъект.ХранилищеСКД = Параметры.ЗначениеКопирования.ХранилищеСКД;
			ТекущийОбъект.ХранилищеНастроек = Параметры.ЗначениеКопирования.ХранилищеНастроек;
		
		КонецЕсли; 
		
		СКД = ТекущийОбъект.ХранилищеСКД.Получить();
		
		Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
		
			АдресСКД = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
			
			Настройки = ТекущийОбъект.ХранилищеНастроек.Получить();
			
			Если НЕ ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
			
				Настройки = СКД.НастройкиПоУмолчанию;
			
			КонецЕсли; 
			
			Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
			Компоновщик.ЗагрузитьНастройки(Настройки);
			Компоновщик.Восстановить();
					
		КонецЕсли;
		
		РедактированиеЗапрещено = ТекущийОбъект.РедактированиеЗапрещено();
		Элементы.НаборДанных.ТолькоПросмотр = РедактированиеЗапрещено;
		Элементы.КомпоновщикНастройкиПараметрыДанных.ТолькоПросмотр = РедактированиеЗапрещено;
		Элементы.КомпоновщикНастройкиОтбор.ТолькоПросмотр = РедактированиеЗапрещено;
			
	КонецЕсли;
	
	Элементы.КомпоновщикНастройкиОтбор.Видимость = (Объект.РежимПолученияБазы = 1);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ПолучитьСКДИзКонфигурацииНаСервере()
	
	// сохраним настройки, чтоб не потерять
	ТекущиеПараметры = ЭтаФорма.Компоновщик.ПолучитьНастройки();
	
	СКД = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьСКДБазиса(Объект.НаборДанных);
	
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	
	// инициализируем компоновщик и загружаем старые настройки
	ЭтаФорма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.АдресСКД));
	ЭтаФорма.Компоновщик.ЗагрузитьНастройки(ТекущиеПараметры);
	ЭтаФорма.Компоновщик.Восстановить();
		
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиПоУмолчаниюНаСервере()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.БазисыКонтроляИнвестиционныхДеклараций"));
		СКД = ТекущийОбъект.ХранилищеСКД.Получить();
		
		Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
			ЭтаФорма.Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеОтбора(ЭлементОтбора)

	Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
		КоличествоПодчиненных = ЭлементОтбора.Элементы.Количество();
		Если ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			Префикс = "НЕ (";
		Иначе
			Префикс = "(";
		КонецЕсли; 
		
		ПредставлениеОтбора = "";
		Текущий = 1;
		
		Для каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
			
			ПредставлениеОтбора = ПредставлениеОтбора + ПолучитьПредставлениеОтбора(ЭлементГруппы);
			Если Текущий <> КоличествоПодчиненных Тогда
			    ПредставлениеОтбора = ПредставлениеОтбора + Символы.ПС + ?(ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли, " ИЛИ ", " И ") + Символы.ПС;
			КонецЕсли; 
			Текущий = Текущий + 1;
		
		КонецЦикла; 
		
		ПредставлениеОтбора = Префикс + ПредставлениеОтбора + ")";
			
	Иначе
		
		ВидыСравненияСписок = Новый Массив;
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
		ВидыСравненияСписок.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
		
		ЛевоеЗначение = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ЭлементОтбора.ЛевоеЗначение).Заголовок;
		ТекВидСравнения = ЭлементОтбора.ВидСравнения;
		
		Если ВидыСравненияСписок.Найти(ТекВидСравнения) = Неопределено Тогда
			
			ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
			
		Иначе
			
			ПравоеЗначение = "";
			Для каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
				ПравоеЗначение = ПравоеЗначение + "; " + ЭлементСписка.Значение;
			КонецЦикла; 
			ПравоеЗначение = Сред(ПравоеЗначение, 2);
		
		КонецЕсли;
		
		ПравоеЗначение = """" + ПравоеЗначение + """";
		
		ПредставлениеОтбора = ЛевоеЗначение + " " + ТекВидСравнения + " " + ПравоеЗначение;
		
	КонецЕсли; 
	
	Возврат ПредставлениеОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОписаниеПараметров = "Состав и параметры формирования базиса: ";
	
	Настройки = Компоновщик.Настройки;
	
	Для каждого Параметр Из Настройки.ПараметрыДанных.Элементы Цикл
	
		ОписаниеПараметра = "";
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Параметр.Параметр);
		
		Если ДоступныйПараметр.Видимость Тогда
		
			Если ТипЗнч(Параметр.Значение) = Тип("Булево") И Параметр.Значение Тогда
				ОписаниеПараметра = ДоступныйПараметр.Заголовок;
			ИначеЕсли ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") И Параметр.Значение.Количество() > 0 Тогда
				
				Для каждого ЭлементСписка Из Параметр.Значение Цикл
					
					Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
						ОписаниеПараметра = ОписаниеПараметра + ", " + ЭлементСписка.Значение;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если ЗначениеЗаполнено(ОписаниеПараметра) Тогда
					ОписаниеПараметра = ДоступныйПараметр.Заголовок + ": " + Сред(ОписаниеПараметра, 3);
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(Параметр.Значение) <> Тип("Булево") И ЗначениеЗаполнено(Параметр.Значение) Тогда
				ОписаниеПараметра = ДоступныйПараметр.Заголовок + ": " + Параметр.Значение;
			КонецЕсли; 
			
			ОписаниеПараметров = ОписаниеПараметров + ?(ОписаниеПараметра = "", "", Символы.ПС + ОписаниеПараметра);			
		
		КонецЕсли; 
		
	КонецЦикла;
	
	База = "База рассчитывается " + ?(Объект.РежимПолученияБазы = 0, "по методике клиента", "по таблице");
	
	Отборы = "";
	
	КоличествоПодчиненных = Компоновщик.Настройки.Отбор.Элементы.Количество();
	Отборы = "";
	Текущий = 1;
				
	Для каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
	    		
		Отборы = Отборы + ПолучитьПредставлениеОтбора(ЭлементОтбора);
		Если Текущий <> КоличествоПодчиненных Тогда
		    Отборы = Отборы + Символы.ПС + " И " + Символы.ПС;
		КонецЕсли; 
		Текущий = Текущий + 1;
	
	КонецЦикла; 
	
	Отборы = ?(Отборы = "", "", " с отборами: " + Символы.ПС + Отборы + Символы.ПС);
	
	Объект.Описание = База + Отборы + Символы.ПС + ОписаниеПараметров;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПолученияБазыПриИзменении(Элемент)
	
	Элементы.КомпоновщикНастройкиОтбор.Видимость = (Объект.РежимПолученияБазы = 1);
	
КонецПроцедуры


#КонецОбласти 
