Функция ПолучитьТаблицуПаевыхИнвестиционныхФондов(Организация, ДатаСЧА, ПолучитьСЧА, ОтборПоТипуПИФа = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК Выбран,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	РеквизитыПИФСрезПоследних.УправляющаяКомпания КАК УправляющаяКомпания,
		|	ВЫРАЗИТЬ(КлиентыДоверительногоУправления.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип КАК Тип,
		|	РегистрацияСтоимостиАктивов.Ссылка КАК РегистрацияСтоимостиАктивов,
		|	РегистрацияСтоимостиАктивов.СЧАРынок КАК СЧАРынок,
		|	РегистрацияСтоимостиАктивов.РСА КАК РСА,
		|	РегистрацияСтоимостиАктивов.СтоимостьПая КАК СтоимостьПая,
		|	КлиентыДоверительногоУправления.Клиент КАК ПИФ
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаСЧА, ) КАК КлиентыДоверительногоУправления
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаСЧА, ) КАК РеквизитыПИФСрезПоследних
		|		ПО ((ВЫРАЗИТЬ(КлиентыДоверительногоУправления.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|		ПО (&ПолучитьСЧА)
		|			И СчетаДоверительногоУправления.Ссылка = РегистрацияСтоимостиАктивов.СчетДоверительногоУправления
		|			И (КОНЕЦПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ) = &ДатаСЧА)
		|			И (РегистрацияСтоимостиАктивов.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО ((ВЫРАЗИТЬ(КлиентыДоверительногоУправления.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = ЗначенияДополнительныхСведений.Объект)
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаПрекращенияОтправкиСЧАНаСайт"")
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидСчетаДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовДоверительногоУправления.Договор)
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов))
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = &ПустаяДата
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &ДатаСЧА)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаСЧА
		|	И КОНЕЦПЕРИОДА(ЕСТЬNULL(ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Значение КАК ДАТА), ДАТАВРЕМЯ(3999, 12, 31)), ДЕНЬ) > &ДатаСЧА
		|	И &ОтборПоТипуПИФа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Паи.Ссылка КАК Ссылка,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ПаиТоргуемыеНаБирже
		|ИЗ
		|	Справочник.Паи КАК Паи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО Паи.ПаевойИнвестиционныйФонд = _СчетаДоверительногоУправления.ПИФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
		|				&ДатаСЧА,
		|				Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|					И Статус = ЗНАЧЕНИЕ(Перечисление.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже)) КАК СтатусыЦенныхБумагСрезПоследних
		|		ПО Паи.Ссылка = СтатусыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|ГДЕ
		|	СтатусыЦенныхБумагСрезПоследних.Активен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Выбран КАК Выбран,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.УправляющаяКомпания КАК УправляющаяКомпания,
		|	_СчетаДоверительногоУправления.Тип КАК Тип,
		|	_СчетаДоверительногоУправления.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов,
		|	_СчетаДоверительногоУправления.СЧАРынок КАК СЧА,
		|	_СчетаДоверительногоУправления.РСА КАК РСА,
		|	_СчетаДоверительногоУправления.СтоимостьПая КАК СтоимостьПая,
		|	ЕСТЬNULL(ПодтверждениеОперацийБэкОфисаСрезПоследних.Подтверждена, ЛОЖЬ) КАК Подтверждена,
		|	ВЫБОР
		|		КОГДА &ПолучитьСЧА
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ПодтверждениеОперацийБэкОфисаСрезПоследних.Подтверждена, ЛОЖЬ) = ЛОЖЬ
		|						ТОГДА ""Не подтверждена""
		|					ИНАЧЕ ""Подтверждена""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПодтверждениеСсылка,
		|	ЗначенияДополнительныхСведений.Значение КАК АдресСайта,
		|	ВЫБОР
		|		КОГДА ЗначенияДополнительныхСведений.Значение ЕСТЬ НЕ NULL 
		|			ТОГДА ""Открыть на сайте компании""
		|	КОНЕЦ КАК Гиперссылка,
		|	ЗначенияДополнительныхСведенийИнтерфакс.Значение КАК АдресСайтаИнтерфакс,
		|	ВЫБОР
		|		КОГДА ЗначенияДополнительныхСведенийИнтерфакс.Значение ЕСТЬ НЕ NULL 
		|			ТОГДА ""Открыть на сайте Интерфакс""
		|	КОНЕЦ КАК ГиперссылкаИнтерфакс,
		|	0 КАК СЧАСайт,
		|	0 КАК СтоимостьПаяСайт,
		|	0 КАК СЧАИнтерфакс,
		|	0 КАК СтоимостьПаяИнтерфакс,
		|	0 КАК СЧАЛКК,
		|	0 КАК СтоимостьПаяЛКК,
		|	ЕСТЬNULL(КодыВоВнешнихСистемах.Код, """") КАК КодПИФВЕсиаФинанс
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				&ПолучитьСЧА
		|					И (Организация, Операция) В
		|						(ВЫБРАТЬ
		|							&Организация,
		|							_СчетаДоверительногоУправления.РегистрацияСтоимостиАктивов
		|						ИЗ
		|							_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления)) КАК ПодтверждениеОперацийБэкОфисаСрезПоследних
		|		ПО _СчетаДоверительногоУправления.РегистрацияСтоимостиАктивов = ПодтверждениеОперацийБэкОфисаСрезПоследних.Операция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""Обработка.ОтправкаДанныхПИФНаСайт"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПаиТоргуемыеНаБирже КАК _ПаиТоргуемыеНаБирже
		|		ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = _ПаиТоргуемыеНаБирже.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийИнтерфакс
		|		ПО (ЗначенияДополнительныхСведенийИнтерфакс.Объект = &Организация)
		|			И (ЗначенияДополнительныхСведенийИнтерфакс.Свойство.Ключ = ""Обработка.ОтправкаДанныхПИФНаСайтИнтерфакс"")
		|			И (НЕ _ПаиТоргуемыеНаБирже.СчетДоверительногоУправления ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах КАК КодыВоВнешнихСистемах
		|		ПО (КодыВоВнешнихСистемах.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс))
		|			И (КодыВоВнешнихСистемах.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))
		|			И _СчетаДоверительногоУправления.ПИФ = КодыВоВнешнихСистемах.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если ЗначениеЗаполнено(ОтборПоТипуПИФа) Тогда
		ПодстрокаОтбор = "ВЫРАЗИТЬ(КлиентыДоверительногоУправления.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = &ОтборПоТипуПИФа";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоТипуПИФа", ПодстрокаОтбор);
		Запрос.УстановитьПараметр("ОтборПоТипуПИФа", ОтборПоТипуПИФа);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоТипуПИФа", "ИСТИНА");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ПолучитьСЧА", ПолучитьСЧА);
	Запрос.УстановитьПараметр("ДатаСЧА", КонецДня(ДатаСЧА));
	Запрос.УстановитьПараметр("ПустаяДата",  Дата(1, 1, 1));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Процедура ПолучитьИнформациюССайта(Организация, ДатаСЧА, ПаевыеИнвестиционныеФонды) Экспорт

	ПолноеНаименованиеОрганизации = ПолноеНаименованиеОрганизации(Организация, ДатаСЧА);
	
	Для каждого СтрокаПаевыеИнвестиционныеФонды Из ПаевыеИнвестиционныеФонды Цикл
		
		АдресСайтаКомпании = СокрЛП(СтрокаПаевыеИнвестиционныеФонды.АдресСайта);
		
		Если ЗначениеЗаполнено(АдресСайтаКомпании) Тогда
			СтоимостиССайтаКомпании = ПолучитьСтоимостиССайтаКомпании(АдресСайтаКомпании, ДатаСЧА);
			СтрокаПаевыеИнвестиционныеФонды.СЧАСайт = СтоимостиССайтаКомпании.СЧА;
			СтрокаПаевыеИнвестиционныеФонды.СтоимостьПаяСайт = СтоимостиССайтаКомпании.СтоимостьПая;
		КонецЕсли; 
		
		АдресСайтаИнтерфакс = СокрЛП(СтрокаПаевыеИнвестиционныеФонды.АдресСайтаИнтерфакс);
		
		Если ЗначениеЗаполнено(АдресСайтаИнтерфакс) Тогда
			СтоимостиССайтаИнтерфакс = РаботаСВнешнимиСистемамиКлиентСервер.ПолучиьСтоимостиССайтаИнтерфакс(АдресСайтаИнтерфакс, ПолноеНаименованиеОрганизации, ДатаСЧА);
			СтрокаПаевыеИнвестиционныеФонды.СЧАИнтерфакс = СтоимостиССайтаИнтерфакс.СЧА;
			СтрокаПаевыеИнвестиционныеФонды.СтоимостьПаяИнтерфакс = СтоимостиССайтаИнтерфакс.СтоимостьПая;
		КонецЕсли; 			
		
		Если Не ПустаяСтрока(СтрокаПаевыеИнвестиционныеФонды.КодПИФВЕсиаФинанс) Тогда
			СтоимостиСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.ПоследняяСтоимостьПаяИСЧАЛКК(Организация, СтрокаПаевыеИнвестиционныеФонды.КодПИФВЕсиаФинанс, ДатаСЧА);
			СтрокаПаевыеИнвестиционныеФонды.СЧАЛКК			= СтоимостиСЛКК.СЧА;
			СтрокаПаевыеИнвестиционныеФонды.СтоимостьПаяЛКК	= СтоимостиСЛКК.СтоимостьПая;
		КонецЕсли; 			
					
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтоимостиССайтаКомпании(АдресСайтаКомпании, ДатаСЧА) Экспорт

	СтоимостиССайтаКомпании = Новый Структура("СтоимостьПая, СЧА", -1, -1);
	
	ДокументHTML = РаботаСВнешнимиСистемамиКлиентСервер.ПолучитьДокументHTMLПоГиперссылке(АдресСайтаКомпании);
	ЭлементыTABLE = ДокументHTML.ПолучитьЭлементыПоИмени("TABLE");
			
	Для каждого Таблица Из ЭлементыTABLE Цикл
	
		НовыйФормат = Ложь;
		Заголовки = Таблица.ПолучитьЭлементыПоИмени("th");
		Если Заголовки.Количество() = 0 Тогда
			// вероятно, это новый сайт
			Заголовки = Таблица.ПолучитьЭлементыПоИмени("td");
			НовыйФормат = Истина;
		КонецЕсли; 
		
		Если Заголовки.Количество() > 0 И (Заголовки[0].ТекстовоеСодержимое = "Дата и времяпубликации на сайте"
				Или Заголовки[0].ТекстовоеСодержимое = "Дата и времяпубликациина сайте") Тогда
			
			// это наша таблица, ищем нужные данные
			ПропуститьСтрокуЗаголовка = Истина;
			
			Для каждого СтрокаТаблицы Из Таблица.ДочерниеУзлы Цикл
				
				Если ПропуститьСтрокуЗаголовка Тогда
					ПропуститьСтрокуЗаголовка = Ложь;
					Продолжить;
				ИначеЕсли ТипЗнч(СтрокаТаблицы) <> Тип("ЭлементСтрокаТаблицыHTML") Тогда
					Продолжить;
				КонецЕсли; 
				
				Колонки = СтрокаТаблицы.ПолучитьЭлементыПоИмени("td");
				
				Если НовыйФормат Тогда
					Если СокрЛП(Колонки[1].ПоследнийДочерний.ТекстовоеСодержимое) = Формат(ДатаСЧА, "ДФ=dd.MM.yyyy") Тогда
						СтоимостиССайтаКомпании.СЧА = Число(СтрЗаменить(Колонки[3].ПоследнийДочерний.ТекстовоеСодержимое, " ", ""));
						СтоимостиССайтаКомпании.СтоимостьПая = Число(СтрЗаменить(Колонки[2].ПоследнийДочерний.ТекстовоеСодержимое, " ", ""));
						Прервать;
					КонецЕсли;
				Иначе	
					Если Колонки[1].ТекстовоеСодержимое = Формат(ДатаСЧА, "ДФ=dd.MM.yyyy") Тогда
						СтоимостиССайтаКомпании.СЧА = Число(Колонки[3].ТекстовоеСодержимое);
						СтоимостиССайтаКомпании.СтоимостьПая = Число(Колонки[2].ТекстовоеСодержимое);
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла; 
			
			Прервать;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат СтоимостиССайтаКомпании;
			
КонецФункции

Функция ПолноеНаименованиеОрганизации(Организация, Период)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Возврат Выборка.ПолноеНаименованиеПоУставу;
	
КонецФункции
