&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНастройкиПоУмолчанию();
	ЭтаФорма.ПодтверждениеПереноса = Ложь;
	ОбновлениеОтчетОПереносимыхНастройках();
			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	//БЭКофисный учет
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиЦелейРасчета);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧА);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧАПоВидамЗадолженности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаБенчмарков);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаПлановойДоходности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов);
	//ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.СоставИНастройкиОтчетов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.ЗначенияДополнительныхСведений);

	Если Параметры.Свойство("ДатаУстановки") Тогда
		Объект.ДатаУстановки = Параметры.ДатаУстановки; 
		Объект.ДатаВзятия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Параметры.Свойство("СчетДоверительногоУправленияКуда") Тогда
		Объект.СчетДоверительногоУправленияКуда = Параметры.СчетДоверительногоУправленияКуда;  
		Объект.СчетДоверительногоУправленияОткуда = КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаИлиДаты(Элемент)
	
	ЗаполнитьНастройкиПоУмолчанию();
	ОбновлениеОтчетОПереносимыхНастройках();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоУмолчанию()
	
	ПроставитьНастройкиПереноса();
	ПроставитьДоступностьНастроекПереноса();
	
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьПараметрыПереноса(СообщатьОбОщибке = Истина)
	
	СписокЗаполнения = "";
    ПереносВозможен = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияОткуда) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Счет доверительного управление откуда, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияКуда) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Счет доверительного управление куда, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВзятия) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Дата взятия настроек, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаУстановки) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Дата установки настроек, ";
	КонецЕсли;
	
	Если Не ПереносВозможен И СообщатьОбОщибке Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте заполнение реквизитов переноса: " + Лев(СписокЗаполнения, СтрДлина(СписокЗаполнения) - 2)); 
	КонецЕсли;
	
	Возврат ПереносВозможен;
	
КонецФункции


#Область Команды

&НаКлиенте
Процедура ПодтвердитьПереносИЗакрыть(Команда) 
	
	ЭтаФорма.ПодтверждениеПереноса = Истина; 
	Отказ = Ложь;
	
	Если ПроверитьПараметрыПереноса() Тогда
		СкопироватьНастройкиБЭК(ПолучитьСписокНастроекПереносаБЭК(), ПолучитьСписокНастроекДляСтатистики(), Отказ);
		
		Если НЕ Отказ Тогда 
			ЭтаФорма.Закрыть(); 
		Иначе    
			ЭтаФорма.ПодтверждениеПереноса = Ложь; 	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В процессе переноса настроек возникли ошибки! Настройки не перенесены!");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере()

	Возврат Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолучитьСчетОткудаДляКопированияНастроек(Объект.ДатаУстановки, Объект.Организация, Объект.СчетДоверительногоУправленияКуда); 
	
КонецФункции
	
&НаКлиенте
Процедура КомандаПодобратьСчетДУОткудаАвтоматически(Команда)
	
	Объект.СчетДоверительногоУправленияОткуда = КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере(); 
	ПриИзмененииСчетаИлиДаты(Элементы.СчетДоверительногоУправленияОткуда);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметкиВсехНастроек(Команда)

	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Ложь);
	ОбновлениеОтчетОПереносимыхНастройках();
	
КонецПроцедуры  

&НаКлиенте
Процедура КомандаУстановитьОтметкиВсехНастроек(Команда)
	
	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Истина);
	ОбновлениеОтчетОПереносимыхНастройках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьНастройкиПереноса()
		
	ВидДоговораКуда = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправленияКуда, "ВидДоговораДоверительногоУправления");
	Если ВидДоговораКуда = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") 
		ИЛИ ВидДоговораКуда = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица") Тогда  
		ЭтаФорма.КонтактныеЛицаИзАнкет = Ложь;
    Иначе
		ЭтаФорма.КонтактныеЛицаИзАнкет = Истина;
	КонецЕсли;
	
	ЭтаФорма.БанковскиеСчетаИзАнкет = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьДоступностьНастроекПереноса()
	
	ВидДоговораКуда = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправленияКуда, "ВидДоговораДоверительногоУправления");
	Если ВидДоговораКуда = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") 
		ИЛИ ВидДоговораКуда = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица") Тогда  
		ЭтаФорма.Элементы.КонтактныеЛицаИзАнкет.Доступность = Ложь;
    Иначе
		ЭтаФорма.Элементы.КонтактныеЛицаИзАнкет.Доступность = Истина;
	КонецЕсли;
	
	ЭтаФорма.Элементы.БанковскиеСчетаИзАнкет.Доступность = Истина;
		
КонецПроцедуры	

#КонецОбласти

#Область ПереносБЭКОфис

&НаСервере
Процедура ДобавитьРегистрНастроекНаСервере(РегистрМД)

	ЭтаФорма.РегистрыНастроек.Добавить(РегистрМД.Имя, РегистрМД.Синоним, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиБЭК(НастройкиПереноса, НастройкиСтатистки = Неопределено, Отказ)
	
	КопируемыеРегистры = Новый СписокЗначений;
		
	Для Каждого РегистрНастроек Из ЭтаФорма.РегистрыНастроек Цикл
		Если РегистрНастроек.Пометка Тогда
			КопируемыеРегистры.Добавить(РегистрНастроек.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если КопируемыеРегистры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один регистр с настройками", , "РегистрыНастроек");
	ИначеЕсли Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ПодтверждениеПереноса Тогда
		
		Сессия = Неопределено;
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(НастройкиСтатистки);
		Механизм = Метаданные.Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолноеИмя();
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	КонецЕсли;
	
	СкопироватьНастройкиНаСервере(КопируемыеРегистры, НастройкиПереноса, Отказ);

	Если ЭтаФорма.ПодтверждениеПереноса Тогда
		Если Сессия <> Неопределено Тогда
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиНаСервере(КопируемыеРегистры, НастройкиПереноса, Отказ) Экспорт 
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	РеквизитФормыВЗначение("Объект").ПереносНастроекБЭК(ЭтаФорма.Отчет, КопируемыеРегистры, НастройкиПереноса, Отказ);	
		
КонецПроцедуры

#КонецОбласти    

&НаКлиенте
Функция ПолучитьСписокНастроекПереносаБЭК()
	
	НастройкиПереноса = Новый Структура;

	НастройкиПереноса.Вставить("ПодтверждениеПереноса", ЭтаФорма.ПодтверждениеПереноса);
	НастройкиПереноса.Вставить("КлиентКуда", ЭтаФорма.КлиентКуда);
	НастройкиПереноса.Вставить("КлиентОткуда", ЭтаФорма.КлиентОткуда);
	НастройкиПереноса.Вставить("КонтактныеЛицаИзАнкет", ЭтаФорма.КонтактныеЛицаИзАнкет);
	НастройкиПереноса.Вставить("БанковскиеСчетаИзАнкет", ЭтаФорма.БанковскиеСчетаИзАнкет);
	
	Возврат НастройкиПереноса;
	
КонецФункции   

&НаКлиенте
Функция ПолучитьСписокНастроекДляСтатистики()

	НастройкиСтатистки = Новый Структура;
	
	НастройкиСтатистки.Вставить("Организация", Объект.Организация);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияКуда", Объект.СчетДоверительногоУправленияКуда);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияОткуда", Объект.СчетДоверительногоУправленияОткуда);
	НастройкиСтатистки.Вставить("ДатаВзятия", Объект.ДатаВзятия);
	НастройкиСтатистки.Вставить("ДатаУстановки", Объект.ДатаУстановки);
	НастройкиСтатистки.Вставить("КонтактныеЛицаИзАнкет", ЭтаФорма.КонтактныеЛицаИзАнкет);
	НастройкиСтатистки.Вставить("БанковскиеСчетаИзАнкет", ЭтаФорма.БанковскиеСчетаИзАнкет);
	
	Для Каждого РегистрНастроек Из ЭтаФорма.РегистрыНастроек Цикл 
		НастройкиСтатистки.Вставить(РегистрНастроек.Значение, РегистрНастроек.Пометка);
	КонецЦикла; 
	
	Возврат НастройкиСтатистки;
		
КонецФункции

&НаКлиенте
Процедура КомандаОткрытьФормуБух(Команда)

	ПараметрыОбработки  = Новый Структура;
	ПараметрыОбработки.Вставить("СчетДоверительногоУправленияКуда", Объект.СчетДоверительногоУправленияКуда);
	ПараметрыОбработки.Вставить("ДатаУстановки", Объект.ДатаУстановки);	
	ПараметрыОбработки.Вставить("СчетДоверительногоУправленияОткуда", Объект.СчетДоверительногоУправленияОткуда);
	ПараметрыОбработки.Вставить("ДатаВзятия", Объект.ДатаВзятия);	
	
	ОткрытьФорму("Обработка.КопированиеНастроекСчетаДоверительногоУправления.Форма.ФормаБух", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтчетОПереносимыхНастройках()

	Если ПроверитьПараметрыПереноса(Ложь) Тогда
		СкопироватьНастройкиБЭК(ПолучитьСписокНастроекПереносаБЭК(),, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаИзАнкетПриИзменении(Элемент)
	ОбновлениеОтчетОПереносимыхНастройках();
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчетаИзАнкетПриИзменении(Элемент)
	ОбновлениеОтчетОПереносимыхНастройках();
КонецПроцедуры

&НаКлиенте
Процедура РегистрыНастроекПриИзменении(Элемент)
	ОбновлениеОтчетОПереносимыхНастройках();
КонецПроцедуры

