
&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Оповещение = ОбработкаОбъект.СформироватьОповещение();
	
	Если Оповещение <> Неопределено Тогда
		Результат = Оповещение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Сформировать");
	СформироватьНаСервере();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Период		= ТекущаяДата();
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
