
#Область ВнешниеВызовы

Функция ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке(КредитныеИнструменты, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт 
	
	Активы = ПолучитьТаблицуАктивов();
	ЕстьПризнакДенежногоПотока = (КредитныеИнструменты.Колонки.Найти("ДатаДенежногоПотока") <> Неопределено);
	
	Для Каждого СтрокаКредитныеИнструменты Из КредитныеИнструменты Цикл
		СтрокаАктивы = Активы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаАктивы, СтрокаКредитныеИнструменты);
		
		//Исходная таблица содержит колонку "ДатаДенежногоПотока" при расчете по своей ставке для каждого денежного потока.
		//Если колонки нет, то это обычный расчет
		Если ЕстьПризнакДенежногоПотока
			И ЗначениеЗаполнено(СтрокаКредитныеИнструменты.ДатаДенежногоПотока) Тогда
			СтрокаАктивы.ДатаПогашения = СтрокаКредитныеИнструменты.ДатаДенежногоПотока;
			СтрокаАктивы.ЭтоДенежныйПоток = Истина;
		Иначе
			СтрокаАктивы.ЭтоДенежныйПоток = Ложь;
		КонецЕсли;
		
		СтрокаАктивы.Актив = СтрокаКредитныеИнструменты.КредитныйИнструмент;
		СтрокаАктивы.ВидАктива = СтрокаКредитныеИнструменты.ВидАктива;
	КонецЦикла;
	
	АктивыПоРыночнойСтавке = ПолучитьСтоимостьАктивовПоРыночнойСтавке(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ);
	
	АктивыПоРыночнойСтавке.Колонки.Добавить("КредитныйИнструмент"				, Новый ОписаниеТипов("СправочникСсылка.ДепозитныеВклады, СправочникСсылка.Займы"));
	АктивыПоРыночнойСтавке.Колонки.Добавить("ПроцентПоКредитномуИнструменту"	, Новый ОписаниеТипов("Число"));
	АктивыПоРыночнойСтавке.Колонки.Добавить("СрокКредитногоИнструмента"			, Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаАктивыПоРыночнойСтавке Из АктивыПоРыночнойСтавке Цикл
		СтрокаАктивыПоРыночнойСтавке.КредитныйИнструмент	= СтрокаАктивыПоРыночнойСтавке.Актив;
		Если АктивыПоРыночнойСтавке.Колонки.Найти("ПроцентПоАктиву") <> Неопределено Тогда
			СтрокаАктивыПоРыночнойСтавке.ПроцентПоКредитномуИнструменту	= СтрокаАктивыПоРыночнойСтавке.ПроцентПоАктиву;
			СтрокаАктивыПоРыночнойСтавке.СрокКредитногоИнструмента		= СтрокаАктивыПоРыночнойСтавке.СрокАктиваДляПримененияРыночнойСтавки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат АктивыПоРыночнойСтавке;
	
КонецФункции

Процедура ПолучитьСтоимостьРЕПОПоРыночнойСтавке(ЗадолженностьПоСделкамРЕПО, СчетДоверительногоУправления, Период, ЦельРасчета, КомиссияВСтоимости = Ложь, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт
	
	Активы = ПолучитьТаблицуАктивов();
	
	ЕстьПризнакДенежногоПотока = (ЗадолженностьПоСделкамРЕПО.Колонки.Найти("ДатаДенежногоПотока") <> Неопределено);
	
	Для Каждого СтрокаЗадолженности Из ЗадолженностьПоСделкамРЕПО Цикл
		СтрокаАктивы = Активы.Добавить();
		СтрокаАктивы.Актив = СтрокаЗадолженности.СделкаРЕПО;
		
		Если ЕстьПризнакДенежногоПотока
			И ЗначениеЗаполнено(СтрокаЗадолженности.ДатаДенежногоПотока) Тогда
			СтрокаАктивы.ДатаПогашения = СтрокаЗадолженности.ДатаДенежногоПотока;
			СтрокаАктивы.ЭтоДенежныйПоток = Истина;
		Иначе
			СтрокаАктивы.ЭтоДенежныйПоток = Ложь;
		КонецЕсли;
		
		Если СтрокаЗадолженности.СделкаРЕПО.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО;
		Иначе
			СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО;
		КонецЕсли;
		
		СтрокаАктивы.Номинал	= СтрокаЗадолженности.Задолженность;
		
		СтрокаАктивы.Проценты = СтрокаЗадолженности.СуммаПроцентов;
			
		СтрокаАктивы.Ставка		= СтрокаЗадолженности.Ставка;
		
		Если КомиссияВСтоимости = Истина Тогда
			СтрокаАктивы.Комиссия = СтрокаЗадолженности.КомиссияПоРЕПОВВалютеСделки; //используется для расшифровки
		КонецЕсли;
	КонецЦикла;
	
	ПолучитьСтоимостьАктивовПоРыночнойСтавке(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ);
	
	ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ПроцентыЭСП", 	Новый ОписаниеТипов("Число"));
	ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("СуммаРезерва", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаАктивы Из Активы Цикл
		СтрокаЗадолженности = ЗадолженностьПоСделкамРЕПО.Найти(СтрокаАктивы.Актив, "СделкаРЕПО");
		Если СтрокаЗадолженности <> Неопределено Тогда
			СтрокаЗадолженности.СуммаПроцентов = СтрокаАктивы.Проценты + СтрокаАктивы.ПроцентыЭСП;
			СтрокаЗадолженности.ЗадолженностьПоСС = СтрокаЗадолженности.Задолженность + СтрокаАктивы.Проценты + СтрокаАктивы.ПроцентыЭСП;
			СтрокаЗадолженности.ПроцентыЭСП = СтрокаАктивы.ПроцентыЭСП;
			СтрокаЗадолженности.СуммаРезерва = СтрокаАктивы.СуммаРезерва;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьСтоимостьЗадолженностиПоРыночнойСтавке(ТаблицаЗадолженностей, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт 
	
	Активы = ПолучитьТаблицуАктивов();
	
	ЭтоРазбитыйНаПотокиАктив = ТаблицаЗадолженностей.Колонки.Найти("ЭтоДенежныйПоток") <> Неопределено;
	
	Если СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Ритм_УКПИ") Тогда
		Продажа_РПИ_160522_132387 = ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_160522_132387");
	Иначе
		Продажа_РПИ_160522_132387 = Неопределено;
	КонецЕсли;
	
	Продажа_РПИ_270624_18_2 			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_270624_18_2");   
	ПроцентыПоЗайму_РПИ_011024_5_1		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_011024_5_1");
	ПроцентыПоЗайму_РПИ_090125_5_1		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_090125_5_1");

	ЗаймГеоресурсЗадолженностьПоПроцентам = Ложь;
	
	Для Каждого СтрокаЗадолженности Из ТаблицаЗадолженностей Цикл

		Если (СтрокаЗадолженности.ОснованиеЗадолженности = ПроцентыПоЗайму_РПИ_011024_5_1
			ИЛИ СтрокаЗадолженности.ОснованиеЗадолженности = ПроцентыПоЗайму_РПИ_090125_5_1)
				И НЕ ЗаймГеоресурсЗадолженностьПоПроцентам Тогда
			ЗаймГеоресурсЗадолженностьПоПроцентам = Истина; 
			Активы.Колонки.Добавить("АдресРасшифровкиДенежныхПотоков");     
		КонецЕсли;
		
		СтрокаАктивы = Активы.Добавить();		
		
		Если Не ЭтоРазбитыйНаПотокиАктив Тогда
			Если СтрокаЗадолженности.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
				СтрокаАктивы.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность;
			ИначеЕсли СтрокаЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПолучениюВАренду Тогда
				СтрокаАктивы.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженностьПоДолгосрочнойАренде;
			Иначе
				СтрокаАктивы.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность;
			КонецЕсли;
			СтрокаАктивы.ДатаПогашения		= СтрокаЗадолженности.ДатаПогашения;
		Иначе
			СтрокаАктивы.ВидАктива 			= СтрокаЗадолженности.ВидАктива;
			СтрокаАктивы.ДатаПогашения 		= СтрокаЗадолженности.Период;
			СтрокаАктивы.ЭтоДенежныйПоток 	= СтрокаЗадолженности.ЭтоДенежныйПоток;
		КонецЕсли;
		
		СтрокаАктивы.Номинал				= СтрокаЗадолженности.Сумма;
		СтрокаАктивы.Актив					= СтрокаЗадолженности.ОснованиеЗадолженности;
		СтрокаАктивы.Валюта					= СтрокаЗадолженности.Валюта;
		СтрокаАктивы.ДатаРегистрации  		= СтрокаЗадолженности.ДатаРегистрации;     
				
		Если СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность
			И (СтрокаЗадолженности.ОснованиеЗадолженности = Продажа_РПИ_160522_132387 Или СтрокаЗадолженности.ОснованиеЗадолженности = Продажа_РПИ_270624_18_2) 
			ИЛИ (СтрокаЗадолженности.ОснованиеЗадолженности = ПроцентыПоЗайму_РПИ_011024_5_1 И Период >= Дата(2024, 11, 14))
			ИЛИ (СтрокаЗадолженности.ОснованиеЗадолженности = ПроцентыПоЗайму_РПИ_090125_5_1 И Период >= Дата(2025, 01, 23))
 		Тогда
					
			//#468527. хардкод пока не реализовано #386115
			//С 31 января 2023г учесть перенос даты погашения на следующий рабочий день
			Если СтрокаЗадолженности.ОснованиеЗадолженности = Продажа_РПИ_160522_132387 
				И Период >= Дата(2023,1,31) 
				И СтрокаАктивы.ДатаПогашения = Дата(2025,11,16) Тогда
				СтрокаАктивы.ДатаПогашения = Дата(2025,11,17);
			КонецЕсли; 
						
			АктивыДляРасчетаПроцентов = Новый Массив;	
			АктивыДляРасчетаПроцентов.Добавить(СтрокаЗадолженности.ОснованиеЗадолженности);
			
			ТаблицаРезультат = РассчитатьПроцентыПоЗадолженностям(СчетДоверительногоУправления, АктивыДляРасчетаПроцентов, Период, Истина);
			
			
			Если ЗаймГеоресурсЗадолженностьПоПроцентам Тогда 
				СтрокаАктивы.СуммаРезерва = -ТаблицаРезультат.Итог("Проценты");	
			Иначе 	  
				СтрокаАктивы.Проценты = ТаблицаРезультат.Итог("Проценты");    
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;   
	
	Если НЕ ЗаймГеоресурсЗадолженностьПоПроцентам Тогда 
		ПолучитьСтоимостьАктивовПоРыночнойСтавке(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ); 
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоРазбитыйНаПотокиАктив Тогда
		ТаблицаЗадолженностей.Свернуть("ВидАктива,ОснованиеЗадолженности,Валюта,ДатаРегистрации","Сумма");
		ТаблицаЗадолженностей.Колонки.Добавить("ПроцентыЭСП", Новый ОписаниеТипов("Число"));
		ТаблицаЗадолженностей.Колонки.Добавить("СуммаРезерва", Новый ОписаниеТипов("Число"));
	КонецЕсли;	
	
	ТаблицаЗадолженностей.Колонки.Добавить("АдресРасшифровкиДенежныхПотоков");
	
	Для Каждого СтрокаАктивы Из Активы Цикл
		Если Не ЭтоРазбитыйНаПотокиАктив Тогда
			ПараметрыПоиска = Новый Структура("ТипЗадолженности, ОснованиеЗадолженности", 
				?(СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность, Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская), 
				СтрокаАктивы.Актив);
		Иначе
			ПараметрыПоиска = Новый Структура("ВидАктива, ОснованиеЗадолженности", 
				СтрокаАктивы.ВидАктива, 
				СтрокаАктивы.Актив);
		КонецЕсли;
		НайденныеСтроки = ТаблицаЗадолженностей.НайтиСтроки(ПараметрыПоиска);

		Для Каждого СтрокаЗадолженности Из НайденныеСтроки Цикл
			
			//#техдолг: Нет разделения по виду задолженности, поэтому соответствие ищем по исходной сумме.
			Если ТипЗнч(СтрокаЗадолженности.ОснованиеЗадолженности) = Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента") 
				И (СтрокаЗадолженности.Сумма <> СтрокаАктивы.Номинал) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаЗадолженности.ОснованиеЗадолженности = Продажа_РПИ_160522_132387 
				Или СтрокаЗадолженности.ОснованиеЗадолженности = Продажа_РПИ_270624_18_2 Тогда
				СтрокаЗадолженности.ПроцентыЭСП = СтрокаАктивы.Проценты + СтрокаАктивы.ПроцентыЭСП;
			ИначеЕсли СтрокаАктивы.Проценты <> 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При расчете задолженности для основания " + СтрокаАктивы.Актив + " по рыночной ставке обнаружены проценты",,,,Отказ);
				Возврат;
			Иначе
				СтрокаЗадолженности.ПроцентыЭСП = СтрокаАктивы.ПроцентыЭСП;
			КонецЕсли;
			
			СтрокаЗадолженности.СуммаРезерва = СтрокаАктивы.СуммаРезерва;
			СтрокаЗадолженности.АдресРасшифровкиДенежныхПотоков = СтрокаАктивы.АдресРасшифровкиДенежныхПотоков;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьСтоимостьМНОПоРыночнойСтавке(ТаблицаМНО, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь) Экспорт
	
	Активы = ПолучитьТаблицуАктивов();
	
	Для Каждого СтрокаМНО Из ТаблицаМНО Цикл
		СтрокаАктивы = Активы.Добавить();
		СтрокаАктивы.Актив		= СтрокаМНО.МНО;
		СтрокаАктивы.ВидАктива	= Перечисления.ВидыАктивовДляПроверкиНаРыночность.МНО;
		СтрокаАктивы.Номинал	= СтрокаМНО.СуммаМНО;
		СтрокаАктивы.Проценты	= СтрокаМНО.ПроцентыМНО;
	КонецЦикла;
	
	ПолучитьСтоимостьАктивовПоРыночнойСтавке(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц, Отказ);
	
	Для Каждого СтрокаАктивы Из Активы Цикл
		СтрокаМНО = ТаблицаМНО.Найти(СтрокаАктивы.Актив, "МНО");
		Если СтрокаМНО <> Неопределено Тогда
			СтрокаМНО.ПроцентыМНО = СтрокаАктивы.Проценты + СтрокаАктивы.ПроцентыЭСП;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьНастройкиПроверкиНаРыночность(СчетДоверительногоУправления, Период, ЦельРасчета, МассивВидовАктивов, МассивАктивов = Неопределено) Экспорт
	
	Если МассивАктивов = Неопределено Тогда
		МассивАктивов = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период"						, Период);
	Запрос.УстановитьПараметр("Организация"					, СчетДоверительногоУправления.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦельРасчета"					, ЦельРасчета);
	Запрос.УстановитьПараметр("МассивВидовАктивов"			, МассивВидовАктивов);
	Запрос.УстановитьПараметр("МассивАктивов"				, МассивАктивов);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СчетДоверительногоУправления КАК Субъект
		|ПОМЕСТИТЬ _Субъекты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|ИЗ
		|	РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов КАК НастройкиРасчетаРыночнойСтавкиПоВидамАктивов
		|ГДЕ
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект В(&МассивАктивов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиЦелейРасчетаСрезПоследних.ВариантРасчетаОценочнойСтоимости
		|ИЗ
		|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЦельРасчета = &ЦельРасчета
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиЦелейРасчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовСрезПоследних.СхемаПроверкиСущественностиОтклонений КАК СхемаПроверкиСущественностиОтклонений
		|ИЗ
		|	РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЦельРасчета = &ЦельРасчета
		|				И ВидАктива В (&МассивВидовАктивов)
		|				И Субъект В
		|					(ВЫБРАТЬ
		|						_Субъекты.Субъект КАК Субъект
		|					ИЗ
		|						_Субъекты КАК _Субъекты)) КАК НастройкиРасчетаРыночнойСтавкиПоВидамАктивовСрезПоследних
		|ГДЕ
		|	НЕ(НастройкиРасчетаРыночнойСтавкиПоВидамАктивовСрезПоследних.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять)
		|				И НастройкиРасчетаРыночнойСтавкиПоВидамАктивовСрезПоследних.МаксимальныйСрокАктиваДляИспользованияСхемы = 0)";
#КонецОбласти
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СтоимостьПоРыночнойСтавке

//Получаем настройку определения ставки для каждого потока. Пока хардкодом, в регистр НастройкиРасчетаРыночнойСтавкиПоВидамАктивов не добавляли.
Функция ПолучитьВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток(СчетДоверительногоУправления, Период)
	
	ТекОрганизация = СчетДоверительногоУправления.Организация;
	
	//Актуально только для займов РПИ
	Если Период >= Дата(2021,7,1) 
		И ТекОрганизация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		
		ОтдельныеСтавкиПоПотокам = Новый ТаблицаЗначений();
		ОтдельныеСтавкиПоПотокам.Колонки.Добавить("СчетДоверительногоУправления");
		ОтдельныеСтавкиПоПотокам.Колонки.Добавить("ВидАктива");
		ОтдельныеСтавкиПоПотокам.Колонки.Добавить("ВидКонтрагента");
		ОтдельныеСтавкиПоПотокам.Колонки.Добавить("Валюта");
		
		СтрокаОтдельныеСтавкиПоПотокам = ОтдельныеСтавкиПоПотокам.Добавить();
		СтрокаОтдельныеСтавкиПоПотокам.СчетДоверительногоУправления = СчетДоверительногоУправления;
		СтрокаОтдельныеСтавкиПоПотокам.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные;
		СтрокаОтдельныеСтавкиПоПотокам.ВидКонтрагента = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо;
		СтрокаОтдельныеСтавкиПоПотокам.Валюта = ТекОрганизация.ВалютаУчета;
		
		СтрокаОтдельныеСтавкиПоПотокам = ОтдельныеСтавкиПоПотокам.Добавить();
		СтрокаОтдельныеСтавкиПоПотокам.СчетДоверительногоУправления = СчетДоверительногоУправления;
		СтрокаОтдельныеСтавкиПоПотокам.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные;
		СтрокаОтдельныеСтавкиПоПотокам.ВидКонтрагента = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо;
		СтрокаОтдельныеСтавкиПоПотокам.Валюта = ТекОрганизация.ВалютаУчета;
		
		СтрокаОтдельныеСтавкиПоПотокам = ОтдельныеСтавкиПоПотокам.Добавить();
		СтрокаОтдельныеСтавкиПоПотокам.СчетДоверительногоУправления = СчетДоверительногоУправления;
		СтрокаОтдельныеСтавкиПоПотокам.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность;
		СтрокаОтдельныеСтавкиПоПотокам.ВидКонтрагента = Неопределено;
		СтрокаОтдельныеСтавкиПоПотокам.Валюта = ТекОрганизация.ВалютаУчета;
		
		СтрокаОтдельныеСтавкиПоПотокам = ОтдельныеСтавкиПоПотокам.Добавить();
		СтрокаОтдельныеСтавкиПоПотокам.СчетДоверительногоУправления = СчетДоверительногоУправления;
		СтрокаОтдельныеСтавкиПоПотокам.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность;
		СтрокаОтдельныеСтавкиПоПотокам.ВидКонтрагента = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо;
		СтрокаОтдельныеСтавкиПоПотокам.Валюта = ТекОрганизация.ВалютаУчета;
		
		Возврат ОтдельныеСтавкиПоПотокам;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НужныОтдельныеСтавкиПоПотокам(СчетДоверительногоУправления, Актив, ВидАктива, ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток) Экспорт
	
	//хардкод! Для остальных видов активов пока не надо
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда	
		
		ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(Актив); 
		ВидКонтрагента = ДанныеКредитногоИнструмента.Контрагент.ВидЮрФизЛица;
		ВалютаАктива = Актив.Валюта;
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		
		Если ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность Тогда
			ВидКонтрагента = Неопределено;
		Иначе
			ВидКонтрагента = Актив.Контрагент.ВидЮрФизЛица;
		КонецЕсли;	
		ВалютаАктива = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
		
	ИначеЕсли Справочники.Договоры.ЭтоИнвестконтракт(Актив) Тогда
		
		Если ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность Тогда
			ВидКонтрагента = Неопределено;
		Иначе
			ВидКонтрагента = Актив.Контрагент.ВидЮрФизЛица;
		КонецЕсли;	
		ВалютаАктива = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	СтрокиПоВидуАктива = ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток.НайтиСтроки(Новый Структура("ВидАктива, СчетДоверительногоУправления, ВидКонтрагента, Валюта", 
		ВидАктива, СчетДоверительногоУправления, ВидКонтрагента, ВалютаАктива));
	
	Если СтрокиПоВидуАктива.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ДатыИзмененияПравилСЧА(СчетДоверительногоУправления, Период)
	
	ТаблицаДополнительныхДат = Новый ТаблицаЗначений;
	ТаблицаДополнительныхДат.Колонки.Добавить("ВидАктива", 		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыАктивовДляПроверкиНаРыночность"));
	ТаблицаДополнительныхДат.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"));
	ТаблицаДополнительныхДат.Колонки.Добавить("КодСобытия",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	ТаблицаДополнительныхДат.Колонки.Добавить("ОписаниеСобытия",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	
	Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
	
		Если СчетДоверительногоУправления.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ")
			ИЛИ СчетДоверительногоУправления.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ")
			ИЛИ СчетДоверительногоУправления.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ")
		Тогда	
		
		    // #381040: добавлены даты проверки рыночности ставки дисконтирования в связи с изменением правил определения СЧА в части изменения вида рыночной ставки
		
			ДополнительнаяДата = ТаблицаДополнительныхДат.Добавить();
			ДополнительнаяДата.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные;
			ДополнительнаяДата.Дата 			= Дата(2021,7,1);
			ДополнительнаяДата.КодСобытия		= 0;
			ДополнительнаяДата.ОписаниеСобытия	= "Изменение правил";
			
			ДополнительнаяДата = ТаблицаДополнительныхДат.Добавить();
			ДополнительнаяДата.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО;
			ДополнительнаяДата.Дата				= Дата(2021,7,1);
			ДополнительнаяДата.КодСобытия		= 0;
			ДополнительнаяДата.ОписаниеСобытия	= "Изменение правил";
			
		КонецЕсли;
		
		Если СчетДоверительногоУправления.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ")
			И (СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ЗПИФИскра") 
				ИЛИ СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_ЗПИФФаренгейт")) 
		Тогда
		
			ДополнительнаяДата = ТаблицаДополнительныхДат.Добавить();
			ДополнительнаяДата.ВидАктива		= Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность;
			ДополнительнаяДата.Дата 			= Дата(2024,2,7);
			ДополнительнаяДата.КодСобытия		= 0;
			ДополнительнаяДата.ОписаниеСобытия	= "Изменение правил";
		
		КонецЕсли;
			
	КонецЕсли;
	
	Если ТаблицаДополнительныхДат.Количество() > 0 Тогда
		
		// Если есть строки, свернём таблицу, оставим только последние даты перед &Период
		// Также на эту дату вычислим описание события с минимальны кодом (ниже код -выше приоритет) - нужно для расшифровки
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТаблицаДополнительныхДат", ТаблицаДополнительныхДат);
		Запрос.УстановитьПараметр("Период"					, Период);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДополнительныхДат.ВидАктива КАК ВидАктива,
			|	ТаблицаДополнительныхДат.Дата КАК Дата,
			|	ТаблицаДополнительныхДат.КодСобытия КАК КодСобытия,
			|	ТаблицаДополнительныхДат.ОписаниеСобытия КАК ОписаниеСобытия
			|ПОМЕСТИТЬ _ТаблицаДополнительныхДат
			|ИЗ
			|	&ТаблицаДополнительныхДат КАК ТаблицаДополнительныхДат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВложенныйЗапрос.ВидАктива КАК ВидАктива,
			|	ВложенныйЗапрос.Дата КАК Дата,
			|	ВложенныйЗапрос.КодСобытия КАК КодСобытия,
			|	_ТаблицаДополнительныхДат.ОписаниеСобытия КАК ОписаниеСобытия
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложенныйЗапрос.ВидАктива КАК ВидАктива,
			|		ВложенныйЗапрос.Дата КАК Дата,
			|		МИНИМУМ(_ТаблицаДополнительныхДат.КодСобытия) КАК КодСобытия
			|	ИЗ
			|		(ВЫБРАТЬ
			|			_ТаблицаДополнительныхДат.ВидАктива КАК ВидАктива,
			|			МАКСИМУМ(_ТаблицаДополнительныхДат.Дата) КАК Дата
			|		ИЗ
			|			_ТаблицаДополнительныхДат КАК _ТаблицаДополнительныхДат
			|		ГДЕ
			|			_ТаблицаДополнительныхДат.Дата <= &Период
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ТаблицаДополнительныхДат.ВидАктива) КАК ВложенныйЗапрос
			|			ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДополнительныхДат КАК _ТаблицаДополнительныхДат
			|			ПО ВложенныйЗапрос.ВидАктива = _ТаблицаДополнительныхДат.ВидАктива
			|				И ВложенныйЗапрос.Дата = _ТаблицаДополнительныхДат.Дата
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложенныйЗапрос.ВидАктива,
			|		ВложенныйЗапрос.Дата) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаДополнительныхДат КАК _ТаблицаДополнительныхДат
			|		ПО ВложенныйЗапрос.ВидАктива = _ТаблицаДополнительныхДат.ВидАктива
			|			И ВложенныйЗапрос.Дата = _ТаблицаДополнительныхДат.Дата
			|			И ВложенныйЗапрос.КодСобытия = _ТаблицаДополнительныхДат.КодСобытия"; 
		
		ТаблицаДополнительныхДат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат ТаблицаДополнительныхДат;

КонецФункции

Функция ПолучитьСтоимостьАктивовПоРыночнойСтавке(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, МенеджерВременныхТаблиц = Неопределено, Отказ)
	
	ЭтоРасшифровка = (МенеджерВременныхТаблиц <> Неопределено И МенеджерВременныхТаблиц.Таблицы.Найти("_РасшифровкаСтоимостиАктивовПоРыночнойСтавке") <> Неопределено);

	Организация = СчетДоверительногоУправления.Организация;
	Клиент		= Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ЦельРасчета, Истина);
																
	#Область Получение_даты_определения_СЧА
																
	Если ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении 
		ИЛИ ЦельРасчета = Справочники.ЦелиРасчета.БухгалтерскийУчет
	Тогда
		
		ДатаОпределенияСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(СчетДоверительногоУправления, Период + 86400);
		
		Если НЕ ЗначениеЗаполнено(ДатаОпределенияСЧА) Тогда
			
			Если СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
				
				ДатаОкончанияФормированияПИФ = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ДатаОкончанияФормированияПИФ", Клиент);
				
				Если ДатаОкончанияФормированияПИФ = НачалоДня(Период) Тогда
					ДатаОпределенияСЧА = Период;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДатаОпределенияСЧА) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить дату официальной СЧА для счета ДУ: " + СчетДоверительногоУправления, , , , Отказ);
			КонецЕсли;
			
			// Возврат будет дальше, чтобы корректно возвращать таблицу активы
			
		КонецЕсли;
		
	Иначе
		ДатаОпределенияСЧА = Период;
	КонецЕсли;
	
	#КонецОбласти
	
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("Активы"						, Активы);
	Запрос.УстановитьПараметр("Период"						, Период);
	Запрос.УстановитьПараметр("ЦельРасчета"					, ЦельРасчета);
	
	Запрос.УстановитьПараметр("МетодикаЭволюции20200907"	, Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция")      
																И Период >= Дата(2020, 9, 7)
																И Период <= Дата(2020, 12, 1)
																И ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
																
	ДатаПереходаППАВРостех = '20240731';
 	ДляППАНаДатуРазмещенияАктиваИспользоватьНастройкиРостеха = (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ППА")
																Или Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Ростех"))
																И Период >= ДатаПереходаППАВРостех;
	
	Запрос.УстановитьПараметр("ДатаПереходаППАВРостех", 									ДатаПереходаППАВРостех);
	Запрос.УстановитьПараметр("ДляППАНаДатуРазмещенияАктиваИспользоватьНастройкиРостеха", 	ДляППАНаДатуРазмещенияАктиваИспользоватьНастройкиРостеха);

	Запрос.УстановитьПараметр("ВидыАктивовЗависимыеОтВидаКонтрагента",	  РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидыАктивовЗависимыеОтВидаКонтрагента());
	Запрос.УстановитьПараметр("ПроверкиТолькоПриПервоначальномПризнании", Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкиТолькоПриПервоначальномПризнании());
	
	Запрос.УстановитьПараметр("ТекущийДень",			ТекущийДень);
	Запрос.УстановитьПараметр("ПоследнийТорговыйДень",	Справочники.Календари.ДобавитьКДатеРабочиеДни(Константы.ОсновнойКалендарьКотировок.Получить(), ТекущийДень-1, -1));
	Запрос.УстановитьПараметр("ДатаОпределенияСЧА",		ДатаОпределенияСЧА);
	Запрос.УстановитьПараметр("ДатыИзмененияПравилСЧА",	ДатыИзмененияПравилСЧА(СчетДоверительногоУправления, Период));
	
	Запрос.УстановитьПараметр("ДляДолгосрочнойАрендыОпределятьРыночнуюСтавкуПоОкончаниюСрокаАренды", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") = Организация);

	#Область Инициализация_активов_и_контроль_настроек
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы0.Актив КАК Актив,
		|	_Активы0.ВидАктива КАК ВидАктива,
		|	_Активы0.ДатаРегистрации КАК ДатаРегистрации,
		|	_Активы0.ДатаПогашения КАК ДатаПогашения,
		|	_Активы0.ЭтоДенежныйПоток КАК ЭтоДенежныйПоток,
		|	_Активы0.Валюта КАК Валюта,
		|	_Активы0.Номинал КАК Номинал,
		|	_Активы0.Проценты КАК Проценты,
		|	_Активы0.ПроцентыЭСП КАК ПроцентыЭСП,
		|	_Активы0.Задолженность КАК Задолженность,
		|	_Активы0.Ставка КАК Ставка,
		|	_Активы0.Комиссия КАК Комиссия
		|ПОМЕСТИТЬ _Активы0
		|ИЗ
		|	&Активы КАК _Активы0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыИзмененияПравилСЧА.ВидАктива КАК ВидАктива,
		|	_ДатыИзмененияПравилСЧА.Дата КАК Дата,
		|	_ДатыИзмененияПравилСЧА.ОписаниеСобытия КАК ОписаниеСобытия
		|ПОМЕСТИТЬ _ДатыИзмененияПравилСЧА
		|ИЗ
		|	&ДатыИзмененияПравилСЧА КАК _ДатыИзмененияПравилСЧА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.Организация КАК Организация,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|	УсловияКредитныхИнструментовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _УсловияКредитныхИнструментовСрезПоследних
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ДатаНачалаДействияУсловий <= &Период
		|				И КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						_Активы0.Актив КАК Актив
		|					ИЗ
		|						_Активы0 КАК _Активы0)) КАК УсловияКредитныхИнструментовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|	МАКСИМУМ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК Период
		|ПОМЕСТИТЬ _ИзменениеУсловийКредитныхИнструментов
		|ИЗ
		|	(ВЫБРАТЬ
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|		УсловияКредитныхИнструментов.КредитныйИнструмент КАК КредитныйИнструмент,
		|		МАКСИМУМ(ПредыдущиеУсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ДатаНачалаПредыдущихУсловий,
		|		УсловияКредитныхИнструментов.УчетныйАктив КАК УчетныйАктив
		|	ИЗ
		|		_УсловияКредитныхИнструментовСрезПоследних КАК УсловияКредитныхИнструментов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментовСрезПоследних КАК ПредыдущиеУсловияКредитныхИнструментов
		|			ПО УсловияКредитныхИнструментов.КредитныйИнструмент = ПредыдущиеУсловияКредитныхИнструментов.КредитныйИнструмент
		|				И УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий > ПредыдущиеУсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий,
		|		УсловияКредитныхИнструментов.КредитныйИнструмент,
		|		УсловияКредитныхИнструментов.УчетныйАктив) КАК УсловияКредитныхИнструментов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _УсловияКредитныхИнструментовСрезПоследних КАК ПредыдущиеУсловияКредитныхИнструментов
		|		ПО УсловияКредитныхИнструментов.КредитныйИнструмент = ПредыдущиеУсловияКредитныхИнструментов.КредитныйИнструмент
		|			И УсловияКредитныхИнструментов.ДатаНачалаПредыдущихУсловий = ПредыдущиеУсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|ГДЕ
		|	УсловияКредитныхИнструментов.УчетныйАктив <> ПредыдущиеУсловияКредитныхИнструментов.УчетныйАктив
		|
		|СГРУППИРОВАТЬ ПО
		|	УсловияКредитныхИнструментов.КредитныйИнструмент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Период КАК Период,
		|	УсловияКредитныхИнструментовСрезПоследних.Организация КАК Организация,
		|	УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК Актив,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	УсловияКредитныхИнструментовСрезПоследних.Действует КАК Действует
		|ПОМЕСТИТЬ _СрезПоследнихНаТекущуюДату
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Период,
		|			ДатаНачалаДействияУсловий <= &Период
		|				И КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) В (ТИП(Справочник.Займы), ТИП(Справочник.ДепозитныеВклады))
		|								ТОГДА _Активы0.Актив
		|							КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
		|								ТОГДА ВЫРАЗИТЬ(_Активы0.Актив КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|						КОНЕЦ КАК Актив
		|					ИЗ
		|						_Активы0 КАК _Активы0
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_Активы0.Актив) В (ТИП(Справочник.ДепозитныеВклады), ТИП(Справочник.Займы), ТИП(Документ.ЗакрытиеКредитногоИнструмента)))) КАК УсловияКредитныхИнструментовСрезПоследних
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СрезПоследнихНаТекущуюДату.Актив КАК Актив,
		|	МАКСИМУМ(_СрезПоследнихНаТекущуюДату.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|ПОМЕСТИТЬ _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату
		|ИЗ
		|	_СрезПоследнихНаТекущуюДату КАК _СрезПоследнихНаТекущуюДату
		|
		|СГРУППИРОВАТЬ ПО
		|	_СрезПоследнихНаТекущуюДату.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы0.Актив КАК Актив,
		|	_Активы0.Номинал КАК Номинал,
		|	_Активы0.Проценты КАК Проценты,
		|	_Активы0.ПроцентыЭСП КАК ПроцентыЭСП,
		|	_Активы0.Задолженность КАК Задолженность,
		|	_Активы0.Комиссия КАК Комиссия,
		|	_Активы0.ЭтоДенежныйПоток КАК ЭтоДенежныйПоток,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ЕСТЬNULL(_ИзменениеУсловийКредитныхИнструментов.Период, ДепозитныеВклады.ДатаРегистрации)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.Займы)
		|			ТОГДА НоминалыЗаймовСрезПервых.Период
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СделкаРЕПОДок.Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.МНО)
		|			ТОГДА ДокументМНО.Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаСНедвижимостью)
		|			ТОГДА ВЫРАЗИТЬ(_Активы0.Актив КАК Документ.СделкаСНедвижимостью).Дата
		|		ИНАЧЕ _Активы0.ДатаРегистрации
		|	КОНЕЦ КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ДепозитныеВклады.ДатаРегистрации = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.МНО)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДокументМНО.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПервоначальноеПризнаниеДепозитаИлиМНО,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.МНО)
		|			ТОГДА ДокументМНО.ДатаВозврата
		|		ИНАЧЕ _Активы0.ДатаПогашения
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ДепозитныеВклады.БанковскийСчет.Валюта
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.Займы)
		|			ТОГДА Займы.Валюта
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СделкаРЕПОДок.ВалютаСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.МНО)
		|			ТОГДА ДокументМНО.РасчетныйСчет.Валюта
		|		ИНАЧЕ _Активы0.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ВЫБОР
		|		КОГДА _Активы0.Ставка <> 0
		|			ТОГДА _Активы0.Ставка
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.МНО)
		|			ТОГДА ДокументМНО.Процент
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.Оплата)
		|				И _Активы0.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|			ТОГДА 0
		|	КОНЕЦ КАК СтавкаПоДоговору,
		|	_Активы0.ВидАктива КАК ВидАктива,
		|	ВЫБОР
		|		КОГДА НЕ _Активы0.ВидАктива В (&ВидыАктивовЗависимыеОтВидаКонтрагента)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.)
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.Займы)
		|			ТОГДА УсловияКредитныхИнструментовСрезПоследних.Контрагент.ВидЮрФизЛица
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|						ТОГДА УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Контрагент.ВидЮрФизЛица
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.НачислениеЗадолженности)
		|			ТОГДА ВЫБОР
		|					КОГДА НачислениеЗадолженности.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|						ТОГДА НачислениеЗадолженности.Контрагент.ВидЮрФизЛица
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.Сделка)
		|			ТОГДА ВЫБОР
		|					КОГДА Сделка.Контрагент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.)
		|						ТОГДА Сделка.Контрагент.ВидЮрФизЛица
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
		|			ТОГДА УсловияКредитныхИнструментовСрезПоследних.Контрагент.ВидЮрФизЛица
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаСНедвижимостью)
		|			ТОГДА СделкаСНедвижимостью.Контрагент.ВидЮрФизЛица
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.Договоры)
		|			ТОГДА Договоры.Контрагент.ВидЮрФизЛица
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.ПриходПроцентовПоКредитномуИнструменту)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.)
		|	КОНЕЦ КАК ВидКонтрагента,
		|	ВЫБОР
		|		КОГДА УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ТОГДА NULL
		|		КОГДА УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА NULL
		|		ИНАЧЕ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения
		|	КОНЕЦ КАК СрокОкончанияДолгосрочногоДоговораАренды,
		|	ЕСТЬNULL(ДепозитныеВклады.ПроцентнаяСтавкаПриДосрочномЗакрытии, 0) КАК ПроцентнаяСтавкаПриДосрочномЗакрытии
		|ПОМЕСТИТЬ _Активы
		|ИЗ
		|	_Активы0 КАК _Активы0
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО _Активы0.Актив = ДепозитныеВклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОДок
		|		ПО _Активы0.Актив = СделкаРЕПОДок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				(СделкаРЕПО, ЧастьСделкиРЕПО) В
		|					(ВЫБРАТЬ
		|						_Активы0.Актив КАК Актив,
		|						2
		|					ИЗ
		|						_Активы0 КАК _Активы0
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.СделкаРЕПО))) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО (СделкаРЕПОДок.Ссылка = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _Активы0.Актив = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО _Активы0.Актив = НачислениеЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
		|		ПО _Активы0.Актив = ДокументМНО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО _Активы0.Актив = СделкаСНедвижимостью.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО (_Активы0.Актив = Займы.Ссылка
		|				ИЛИ ВЫРАЗИТЬ(_Активы0.Актив КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент = Займы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПервых(
		|				,
		|				КредитныйИнструмент В
		|					(ВЫБРАТЬ
		|						ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Справочник.Займы)
		|								ТОГДА _Активы0.Актив
		|							КОГДА ТИПЗНАЧЕНИЯ(_Активы0.Актив) = ТИП(Документ.ЗакрытиеКредитногоИнструмента)
		|								ТОГДА ВЫРАЗИТЬ(_Активы0.Актив КАК Документ.ЗакрытиеКредитногоИнструмента).КредитныйИнструмент
		|						КОНЕЦ КАК Актив
		|					ИЗ
		|						_Активы0 КАК _Активы0
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_Активы0.Актив) В (ТИП(Справочник.Займы), ТИП(Документ.ЗакрытиеКредитногоИнструмента)))) КАК НоминалыЗаймовСрезПервых
		|		ПО (Займы.Ссылка = НоминалыЗаймовСрезПервых.КредитныйИнструмент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|				&Период,
		|				(КредитныйИнструмент, ДатаНачалаДействияУсловий) В
		|					(ВЫБРАТЬ
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.Актив КАК Актив,
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий
		|					ИЗ
		|						_ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату КАК _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.Актив) = ТИП(Справочник.Займы))) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО (Займы.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИзменениеУсловийКредитныхИнструментов КАК _ИзменениеУсловийКредитныхИнструментов
		|		ПО _Активы0.Актив = _ИзменениеУсловийКредитныхИнструментов.КредитныйИнструмент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(
		|				&Период,
		|				(Организация, Договор) В
		|					(ВЫБРАТЬ
		|						СделкаСНедвижимостью.Организация КАК Организация,
		|						СделкаСНедвижимостью.Договор КАК Договор
		|					ИЗ
		|						_Активы0 КАК _Активы0
		|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|							ПО
		|								_Активы0.Актив = СделкаСНедвижимостью.Ссылка
		|					ГДЕ
		|						_Активы0.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|						И СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						И СделкаСНедвижимостью.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда))) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_Активы0.Актив КАК Документ.СделкаСНедвижимостью).Договор = УсловияДоговоровОбщиеСрезПоследних.Договор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|		ПО _Активы0.Актив = Договоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодНастроек.Актив КАК Актив,
		|	НастройкиЦелейРасчета.ВариантРасчетаОценочнойСтоимости КАК НаДатуРазмещения,
		|	НастройкиЦелейРасчетаСрезПоследних.ВариантРасчетаОценочнойСтоимости КАК НаДатуРасчета
		|ПОМЕСТИТЬ _ВариантыРасчетаОценочнойСтоимости
		|ИЗ
		|	(ВЫБРАТЬ
		|		_Активы.Актив КАК Актив,
		|		МАКСИМУМ(НастройкиЦелейРасчета.Период) КАК Период
		|	ИЗ
		|		_Активы КАК _Активы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
		|			ПО (НастройкиЦелейРасчета.Организация = &Организация)
		|				И (НастройкиЦелейРасчета.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|				И (НастройкиЦелейРасчета.ЦельРасчета = &ЦельРасчета)
		|				И (НастройкиЦелейРасчета.Период <= _Активы.ДатаРегистрации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_Активы.Актив) КАК ПериодНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
		|		ПО (НастройкиЦелейРасчета.Организация = &Организация)
		|			И (НастройкиЦелейРасчета.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (НастройкиЦелейРасчета.ЦельРасчета = &ЦельРасчета)
		|			И (НастройкиЦелейРасчета.Период = ПериодНастроек.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦельРасчета = &ЦельРасчета) КАК НастройкиЦелейРасчетаСрезПоследних
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Активы.Актив КАК Актив,
		|	_Активы.ВидАктива КАК ВидАктива
		|ПОМЕСТИТЬ _КонтольДатыРегистрацииПотоков
		|ИЗ
		|	_Активы КАК _Активы
		|
		|СГРУППИРОВАТЬ ПО
		|	_Активы.Актив,
		|	_Активы.ВидАктива
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Активы.ДатаРегистрации) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Активы.Актив КАК Актив,
		|	_Активы.ДатаРегистрации КАК ДатаРегистрации,
		|	_Активы.ВидАктива КАК ВидАктива,
		|	_Активы.ВидКонтрагента КАК ВидКонтрагента,
		|	_Активы.Валюта КАК Валюта,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период КАК Период,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект КАК Субъект,
		|	ВЫБОР ТИПЗНАЧЕНИЯ(НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект)
		|		КОГДА ТИП(Справочник.ВариантыРасчетаОценочнойСтоимости)
		|			ТОГДА ""Методика""
		|		КОГДА ТИП(Справочник.ЮрФизЛица)
		|			ТОГДА ""Клиент""
		|		КОГДА ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА ""СчетДУ""
		|		ИНАЧЕ ""Актив""
		|	КОНЕЦ КАК ВидСубъекта,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СхемаПроверкиСущественностиОтклонений КАК Схема,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПериодичностьОпределенияРыночнойСтавки КАК ПериодичностьОпределенияРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользоватьНастройкиНаДатуРазмещенияАктива КАК ИспользоватьНастройкиНаДатуРазмещенияАктива
		|ПОМЕСТИТЬ _ВсеНастройкиАктива
		|ИЗ
		|	_Активы КАК _Активы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРасчетаОценочнойСтоимости КАК _ВариантыРасчетаОценочнойСтоимости
		|		ПО _Активы.Актив = _ВариантыРасчетаОценочнойСтоимости.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов КАК НастройкиРасчетаРыночнойСтавкиПоВидамАктивов
		|		ПО (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период <= &Период)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Организация = &Организация)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ЦельРасчета = &ЦельРасчета)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидАктива = _Активы.ВидАктива)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидКонтрагента = _Активы.ВидКонтрагента)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Валюта = _Активы.Валюта)
		|			И (_Активы.Актив = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				ИЛИ &СчетДоверительногоУправления = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.Клиент = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				ИЛИ _ВариантыРасчетаОценочнойСтоимости.НаДатуРасчета = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				ИЛИ _ВариантыРасчетаОценочнойСтоимости.НаДатуРазмещения = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктивыССубъектами.Актив КАК Актив,
		|	АктивыССубъектами.ВидАктива КАК ВидАктива,
		|	АктивыССубъектами.ВидКонтрагента КАК ВидКонтрагента,
		|	АктивыССубъектами.Валюта КАК Валюта,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидСредневзвешеннойРыночнойСтавки КАК ВидСредневзвешеннойРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект КАК Субъект,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ГруппаБанков КАК ГруппаБанков,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантРасчетаСрокаДляОтбораРыночнойСтавки КАК ВариантРасчетаСрокаДляОтбораРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантРасчетаСрокаДляПримененияРыночнойСтавки КАК ВариантРасчетаСрокаДляПримененияРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидШкалы КАК ВидШкалы,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИгнорироватьИзменениеКлючевойСтавки КАК ИгнорироватьИзменениеКлючевойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантПолученияДатыКлючевойСтавки КАК ВариантПолученияДатыКлючевойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантыРасчетаРыночнойСтавки КАК ВариантыРасчетаРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки КАК ПроцентСущественностиОтклоненияОтРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения КАК ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидСтавкиДляПроверкиНаРыночность КАК ВидСтавкиДляПроверкиНаРыночность,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидСтавкиДляРасчетаДисконтированногоПотока КАК ВидСтавкиДляРасчетаДисконтированногоПотока,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ТочностьЭСП КАК ТочностьЭСП,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ТочностьРыночнойСтавки КАК ТочностьРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ТочностьГраницДиапазонаРыночнойСтавки КАК ТочностьГраницДиапазонаРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПроцентСущественностиВПроцентныхПунктах КАК ПроцентСущественностиВПроцентныхПунктах,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПериодичностьОпределенияРыночнойСтавки КАК ПериодичностьОпределенияРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИсточникТаблицыСоответствияРейтингов КАК ИсточникТаблицыСоответствияРейтингов,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ОтклонениеКредитногоСпреда КАК ОтклонениеКредитногоСпреда,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантОтклоненияОтРыночнойСтавки КАК ВариантОтклоненияОтРыночнойСтавки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВариантРасчетаКоэффициентаВолатильности КАК ВариантРасчетаКоэффициентаВолатильности,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета КАК МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.МаксимальныйСрокАктиваДляИспользованияСхемы КАК МаксимальныйСрокАктиваДляИспользованияСхемы,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СхемаПроверкиСущественностиОтклонений КАК СхемаПроверкиСущественностиОтклонений,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП КАК ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПроверкаНаРыночностьПоПеречнюЦБ580П КАК ПроверкаНаРыночностьПоПеречнюЦБ580П,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПериодНаблюдаемыхПроцентныхСтавок КАК ПериодНаблюдаемыхПроцентныхСтавок,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.СмещениеСтандартногоОтклонения КАК СмещениеСтандартногоОтклонения,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ВидСтавкиДляРасчетаДисконтированногоПотока КАК ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ТочностьЭСП КАК ТочностьЭСПНаДатуРасчета,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.НеПоказыватьОтрицательныеПроценты КАК НеПоказыватьОтрицательныеПроценты,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ПериодичностьОценки КАК ПериодичностьОценки,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ПериодичностьРасчетаКорректировкиЭСП КАК ПериодичностьРасчетаКорректировкиЭСП,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ИспользоватьНастройкиНаДатуРазмещенияАктива КАК ИспользоватьНастройкиНаДатуРазмещенияАктива,
		|	НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.РассчитыватьЛинейноНерыночныеАктивы КАК РассчитыватьЛинейноНерыночныеАктивы
		|ПОМЕСТИТЬ _НастройкиАктивов
		|ИЗ
		|	(ВЫБРАТЬ
		|		АктивыПоВидамСубъектов.Актив КАК Актив,
		|		АктивыПоВидамСубъектов.ВидАктива КАК ВидАктива,
		|		АктивыПоВидамСубъектов.ВидКонтрагента КАК ВидКонтрагента,
		|		АктивыПоВидамСубъектов.Валюта КАК Валюта,
		|		ВЫБОР
		|			КОГДА НастройкиАктива.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктива.Период
		|			КОГДА НастройкиСчетаДУ.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУ.Период
		|			КОГДА НастройкиКлиента.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиента.Период
		|			КОГДА НастройкиМетодики.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодики.Период
		|		КОНЕЦ КАК ПериодНастройки,
		|		ВЫБОР
		|			КОГДА НастройкиАктива.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктива.Субъект
		|			КОГДА НастройкиСчетаДУ.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУ.Субъект
		|			КОГДА НастройкиКлиента.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиента.Субъект
		|			КОГДА НастройкиМетодики.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодики.Субъект
		|		КОНЕЦ КАК СубъектНастройки,
		|		ВЫБОР
		|			КОГДА НастройкиАктиваНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктиваНаДатуРазмещения.Период
		|			КОГДА НастройкиСчетаДУНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУНаДатуРазмещения.Период
		|			КОГДА НастройкиКлиентаНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиентаНаДатуРазмещения.Период
		|			КОГДА НастройкиМетодикиНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодикиНаДатуРазмещения.Период
		|		КОНЕЦ КАК ПериодНастройкиНаДатуРазмещения,
		|		ВЫБОР
		|			КОГДА НастройкиАктиваНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктиваНаДатуРазмещения.Субъект
		|			КОГДА НастройкиСчетаДУНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУНаДатуРазмещения.Субъект
		|			КОГДА НастройкиКлиентаНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиентаНаДатуРазмещения.Субъект
		|			КОГДА НастройкиМетодикиНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодикиНаДатуРазмещения.Субъект
		|		КОНЕЦ КАК СубъектНастройкиНаДатуРазмещения,
		|		ВЫБОР
		|			КОГДА НастройкиАктиваНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктиваНаДатуРазмещения.ПериодичностьОпределенияРыночнойСтавки
		|			КОГДА НастройкиСчетаДУНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУНаДатуРазмещения.ПериодичностьОпределенияРыночнойСтавки
		|			КОГДА НастройкиКлиентаНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиентаНаДатуРазмещения.ПериодичностьОпределенияРыночнойСтавки
		|			КОГДА НастройкиМетодикиНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодикиНаДатуРазмещения.ПериодичностьОпределенияРыночнойСтавки
		|		КОНЕЦ КАК ПериодичностьОпределенияРыночнойСтавкиНаДатуРазмещения,
		|		ВЫБОР
		|			КОГДА НастройкиАктиваНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктиваНаДатуРазмещения.Схема
		|			КОГДА НастройкиСчетаДУНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУНаДатуРазмещения.Схема
		|			КОГДА НастройкиКлиентаНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиентаНаДатуРазмещения.Схема
		|			КОГДА НастройкиМетодикиНаДатуРазмещения.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодикиНаДатуРазмещения.Схема
		|		КОНЕЦ КАК СхемаНаДатуРазмещения,
		|		ВЫБОР
		|			КОГДА НастройкиАктива.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиАктива.ИспользоватьНастройкиНаДатуРазмещенияАктива
		|			КОГДА НастройкиСчетаДУ.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиСчетаДУ.ИспользоватьНастройкиНаДатуРазмещенияАктива
		|			КОГДА НастройкиКлиента.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиКлиента.ИспользоватьНастройкиНаДатуРазмещенияАктива
		|			КОГДА НастройкиМетодики.Схема <> ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие)
		|				ТОГДА НастройкиМетодики.ИспользоватьНастройкиНаДатуРазмещенияАктива
		|		КОНЕЦ КАК ИспользоватьНастройкиНаДатуРазмещенияАктива
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			_Активы.ВидАктива КАК ВидАктива,
		|			_Активы.ВидКонтрагента КАК ВидКонтрагента,
		|			_Активы.Валюта КАК Валюта,
		|			МАКСИМУМ(НастройкиАктива.Период) КАК ПериодНастройкиАктива,
		|			МАКСИМУМ(НастройкиАктива.Субъект) КАК СубъектНастройкиАктива,
		|			МАКСИМУМ(НастройкиСчетаДУ.Период) КАК ПериодНастройкиСчета,
		|			МАКСИМУМ(НастройкиСчетаДУ.Субъект) КАК СубъектНастройкиСчета,
		|			МАКСИМУМ(НастройкиКлиента.Период) КАК ПериодНастройкиКлиента,
		|			МАКСИМУМ(НастройкиКлиента.Субъект) КАК СубъектНастройкиКлиента,
		|			МАКСИМУМ(НастройкиМетодики.Период) КАК ПериодНастройкиМетодики,
		|			МАКСИМУМ(НастройкиМетодики.Субъект) КАК СубъектНастройкиМетодики,
		|			МАКСИМУМ(НастройкиАктиваНаДатуРазмещения.Период) КАК ПериодНастройкиАктиваНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиАктиваНаДатуРазмещения.Субъект) КАК СубъектНастройкиАктиваНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиСчетаДУНаДатуРазмещения.Период) КАК ПериодНастройкиСчетаНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиСчетаДУНаДатуРазмещения.Субъект) КАК СубъектНастройкиСчетаНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиКлиентаНаДатуРазмещения.Период) КАК ПериодНастройкиКлиентаНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиКлиентаНаДатуРазмещения.Субъект) КАК СубъектНастройкиКлиентаНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиМетодикиНаДатуРазмещения.Период) КАК ПериодНастройкиМетодикиНаДатуРазмещения,
		|			МАКСИМУМ(НастройкиМетодикиНаДатуРазмещения.Субъект) КАК СубъектНастройкиМетодикиНаДатуРазмещения
		|		ИЗ
		|			_Активы КАК _Активы
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРасчетаОценочнойСтоимости КАК _ВариантыРасчетаОценочнойСтоимости
		|				ПО _Активы.Актив = _ВариантыРасчетаОценочнойСтоимости.Актив
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиАктива
		|				ПО _Активы.Актив = НастройкиАктива.Актив
		|					И (НастройкиАктива.ВидСубъекта = ""Актив"")
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиСчетаДУ
		|				ПО _Активы.Актив = НастройкиСчетаДУ.Актив
		|					И (НастройкиСчетаДУ.ВидСубъекта = ""СчетДУ"")
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиКлиента
		|				ПО _Активы.Актив = НастройкиКлиента.Актив
		|					И (НастройкиКлиента.ВидСубъекта = ""Клиент"")
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиМетодики
		|				ПО _Активы.Актив = НастройкиМетодики.Актив
		|					И (НастройкиМетодики.ВидСубъекта = ""Методика"")
		|					И (_ВариантыРасчетаОценочнойСтоимости.НаДатуРасчета = НастройкиМетодики.Субъект)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиАктиваНаДатуРазмещения
		|				ПО _Активы.Актив = НастройкиАктиваНаДатуРазмещения.Актив
		|					И (НастройкиАктиваНаДатуРазмещения.ВидСубъекта = ""Актив"")
		|					И (НастройкиАктиваНаДатуРазмещения.Период <= _Активы.ДатаРегистрации)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиСчетаДУНаДатуРазмещения
		|				ПО _Активы.Актив = НастройкиСчетаДУНаДатуРазмещения.Актив
		|					И (НастройкиСчетаДУНаДатуРазмещения.ВидСубъекта = ""СчетДУ"")
		|					И (НастройкиСчетаДУНаДатуРазмещения.Период <= _Активы.ДатаРегистрации)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиКлиентаНаДатуРазмещения
		|				ПО _Активы.Актив = НастройкиКлиентаНаДатуРазмещения.Актив
		|					И (НастройкиКлиентаНаДатуРазмещения.ВидСубъекта = ""Клиент"")
		|					И (НастройкиКлиентаНаДатуРазмещения.Период <= _Активы.ДатаРегистрации)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиМетодикиНаДатуРазмещения
		|				ПО _Активы.Актив = НастройкиМетодикиНаДатуРазмещения.Актив
		|					И (НастройкиМетодикиНаДатуРазмещения.ВидСубъекта = ""Методика"")
		|					И (НастройкиМетодикиНаДатуРазмещения.Период <= _Активы.ДатаРегистрации)
		|					И (_ВариантыРасчетаОценочнойСтоимости.НаДатуРазмещения = НастройкиМетодикиНаДатуРазмещения.Субъект)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Активы.Актив,
		|			_Активы.ВидАктива,
		|			_Активы.ВидКонтрагента,
		|			_Активы.Валюта) КАК АктивыПоВидамСубъектов
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиАктива
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиАктива.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиАктива = НастройкиАктива.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиАктива = НастройкиАктива.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиСчетаДУ
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиСчетаДУ.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиСчета = НастройкиСчетаДУ.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиСчета = НастройкиСчетаДУ.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиКлиента
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиКлиента.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиКлиента = НастройкиКлиента.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиКлиента = НастройкиКлиента.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиМетодики
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиМетодики.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиМетодики = НастройкиМетодики.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиМетодики = НастройкиМетодики.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиАктиваНаДатуРазмещения
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиАктиваНаДатуРазмещения.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиАктиваНаДатуРазмещения = НастройкиАктиваНаДатуРазмещения.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиАктиваНаДатуРазмещения = НастройкиАктиваНаДатуРазмещения.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиСчетаДУНаДатуРазмещения
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиСчетаДУНаДатуРазмещения.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиСчетаНаДатуРазмещения = НастройкиСчетаДУНаДатуРазмещения.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиСчетаНаДатуРазмещения = НастройкиСчетаДУНаДатуРазмещения.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиКлиентаНаДатуРазмещения
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиКлиентаНаДатуРазмещения.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиКлиентаНаДатуРазмещения = НастройкиКлиентаНаДатуРазмещения.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиКлиентаНаДатуРазмещения = НастройкиКлиентаНаДатуРазмещения.Субъект
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ВсеНастройкиАктива КАК НастройкиМетодикиНаДатуРазмещения
		|			ПО АктивыПоВидамСубъектов.Актив = НастройкиМетодикиНаДатуРазмещения.Актив
		|				И АктивыПоВидамСубъектов.ПериодНастройкиМетодикиНаДатуРазмещения = НастройкиМетодикиНаДатуРазмещения.Период
		|				И АктивыПоВидамСубъектов.СубъектНастройкиМетодикиНаДатуРазмещения = НастройкиМетодикиНаДатуРазмещения.Субъект) КАК АктивыССубъектами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов КАК НастройкиРасчетаРыночнойСтавкиПоВидамАктивов
		|		ПО (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Организация = &Организация)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ЦельРасчета = &ЦельРасчета)
		|			И АктивыССубъектами.ВидАктива = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидАктива
		|			И АктивыССубъектами.ВидКонтрагента = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ВидКонтрагента
		|			И АктивыССубъектами.Валюта = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Валюта
		|			И (ВЫБОР
		|				КОГДА &МетодикаЭволюции20200907
		|					ТОГДА АктивыССубъектами.ПериодНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период
		|							И АктивыССубъектами.СубъектНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				КОГДА &ДляППАНаДатуРазмещенияАктиваИспользоватьНастройкиРостеха
		|						И АктивыССубъектами.ПериодНастройкиНаДатуРазмещения < &ДатаПереходаППАВРостех
		|					ТОГДА АктивыССубъектами.ПериодНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период
		|							И АктивыССубъектами.СубъектНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				КОГДА АктивыССубъектами.СхемаНаДатуРазмещения = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетНеРеализован)
		|						ИЛИ АктивыССубъектами.ИспользоватьНастройкиНаДатуРазмещенияАктива
		|						ИЛИ АктивыССубъектами.ПериодичностьОпределенияРыночнойСтавкиНаДатуРазмещения В (&ПроверкиТолькоПриПервоначальномПризнании)
		|					ТОГДА АктивыССубъектами.ПериодНастройкиНаДатуРазмещения = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период
		|							И АктивыССубъектами.СубъектНастройкиНаДатуРазмещения = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|				ИНАЧЕ АктивыССубъектами.ПериодНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Период
		|						И АктивыССубъектами.СубъектНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Субъект
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов КАК НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета
		|		ПО (НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.Организация = &Организация)
		|			И (НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ЦельРасчета = &ЦельРасчета)
		|			И АктивыССубъектами.ВидАктива = НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ВидАктива
		|			И АктивыССубъектами.ВидКонтрагента = НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.ВидКонтрагента
		|			И АктивыССубъектами.Валюта = НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.Валюта
		|			И АктивыССубъектами.ПериодНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.Период
		|			И АктивыССубъектами.СубъектНастройки = НастройкиРасчетаРыночнойСтавкиПоВидамАктивовНаДатуРасчета.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.Актив КАК Актив,
		|	_Активы.Номинал КАК Номинал,
		|	_Активы.Проценты КАК Проценты,
		|	_Активы.ПроцентыЭСП КАК ПроцентыЭСП,
		|	_Активы.Задолженность КАК Задолженность,
		|	_Активы.Комиссия КАК Комиссия,
		|	_Активы.ДатаРегистрации КАК ДатаРегистрации,
		|	_Активы.ПервоначальноеПризнаниеДепозитаИлиМНО КАК ПервоначальноеПризнаниеДепозитаИлиМНО,
		|	_Активы.ДатаПогашения КАК ДатаПогашения,
		|	_Активы.Валюта КАК Валюта,
		|	_Активы.СтавкаПоДоговору КАК СтавкаПоДоговору,
		|	_Активы.ВидАктива КАК ВидАктива,
		|	_НастройкиАктивов.Актив КАК Актив1,
		|	_НастройкиАктивов.ВидАктива КАК ВидАктива1,
		|	_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки КАК ВидСредневзвешеннойРыночнойСтавки,
		|	_НастройкиАктивов.Валюта КАК Валюта1,
		|	_НастройкиАктивов.ГруппаБанков КАК ГруппаБанков,
		|	_НастройкиАктивов.ВариантРасчетаСрокаДляОтбораРыночнойСтавки КАК ВариантРасчетаСрокаДляОтбораРыночнойСтавки,
		|	_НастройкиАктивов.ВариантРасчетаСрокаДляПримененияРыночнойСтавки КАК ВариантРасчетаСрокаДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.ВидШкалы КАК ВидШкалы,
		|	_НастройкиАктивов.ИгнорироватьИзменениеКлючевойСтавки КАК ИгнорироватьИзменениеКлючевойСтавки,
		|	_НастройкиАктивов.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|	_НастройкиАктивов.ВариантыРасчетаРыночнойСтавки КАК ВариантыРасчетаРыночнойСтавки,
		|	_НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки КАК ПроцентСущественностиОтклоненияОтРыночнойСтавки,
		|	_НастройкиАктивов.МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения КАК ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения,
		|	_НастройкиАктивов.ВидСтавкиДляПроверкиНаРыночность КАК ВидСтавкиДляПроверкиНаРыночность,
		|	_НастройкиАктивов.ВидСтавкиДляРасчетаДисконтированногоПотока КАК ВидСтавкиДляРасчетаДисконтированногоПотока,
		|	_НастройкиАктивов.ТочностьЭСП КАК ТочностьЭСП,
		|	_НастройкиАктивов.ТочностьРыночнойСтавки КАК ТочностьРыночнойСтавки,
		|	_НастройкиАктивов.ТочностьГраницДиапазонаРыночнойСтавки КАК ТочностьГраницДиапазонаРыночнойСтавки,
		|	_НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах КАК ПроцентСущественностиВПроцентныхПунктах,
		|	_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки КАК ПериодичностьОпределенияРыночнойСтавки,
		|	_НастройкиАктивов.ИсточникТаблицыСоответствияРейтингов КАК ИсточникТаблицыСоответствияРейтингов,
		|	_НастройкиАктивов.ОтклонениеКредитногоСпреда КАК ОтклонениеКредитногоСпреда,
		|	_НастройкиАктивов.ВариантОтклоненияОтРыночнойСтавки КАК ВариантОтклоненияОтРыночнойСтавки,
		|	_НастройкиАктивов.ВариантРасчетаКоэффициентаВолатильности КАК ВариантРасчетаКоэффициентаВолатильности,
		|	_НастройкиАктивов.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета КАК МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета,
		|	_НастройкиАктивов.МаксимальныйСрокАктиваДляИспользованияСхемы КАК МаксимальныйСрокАктиваДляИспользованияСхемы,
		|	_НастройкиАктивов.СхемаПроверкиСущественностиОтклонений КАК СхемаПроверкиСущественностиОтклонений,
		|	_НастройкиАктивов.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП КАК ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП,
		|	_НастройкиАктивов.ПроверкаНаРыночностьПоПеречнюЦБ580П КАК ПроверкаНаРыночностьПоПеречнюЦБ580П,
		|	_НастройкиАктивов.ПериодНаблюдаемыхПроцентныхСтавок КАК ПериодНаблюдаемыхПроцентныхСтавок,
		|	_НастройкиАктивов.СмещениеСтандартногоОтклонения КАК СмещениеСтандартногоОтклонения,
		|	_НастройкиАктивов.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета КАК ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета,
		|	_НастройкиАктивов.ТочностьЭСПНаДатуРасчета КАК ТочностьЭСПНаДатуРасчета,
		|	_НастройкиАктивов.НеПоказыватьОтрицательныеПроценты КАК НеПоказыватьОтрицательныеПроценты,
		|	_НастройкиАктивов.ПериодичностьОценки КАК ПериодичностьОценки,
		|	_НастройкиАктивов.ПериодичностьРасчетаКорректировкиЭСП КАК ПериодичностьРасчетаКорректировкиЭСП,
		|	_НастройкиАктивов.ИспользоватьНастройкиНаДатуРазмещенияАктива КАК ИспользоватьНастройкиНаДатуРазмещенияАктива,
		|	_НастройкиАктивов.Субъект КАК Субъект,
		|	_НастройкиАктивов.РассчитыватьЛинейноНерыночныеАктивы КАК РассчитыватьЛинейноНерыночныеАктивы
		|ПОМЕСТИТЬ _РасшифровкаСтоимостиАктивовПоРыночнойСтавке
		|ИЗ
		|	_Активы КАК _Активы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.ВидАктива КАК ВидАктива,
		|	_Активы.Актив КАК Актив,
		|	_ИзменениеУсловийКредитныхИнструментов.Период КАК Период
		|ПОМЕСТИТЬ _КонтрольРекласса
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИзменениеУсловийКредитныхИнструментов КАК _ИзменениеУсловийКредитныхИнструментов
		|		ПО _Активы.Актив = _ИзменениеУсловийКредитныхИнструментов.КредитныйИнструмент";
	
	Запрос.Выполнить();
	
	#Область Контроли
	
	МассивОшибок = Новый Массив;

	КонтрольРекласса = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КонтрольРекласса").ПолучитьДанные().Выгрузить();
	Для Каждого СтрокаРекласса Из КонтрольРекласса Цикл
		Если Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция")
			И СтрокаРекласса.Период = Дата(2020, 12, 1) 
			И СтрокаРекласса.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.Депозиты Тогда
			//Рекласс у Эволюции по депозитам 1.12.2020 проверен руками
		Иначе
		 	МассивОшибок.Добавить("Обнаружен неизвестный рекласс по активу " + СтрокаРекласса.Актив + " (" + СтрокаРекласса.ВидАктива + ") у клиента " + Клиент + " на " + Формат(СтрокаРекласса.Период, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЦикла;
	
	КонтольДатыРегистрацииПотоков = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_КонтольДатыРегистрацииПотоков").ПолучитьДанные().Выгрузить();
	Для Каждого СтрокаКонтоляДатыРегистрацииПотоков Из КонтольДатыРегистрацииПотоков Цикл
		МассивОшибок.Добавить("Разные даты регистрации денежных потоков по активу " + СтрокаКонтоляДатыРегистрацииПотоков.Актив + " (" + СтрокаКонтоляДатыРегистрацииПотоков.ВидАктива + ") у клиента " + Клиент + " на " + Формат(Период, "ДФ=dd.MM.yyyy"));
	КонецЦикла;
	
	Если МассивОшибок.Количество() Тогда
		ВызватьИсключение СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	#КонецОбласти
	
	НастройкиАктивов	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НастройкиАктивов").ПолучитьДанные().Выгрузить();
	МассивОшибок		= Новый Массив;
	
	Для Каждого СтрокаНастройки Из НастройкиАктивов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНастройки.СхемаПроверкиСущественностиОтклонений) Тогда
			МассивОшибок.Добавить("Не заполнена настройка расчета рыночной ставки по виду актива " + СтрокаНастройки.ВидАктива + " для счета ДУ: " + СчетДоверительногоУправления + " для валюты " + СтрокаНастройки.Валюта);
		ИначеЕсли СтрокаНастройки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетНеРеализован Тогда
			МассивОшибок.Добавить("Не реализован расчет рыночной ставки по виду актива " + СтрокаНастройки.ВидАктива + " для счета ДУ: " + СчетДоверительногоУправления + " для валюты " + СтрокаНастройки.Валюта);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Если ЭтоРасшифровка Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_Активы.*,
				|	_НастройкиАктивов.*
				|ИЗ
				|	_Активы КАК _Активы
				|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
				|		ПО _Активы.Актив = _НастройкиАктивов.Актив";

			АктивыСНастройками = Запрос.Выполнить().Выгрузить();
			
			СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(АктивыСНастройками, "_РасшифровкаСтоимостиАктивовПоРыночнойСтавке", МенеджерВременныхТаблиц);
			
			Возврат АктивыСНастройками;
			
		Иначе
			Возврат Активы;
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Расчет_индексов_по_шкале_для_сделок_РЕПО
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиАктивов.Актив КАК Актив,
		|	0 КАК ЗначениеИндекса
		|ИЗ
		|	_НастройкиАктивов КАК _НастройкиАктивов
		|ГДЕ
		|	_НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|	И _НастройкиАктивов.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО))
		|	И ТИПЗНАЧЕНИЯ(_НастройкиАктивов.Актив) = ТИП(Документ.СделкаРЕПО)
		|	И НЕ _НастройкиАктивов.Актив.СделкаСЦентральнымКонтрагентом";
	
	СделкиРЕПОДляОценкиПоШкалеИндексов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаАктивы Из СделкиРЕПОДляОценкиПоШкалеИндексов Цикл
	    			
		// Заполняем границы по шкале биржевых индексов
		ЗначениеИндекса = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ЗначениеБиржевогоИндексаДляСделкиРЕПО(СтрокаАктивы.Актив);
		Если ЗначениеИндекса = Неопределено Тогда 
			Отказ = Истина;
			Возврат Активы;
		КонецЕсли;
		
		СтрокаАктивы.ЗначениеИндекса = ЗначениеИндекса;
				
	КонецЦикла;
	
	// Помещаем в запрос
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРЕПОДляОценкиПоШкалеИндексов.Актив КАК Актив,
		|	СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса КАК ЗначениеИндекса
		|ПОМЕСТИТЬ _СделкиРЕПОДляОценкиПоШкалеИндексов
		|ИЗ
		|	&СделкиРЕПОДляОценкиПоШкалеИндексов КАК СделкиРЕПОДляОценкиПоШкалеИндексов";
	
	Запрос.УстановитьПараметр("СделкиРЕПОДляОценкиПоШкалеИндексов", СделкиРЕПОДляОценкиПоШкалеИндексов); 
	
	Запрос.Выполнить();
	
	#КонецОбласти
	
	#Область Текст_запроса_активов
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлючевыеСтавкиЦБРФ.ДатаЗначения КАК ДатаЗначения,
		|	КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЗначениеПоказателя
		|ПОМЕСТИТЬ _КлючевыеСтавкиЦБРФ
		|ИЗ
		|	РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|			&Период,
		|			Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|				И Прогноз = ЛОЖЬ) КАК КлючевыеСтавкиЦБРФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.Актив КАК Актив,
		|	_Активы.ДатаРегистрации КАК ДатаПроверкиНаРыночность,
		|	"""" КАК ОписаниеДатыПроверкиНаРыночность,
		|	ЛОЖЬ КАК ИзменениеДатыПотока,
		|	ЛОЖЬ КАК ИзменениеСрокаИнструмента,
		|	ЛОЖЬ КАК ИзменениеСтавки,
		|	ИСТИНА КАК ПервоначальноеПризнание,
		|	ЛОЖЬ КАК ОфициальнаяОценка,
		|	ЛОЖЬ КАК ИзменениеПравилСЧА,
		|	ЛОЖЬ КАК ИзменениеКлючевойСтавки
		|ПОМЕСТИТЬ _ПериодыОпределенияРыночныхСтавокВсе
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|			И (ПериодичностиОпределенияРыночнойСтавки.ПервоначальноеПризнание)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Активы.Актив,
		|	&ДатаОпределенияСЧА,
		|	"""",
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|			И (ПериодичностиОпределенияРыночнойСтавки.ОфициальнаяОценка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Активы.Актив,
		|	ЕСТЬNULL(_ДатыИзмененияПравилСЧА.Дата, ДАТАВРЕМЯ(1, 1, 1)),
		|	_ДатыИзмененияПравилСЧА.ОписаниеСобытия,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыИзмененияПравилСЧА КАК _ДатыИзмененияПравилСЧА
		|		ПО _Активы.ВидАктива = _ДатыИзмененияПравилСЧА.ВидАктива
		|			И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеПравилСЧА)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Активы.Актив,
		|	ДатыИзмененияУсловийКредитныхИнструментов.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|		И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеДатыПотока,
		|	ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|		И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеСрокаИнструмента,
		|	ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки
		|		И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеСтавки,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|			И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|			И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|				ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|				ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.КредитныйИнструмент КАК КредитныйИнструмент,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий КАК ПоздняяДатаДействияСтарыхУсловий,
		|			ВложенныйЗапрос.ИзменениеДатыПотока КАК ИзменениеДатыПотока,
		|			ЛОЖЬ КАК ИзменениеСрокаИнструмента,
		|			ЛОЖЬ КАК ИзменениеСтавки,
		|			МИНИМУМ(ВложенныйЗапрос.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияНовыхУсловий
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|				УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов <> УсловияКредитныхИнструментовСрезПоследнихРанее.ПериодичностьВыплатыПроцентов
		|					ИЛИ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения КАК ИзменениеДатыПотока,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий) КАК ПоздняяДатаДействияСтарыхУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|						&Период,
		|						Организация = &Организация
		|							И КредитныйИнструмент В
		|								(ВЫБРАТЬ
		|									_Активы.Актив
		|								ИЗ
		|									_Активы КАК _Активы
		|								ГДЕ
		|									_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследних
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|							&Период,
		|							Организация = &Организация
		|								И КредитныйИнструмент В
		|									(ВЫБРАТЬ
		|										_Активы.Актив
		|									ИЗ
		|										_Активы КАК _Активы
		|									ГДЕ
		|										_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследнихРанее
		|					ПО УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследнихРанее.КредитныйИнструмент
		|						И УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий > УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий
		|						И (УсловияКредитныхИнструментовСрезПоследних.Действует)
		|						И (УсловияКредитныхИнструментовСрезПоследнихРанее.Действует)
		|						И (УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов <> УсловияКредитныхИнструментовСрезПоследнихРанее.ПериодичностьВыплатыПроцентов
		|							ИЛИ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов <> УсловияКредитныхИнструментовСрезПоследнихРанее.ПериодичностьВыплатыПроцентов
		|					ИЛИ УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.КредитныйИнструмент,
		|			ВложенныйЗапрос.ИзменениеДатыПотока,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВложенныйЗапрос.КредитныйИнструмент,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий,
		|			ЛОЖЬ,
		|			ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|			ЛОЖЬ,
		|			МИНИМУМ(ВложенныйЗапрос.ДатаНачалаДействияУсловий)
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения КАК ИзменениеСрокаИнструмента,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий) КАК ПоздняяДатаДействияСтарыхУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|						&Период,
		|						Организация = &Организация
		|							И КредитныйИнструмент В
		|								(ВЫБРАТЬ
		|									_Активы.Актив
		|								ИЗ
		|									_Активы КАК _Активы
		|								ГДЕ
		|									_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследних
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|							&Период,
		|							Организация = &Организация
		|								И КредитныйИнструмент В
		|									(ВЫБРАТЬ
		|										_Активы.Актив
		|									ИЗ
		|										_Активы КАК _Активы
		|									ГДЕ
		|										_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследнихРанее
		|					ПО УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследнихРанее.КредитныйИнструмент
		|						И УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий > УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий
		|						И (УсловияКредитныхИнструментовСрезПоследних.Действует)
		|						И (УсловияКредитныхИнструментовСрезПоследнихРанее.Действует)
		|						И УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения <> УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаПогашения,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.КредитныйИнструмент,
		|			ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВложенныйЗапрос.КредитныйИнструмент,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий,
		|			ЛОЖЬ,
		|			ЛОЖЬ,
		|			ВложенныйЗапрос.ИзменениеСтавки,
		|			МИНИМУМ(ВложенныйЗапрос.ДатаНачалаДействияУсловий)
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|				УсловияКредитныхИнструментовСрезПоследних.Процент <> УсловияКредитныхИнструментовСрезПоследнихРанее.Процент КАК ИзменениеСтавки,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий) КАК ПоздняяДатаДействияСтарыхУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|						&Период,
		|						Организация = &Организация
		|							И КредитныйИнструмент В
		|								(ВЫБРАТЬ
		|									_Активы.Актив
		|								ИЗ
		|									_Активы КАК _Активы
		|								ГДЕ
		|									_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследних
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|							&Период,
		|							Организация = &Организация
		|								И КредитныйИнструмент В
		|									(ВЫБРАТЬ
		|										_Активы.Актив
		|									ИЗ
		|										_Активы КАК _Активы
		|									ГДЕ
		|										_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные)))) КАК УсловияКредитныхИнструментовСрезПоследнихРанее
		|					ПО УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследнихРанее.КредитныйИнструмент
		|						И УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий > УсловияКредитныхИнструментовСрезПоследнихРанее.ДатаНачалаДействияУсловий
		|						И (УсловияКредитныхИнструментовСрезПоследних.Действует)
		|						И (УсловияКредитныхИнструментовСрезПоследнихРанее.Действует)
		|						И УсловияКредитныхИнструментовСрезПоследних.Процент <> УсловияКредитныхИнструментовСрезПоследнихРанее.Процент
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент,
		|				УсловияКредитныхИнструментовСрезПоследних.Процент <> УсловияКредитныхИнструментовСрезПоследнихРанее.Процент,
		|				УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.КредитныйИнструмент,
		|			ВложенныйЗапрос.ИзменениеСтавки,
		|			ВложенныйЗапрос.ПоздняяДатаДействияСтарыхУсловий) КАК ДатыИзмененияУсловийКредитныхИнструментов
		|		ПО _Активы.Актив = ДатыИзмененияУсловийКредитныхИнструментов.КредитныйИнструмент
		|			И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|					И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеДатыПотока
		|				ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|					И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеСрокаИнструмента
		|				ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки
		|					И ДатыИзмененияУсловийКредитныхИнструментов.ИзменениеСтавки)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатыИзмененияУсловийРЕПО.Актив,
		|	ДатыИзмененияУсловийРЕПО.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ДатыИзмененияУсловийРЕПО.ИзменениеДатыПотока,
		|	ДатыИзмененияУсловийРЕПО.ИзменениеСрокаИнструмента,
		|	ДатыИзмененияУсловийРЕПО.ИзменениеСтавки,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий КАК ПериодПредыдущихУсловий,
		|		ВложенныйЗапрос.ИзменениеДатыПотока КАК ИзменениеДатыПотока,
		|		ЛОЖЬ КАК ИзменениеСрокаИнструмента,
		|		ЛОЖЬ КАК ИзменениеСтавки,
		|		МИНИМУМ(ВложенныйЗапрос.Период) КАК ДатаНачалаДействияНовыхУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияСделокРЕПО.Период КАК Период,
		|			ИСТИНА КАК ИзменениеДатыПотока,
		|			МАКСИМУМ(УсловияСделокРЕПО1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО)))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|				ПО _Активы.Актив = УсловияСделокРЕПО.СделкаРЕПО
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО1
		|				ПО (УсловияСделокРЕПО1.Организация = &Организация)
		|					И (УсловияСделокРЕПО.Организация = &Организация)
		|					И (УсловияСделокРЕПО.СделкаРЕПО = УсловияСделокРЕПО1.СделкаРЕПО)
		|					И (УсловияСделокРЕПО.ЦеннаяБумага = УсловияСделокРЕПО1.ЦеннаяБумага)
		|					И (УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты
		|						ИЛИ УсловияСделокРЕПО.СтавкаРЕПО <> УсловияСделокРЕПО1.СтавкаРЕПО)
		|					И (УсловияСделокРЕПО1.ЧастьСделкиРЕПО = 2)
		|					И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <> УсловияСделокРЕПО.ДатаОплаты)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ) <= &Период)
		|					И (УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделокРЕПО.Период,
		|			УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты
		|				И ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеДатыПотока,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий,
		|		ЛОЖЬ,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|		ЛОЖЬ,
		|		МИНИМУМ(ВложенныйЗапрос.Период)
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияСделокРЕПО.Период КАК Период,
		|			ИСТИНА КАК ИзменениеСрокаИнструмента,
		|			МАКСИМУМ(УсловияСделокРЕПО1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО)))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|				ПО _Активы.Актив = УсловияСделокРЕПО.СделкаРЕПО
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО1
		|				ПО (УсловияСделокРЕПО1.Организация = &Организация)
		|					И (УсловияСделокРЕПО.Организация = &Организация)
		|					И (УсловияСделокРЕПО.СделкаРЕПО = УсловияСделокРЕПО1.СделкаРЕПО)
		|					И (УсловияСделокРЕПО.ЦеннаяБумага = УсловияСделокРЕПО1.ЦеннаяБумага)
		|					И (УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты
		|						ИЛИ УсловияСделокРЕПО.СтавкаРЕПО <> УсловияСделокРЕПО1.СтавкаРЕПО)
		|					И (УсловияСделокРЕПО1.ЧастьСделкиРЕПО = 2)
		|					И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <> УсловияСделокРЕПО.ДатаОплаты)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ) <= &Период)
		|					И (УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделокРЕПО.Период,
		|			УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты
		|				И ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ВложенныйЗапрос.ИзменениеСтавки,
		|		МИНИМУМ(ВложенныйЗапрос.Период)
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияСделокРЕПО.Период КАК Период,
		|			ИСТИНА КАК ИзменениеСтавки,
		|			МАКСИМУМ(УсловияСделокРЕПО1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО)))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|				ПО _Активы.Актив = УсловияСделокРЕПО.СделкаРЕПО
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО1
		|				ПО (УсловияСделокРЕПО1.Организация = &Организация)
		|					И (УсловияСделокРЕПО.Организация = &Организация)
		|					И (УсловияСделокРЕПО.СделкаРЕПО = УсловияСделокРЕПО1.СделкаРЕПО)
		|					И (УсловияСделокРЕПО.ЦеннаяБумага = УсловияСделокРЕПО1.ЦеннаяБумага)
		|					И (УсловияСделокРЕПО.ДатаОплаты <> УсловияСделокРЕПО1.ДатаОплаты
		|						ИЛИ УсловияСделокРЕПО.СтавкаРЕПО <> УсловияСделокРЕПО1.СтавкаРЕПО)
		|					И (УсловияСделокРЕПО1.ЧастьСделкиРЕПО = 2)
		|					И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО.Период, ДЕНЬ) <> УсловияСделокРЕПО.ДатаОплаты)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокРЕПО1.Период, ДЕНЬ) <= &Период)
		|					И (УсловияСделокРЕПО.СтавкаРЕПО <> УсловияСделокРЕПО1.СтавкаРЕПО)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделокРЕПО.Период,
		|			УсловияСделокРЕПО.СтавкаРЕПО <> УсловияСделокРЕПО1.СтавкаРЕПО
		|				И ПериодичностиОпределенияРыночнойСтавки.ИзменениеСтавки,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеСтавки,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий) КАК ДатыИзмененияУсловийРЕПО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатыИзмененияУсловийСделок.Актив,
		|	ДатыИзмененияУсловийСделок.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ДатыИзмененияУсловийСделок.ИзменениеДатыПотока,
		|	ДатыИзмененияУсловийСделок.ИзменениеСрокаИнструмента,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий КАК ПериодПредыдущихУсловий,
		|		ВложенныйЗапрос.ИзменениеДатыПотока КАК ИзменениеДатыПотока,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|		МИНИМУМ(ВложенныйЗапрос.Период) КАК ДатаНачалаДействияНовыхУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияСделок.Период КАК Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока КАК ИзменениеДатыПотока,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|			МАКСИМУМ(УсловияСделок1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)))
		|					И (ТИПЗНАЧЕНИЯ(_Активы.Актив) = ТИП(Документ.Сделка))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК ДокументСделка
		|				ПО _Активы.Актив = ДокументСделка.Ссылка
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок
		|				ПО _Активы.Актив = УсловияСделок.Сделка
		|					И (НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок КАК УсловияСделок1
		|				ПО (УсловияСделок1.Организация = &Организация)
		|					И (УсловияСделок.Организация = &Организация)
		|					И (УсловияСделок.Сделка = УсловияСделок1.Сделка)
		|					И (УсловияСделок.ЦеннаяБумага = УсловияСделок1.ЦеннаяБумага)
		|					И (УсловияСделок.ДатаОплаты <> УсловияСделок1.ДатаОплаты
		|							И (_Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|									И ДокументСделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|								ИЛИ _Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|									И ДокументСделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|						ИЛИ УсловияСделок.ДатаПоставки <> УсловияСделок1.ДатаПоставки
		|							И (_Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|									И ДокументСделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|								ИЛИ _Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|									И ДокументСделка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделок.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияСделок1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделок1.Период, ДЕНЬ) <= &Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделок.Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеДатыПотока,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий) КАК ДатыИзмененияУсловийСделок
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатыОкончанияСрокаАренды.Актив,
		|	ДатыОкончанияСрокаАренды.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ЛОЖЬ,
		|	ДатыОкончанияСрокаАренды.ИзменениеСрокаИнструмента,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий КАК ПериодПредыдущихУсловий,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|		МИНИМУМ(ВложенныйЗапрос.Период) КАК ДатаНачалаДействияНовыхУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияДоговоровОбщие.Период КАК Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|			МАКСИМУМ(УсловияДоговоровОбщие1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженностьПоДолгосрочнойАренде))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|				ПО _Активы.Актив = СделкаСНедвижимостью.Ссылка
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(&Период, Организация = &Организация) КАК УсловияДоговоровАрендыСрезПоследних
		|				ПО (СделкаСНедвижимостью.Договор = УсловияДоговоровАрендыСрезПоследних.Договор)
		|					И (УсловияДоговоровАрендыСрезПоследних.ВидДоговораАренды = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровАренды.Получения))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|				ПО (УсловияДоговоровАрендыСрезПоследних.Договор = УсловияДоговоровОбщие.Договор)
		|					И (УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1))
		|					И (НАЧАЛОПЕРИОДА(УсловияДоговоровОбщие.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие КАК УсловияДоговоровОбщие1
		|				ПО (УсловияДоговоровОбщие.Договор = УсловияДоговоровОбщие1.Договор)
		|					И (УсловияДоговоровОбщие.ДатаРасторжения <> УсловияДоговоровОбщие1.ДатаРасторжения)
		|					И (НАЧАЛОПЕРИОДА(УсловияДоговоровОбщие.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияДоговоровОбщие1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияДоговоровОбщие1.Период, ДЕНЬ) <= &Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияДоговоровОбщие.Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий) КАК ДатыОкончанияСрокаАренды
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатыИзмененияПлановыхДатОплаты.Актив,
		|	ДатыИзмененияПлановыхДатОплаты.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ДатыИзмененияПлановыхДатОплаты.ИзменениеДатыДенежногоПотока,
		|	ДатыИзмененияПлановыхДатОплаты.ИзменениеСрокаИнструмента,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий КАК ПериодПредыдущихУсловий,
		|		ВложенныйЗапрос.ИзменениеДатыДенежногоПотока КАК ИзменениеДатыДенежногоПотока,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|		МИНИМУМ(ВложенныйЗапрос.Период) КАК ДатаНачалаДействияНовыхУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			ПлановыеДатыОплат.Период КАК Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока КАК ИзменениеДатыДенежногоПотока,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента КАК ИзменениеСрокаИнструмента,
		|			МАКСИМУМ(ПлановыеДатыОплат1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива В (ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)))
		|					И (ТИПЗНАЧЕНИЯ(_Активы.Актив) = ТИП(Документ.Оплата))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока
		|						ИЛИ ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат КАК ПлановыеДатыОплат
		|				ПО _Активы.Актив = ПлановыеДатыОплат.Основание
		|					И (НАЧАЛОПЕРИОДА(ПлановыеДатыОплат.Период, ДЕНЬ) <= &Период)
		|					И (ПлановыеДатыОплат.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде)))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат КАК ПлановыеДатыОплат1
		|				ПО (ПлановыеДатыОплат1.Организация = &Организация)
		|					И (ПлановыеДатыОплат.Организация = &Организация)
		|					И (ПлановыеДатыОплат.Основание = ПлановыеДатыОплат1.Основание)
		|					И (ПлановыеДатыОплат.Валюта = ПлановыеДатыОплат1.Валюта)
		|					И (ПлановыеДатыОплат.ВидЗадолженности = ПлановыеДатыОплат1.ВидЗадолженности)
		|					И (ПлановыеДатыОплат.ДатаОплаты <> ПлановыеДатыОплат1.ДатаОплаты)
		|					И (НАЧАЛОПЕРИОДА(ПлановыеДатыОплат.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(ПлановыеДатыОплат1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(ПлановыеДатыОплат1.Период, ДЕНЬ) <= &Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеДатыОплат.Период,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока,
		|			ПериодичностиОпределенияРыночнойСтавки.ИзменениеСрокаИнструмента,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ИзменениеДатыДенежногоПотока,
		|		ВложенныйЗапрос.ИзменениеСрокаИнструмента,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий) КАК ДатыИзмененияПлановыхДатОплаты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_Активы.Актив,
		|	ГрафикиПлатежей.Период,
		|	"""",
		|	ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО _Активы.Актив = СделкаСНедвижимостью.Ссылка
		|			И (СделкаСНедвижимостью.ВидПраваНаНедвижимость <> ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|			И (_Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|					И СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|				ИЛИ _Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|					И СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|			И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПлатежей КАК ГрафикиПлатежей
		|		ПО _Активы.Актив = ГрафикиПлатежей.Основание
		|			И (НАЧАЛОПЕРИОДА(ГрафикиПлатежей.Период, ДЕНЬ) <= &Период)
		|			И (НАЧАЛОПЕРИОДА(ГрафикиПлатежей.Период, ДЕНЬ) <> НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(_Активы.Актив КАК Документ.СделкаСНедвижимостью).Дата, ДЕНЬ))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатыИзмененияПлановыхДатОплаты.Актив,
		|	ДатыИзмененияПлановыхДатОплаты.ДатаНачалаДействияНовыхУсловий,
		|	"""",
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий КАК ПериодПредыдущихУсловий,
		|		МИНИМУМ(ВложенныйЗапрос.Период) КАК ДатаНачалаДействияНовыхУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_Активы.Актив КАК Актив,
		|			УсловияСделокСНедвижимостью.Период КАК Период,
		|			МАКСИМУМ(УсловияСделокСНедвижимостью1.Период) КАК ПериодПредыдущихУсловий
		|		ИЗ
		|			_Активы КАК _Активы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|				ПО _Активы.Актив = СделкаСНедвижимостью.Ссылка
		|					И (СделкаСНедвижимостью.ВидПраваНаНедвижимость <> ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _Активы.Актив = _НастройкиАктивов.Актив
		|					И (_Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
		|							И СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ИЛИ _Активы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
		|							И СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа))
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|				ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|					И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеДатыДенежногоПотока)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью КАК УсловияСделокСНедвижимостью
		|				ПО _Активы.Актив = УсловияСделокСНедвижимостью.Основание
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокСНедвижимостью.Период, ДЕНЬ) <= &Период)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью КАК УсловияСделокСНедвижимостью1
		|				ПО (УсловияСделокСНедвижимостью1.Организация = &Организация)
		|					И (УсловияСделокСНедвижимостью.Организация = &Организация)
		|					И (УсловияСделокСНедвижимостью.Основание = УсловияСделокСНедвижимостью1.Основание)
		|					И (УсловияСделокСНедвижимостью.ОбъектНедвижимости = УсловияСделокСНедвижимостью1.ОбъектНедвижимости)
		|					И (УсловияСделокСНедвижимостью.ПлановаяДатаПередачи <> УсловияСделокСНедвижимостью1.ПлановаяДатаПередачи)
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокСНедвижимостью.Период, ДЕНЬ) > НАЧАЛОПЕРИОДА(УсловияСделокСНедвижимостью1.Период, ДЕНЬ))
		|					И (НАЧАЛОПЕРИОДА(УсловияСделокСНедвижимостью1.Период, ДЕНЬ) <= &Период)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделокСНедвижимостью.Период,
		|			_Активы.Актив) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ПериодПредыдущихУсловий) КАК ДатыИзмененияПлановыхДатОплаты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Активы.Актив,
		|	ПоследнееИзменениеКлючевойСтавкиЦБРФ.ДатаЗначения,
		|	"""",
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	_Активы КАК _Активы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО (_НастройкиАктивов.Актив = _Активы.Актив)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (ПериодичностиОпределенияРыночнойСтавки.Ссылка = _НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки)
		|			И (ПериодичностиОпределенияРыночнойСтавки.ИзменениеКлючевойСтавки),
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		_КлючевыеСтавкиЦБРФ.ДатаЗначения КАК ДатаЗначения
		|	ИЗ
		|		_КлючевыеСтавкиЦБРФ КАК _КлючевыеСтавкиЦБРФ
		|	ГДЕ
		|		_КлючевыеСтавкиЦБРФ.ДатаЗначения <= &Период
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		_КлючевыеСтавкиЦБРФ.ДатаЗначения УБЫВ) КАК ПоследнееИзменениеКлючевойСтавкиЦБРФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыОпределенияРыночныхСтавок.Актив КАК Актив,
		|	МАКСИМУМ(ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность) КАК ДатаПроверкиНаРыночность,
		|	МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ОписаниеДатыПроверкиНаРыночность) + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ИзменениеСрокаИнструмента)
		|			ТОГДА ""| Изменение срока инструмента ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ИзменениеСтавки)
		|			ТОГДА ""| Изменение ставки ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ПервоначальноеПризнание)
		|			ТОГДА ""| Первоначальное признание ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ОфициальнаяОценка)
		|			ТОГДА ""| Дата официальной оценки ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ИзменениеПравилСЧА)
		|			ТОГДА ""| Дата изменения правил СЧА ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ИзменениеДатыПотока)
		|			ТОГДА ""| Изменение даты денежного потока ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ИзменениеКлючевойСтавки)
		|			ТОГДА ""| Изменение ключевой ставки ""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОписаниеДатыПроверкиНаРыночность
		|ПОМЕСТИТЬ _ПериодыОпределенияРыночныхСтавок
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыОпределенияРыночныхСтавокВсе.Актив КАК Актив,
		|		МАКСИМУМ(_ПериодыОпределенияРыночныхСтавокВсе.ДатаПроверкиНаРыночность) КАК ДатаПроверкиНаРыночность
		|	ИЗ
		|		_ПериодыОпределенияРыночныхСтавокВсе КАК _ПериодыОпределенияРыночныхСтавокВсе
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПериодыОпределенияРыночныхСтавокВсе.Актив) КАК ПериодыОпределенияРыночныхСтавок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыОпределенияРыночныхСтавокВсе КАК _ПериодыОпределенияРыночныхСтавокВсе
		|		ПО ПериодыОпределенияРыночныхСтавок.Актив = _ПериодыОпределенияРыночныхСтавокВсе.Актив
		|			И ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность = _ПериодыОпределенияРыночныхСтавокВсе.ДатаПроверкиНаРыночность
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыОпределенияРыночныхСтавок.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.Актив КАК Актив,
		|	_ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность КАК ДатаПроверкиНаРыночность,
		|	_ПериодыОпределенияРыночныхСтавок.ОписаниеДатыПроверкиНаРыночность КАК ОписаниеДатыПроверкиНаРыночность,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ВариантПолученияДатыКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ДатыСобытийПриПримененииРыночнойСтавки.ДатаПервоначальногоПризнания)
		|			ТОГДА ""Первоначальное признание""
		|		ИНАЧЕ _ПериодыОпределенияРыночныхСтавок.ОписаниеДатыПроверкиНаРыночность
		|	КОНЕЦ КАК ОписаниеДатыКлючевойСтавки,
		|	МАКСИМУМ(КлючевыеСтавкиЦБРФ.ДатаЗначения) КАК ПериодКлючевойСтавки,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Активы.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА МАКСИМУМ(ПеречниОбъектов.Период)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ПериодПеречниОбъектов
		|ПОМЕСТИТЬ _ПериодыПроверкиНаРыночность
		|ИЗ
		|	_Активы КАК _Активы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыОпределенияРыночныхСтавок КАК _ПериодыОпределенияРыночныхСтавок
		|		ПО _Активы.Актив = _ПериодыОпределенияРыночныхСтавок.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФ
		|		ПО (ВЫБОР
		|				КОГДА _НастройкиАктивов.ВариантПолученияДатыКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ДатыСобытийПриПримененииРыночнойСтавки.ДатаПервоначальногоПризнания)
		|					ТОГДА _Активы.ДатаРегистрации
		|				ИНАЧЕ _ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность
		|			КОНЕЦ >= КлючевыеСтавкиЦБРФ.ДатаЗначения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|		ПО (ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ))
		|			И (ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ПереченьКредитныхОрганизаций580П))
		|			И (ПеречниОбъектов.Объект = ВЫРАЗИТЬ(_Активы.Актив КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк)
		|			И (_ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность >= ПеречниОбъектов.Период)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Активы.Актив) В (ТИП(Справочник.ДепозитныеВклады), ТИП(Справочник.Займы), ТИП(Документ.СделкаРЕПО), ТИП(Документ.Сделка), ТИП(Документ.ЗакрытиеКредитногоИнструмента), ТИП(Документ.МНО), ТИП(Документ.Оплата), ТИП(Документ.НачислениеЗадолженности), ТИП(Документ.СделкаСНедвижимостью), ТИП(Справочник.Договоры))
		|
		|СГРУППИРОВАТЬ ПО
		|	_Активы.Актив,
		|	_ПериодыОпределенияРыночныхСтавок.ДатаПроверкиНаРыночность,
		|	_ПериодыОпределенияРыночныхСтавок.ОписаниеДатыПроверкиНаРыночность,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ВариантПолученияДатыКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ДатыСобытийПриПримененииРыночнойСтавки.ДатаПервоначальногоПризнания)
		|			ТОГДА ""Первоначальное признание""
		|		ИНАЧЕ _ПериодыОпределенияРыночныхСтавок.ОписаниеДатыПроверкиНаРыночность
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеДаты.Актив КАК Актив,
		|	ВсеДаты.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|	ВсеДаты.Период КАК Период,
		|	УсловияКредитныхИнструментов.Действует КАК Действует
		|ПОМЕСТИТЬ _СрезПоследнихНаДатыПроверкиНаРыночность
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыПроверкиНаРыночность.Актив КАК Актив,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий КАК ДатаНачалаДействияУсловий,
		|		МАКСИМУМ(УсловияКредитныхИнструментов.Период) КАК Период
		|	ИЗ
		|		_ПериодыПроверкиНаРыночность КАК _ПериодыПроверкиНаРыночность
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|			ПО _ПериодыПроверкиНаРыночность.Актив = УсловияКредитныхИнструментов.КредитныйИнструмент
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(_ПериодыПроверкиНаРыночность.Актив) В (ТИП(Справочник.Займы), ТИП(Справочник.ДепозитныеВклады))
		|		И УсловияКредитныхИнструментов.Период <= _ПериодыПроверкиНаРыночность.ДатаПроверкиНаРыночность
		|		И УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий <= _ПериодыПроверкиНаРыночность.ДатаПроверкиНаРыночность
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПериодыПроверкиНаРыночность.Актив,
		|		УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ВсеДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО ВсеДаты.Актив = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВсеДаты.Период = УсловияКредитныхИнструментов.Период
		|			И ВсеДаты.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|ГДЕ
		|	УсловияКредитныхИнструментов.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СрезПоследнихНаДатыПроверкиНаРыночность.Актив КАК Актив,
		|	МАКСИМУМ(_СрезПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|ПОМЕСТИТЬ _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность
		|ИЗ
		|	_СрезПоследнихНаДатыПроверкиНаРыночность КАК _СрезПоследнихНаДатыПроверкиНаРыночность
		|
		|СГРУППИРОВАТЬ ПО
		|	_СрезПоследнихНаДатыПроверкиНаРыночность.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыПроверкиНаРыночность.Актив КАК Актив,
		|	_ПериодыПроверкиНаРыночность.ДатаПроверкиНаРыночность КАК ДатаПроверкиНаРыночность,
		|	_ПериодыПроверкиНаРыночность.ОписаниеДатыПроверкиНаРыночность КАК ОписаниеДатыПроверкиНаРыночность,
		|	_ПериодыПроверкиНаРыночность.ОписаниеДатыКлючевойСтавки КАК ОписаниеДатыКлючевойСтавки,
		|	_ПериодыПроверкиНаРыночность.ПериодКлючевойСтавки КАК ПериодКлючевойСтавки,
		|	_ПериодыПроверкиНаРыночность.ПериодПеречниОбъектов КАК ПериодПеречниОбъектов,
		|	МАКСИМУМ(_СрезПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПериодыПроверкиНаРыночность.Актив) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА МАКСИМУМ(УсловияСделокРЕПО.Период)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПериодыПроверкиНаРыночность.Актив) = ТИП(Документ.Сделка)
		|				ИЛИ ТИПЗНАЧЕНИЯ(_ПериодыПроверкиНаРыночность.Актив) = ТИП(Документ.МНО)
		|			ТОГДА NULL
		|		ИНАЧЕ МАКСИМУМ(_СрезПоследнихНаДатыПроверкиНаРыночность.Период)
		|	КОНЕЦ КАК ПериодУсловийАктива,
		|	МАКСИМУМ(_СрезПоследнихНаТекущуюДату.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияТекущихУсловий,
		|	МАКСИМУМ(_СрезПоследнихНаТекущуюДату.Период) КАК ПериодТекущихУсловийАктива
		|ПОМЕСТИТЬ _ПериодыАктивов
		|ИЗ
		|	_ПериодыПроверкиНаРыночность КАК _ПериодыПроверкиНаРыночность
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность КАК _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СрезПоследнихНаДатыПроверкиНаРыночность КАК _СрезПоследнихНаДатыПроверкиНаРыночность
		|			ПО _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность.Актив = _СрезПоследнихНаДатыПроверкиНаРыночность.Актив
		|				И _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий = _СрезПоследнихНаДатыПроверкиНаРыночность.ДатаНачалаДействияУсловий
		|		ПО _ПериодыПроверкиНаРыночность.Актив = _ДатыАктуальныхУсловийСрезаПоследнихНаДатыПроверкиНаРыночность.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату КАК _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СрезПоследнихНаТекущуюДату КАК _СрезПоследнихНаТекущуюДату
		|			ПО _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.Актив = _СрезПоследнихНаТекущуюДату.Актив
		|				И _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.ДатаНачалаДействияУсловий = _СрезПоследнихНаТекущуюДату.ДатаНачалаДействияУсловий
		|		ПО _ПериодыПроверкиНаРыночность.Актив = _ДатыАктуальныхУсловийСрезаПоследнихНаТекущуюДату.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПО
		|		ПО _ПериодыПроверкиНаРыночность.Актив = УсловияСделокРЕПО.СделкаРЕПО
		|			И (КОНЕЦПЕРИОДА(_ПериодыПроверкиНаРыночность.ДатаПроверкиНаРыночность, ДЕНЬ) >= УсловияСделокРЕПО.Период)
		|			И (УсловияСделокРЕПО.ЧастьСделкиРЕПО = 2)
		|			И (ТИПЗНАЧЕНИЯ(_ПериодыПроверкиНаРыночность.Актив) = ТИП(Документ.СделкаРЕПО))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПериодыПроверкиНаРыночность.Актив,
		|	_ПериодыПроверкиНаРыночность.ДатаПроверкиНаРыночность,
		|	_ПериодыПроверкиНаРыночность.ОписаниеДатыПроверкиНаРыночность,
		|	_ПериодыПроверкиНаРыночность.ОписаниеДатыКлючевойСтавки,
		|	_ПериодыПроверкиНаРыночность.ПериодКлючевойСтавки,
		|	_ПериодыПроверкиНаРыночность.ПериодПеречниОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыАктивов.Актив КАК Актив,
		|	ЕСТЬNULL(УсловияКредитныхИнструментов.Процент, Активы.СтавкаПоДоговору) КАК СтавкаПоДоговору,
		|	Активы.ДатаРегистрации КАК ДатаРегистрации,
		|	ВЫБОР
		|		КОГДА Активы.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Активы.ДатаПогашения
		|		КОГДА УсловияКредитныхИнструментов.ДатаПогашения ЕСТЬ НЕ NULL 
		|			ТОГДА УсловияКредитныхИнструментов.ДатаПогашения
		|		КОГДА УсловияСделокРЕПОЧасть2.ДатаВторойЧастиРЕПО <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА УсловияСделокРЕПОЧасть2.ДатаВторойЧастиРЕПО
		|		КОГДА ГрафикиПлатежей.ДатаПлатежа ЕСТЬ НЕ NULL 
		|			ТОГДА ГрафикиПлатежей.ДатаПлатежа
		|		ИНАЧЕ УсловияСделокРЕПОЧасть2.ДатаОплаты
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА &ДляДолгосрочнойАрендыОпределятьРыночнуюСтавкуПоОкончаниюСрокаАренды
		|				И Активы.СрокОкончанияДолгосрочногоДоговораАренды ЕСТЬ НЕ NULL 
		|			ТОГДА Активы.СрокОкончанияДолгосрочногоДоговораАренды
		|		КОГДА Активы.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Активы.ДатаПогашения
		|		КОГДА УсловияКредитныхИнструментов.ДатаПогашения ЕСТЬ НЕ NULL 
		|			ТОГДА УсловияКредитныхИнструментов.ДатаПогашения
		|		КОГДА УсловияСделокРЕПОЧасть2.ДатаВторойЧастиРЕПО <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА УсловияСделокРЕПОЧасть2.ДатаВторойЧастиРЕПО
		|		КОГДА ГрафикиПлатежей.ДатаПлатежа ЕСТЬ НЕ NULL 
		|			ТОГДА ГрафикиПлатежей.ДатаПлатежа
		|		ИНАЧЕ УсловияСделокРЕПОЧасть2.ДатаОплаты
		|	КОНЕЦ КАК ДатаПотокаДляОпределенияРыночнойСтавки,
		|	УсловияКредитныхИнструментов.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	ЕСТЬNULL(Активы.ДоВостребования, ЛОЖЬ) КАК ДоВостребования,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ВариантРасчетаСрокаДляОтбораРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаСрокаДепозитныхВкладов.ОтРазмещенияДоПогашения)
		|			ТОГДА Активы.ДатаРегистрации
		|		ИНАЧЕ _ПериодыАктивов.ДатаПроверкиНаРыночность
		|	КОНЕЦ КАК ДатаРазмещенияДляОтбораРыночнойСтавки,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ВариантРасчетаСрокаДляПримененияРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаСрокаДепозитныхВкладов.ОтРазмещенияДоПогашения)
		|			ТОГДА Активы.ДатаРегистрации
		|		ИНАЧЕ _ПериодыАктивов.ДатаПроверкиНаРыночность
		|	КОНЕЦ КАК ДатаРазмещенияДляПримененияРыночнойСтавки,
		|	ЕСТЬNULL(НеУчитывать580ПИОтнестиКорректировкуНаТело.Значение, ЛОЖЬ) КАК НеУчитывать580ПИОтнестиКорректировкуНаТело,
		|	ЕСТЬNULL(ПеречниОбъектов.Включен, ЛОЖЬ) КАК БанкВключенВ580П,
		|	_НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке) КАК ПоверкаСущественностиПоКлючевойСтавке,
		|	ВЫБОР
		|		КОГДА &ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов)
		|			ТОГДА ТекущиеУсловияКредитныхИнструментов.УчетныйАктив
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПериодыАктивов.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|				И _НастройкиАктивов.РассчитыватьЛинейноНерыночныеАктивы
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПериодыАктивов.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДепозитныеВкладыПоАС)
		|	КОНЕЦ КАК УчетныйАктив,
		|	ЕСТЬNULL(Активы.СделкаСЦентральнымКонтрагентом, ЛОЖЬ) КАК СделкаСЦентральнымКонтрагентом,
		|	ЕСТЬNULL(УсловияКредитныхИнструментов.СрокВозвратаДепозитаПоТребованиюКлиента, 0) КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ПОМЕСТИТЬ _УсловияАктива
		|ИЗ
		|	_ПериодыАктивов КАК _ПериодыАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_Активы.Актив КАК Актив,
		|			_Активы.Актив.ДоВостребования КАК ДоВостребования,
		|			ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Активы.Актив) = ТИП(Справочник.ДепозитныеВклады)
		|					ТОГДА ВЫРАЗИТЬ(_Активы.Актив КАК Справочник.ДепозитныеВклады).МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|				ИНАЧЕ _Активы.Актив.СделкаСЦентральнымКонтрагентом
		|			КОНЕЦ КАК СделкаСЦентральнымКонтрагентом,
		|			_Активы.СтавкаПоДоговору КАК СтавкаПоДоговору,
		|			_Активы.ДатаРегистрации КАК ДатаРегистрации,
		|			_Активы.ДатаПогашения КАК ДатаПогашения,
		|			_Активы.СрокОкончанияДолгосрочногоДоговораАренды КАК СрокОкончанияДолгосрочногоДоговораАренды
		|		ИЗ
		|			_Активы КАК _Активы) КАК Активы
		|		ПО (Активы.Актив = _ПериодыАктивов.Актив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _ПериодыАктивов.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПериодичностиОпределенияРыночнойСтавки КАК ПериодичностиОпределенияРыночнойСтавки
		|		ПО (_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки = ПериодичностиОпределенияРыночнойСтавки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК УсловияКредитныхИнструментов
		|		ПО _ПериодыАктивов.Актив = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И _ПериодыАктивов.ПериодУсловийАктива = УсловияКредитныхИнструментов.Период
		|			И _ПериодыАктивов.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов КАК ТекущиеУсловияКредитныхИнструментов
		|		ПО _ПериодыАктивов.Актив = ТекущиеУсловияКредитныхИнструментов.КредитныйИнструмент
		|			И _ПериодыАктивов.ПериодТекущихУсловийАктива = ТекущиеУсловияКредитныхИнструментов.Период
		|			И _ПериодыАктивов.ДатаНачалаДействияТекущихУсловий = ТекущиеУсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО КАК УсловияСделокРЕПОЧасть2
		|		ПО _ПериодыАктивов.Актив = УсловияСделокРЕПОЧасть2.СделкаРЕПО
		|			И _ПериодыАктивов.ПериодУсловийАктива = УсловияСделокРЕПОЧасть2.Период
		|			И (УсловияСделокРЕПОЧасть2.ЧастьСделкиРЕПО = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК НеУчитывать580ПИОтнестиКорректировкуНаТело
		|		ПО (НеУчитывать580ПИОтнестиКорректировкуНаТело.Свойство.Ключ = ""НеУчитывать580ПИОтнестиКорректировкуНаТело"")
		|			И (НеУчитывать580ПИОтнестиКорректировкуНаТело.Объект = _ПериодыАктивов.Актив)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК ПеречниОбъектов
		|		ПО (ПеречниОбъектов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЦБРФ))
		|			И (ПеречниОбъектов.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ПереченьКредитныхОрганизаций580П))
		|			И (ПеречниОбъектов.Объект = ВЫРАЗИТЬ(_ПериодыАктивов.Актив КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк)
		|			И _ПериодыАктивов.ПериодПеречниОбъектов = ПеречниОбъектов.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГрафикиПлатежейСрезПоследних.Основание КАК Основание,
		|			МАКСИМУМ(ГрафикиПлатежейСрезПоследних.ДатаПлатежа) КАК ДатаПлатежа
		|		ИЗ
		|			РегистрСведений.ГрафикиПлатежей.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ГрафикиПлатежейСрезПоследних
		|		ГДЕ
		|			ГрафикиПлатежейСрезПоследних.Действует
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрафикиПлатежейСрезПоследних.Основание) КАК ГрафикиПлатежей
		|		ПО _ПериодыАктивов.Актив = ГрафикиПлатежей.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Отбор.Актив КАК Актив,
		|	Отбор.ДатаПогашения КАК ДатаПогашения,
		|	Отбор.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|	СредневзвешенныеПроцентныеСтавки.Период КАК Период,
		|	СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|	СредневзвешенныеПроцентныеСтавки.Вид КАК Вид,
		|	СредневзвешенныеПроцентныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|	СредневзвешенныеПроцентныеСтавки.ВидШкалы КАК ВидШкалы,
		|	СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|	СредневзвешенныеПроцентныеСтавки.Валюта КАК Валюта,
		|	СредневзвешенныеПроцентныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _ДействующиеСредневзвешенныеСтавкиПоСрокуОтДатыРазмещенияДоДатыПотока
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыАктивов.Актив КАК Актив,
		|			_УсловияАктива.ДатаПогашения КАК ДатаПогашения,
		|			_ПериодыАктивов.ДатаПроверкиНаРыночность КАК ДатаПроверкиНаРыночность,
		|			_НастройкиАктивов.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|			_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки КАК ВидСредневзвешеннойРыночнойСтавки,
		|			_НастройкиАктивов.ГруппаБанков КАК ГруппаБанков,
		|			_НастройкиАктивов.ВидШкалы КАК ВидШкалы,
		|			_НастройкиАктивов.Валюта КАК Валюта,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|			МАКСИМУМ(СредневзвешенныеПроцентныеСтавки.Период) КАК Период
		|		ИЗ
		|			_ПериодыАктивов КАК _ПериодыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _ПериодыАктивов.Актив = _НастройкиАктивов.Актив
		|				ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАктива КАК _УсловияАктива
		|				ПО _ПериодыАктивов.Актив = _УсловияАктива.Актив
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|				ПО _ПериодыАктивов.ДатаПроверкиНаРыночность >= СредневзвешенныеПроцентныеСтавки.Период
		|					И _ПериодыАктивов.ДатаПроверкиНаРыночность >= СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца
		|					И (_НастройкиАктивов.ГруппаБанков = СредневзвешенныеПроцентныеСтавки.ГруппаБанков)
		|					И (_НастройкиАктивов.ВидШкалы = СредневзвешенныеПроцентныеСтавки.ВидШкалы)
		|					И (_НастройкиАктивов.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|					И (_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки = СредневзвешенныеПроцентныеСтавки.Вид)
		|					И (ВЫБОР
		|						КОГДА _НастройкиАктивов.ВидШкалы = ЗНАЧЕНИЕ(Перечисление.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Свернутая)
		|							ТОГДА ВЫБОР
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 1) > _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки
		|											ИЛИ _УсловияАктива.ДоВостребования
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До1ГодаВключаяДоВостребования)
		|									ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше1Года)
		|								КОНЕЦ
		|						КОГДА _НастройкиАктивов.ВидШкалы = ЗНАЧЕНИЕ(Перечисление.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Развернутая)
		|							ТОГДА ВЫБОР
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки, ДЕНЬ) <= 30
		|											ИЛИ _УсловияАктива.ДоВостребования
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До30ДнейВключаяДоВостребования)
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки, ДЕНЬ) <= 90
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От31До90Дней)
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки, ДЕНЬ) <= 180
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От91До180Дней)
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 1) >= _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От181ДняДо1Года)
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 3) >= _УсловияАктива.ДатаПотокаДляОпределенияРыночнойСтавки
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От1ГодаДо3Лет)
		|									ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше3Лет)
		|								КОНЕЦ
		|					КОНЕЦ = СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы)
		|		ГДЕ
		|			НЕ _УсловияАктива.ПоверкаСущественностиПоКлючевойСтавке
		|			И НЕ _НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки ССЫЛКА Справочник.БиржевыеИндексы
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыАктивов.Актив,
		|			_УсловияАктива.ДатаПогашения,
		|			_ПериодыАктивов.ДатаПроверкиНаРыночность,
		|			_НастройкиАктивов.ВариантПолученияКлючевойСтавки,
		|			_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки,
		|			_НастройкиАктивов.ГруппаБанков,
		|			_НастройкиАктивов.ВидШкалы,
		|			_НастройкиАктивов.Валюта,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца) КАК Отбор
		|		ПО (Отбор.ВидСредневзвешеннойРыночнойСтавки = СредневзвешенныеПроцентныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = СредневзвешенныеПроцентныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = СредневзвешенныеПроцентныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|			И (Отбор.НачалоРасчетногоМесяца = СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца)
		|			И (Отбор.Период = СредневзвешенныеПроцентныеСтавки.Период)
		|ГДЕ
		|	СредневзвешенныеПроцентныеСтавки.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействующиеСредневзвешенныеСтавки.Актив КАК Актив,
		|	_ДействующиеСредневзвешенныеСтавки.ДатаПогашения КАК ДатаПогашения,
		|	_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца КАК ПериодСреднерыночнойСтавки,
		|	_ДействующиеСредневзвешенныеСтавки.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|	_ДействующиеСредневзвешенныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	_ДействующиеСредневзвешенныеСтавки.Период КАК ДатаПубликацииСреднерыночнойСтавки,
		|	_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы
		|ПОМЕСТИТЬ _СреднерыночныеСтавки
		|ИЗ
		|	_ДействующиеСредневзвешенныеСтавкиПоСрокуОтДатыРазмещенияДоДатыПотока КАК _ДействующиеСредневзвешенныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДействующиеСредневзвешенныеСтавки.Актив КАК Актив,
		|			_ДействующиеСредневзвешенныеСтавки.ДатаПогашения КАК ДатаПогашения,
		|			_ДействующиеСредневзвешенныеСтавки.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|			_ДействующиеСредневзвешенныеСтавки.Вид КАК Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы КАК ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта КАК Валюта,
		|			МАКСИМУМ(_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца) КАК НачалоРасчетногоМесяца
		|		ИЗ
		|			_ДействующиеСредневзвешенныеСтавкиПоСрокуОтДатыРазмещенияДоДатыПотока КАК _ДействующиеСредневзвешенныеСтавки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДействующиеСредневзвешенныеСтавки.Актив,
		|			_ДействующиеСредневзвешенныеСтавки.ДатаПогашения,
		|			_ДействующиеСредневзвешенныеСтавки.ВариантПолученияКлючевойСтавки,
		|			_ДействующиеСредневзвешенныеСтавки.Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта) КАК Отбор
		|		ПО (Отбор.Актив = _ДействующиеСредневзвешенныеСтавки.Актив)
		|			И (Отбор.ДатаПогашения = _ДействующиеСредневзвешенныеСтавки.ДатаПогашения)
		|			И (Отбор.ВариантПолученияКлючевойСтавки = _ДействующиеСредневзвешенныеСтавки.ВариантПолученияКлючевойСтавки)
		|			И (Отбор.Вид = _ДействующиеСредневзвешенныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = _ДействующиеСредневзвешенныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = _ДействующиеСредневзвешенныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = _ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = _ДействующиеСредневзвешенныеСтавки.Валюта)
		|			И (Отбор.НачалоРасчетногоМесяца = _ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ПериодыАктивов.Актив,
		|	_УсловияАктива.ДатаПогашения,
		|	_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыБиржевыхИндексов.Доходность)
		|			ТОГДА ЕСТЬNULL(ЗначенияБиржевыхИндексов.YIELD, 0)
		|		ИНАЧЕ ЕСТЬNULL(ЗначенияБиржевыхИндексов.CLOSE, 0)
		|	КОНЕЦ,
		|	ЗначенияБиржевыхИндексов.Период,
		|	NULL
		|ИЗ
		|	_ПериодыАктивов КАК _ПериодыАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _ПериодыАктивов.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАктива КАК _УсловияАктива
		|		ПО _ПериодыАктивов.Актив = _УсловияАктива.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО (_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки = ЗначенияБиржевыхИндексов.БиржевойИндекс)
		|			И (ВЫБОР
		|				КОГДА _УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки >= &ТекущийДень
		|					ТОГДА &ПоследнийТорговыйДень
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ДЕНЬ)
		|			КОНЕЦ = ЗначенияБиржевыхИндексов.Период)
		|ГДЕ
		|	_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки ССЫЛКА Справочник.БиржевыеИндексы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СреднерыночныеСтавки.Актив КАК Актив,
		|	_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|	КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.ЗначениеПоказателя КАК КлючеваяСтавка,
		|	ПериодыКлючевыхСтавок.ПериодКлючевойСтавки КАК ПериодКлючевойСтавки,
		|	_СреднерыночныеСтавки.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки
		|ПОМЕСТИТЬ _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц
		|ИЗ
		|	_СреднерыночныеСтавки КАК _СреднерыночныеСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СреднерыночныеСтавки.Актив КАК Актив,
		|			_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|			МАКСИМУМ(КлючевыеСтавкиЦБРФ.ДатаЗначения) КАК ПериодКлючевойСтавки
		|		ИЗ
		|			_СреднерыночныеСтавки КАК _СреднерыночныеСтавки
		|				ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФ
		|				ПО (НАЧАЛОПЕРИОДА(_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки, МЕСЯЦ) > КлючевыеСтавкиЦБРФ.ДатаЗначения)
		|		ГДЕ
		|			_СреднерыночныеСтавки.ВариантПолученияКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам.СредняяЗаМесяц)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СреднерыночныеСтавки.Актив,
		|			_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_СреднерыночныеСтавки.Актив,
		|			_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки,
		|			КлючевыеСтавкиЦБРФ.ДатаЗначения
		|		ИЗ
		|			_СреднерыночныеСтавки КАК _СреднерыночныеСтавки
		|				ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФ
		|				ПО (НАЧАЛОПЕРИОДА(_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки, МЕСЯЦ) = НАЧАЛОПЕРИОДА(КлючевыеСтавкиЦБРФ.ДатаЗначения, МЕСЯЦ))
		|		ГДЕ
		|			_СреднерыночныеСтавки.ВариантПолученияКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам.СредняяЗаМесяц)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_СреднерыночныеСтавки.Актив,
		|			_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки,
		|			МАКСИМУМ(КлючевыеСтавкиЦБРФ.ДатаЗначения)
		|		ИЗ
		|			_СреднерыночныеСтавки КАК _СреднерыночныеСтавки
		|				ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФ
		|				ПО (КОНЕЦПЕРИОДА(_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки, МЕСЯЦ) >= КлючевыеСтавкиЦБРФ.ДатаЗначения)
		|		ГДЕ
		|			_СреднерыночныеСтавки.ВариантПолученияКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам.НаКонецМесяца)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СреднерыночныеСтавки.Актив,
		|			_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки) КАК ПериодыКлючевыхСтавок
		|		ПО _СреднерыночныеСтавки.Актив = ПериодыКлючевыхСтавок.Актив
		|			И _СреднерыночныеСтавки.ПериодСреднерыночнойСтавки = ПериодыКлючевыхСтавок.ПериодСреднерыночнойСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки
		|		ПО (ПериодыКлючевыхСтавок.ПериодКлючевойСтавки = КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.ДатаЗначения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.Актив КАК Актив,
		|	_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 0
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(4, 0))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 1
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(5, 1))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 2
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(6, 2))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 3
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(7, 3))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 4
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(8, 4))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 5
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(9, 5))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 6
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(10, 6))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 7
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(11, 7))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 8
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(12, 8))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 9
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(13, 9))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 10
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(14, 10))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 11
		|			ТОГДА ВЫРАЗИТЬ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК ЧИСЛО(15, 11))
		|	КОНЕЦ КАК КлючеваяСтавка
		|ПОМЕСТИТЬ _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Актив КАК Актив,
		|		ВложенныйЗапрос.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|		СУММА(ВложенныйЗапрос.КлючеваяСтавка * РАЗНОСТЬДАТ(ВложенныйЗапрос.НачалоПериодаКлючевойСтавки, ВложенныйЗапрос.КонецПериодаКлючевойСтавки, ДЕНЬ) / ДЕНЬ(КОНЕЦПЕРИОДА(ВложенныйЗапрос.ПериодСреднерыночнойСтавки, МЕСЯЦ))) КАК КлючеваяСтавка
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВложенныйЗапрос.Актив КАК Актив,
		|			ВложенныйЗапрос.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|			ВложенныйЗапрос.КлючеваяСтавка КАК КлючеваяСтавка,
		|			ВЫБОР
		|				КОГДА ВложенныйЗапрос.НачалоПериодаКлючевойСтавки < НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ПериодСреднерыночнойСтавки, МЕСЯЦ)
		|						ИЛИ ВложенныйЗапрос.ВариантПолученияКлючевойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам.НаКонецМесяца)
		|					ТОГДА НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ПериодСреднерыночнойСтавки, МЕСЯЦ)
		|				ИНАЧЕ ВложенныйЗапрос.НачалоПериодаКлючевойСтавки
		|			КОНЕЦ КАК НачалоПериодаКлючевойСтавки,
		|			ЕСТЬNULL(ВложенныйЗапрос.КонецПериодаКлючевойСтавки, НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ПериодСреднерыночнойСтавки, МЕСЯЦ, 1), МЕСЯЦ)) КАК КонецПериодаКлючевойСтавки
		|		ИЗ
		|			(ВЫБРАТЬ
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.Актив КАК Актив,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.КлючеваяСтавка КАК КлючеваяСтавка,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодКлючевойСтавки КАК НачалоПериодаКлючевойСтавки,
		|				МИНИМУМ(_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц1.ПериодКлючевойСтавки) КАК КонецПериодаКлючевойСтавки,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки
		|			ИЗ
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц КАК _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц
		|					ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц КАК _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц1
		|					ПО _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.Актив = _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц1.Актив
		|						И _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодСреднерыночнойСтавки = _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц1.ПериодСреднерыночнойСтавки
		|						И _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодКлючевойСтавки < _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц1.ПериодКлючевойСтавки
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.Актив,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодСреднерыночнойСтавки,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.КлючеваяСтавка,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ПериодКлючевойСтавки,
		|				_КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавкиЗаМесяц.ВариантПолученияКлючевойСтавки) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Актив,
		|		ВложенныйЗапрос.ПериодСреднерыночнойСтавки) КАК _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.Актив = _НастройкиАктивов.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РасчетныеСреднерыночныеСтавки.Актив КАК Актив,
		|	_РасчетныеСреднерыночныеСтавки.ДатаПогашения КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 0
		|			ТОГДА _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 1
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(5, 1))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 2
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(6, 2))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 3
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(7, 3))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 4
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(8, 4))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 5
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(9, 5))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 6
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(10, 6))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 7
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(11, 7))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 8
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(12, 8))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 9
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(13, 9))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 10
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(14, 10))
		|		КОГДА _РасчетныеСреднерыночныеСтавки.ТочностьРыночнойСтавки = 11
		|			ТОГДА ВЫРАЗИТЬ(_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка КАК ЧИСЛО(15, 11))
		|	КОНЕЦ КАК СреднерыночнаяСтавка,
		|	_РасчетныеСреднерыночныеСтавки.КлючеваяСтавкаНаДатуРыночной КАК КлючеваяСтавкаНаДатуРыночной,
		|	_РасчетныеСреднерыночныеСтавки.КлючеваяСтавкаНаДатуРасчета КАК КлючеваяСтавкаНаДатуРасчета,
		|	_РасчетныеСреднерыночныеСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|	_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавкаНаДату КАК СреднерыночнаяСтавкаНаДату,
		|	_РасчетныеСреднерыночныеСтавки.ДатаПубликацииСреднерыночнойСтавки КАК ДатаПубликацииСреднерыночнойСтавки,
		|	_РасчетныеСреднерыночныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы
		|ПОМЕСТИТЬ _РасчетныеСреднерыночныеСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СреднерыночныеСтавки.Актив КАК Актив,
		|		_СреднерыночныеСтавки.ДатаПогашения КАК ДатаПогашения,
		|		ВЫБОР
		|			КОГДА _НастройкиАктивов.ИгнорироватьИзменениеКлючевойСтавки
		|					ИЛИ _НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки ССЫЛКА Справочник.БиржевыеИндексы
		|					ИЛИ НАЧАЛОПЕРИОДА(_ПериодыАктивов.ДатаПроверкиНаРыночность, МЕСЯЦ) = НАЧАЛОПЕРИОДА(_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки, МЕСЯЦ)
		|				ТОГДА _СреднерыночныеСтавки.ПроцентнаяСтавка
		|			КОГДА _НастройкиАктивов.ВариантыРасчетаРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО.ВычестьДобавить)
		|				ТОГДА _СреднерыночныеСтавки.ПроцентнаяСтавка - КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка + КлючевыеСтавкиЦБРФНаДатуРасчета.ЗначениеПоказателя
		|			КОГДА _НастройкиАктивов.ВариантыРасчетаРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО.ПоделитьУмножить)
		|				ТОГДА _СреднерыночныеСтавки.ПроцентнаяСтавка * КлючевыеСтавкиЦБРФНаДатуРасчета.ЗначениеПоказателя / КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка
		|		КОНЕЦ КАК СреднерыночнаяСтавка,
		|		КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.КлючеваяСтавка КАК КлючеваяСтавкаНаДатуРыночной,
		|		КлючевыеСтавкиЦБРФНаДатуРасчета.ЗначениеПоказателя КАК КлючеваяСтавкаНаДатуРасчета,
		|		_СреднерыночныеСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|		_СреднерыночныеСтавки.ПроцентнаяСтавка КАК СреднерыночнаяСтавкаНаДату,
		|		_СреднерыночныеСтавки.ДатаПубликацииСреднерыночнойСтавки КАК ДатаПубликацииСреднерыночнойСтавки,
		|		_СреднерыночныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|		_НастройкиАктивов.ТочностьРыночнойСтавки КАК ТочностьРыночнойСтавки
		|	ИЗ
		|		_СреднерыночныеСтавки КАК _СреднерыночныеСтавки
		|			ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|			ПО _СреднерыночныеСтавки.Актив = _НастройкиАктивов.Актив
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки КАК КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки
		|			ПО _СреднерыночныеСтавки.Актив = КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.Актив
		|				И _СреднерыночныеСтавки.ПериодСреднерыночнойСтавки = КлючевыеСтавкиЦБРФНаДатуСреднерыночнойСтавки.ПериодСреднерыночнойСтавки
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыАктивов КАК _ПериодыАктивов
		|			ПО _СреднерыночныеСтавки.Актив = _ПериодыАктивов.Актив
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФНаДатуРасчета
		|			ПО (_ПериодыАктивов.ПериодКлючевойСтавки = КлючевыеСтавкиЦБРФНаДатуРасчета.ДатаЗначения)) КАК _РасчетныеСреднерыночныеСтавки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Отбор.Актив КАК Актив,
		|	СредневзвешенныеПроцентныеСтавки.Период КАК Период,
		|	СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|	СредневзвешенныеПроцентныеСтавки.Вид КАК Вид,
		|	СредневзвешенныеПроцентныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|	СредневзвешенныеПроцентныеСтавки.ВидШкалы КАК ВидШкалы,
		|	СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|	СредневзвешенныеПроцентныеСтавки.Валюта КАК Валюта,
		|	СредневзвешенныеПроцентныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _ДействующиеСредневзвешенныеСтавкиДляСрокаОтДатыРазмещенияДоДатыПогашения
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыАктивов.Актив КАК Актив,
		|			_ПериодыАктивов.ДатаПроверкиНаРыночность КАК ДатаПроверкиНаРыночность,
		|			_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки КАК ВидСредневзвешеннойРыночнойСтавки,
		|			_НастройкиАктивов.ГруппаБанков КАК ГруппаБанков,
		|			_НастройкиАктивов.ВидШкалы КАК ВидШкалы,
		|			_НастройкиАктивов.Валюта КАК Валюта,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|			МАКСИМУМ(СредневзвешенныеПроцентныеСтавки.Период) КАК Период
		|		ИЗ
		|			_ПериодыАктивов КАК _ПериодыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|				ПО _ПериодыАктивов.Актив = _НастройкиАктивов.Актив
		|				ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАктива КАК _УсловияАктива
		|				ПО _ПериодыАктивов.Актив = _УсловияАктива.Актив
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|				ПО _ПериодыАктивов.ДатаПроверкиНаРыночность >= СредневзвешенныеПроцентныеСтавки.Период
		|					И _ПериодыАктивов.ДатаПроверкиНаРыночность >= СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца
		|					И (_НастройкиАктивов.ГруппаБанков = СредневзвешенныеПроцентныеСтавки.ГруппаБанков)
		|					И (_НастройкиАктивов.ВидШкалы = СредневзвешенныеПроцентныеСтавки.ВидШкалы)
		|					И (_НастройкиАктивов.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|					И (_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки = СредневзвешенныеПроцентныеСтавки.Вид)
		|					И (ВЫБОР
		|						КОГДА _НастройкиАктивов.ВидШкалы = ЗНАЧЕНИЕ(Перечисление.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Свернутая)
		|							ТОГДА ВЫБОР
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 1) > _УсловияАктива.ДатаПогашения
		|											ИЛИ _УсловияАктива.ДоВостребования
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До1ГодаВключаяДоВостребования)
		|									ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше1Года)
		|								КОНЕЦ
		|						КОГДА _НастройкиАктивов.ВидШкалы = ЗНАЧЕНИЕ(Перечисление.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Развернутая)
		|							ТОГДА ВЫБОР
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПогашения, ДЕНЬ) <= 30
		|											ИЛИ _УсловияАктива.ДоВостребования
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До30ДнейВключаяДоВостребования)
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПогашения, ДЕНЬ) <= 90
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От31До90Дней)
		|									КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПогашения, ДЕНЬ) <= 180
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От91До180Дней)
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 1) > _УсловияАктива.ДатаПогашения
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От181ДняДо1Года)
		|									КОГДА ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, ГОД, 3) > _УсловияАктива.ДатаПогашения
		|										ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От1ГодаДо3Лет)
		|									ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше3Лет)
		|								КОНЕЦ
		|					КОНЕЦ = СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы)
		|		ГДЕ
		|			НЕ _УсловияАктива.ПоверкаСущественностиПоКлючевойСтавке
		|			И НЕ _НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки ССЫЛКА Справочник.БиржевыеИндексы
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПериодыАктивов.Актив,
		|			_ПериодыАктивов.ДатаПроверкиНаРыночность,
		|			_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки,
		|			_НастройкиАктивов.ГруппаБанков,
		|			_НастройкиАктивов.ВидШкалы,
		|			_НастройкиАктивов.Валюта,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца) КАК Отбор
		|		ПО (Отбор.ВидСредневзвешеннойРыночнойСтавки = СредневзвешенныеПроцентныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = СредневзвешенныеПроцентныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = СредневзвешенныеПроцентныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|			И (Отбор.НачалоРасчетногоМесяца = СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца)
		|			И (Отбор.Период = СредневзвешенныеПроцентныеСтавки.Период)
		|ГДЕ
		|	СредневзвешенныеПроцентныеСтавки.Действует
		|	И СредневзвешенныеПроцентныеСтавки.ПроцентнаяСтавка <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействующиеСредневзвешенныеСтавки.Актив КАК Актив,
		|	_ДействующиеСредневзвешенныеСтавки.Вид КАК ВидСредневзвешеннойРыночнойСтавки,
		|	_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца КАК ПериодСреднерыночнойСтавки,
		|	_ДействующиеСредневзвешенныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	0 КАК КвадратРазницыСтавок
		|ПОМЕСТИТЬ _РасчетныеСреднерыночныеСтавкиЗаПериод
		|ИЗ
		|	_ДействующиеСредневзвешенныеСтавкиДляСрокаОтДатыРазмещенияДоДатыПогашения КАК _ДействующиеСредневзвешенныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _ДействующиеСредневзвешенныеСтавки.Актив = _НастройкиАктивов.Актив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДействующиеСредневзвешенныеСтавки.Актив КАК Актив,
		|			_ДействующиеСредневзвешенныеСтавки.Вид КАК Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы КАК ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта КАК Валюта,
		|			МАКСИМУМ(_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца) КАК НачалоРасчетногоМесяца
		|		ИЗ
		|			_ДействующиеСредневзвешенныеСтавкиДляСрокаОтДатыРазмещенияДоДатыПогашения КАК _ДействующиеСредневзвешенныеСтавки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДействующиеСредневзвешенныеСтавки.Актив,
		|			_ДействующиеСредневзвешенныеСтавки.Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта) КАК Отбор
		|		ПО (Отбор.Актив = _ДействующиеСредневзвешенныеСтавки.Актив)
		|			И (Отбор.Вид = _ДействующиеСредневзвешенныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = _ДействующиеСредневзвешенныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = _ДействующиеСредневзвешенныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = _ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = _ДействующиеСредневзвешенныеСтавки.Валюта)
		|			И (_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца МЕЖДУ ВЫБОР
		|				КОГДА _НастройкиАктивов.ВариантОтклоненияОтРыночнойСтавки В (ЗНАЧЕНИЕ(Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки), ЗНАЧЕНИЕ(Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.СтандартноеОтклонениеПоГенеральнойСовокупности))
		|					ТОГДА ДОБАВИТЬКДАТЕ(Отбор.НачалоРасчетногоМесяца, МЕСЯЦ, 1 - _НастройкиАктивов.ПериодНаблюдаемыхПроцентныхСтавок)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(Отбор.НачалоРасчетногоМесяца, МЕСЯЦ, -11)
		|			КОНЕЦ И Отбор.НачалоРасчетногоМесяца)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ПериодыАктивов.Актив,
		|	_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки,
		|	ЗначенияБиржевыхИндексов.Период,
		|	ВЫБОР
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыБиржевыхИндексов.Доходность)
		|			ТОГДА ЕСТЬNULL(ЗначенияБиржевыхИндексов.YIELD, 0)
		|		ИНАЧЕ ЕСТЬNULL(ЗначенияБиржевыхИндексов.CLOSE, 0)
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	_ПериодыАктивов КАК _ПериодыАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _ПериодыАктивов.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАктива КАК _УсловияАктива
		|		ПО _ПериодыАктивов.Актив = _УсловияАктива.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО (_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки = ЗначенияБиржевыхИндексов.БиржевойИндекс)
		|			И (ЗначенияБиржевыхИндексов.Период МЕЖДУ ДОБАВИТЬКДАТЕ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, МЕСЯЦ, -_НастройкиАктивов.ПериодНаблюдаемыхПроцентныхСтавок) И _УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки)
		|ГДЕ
		|	_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки ССЫЛКА Справочник.БиржевыеИндексы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	KV.Актив КАК Актив,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА _НастройкиАктивов.ВариантРасчетаКоэффициентаВолатильности = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаКоэффициентаВолатильности.ОтношениеРазницыСтавокКМинимальнойСтавке)
		|				ТОГДА (KV.Rmax - KV.Rmin) / KV.Rmin
		|			КОГДА _НастройкиАктивов.ВариантРасчетаКоэффициентаВолатильности = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаКоэффициентаВолатильности.ОтношениеРазницыСтавокКСуммеСтавок)
		|				ТОГДА (KV.Rmax - KV.Rmin) / (KV.Rmax + KV.Rmin)
		|			КОГДА _НастройкиАктивов.ВариантРасчетаКоэффициентаВолатильности = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаКоэффициентаВолатильности.ОтношениеРазницыСтавокКПоловинеСуммыСтавок)
		|				ТОГДА (KV.Rmax - KV.Rmin) / ((KV.Rmax + KV.Rmin) / 2)
		|		КОНЕЦ КАК ЧИСЛО(19, 6)) КАК Коэффициент,
		|	KV.Rmin КАК МинимальнаяСредневзвешеннаяСтавка,
		|	KV.Rmax КАК МаксимальнаяСредневзвешеннаяСтавка
		|ПОМЕСТИТЬ _КоэффициентыВолатильностиРычнонойСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РасчетныеСреднерыночныеСтавкиЗа12Месяцев.Актив КАК Актив,
		|		МИНИМУМ(_РасчетныеСреднерыночныеСтавкиЗа12Месяцев.ПроцентнаяСтавка) КАК Rmin,
		|		МАКСИМУМ(_РасчетныеСреднерыночныеСтавкиЗа12Месяцев.ПроцентнаяСтавка) КАК Rmax
		|	ИЗ
		|		_РасчетныеСреднерыночныеСтавкиЗаПериод КАК _РасчетныеСреднерыночныеСтавкиЗа12Месяцев
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_РасчетныеСреднерыночныеСтавкиЗа12Месяцев.Актив) КАК KV
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО KV.Актив = _НастройкиАктивов.Актив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.Актив КАК Актив,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 0
		|			ТОГДА КлючевыеСтавкиЦБРФ.ЗначениеПоказателя
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 1
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(5, 1))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 2
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(6, 2))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 3
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(7, 3))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 4
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(8, 4))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 5
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(9, 5))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 6
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(10, 6))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 7
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(11, 7))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 8
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(12, 8))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 9
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(13, 9))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 10
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(14, 10))
		|		КОГДА _НастройкиАктивов.ТочностьРыночнойСтавки = 11
		|			ТОГДА ВЫРАЗИТЬ(КлючевыеСтавкиЦБРФ.ЗначениеПоказателя КАК ЧИСЛО(15, 11))
		|	КОНЕЦ КАК КлючеваяСтавкаЦБРФ
		|ПОМЕСТИТЬ _СреднерыночныеПоКлючевойСтавке
		|ИЗ
		|	_Активы КАК _Активы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыАктивов КАК _ПериодыАктивов
		|		ПО _Активы.Актив = _ПериодыАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КлючевыеСтавкиЦБРФ КАК КлючевыеСтавкиЦБРФ
		|		ПО (_ПериодыАктивов.ПериодКлючевойСтавки = КлючевыеСтавкиЦБРФ.ДатаЗначения)
		|ГДЕ
		|	_НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Активы.Актив КАК Актив,
		|	_Активы.ВидАктива КАК ВидАктива,
		|	_Активы.Номинал КАК Номинал,
		|	_Активы.Проценты КАК Проценты,
		|	_Активы.Задолженность КАК Задолженность,
		|	_Активы.Комиссия КАК Комиссия,
		|	_Активы.ПервоначальноеПризнаниеДепозитаИлиМНО КАК ПервоначальноеПризнаниеДепозитаИлиМНО,
		|	0 КАК ПроцентыЭСП,
		|	_Активы.ЭтоДенежныйПоток КАК ЭтоДенежныйПоток,
		|	_Активы.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаПриДосрочномЗакрытии,
		|	_НастройкиАктивов.Валюта КАК Валюта,
		|	_НастройкиАктивов.ГруппаБанков КАК ГруппаБанков,
		|	_НастройкиАктивов.ВариантРасчетаСрокаДляОтбораРыночнойСтавки КАК ВариантРасчетаСрокаДляОтбораРыночнойСтавки,
		|	_НастройкиАктивов.ВидШкалы КАК ВидШкалы,
		|	_НастройкиАктивов.ИгнорироватьИзменениеКлючевойСтавки КАК ИгнорироватьИзменениеКлючевойСтавки,
		|	_НастройкиАктивов.ВариантПолученияКлючевойСтавки КАК ВариантПолученияКлючевойСтавки,
		|	_НастройкиАктивов.ВариантыРасчетаРыночнойСтавки КАК ВариантыРасчетаРыночнойСтавки,
		|	_НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки КАК ПроцентСущественностиОтклоненияОтРыночнойСтавки,
		|	_НастройкиАктивов.МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки КАК МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения КАК ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки, _УсловияАктива.ДатаПогашения, ДЕНЬ) < _НастройкиАктивов.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета
		|				ИЛИ _НастройкиАктивов.РассчитыватьЛинейноНерыночныеАктивы
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ПоДепозиту)
		|		ИНАЧЕ _НастройкиАктивов.ВидСтавкиДляПроверкиНаРыночность
		|	КОНЕЦ КАК ВидСтавкиДляПроверкиНаРыночность,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.РассчитыватьЛинейноНерыночныеАктивы
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ПоДепозиту)
		|		ИНАЧЕ _НастройкиАктивов.ВидСтавкиДляРасчетаДисконтированногоПотока
		|	КОНЕЦ КАК ВидСтавкиДляРасчетаДисконтированногоПотока,
		|	_НастройкиАктивов.ТочностьЭСП КАК ТочностьЭСП,
		|	_НастройкиАктивов.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета КАК ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета,
		|	_НастройкиАктивов.ТочностьЭСПНаДатуРасчета КАК ТочностьЭСПНаДатуРасчета,
		|	_НастройкиАктивов.ТочностьРыночнойСтавки КАК ТочностьРыночнойСтавки,
		|	_НастройкиАктивов.ТочностьГраницДиапазонаРыночнойСтавки КАК ТочностьГраницДиапазонаРыночнойСтавки,
		|	_НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах КАК ПроцентСущественностиВПроцентныхПунктах,
		|	_НастройкиАктивов.ПериодичностьОпределенияРыночнойСтавки КАК ПериодичностьОпределенияРыночнойСтавки,
		|	_НастройкиАктивов.ИсточникТаблицыСоответствияРейтингов КАК ИсточникТаблицыСоответствияРейтингов,
		|	_НастройкиАктивов.ОтклонениеКредитногоСпреда КАК ОтклонениеКредитногоСпреда,
		|	_НастройкиАктивов.ВариантОтклоненияОтРыночнойСтавки КАК ВариантОтклоненияОтРыночнойСтавки,
		|	_НастройкиАктивов.ВариантРасчетаКоэффициентаВолатильности КАК ВариантРасчетаКоэффициентаВолатильности,
		|	_НастройкиАктивов.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета КАК МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета,
		|	_НастройкиАктивов.МаксимальныйСрокАктиваДляИспользованияСхемы КАК МаксимальныйСрокАктиваДляИспользованияСхемы,
		|	_НастройкиАктивов.СхемаПроверкиСущественностиОтклонений КАК СхемаПроверкиСущественностиОтклонений,
		|	_НастройкиАктивов.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП КАК ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП,
		|	_НастройкиАктивов.ПроверкаНаРыночностьПоПеречнюЦБ580П
		|		И _УсловияАктива.БанкВключенВ580П КАК ПройденаПроверкаНаРыночностьПоПеречнюЦБ580П,
		|	_УсловияАктива.СтавкаПоДоговору КАК СтавкаПоДоговору,
		|	ВЫРАЗИТЬ(_УсловияАктива.СтавкаПоДоговору КАК ЧИСЛО(19, 12)) КАК ПроцентПоАктиву,
		|	_УсловияАктива.ДатаРегистрации КАК ДатаРегистрации,
		|	_УсловияАктива.ДатаПогашения КАК ДатаПогашения,
		|	_УсловияАктива.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_УсловияАктива.ДоВостребования КАК ДоВостребования,
		|	_УсловияАктива.ДатаРазмещенияДляОтбораРыночнойСтавки КАК ДатаРазмещенияДляОтбораРыночнойСтавки,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|			ТОГДА _СреднерыночныеПоКлючевойСтавке.КлючеваяСтавкаЦБРФ
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|			ТОГДА ЕСТЬNULL(_СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса, 0)
		|		ИНАЧЕ _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка
		|	КОНЕЦ КАК СреднерыночнаяСтавка,
		|	_РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавкаНаДату КАК СреднерыночнаяСтавкаНаДату,
		|	_РасчетныеСреднерыночныеСтавки.ДатаПубликацииСреднерыночнойСтавки КАК ДатаПубликацииСреднерыночнойСтавки,
		|	_РасчетныеСреднерыночныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|	_РасчетныеСреднерыночныеСтавки.ПериодСреднерыночнойСтавки КАК ПериодСреднерыночнойСтавки,
		|	_РасчетныеСреднерыночныеСтавки.КлючеваяСтавкаНаДатуРыночной КАК КлючеваяСтавкаНаДатуРыночной,
		|	_РасчетныеСреднерыночныеСтавки.КлючеваяСтавкаНаДатуРасчета КАК КлючеваяСтавкаНаДатуРасчета,
		|	_ПериодыАктивов.ПериодКлючевойСтавки КАК ПериодКлючевойСтавки,
		|	РАЗНОСТЬДАТ(_УсловияАктива.ДатаРазмещенияДляПримененияРыночнойСтавки, _УсловияАктива.ДатаПогашения, ДЕНЬ) КАК СрокАктиваДляПримененияРыночнойСтавки,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|				И _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА _СреднерыночныеПоКлючевойСтавке.КлючеваяСтавкаЦБРФ - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|			ТОГДА _СреднерыночныеПоКлючевойСтавке.КлючеваяСтавкаЦБРФ * (1 - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|				И _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА ЕСТЬNULL(_СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса, 0) - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|			ТОГДА ЕСТЬNULL(_СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса, 0) * (1 - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|		КОГДА _НастройкиАктивов.ВариантОтклоненияОтРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки)
		|			ТОГДА _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка * (1 - _КоэффициентыВолатильностиРычнонойСтавки.Коэффициент)
		|		КОГДА _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		ИНАЧЕ _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка * (1 - _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|	КОНЕЦ КАК НижняяГраницаСреднерыночнойСтавки,
		|	ВЫБОР
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|				И _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА _СреднерыночныеПоКлючевойСтавке.КлючеваяСтавкаЦБРФ + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке)
		|			ТОГДА _СреднерыночныеПоКлючевойСтавке.КлючеваяСтавкаЦБРФ * (1 + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|				И _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА ЕСТЬNULL(_СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса, 0) + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		КОГДА _НастройкиАктивов.СхемаПроверкиСущественностиОтклонений = ЗНАЧЕНИЕ(Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
		|			ТОГДА ЕСТЬNULL(_СделкиРЕПОДляОценкиПоШкалеИндексов.ЗначениеИндекса, 0) * (1 + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|		КОГДА _НастройкиАктивов.ВариантОтклоненияОтРыночнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки)
		|			ТОГДА _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка * (1 + _КоэффициентыВолатильностиРычнонойСтавки.Коэффициент)
		|		КОГДА _НастройкиАктивов.ПроцентСущественностиВПроцентныхПунктах
		|			ТОГДА _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки
		|		ИНАЧЕ _РасчетныеСреднерыночныеСтавки.СреднерыночнаяСтавка * (1 + _НастройкиАктивов.ПроцентСущественностиОтклоненияОтРыночнойСтавки / 100)
		|	КОНЕЦ КАК ВерхняяГраницаСреднерыночнойСтавки,
		|	0 КАК БезрисковаяСтавкаДоходности,
		|	0 КАК Медиана,
		|	0 КАК МинимумКредитногоСпреда,
		|	0 КАК МаксимумКредитногоСпреда,
		|	_КоэффициентыВолатильностиРычнонойСтавки.Коэффициент КАК КоэффициентыВолатильностиРычнонойСтавки,
		|	_КоэффициентыВолатильностиРычнонойСтавки.МинимальнаяСредневзвешеннаяСтавка КАК МинимальнаяСредневзвешеннаяСтавка,
		|	_КоэффициентыВолатильностиРычнонойСтавки.МаксимальнаяСредневзвешеннаяСтавка КАК МаксимальнаяСредневзвешеннаяСтавка,
		|	_НастройкиАктивов.НеПоказыватьОтрицательныеПроценты КАК НеПоказыватьОтрицательныеПроценты,
		|	_НастройкиАктивов.ПериодНаблюдаемыхПроцентныхСтавок КАК ПериодНаблюдаемыхПроцентныхСтавок,
		|	_НастройкиАктивов.СмещениеСтандартногоОтклонения КАК СмещениеСтандартногоОтклонения,
		|	_УсловияАктива.СтавкаПоДоговору КАК СтавкаДляПроверкиНаРыночность,
		|	_УсловияАктива.НеУчитывать580ПИОтнестиКорректировкуНаТело КАК НеУчитывать580ПИОтнестиКорректировкуНаТело,
		|	_УсловияАктива.ДатаРазмещенияДляПримененияРыночнойСтавки КАК ДатаРазмещенияДляПримененияРыночнойСтавки,
		|	_ПериодыАктивов.ДатаПроверкиНаРыночность КАК ДатаПроверкиНаРыночность,
		|	_УсловияАктива.УчетныйАктив КАК УчетныйАктив,
		|	_НастройкиАктивов.Субъект КАК Субъект,
		|	_УсловияАктива.СделкаСЦентральнымКонтрагентом КАК СделкаСЦентральнымКонтрагентом,
		|	_НастройкиАктивов.РассчитыватьЛинейноНерыночныеАктивы КАК РассчитыватьЛинейноНерыночныеАктивы,
		|	_НастройкиАктивов.ПериодичностьОценки КАК ПериодичностьОценки,
		|	_НастройкиАктивов.ПериодичностьРасчетаКорректировкиЭСП КАК ПериодичностьРасчетаКорректировкиЭСП,
		|	_НастройкиАктивов.ИспользоватьНастройкиНаДатуРазмещенияАктива КАК ИспользоватьНастройкиНаДатуРазмещенияАктива,
		|	_НастройкиАктивов.ВариантРасчетаСрокаДляПримененияРыночнойСтавки КАК ВариантРасчетаСрокаДляПримененияРыночнойСтавки,
		|	_НастройкиАктивов.ВидСредневзвешеннойРыночнойСтавки КАК ВидСредневзвешеннойРыночнойСтавки,
		|	_НастройкиАктивов.ПроверкаНаРыночностьПоПеречнюЦБ580П КАК ПроверкаНаРыночностьПоПеречнюЦБ580П,
		|	_НастройкиАктивов.ВидКонтрагента КАК ВидКонтрагента,
		|	""Линейно"" КАК МетодРасчета,
		|	_ПериодыАктивов.ОписаниеДатыПроверкиНаРыночность КАК ОписаниеДатыПроверкиНаРыночность,
		|	_ПериодыАктивов.ОписаниеДатыКлючевойСтавки КАК ОписаниеДатыКлючевойСтавки,
		|	_НастройкиАктивов.ВариантПолученияДатыКлючевойСтавки КАК ВариантПолученияДатыКлючевойСтавки,
		|	ИСТИНА КАК СтавкаПризнанаРыночной,
		|	_УсловияАктива.СрокВозвратаДепозитаПоТребованиюКлиента КАК СрокВозвратаДепозитаПоТребованиюКлиента
		|ИЗ
		|	_Активы КАК _Активы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиАктивов КАК _НастройкиАктивов
		|		ПО _Активы.Актив = _НастройкиАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияАктива КАК _УсловияАктива
		|		ПО _Активы.Актив = _УсловияАктива.Актив
		|			И (_Активы.ДатаПогашения = _УсловияАктива.ДатаПогашения
		|				ИЛИ НЕ _Активы.ЭтоДенежныйПоток)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыАктивов КАК _ПериодыАктивов
		|		ПО _Активы.Актив = _ПериодыАктивов.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СреднерыночныеПоКлючевойСтавке КАК _СреднерыночныеПоКлючевойСтавке
		|		ПО _Активы.Актив = _СреднерыночныеПоКлючевойСтавке.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасчетныеСреднерыночныеСтавки КАК _РасчетныеСреднерыночныеСтавки
		|		ПО _Активы.Актив = _РасчетныеСреднерыночныеСтавки.Актив
		|			И (_УсловияАктива.ДатаПогашения = _РасчетныеСреднерыночныеСтавки.ДатаПогашения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КоэффициентыВолатильностиРычнонойСтавки КАК _КоэффициентыВолатильностиРычнонойСтавки
		|		ПО _Активы.Актив = _КоэффициентыВолатильностиРычнонойСтавки.Актив
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиРЕПОДляОценкиПоШкалеИндексов КАК _СделкиРЕПОДляОценкиПоШкалеИндексов
		|		ПО _Активы.Актив = _СделкиРЕПОДляОценкиПоШкалеИндексов.Актив";
	
	#КонецОбласти
	
	Активы = Запрос.Выполнить().Выгрузить();
	
	Активы.Колонки.Добавить("АдресРасшифровкиВариантаОтклоненияОтРыночнойСтавки", 	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))); 
	Активы.Колонки.Добавить("АдресРасшифровкиРасчетПоМетодикеКлиента",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))); 
	Активы.Колонки.Добавить("АдресРасшифровкиКБД_MosPrime", 						Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))); 
	Активы.Колонки.Добавить("АдресРасшифровкиДенежныхПотоков", 						Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))); 
	
	Активы.Колонки.Добавить("СуммаРезерва",		Новый ОписаниеТипов("Число"));	// Колонка для хранения резерва под обесценение 
	Активы.Колонки.Добавить("ЕстьОбесценение",	Новый ОписаниеТипов("Булево")); // Колонка для проверки, применяется ли обесценение для актива 
	
	НастройкиУчета								= БухгалтерскийУчет.ОпределитьНастройкиУчета(Период, Организация, СчетДоверительногоУправления);
	ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток	= ПолучитьВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток(СчетДоверительногоУправления, Период);	
	
	#Область Обход_активов	
	
	Для Каждого СтрокаАктивы Из Активы Цикл
		
		Если ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") 
		   И НЕ ЗначениеЗаполнено(СтрокаАктивы.УчетныйАктив) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях депозитного вклада " + СтрокаАктивы.Актив + " не указан учетный актив",,,, Отказ);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПроверитьВозможностьИспользованияСхемыПроверкиСущественностиОтклонений(СтрокаАктивы, Период, Отказ) Тогда
			Продолжить;			
		КонецЕсли;
		
		Если ТипЗнч(СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы") 
		   И НЕ ЗначениеЗаполнено(СтрокаАктивы.СреднерыночнаяСтавка)
		   И НЕ СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетПоМетодикеКлиента Тогда 
			Если СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночная
				И СтрокаАктивы.СделкаСЦентральнымКонтрагентом
				И СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
				//Индекс не нужен
			Иначе
				ТекстСообщения = СтрШаблон("Невозможно проверить на рыночность %1 Нет значения индекса %2 за %3",
					СтрокаАктивы.Актив,
					СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки,
					Формат(СтрокаАктивы.ДатаРазмещенияДляОтбораРыночнойСтавки, "ДФ=dd.MM.yyyy"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетПоМетодикеКлиента Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В настройках проверки на рыночность для актива %1 не указан 'Вид средневзвешенной рыночной ставки'", СтрокаАктивы.Актив),,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			РассчитатьГраницыРыночностиПоМетодикеКлиента(СтрокаАктивы, СтрокаАктивы.ДатаПроверкиНаРыночность, СчетДоверительногоУправления, Клиент, ЦельРасчета, Отказ, ЭтоРасшифровка);
		КонецЕсли;
				
		НулеваяРыночнаяСтоимостьАктива 	= Новый Структура("Стоимость, Обесценение", 0, 0);		
		РасчетнаяСтоимостьАктива 		= НулеваяРыночнаяСтоимостьАктива;
		
		Если СтрокаАктивы.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КриваяБезрисковойДоходности Тогда
			//Требуется расчёт КБД, Фиксированное отклонение и коэффициент волатильности учтены в запросы.
			ПараметрыОценки = Новый Структура("Клиент, СчетДоверительногоУправления, ВариантРасчетаСправедливойСтоимости", Клиент, СчетДоверительногоУправления, НастройкиОценки.ВариантРасчетаОценочнойСтоимости);
			
			РассчитатьБезрисковуюСтавкуДоходностиПоДепозиту(
				СтрокаАктивы, 
				?(Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки), 
					СтрокаАктивы.ДатаПроверкиНаРыночность,
					Период), 
				СчетДоверительногоУправления, 
				ПараметрыОценки);
			
		ИначеЕсли СтрокаАктивы.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.СтандартноеОтклонениеПоГенеральнойСовокупности Тогда
			СреднерыночныеСтавки = Запрос.МенеджерВременныхТаблиц.Таблицы["_РасчетныеСреднерыночныеСтавкиЗаПериод"].ПолучитьДанные().Выгрузить();
			РассчитатьСтандартноеОтклонениеПоГенеральнойСовокупности(
				СтрокаАктивы,
				СреднерыночныеСтавки, 
				СтрокаАктивы.ПериодНаблюдаемыхПроцентныхСтавок, 
				СтрокаАктивы.СмещениеСтандартногоОтклонения, 
				СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки, 
				Отказ);
			
			Если ЭтоРасшифровка Тогда
				СтрокаАктивы.АдресРасшифровкиВариантаОтклоненияОтРыночнойСтавки = ПоместитьВоВременноеХранилище(СреднерыночныеСтавки);
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки Тогда
			Если ЭтоРасшифровка Тогда
				СтрокаАктивы.АдресРасшифровкиВариантаОтклоненияОтРыночнойСтавки = ПоместитьВоВременноеХранилище(Запрос.МенеджерВременныхТаблиц.Таблицы["_РасчетныеСреднерыночныеСтавкиЗаПериод"].ПолучитьДанные().Выгрузить());
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаАктивы.ТочностьГраницДиапазонаРыночнойСтавки > 0 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= ОКР(СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки, СтрокаАктивы.ТочностьГраницДиапазонаРыночнойСтавки);
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки	= ОКР(СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки, СтрокаАктивы.ТочностьГраницДиапазонаРыночнойСтавки);
		КонецЕсли;
		
		Если ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") И СтрокаАктивы.ДоВостребования Тогда
			//Депозиты до востребования считаются линейно
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять Тогда
			Если  СтрокаАктивы.МаксимальныйСрокАктиваДляИспользованияСхемы = 0
				ИЛИ СтрокаАктивы.МаксимальныйСрокАктиваДляИспользованияСхемы >= СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки Тогда
				//Не проверяем
			Иначе
				ТекстСообщения = СтрШаблон("Срок (%1 дней) актива %2 превышает максимальный срок (%3 дней) для расчёта актива без проверки на рыночность",
					СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки,
					СтрокаАктивы.Актив,
					СтрокаАктивы.МаксимальныйСрокАктиваДляИспользованияСхемы);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		// #511334 Хардкод для ДК Регион - никому больше такое не нужно, поэтому даже в настройки не выносим	
		ИначеЕсли СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_15/DSK") Или СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетDU_13/DSK") Тогда
			
			Если (СтрокаАктивы.СрокВозвратаДепозитаПоТребованиюКлиента > 0 И СтрокаАктивы.СрокВозвратаДепозитаПоТребованиюКлиента <= 5) Тогда 
				
				Если ЗначениеЗаполнено(СтрокаАктивы.ПроцентнаяСтавкаПриДосрочномЗакрытии) Тогда
					
					РасчетнаяСтоимостьАктива.Стоимость = РасчетнаяСтоимостьАктива.Стоимость + РасчетнаяСтоимостьАктива.Стоимость * СтрокаАктивы.ПроцентнаяСтавкаПриДосрочномЗакрытии * ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Период, СтрокаАктивы.ДатаРегистрации) / 365;	
					
				КонецЕсли;	
				
				СтрокаАктивы.СтавкаПризнанаРыночной = Истина;																			
				
			Иначе
				
				Если ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
					ДатаПервоначальногоПризнания = КонецДня(СтрокаАктивы.ДатаРегистрации);
					
					СтрокаАктивы.БезрисковаяСтавкаДоходности = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(СтрокаАктивы.Актив, КонецДня(Период), , Ложь);
					
					ЭСПДепозита = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, ДатаПервоначальногоПризнания, СтрокаАктивы.ТочностьЭСП);
					
					БезрисковаяСтавкаДоходностиНаДатуПервоначальногоПризнания = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(СтрокаАктивы.Актив, ДатаПервоначальногоПризнания, , Ложь);
					
					СтрокаАктивы.ПроцентПоАктиву	= СтрокаАктивы.БезрисковаяСтавкаДоходности + (ЭСПДепозита - БезрисковаяСтавкаДоходностиНаДатуПервоначальногоПризнания);	
				КонецЕсли;
				
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																			Период, 
																			СтрокаАктивы, 
																			Неопределено, 
																			Ложь, 
																			СтрокаАктивы.ТочностьЭСП, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
																			
				СтрокаАктивы.СтавкаПризнанаРыночной = Истина;																			
																			
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагент Тогда
			
			Если НЕ СтрокаАктивы.СделкаСЦентральнымКонтрагентом Тогда
				//Схема Репо с ЦК выбирается, если в методике у фонда написано, что для сделок не с ЦК нужно обратиться за методикой оценки к фонду
				//Нужно уточнить у фонда методику расчёта и выбрать схему РЕПО с ЦК или ставка рыночная
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Сделка (депозит) без ЦК не может быть оценена по схеме '%1', необходимо запросить у клиента методику оценки", СтрокаАктивы.СхемаПроверкиСущественностиОтклонений),,,, Отказ);
				Продолжить;
			КонецЕсли;
			
			Если СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
				//Репо с ЦК до этого срока считаются линейно	
			Иначе
				//Репо с ЦК после этого срока считаются по фактической ЭСП	
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																			Период, 
																			СтрокаАктивы, 
																			СтрокаАктивы.УчетныйАктив, 
																			Истина, 
																			СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
				
			КонецЕсли;
			
		ИначеЕсли (СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночная
					ИЛИ СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов)
				И СтрокаАктивы.СделкаСЦентральнымКонтрагентом
				И СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			//Репо с ЦК в рынке, считаются линейно
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПересчитатьПоРыночнойСтавке Тогда
			
			Если СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки И НЕ СтрокаАктивы.ЭтоДенежныйПоток Тогда
				//Не пересчитываем
			Иначе
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.СреднерыночнаяСтавка, 
																			Период, 
																			СтрокаАктивы, 
																			СтрокаАктивы.УчетныйАктив, 
																			Ложь, 
																			СтрокаАктивы.ТочностьРыночнойСтавки, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.ПройденаПроверкаНаРыночностьПоПеречнюЦБ580П И НЕ СтрокаАктивы.НеУчитывать580ПИОтнестиКорректировкуНаТело  Тогда
			Если СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
				//Ставка в рынке считаем линейно
			ИначеЕсли СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																			Период, 
																			СтрокаАктивы, 
																			Неопределено, 
																			СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП, 
																			СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки Тогда
			//Депозиты считаются линейно
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЛинейноИПоФактическойЭСП
		   И СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки <= СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			//Линейно
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений <> Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетПоМетодикеКлиента
			И (СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЛинейноИПоФактическойЭСП
				ИЛИ СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки > СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки) Тогда
			//Депозит больше срока проверки на рыночность, считаем по ЭСП
			РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																		Период, 
																		СтрокаАктивы, 
																		Неопределено, 
																		СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП, 
																		СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																		НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																		Организация, 
																		СчетДоверительногоУправления, 
																		ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																		ЦельРасчета,
																		Отказ);
																		
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.КБДИMosPrime1День Тогда
			
			Если СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО И СтрокаАктивы.Актив.МестоХранения <> Справочники.МестаХранения.ВнебиржевойРынок	Тогда
				//биржу не дисконтируем
				СтрокаАктивы.СтавкаПризнанаРыночной = Истина;
			Иначе
				РассчитатьСтавкуКБД_MosPrime(СтрокаАктивы, Период, СчетДоверительногоУправления, Клиент, ЦельРасчета, Отказ, ЭтоРасшифровка);
				
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																			Период, 
																			СтрокаАктивы, 
																			Неопределено, 
																			Ложь, 
																			СтрокаАктивы.ТочностьЭСП, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
				СтрокаАктивы.СтавкаПризнанаРыночной = (РасчетнаяСтоимостьАктива.Стоимость = 0);																			
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ОтклонениеСтоимостиПоЭСППоРыночнойСтавке Тогда
			
			РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСП);
			
			СтрокаАктивы.СтавкаДляПроверкиНаРыночность = РыночнаяСтавка;
			
			Если (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка)
				И СтрокаАктивы.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения Тогда
				РыночнаяСтавка = СтрокаАктивы.СреднерыночнаяСтавка;
				
			ИначеЕсли СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка Тогда
				РыночнаяСтавка = СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки;
				
			ИначеЕсли СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка Тогда
				РыночнаяСтавка = СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки;
				
			ИначеЕсли СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотока <> Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
				РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
				
			КонецЕсли;
			
			РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																		СтрокаАктивы.ДатаПроверкиНаРыночность, 
																		СтрокаАктивы, 
																		Неопределено, 
																		Ложь, 
																		СтрокаАктивы.ТочностьЭСП, 
																		НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																		Организация, 
																		СчетДоверительногоУправления, 
																		ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																		ЦельРасчета,
																		Отказ);
			
			СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
			
			Если Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки)
				И СтрокаАктивы.Номинал * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость 
				И СтрокаАктивы.Номинал * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда
				
				РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива; //Отклонение линейной стоимости и стоимости ЭСП по рыночной ставке несущественно, считаем линейно

			ИначеЕсли (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость 
					И (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда
					
				РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива; //Отклонение линейной стоимости и стоимости ЭСП по рыночной ставке несущественно, считаем линейно
				
			ИначеЕсли СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотока <> СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета 
				ИЛИ СтрокаАктивы.ТочностьЭСП <> СтрокаАктивы.ТочностьЭСПНаДатуРасчета
				ИЛИ СтрокаАктивы.ДатаПроверкиНаРыночность <> НачалоДня(Период) Тогда
					// депозит не в рынке, но в настройках изменилась ставка расчёта или точность
					РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																				Период, 
																				СтрокаАктивы, 
																				Неопределено, 
																				Ложь, 
																				СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																				НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																				Организация, 
																				СчетДоверительногоУправления, 
																				ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																				ЦельРасчета,
																				Отказ);
				
			КонецЕсли;
			
			СтрокаАктивы.СтавкаПризнанаРыночной = (РасчетнаяСтоимостьАктива.Стоимость = 0);

		ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке Тогда
			
			Если СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки <= СтрокаАктивы.СтавкаПоДоговору И СтрокаАктивы.СтавкаПоДоговору <= СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки Тогда 
				//Ставка по депозиту попадает в рынок
				
			Иначе
				//Ставка не попала в рынок, дополнительных условий нет, считаем по рыночной ставке 
				РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
				СтрокаАктивы.СтавкаДляПроверкиНаРыночность = РыночнаяСтавка;
				СтрокаАктивы.СтавкаПризнанаРыночной = Ложь;
				
				Если (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка)
					И СтрокаАктивы.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения Тогда
					РыночнаяСтавка = СтрокаАктивы.СреднерыночнаяСтавка;
					
				ИначеЕсли СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка Тогда
					РыночнаяСтавка = СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки;
					
				ИначеЕсли СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка Тогда
					РыночнаяСтавка = СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки;
					
				КонецЕсли;
				
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																			Период, 
																			СтрокаАктивы, 
																			СтрокаАктивы.УчетныйАктив, 
																			Ложь, 
																			СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);
				
				СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
			КонецЕсли;
			
		ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < СтрокаАктивы.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			//Срок депозита попадает под линейный расчёт, обычно это До года.
			
			Если СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки <= СтрокаАктивы.СтавкаПоДоговору И СтрокаАктивы.СтавкаПоДоговору <= СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки Тогда 
				//Ставка по депозиту попадает в рынок
				
				Если СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП Тогда
					//Дополнительно проверяем существенность отклонения линейной стоимости и стоимости по ЭСП
					РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																				СтрокаАктивы.ДатаПроверкиНаРыночность, 
																				СтрокаАктивы, 
																				Неопределено, 
																				СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотока = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП, 
																				СтрокаАктивы.ТочностьЭСП, 
																				НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																				Организация, 
																				СчетДоверительногоУправления, 
																				ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																				ЦельРасчета,
																				Отказ);
					
					Если Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки)
						И СтрокаАктивы.Номинал * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость 
						И СтрокаАктивы.Номинал * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда
						//Разница между линейной стоимостью и стоимостью по ЭСП несущественная, считаем линейно
						
						РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива;
						
					ИначеЕсли (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость 
							И (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда
						//Разница между линейной стоимостью и стоимостью по ЭСП несущественная, считаем линейно
						
						РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива;
						
					ИначеЕсли СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотока <> СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета 
						ИЛИ СтрокаАктивы.ТочностьЭСП <> СтрокаАктивы.ТочностьЭСПНаДатуРасчета 
						ИЛИ СтрокаАктивы.ДатаПроверкиНаРыночность <> НачалоДня(Период) Тогда

						// депозит не в рынке, но в настройках изменилась ставка расчёта или точность
						РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(СтрокаАктивы.ПроцентПоАктиву, 
																					Период, 
																					СтрокаАктивы, 
																					Неопределено, 
																					СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП, 
																					СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																					НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																					Организация, 
																					СчетДоверительногоУправления, 
																					ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																					ЦельРасчета,
																					Отказ);
						
					КонецЕсли;
					
					СтрокаАктивы.СтавкаПризнанаРыночной = (РасчетнаяСтоимостьАктива.Стоимость = 0);
					
				КонецЕсли;
				
			ИначеЕсли СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке Тогда
				//если ставка не попала в рынок, проверим существенность отклонения стоимости линейной и по ЭСП по рыночной ставке
				
				РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
				
				//проверить ЭСП на рыночность, обычно это для депозитов более года
				Если СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС  
					И СтрокаАктивы.ВидСтавкиДляПроверкиНаРыночность = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
					РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСП);
				КонецЕсли;
				
				СтрокаАктивы.СтавкаДляПроверкиНаРыночность = РыночнаяСтавка;
					
				Если (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка)
					И СтрокаАктивы.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения Тогда
					РыночнаяСтавка = СтрокаАктивы.СреднерыночнаяСтавка;
					
				ИначеЕсли СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка Тогда
					РыночнаяСтавка = СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки;
					
				ИначеЕсли СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка Тогда
					РыночнаяСтавка = СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки;
					
				ИначеЕсли СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС
					И СтрокаАктивы.ВидСтавкиДляПроверкиНаРыночность <> Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП
					И СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
					
					РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСП);
					
				КонецЕсли;
				
				РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																			СтрокаАктивы.ДатаПроверкиНаРыночность, 
																			СтрокаАктивы, 
																			СтрокаАктивы.УчетныйАктив, 
																			Ложь, 
																			СтрокаАктивы.ТочностьЭСП, 
																			НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																			Организация, 
																			СчетДоверительногоУправления, 
																			ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																			ЦельРасчета,
																			Отказ);

				Если Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки)
					И СтрокаАктивы.Номинал  * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость  
					И СтрокаАктивы.Номинал * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда     	
					//Отклонение линейной стоимости и стоимости ЭСП по рыночной ставке несущественно, считаем линейно
					
					РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива;
					
				ИначеЕсли (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 - СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) <= РасчетнаяСтоимостьАктива.Стоимость 
						И (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) * (1 + СтрокаАктивы.ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП/100) >= РасчетнаяСтоимостьАктива.Стоимость Тогда
						//Отклонение линейной стоимости и стоимости ЭСП по рыночной ставке несущественно, считаем линейно
					
					РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива;
				ИначеЕсли СтрокаАктивы.ТочностьЭСП <> СтрокаАктивы.ТочностьЭСПНаДатуРасчета
					ИЛИ СтрокаАктивы.ДатаПроверкиНаРыночность <> НачалоДня(Период) Тогда
					//в текущих настройках поменялась точность ЭСП, надо пересчитать
					РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																				Период, 
																				СтрокаАктивы, 
																				СтрокаАктивы.УчетныйАктив, 
																				Ложь, 
																				СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																				НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																				Организация, 
																				СчетДоверительногоУправления, 
																				ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																				ЦельРасчета,
																				Отказ);
					СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
					
				Иначе
					СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
					
				КонецЕсли;
				
				СтрокаАктивы.СтавкаПризнанаРыночной = (РасчетнаяСтоимостьАктива.Стоимость = 0);
				
			Иначе
				
				СтрокаАктивы.СтавкаПризнанаРыночной = Ложь;
				
				НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ЦельРасчета, Истина);
				
				//Ставка не попала в рынок, дополнительных условий нет, считаем по рыночной ставке
				Если СтрокаАктивы.УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
					РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
					
				ИначеЕсли  Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция")
					ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020
					ИЛИ (Клиент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФХантыМансийский") И Период > Дата(2022, 1, 1) ) Тогда
					//Эволюция считает, что если ставка по депозиту не в рынке, депозит нужно посчитать по рыночной ставке без проверки фактической ЭСП на рыночность 
					//У Атомфонда аналогичное мнение
					//У Хантов с 1.1.22 аналогичное мнение
					РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
					
				ИначеЕсли СтрокаАктивы.ДатаПроверкиНаРыночность <> НачалоДня(Период) 
					И Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки) Тогда
					
					// Проверяем ставку при первоначальном признании
					Если СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки <= СтрокаАктивы.СтавкаПоДоговору 
						И СтрокаАктивы.СтавкаПоДоговору <= СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки Тогда
						
						РыночнаяСтавка						= СтрокаАктивы.СтавкаПоДоговору; 
						СтрокаАктивы.СтавкаПризнанаРыночной	= Истина;
						РасчетнаяСтоимостьАктива			= НулеваяРыночнаяСтоимостьАктива;
						
					Иначе	
										
						РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, СтрокаАктивы.ДатаПроверкиНаРыночность, СтрокаАктивы.ТочностьЭСП);  
																
					КонецЕсли;	
					
				Иначе
					РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСПНаДатуРасчета);
				КонецЕсли;
				
				СтрокаАктивы.СтавкаДляПроверкиНаРыночность = РыночнаяСтавка;
				
				Если Не СтрокаАктивы.СтавкаПризнанаРыночной Тогда
					
					Если (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка)
						И СтрокаАктивы.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения Тогда
						РыночнаяСтавка = СтрокаАктивы.СреднерыночнаяСтавка;
						
					ИначеЕсли СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка Тогда
						РыночнаяСтавка = СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки;
						
					ИначеЕсли СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка Тогда
						РыночнаяСтавка = СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки;
						
					ИначеЕсли СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотока <> Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
						РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
						
					КонецЕсли;
										
					РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																				Период, 
																				СтрокаАктивы, 
																				СтрокаАктивы.УчетныйАктив, 
																				Ложь, 
																				СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																				НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																				Организация, 
																				СчетДоверительногоУправления, 
																				ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																				ЦельРасчета,
																				Отказ);
																
					КонецЕсли;
																			
					СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
				
			КонецЕсли;
			
		Иначе
			
			РыночнаяСтавка = СтрокаАктивы.СтавкаПоДоговору;
			
			//проверить ЭСП на рыночность, обычно это для депозитов более года
			Если СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС 
				И СтрокаАктивы.ВидСтавкиДляПроверкиНаРыночность = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
				РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСПНаДатуРасчета);
			КонецЕсли;
			
			СтрокаАктивы.СтавкаДляПроверкиНаРыночность = РыночнаяСтавка;
			СтрокаАктивы.СтавкаПризнанаРыночной = НЕ (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка);
				
			Если (СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка ИЛИ СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка)
				И СтрокаАктивы.ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения Тогда
				РыночнаяСтавка = СтрокаАктивы.СреднерыночнаяСтавка;
				
			ИначеЕсли СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки > РыночнаяСтавка Тогда
				РыночнаяСтавка = СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки;
				
			ИначеЕсли СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки < РыночнаяСтавка Тогда
				РыночнаяСтавка = СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки;
				
			ИначеЕсли СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС
				И СтрокаАктивы.ВидСтавкиДляПроверкиНаРыночность <> Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП
				И СтрокаАктивы.ВидСтавкиДляРасчетаДисконтированногоПотокаНаДатуРасчета = Перечисления.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов.ЭСП Тогда
				
				РыночнаяСтавка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, СтрокаАктивы.ТочностьЭСПНаДатуРасчета);
				
			КонецЕсли;
			
			РасчетнаяСтоимостьАктива = РассчитатьСтоимостьАктиваПоСтавке(РыночнаяСтавка, 
																		Период, 
																		СтрокаАктивы, 
																		СтрокаАктивы.УчетныйАктив, 
																		Ложь, 
																		СтрокаАктивы.ТочностьЭСПНаДатуРасчета, 
																		НастройкиУчета.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
																		Организация, 
																		СчетДоверительногоУправления, 
																		ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, 
																		ЦельРасчета,
																		Отказ);
															
			СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
															
		КонецЕсли;
		
		Если СтрокаАктивы.СтавкаПризнанаРыночной 
		   И СтрокаАктивы.ПервоначальноеПризнаниеДепозитаИлиМНО
		   И СтрокаАктивы.ПериодичностьВыплатыПроцентов <> Перечисления.ПериодичностиВыплатыПроцентов.Авансом Тогда
			РасчетнаяСтоимостьАктива = НулеваяРыночнаяСтоимостьАктива; //При ПП депозита или мно, если ставка рыночная, то актив не дисконтируется
		КонецЕсли;
		
		Если ТипЗнч(РасчетнаяСтоимостьАктива) <> Тип("Структура") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При расчете рыночной стоимости актива "+СтрокаАктивы.Актив+" полученный результат не соответствует ожидаемой структуре",,,,Отказ);
		ИначеЕсли РасчетнаяСтоимостьАктива.Стоимость <> 0 Тогда
			//Депозиты ПСБ Будущего
			Если СтрокаАктивы.Актив = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозит_ПСБ_37313") И НачалоДня(Период) = Дата(2020, 3, 23) Тогда
				СтрокаАктивы.ПроцентыЭСП = -2871.8;
			ИначеЕсли СтрокаАктивы.Актив = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозит_ПСБ_37316") И НачалоДня(Период) = Дата(2020, 3, 26) Тогда 	
				СтрокаАктивы.ПроцентыЭСП = -2160.50;
			Иначе
				СтрокаАктивы.ПроцентыЭСП = РасчетнаяСтоимостьАктива.Стоимость - (СтрокаАктивы.Номинал + (СтрокаАктивы.Проценты - СтрокаАктивы.Задолженность));		
			КонецЕсли;
			СтрокаАктивы.СуммаРезерва 		= РасчетнаяСтоимостьАктива.Обесценение;
			СтрокаАктивы.ЕстьОбесценение 	= СтрокаАктивы.СуммаРезерва <> 0;
			
			Если НЕ СтрокаАктивы.ЭтоДенежныйПоток Тогда
				СтрокаАктивы.ПроцентыЭСП 	= Окр(СтрокаАктивы.ПроцентыЭСП, 2);
				СтрокаАктивы.СуммаРезерва 	= Окр(СтрокаАктивы.СуммаРезерва, 2);
			КонецЕсли;
				
			Если СтрокаАктивы.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
				СтрокаАктивы.МетодРасчета = "По ЭСП";
			КонецЕсли;
			
			Если РасчетнаяСтоимостьАктива.Свойство("АдресРасшифровкиДенежныхПотоков") Тогда
				СтрокаАктивы.АдресРасшифровкиДенежныхПотоков = РасчетнаяСтоимостьАктива.АдресРасшифровкиДенежныхПотоков;
			КонецЕсли;
		КонецЕсли;
		
		//Не покажем отрицательные проценты
		Если СтрокаАктивы.Проценты + СтрокаАктивы.ПроцентыЭСП < 0 
			И СтрокаАктивы.НеПоказыватьОтрицательныеПроценты
			И НЕ СтрокаАктивы.НеУчитывать580ПИОтнестиКорректировкуНаТело Тогда
			СтрокаАктивы.Проценты = 0;
			СтрокаАктивы.ПроцентыЭСП = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	// Обесценение
	ПрименитьОбесценение(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, Отказ);
	
	// Свернуть денежные потоки
	СтрокиДенежныхПотоков = Активы.НайтиСтроки(Новый Структура("ЭтоДенежныйПоток", Истина));
	Если СтрокиДенежныхПотоков.Количество()>0 Тогда
		
		АктивыСПотоками = Новый ТаблицаЗначений;
		АктивыСПотоками.Колонки.Добавить("Актив");
		АктивыСПотоками.Колонки.Добавить("ОсновнаяСтрока");
		
		Для Каждого СтрокаДенежногоПотока ИЗ СтрокиДенежныхПотоков Цикл
			АктивСПотоками = АктивыСПотоками.Найти(СтрокаДенежногоПотока.Актив, "Актив");
			Если АктивСПотоками = Неопределено Тогда
				АктивСПотоками = АктивыСПотоками.Добавить();
				АктивСПотоками.Актив = СтрокаДенежногоПотока.Актив;
				АктивСПотоками.ОсновнаяСтрока = СтрокаДенежногоПотока;
				
				ТаблицаДенежныхПотоков = Активы.СкопироватьКолонки();
				ЗаполнитьЗначенияСвойств(ТаблицаДенежныхПотоков.Добавить(), СтрокаДенежногоПотока);
				СтрокаДенежногоПотока.АдресРасшифровкиДенежныхПотоков = ПоместитьВоВременноеХранилище(ТаблицаДенежныхПотоков);
			
			Иначе
				ОсновнаяСтрока = АктивСПотоками.ОсновнаяСтрока;
				
				ТаблицаДенежныхПотоков = ПолучитьИзВременногоХранилища(ОсновнаяСтрока.АдресРасшифровкиДенежныхПотоков);
				ЗаполнитьЗначенияСвойств(ТаблицаДенежныхПотоков.Добавить(), СтрокаДенежногоПотока);
				ОсновнаяСтрока.АдресРасшифровкиДенежныхПотоков = ПоместитьВоВременноеХранилище(ТаблицаДенежныхПотоков);
				
				ОсновнаяСтрока.Номинал = ОсновнаяСтрока.Номинал + СтрокаДенежногоПотока.Номинал;
				ОсновнаяСтрока.Проценты = ОсновнаяСтрока.Проценты + СтрокаДенежногоПотока.Проценты;
				ОсновнаяСтрока.ПроцентыЭСП = ОсновнаяСтрока.ПроцентыЭСП + СтрокаДенежногоПотока.ПроцентыЭСП;
				ОсновнаяСтрока.СуммаРезерва = ОсновнаяСтрока.СуммаРезерва + СтрокаДенежногоПотока.СуммаРезерва;
				Если ОсновнаяСтрока.ДатаПогашения < СтрокаДенежногоПотока.ДатаПогашения Тогда
					ОсновнаяСтрока.ДатаПогашения = СтрокаДенежногоПотока.ДатаПогашения;
				КонецЕсли;
				
				Активы.Удалить(СтрокаДенежногоПотока);
			КонецЕсли;
		КонецЦикла;
		
		//округлим после суммирования потоков
		Для Каждого АктивСПотоками из АктивыСПотоками Цикл
			ОсновнаяСтрока = АктивСПотоками.ОсновнаяСтрока;
			
			//Расчитывем от общей округленной стоимости, чтобы итоговый результат не разъехался
			//Какой показатель округлить первым - для ПИФ без разницы, остальные пока не используют.
			СуммаДисконтированияИОбсценения = Окр(ОсновнаяСтрока.ПроцентыЭСП + ОсновнаяСтрока.СуммаРезерва, 2); 
			ОсновнаяСтрока.ПроцентыЭСП = Окр(ОсновнаяСтрока.ПроцентыЭСП, 2);
			ОсновнаяСтрока.СуммаРезерва = СуммаДисконтированияИОбсценения - ОсновнаяСтрока.ПроцентыЭСП;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоРасшифровка Тогда
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Активы, "_РасшифровкаСтоимостиАктивовПоРыночнойСтавке", МенеджерВременныхТаблиц);
	КонецЕсли;
		
	Возврат Активы;
	
КонецФункции

Процедура ПрименитьОбесценение(Активы, СчетДоверительногоУправления, Период, ЦельРасчета, Отказ) Экспорт
	
	Если Активы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Активы)<>Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести обесценение активов",,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ТипыАктивовОбесцениваемыеКоэффициентом = Новый Массив;
	ТипыАктивовОбесцениваемыеКоэффициентом.Добавить(Тип("СправочникСсылка.Займы"));
	ТипыАктивовОбесцениваемыеКоэффициентом.Добавить(Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента"));
	ТипыАктивовОбесцениваемыеКоэффициентом.Добавить(Тип("ДокументСсылка.СделкаСНедвижимостью"));
	ТипыАктивовОбесцениваемыеКоэффициентом.Добавить(Тип("ДокументСсылка.НачислениеЗадолженности"));
	
	#Область Процент_Обесценения
	
	//для Начислений задолженности коэффициент обесценения висит на Договоре, а не на самом документе.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Активы.Актив КАК Актив
		|ПОМЕСТИТЬ _АктивыКОбесценению
		|ИЗ
		|	&Активы КАК Активы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_АктивыКОбесценению.Актив КАК Актив,
		|	ОбесценениеАктивовСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	_АктивыКОбесценению КАК _АктивыКОбесценению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО _АктивыКОбесценению.Актив = НачислениеЗадолженности.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбесценениеАктивов.СрезПоследних(
		|				&ДатаОценки,
		|				Актив В
		|						(ВЫБРАТЬ
		|							НачислениеЗадолженности.Договор КАК Актив
		|						ИЗ
		|							_АктивыКОбесценению КАК _АктивыКОбесценению
		|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|								ПО
		|									_АктивыКОбесценению.Актив = НачислениеЗадолженности.Ссылка
		|				
		|						ОБЪЕДИНИТЬ ВСЕ
		|				
		|						ВЫБРАТЬ
		|							_АктивыКОбесценению.Актив
		|						ИЗ
		|							_АктивыКОбесценению КАК _АктивыКОбесценению)
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ДатаДенежногоПотока = ДАТАВРЕМЯ(1, 1, 1)) КАК ОбесценениеАктивовСрезПоследних
		|		ПО (_АктивыКОбесценению.Актив = ОбесценениеАктивовСрезПоследних.Актив
		|				ИЛИ НачислениеЗадолженности.Договор = ОбесценениеАктивовСрезПоследних.Актив)
		|ГДЕ
		|	ОбесценениеАктивовСрезПоследних.Коэффициент <> 1";
	
	Запрос.УстановитьПараметр("Активы", Активы);
	Запрос.УстановитьПараметр("ДатаОценки", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипыАктивовОбесцениваемыеКоэффициентом.Найти(ТипЗнч(ВыборкаДетальныеЗаписи.Актив)) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид актива "+ТипЗнч(ВыборкаДетальныеЗаписи.Актив)+" не обработан при обесценении по коэффициенту!",,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Коэффициент = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиАктива = Активы.НайтиСтроки(Новый Структура("Актив, ЕстьОбесценение", ВыборкаДетальныеЗаписи.Актив, Ложь));
		
		Для Каждого СтрокаАктива Из СтрокиАктива Цикл
		
			СтоимостьАктива = СтрокаАктива.Номинал + СтрокаАктива.Проценты + СтрокаАктива.ПроцентыЭСП;
			СуммаОбесценения = СтоимостьАктива * ВыборкаДетальныеЗаписи.Коэффициент - СтоимостьАктива;
			
			//распределим обратно полученную сумму. Пока все отнесенм на проценты по ЭСП.
			СтрокаАктива.СуммаРезерва = СуммаОбесценения;
			
			// Помечаем, что к этому активу применено обесценение
			СтрокаАктива.ЕстьОбесценение = Истина;

		КонецЦикла;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Остатки_Регистра_РезервыПредстоящихРасходов
	
	// Для цели ОценкаОбъектовВУправлении заполним резервы из регистра резервов
	Если ЦельРасчета <> Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Или Период >= '20230101' Тогда
		Возврат;
	КонецЕсли;
	
	// Если СуммаРезерва уже заполнена, не перезаполняем (уже применен процент обесценения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервыПредстоящихРасходовОстатки.СубъектАналитики КАК Актив,
		|	РезервыПредстоящихРасходовОстатки.СуммаОстаток КАК СуммаРезерва
		|ИЗ
		|	РегистрНакопления.РезервыПредстоящихРасходов.Остатки(
		|			&ДатаОценки,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И СубъектАналитики В (&Активы)
		|				И Резерв В (&Резервы)) КАК РезервыПредстоящихРасходовОстатки";
	
	Запрос.УстановитьПараметр("Активы", Активы.ВыгрузитьКолонку("Актив"));
	Запрос.УстановитьПараметр("ДатаОценки", Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	МассивРезервов = Новый Массив;
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеБумагиБлагоприятныеИзмененияОбесцененныеПриПризнании);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеБумагиОбесцененныеНеобеспеченныеПриПризнании);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеБумагиУбыткиВесьСрокУвеличилсяРискНеобесцененные);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеДепозитыОбесцененныеОбеспеченныеПриПризнании);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеДепозитыОбесцененныеПриПризнании);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеДепозитыУбыткиВесьСрокИндивидуальнаяОценка);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеДепозитыУбыткиВесьСрокГрупповаяОценка);
	МассивРезервов.Добавить(Справочники.Резервы.РезервОбесценениеУбытки12Месяцев);
	МассивРезервов.Добавить(Справочники.Резервы.РезервПодОбесценениеМСФО39);
	
	Запрос.УстановитьПараметр("Резервы", МассивРезервов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипыАктивовОбесцениваемыеКоэффициентом.Найти(ТипЗнч(ВыборкаДетальныеЗаписи.Актив)) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид актива "+ТипЗнч(ВыборкаДетальныеЗаписи.Актив)+" не обработан при обесценении по сумме!",,,,Отказ);
			Возврат;
		КонецЕсли;
		
		СтрокаАктива = Активы.Найти(ВыборкаДетальныеЗаписи.Актив, "Актив");		
		СтрокаАктива.СуммаРезерва = ?(СтрокаАктива.СуммаРезерва = 0, - ВыборкаДетальныеЗаписи.СуммаРезерва, СтрокаАктива.СуммаРезерва);
		
	КонецЦикла;
	
	#КонецОбласти
	
КонецПроцедуры

Функция РасшифровкаСтоимостиАктиваПоРыночнойСтавке(Актив, СчетДоверительногоУправления, Период, ЦельРасчета, ПараметрыЗаполнения = Неопределено, Отказ) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.ОтображатьЗаголовки	= Ложь;
	Результат.ОтображатьСетку		= Ложь;
	Результат.ТолькоПросмотр		= Истина;
	
	Клиент		= Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления, Период);
	
	НастройкиФормированияСЧА = РегистрыСведений.НастройкиФормированияСЧА.ОпределитьНастройки(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления);
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ЦельРасчета);
	
#Область Макет
	МакетРасшифровки = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПолучитьМакет("РасшифровкаСтоимостиАктиваПоРыночнойСтавке");
	
	ОбластьРазделитель = МакетРасшифровки.ПолучитьОбласть("Разделитель");
	ОбластьГруппировка = МакетРасшифровки.ПолучитьОбласть("Группировка");
#КонецОбласти	
	
#Область Шапка 
	ОбластьШапка = МакетРасшифровки.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Организация					= СчетДоверительногоУправления.Организация;
	ОбластьШапка.Параметры.СчетДоверительногоУправления	= СчетДоверительногоУправления;
	ОбластьШапка.Параметры.Актив						= Актив;
	ОбластьШапка.Параметры.Период						= Период;
	ОбластьШапка.Параметры.ЦельРасчета					= ЦельРасчета;

	Результат.Вывести(ОбластьШапка);
	Результат.Вывести(ОбластьРазделитель);
#КонецОбласти	
	
#Область Актив

	ОбластьАктив = Неопределено;
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("ДепозитныВклад");
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.МНО") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("МНО");
	
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("СделкаРЕПО");
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.Сделка") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("Сделка");
	
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("СделкаСНедвижимостью");
	
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда
		ОбластьАктив = МакетРасшифровки.ПолучитьОбласть("Займ");
	
	КонецЕсли;
	
	ПараметрыРазмещения = Новый Структура("ДатаРазмещения, ДатаПогашения, Тип, Сумма");

	Если ОбластьАктив <> Неопределено Тогда
		ПараметрыАктива = ПолучитьПараметрыАктива(Актив, Период);
		
		ЗаполнитьЗначенияСвойств(ОбластьАктив.Параметры, ПараметрыАктива);
		ЗаполнитьЗначенияСвойств(ПараметрыРазмещения, ПараметрыАктива);
		
		Результат.Вывести(ОбластьАктив);
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
	
#КонецОбласти

#Область ПлановыеВыплаты

	ПлановыеВыплаты = ПолучитьПлановыеВыплатыПоАктиву(СчетДоверительногоУправления, Актив, Период);
	Если ПлановыеВыплаты.Количество() <> 0  Тогда
		ПлановыеВыплаты.Сортировать("Период");
	КонецЕсли;
	
	Результат.Вывести(МакетРасшифровки.ПолучитьОбласть("ШапкаДенежныеПотоки"));
	
	НомерСтроки = 1;
	ОбластьСтрокаДенежныеПотоки = МакетРасшифровки.ПолучитьОбласть("СтрокаДенежныеПотоки");
	
	Если ТипЗнч(Актив) = Тип("ДокументСсылка.Сделка")
		И ЗначениеЗаполнено(ПараметрыРазмещения.ДатаПогашения) Тогда
		
		ОбластьСтрокаДенежныеПотоки.Параметры.Номер		= НомерСтроки;
		ОбластьСтрокаДенежныеПотоки.Параметры.Период	= ПараметрыРазмещения.ДатаПогашения;
		ОбластьСтрокаДенежныеПотоки.Параметры.Тип		= ПараметрыРазмещения.Тип;
		ОбластьСтрокаДенежныеПотоки.Параметры.Сумма 	= ПараметрыРазмещения.Сумма;
		
		Результат.Вывести(ОбластьСтрокаДенежныеПотоки);
		
		НомерСтроки = НомерСтроки + 1;
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыРазмещения.ДатаРазмещения) Тогда
		
		ОбластьСтрокаДенежныеПотоки.Параметры.Номер		= НомерСтроки;
		ОбластьСтрокаДенежныеПотоки.Параметры.Период	= ПараметрыРазмещения.ДатаРазмещения;
		ОбластьСтрокаДенежныеПотоки.Параметры.Тип		= ПараметрыРазмещения.Тип;
		ОбластьСтрокаДенежныеПотоки.Параметры.Сумма 	= - ПараметрыРазмещения.Сумма;
		
		Результат.Вывести(ОбластьСтрокаДенежныеПотоки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЕсли;
	
	Для Каждого СтрокаВыплаты Из ПлановыеВыплаты Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаДенежныеПотоки.Параметры, СтрокаВыплаты);
		ОбластьСтрокаДенежныеПотоки.Параметры.Номер		= НомерСтроки;
		
		Результат.Вывести(ОбластьСтрокаДенежныеПотоки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Если НомерСтроки > 1 Тогда
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
	
#КонецОбласти

#Область ПолучениеСтрокиРасшифровки

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПустаяТаблицаЗначений = Новый ТаблицаЗначений;
	ПустаяТаблицаЗначений.Колонки.Добавить("АктивНеПроверяетсяНаРыночность", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1)));
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ПустаяТаблицаЗначений, "_РасшифровкаСтоимостиАктивовПоРыночнойСтавке", МенеджерВременныхТаблиц);

	РеквизитыАктива = Новый Структура("Актив,Номинал,Проценты,СтавкаПоДоговору");
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") ИЛИ ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда
		Если ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Тогда
			
			РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРСА(
				СчетДоверительногоУправления, 
				Период,
				РаботаСКредитнымиИнструментами.ПолучитьТипКредитногоИнструмента(Актив),
				,
				, 
				МенеджерВременныхТаблиц, 
				Отказ);
				
		Иначе
				
			РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(
				СчетДоверительногоУправления,
				Период,
				ЦельРасчета,
				РаботаСКредитнымиИнструментами.ПолучитьТипКредитногоИнструмента(Актив),
				,
				МенеджерВременныхТаблиц, 
				Отказ);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Справочники.ВариантыРасчетаОценочнойСтоимости.ПолучитьЗадолженностиПоСделкамРЕПО(
			НастройкиОценки.ВариантРасчетаОценочнойСтоимости,
			СчетДоверительногоУправления.Организация,
			СчетДоверительногоУправления, 
			Период,
			Неопределено,
			ЦельРасчета,
			Неопределено,
			НастройкиФормированияСЧА,
			Отказ,
			МенеджерВременныхТаблиц);
			
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.Сделка") Тогда
		Справочники.ВариантыРасчетаОценочнойСтоимости.ПолучитьЗадолженностиПоСделкамСРаздельнымИсполнением(
			НастройкиОценки.ВариантРасчетаОценочнойСтоимости,
			СчетДоверительногоУправления.Организация,
			СчетДоверительногоУправления, 
			Период,
			ЦельРасчета,
			Отказ,
			МенеджерВременныхТаблиц);
			
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
			
		Параметры = Новый Структура;
		Параметры.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиОценки.ВариантРасчетаОценочнойСтоимости);
		Параметры.Вставить("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Параметры.Вставить("Период", Период);
		Параметры.Вставить("Организация", СчетДоверительногоУправления.Организация);
		Параметры.Вставить("ЦельРасчета", ЦельРасчета);
	
		СтоимостиЗадолженностей = РаботаСоСтоимостьюПоРыночнойСтавке.РассчитатьСправедливыеСтоимостиЗадолженностей(Параметры, Неопределено, Отказ, МенеджерВременныхТаблиц);
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.МНО") Тогда
		
		Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Сургутнефтегаз
			ИЛИ (НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Федерация И Период < '20200514')
		Тогда
			ВидУчета = Неопределено;		
			ОпределитьПериодичностьПереоценкиМНО = Истина;
		ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.СбербанкСтрахование Тогда
			ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;		
			ОпределитьПериодичностьПереоценкиМНО = Истина;
		Иначе
			ВидУчета = Неопределено;		
			ОпределитьПериодичностьПереоценкиМНО = Ложь;
		КонецЕсли;
		
		СтоимостиМНО = РаботаСМНО.ПолучитьСтоимостиМНОСчетуДоверительногоУправления(
			СчетДоверительногоУправления, 
			ВидУчета, 
			ОпределитьПериодичностьПереоценкиМНО,
			Период,
			ЦельРасчета,
			Отказ,
			МенеджерВременныхТаблиц);
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("_РасшифровкаСтоимостиАктивовПоРыночнойСтавке").Колонки.Найти("АктивНеПроверяетсяНаРыночность") <> Неопределено Тогда
		ВывестиОбласть("НеПроверяется", МакетРасшифровки, Результат);
		Возврат Результат;
	Иначе
		Таблица_РасшифровкаСтоимостиАктивовПоРыночнойСтавке = МенеджерВременныхТаблиц.Таблицы.Найти("_РасшифровкаСтоимостиАктивовПоРыночнойСтавке").ПолучитьДанные().Выгрузить();
	КонецЕсли;
	
	СтрокаРасшифровки = Таблица_РасшифровкаСтоимостиАктивовПоРыночнойСтавке.Найти(Актив, "Актив");
	
	Если СтрокаРасшифровки = Неопределено 
		ИЛИ СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять Тогда
		ВывестиОбласть("НеПроверяется", МакетРасшифровки, Результат);
		Возврат Результат;
	КонецЕсли;
	
#КонецОбласти

#Область ПараметрыПроверкиНаРыночность

	ОбластьГруппировка.Параметры.Имя = "Настройки проверки на рыночность";
	Результат.Вывести(ОбластьГруппировка);
	Результат.НачатьГруппуСтрок(, Ложь);

	ОбластьЗаголовокНастройки = МакетРасшифровки.ПолучитьОбласть("ЗаголовокНастройки");
	ЗаполнитьЗначенияСвойств(ОбластьЗаголовокНастройки.Параметры, СтрокаРасшифровки);
	ОбластьЗаголовокНастройки.Параметры.ТипСубъекта = ТипЗнч(СтрокаРасшифровки.Субъект);
	Результат.Вывести(ОбластьЗаголовокНастройки);
	
	СписокИспользуемыхИзмеренийИРесурсов = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользуемыеИзмеренияИРесурсы(СтрокаРасшифровки);
	
	МассивИсключений = Новый Массив; //Выводятся отдельно
	МассивИсключений.Добавить("Организация");
	МассивИсключений.Добавить("Субъект");
	МассивИсключений.Добавить("Валюта");
	МассивИсключений.Добавить("ВидАктива");
	МассивИсключений.Добавить("ЦельРасчета");
	МассивИсключений.Добавить("СхемаПроверкиСущественностиОтклонений");
	
	Присоединить = Ложь;
	ОбластьЭлементНастройки = МакетРасшифровки.ПолучитьОбласть("ЭлементНастройки|Первая");
	
	Для Каждого ИспользуемыйРесурс Из СписокИспользуемыхИзмеренийИРесурсов Цикл
		Если ИспользуемыйРесурс.Пометка
		   И МассивИсключений.Найти(ИспользуемыйРесурс.Значение) = Неопределено Тогда
			
			ОбластьЭлементНастройки.Параметры.Представление = ИспользуемыйРесурс.Представление;
			ОбластьЭлементНастройки.Параметры.Значение		= СтрокаРасшифровки[ИспользуемыйРесурс.Значение];
			Если Присоединить Тогда
				Результат.Присоединить(ОбластьЭлементНастройки);
			Иначе
				Результат.Вывести(ОбластьЭлементНастройки);
				Присоединить = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.ЗакончитьГруппуСтрок();
	
	Результат.Вывести(ОбластьРазделитель);
	
#КонецОбласти

#Область ДатаПроверкиНаРыночность

	ОбластьГруппировка.Параметры.Имя = "Дата проверки на рыночность";
	Результат.Вывести(ОбластьГруппировка);

	ВывестиОбласть("ДатаПроверкиНаРыночность", МакетРасшифровки, Результат, СтрокаРасшифровки);
	
	Результат.Вывести(ОбластьРазделитель);
	
#КонецОбласти

#Область СоставРасшифровки

	СоставРасшифровки = Новый Структура;
	Если СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КриваяБезрисковойДоходности Тогда
	    СоставРасшифровки = Новый Структура("РыночнаяСтавка, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночная
	 ИЛИ СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП
	 ИЛИ СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке
	 ИЛИ СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ОтклонениеСтоимостиПоЭСППоРыночнойСтавке Тогда
		Если ТипЗнч(СтрокаРасшифровки.ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы") Тогда
			СоставРасшифровки = Новый Структура("БиржевойИндекс, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		Иначе
	 		СоставРасшифровки = Новый Структура("СредневзвешеннаяСтавка, КлючеваяСтавка, РыночнаяСтавка, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		КонецЕсли;
	 
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПересчитатьПоРыночнойСтавке Тогда
	    СоставРасшифровки = Новый Структура("СредневзвешеннаяСтавка,КлючеваяСтавка,РыночнаяСтавка");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночная Тогда
		Если СтрокаРасшифровки.СделкаСЦентральнымКонтрагентом
			И СтрокаРасшифровки.СрокАктиваДляПримененияРыночнойСтавки < СтрокаРасшифровки.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			СоставРасшифровки = Новый Структура("СделкаСЦК");
		Иначе
			СоставРасшифровки = Новый Структура("СредневзвешеннаяСтавка, КлючеваяСтавка, РыночнаяСтавка, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		КонецЕсли;
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов Тогда
		Если СтрокаРасшифровки.СделкаСЦентральнымКонтрагентом
			И СтрокаРасшифровки.СрокАктиваДляПримененияРыночнойСтавки < СтрокаРасшифровки.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			СоставРасшифровки = Новый Структура("СделкаСЦК");
		Иначе
			СоставРасшифровки = Новый Структура("БиржевойИндекс, РыночнаяСтавка, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		КонецЕсли;		
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагент Тогда
		Если СтрокаРасшифровки.СрокАктиваДляПримененияРыночнойСтавки < СтрокаРасшифровки.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			СоставРасшифровки = Новый Структура("СделкаСЦК");
		КонецЕсли;
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять Тогда
		СоставРасшифровки = Новый Структура("АктивНеПроверяетсяНаРыночность");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке Тогда
		СоставРасшифровки = Новый Структура("КлючеваяВКачествеРыночной, ГраницыРыночнойСтавки, СтавкиПоАктивуИМетодРасчета");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЛинейноИПоФактическойЭСП Тогда
		СоставРасшифровки = Новый Структура("СтавкиПоАктивуИМетодРасчета");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетПоМетодикеКлиента Тогда
		СоставРасшифровки = Новый Структура("РасчетПоМетодикеКлиента,ИспользованнаяРыночнаяСтавка,СтавкиПоАктивуИМетодРасчета");
		
	ИначеЕсли СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.КБДИMosPrime1День Тогда
		Если СтрокаРасшифровки.СтавкаПризнанаРыночной Тогда
			СоставРасшифровки = Новый Структура("ИспользованнаяРыночнаяСтавка");
		Иначе
			СоставРасшифровки = Новый Структура("КБД_MosPrime,ИспользованнаяРыночнаяСтавка");
		КонецЕсли;
		
	КонецЕсли;
#КонецОбласти

	Если СоставРасшифровки.Свойство("КБД_MosPrime") Тогда
		
		ОбластьГруппировка.Параметры.Имя = "Ставки КБД и MosPrime";
		Результат.Вывести(ОбластьГруппировка);
		Результат.НачатьГруппуСтрок(, Ложь);

		СписокИспользуемыхПолейРасшифровки = Новый Структура;
		СписокИспользуемыхПолейРасшифровки.Вставить("ДнейДоПогашения","Дней до погашения");
		СписокИспользуемыхПолейРасшифровки.Вставить("СрокДоПогашения","Срок до погашения, лет");
		СписокИспользуемыхПолейРасшифровки.Вставить("НаиболееБлизкийПредыдущийСрокДоПогашения","Наиболее близкий предыдущий срок до погашения");
		СписокИспользуемыхПолейРасшифровки.Вставить("НаиболееБлизкийПоследующийСрокДоПогашения","Наиболее близкий последущий срок до погашения");
		СписокИспользуемыхПолейРасшифровки.Вставить("МинимальныйСрок","Минимальный срок");
		СписокИспользуемыхПолейРасшифровки.Вставить("МаксимальныйСрок","Максимальный срок");
		СписокИспользуемыхПолейРасшифровки.Вставить("СтавкаНаиболееБлизкогоПредыдущегоСрокаДоПогашения","Ставка наиболее близкого предыдущего срока до погашения");
		СписокИспользуемыхПолейРасшифровки.Вставить("СтавкаНаиболееБлизкогоПоследующегоСрокаДоПогашения","Ставка наиболее близкого последующего срока до погашения");
		СписокИспользуемыхПолейРасшифровки.Вставить("ВидСтавки","Вид ставки");
		СписокИспользуемыхПолейРасшифровки.Вставить("Ставка","Ставка");
		
		ОбластьШапкаТаблицы = МакетРасшифровки.ПолучитьОбласть("ШапкаТаблицы|Первая");
		ОбластьСтрокаТаблицы = МакетРасшифровки.ПолучитьОбласть("СтрокаТаблицы|Первая");
		
		ОбластьШапкаТаблицы.Параметры.Представление = "Дата денежного потока";
		Результат.Вывести(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.Представление = "Сумма денежного потока";
		Результат.Присоединить(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.Представление = "Сумма резерва под обесценение";
		Результат.Присоединить(ОбластьШапкаТаблицы);
		
		Для Каждого ИспользуемыйРесурс Из СписокИспользуемыхПолейРасшифровки Цикл
			ОбластьШапкаТаблицы.Параметры.Представление = ИспользуемыйРесурс.Значение;
			Результат.Присоединить(ОбластьШапкаТаблицы);
		КонецЦикла;
		ОбластьШапкаТаблицы.Параметры.Представление = "Корректировка дисконтирования";
		Результат.Присоединить(ОбластьШапкаТаблицы);
		
		//Проверим есть ли денежные потоки
		Если СтрокаРасшифровки.АдресРасшифровкиДенежныхПотоков <> "" Тогда
			ТаблицаДенежныхПотоков = ПолучитьИзВременногоХранилища(СтрокаРасшифровки.АдресРасшифровкиДенежныхПотоков);
			ТаблицаДенежныхПотоков.Сортировать("ДатаПогашения");
		Иначе
			ТаблицаДенежныхПотоков = Новый Массив;
			ТаблицаДенежныхПотоков.Добавить(СтрокаРасшифровки);
		КонецЕсли;
			
		Для Каждого РасшифровкаДенежногоПотока из ТаблицаДенежныхПотоков Цикл
			
			ПараметрыРасшифровки = ПолучитьИзВременногоХранилища(РасшифровкаДенежногоПотока.АдресРасшифровкиКБД_MosPrime);
			
			ОбластьСтрокаТаблицы.Параметры.Значение		= РасшифровкаДенежногоПотока.ДатаПогашения;
			Результат.Вывести(ОбластьСтрокаТаблицы);
			
			ОбластьСтрокаТаблицы.Параметры.Значение		= РасшифровкаДенежногоПотока.Номинал + РасшифровкаДенежногоПотока.Проценты;
			Результат.Присоединить(ОбластьСтрокаТаблицы);
			
			ОбластьСтрокаТаблицы.Параметры.Значение		= РасшифровкаДенежногоПотока.СуммаРезерва;
			Результат.Присоединить(ОбластьСтрокаТаблицы);
			
			Для Каждого ИспользуемыйРесурс Из СписокИспользуемыхПолейРасшифровки Цикл
				Если ПараметрыРасшифровки.Свойство(ИспользуемыйРесурс.Ключ) Тогда
					ОбластьСтрокаТаблицы.Параметры.Значение		= ПараметрыРасшифровки[ИспользуемыйРесурс.Ключ];
				Иначе
					ОбластьСтрокаТаблицы.Параметры.Значение		= "";
				КонецЕсли;
				Результат.Присоединить(ОбластьСтрокаТаблицы);
			КонецЦикла;
			
			ОбластьСтрокаТаблицы.Параметры.Значение		= РасшифровкаДенежногоПотока.ПроцентыЭСП;
			Результат.Присоединить(ОбластьСтрокаТаблицы);
					
		КонецЦикла;
		Результат.ЗакончитьГруппуСтрок();
	
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
			
#Область СделкаСЦК
	Если СоставРасшифровки.Свойство("СделкаСЦК") Тогда
		Если СтрокаРасшифровки.СрокАктиваДляПримененияРыночнойСтавки < СтрокаРасшифровки.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета Тогда
			ОбластьГруппировка.Параметры.Имя = "Сделка с ЦК сроком до " + СтрокаРасшифровки.МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета + " дней не проверяется на рыночность";
			
			Результат.Вывести(ОбластьГруппировка);
			Результат.Вывести(ОбластьРазделитель);
		КонецЕсли;
	КонецЕсли;
	
#КонецОбласти

#Область АктивНеПроверяетсяНаРыночность
	Если СоставРасшифровки.Свойство("АктивНеПроверяетсяНаРыночность") Тогда
		ВывестиОбласть("НеПроверяется", МакетРасшифровки, Результат);
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
#КонецОбласти

#Область СредневзвешеннаяСтавка
	Если СоставРасшифровки.Свойство("СредневзвешеннаяСтавка") Тогда
		
		ОбластьГруппировка.Параметры.Имя = "Средневзвешенная ставка";
		Результат.Вывести(ОбластьГруппировка);
		Результат.НачатьГруппуСтрок(, Ложь);
		
		ВывестиОбласть("ОтборСредневзвешеннаяСтавка", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Результат.ЗакончитьГруппуСтрок();
		
		ВывестиОбласть("СредневзвешеннаяСтавка", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
#КонецОбласти

#Область КлючеваяВКачествеРыночной
	Если СоставРасшифровки.Свойство("КлючеваяВКачествеРыночной") Тогда
		ОбластьГруппировка.Параметры.Имя = "Рыночная ставка";
		Результат.Вывести(ОбластьГруппировка);
	
		ВывестиОбласть("КлючеваяВКачествеРыночной", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
#КонецОбласти

#Область КлючеваяСтавка
	Если СоставРасшифровки.Свойство("КлючеваяСтавка") И НЕ СтрокаРасшифровки.ИгнорироватьИзменениеКлючевойСтавки Тогда
		ОбластьГруппировка.Параметры.Имя = "Ключевая ставка";
		Результат.Вывести(ОбластьГруппировка);
		
		Если СтрокаРасшифровки.ВариантПолученияКлючевойСтавки = Перечисления.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам.СредняяЗаМесяц Тогда
			Результат.НачатьГруппуСтрок(, Ложь);
			Результат.Вывести(МакетРасшифровки.ПолучитьОбласть("ШапкаСредняяКлючевая"));
			
			Для Каждого СтрокаКлючевыеСтавки Из КлючевыеСтавкиЗаМесяц(Период, СтрокаРасшифровки.ПериодСреднерыночнойСтавки) Цикл
				ВывестиОбласть("СтрокаСредняяКлючевая", МакетРасшифровки, Результат, СтрокаКлючевыеСтавки);
			КонецЦикла;	
			
			Результат.ЗакончитьГруппуСтрок();
		КонецЕсли;
		
		ВывестиОбласть("КлючеваяСтавка", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;
#КонецОбласти

#Область РыночнаяСтавка

	Если СоставРасшифровки.Свойство("РыночнаяСтавка") Тогда
		
		ОбластьГруппировка.Параметры.Имя = "Рыночная ставка";
		Результат.Вывести(ОбластьГруппировка);
		Результат.НачатьГруппуСтрок(, Ложь);

		ВывестиОбласть("РыночнаяСтавка", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Если СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПересчитатьПоРыночнойСтавке Тогда
			ВывестиОбласть("МетодРасчетаДепозита", МакетРасшифровки, Результат, СтрокаРасшифровки);
		КонецЕсли;
		
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;

	
#КонецОбласти

#Область БиржевойИндекс

	Если СоставРасшифровки.Свойство("БиржевойИндекс") Тогда
		
		ОбластьГруппировка.Параметры.Имя = "Биржевой индекс";
		Результат.Вывести(ОбластьГруппировка);
		Результат.НачатьГруппуСтрок(, Ложь);

		ВывестиОбласть("БиржевойИндекс", МакетРасшифровки, Результат, СтрокаРасшифровки);
		
		Если СтрокаРасшифровки.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПересчитатьПоРыночнойСтавке Тогда
			ВывестиОбласть("МетодРасчетаДепозита", МакетРасшифровки, Результат, СтрокаРасшифровки);
		КонецЕсли;
		
		Результат.Вывести(ОбластьРазделитель);
	КонецЕсли;

	
#КонецОбласти

#Область РасчетПоМетодикеКлиента
	Если СоставРасшифровки.Свойство("РасчетПоМетодикеКлиента") И ЗначениеЗаполнено(СтрокаРасшифровки.АдресРасшифровкиРасчетПоМетодикеКлиента) Тогда
	
		ПараметрыРасшифровкиРасчетаПоМетодикеКлиента = ПолучитьИзВременногоХранилища(СтрокаРасшифровки.АдресРасшифровкиРасчетПоМетодикеКлиента);
		Если ТипЗнч(ПараметрыРасшифровкиРасчетаПоМетодикеКлиента) = Тип("Структура") Тогда
			
			ВывестиОбласть("Группировка",	МакетРасшифровки, Результат, Новый Структура("Имя", "Проверка на рыночность"));
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Свойство("Операции") Тогда
				ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент( , , , Результат);
				ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
				
				РаботаСДокументами.СформироватьРасшифровкуОперации(ПараметрыРасшифровкиРасчетаПоМетодикеКлиента, ПараметрыВывода);
			КонецЕсли;	
			ВывестиОбласть("Показатель",	МакетРасшифровки, Результат, Новый Структура("Имя, Значение", "Рейтинговая группа",	ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.РейтинговаяГруппа));
			
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Свойство("ПредыдущееЗначениеИндекса") Тогда
				ВывестиОбласть("Показатель",	МакетРасшифровки, Результат, Новый Структура("Имя, Значение", СтрШаблон("%1t-1 (%2)", ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Индикатор, Формат(ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ПредыдущийДеньБиржевогоИндекса, "ДФ=dd.MM.yyyy")), ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ПредыдущееЗначениеИндекса));
			КонецЕсли;
			
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Свойство("ТекущееЗначениеИндекса") Тогда
				ВывестиОбласть("Показатель",	МакетРасшифровки, Результат, Новый Структура("Имя, Значение", СтрШаблон("%1", ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Индикатор), ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ТекущееЗначениеИндекса));
			КонецЕсли;
			
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Свойство("Спред") Тогда
				ВывестиОбласть("Показатель",	МакетРасшифровки, Результат, Новый Структура("Имя, Значение", "spread",   ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Спред));
			КонецЕсли;
			
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.Свойство("КредитныеСпреды") Тогда
				Для Каждого КредитныйСпред Из ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.КредитныеСпреды Цикл 
					ВывестиОбласть("Показатель", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", КредитныйСпред.Представление, КредитныйСпред.Значение));
				КонецЦикла;
			КонецЕсли;

			Результат.Вывести(ОбластьРазделитель);
			
			ВывестиОбласть("ГруппировкаИЗначение", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", "Нижняя граница - мин. значение между ставками ", ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.НижняяГраница));
			
			Для Каждого ФормулаНижнейГраницы Из ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ФормулыНижнейГраницы Цикл 
				ВывестиОбласть("Показатель", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", ФормулаНижнейГраницы.Представление, ФормулаНижнейГраницы.Значение));
			КонецЦикла;
			
			Результат.Вывести(ОбластьРазделитель);
			
			ВывестиОбласть("ГруппировкаИЗначение", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", "Верхняя граница - макс. значение между ставками ", ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ВерхняяГраница));
			
			Для Каждого ФормулаВерхнейГраницы Из ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ФормулыВерхнейГраницы Цикл 
				ВывестиОбласть("Показатель", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", ФормулаВерхнейГраницы.Представление, ФормулаВерхнейГраницы.Значение));
			КонецЦикла;
			
			Если ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ФормулыСреднерыночнойСтавки.Количество() Тогда
				Результат.Вывести(ОбластьРазделитель);
				ВывестиОбласть("ГруппировкаИЗначение", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", "Рыночная ставка ", ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.СреднерыночнаяСтавка));
				
				Для Каждого ФормулыСреднерыночнойСтавки Из ПараметрыРасшифровкиРасчетаПоМетодикеКлиента.ФормулыСреднерыночнойСтавки Цикл 
					ВывестиОбласть("Показатель", МакетРасшифровки, Результат, Новый Структура("Имя, Значение", ФормулыСреднерыночнойСтавки.Представление, ФормулыСреднерыночнойСтавки.Значение));
				КонецЦикла;
			КонецЕсли;
			
			Результат.Вывести(ОбластьРазделитель);
		КонецЕсли;	
		
	КонецЕсли;
#КонецОбласти

#Область ГраницыРыночнойСтавки
	Если СоставРасшифровки.Свойство("ГраницыРыночнойСтавки") Тогда
		
		ОбластьГруппировка.Параметры.Имя = "Границы рыночной ставки";
		Результат.Вывести(ОбластьГруппировка);
		
		Если ЗначениеЗаполнено(СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки) Тогда
			ВывестиОбласть("ВариантОтклонения", МакетРасшифровки, Результат, СтрокаРасшифровки);
		КонецЕсли;
		
		ОбластьОтклонение = МакетРасшифровки.ПолучитьОбласть("Отклонение");
		
		Если СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный Тогда
			ЗаполнитьЗначенияСвойств(ОбластьОтклонение.Параметры, СтрокаРасшифровки);
			Результат.Вывести(ОбластьОтклонение);
			
		ИначеЕсли СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки Тогда
			
			Результат.НачатьГруппуСтрок(, Ложь);
			
			ВывестиОбласть("ШапкаСредневзвешенныеСтавкиKV", МакетРасшифровки, Результат, СтрокаРасшифровки);
			
			СреднерыночныеСтавки = ПолучитьИзВременногоХранилища(СтрокаРасшифровки.АдресРасшифровкиВариантаОтклоненияОтРыночнойСтавки);
			СреднерыночныеСтавки.Сортировать("ПериодСреднерыночнойСтавки");
			
			НайденныеСтроки	= СреднерыночныеСтавки.НайтиСтроки(Новый Структура("Актив", Актив));
			Для Каждого СтрокаСреднеРыночнойСтавки Из НайденныеСтроки Цикл
				Если ТипЗнч(СтрокаРасшифровки.ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы") Тогда
					ВывестиОбласть("СтрокаБиржевыеИндексыKV", МакетРасшифровки, Результат, СтрокаСреднеРыночнойСтавки);
				Иначе
					ВывестиОбласть("СтрокаСредневзвешенныеСтавкиKV", МакетРасшифровки, Результат, СтрокаСреднеРыночнойСтавки);
				КонецЕсли;
			КонецЦикла;
			
			ВывестиОбласть("КоэффициентыВолатильностиРычнонойСтавки", МакетРасшифровки, Результат, СтрокаРасшифровки);
			
			Результат.Вывести(ОбластьРазделитель);
			Результат.ЗакончитьГруппуСтрок();
			
			ОбластьОтклонение.Параметры.ПроцентСущественностиОтклоненияОтРыночнойСтавки = СтрокаРасшифровки.КоэффициентыВолатильностиРычнонойСтавки;
			Результат.Вывести(ОбластьОтклонение);
			
		ИначеЕсли СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.СтандартноеОтклонениеПоГенеральнойСовокупности Тогда
			
			Результат.НачатьГруппуСтрок(, Ложь);

			ВывестиОбласть("ШапкаСредневзвешенныеСтавкиСтандартноеОтклонение", МакетРасшифровки, Результат, СтрокаРасшифровки);
			
			ПараметрыСтандартноеОтклонение = Новый Структура("КоэффициентыВолатильностиРычнонойСтавки, СмещениеСтандартногоОтклонения, СредняяПроцентнаяСтавка,СуммаКвадратовСтавок", 
																СтрокаРасшифровки.КоэффициентыВолатильностиРычнонойСтавки,
																СтрокаРасшифровки.СмещениеСтандартногоОтклонения, 0, 0);
			
			СреднерыночныеСтавки = ПолучитьИзВременногоХранилища(СтрокаРасшифровки.АдресРасшифровкиВариантаОтклоненияОтРыночнойСтавки);
			СреднерыночныеСтавки.Сортировать("ПериодСреднерыночнойСтавки");
			
			НайденныеСтроки	= СреднерыночныеСтавки.НайтиСтроки(Новый Структура("Актив", Актив));
			Для Каждого СтрокаСреднеРыночнойСтавки Из НайденныеСтроки Цикл
				ПараметрыСтандартноеОтклонение.СредняяПроцентнаяСтавка	= ПараметрыСтандартноеОтклонение.СредняяПроцентнаяСтавка	+ СтрокаСреднеРыночнойСтавки.ПроцентнаяСтавка;
				ПараметрыСтандартноеОтклонение.СуммаКвадратовСтавок		= ПараметрыСтандартноеОтклонение.СуммаКвадратовСтавок		+ СтрокаСреднеРыночнойСтавки.КвадратРазницыСтавок;
				
				Если ТипЗнч(СтрокаРасшифровки.ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы") Тогда
					ВывестиОбласть("СтрокаБиржевыеИндексыСтандартноеОтклонение", МакетРасшифровки, Результат, СтрокаСреднеРыночнойСтавки);
				Иначе
					ВывестиОбласть("СтрокаСредневзвешенныеСтавкиСтандартноеОтклонение", МакетРасшифровки, Результат, СтрокаСреднеРыночнойСтавки);
				КонецЕсли;
			КонецЦикла;
			
			ПараметрыСтандартноеОтклонение.СредняяПроцентнаяСтавка = ПараметрыСтандартноеОтклонение.СредняяПроцентнаяСтавка / НайденныеСтроки.Количество();
			
			ВывестиОбласть("СтандартноеОтклонение", МакетРасшифровки, Результат, ПараметрыСтандартноеОтклонение);
			
			Результат.Вывести(ОбластьРазделитель);
			Результат.ЗакончитьГруппуСтрок();
			
			ОбластьОтклонение.Параметры.ПроцентСущественностиОтклоненияОтРыночнойСтавки = СтрокаРасшифровки.КоэффициентыВолатильностиРычнонойСтавки;
			Результат.Вывести(ОбластьОтклонение);
			
		ИначеЕсли СтрокаРасшифровки.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КриваяБезрисковойДоходности Тогда
			
			Результат.НачатьГруппуСтрок(, Ложь);
			
			ВывестиОбласть("КБД", МакетРасшифровки, Результат, СтрокаРасшифровки);
			Результат.Вывести(ОбластьРазделитель);
			
			Результат.ЗакончитьГруппуСтрок();
	
		КонецЕсли;

		ВывестиОбласть("ГраницыРыночнойСтавки", МакетРасшифровки, Результат, СтрокаРасшифровки);
		Результат.Вывести(ОбластьРазделитель);
		
	КонецЕсли;	
#КонецОбласти

#Область СтавкиПоАктивуИМетодРасчета

	Если СоставРасшифровки.Свойство("СтавкиПоАктивуИМетодРасчета") Тогда

		ОбластьГруппировка.Параметры.Имя = "Итоговые ставки и метод расчёта";
		Результат.Вывести(ОбластьГруппировка);
		
		ПараметрыЗаполненияИтоговыхСтавок = Новый Структура("ФактическаяЭСП, Рыночная, ИспользованаФактическаяЭСП, ИспользованаРыночнаяСтавка", 0, 0, Ложь, Ложь);

		ПараметрыЗаполненияИтоговыхСтавок.Вставить("СтавкаПоДоговору"				, СтрокаРасшифровки.СтавкаПоДоговору);
		ПараметрыЗаполненияИтоговыхСтавок.Вставить("ИспользованаСтавкаПоДоговору"	, СтрокаРасшифровки.СтавкаПоДоговору = СтрокаРасшифровки.ПроцентПоАктиву);
		
		ВывестиОбласть("СтавкаПоДоговору", МакетРасшифровки, Результат, ПараметрыЗаполненияИтоговыхСтавок);

		Если СтрокаРасшифровки.УчетныйАктив <> Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
			ПараметрыЗаполненияИтоговыхСтавок.Вставить("ФактическаяЭСП", ПолучитьСтавкуЭСПАктива(СтрокаРасшифровки, Период, СтрокаРасшифровки.ТочностьЭСП));
			
			Если СтрокаРасшифровки.ТочностьЭСП = 0 Тогда
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("ИспользованаФактическаяЭСП"	, НЕ ПараметрыЗаполненияИтоговыхСтавок.ИспользованаСтавкаПоДоговору И ОКР(ПараметрыЗаполненияИтоговыхСтавок.ФактическаяЭСП, 9) = ОКР(СтрокаРасшифровки.ПроцентПоАктиву, 9));	
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("ФактическаяЭСП"				, ОКР(ПараметрыЗаполненияИтоговыхСтавок.ФактическаяЭСП, 12));
			Иначе
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("ИспользованаФактическаяЭСП"	, НЕ ПараметрыЗаполненияИтоговыхСтавок.ИспользованаСтавкаПоДоговору И ОКР(ПараметрыЗаполненияИтоговыхСтавок.ФактическаяЭСП, МИН(9, СтрокаРасшифровки.ТочностьЭСП)) = ОКР(СтрокаРасшифровки.ПроцентПоАктиву, СтрокаРасшифровки.ТочностьЭСП));
			КонецЕсли;	
				
			ВывестиОбласть("ФактическаяЭСП", МакетРасшифровки, Результат, ПараметрыЗаполненияИтоговыхСтавок);
		КонецЕсли;
		
		Если СоставРасшифровки.Свойство("РыночнаяСтавка")
		 ИЛИ СоставРасшифровки.Свойство("КлючеваяВКачествеРыночной")
		 ИЛИ СоставРасшифровки.Свойство("РасчетПоМетодикеКлиента") Тогда
			ПараметрыЗаполненияИтоговыхСтавок.Вставить("ИспользованаРыночнаяСтавка", НЕ ПараметрыЗаполненияИтоговыхСтавок.ИспользованаСтавкаПоДоговору И НЕ ПараметрыЗаполненияИтоговыхСтавок.ИспользованаФактическаяЭСП);
			
			Если НЕ ПараметрыЗаполненияИтоговыхСтавок.ИспользованаРыночнаяСтавка 
			 ИЛИ СтрокаРасшифровки.ПроцентПоАктиву = СтрокаРасшифровки.СреднерыночнаяСтавка Тогда
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("Рыночная", СтрокаРасшифровки.СреднерыночнаяСтавка);
				
			ИначеЕсли СтрокаРасшифровки.ПроцентПоАктиву = СтрокаРасшифровки.НижняяГраницаСреднерыночнойСтавки Тогда
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("Рыночная", СтрокаРасшифровки.НижняяГраницаСреднерыночнойСтавки);
				
			ИначеЕсли СтрокаРасшифровки.ПроцентПоАктиву = СтрокаРасшифровки.ВерхняяГраницаСреднерыночнойСтавки Тогда
				ПараметрыЗаполненияИтоговыхСтавок.Вставить("Рыночная", СтрокаРасшифровки.ВерхняяГраницаСреднерыночнойСтавки);
				
			КонецЕсли;
			
			ВывестиОбласть("ИспользованнаяРыночнаяСтавка", МакетРасшифровки, Результат, ПараметрыЗаполненияИтоговыхСтавок);

		КонецЕсли;
		
		ВывестиОбласть("МетодРасчетаДепозита", МакетРасшифровки, Результат, СтрокаРасшифровки);
		Результат.Вывести(ОбластьРазделитель);
		
	КонецЕсли;
#КонецОбласти

#Область СтоимостьАктива

	ОбластьГруппировка.Параметры.Имя = "Стоимость актива";
	Результат.Вывести(ОбластьГруппировка);

	ПараметрыВыводаСтоимости = Новый Структура("Номинал, Проценты, ПроцентыЭСП, Комиссия, СуммаРезерва");
	
	ЗаполнитьЗначенияСвойств(ПараметрыВыводаСтоимости, СтрокаРасшифровки);

	ПараметрыВыводаСтоимости.Вставить("ИтогоПроценты"	, СтрокаРасшифровки.Проценты + СтрокаРасшифровки.ПроцентыЭСП);
	
	Если СтрокаРасшифровки.ПроцентыЭСП = 0 Тогда
		ВывестиОбласть("ЛинейнаяСтоимость", МакетРасшифровки, Результат, ПараметрыВыводаСтоимости);
	Иначе	
		ВывестиОбласть("СтоимостьПоЭСП", МакетРасшифровки, Результат, ПараметрыВыводаСтоимости);
	КонецЕсли;
	
	Если СтрокаРасшифровки.СуммаРезерва <> 0 Тогда
		ВывестиОбласть("Обесценение", МакетРасшифровки, Результат, ПараметрыВыводаСтоимости);
	КонецЕсли;
	
	Если СтрокаРасшифровки.Комиссия <> 0 Тогда
		ВывестиОбласть("Комиссия", МакетРасшифровки, Результат, ПараметрыВыводаСтоимости);
	КонецЕсли;
	
	ПараметрыВыводаСтоимости.Вставить("ИтогоСумма"		, СтрокаРасшифровки.Номинал + СтрокаРасшифровки.Проценты + СтрокаРасшифровки.ПроцентыЭСП + СтрокаРасшифровки.СуммаРезерва + СтрокаРасшифровки.Комиссия);
	
	ВывестиОбласть("ИтогоСумма", МакетРасшифровки, Результат, ПараметрыВыводаСтоимости);
	
	Результат.Вывести(ОбластьРазделитель);

#КонецОбласти

	Возврат Результат;
	
КонецФункции

Процедура ВывестиОбласть(ИмяОбласти, Макет, Результат, ИсточникДанных = Неопределено)
	
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	
	Если ИсточникДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, ИсточникДанных);
	КонецЕсли;
	
	Результат.Вывести(Область);
	
КонецПроцедуры

Функция ПолучитьПараметрыАктива(Актив, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Актив"	, Актив);
	Запрос.УстановитьПараметр("Период"	, Период);
	Запрос.УстановитьПараметр("ГраницаПериода", Новый Граница(Период, ВидГраницы.Включая));

	Если ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	БанковскиеСчета.Валюта КАК Валюта,
			|	НоминалыКредитныхИнструментовСрезПоследних.Сумма КАК Сумма,
			|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
			|	ДепозитныеВклады.ДатаРегистрации КАК ДатаРазмещения,
			|	ДепозитныеВклады.ДатаНачалаНачисленияПроцентов КАК ДатаНачалаНачисленияПроцентов,
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
			|	РАЗНОСТЬДАТ(ДепозитныеВклады.ДатаРегистрации, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК КоличествоДнейВклада,
			|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК ДнейДоПогашения,
			|	""Размещение"" КАК Тип
			|ИЗ
			|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
			|				&Период,
			|				ДатаНачалаДействияУсловий <= &Период
			|					И КредитныйИнструмент = &Актив) КАК УсловияКредитныхИнструментовСрезПоследних
			|		ПО ДепозитныеВклады.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
			|		ПО ДепозитныеВклады.БанковскийСчет = БанковскиеСчета.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПоследних(&Период, КредитныйИнструмент = &Актив) КАК НоминалыКредитныхИнструментовСрезПоследних
			|		ПО ДепозитныеВклады.Ссылка = НоминалыКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|ГДЕ
			|	ДепозитныеВклады.Ссылка = &Актив
			|
			|УПОРЯДОЧИТЬ ПО
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий УБЫВ";
		
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Займы.Валюта КАК Валюта,
			|	НоминалыКредитныхИнструментовСрезПоследних.Сумма КАК Сумма,
			|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
			|	Займы.ДатаЗаключения КАК ДатаРазмещения,
			|	УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент,
			|	Займы.ВидКредитногоИнструмента КАК ВидКредитногоИнструмента,
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
			|	РАЗНОСТЬДАТ(Займы.ДатаЗаключения, УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК КоличествоДнейВклада,
			|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения, ДЕНЬ) КАК ДнейДоПогашения,
			|	""Размещение"" КАК Тип
			|ИЗ
			|	Справочник.Займы КАК Займы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
			|				&Период,
			|				ДатаНачалаДействияУсловий <= &Период
			|					И КредитныйИнструмент = &Актив) КАК УсловияКредитныхИнструментовСрезПоследних
			|		ПО Займы.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов.СрезПоследних(&Период, КредитныйИнструмент = &Актив) КАК НоминалыКредитныхИнструментовСрезПоследних
			|		ПО Займы.Ссылка = НоминалыКредитныхИнструментовСрезПоследних.КредитныйИнструмент
			|ГДЕ
			|	Займы.Ссылка = &Актив
			|
			|УПОРЯДОЧИТЬ ПО
			|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий УБЫВ";
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.МНО") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БанковскиеСчета.Валюта КАК Валюта,
			|	МНО.Сумма КАК Сумма,
			|	МНО.Процент КАК Процент,
			|	МНО.Дата КАК ДатаРазмещения,
			|	МНО.ДатаВозврата КАК ДатаВозврата,
			|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(МНО.Дата, ДЕНЬ), МНО.ДатаВозврата, ДЕНЬ) КАК КоличествоДнейМНО,
			|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), МНО.ДатаВозврата, ДЕНЬ) КАК ДнейДоПогашения,
			|	""Размещение"" КАК Тип
			|ИЗ
			|	Документ.МНО КАК МНО
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
			|		ПО МНО.РасчетныйСчет = БанковскиеСчета.Ссылка
			|ГДЕ
			|	МНО.Ссылка = &Актив";
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки КАК ВидСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки КАК Валюта,
			|	УсловияСделокРЕПО1.СделкаРЕПО.Дата КАК Дата,
			|	МИНИМУМ(УсловияСделокРЕПО1.ДатаОплаты) КАК ДатаРазмещения,
			|	СУММА(УсловияСделокРЕПО1.Сумма + УсловияСделокРЕПО1.СуммаКупона) КАК Сумма,
			|	МИНИМУМ(УсловияСделокРЕПО2.ДатаОплаты) КАК ДатаОплатыВторойЧасти,
			|	СУММА(УсловияСделокРЕПО2.Сумма + УсловияСделокРЕПО2.СуммаКупона) КАК СуммаВторойЧасти,
			|	""Оплата первой части"" КАК Тип,
			|	УсловияСделокРЕПО2.СтавкаРЕПО КАК СтавкаРЕПО
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&Период,
			|			СделкаРЕПО = &Актив
			|				И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПО1
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|				&Период,
			|				СделкаРЕПО = &Актив
			|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПО2
			|		ПО УсловияСделокРЕПО1.Организация = УсловияСделокРЕПО2.Организация
			|			И УсловияСделокРЕПО1.СделкаРЕПО = УсловияСделокРЕПО2.СделкаРЕПО
			|			И УсловияСделокРЕПО1.Рынок = УсловияСделокРЕПО2.Рынок
			|			И УсловияСделокРЕПО1.ЦеннаяБумага = УсловияСделокРЕПО2.ЦеннаяБумага
			|
			|СГРУППИРОВАТЬ ПО
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВидСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.ВалютаСделки,
			|	УсловияСделокРЕПО1.СделкаРЕПО.Дата,
			|	УсловияСделокРЕПО2.СтавкаРЕПО";
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.Сделка") Тогда	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСрезПоследних.ВалютаОплаты КАК Валюта,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ВложенныйЗапрос.Сумма
			|		ИНАЧЕ -ВложенныйЗапрос.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Сумма > 0
			|			ТОГДА УсловияСделокСрезПоследних.ДатаОплаты
			|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаПоставки
			|	КОНЕЦ КАК ДатаПогашения,
			|	""Погашение"" КАК Тип
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложенныйЗапрос.Основание КАК Основание,
			|		ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности,
			|		СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
			|			ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
			|			ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК Сумма
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|					&ГраницаПериода,
			|					Основание = &Актив
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ЗадолженностиПоЦеннымБумагамОстатки.Основание,
			|			ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
			|			-ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток - ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|					&ГраницаПериода,
			|					Основание = &Актив
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)) КАК ЗадолженностиПоЦеннымБумагамОстатки) КАК ВложенныйЗапрос
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложенныйЗапрос.Основание,
			|		ВложенныйЗапрос.ТипЗадолженности) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&Период, Сделка = &Актив) КАК УсловияСделокСрезПоследних
			|		ПО ВложенныйЗапрос.Основание = УсловияСделокСрезПоследних.Сделка";
		
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СделкаСНедвижимостью.Ссылка.Контрагент КАК Контрагент,
			|	СделкаСНедвижимостью.Ссылка.Договор КАК Договор,
			|	СделкаСНедвижимостью.Ссылка.ВидПраваНаНедвижимость КАК ВидПраваНаНедвижимость,
			|	СделкаСНедвижимостью.Ссылка.ВидСделки КАК ВидСделки,
			|	СУММА(УсловияСделокСНедвижимостьюСрезПоследних.Сумма) КАК Сумма,
			|	МАКСИМУМ(УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи) КАК ПлановаяДатаПередачи
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(&Период, Основание = &Актив) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
			|		ПО (НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено)
			|			И УсловияСделокСНедвижимостьюСрезПоследних.Основание = СделкаСНедвижимостью.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	СделкаСНедвижимостью.Ссылка.Контрагент,
			|	СделкаСНедвижимостью.Ссылка.Договор,
			|	СделкаСНедвижимостью.Ссылка.ВидПраваНаНедвижимость,
			|	СделкаСНедвижимостью.Ссылка.ВидСделки";
	КонецЕсли;
	
	ПараметрыАктива = Новый Структура;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка ИЗ РезультатЗапроса.Колонки Цикл
		ПараметрыАктива.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыАктива, Выборка);
	КонецЦикла;
	
	Возврат ПараметрыАктива;
	
КонецФункции

Функция КлючевыеСтавкиЗаМесяц(Период, ПериодСреднерыночнойСтавки)
	
	Запрос = Новый Запрос;	

	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Даты
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодСреднерыночнойСтавки, МЕСЯЦ)
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Дата КАК Период,
		|	ПроцентныеПоказатели.ЗначениеПоказателя КАК Ставка
		|ИЗ
		|	(ВЫБРАТЬ
		|		_Даты.Дата КАК Дата,
		|		МАКСИМУМ(ПроцентныеПоказатели.ДатаЗначения) КАК ПериодКлючевой
		|	ИЗ
		|		_Даты КАК _Даты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|					&Период,
		|					Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|						И Прогноз = ЛОЖЬ) КАК ПроцентныеПоказатели
		|			ПО _Даты.Дата >= ПроцентныеПоказатели.ДатаЗначения
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_Даты.Дата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели.СрезПоследних(
		|				&Период,
		|				Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|					И Прогноз = ЛОЖЬ) КАК ПроцентныеПоказатели
		|		ПО ВложенныйЗапрос.ПериодКлючевой = ПроцентныеПоказатели.ДатаЗначения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
#КонецОбласти

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПериодСреднерыночнойСтавки", ПериодСреднерыночнойСтавки);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#Область СтоимостьПоРыночнойСтавке_ДополнительныеФункции

Процедура РассчитатьБезрисковуюСтавкуДоходностиПоДепозиту(СтрокаДепозиты, Период, СчетДоверительногоУправления, ПараметрыОценки)

	СтрокаДепозиты.БезрисковаяСтавкаДоходности = Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(СтрокаДепозиты.Актив, Период, , Ложь), СтрокаДепозиты.ТочностьРыночнойСтавки);
	
	ПараметрыРасчетаРейтинга = Новый Структура;
	ПараметрыРасчетаРейтинга.Вставить("ИсточникТаблицыСоответствияРейтингов",	СтрокаДепозиты.ИсточникТаблицыСоответствияРейтингов);
	ПараметрыРасчетаРейтинга.Вставить("ТолькоНаблюдаемыеДанные",				Истина);
	ПараметрыРасчетаРейтинга.Вставить("ТолькоЭмитент",							Истина);

	ПараметрыРасчетаКредитногоСпреда = РаботаСПереоценкой.ПолучитьПараметрыРасчетаКредитногоСпреда(ПараметрыОценки, Период);
	ПараметрыРасчетаКредитногоСпреда.Вставить("ОтклонениеКредитногоСпреда", СтрокаДепозиты.ОтклонениеКредитногоСпреда);
	
	КредитныйСпред = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьКредитныйСпред(СтрокаДепозиты.Актив, Период, ПараметрыРасчетаРейтинга, ПараметрыРасчетаКредитногоСпреда, Ложь); 
	
	Если КредитныйСпред.Количество() > 0 Тогда
		СтрокаДепозиты.Медиана					= ОКР(КредитныйСпред[0].Медиана, 2);
		СтрокаДепозиты.МинимумКредитногоСпреда	= ОКР(КредитныйСпред[0].МинимумКредитногоСпреда, 2);
		СтрокаДепозиты.МаксимумКредитногоСпреда	= ОКР(КредитныйСпред[0].МаксимумКредитногоСпреда, 2);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен диапазон кредитного спреда для депозита " + СтрокаДепозиты.Актив);
	КонецЕсли;
	
	СтрокаДепозиты.СреднерыночнаяСтавка					= СтрокаДепозиты.БезрисковаяСтавкаДоходности + СтрокаДепозиты.Медиана/100;
	СтрокаДепозиты.НижняяГраницаСреднерыночнойСтавки	= СтрокаДепозиты.БезрисковаяСтавкаДоходности + СтрокаДепозиты.МинимумКредитногоСпреда/100;
	СтрокаДепозиты.ВерхняяГраницаСреднерыночнойСтавки	= СтрокаДепозиты.БезрисковаяСтавкаДоходности + СтрокаДепозиты.МаксимумКредитногоСпреда/100;

КонецПроцедуры

Процедура РассчитатьСтандартноеОтклонениеПоГенеральнойСовокупности(СтрокаАктивы, СреднерыночныеСтавкиЗа12Месяцев, Знач КоличествоЗначений = 12, Смещение = 0, ВидСредневзвешеннойРыночнойСтавки, Отказ)
	
	Если НЕ ЗначениеЗаполнено(КоличествоЗначений) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверно задан параметр КоличествоЗначений!",,,, Отказ);
	КонецЕсли;
	
	БиржевойИндекс = (ТипЗнч(ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы"));
	
	ПараметрыПоиска = Новый Структура("Актив", СтрокаАктивы.Актив);
	НайденныеСтроки = СреднерыночныеСтавкиЗа12Месяцев.НайтиСтроки(ПараметрыПоиска);
	
	Если БиржевойИндекс Тогда //Для биржевых индексов период наблюдаемых значений не равен количеству значений
		КоличествоЗначений = НайденныеСтроки.Количество();
	Иначе
		Если НайденныеСтроки.Количество() <> КоличествоЗначений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно рассчитать стандартное отклонение: из " + КоличествоЗначений + " ставок за последние " + КоличествоЗначений + " месяцев обнаружено только " + НайденныеСтроки.Количество());
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоЗначений = 0;
	СредняяПроцентнаяСтавка = 0;
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.ПроцентнаяСтавка) Тогда
			ТекстСообщения = СтрШаблон("Ошибка в расчёте стандартного отклонения по активу %1: %2 %3 за %4 = 0",
										СтрокаАктивы.Актив,
										?(БиржевойИндекс, "доходность индекса ", "значение ставки "),
										ВидСредневзвешеннойРыночнойСтавки,
										Формат(СтрокаАктивы.ПериодСреднерыночнойСтавки, "ДФ=dd.MM.yyyy"));
										
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе	
			СредняяПроцентнаяСтавка = СредняяПроцентнаяСтавка + СтрокаДанных.ПроцентнаяСтавка;
			КоличествоЗначений = КоличествоЗначений + 1;
		КонецЕсли;
	КонецЦикла;
	
	СредняяПроцентнаяСтавка = СредняяПроцентнаяСтавка / КоличествоЗначений;
	
	СуммаКвадратовСтавок = 0;
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		СтрокаДанных.КвадратРазницыСтавок = Pow(СтрокаДанных.ПроцентнаяСтавка - СредняяПроцентнаяСтавка, 2);
		СуммаКвадратовСтавок = СуммаКвадратовСтавок + Pow(СтрокаДанных.ПроцентнаяСтавка - СредняяПроцентнаяСтавка, 2);
	КонецЦикла;
	
	СтрокаАктивы.КоэффициентыВолатильностиРычнонойСтавки = ОКР(Sqrt(СуммаКвадратовСтавок / (КоличествоЗначений - Смещение)), 2);
	
	Если СтрокаАктивы.ПроцентСущественностиВПроцентныхПунктах Тогда
		СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= СтрокаАктивы.СреднерыночнаяСтавка - СтрокаАктивы.КоэффициентыВолатильностиРычнонойСтавки;
		СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки	= СтрокаАктивы.СреднерыночнаяСтавка + СтрокаАктивы.КоэффициентыВолатильностиРычнонойСтавки;
	Иначе
		СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= СтрокаАктивы.СреднерыночнаяСтавка * (1 - СтрокаАктивы.КоэффициентыВолатильностиРычнонойСтавки);
		СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки	= СтрокаАктивы.СреднерыночнаяСтавка * (1 + СтрокаАктивы.КоэффициентыВолатильностиРычнонойСтавки);
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьСтоимостьАктиваПоСтавке(Ставка, Период, СтрокаАктивы, УчетныйАктив, РассчитыватьДисконтированныйПотокПоСтавкеЭСП, ТочностьЭСП, 
	РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, Организация, СчетДоверительногоУправления, ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток, ЦельРасчета, Отказ)
	
	Результат = Новый Структура("Стоимость, Обесценение", 0, 0);
	
	ДенежныйПоток = Неопределено;
	Если СтрокаАктивы.ЭтоДенежныйПоток Тогда
		
		ДенежныйПоток = Новый ТаблицаЗначений;
		ДенежныйПоток.Колонки.Добавить("Период"	, Новый ОписаниеТипов("Дата"));
		ДенежныйПоток.Колонки.Добавить("Сумма"	, Новый ОписаниеТипов("Число"));
		
		
		СтрокаДенежногоПотока = ДенежныйПоток.Добавить();
		СтрокаДенежногоПотока.Период = СтрокаАктивы.ДатаПогашения; 
		СтрокаДенежногоПотока.Сумма	 = СтрокаАктивы.Номинал + СтрокаАктивы.Проценты; 
		
	ИначеЕсли ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток <> Неопределено 
		И НужныОтдельныеСтавкиПоПотокам(СчетДоверительногоУправления, СтрокаАктивы.Актив, СтрокаАктивы.ВидАктива, ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток) Тогда
		
		Если СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные
			ИЛИ СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыПолученные Тогда
			
			//делаем рекурсию через ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке, передав туда разбитый на потоки актив.
			ПотокиПоАктиву = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления,Период,,,Ложь,,СтрокаАктивы.Актив,,Истина,ВидыАктивовСОтдельнымиСтавкамиНаКаждыйПоток);
			ПотокиПоАктивуПоРыночнойСтавке = РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьКредитныхИнструментовПоРыночнойСтавке(ПотокиПоАктиву,СчетДоверительногоУправления, Период, ЦельРасчета,, Отказ); 
			Если ПотокиПоАктивуПоРыночнойСтавке.Количество() = 1 Тогда
				Результат.Стоимость = ПотокиПоАктивуПоРыночнойСтавке[0].Номинал + ПотокиПоАктивуПоРыночнойСтавке[0].Проценты + ПотокиПоАктивуПоРыночнойСтавке[0].ПроцентыЭСП;				
				Результат.Обесценение = ПотокиПоАктивуПоРыночнойСтавке[0].СуммаРезерва;
				Результат.Вставить("АдресРасшифровкиДенежныхПотоков", ПотокиПоАктивуПоРыночнойСтавке[0].АдресРасшифровкиДенежныхПотоков);
				Возврат Результат;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дисконтирование по собственным ставкам для каждого денежного потовка для актива вида "+СтрокаАктивы.ВидАктива+" не предусмотрено",,,,Отказ);
				Возврат Результат;
			КонецЕсли;
		ИначеЕсли (СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность 
				ИЛИ СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность)
			И (ТипЗнч(СтрокаАктивы.Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью")
				ИЛИ Справочники.Договоры.ЭтоИнвестконтракт(СтрокаАктивы.Актив)) Тогда
			
			ПотокиПоАктиву = ПолучитьПлановыеВыплатыПоАктиву(СчетДоверительногоУправления, СтрокаАктивы.Актив, Период);
			ПотокиПоАктиву.Колонки.Добавить("ВидАктива");
			ПотокиПоАктиву.ЗаполнитьЗначения(СтрокаАктивы.ВидАктива,"ВидАктива");
			
			РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьЗадолженностиПоРыночнойСтавке(ПотокиПоАктиву, СчетДоверительногоУправления, Период, ЦельРасчета, ,Отказ);
			Если ПотокиПоАктиву.Количество() = 1 Тогда
				Результат.Стоимость = ПотокиПоАктиву[0].Сумма + ПотокиПоАктиву[0].ПроцентыЭСП;				
				Результат.Обесценение = ПотокиПоАктиву[0].СуммаРезерва;
				Результат.Вставить("АдресРасшифровкиДенежныхПотоков", ПотокиПоАктиву[0].АдресРасшифровкиДенежныхПотоков);
				Возврат Результат;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дисконтирование по собственным ставкам для каждого денежного потовка для актива вида "+СтрокаАктивы.ВидАктива+" не предусмотрено",,,,Отказ);
				Возврат Результат;
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дисконтирование по собственным ставкам для каждого денежного потовка для актива "+СтрокаАктивы.Актив+"("+СтрокаАктивы.ВидАктива+") вернуло некорректный результат!",,,,Отказ);
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность
		ИЛИ СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.КредиторскаяЗадолженность)
			И НЕ (ТипЗнч(СтрокаАктивы.Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью")
				ИЛИ Справочники.Договоры.ЭтоИнвестконтракт(СтрокаАктивы.Актив)) Тогда
			
		КолДней = (НачалоДня(СтрокаАктивы.ДатаПогашения) - НачалоДня(Период)) / 86400; 
		
		Если КолДней > 0 Тогда
			
			Если ТипЗнч(СтрокаАктивы.Актив) = Тип("ДокументСсылка.Сделка") 
				И Период >= Дата(2022,11,16)
				И СтрокаАктивы.Актив = ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_160522_132387") Тогда
				
				//проверка: не должно быть оплат!
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор
					|ИЗ
					|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
					|ГДЕ
					|	ЗадолженностиПоДенежнымСредствам.Основание = &Сделка
					|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
					|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
					|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
					|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
					|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
					|	И ЗадолженностиПоДенежнымСредствам.Сумма <> 0";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("Сделка", СтрокаАктивы.Актив);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сделки Продажа_РПИ_160522_132387 обнаружены оплаты! Невозможно получить денежный поток по условиям сделки!",СтрокаАктивы.Актив,,, Отказ);
				КонецЕсли;
				
				Результат.Стоимость = (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) / Pow(1 + Окр(Ставка, ТочностьЭСП) / 100, КолДней / 365);
				
			ИначеЕсли СтрокаАктивы.Актив = ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_270624_18_2") Тогда
				
				Результат.Стоимость = (СтрокаАктивы.Номинал + СтрокаАктивы.Проценты) / Pow(1 + Окр(Ставка, ТочностьЭСП) / 100, КолДней / 365);
				
			Иначе		
				Результат.Стоимость = СтрокаАктивы.Номинал / Pow(1 + Окр(Ставка, ТочностьЭСП) / 100, КолДней / 365);
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
		ДепозитыЛинейно = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправления(СчетДоверительногоУправления, 
			Период,Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад,,,, СтрокаАктивы.Актив, Ставка);
		Результат.Стоимость = ДепозитыЛинейно[0].Номинал + ДепозитыЛинейно[0].Проценты;
		
	ИначеЕсли РассчитыватьДисконтированныйПотокПоСтавкеЭСП Тогда
		Ставка = ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, ТочностьЭСП);
		
		Результат = ПолучитьДисконтированнуюСтоимостьАктива(Период,
														СтрокаАктивы.Актив,
														Ставка, 
														РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
														Организация, 
														СчетДоверительногоУправления,
														ДенежныйПоток,
														Отказ);
	Иначе
		Результат = ПолучитьДисконтированнуюСтоимостьАктива(Период, 
														СтрокаАктивы.Актив, 
														Ставка, 
														РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
														Организация, 
														СчетДоверительногоУправления,
														ДенежныйПоток,
														Отказ);

	КонецЕсли;
													
	Возврат Результат;												
	
КонецФункции

//Ставку ЭСП можно рассчитать только по депозитам, для остальных активов возвращаем ставку
Функция ПолучитьСтавкуЭСПАктива(СтрокаАктивы, Период, ТочностьЭСП)

	СтавкаЭСП = 0;
	
	Если ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		СтавкаЭСП = Справочники.ДепозитныеВклады.ПолучитьДоходностьИДюрацию(СтрокаАктивы.Актив).Доходность;
	ИначеЕсли ТипЗнч(СтрокаАктивы.Актив) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		 СтавкаЭСП = РаботаСоСделкамиРЕПО.ПолучитьДоходностьИДюрациюПоСделкеРЕПО(СтрокаАктивы.Актив, Период, СтрокаАктивы.Номинал).Доходность;  
	ИначеЕсли ТипЗнч(СтрокаАктивы.Актив) = Тип("ДокументСсылка.МНО") Тогда
		 СтавкаЭСП = РаботаСМНО.ПолучитьДоходностьИДюрациюПоСделкеМНО(СтрокаАктивы.Актив, Период, СтрокаАктивы.Номинал).Доходность;  
	КонецЕсли;
	
	Если ТочностьЭСП = 0 Тогда
		Возврат СтавкаЭСП;
	Иначе
		Возврат Окр(СтавкаЭСП, ТочностьЭСП);
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьПлановыеВыплатыПоАктиву(СчетДоверительногоУправления, Актив, Период)
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Возврат Актив.ПлановыеВыплаты.Выгрузить();
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда
		Возврат РаботаСКредитнымиИнструментами.ПолучитьДенежныйПотокПоКредитномуИнструменту(СчетДоверительногоУправления, Актив, Период);
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Возврат РаботаСоСделкамиРЕПО.ПолучитьПлановыеВыплатыПоСделкеРЕПО(Актив, Период);
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.МНО") Тогда
		Возврат РаботаСМНО.ПолучитьПлановыеВыплатыПоСделкеМНО(Актив, Период);
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		Возврат Документы.СделкаСНедвижимостью.ПолучитьПлановыеВыплатыПоСделкеСНедвижимостью(Актив, КонецДня(Период));
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Договоры") Тогда
		Возврат ПолучитьПлановыеВыплатыДоговоруСтроительства(СчетДоверительногоУправления, Актив, Период);
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьДисконтированнуюСтоимостьАктива(Период, Актив, ПроцентПоАктиву, РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов, 
	Организация, СчетДоверительногоУправления, ПлановыеВыплаты = Неопределено, Отказ)
	
	Стоимость			= 0;
	СуммаОбесценения 	= 0;
	ЭтоРасчетОдногоПотока = Ложь;
	
	Если ПлановыеВыплаты <> Неопределено Тогда
		//выплаты получены ранее (один поток)
		ЭтоРасчетОдногоПотока = Истина;
	Иначе
		ПлановыеВыплаты = ПолучитьПлановыеВыплатыПоАктиву(СчетДоверительногоУправления, Актив, Период);
	КонецЕсли;
	
	Если ПлановыеВыплаты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена таблица плановых выплат для актива " + Актив,,,, Отказ);
	КонецЕсли;
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") 
		ИЛИ ТипЗнч(Актив) = Тип("ДокументСсылка.СделкаСНедвижимостью")
		ИЛИ Справочники.Договоры.ЭтоИнвестконтракт(Актив) Тогда

		#Область Запрос_обесценения
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ПлановыеВыплаты", ПлановыеВыплаты);
		Запрос.УстановитьПараметр("Актив", Актив);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПлановыеВыплаты.Период КАК Период
			|ПОМЕСТИТЬ _ДатыПлановыхВыплат
			|ИЗ
			|	&ПлановыеВыплаты КАК ПлановыеВыплаты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОбесценениеАктивовСрезПоследних.ДатаДенежногоПотока КАК ДатаДенежногоПотока,
			|	ОбесценениеАктивовСрезПоследних.Коэффициент КАК Коэффициент
			|ПОМЕСТИТЬ _ПотокиОбесценения
			|ИЗ
			|	РегистрСведений.ОбесценениеАктивов.СрезПоследних(
			|			&Период,
			|			Актив = &Актив
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОбесценениеАктивовСрезПоследних
			|ГДЕ
			|	ОбесценениеАктивовСрезПоследних.Коэффициент <> 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПотокиОбесценения.ДатаДенежногоПотока КАК ДатаДенежногоПотока,
			|	_ДатыПлановыхВыплат.Период КАК Период
			|ИЗ
			|	_ПотокиОбесценения КАК _ПотокиОбесценения
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПлановыхВыплат КАК _ДатыПлановыхВыплат
			|		ПО _ПотокиОбесценения.ДатаДенежногоПотока = _ДатыПлановыхВыплат.Период
			|ГДЕ
			|	_ДатыПлановыхВыплат.Период ЕСТЬ NULL
			|	И _ПотокиОбесценения.ДатаДенежногоПотока >= &Период
			|";
		
		ВыборкаЛишниеПериодыОбесценения = Запрос.Выполнить().Выбрать();
		
		Если НЕ ЭтоРасчетОдногоПотока Тогда
			Пока ВыборкаЛишниеПериодыОбесценения.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для актива "+Актив+" обнаружен лишний коэффициент обесценения на " + Формат(ВыборкаЛишниеПериодыОбесценения.ДатаДенежногоПотока, "ДФ=dd.MM.yyyy") ,,,, Отказ);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
		
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ПотокиОбесценения.Коэффициент КАК Коэффициент
				|ПОМЕСТИТЬ _ОбщийКоэффициент
				|ИЗ
				|	_ПотокиОбесценения КАК _ПотокиОбесценения
				|ГДЕ
				|	_ПотокиОбесценения.ДатаДенежногоПотока = ДАТАВРЕМЯ(1, 1, 1)
				|	И _ПотокиОбесценения.Коэффициент <> 1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_ДатыПлановыхВыплат.Период КАК Период,
				|	ЕСТЬNULL(_ПотокиОбесценения.Коэффициент, 1) КАК Коэффициент,
				|	ЕСТЬNULL(_ОбщийКоэффициент.Коэффициент, 1) КАК ОбщийКоэффициент
				|ИЗ
				|	_ДатыПлановыхВыплат КАК _ДатыПлановыхВыплат
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ПотокиОбесценения КАК _ПотокиОбесценения
				|			ЛЕВОЕ СОЕДИНЕНИЕ _ОбщийКоэффициент КАК _ОбщийКоэффициент
				|			ПО (ИСТИНА)
				|		ПО _ДатыПлановыхВыплат.Период = _ПотокиОбесценения.ДатаДенежногоПотока
				|			И (_ПотокиОбесценения.ДатаДенежногоПотока <> ДАТАВРЕМЯ(1, 1, 1))";
			
			РезультатЗапросаОбесценения = Запрос.Выполнить();
			ВыборкаОбесценение = РезультатЗапросаОбесценения.Выбрать();
			
		Иначе		
			ВыборкаОбесценение = Неопределено;
		КонецЕсли;
		
		#КонецОбласти
		
	Иначе
		ВыборкаОбесценение = Неопределено;
	КонецЕсли;
	
	Для каждого СтрокаТаблицыПлатежей Из ПлановыеВыплаты Цикл
		
		Если СтрокаТаблицыПлатежей.Период < НачалоДня(Период) Тогда
			Продолжить;
		КонецЕсли;
		
		Обесценение = 0;

		//обесценение пока только для займов
		Если ВыборкаОбесценение <> Неопределено Тогда
			ВыборкаОбесценение.Сбросить();
			Если ВыборкаОбесценение.НайтиСледующий(СтрокаТаблицыПлатежей.Период, "Период") Тогда
				Если ВыборкаОбесценение.ОбщийКоэффициент <> 1 И ВыборкаОбесценение.Коэффициент <> 1 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для актива "+Актив+" одновременно обнаружены общий коэффициент обесценения и коэффициент обесценения по дате денежного потока " + Формат(СтрокаТаблицыПлатежей.Период, "ДФ=dd.MM.yyyy") ,,,, Отказ);
				КонецЕсли;
				
				//один из кэффициентов = 1, поэтому умножаем на оба
				Обесценение = СтрокаТаблицыПлатежей.Сумма * ВыборкаОбесценение.ОбщийКоэффициент * ВыборкаОбесценение.Коэффициент - СтрокаТаблицыПлатежей.Сумма;
				СуммаОбесценения = СуммаОбесценения + Обесценение;
			КонецЕсли;
		КонецЕсли;	
		
		КолДней = (НачалоДня(СтрокаТаблицыПлатежей.Период) - НачалоДня(Период)) / 86400;
		
		ДисконтированныйПоток = (СтрокаТаблицыПлатежей.Сумма + Обесценение) / Pow(1 + ПроцентПоАктиву / 100, КолДней / 365);
		
		Если Период < Дата(2020, 09, 7) Тогда
			Если РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов > 0 Тогда
				ДисконтированныйПоток = Окр(ДисконтированныйПоток, РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов);
			КонецЕсли;
		КонецЕсли;
		
		Стоимость = Стоимость + ДисконтированныйПоток - Обесценение;
		
	КонецЦикла;
	
	Возврат Новый Структура("Стоимость,Обесценение", Стоимость, СуммаОбесценения);
	
КонецФункции

Функция ПроверитьВозможностьИспользованияСхемыПроверкиСущественностиОтклонений(СтрокаАктивы, Период, Отказ)
	
	ПромежуточныйОтказ = Ложь; //это чтобы все ошибки проверить
	
	Если ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		
		//Для вида актива ЕПС ДепозитныеВкладыПоСС доступны не все схемы расчёта
		Если СтрокаАктивы.УчетныйАктив = Справочники.УчетныеАктивыЕПС.ДепозитныеВкладыПоСС Тогда
			Если СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ОтклонениеСтоимостиПоЭСППоРыночнойСтавке
			 ИЛИ СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП Тогда
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для депозитного вклада " + СтрокаАктивы.Актив + ", учётного актива " + СтрокаАктивы.УчетныйАктив + " невозможно использовать схему проверку на рыночность " + СтрокаАктивы.СхемаПроверкиСущественностиОтклонений,,,, ПромежуточныйОтказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ОтклонениеСтоимостиПоЭСППоРыночнойСтавке
	 ИЛИ СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке
	 ИЛИ СтрокаАктивы.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП Тогда
	 	Если Не Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(СтрокаАктивы.ПериодичностьОпределенияРыночнойСтавки)
		   И НачалоДня(Период) <> НачалоДня(СтрокаАктивы.ДатаПроверкиНаРыночность) Тогда
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сравнение линейной стоимости и стоимости по ЭСП для схемы '" + СтрокаАктивы.СхемаПроверкиСущественностиОтклонений + "' на промежуточные даты не реализован",,,, ПромежуточныйОтказ);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Макс(ПромежуточныйОтказ, Отказ);
	
	Возврат НЕ ПромежуточныйОтказ;
	
КонецФункции

#КонецОбласти

#Область РасчетПоМетодикеКлиента

// Расчитывает границы рыночной ставки по методике клиента
//	Формулы для расчёта границ рыночной ставки зависят от рейтинга инструмента. Рейтинг определеяется для банка.
//	Вычисляемые параметры
//	КБДd - КБД в точке дюрации депозита в дату размещения депозита
//	Rf_t - значение безрискового индикатора на дату размещения депозита
//	Rf_t-1 - значение безрискового индикатора на рабочий день предшествующий дате размещения депозита
//	Sгр1 - кредитный спред 1 рейтинговой группы = Y_RUCBITRBBB - КБД_RUCBITRBBB
//	Sгр2 - кредитный спред 2 рейтинговой группы = Y_RUCBITRBB - КБД_RUCBITRBB
//	Sгр2 - кредитный спред 3 рейтинговой группы = Y_RUCBITRB - КБД_RUCBITRB
//		где Y - доходность индекса, КБД - КБД в точке дюрации индекса
//	Премия - премия за субординированность.
//	spread - Сумма(Ri - Rf) / 3, где
//		Ri - три ближайшие к дате размещения средневзвешенные ставки по депозитам для НФО, в зависимости от срока инструмента 
//		Rf - средняя ставка безрискового индикатора в месяце за который действует Ri.
//
Процедура РассчитатьГраницыРыночностиПоМетодикеКлиента(СтрокаАктивы, Период, СчетДоверительногоУправления, Клиент, ЦельРасчета, Отказ, ЭтоРасшифровка = Ложь)
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("Операции", Новый Массив);
	
	Премия = 0; //за субординированность
	
	НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ЦельРасчета, Истина);
	
#Область КредитныеСпреды

	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("СчетДоверительногоУправления",		СчетДоверительногоУправления);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент",								Клиент);

	ПараметрыРасчетаРейтинга = РаботаСПереоценкой.ПолучитьПараметрыРасчетаРейтинга(ПараметрыОценки, Период, Отказ);
	ПараметрыРасчетаРейтинга.Вставить("ИсключатьДляРублевыхОблигацийРейтингВИностраннойВалюте", Ложь);

	ПараметрыРасчетаКредитногоСпреда = РаботаСПереоценкой.ПолучитьПараметрыРасчетаКредитногоСпреда(ПараметрыОценки, Период, Отказ);
	ПараметрыРасчетаКредитногоСпреда.Вставить("ВариантРасчетаДиапазонаКредитногоСпреда", "НеРассчитывать");
	
	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020
		ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020 Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("ТочностьКБД", 2);
	КонецЕсли;
	
	РейтинговаяГруппа = РаботаСПоказателямиФинансовыхИнструментов.ОпределитьРейтинговуюГруппу(СтрокаАктивы.Актив, Период, ПараметрыРасчетаРейтинга, , ПараметрыРасшифровки);
	ПараметрыРасшифровки.Вставить("РейтинговаяГруппа", РейтинговаяГруппа);
	
	МассивРейтинговыхГрупп = Новый Массив;
	МассивРейтинговыхГрупп.Добавить(1);
	МассивРейтинговыхГрупп.Добавить(2);
	МассивРейтинговыхГрупп.Добавить(3);
	МассивРейтинговыхГрупп.Добавить(4);
	
	ПараметрыРасчетаРейтинга.Вставить("РейтинговаяГруппа", МассивРейтинговыхГрупп);
	
	КредитныеСпреды = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьКредитныйСпред(СтрокаАктивы.Актив, Период, ПараметрыРасчетаРейтинга, ПараметрыРасчетаКредитногоСпреда, Ложь, ПараметрыРасшифровки); 
	
	ПараметрыРасшифровки.Вставить("КредитныеСпреды", Новый Массив);
	
	Sгр1 = КредитныеСпреды.Найти(1, "НомерГруппы").Медиана/100;
	Если НЕ ЗначениеЗаполнено(Sгр1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить кредитный спред 1 рейтинговой группы для актива " + СтрокаАктивы.Актив,,,, Отказ);
		Возврат;
	КонецЕсли;	
	ПараметрыРасшифровки.КредитныеСпреды.Добавить(Новый Структура("Представление, Значение", "SргI", Sгр1));

	Sгр2 = КредитныеСпреды.Найти(2, "НомерГруппы").Медиана/100;
	Если НЕ ЗначениеЗаполнено(Sгр2) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить кредитный спред 2 рейтинговой группы для актива " + СтрокаАктивы.Актив,,,, Отказ);
		Возврат;
	КонецЕсли;	
	ПараметрыРасшифровки.КредитныеСпреды.Добавить(Новый Структура("Представление, Значение", "SргII", Sгр2));

	Sгр3 = КредитныеСпреды.Найти(3, "НомерГруппы").Медиана/100;
	Если НЕ ЗначениеЗаполнено(Sгр3) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить кредитный спред 3 рейтинговой группы для актива " + СтрокаАктивы.Актив,,,, Отказ);
		Возврат;
	КонецЕсли;	
	ПараметрыРасшифровки.КредитныеСпреды.Добавить(Новый Структура("Представление, Значение", "SргIII", Sгр3));
	
	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020 Тогда
		Sгр4 = КредитныеСпреды.Найти(4, "НомерГруппы").Медиана/100;
		Если НЕ ЗначениеЗаполнено(Sгр4) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить кредитный спред 4 рейтинговой группы для актива " + СтрокаАктивы.Актив,,,, Отказ);
			Возврат;
		КонецЕсли;	
		ПараметрыРасшифровки.КредитныеСпреды.Добавить(Новый Структура("Представление, Значение", "SргIV", Sгр4));
	КонецЕсли;
	
#КонецОбласти

#Область КБД
	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020
	 ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020
	 ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Традиция2019 Тогда
	 	ТочностьКБД = Неопределено;
		ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьКБД", ТочностьКБД);
		
		Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Традиция2019 Тогда 
			КБД = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(СтрокаАктивы.Актив, КонецДня(Период), , Ложь, Неопределено, ТочностьКБД, ПараметрыРасшифровки);
		Иначе		
			КБД = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(СтрокаАктивы.Актив, КонецДня(Период), , Ложь, 4, ТочностьКБД, ПараметрыРасшифровки);
		КонецЕсли;
		
	КонецЕсли;
#КонецОбласти	

#Область ЗначениеБезрисковогоИндикатора 

	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020
	 ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020 Тогда
		ЗначениеБезрисковогоИндикатора = 0;
		
		Если РейтинговаяГруппа = 1 
			ИЛИ РейтинговаяГруппа = 2
			ИЛИ (РейтинговаяГруппа = 3 И НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020) Тогда
			
			Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 
			   И Период >= Дата(2023, 9, 1) Тогда
			    ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ;
			ИначеЕсли РейтинговаяГруппа = 1 
				ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда
				ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.Крупнейшие30Банков;
			ИначеЕсли РейтинговаяГруппа = 2 Тогда
				ГруппаБанков = Перечисления.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ;
			КонецЕсли;
			
			Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020 Тогда
				Если СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 31 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До30ДнейВключаяДоВостребования;
				ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 366 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До1ГодаВключаяДоВостребования;
				Иначе
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От1ГодаДо3Лет;
				КонецЕсли;
			ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда
				Если СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 31 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До30ДнейВключаяДоВостребования;
				ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 91 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От31До90Дней;
				ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 181 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От91До180Дней;
				ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < 366 Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От181ДняДо1Года;
				ИначеЕсли СтрокаАктивы.СрокАктиваДляПримененияРыночнойСтавки < (365 * 3 + 1) Тогда
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От1ГодаДо3Лет;
				Иначе
					ИнтервалШкалы = Перечисления.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше3Лет;
				КонецЕсли;
			КонецЕсли;
			
			ЗначениеБезрисковогоИндикатора = ПолучитьЗначениеБезрисковогоИндикатораСОтклонением(СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки, Период, ГруппаБанков, ИнтервалШкалы, СтрокаАктивы.Валюта, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, Отказ, ПараметрыРасшифровки);
			
			Если НЕ ЗначениеЗаполнено(ЗначениеБезрисковогоИндикатора) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось расчитать %1 + spread на %2 для актива %3", СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки, Формат(Период, "ДФ=dd.MM.yyyy"), СтрокаАктивы.Актив),,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
#КонецОбласти

	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020
	 ИЛИ НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Традиция2019 Тогда
		Индикатор = "КБД";
		ПараметрыРасшифровки.Вставить("ТекущееЗначениеИндекса",	КБД);
	Иначе
		Индикатор = СтрокаАктивы.ВидСредневзвешеннойРыночнойСтавки.Код; 
	КонецЕсли;

	ПараметрыРасшифровки.Вставить("Индикатор",	Индикатор);
	ПараметрыРасшифровки.Вставить("ФормулыНижнейГраницы",	Новый Массив);
	ПараметрыРасшифровки.Вставить("ФормулыВерхнейГраницы",	Новый Массив);
	ПараметрыРасшифровки.Вставить("ФормулыСреднерыночнойСтавки", Новый Массив);

#Область Благосостояние2020
	Если НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020 Тогда
		Если РейтинговаяГруппа = 1 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= Мин(КБД, ЗначениеБезрисковогоИндикатора);			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = Макс(КБД + 2 * Sгр1 + Премия, КБД + Sгр2 + Премия);
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd", КБД));
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", СтрШаблон("%1t + spread", Индикатор), ЗначениеБезрисковогоИндикатора));
			
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + 2 * Sгр1 + Премия", КБД + 2 * Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + Sгр2 + Премия", КБД + Sгр2 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 2 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= Мин(КБД + Sгр1 + Премия, ЗначениеБезрисковогоИндикатора + Премия);			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + Sгр3 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", СтрШаблон("%1t + spread + Премия", Индикатор), ЗначениеБезрисковогоИндикатора + Премия));
			
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + Sгр3 + Премия", КБД + Sгр3 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 3 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр2 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + 2 * Sгр3 - Sгр2 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБДd + 2 * Sгр3 - Sгр2 + Премия", КБД + 2 * Sгр3 - Sгр2 + Премия));
				
		КонецЕсли;
#КонецОбласти

#Область ХантыМансийский2020
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.ХантыМансийский2020 Тогда
		
	#Область До01042023
	Если Период < Дата(2023, 4, 1) Тогда
		Если РейтинговаяГруппа = 1 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр1 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + 2 * Sгр1 + Премия;
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД  + Премия", КБД));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(Новый Структура("Представление, Значение", "Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + 2 * Sгр1 + Премия", КБД + 2 * Sгр1 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 2 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр1 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр2 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + Sгр2 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 3 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр2 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр3 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + (2 * Sгр3 - Sгр2) + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "Sгр3 + Премия", КБД + Sгр3 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + (2 * Sгр3 - Sгр2) + Премия", КБД + 2 * Sгр3 - Sгр2 + Премия));
				
		КонецЕсли;
	#КонецОбласти

	#Область НачинаяС_01042023
	Иначе
		Если РейтинговаяГруппа = 1 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр1 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + 2*Sгр1 + Премия;
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "КБД + Премия", КБД));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "КБД + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "КБД + 2 * Sгр1 + Премия", КБД + 2 * Sгр1 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 2 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр1 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр2 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + Sгр3 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "КБД + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "КБД + Sгр3 + Премия", КБД + Sгр2 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 3 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр2 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр3 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + Sгр4 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "КБД + Sгр3 + Премия", КБД + Sгр3 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "КБД + Sгр4 + Премия", КБД + Sгр4 + Премия));
				
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
#КонецОбласти

#Область Атомфонд2020
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда
		Если РейтинговаяГруппа = 1 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= ЗначениеБезрисковогоИндикатора + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= ЗначениеБезрисковогоИндикатора + Sгр1 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = ЗначениеБезрисковогоИндикатора + 2 * Sгр1 + Премия;
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "0 + Премия", Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "Sгр1 + Премия", Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "2 * Sгр1 + Премия", 2 * Sгр1 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 2 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= ЗначениеБезрисковогоИндикатора + Sгр1 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= ЗначениеБезрисковогоИндикатора + Sгр2 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = ЗначениеБезрисковогоИндикатора + 2 * Sгр2 - Sгр1 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "Sгр1 + Премия", Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "Sгр2 + Премия", Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "2 * Sгр2 - Sгр1 + Премия", 2 * Sгр2 - Sгр1 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 3 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= ЗначениеБезрисковогоИндикатора + Sгр2 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= ЗначениеБезрисковогоИндикатора + Sгр3 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = ЗначениеБезрисковогоИндикатора + 2 * Sгр3 - Sгр2 + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(			Новый Структура("Представление, Значение", "Sгр2 + Премия", Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "Sгр3 + Премия", Sгр3 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(		Новый Структура("Представление, Значение", "2 * Sгр3 - Sгр2 + Премия", 2 * Sгр3 - Sгр2 + Премия));
				
		КонецЕсли;
	
#КонецОбласти

#Область Традиция2019
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Традиция2019 Тогда
		Если РейтинговаяГруппа = 1 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр1 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + 2 * Sгр1 + Премия;
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Премия", КБД + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + 2 * Sгр1 + Премия", КБД + 2 * Sгр1 + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 2 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр1 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр2 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + (2 * Sгр2 - Sгр1) + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр1 + Премия", КБД + Sгр1 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + (2 * Sгр2 - Sгр1) + Премия", КБД + (2 * Sгр2 - Sгр1) + Премия));
			
		ИначеЕсли РейтинговаяГруппа = 3 Тогда
			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки	= КБД + Sгр2 + Премия;			
			СтрокаАктивы.СреднерыночнаяСтавка				= КБД + Sгр3 + Премия;			
			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки = КБД + (2 * Sгр3 - Sгр2) + Премия; 
			
			ПараметрыРасшифровки.ФормулыНижнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + Sгр2 + Премия", КБД + Sгр2 + Премия));
			ПараметрыРасшифровки.ФормулыСреднерыночнойСтавки.Добавить(	Новый Структура("Представление, Значение", "КБД + Sгр3 + Премия", КБД + Sгр3 + Премия));
			ПараметрыРасшифровки.ФормулыВерхнейГраницы.Добавить(Новый Структура("Представление, Значение", "КБД + (2 * Sгр3 - Sгр2) + Премия", КБД + 2 * Sгр3 - Sгр2 + Премия));
				
		КонецЕсли;
#КонецОбласти

	КонецЕсли;
	
	ПараметрыРасшифровки.Вставить("НижняяГраница",			СтрокаАктивы.НижняяГраницаСреднерыночнойСтавки);
	ПараметрыРасшифровки.Вставить("СреднерыночнаяСтавка",	СтрокаАктивы.СреднерыночнаяСтавка);
	ПараметрыРасшифровки.Вставить("ВерхняяГраница",			СтрокаАктивы.ВерхняяГраницаСреднерыночнойСтавки);
	
#Область Расшифровка
	Если ЭтоРасшифровка Тогда
		СтрокаАктивы.АдресРасшифровкиРасчетПоМетодикеКлиента = ПоместитьВоВременноеХранилище(ПараметрыРасшифровки);
	КонецЕсли;
	
#КонецОбласти
	
	
КонецПроцедуры

Функция ПолучитьЗначениеБезрисковогоИндикатораСОтклонением(БиржевойИндекс, Период, ГруппаБанков, ИнтервалШкалы, Валюта, ВариантРасчетаОценочнойСтоимости, Отказ, ПараметрыРасшифровки)
	
	ПредыдущийРабочийДень = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Период - 84600, -1);
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("ГруппаБанков", 	ГруппаБанков);
	Запрос.УстановитьПараметр("ИнтервалШкалы", 	ИнтервалШкалы);
	Запрос.УстановитьПараметр("Валюта", 		Валюта);
	Запрос.УстановитьПараметр("БиржевойИндекс",	БиржевойИндекс);
	
	Запрос.УстановитьПараметр("ПредыдущийРабочийДень", ПредыдущийРабочийДень);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СредневзвешенныеПроцентныеСтавкиСрезПоследних.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|	СредневзвешенныеПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _СтавкиПоДепозитам
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки.СрезПоследних(
		|			&Период,
		|			Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСредневзвешенныхСтавок.ПоДепозитамНФО)
		|				И ГруппаБанков = &ГруппаБанков
		|				И Валюта = &Валюта
		|				И ИнтервалШкалы = &ИнтервалШкалы) КАК СредневзвешенныеПроцентныеСтавкиСрезПоследних
		|ГДЕ
		|	СредневзвешенныеПроцентныеСтавкиСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(_СтавкиПоДепозитам.НачалоРасчетногоМесяца, МЕСЯЦ, -2)) КАК НачалоПериода,
		|	КОНЕЦПЕРИОДА(МАКСИМУМ(_СтавкиПоДепозитам.НачалоРасчетногоМесяца), МЕСЯЦ) КАК ОкончанияПериода
		|ПОМЕСТИТЬ _ПериодыСтавок
		|ИЗ
		|	_СтавкиПоДепозитам КАК _СтавкиПоДепозитам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БиржевыеИндексыВМесяцыСтавокПоДепозитам.Период КАК ДатаИндексаВПериодеСтавок,
		|	БиржевыеИндексыВМесяцыСтавокПоДепозитам.CLOSE КАК ЗначениеИндексаВПериодеСтавок,
		|	БиржевыеИндексыНаДатуОценки.CLOSE КАК ТекущееЗначениеИндекса,
		|	БиржевыеИндексыНаПредыдущийРабочийДень.CLOSE КАК ПредыдущееЗначениеИндекса
		|ПОМЕСТИТЬ _ЗначенияИндексов
		|ИЗ
		|	_ПериодыСтавок КАК ПериодыСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК БиржевыеИндексыВМесяцыСтавокПоДепозитам
		|		ПО (БиржевыеИндексыВМесяцыСтавокПоДепозитам.БиржевойИндекс = &БиржевойИндекс)
		|			И (БиржевыеИндексыВМесяцыСтавокПоДепозитам.Период МЕЖДУ ПериодыСтавок.НачалоПериода И ПериодыСтавок.ОкончанияПериода)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК БиржевыеИндексыНаДатуОценки
		|		ПО (БиржевыеИндексыНаДатуОценки.БиржевойИндекс = &БиржевойИндекс)
		|			И (БиржевыеИндексыНаДатуОценки.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК БиржевыеИндексыНаПредыдущийРабочийДень
		|		ПО (БиржевыеИндексыНаПредыдущийРабочийДень.БиржевойИндекс = &БиржевойИндекс)
		|			И (БиржевыеИндексыНаПредыдущийРабочийДень.Период = НАЧАЛОПЕРИОДА(&ПредыдущийРабочийДень, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтавкиПоДепозитам.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|	_СтавкиПоДепозитам.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _СтавкиПоДепозитамЗаПериод
		|ИЗ
		|	_ПериодыСтавок КАК ПериодыСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СтавкиПоДепозитам КАК _СтавкиПоДепозитам
		|		ПО (_СтавкиПоДепозитам.НачалоРасчетногоМесяца МЕЖДУ ПериодыСтавок.НачалоПериода И ПериодыСтавок.ОкончанияПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ТекущееЗначениеИндекса, _СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ПредыдущееЗначениеИндекса) + СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ПроцентнаяСтавка - _СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.СреднееЗначениеИндекса) КАК ЗначениеБезрисковогоИндикатора,
		|	_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ТекущееЗначениеИндекса КАК ТекущееЗначениеИндекса,
		|	_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ПредыдущееЗначениеИндекса КАК ПредыдущееЗначениеИндекса,
		|	СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ПроцентнаяСтавка - _СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.СреднееЗначениеИндекса) КАК Спред
		|ПОМЕСТИТЬ _Благосостояние2020
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЗначенияИндексов.ТекущееЗначениеИндекса КАК ТекущееЗначениеИндекса,
		|		_ЗначенияИндексов.ПредыдущееЗначениеИндекса КАК ПредыдущееЗначениеИндекса,
		|		_СтавкиПоДепозитамЗаПериод.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|		_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|		СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК СреднееЗначениеИндекса
		|	ИЗ
		|		_СтавкиПоДепозитамЗаПериод КАК _СтавкиПоДепозитамЗаПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияИндексов КАК _ЗначенияИндексов
		|			ПО (_СтавкиПоДепозитамЗаПериод.НачалоРасчетногоМесяца = НАЧАЛОПЕРИОДА(_ЗначенияИндексов.ДатаИндексаВПериодеСтавок, МЕСЯЦ))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ЗначенияИндексов.ТекущееЗначениеИндекса,
		|		_ЗначенияИндексов.ПредыдущееЗначениеИндекса,
		|		_СтавкиПоДепозитамЗаПериод.НачалоРасчетногоМесяца,
		|		_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка) КАК _СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ТекущееЗначениеИндекса,
		|	_СтавкиПоДепозитамЗаПериодСоСреднимЗначениемИндекса.ПредыдущееЗначениеИндекса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗначенияИндексов.ПредыдущееЗначениеИндекса + (ВЫРАЗИТЬ(СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка) - СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК ЧИСЛО(19, 2))) КАК ЗначениеБезрисковогоИндикатора,
		|	СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК СреднееЗначениеИндекса,
		|	_ЗначенияИндексов.ПредыдущееЗначениеИндекса КАК ПредыдущееЗначениеИндекса,
		|	NULL КАК ТекущееЗначениеИндекса,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка) - СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК ЧИСЛО(19, 2)) КАК Спред
		|ПОМЕСТИТЬ _Атомфонд2020
		|ИЗ
		|	_СтавкиПоДепозитамЗаПериод КАК _СтавкиПоДепозитамЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияИндексов КАК _ЗначенияИндексов
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Период < ДАТАВРЕМЯ(2023, 4, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗначенияИндексов.ТекущееЗначениеИндекса,
		|	_ЗначенияИндексов.ПредыдущееЗначениеИндекса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_ЗначенияИндексов.ТекущееЗначениеИндекса, _ЗначенияИндексов.ПредыдущееЗначениеИндекса) + (ВЫРАЗИТЬ(СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка) - СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК ЧИСЛО(19, 2))),
		|	СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок),
		|	_ЗначенияИндексов.ПредыдущееЗначениеИндекса,
		|	_ЗначенияИндексов.ТекущееЗначениеИндекса,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(_СтавкиПоДепозитамЗаПериод.ПроцентнаяСтавка) - СРЕДНЕЕ(_ЗначенияИндексов.ЗначениеИндексаВПериодеСтавок) КАК ЧИСЛО(19, 2))
		|ИЗ
		|	_СтавкиПоДепозитамЗаПериод КАК _СтавкиПоДепозитамЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияИндексов КАК _ЗначенияИндексов
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Период >= ДАТАВРЕМЯ(2023, 4, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗначенияИндексов.ТекущееЗначениеИндекса,
		|	_ЗначенияИндексов.ПредыдущееЗначениеИндекса";
	
	Запрос.Выполнить();
	
	Если ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020 Тогда
		Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Благосостояние2020").ПолучитьДанные().Выбрать();
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда
		Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Атомфонд2020").ПолучитьДанные().Выбрать();
		
	КонецЕсли;
	
	Если Не Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось рассчитать %1 + spread на %2", БиржевойИндекс, Формат(Период, "ДФ=dd.MM.yyyy")),,,, Отказ);
		Возврат 0;
	КонецЕсли;	
	
	Если ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Благосостояние2020 Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.ТекущееЗначениеИндекса) И НЕ ЗначениеЗаполнено(Выборка.ПредыдущееЗначениеИндекса) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют значения индекса %1 на %2 и на %3", БиржевойИндекс, Формат(Период, "ДФ=dd.MM.yyyy"), Формат(ПредыдущийРабочийДень, "ДФ=dd.MM.yyyy")),,,, Отказ);
			Возврат 0;
		КонецЕсли;		
		
	ИначеЕсли ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.Атомфонд2020 Тогда

		Если НЕ ЗначениеЗаполнено(Выборка.ПредыдущееЗначениеИндекса)
				И ПредыдущийРабочийДень <> Дата(2024, 11, 02) // за 02.11.2024 (сб) биржа не предоставила значений индекса и расчет перестал работать #ТехДолг #570161
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствует значение индекса %1 на %2", БиржевойИндекс, Формат(ПредыдущийРабочийДень, "ДФ=dd.MM.yyyy")),,,, Отказ);
			Возврат 0;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ТекущееЗначениеИндекса)  Тогда
		ПараметрыРасшифровки.Вставить("ТекущееЗначениеИндекса", Выборка.ТекущееЗначениеИндекса);		
	КонецЕсли;
		
	ПараметрыРасшифровки.Вставить("ПредыдущееЗначениеИндекса",		Выборка.ПредыдущееЗначениеИндекса);
	ПараметрыРасшифровки.Вставить("ПредыдущийДеньБиржевогоИндекса",	ПредыдущийРабочийДень);
	ПараметрыРасшифровки.Вставить("Спред", 							Выборка.Спред);
	
	Возврат Выборка.ЗначениеБезрисковогоИндикатора;
	
КонецФункции

#КонецОбласти

#Область КБД_MosPrime
//Рассчитывает ставку схемы "КБД + MosPrime 1 день" для методики ЗПИФ УКПИ
Процедура РассчитатьСтавкуКБД_MosPrime(СтрокаАктивы, Период, СчетДоверительногоУправления, Клиент, ЦельРасчета, Отказ, ЭтоРасшифровка = Ложь) 
	
	ПараметрыРасшифровки = Новый Структура;
	
	//Хардкод. Допсоглашение для дебиторки по инвестконтракту от 20.10.2023.
	Если СтрокаАктивы.ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность
		И ТипЗнч(СтрокаАктивы.Актив) = Тип("СправочникСсылка.Договоры") 
		И СтрокаАктивы.Актив.ВидДоговора = Перечисления.ВидыДоговоров.СтроительствоНаСвоемУчастке
		И Период >= Дата(2023, 10, 20) И Период < Дата(2023, 10, 31) Тогда
		СтрокаАктивы.ДатаПроверкиНаРыночность = Дата(2023, 10, 20);
	КонецЕсли;
	
	ДнейДоПогашения = (НачалоДня(СтрокаАктивы.ДатаПогашения) - НачалоДня(СтрокаАктивы.ДатаПроверкиНаРыночность)) / 86400;
	
	Если СтрокаАктивы.ДатаПроверкиНаРыночность <> НачалоДня(Период) Тогда 
		//#437106: 	Если в дату проверки на рыночность был поток с такой датой погашения, то берем ставку на эту потока. 
		//			Иначе - берем ставку на дату самого позднего потока отчетной даты.
		ПотокиАктива = ПолучитьПлановыеВыплатыПоАктиву(СчетДоверительногоУправления, СтрокаАктивы.Актив, КонецДня(СтрокаАктивы.ДатаПроверкиНаРыночность));
		Если ПотокиАктива.Количество() > 0 Тогда
		
			ПересчитатьДниДоПогашения = Истина;
			ДатаСамогоПозднегоПотока = Дата(1,1,1);
			
			Для Каждого Поток из ПотокиАктива Цикл
				
				Если Поток.Период = СтрокаАктивы.ДатаПогашения Тогда
					ПересчитатьДниДоПогашения = Ложь;
					Прервать;
				КонецЕсли;
				
				Если ДатаСамогоПозднегоПотока < Поток.Период Тогда
					ДатаСамогоПозднегоПотока = Поток.Период;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПересчитатьДниДоПогашения Тогда
			 	ДнейДоПогашения = (НачалоДня(ДатаСамогоПозднегоПотока) - НачалоДня(СтрокаАктивы.ДатаПроверкиНаРыночность)) / 86400;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыРасшифровки.Вставить("ДнейДоПогашения", ДнейДоПогашения);
	
	Если ДнейДоПогашения <= 0  Тогда
		
		РыночнаяСтавка = 0;
		
	ИначеЕсли ДнейДоПогашения = 1 И Период < Дата(2023,7,1) Тогда
		
		БиржаНФА 		= ОбщегоНазначения.ПолучитьИменованныйОбъект("СРО_НФА");
		MosPrime1День	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Ставка_MosPrime_1день");
		РыночнаяСтавка 	= РегистрыСведений.ЗначенияБиржевыхИндексов.Получить(НачалоДня(СтрокаАктивы.ДатаПроверкиНаРыночность), Новый Структура("Биржа, БиржевойИндекс", БиржаНФА, MosPrime1День)).VALUE;
		
		СтрокаАктивы.ВидСтавкиДляПроверкиНаРыночность = MosPrime1День;
		ПараметрыРасшифровки.Вставить("ВидСтавки", "MosPrime1День");
		
	Иначе
		
		ДнейВГоду = (КонецГода(СтрокаАктивы.ДатаПроверкиНаРыночность) + 1 - НачалоГода(СтрокаАктивы.ДатаПроверкиНаРыночность)) / 86400;
		Если Период < Дата(2024,3,29) И ДнейДоПогашения <= ДнейВГоду Тогда
			СрокДоПогашения = ДнейДоПогашения / ДнейВГоду; 
		Иначе
			СрокДоПогашения = ДнейДоПогашения / 365;
		КонецЕсли;
		
		Если Период >= Дата(2022,3,31) Тогда
			ПараметрыРасшифровки.Вставить("СрокДоПогашения", СрокДоПогашения);
			
			КБД = Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(СтрокаАктивы.ДатаПроверкиНаРыночность, СрокДоПогашения, , Отказ), 2);
			РыночнаяСтавка = Окр(КБД * КоэффициентКорректировкиКБД(Период, Отказ), 2);
			ПараметрыРасшифровки.Вставить("ВидСтавки", "КБД");
		Иначе
			СрокДоПогашения = Окр(СрокДоПогашения, 4);
			ПараметрыРасшифровки.Вставить("СрокДоПогашения", СрокДоПогашения);
			
			РыночнаяСтавка = РассчитатьЗначениеКривойБескупоннойДоходностиИнтерполяцией(СрокДоПогашения, СтрокаАктивы.ДатаПроверкиНаРыночность, Отказ, ПараметрыРасшифровки);
			ПараметрыРасшифровки.Вставить("ВидСтавки", "КБД");
		КонецЕсли;
	КонецЕсли;
	
	СтрокаАктивы.ПроцентПоАктиву = РыночнаяСтавка;
	ПараметрыРасшифровки.Вставить("Ставка", РыночнаяСтавка);
	
	СтрокаАктивы.АдресРасшифровкиКБД_MosPrime = ПоместитьВоВременноеХранилище(ПараметрыРасшифровки);

КонецПроцедуры

Функция КоэффициентКорректировкиКБД(Период, Отказ)
	
	Результат = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыКривойБескупоннойДоходностиСрезПоследних.Период КАК Период,
		|	ПараметрыКривойБескупоннойДоходностиСрезПоследних.ВидПараметра КАК ВидПараметра
		|ПОМЕСТИТЬ _ДатаКБД
		|ИЗ
		|	РегистрСведений.ПараметрыКривойБескупоннойДоходности.СрезПоследних(&Период, ВидПараметра = ЗНАЧЕНИЕ(Перечисление.ВидыКривойБескупоннойДоходности.Текущее2017)) КАК ПараметрыКривойБескупоннойДоходностиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДатаКБД.Период КАК ПериодКБД,
		|	_ДатаКБД.ВидПараметра КАК ВидПараметра,
		|	КлючеваяНаДатуКБД.ДатаЗначения КАК КлючеваяНаДатуКБДДатаЗначения,
		|	ISNULL(КлючеваяНаДатуКБД.ЗначениеПоказателя, 0) КАК КлючеваяНаДатуКБДЗначениеПоказателя,
		|	КлючеваяНаДатуОценки.ДатаЗначения КАК КлючеваяНаДатуОценкиДатаЗначения,
		|	ISNULL(КлючеваяНаДатуОценки.ЗначениеПоказателя, 0) КАК КлючеваяНаДатуОценкиЗначениеПоказателя
		|ИЗ
		|	_ДатаКБД КАК _ДатаКБД,
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПроцентныеПоказатели.ДатаЗначения КАК ДатаЗначения,
		|		ПроцентныеПоказатели.ЗначениеПоказателя КАК ЗначениеПоказателя
		|	ИЗ
		|		_ДатаКБД КАК _ДатаКБД
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|			ПО (ПроцентныеПоказатели.Период <= _ДатаКБД.Период)
		|				И (ПроцентныеПоказатели.ДатаЗначения <= _ДатаКБД.Период)
		|	ГДЕ
		|		ПроцентныеПоказатели.Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|		И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|		ПроцентныеПоказатели.Период УБЫВ) КАК КлючеваяНаДатуКБД,
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПроцентныеПоказатели.ДатаЗначения КАК ДатаЗначения,
		|		ПроцентныеПоказатели.ЗначениеПоказателя КАК ЗначениеПоказателя
		|	ИЗ
		|		РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|	ГДЕ
		|		ПроцентныеПоказатели.Показатель = ЗНАЧЕНИЕ(Перечисление.ВидыПроцентныхПоказателей.КлючеваяСтавкаЦБРФ)
		|		И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|		И ПроцентныеПоказатели.Период <= &Период
		|		И ПроцентныеПоказатели.ДатаЗначения <= &Период
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|		ПроцентныеПоказатели.Период УБЫВ) КАК КлючеваяНаДатуОценки";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.КлючеваяНаДатуКБДЗначениеПоказателя = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить коэффициент корректировки ставки КБД на "+Формат(Период,"ДФ=dd.MM.yyyy"),,,,Отказ);
		Иначе
			Результат = ВыборкаДетальныеЗаписи.КлючеваяНаДатуОценкиЗначениеПоказателя / ВыборкаДетальныеЗаписи.КлючеваяНаДатуКБДЗначениеПоказателя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение КБД в процентах, определяется интерполяцией значений щкалы, которую дает ММВБ
Функция РассчитатьЗначениеКривойБескупоннойДоходностиИнтерполяцией(СрокДоПогашения, ДатаРасчета, Отказ, ПараметрыРасшифровки) Экспорт

	ШкалаСроковММВБ = Новый Массив;
	
	ШкалаСроковММВБ.Добавить(0.25);
	ШкалаСроковММВБ.Добавить(0.5);
	ШкалаСроковММВБ.Добавить(0.75);
	ШкалаСроковММВБ.Добавить(1);
	ШкалаСроковММВБ.Добавить(2);
	ШкалаСроковММВБ.Добавить(3);
	ШкалаСроковММВБ.Добавить(5);
	ШкалаСроковММВБ.Добавить(7);
	ШкалаСроковММВБ.Добавить(10);
	ШкалаСроковММВБ.Добавить(15);
	ШкалаСроковММВБ.Добавить(20);
	ШкалаСроковММВБ.Добавить(30);
	
	//если срок совпадает со значением шкалы, то вернем его
	Если ШкалаСроковММВБ.Найти(СрокДоПогашения) <> Неопределено Тогда
		ПараметрыРасшифровки.Вставить("НаиболееБлизкийПредыдущийСрокДоПогашения", СрокДоПогашения);
		Возврат Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаРасчета, СрокДоПогашения, , Отказ), 2);
	КонецЕсли;
	
	Dmin = 100;
	Dmax = 0; 
	V0 = 0;
	V1 = 100; 
	Для Каждого СрокШкалы ИЗ ШкалаСроковММВБ Цикл
		Если СрокДоПогашения < СрокШкалы И V1 > СрокШкалы Тогда
			V1 = СрокШкалы;
		ИначеЕсли СрокДоПогашения > СрокШкалы И V0 < СрокШкалы Тогда
			V0 = СрокШкалы;
		КонецЕсли;
		Если Dmin > СрокШкалы Тогда
			Dmin = СрокШкалы;
		КонецЕсли;
		Если Dmax < СрокШкалы Тогда
			Dmax = СрокШкалы;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыРасшифровки.Вставить("МинимальныйСрок", Dmin);
	ПараметрыРасшифровки.Вставить("МаксимальныйСрок", Dmax);
	ПараметрыРасшифровки.Вставить("НаиболееБлизкийПредыдущийСрокДоПогашения", V0);
	ПараметрыРасшифровки.Вставить("НаиболееБлизкийПоследующийСрокДоПогашения", V1);
	
	Если ДатаРасчета >= Дата(2021,12,30) Тогда
		ТочностьКБД = 4;
	Иначе
		ТочностьКБД = 2;
	КонецЕсли;
	
	Если СрокДоПогашения > Dmax Тогда
		Возврат Окр(Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаРасчета, Dmax, , Отказ), ТочностьКБД), 2);
	ИначеЕсли СрокДоПогашения < Dmin Тогда
		Возврат Окр(Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаРасчета, Dmin, , Отказ), ТочностьКБД), 2);
	Иначе
		K0 = Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаРасчета, V0, , Отказ), ТочностьКБД);
		K1 = Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаРасчета, V1, , Отказ), ТочностьКБД);
		
		ПараметрыРасшифровки.Вставить("СтавкаНаиболееБлизкогоПредыдущегоСрокаДоПогашения", K0);
		ПараметрыРасшифровки.Вставить("СтавкаНаиболееБлизкогоПоследующегоСрокаДоПогашения", K1);
		
		Возврат Окр(K0 + (СрокДоПогашения - V0)/(V1 -V0)*(K1 - K0), 2);
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#Область ДополнительныеФункции

Функция ПолучитьТаблицуАктивов() 
	
	МассивТиповАктивов = Новый Массив;
	МассивТиповАктивов.Добавить(Тип("СправочникСсылка.ДепозитныеВклады"));
	МассивТиповАктивов.Добавить(Тип("СправочникСсылка.Займы"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.Сделка"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.МНО"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.ЗакрытиеКредитногоИнструмента"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.Оплата"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.НачислениеЗадолженности"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.СделкаСНедвижимостью"));
	МассивТиповАктивов.Добавить(Тип("СправочникСсылка.Договоры"));
	МассивТиповАктивов.Добавить(Тип("ДокументСсылка.ПриходПроцентовПоКредитномуИнструменту"));
	
	Активы = Новый ТаблицаЗначений;
	Активы.Колонки.Добавить("Актив"					, Новый ОписаниеТипов(МассивТиповАктивов));
	Активы.Колонки.Добавить("ВидАктива"				, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыАктивовДляПроверкиНаРыночность"));
	Активы.Колонки.Добавить("Валюта"				, Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Активы.Колонки.Добавить("ДатаРегистрации"		, Новый ОписаниеТипов("Дата"));
	Активы.Колонки.Добавить("ДатаПогашения"			, Новый ОписаниеТипов("Дата"));
	Активы.Колонки.Добавить("ЭтоДенежныйПоток"		, Новый ОписаниеТипов("Булево"));
	Активы.Колонки.Добавить("Номинал"				, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("Проценты"				, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("ПроцентыЭСП"			, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("Задолженность"			, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("Комиссия"				, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("Ставка"				, Новый ОписаниеТипов("Число"));
	Активы.Колонки.Добавить("СуммаРезерва"			, Новый ОписаниеТипов("Число"));
	
	Возврат Активы;
	
КонецФункции
	
#КонецОбласти

#Область Задолженности

//помещает во временную таблицу _ДатыСменыСрокаПолнойОплаты 
//	последнюю дату изменения срока полной оплаты и срок полной оплаты 
//	по основаниям таблицы _ЗадолженностиПоДенежнымСредствамОстатки, 
//	для которых плановые даты оплаты задаются графиком
Процедура РассчитатьДатыИзмененияСрокаПолногоПогашенияЗадолженностейПоГрафику(Запрос)
	
	//В подзапрос _ПолныеДанныеГрафика собираются полные данные графика, 
	//		соответствующие каждой дате изменений (Период), ограниченные по &КонецПериода
	//Во временную таблицу _ДатыИзмененийИСрокиВыплатыПоГрафику помещается 
	//		максимальная дата платежа (срок полной оплаты) для каждой даты изменний
	// Пример данных в таблице _ДатыИзмененийИСрокиВыплатыПоГрафику на примере одного основания:
	//	Период 		ДатаПлатежа
	//	31.03.2021	01.06.2023
	//	06.07.2021	31.12.2025
	//	07.02.2022	31.12.2025
	//	30.09.2022	31.12.2025
	//	24.05.2023	30.06.2024
	//Далее в подзапрос _ДатыСменыУсловийСПериодами помещаются даты смены условий для каждого периода. 
	//		Если смены условий не было, то устанавливается дата первых условий
	//Для приведенного выше примера _ДатыСменыУсловийСПериодами будет содержать:
	//	Период 		ДатаСменыУсловий
	//	31.03.2021	06.07.2021
	//	06.07.2021	24.05.2023
	//	07.02.2022	24.05.2023
	//	30.09.2022	24.05.2023
	//	24.05.2023	NULL
	//В подзапрос _ДатыСменыСрокаПолнойОплаты для каждого основания помещается самая поздняя дата смены условий
	//Для примера:
	//	 ДатаСменыУсловий
	//	 24.05.2023
	//Во временную таблицу _ДатыСменыСрокаПолнойОплаты помещается дата смены условия 
	//	и соответствующий ей срок полной оплаты
	//Для примера:
	//	 ДатаСменыУсловий	ДатаПлатежа
	//	 24.05.2023         30.06.2024
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПолныеДанныеГрафика.Основание КАК Основание,
		|	_ПолныеДанныеГрафика.Период КАК Период,
		|	МАКСИМУМ(_ПолныеДанныеГрафика.ДатаПлатежа) КАК ДатаПлатежа
		|ПОМЕСТИТЬ _ДатыИзмененийИСрокиВыплатыПоГрафику
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДатыСменыГрафика.Основание КАК Основание,
		|		_ДатыСменыГрафика.Период КАК Период,
		|		_ДатыСменыГрафика.ДатаПлатежа КАК ДатаПлатежа,
		|		ГрафикиПлатежей.Действует КАК Действует
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ГрафикиПлатежей.Основание КАК Основание,
		|			ГрафикиПлатежей.Период КАК Период,
		|			ГрафикиПлатежей1.ДатаПлатежа КАК ДатаПлатежа,
		|			МАКСИМУМ(ГрафикиПлатежей1.Период) КАК МаксимальнаяДатаУстановкиПотока
		|		ИЗ
		|			_ЗадолженностиПоДенежнымСредствамОстатки КАК _ЗадолженностиПоДенежнымСредствамОстатки
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПлатежей КАК ГрафикиПлатежей
		|				ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = ГрафикиПлатежей.Основание
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПлатежей КАК ГрафикиПлатежей1
		|				ПО (ГрафикиПлатежей.Основание = ГрафикиПлатежей1.Основание)
		|					И (ГрафикиПлатежей.Период >= ГрафикиПлатежей1.Период)
		|					И (ГрафикиПлатежей.Период <= &КонецПериода)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрафикиПлатежей.Основание,
		|			ГрафикиПлатежей.Период,
		|			ГрафикиПлатежей1.ДатаПлатежа) КАК _ДатыСменыГрафика
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиПлатежей КАК ГрафикиПлатежей
		|			ПО _ДатыСменыГрафика.Основание = ГрафикиПлатежей.Основание
		|				И _ДатыСменыГрафика.ДатаПлатежа = ГрафикиПлатежей.ДатаПлатежа
		|				И _ДатыСменыГрафика.МаксимальнаяДатаУстановкиПотока = ГрафикиПлатежей.Период
		|				И (ГрафикиПлатежей.Действует)) КАК _ПолныеДанныеГрафика
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПолныеДанныеГрафика.Основание,
		|	_ПолныеДанныеГрафика.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыСменыСрокаПолнойОплаты.Основание КАК Основание,
		|	_ДатыСменыСрокаПолнойОплаты.ДатаСменыУсловий КАК ДатаСменыУсловий,
		|	_ДатыИзмененийИСрокиВыплатыПоГрафику.ДатаПлатежа КАК ДатаПлатежа
		|ПОМЕСТИТЬ _ДатыСменыСрокаПолнойОплаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДатыСменыУсловийСПериодами.Основание КАК Основание,
		|		ЕСТЬNULL(МАКСИМУМ(_ДатыСменыУсловийСПериодами.ДатаСменыУсловий), МИНИМУМ(_ДатыСменыУсловийСПериодами.Период)) КАК ДатаСменыУсловий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ДатыИзмененийИСрокиВыплаты.Основание КАК Основание,
		|			_ДатыИзмененийИСрокиВыплаты.Период КАК Период,
		|			МИНИМУМ(_ДатыИзмененийИСрокиВыплаты1.Период) КАК ДатаСменыУсловий
		|		ИЗ
		|			_ДатыИзмененийИСрокиВыплатыПоГрафику КАК _ДатыИзмененийИСрокиВыплаты
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ДатыИзмененийИСрокиВыплатыПоГрафику КАК _ДатыИзмененийИСрокиВыплаты1
		|				ПО _ДатыИзмененийИСрокиВыплаты.Основание = _ДатыИзмененийИСрокиВыплаты1.Основание
		|					И _ДатыИзмененийИСрокиВыплаты.Период < _ДатыИзмененийИСрокиВыплаты1.Период
		|					И _ДатыИзмененийИСрокиВыплаты.ДатаПлатежа <> _ДатыИзмененийИСрокиВыплаты1.ДатаПлатежа
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДатыИзмененийИСрокиВыплаты.Основание,
		|			_ДатыИзмененийИСрокиВыплаты.Период) КАК _ДатыСменыУсловийСПериодами
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДатыСменыУсловийСПериодами.Основание) КАК _ДатыСменыСрокаПолнойОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыИзмененийИСрокиВыплатыПоГрафику КАК _ДатыИзмененийИСрокиВыплатыПоГрафику
		|		ПО _ДатыСменыСрокаПолнойОплаты.Основание = _ДатыИзмененийИСрокиВыплатыПоГрафику.Основание
		|			И _ДатыСменыСрокаПолнойОплаты.ДатаСменыУсловий = _ДатыИзмененийИСрокиВыплатыПоГрафику.Период";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьСправедливыеСтоимостиЗадолженностей(Параметры, Запрос, Отказ, МенеджерВременныхТаблицРасшифровки = Неопределено) Экспорт
	
	Если Запрос = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("Организация", 				  	Параметры.Организация);
		Запрос.УстановитьПараметр("Период", 				  	  	Новый Граница(КонецДня(Параметры.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонецПериода", 				  	КонецДня(Параметры.Период));
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Параметры.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ВариантРасчетаОценочнойСтоимости",  	Параметры.ВариантРасчетаОценочнойСтоимости);
		
		Справочники.ВариантыРасчетаОценочнойСтоимости.ПолучитьЗадолженностиПоСделкамСРаздельнымИсполнением(
			Параметры.ВариантРасчетаОценочнойСтоимости,
			Параметры.Организация,
			Параметры.СчетДоверительногоУправления, 
			Параметры.Период,
			Параметры.ЦельРасчета,
			Отказ,
			Запрос.МенеджерВременныхТаблиц);
			
		СтоимостиПросроченнойДебиторки = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиПросроченныхЗаймовПоСчетуДоверительногоУправления(
			Параметры.СчетДоверительногоУправления,
			КонецДня(Параметры.Период),
			Ложь, ,
			Отказ);
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(СтоимостиПросроченнойДебиторки, "_СтоимостиПросроченнойДебиторки0", Запрос.МенеджерВременныхТаблиц);

		Справочники.ВариантыРасчетаОценочнойСтоимости.ПоместитьЗадолженностиПоДенежнымСредствамВМенеджерВременныхТаблиц(Запрос);
	КонецЕсли;
	
	РассчитатьДатыИзмененияСрокаПолногоПогашенияЗадолженностейПоГрафику(Запрос);
	
	//отбираем неоперационую задолженность
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ОснованиеЗадолженности КАК ОснованиеЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	СУММА(_ЗадолженностиПоДенежнымСредствамОстатки.Сумма) КАК Сумма,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ДатаПогашения КАК ДатаПогашения,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ДатаВозникновения КАК ДатаРегистрации,
		|	0 КАК ПроцентыЭСП,
		|	0 КАК СуммаРезерва
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|		_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|		_ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|		_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК ОснованиеЗадолженности,
		|		_ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|		_ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + _ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК Сумма,
		|		ВЫБОР
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).Дата
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					И НЕ ПлановыеДатыОплатСрезПоследних.ДатаОплаты ЕСТЬ NULL
		|				ТОГДА ПлановыеДатыОплатСрезПоследних.ДатаОплаты
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|					И НЕ ПлановыеДатыОплатСрезПоследних.ДатаОплаты ЕСТЬ NULL
		|				ТОГДА ПлановыеДатыОплатСрезПоследних.ДатаОплаты
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПриходПроцентовПоКредитномуИнструменту
		|					И НЕ ПлановыеДатыОплатСрезПоследних.ДатаОплаты ЕСТЬ NULL
		|				ТОГДА ПлановыеДатыОплатСрезПоследних.ДатаОплаты
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		КОНЕЦ КАК ДатаПогашения,
		|		ВЫБОР
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).Дата
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).Дата
		|			КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПриходПроцентовПоКредитномуИнструменту
		|				ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.ПриходПроцентовПоКредитномуИнструменту).Дата
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		КОНЕЦ КАК ДатаВозникновения
		|	ИЗ
		|		_ЗадолженностиПоДенежнымСредствамОстатки КАК _ЗадолженностиПоДенежнымСредствамОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И (Основание, ВидЗадолженности, Валюта) В
		|							(ВЫБРАТЬ
		|								_ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|								_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|								_ЗадолженностиПоДенежнымСредствамОстатки.Валюта
		|							ИЗ
		|								_ЗадолженностиПоДенежнымСредствамОстатки КАК _ЗадолженностиПоДенежнымСредствамОстатки)) КАК ПлановыеДатыОплатСрезПоследних
		|			ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = ПлановыеДатыОплатСрезПоследних.Основание
		|				И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ПлановыеДатыОплатСрезПоследних.ВидЗадолженности
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|			ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = НачислениеЗадолженности.Ссылка
		|				И (НачислениеЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть)))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ПО (НачислениеЗадолженности.Договор = Договоры.Ссылка)
		|				И (Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбесценениеАктивов.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ТИПЗНАЧЕНИЯ(Актив) = ТИП(Справочник.Договоры)) КАК ОбесценениеАктивовСрезПоследних
		|			ПО (Договоры.Ссылка = ОбесценениеАктивовСрезПоследних.Актив)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДатыСменыСрокаПолнойОплаты КАК _ДатыСменыСрокаПолнойОплаты
		|			ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = _ДатыСменыСрокаПолнойОплаты.Основание
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ_УКПИ)
		|					ТОГДА ВЫБОР
		|							КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|									И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗайму), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты))
		|								ТОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента
		|										ИЛИ _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПриходПроцентовПоКредитномуИнструменту
		|							КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|									И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАренде), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоАрендеПеременнаяЧасть))
		|									И ЕСТЬNULL(ОбесценениеАктивовСрезПоследних.Коэффициент, 1) <> 1
		|								ТОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|							КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|									И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|									И _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаСНедвижимостью
		|								ТОГДА &КонецПериода < ДАТАВРЕМЯ(2023, 9, 1)
		|										ИЛИ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(_ДатыСменыСрокаПолнойОплаты.ДатаСменыУсловий, ДАТАВРЕМЯ(1, 1, 1)), ГОД, 1) < ЕСТЬNULL(_ДатыСменыСрокаПолнойОплаты.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1))
		|							КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|									И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПолучениюВАренду))
		|								ТОГДА _ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.СделкаСНедвижимостью
		|							КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|								ТОГДА &КонецПериода < ДАТАВРЕМЯ(2023, 9, 1)
		|											И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ), ГОД, 1) <= ЕСТЬNULL(ПлановыеДатыОплатСрезПоследних.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))
		|										ИЛИ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПлановыеДатыОплатСрезПоследних.Период, ДЕНЬ), ГОД, 1) <= ЕСТЬNULL(ПлановыеДатыОплатСрезПоследних.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Валюта,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ВидЗадолженности,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ТипЗадолженности,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Договор,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Контрагент,
		|		СУММА(ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Сумма),
		|		МАКСИМУМ(ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ДатаПогашения),
		|		МИНИМУМ(ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ДатаВозникновения)
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОснованияЗадолженностейСДатамиПогашения.Валюта КАК Валюта,
		|			ОснованияЗадолженностейСДатамиПогашения.ВидЗадолженности КАК ВидЗадолженности,
		|			ОснованияЗадолженностейСДатамиПогашения.ТипЗадолженности КАК ТипЗадолженности,
		|			ОснованияЗадолженностейСДатамиПогашения.Основание КАК Основание,
		|			ОснованияЗадолженностейСДатамиПогашения.Договор КАК Договор,
		|			ОснованияЗадолженностейСДатамиПогашения.Контрагент КАК Контрагент,
		|			ОснованияЗадолженностейСДатамиПогашения.Сумма КАК Сумма,
		|			ОснованияЗадолженностейСДатамиПогашения.ДатаПогашения КАК ДатаПогашения,
		|			МИНИМУМ(ЗадолженностиПоДенежнымСредствам.Период) КАК ДатаВозникновения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|				Оплата.Договор КАК Договор,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|				СУММА(_ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + _ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток) КАК Сумма,
		|				МАКСИМУМ(ЕСТЬNULL(ПлановыеДатыОплатСрезПоследних.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаПогашения
		|			ИЗ
		|				_ЗадолженностиПоДенежнымСредствамОстатки КАК _ЗадолженностиПоДенежнымСредствамОстатки
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|					ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = Оплата.Ссылка
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|							&Период,
		|							Организация = &Организация
		|								И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|								И (Основание, ВидЗадолженности, Валюта) В
		|									(ВЫБРАТЬ
		|										_ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|										_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|										_ЗадолженностиПоДенежнымСредствамОстатки.Валюта
		|									ИЗ
		|										_ЗадолженностиПоДенежнымСредствамОстатки КАК _ЗадолженностиПоДенежнымСредствамОстатки
		|									ГДЕ
		|										_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)))) КАК ПлановыеДатыОплатСрезПоследних
		|					ПО _ЗадолженностиПоДенежнымСредствамОстатки.Основание = ПлановыеДатыОплатСрезПоследних.Основание
		|						И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности = ПлановыеДатыОплатСрезПоследних.ВидЗадолженности
		|			ГДЕ
		|				ВЫБОР
		|						КОГДА &ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ_УКПИ)
		|							ТОГДА ВЫБОР
		|									КОГДА _ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|											И _ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|										ТОГДА ИСТИНА
		|									ИНАЧЕ ЛОЖЬ
		|								КОНЕЦ
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|				_ЗадолженностиПоДенежнымСредствамОстатки.Контрагент,
		|				Оплата.Договор) КАК ОснованияЗадолженностейСДатамиПогашения
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|				ПО ОснованияЗадолженностейСДатамиПогашения.ТипЗадолженности = ЗадолженностиПоДенежнымСредствам.ТипЗадолженности
		|					И ОснованияЗадолженностейСДатамиПогашения.ВидЗадолженности = ЗадолженностиПоДенежнымСредствам.ВидЗадолженности
		|					И ОснованияЗадолженностейСДатамиПогашения.Основание = ЗадолженностиПоДенежнымСредствам.Основание
		|					И (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
		|					И (ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|					И (ЗадолженностиПоДенежнымСредствам.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОснованияЗадолженностейСДатамиПогашения.Валюта,
		|			ОснованияЗадолженностейСДатамиПогашения.ВидЗадолженности,
		|			ОснованияЗадолженностейСДатамиПогашения.ТипЗадолженности,
		|			ОснованияЗадолженностейСДатамиПогашения.Основание,
		|			ОснованияЗадолженностейСДатамиПогашения.Договор,
		|			ОснованияЗадолженностейСДатамиПогашения.Контрагент,
		|			ОснованияЗадолженностейСДатамиПогашения.Сумма,
		|			ОснованияЗадолженностейСДатамиПогашения.ДатаПогашения) КАК ОснованияЗадолженностейСДатамиПогашенияИВозникновения
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Валюта,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ВидЗадолженности,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.ТипЗадолженности,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Договор,
		|		ОснованияЗадолженностейСДатамиПогашенияИВозникновения.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.Валюта,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.ВидЗадолженности,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.ТипЗадолженности,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.ОснованиеЗадолженности,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.Контрагент,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.Сумма,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.ДатаПогашения,
		|		СделкиСРаздельнымИсполнениемИСрокомПогашения.ДатаВозникновенияЗадолженности
		|	ИЗ
		|		(ВЫБРАТЬ
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Валюта КАК Валюта,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ВидЗадолженности КАК ВидЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ТипЗадолженности КАК ТипЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности КАК ОснованиеЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Контрагент КАК Контрагент,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Сумма КАК Сумма,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ДатаПогашения КАК ДатаПогашения,
		|			НачалоИсполенияПоСделкам.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК РабочихДнейОтВозникновенияДоПогашения
		|		ИЗ
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением КАК _ЗадолженностиПоСделкамСРаздельнымИсполнением
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					МИНИМУМ(ИсполениеПоСделкам.Период) КАК ДатаВозникновенияЗадолженности,
		|					ИсполениеПоСделкам.Основание КАК Основание
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗадолженностиПоДенежнымСредствам.Период КАК Период,
		|						ЗадолженностиПоДенежнымСредствам.Основание КАК Основание
		|					ИЗ
		|						РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|					ГДЕ
		|						ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|						И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ЗадолженностиПоДенежнымСредствам.Основание В
		|								(ВЫБРАТЬ
		|									_ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности
		|								ИЗ
		|									_ЗадолженностиПоСделкамСРаздельнымИсполнением КАК _ЗадолженностиПоСделкамСРаздельнымИсполнением)
		|						И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|						И ЗадолженностиПоДенежнымСредствам.Период <= &КонецПериода
		|					
		|					ОБЪЕДИНИТЬ ВСЕ
		|					
		|					ВЫБРАТЬ
		|						ЗадолженностиПоЦеннымБумагам.Период,
		|						ЗадолженностиПоЦеннымБумагам.Основание
		|					ИЗ
		|						РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|					ГДЕ
		|						ЗадолженностиПоЦеннымБумагам.Организация = &Организация
		|						И ЗадолженностиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И ЗадолженностиПоЦеннымБумагам.Основание В
		|								(ВЫБРАТЬ
		|									_ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности
		|								ИЗ
		|									_ЗадолженностиПоСделкамСРаздельнымИсполнением КАК _ЗадолженностиПоСделкамСРаздельнымИсполнением)
		|						И ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|						И ЗадолженностиПоЦеннымБумагам.Период <= &КонецПериода
		|					
		|					ОБЪЕДИНИТЬ ВСЕ
		|					
		|					ВЫБРАТЬ
		|						ВЫБОР
		|							КОГДА АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|								ТОГДА СведенияОРегистрацииПраваСобственности.Дата
		|							КОГДА СведенияОРегистрацииПраваСобственности.Ссылка ЕСТЬ NULL
		|								ТОГДА АктПриемаПередачиОбъектовНедвижимости.Дата
		|							КОГДА АктПриемаПередачиОбъектовНедвижимости.Дата > СведенияОРегистрацииПраваСобственности.Дата
		|								ТОГДА СведенияОРегистрацииПраваСобственности.Дата
		|							ИНАЧЕ АктПриемаПередачиОбъектовНедвижимости.Дата
		|						КОНЕЦ,
		|						УсловияСделокСНедвижимостьюСрезПоследних.Основание
		|					ИЗ
		|						РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|								&КонецПериода,
		|								Организация = &Организация
		|									И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|									И Основание В
		|										(ВЫБРАТЬ
		|											_ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности
		|										ИЗ
		|											_ЗадолженностиПоСделкамСРаздельнымИсполнением КАК _ЗадолженностиПоСделкамСРаздельнымИсполнением)) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемаПередачиОбъектовНедвижимости КАК АктПриемаПередачиОбъектовНедвижимости
		|							ПО УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = АктПриемаПередачиОбъектовНедвижимости.Ссылка
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности КАК СведенияОРегистрацииПраваСобственности
		|							ПО УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности = СведенияОРегистрацииПраваСобственности.Ссылка
		|					ГДЕ
		|						НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|						И (НЕ АктПриемаПередачиОбъектовНедвижимости.Ссылка ЕСТЬ NULL
		|								ИЛИ НЕ СведенияОРегистрацииПраваСобственности.Ссылка ЕСТЬ NULL)) КАК ИсполениеПоСделкам
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ИсполениеПоСделкам.Основание) КАК НачалоИсполенияПоСделкам
		|				ПО _ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности = НачалоИсполенияПоСделкам.Основание
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|				ПО _ЗадолженностиПоСделкамСРаздельнымИсполнением.ДатаПогашения >= ДанныеКалендаря.Дата
		|					И (НачалоИсполенияПоСделкам.ДатаВозникновенияЗадолженности < ДанныеКалендаря.Дата)
		|		ГДЕ
		|			ДанныеКалендаря.Календарь = &Календарь
		|			И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Валюта,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ВидЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ТипЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ОснованиеЗадолженности,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Контрагент,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.Сумма,
		|			_ЗадолженностиПоСделкамСРаздельнымИсполнением.ДатаПогашения,
		|			НачалоИсполенияПоСделкам.ДатаВозникновенияЗадолженности) КАК СделкиСРаздельнымИсполнениемИСрокомПогашения
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ_УКПИ)
		|					ТОГДА СделкиСРаздельнымИсполнениемИСрокомПогашения.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью))
		|							И СделкиСРаздельнымИсполнениемИСрокомПогашения.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|							И СделкиСРаздельнымИсполнениемИСрокомПогашения.РабочихДнейОтВозникновенияДоПогашения > 15
		|				КОГДА &ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ2018)
		|					ТОГДА СделкиСРаздельнымИсполнениемИСрокомПогашения.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|							И СделкиСРаздельнымИсполнениемИСрокомПогашения.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|							И &КонецПериода >= ДАТАВРЕМЯ(2020, 1, 1)
		|				КОГДА &ВариантРасчетаОценочнойСтоимости = ЗНАЧЕНИЕ(Справочник.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ2021)
		|					ТОГДА СделкиСРаздельнымИсполнениемИСрокомПогашения.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|							И СделкиСРаздельнымИсполнениемИСрокомПогашения.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Займы.Валюта,
		|		ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|		_СтоимостиПросроченнойДебиторки0.Основание,
		|		УсловияКредитныхИнструментовСрезПоследних.Контрагент,
		|		_СтоимостиПросроченнойДебиторки0.Проценты,
		|		ВЫРАЗИТЬ(_СтоимостиПросроченнойДебиторки0.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).Дата,
		|		ВЫРАЗИТЬ(_СтоимостиПросроченнойДебиторки0.Основание КАК Документ.ЗакрытиеКредитногоИнструмента).Дата
		|	ИЗ
		|		_СтоимостиПросроченнойДебиторки0 КАК _СтоимостиПросроченнойДебиторки0
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|					УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|					УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|					УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|					УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|				ИЗ
		|					(ВЫБРАТЬ
		|						УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|						МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|					ИЗ
		|						РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|								&Период,
		|								ДатаНачалаДействияУсловий <= &КонецПериода
		|									И КредитныйИнструмент В
		|										(ВЫБРАТЬ
		|											_СтоимостиПросроченнойДебиторки0.КРедитныйИнструмент
		|										ИЗ
		|											_СтоимостиПросроченнойДебиторки0 КАК _СтоимостиПросроченнойДебиторки0)) КАК УсловияКредитныхИнструментовСрезПоследних
		|					ГДЕ
		|						УсловияКредитныхИнструментовСрезПоследних.Действует
		|					
		|					СГРУППИРОВАТЬ ПО
		|						УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|								&Период,
		|								ДатаНачалаДействияУсловий <= &КонецПериода
		|									И КредитныйИнструмент В
		|										(ВЫБРАТЬ
		|											_СтоимостиПросроченнойДебиторки0.КРедитныйИнструмент
		|										ИЗ
		|											_СтоимостиПросроченнойДебиторки0 КАК _СтоимостиПросроченнойДебиторки0)) КАК УсловияКредитныхИнструментовСрезПоследних
		|						ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|							И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО Займы.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|			ПО _СтоимостиПросроченнойДебиторки0.КРедитныйИнструмент = Займы.Ссылка
		|	ГДЕ
		|		_СтоимостиПросроченнойДебиторки0.Основание ССЫЛКА Документ.ЗакрытиеКредитногоИнструмента) КАК _ЗадолженностиПоДенежнымСредствамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ОснованиеЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.Контрагент,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ДатаПогашения,
		|	_ЗадолженностиПоДенежнымСредствамОстатки.ДатаВозникновения";
	
	Запрос.Параметры.Вставить("Календарь", Справочники.Календари.Общероссийский);
	
	ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию = Запрос.Выполнить().Выгрузить();
	
	Если Параметры.СчетДоверительногоУправления = ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Бриз") И НачалоДня(Параметры.Период) >= Дата(2025, 8, 29) Тогда
		ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию.Очистить();
		Возврат ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию;
	КонецЕсли;
	
	Если Параметры.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ_УКПИ
		ИЛИ Параметры.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ2018
		ИЛИ Параметры.ВариантРасчетаОценочнойСтоимости = Справочники.ВариантыРасчетаОценочнойСтоимости.РасчетСЧА_ЗПИФ2021 
		Тогда
		РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьЗадолженностиПоРыночнойСтавке(
				ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию, 
				Параметры.СчетДоверительногоУправления, 
				Параметры.Период, 
				Параметры.ЦельРасчета, 
				МенеджерВременныхТаблицРасшифровки,
				Отказ);
	КонецЕсли;

	//удалим строки, для которых СС не отличается от исходной суммы
	КоличествоСтрок = ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию.Количество();
	//#434641 - дефолт
	ДефолтныйЗайм = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПросрочкаЗаймаКотенко_РПИ");
	
	Для сц = 1 - КоличествоСтрок по 0 Цикл
		
		ТекСтрока = ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию.Получить(-сц);
		
		Если ТекСтрока.ПроцентыЭСП + ТекСтрока.СуммаРезерва = 0 Тогда
			
			ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию.Удалить(ТекСтрока);
			
		ИначеЕсли ТекСтрока.ОснованиеЗадолженности = ДефолтныйЗайм И НачалоДня(Параметры.Период) >= Дата(2022,6,21) Тогда
			
			Если ТекСтрока.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоЗайму Тогда
				ТекСтрока.СуммаРезерва = - (ТекСтрока.Сумма + ТекСтрока.ПроцентыЭСП) + 1;
			Иначе
				ТекСтрока.СуммаРезерва = - (ТекСтрока.Сумма + ТекСтрока.ПроцентыЭСП);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗадолженностиПоДенежнымСредствамКОбесценениюИДисконтированию;
			
КонецФункции

Функция ПолучитьПлановыеВыплатыДоговоруСтроительства(СчетДоверительногоУправления, Актив, Период) 
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ОснованиеЗадолженности", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаРезультат.Колонки.Добавить("ДатаРегистрации", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Если Справочники.Договоры.ЭтоИнвестконтракт(Актив) Тогда 
			
		Активы = Новый Массив;	
		Активы.Добавить(Актив);
		
		ТаблицаРезультат = РассчитатьПроцентыПоЗадолженностям(СчетДоверительногоУправления, Активы, Период, Истина);
		
		ТаблицаРезультат.Колонки.Добавить("ЭтоДенежныйПоток", Новый ОписаниеТипов("Булево"));
		ТаблицаРезультат.ЗаполнитьЗначения(Истина,"ЭтоДенежныйПоток");
		
		Для Каждого Строка Из ТаблицаРезультат Цикл
			Строка.Сумма = Строка.Сумма + Строка.Проценты; 
		КонецЦикла;
		
		ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки.Индекс(ТаблицаРезультат.Колонки.Найти("Проценты")));
		
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция РассчитатьПроцентыПоЗадолженностям(СчетДоверительногоУправления, Активы, Период, ДоПогашения = Ложь) Экспорт
	
	Отказ = Ложь;
	
	МассивТиповОснований = Новый Массив;
	МассивТиповОснований.Добавить(Тип("СправочникСсылка.Договоры"));
	МассивТиповОснований.Добавить(Тип("ДокументСсылка.Сделка"));

	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ВидЗадолженности", Новый ОписаниеТипов("СправочникСсылка.ВидыЗадолженности"));
	ТаблицаРезультат.Колонки.Добавить("ТипЗадолженности", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадолженности"));
	ТаблицаРезультат.Колонки.Добавить("ОснованиеЗадолженности", Новый ОписаниеТипов(МассивТиповОснований));
	ТаблицаРезультат.Колонки.Добавить("ДатаРегистрации", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаРезультат.Колонки.Добавить("Проценты", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Если СчетДоверительногоУправления.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	Договор_РПИ_Инвестконтракт_301120 	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Договор_РПИ_Инвестконтракт_301120");
	Продажа_РПИ_160522_132387 			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_160522_132387");
	Продажа_РПИ_270624_18_2 			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Продажа_РПИ_270624_18_2");
	ПроцентыПоЗайму_РПИ_011024_5_1		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_011024_5_1");
	ПроцентыПоЗайму_РПИ_090125_5_1		= ОбщегоНазначения.ПолучитьИменованныйОбъект("ПроцентыПоЗайму_РПИ_090125_5_1");
	
	ВключаяДатуНачала = Ложь;
	ВключаяДатуОкончания = Ложь;
		
	Запрос = Новый Запрос;
	
	Сделка = Неопределено;
	ДатыОпределенияСтавки = Новый Массив;
	
	Если Активы.Найти(ПроцентыПоЗайму_РПИ_011024_5_1) <> Неопределено Тогда
		Сделка = ПроцентыПоЗайму_РПИ_011024_5_1;
		ДатыОпределенияСтавки.Добавить('20241114');        // дата договора об изменения срока оплаты задолженности
		ДатыОпределенияСтавки.Добавить('20241129');        // последний рабочий день месяца. В эти даты проверяем и меняем % ставку
		ДатыОпределенияСтавки.Добавить('20241228');        // список может измениться. Могут быть частичные погащения. 
	ИначеЕсли Активы.Найти(ПроцентыПоЗайму_РПИ_090125_5_1) <> Неопределено Тогда
		Сделка = ПроцентыПоЗайму_РПИ_090125_5_1;
		ДатыОпределенияСтавки.Добавить('20250123');        // второе начисление процентов, по которым надо считать.
	КонецЕсли;
		
	Если Сделка <> Неопределено Тогда	

		ДатыОпределенияСтавки.Добавить('20250131');        // Может измениться срок погащения. Тогда этот список надо будет изменить
		ДатыОпределенияСтавки.Добавить('20250228');
		ДатыОпределенияСтавки.Добавить('20250331');   
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеДатыОплатСрезПоследних.ДатаОплаты КАК ДатаОплатыПлановая,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток, 0) КАК СуммаОстаток,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты) КАК ВидЗадолженности,
		|	&Сделка КАК ОснованиеЗадолженности,
		|	ДАТАВРЕМЯ(2024, 11, 14, 0, 0, 0) КАК ДатаРегистрации,
		|	ПлановыеДатыОплатСрезПоследних.Валюта КАК Валюта,
		|	_ПараметрыКБД.Период КАК Период,
		|	_ПараметрыКБД.beta0 КАК beta0,
		|	_ПараметрыКБД.beta1 КАК beta1,
		|	_ПараметрыКБД.beta2 КАК beta2,
		|	_ПараметрыКБД.tau КАК tau,
		|	_ПараметрыКБД.g1 КАК g1,
		|	_ПараметрыКБД.g2 КАК g2,
		|	_ПараметрыКБД.g3 КАК g3,
		|	_ПараметрыКБД.g4 КАК g4,
		|	_ПараметрыКБД.g5 КАК g5,
		|	_ПараметрыКБД.g6 КАК g6,
		|	_ПараметрыКБД.g7 КАК g7,
		|	_ПараметрыКБД.g8 КАК g8,
		|	_ПараметрыКБД.g9 КАК g9,
		|	_ПараметрыКБД.ВидПараметра КАК ВидПараметра,
		|	РАЗНОСТЬДАТ(&ПериодДата, ПлановыеДатыОплатСрезПоследних.ДатаОплаты, ДЕНЬ) / 365 КАК СрокДоПогашения,
		|	РАЗНОСТЬДАТ(_ПараметрыКБД.Период, ПлановыеДатыОплатСрезПоследних.ДатаОплаты, ДЕНЬ) / 365 КАК СрокДоПогашенияДляКБД
		|ИЗ
		|	РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|			&ПериодГраница,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание = &Сделка) КАК ПлановыеДатыОплатСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ПериодГраница,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоЗаймуПроценты)
		|					И Основание = &Сделка) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО ПлановыеДатыОплатСрезПоследних.Организация = ЗадолженностиПоДенежнымСредствамОстатки.Организация
		|			И ПлановыеДатыОплатСрезПоследних.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание,
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПараметрыКривойБескупоннойДоходности.Период КАК Период,
		|		ПараметрыКривойБескупоннойДоходности.beta0 КАК beta0,
		|		ПараметрыКривойБескупоннойДоходности.beta1 КАК beta1,
		|		ПараметрыКривойБескупоннойДоходности.beta2 КАК beta2,
		|		ПараметрыКривойБескупоннойДоходности.tau КАК tau,
		|		ПараметрыКривойБескупоннойДоходности.g1 КАК g1,
		|		ПараметрыКривойБескупоннойДоходности.g2 КАК g2,
		|		ПараметрыКривойБескупоннойДоходности.g3 КАК g3,
		|		ПараметрыКривойБескупоннойДоходности.g4 КАК g4,
		|		ПараметрыКривойБескупоннойДоходности.g5 КАК g5,
		|		ПараметрыКривойБескупоннойДоходности.g6 КАК g6,
		|		ПараметрыКривойБескупоннойДоходности.g7 КАК g7,
		|		ПараметрыКривойБескупоннойДоходности.g8 КАК g8,
		|		ПараметрыКривойБескупоннойДоходности.g9 КАК g9,
		|		ПараметрыКривойБескупоннойДоходности.ВидПараметра КАК ВидПараметра
		|	ИЗ
		|		РегистрСведений.ПараметрыКривойБескупоннойДоходности КАК ПараметрыКривойБескупоннойДоходности
		|	ГДЕ
		|		ПараметрыКривойБескупоннойДоходности.Период В(&ПериодСписок)
		|		И ПараметрыКривойБескупоннойДоходности.Период <= &ПериодДата
		|		И ПараметрыКривойБескупоннойДоходности.ВидПараметра В(&ВидКривой)
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Период УБЫВ) КАК _ПараметрыКБД";
		
		
		РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сделка, "Организация, СчетДоверительногоУправления");
		
		Запрос.УстановитьПараметр("Организация", РеквизитыСделки.Организация);
		Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодСписок", ДатыОпределенияСтавки);
		Запрос.УстановитьПараметр("ПериодДата", Период);
		Запрос.УстановитьПараметр("Сделка", Сделка);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", РеквизитыСделки.СчетДоверительногоУправления); 
		Запрос.УстановитьПараметр("ВидКривой", Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл       
			
			СтрокаПотока = ТаблицаРезультат.Добавить();
			СтрокаПотока.ВидЗадолженности 		= ВыборкаДетальныеЗаписи.ВидЗадолженности;
			СтрокаПотока.ТипЗадолженности 		= Перечисления.ТипыЗадолженности.Дебиторская;
			СтрокаПотока.ОснованиеЗадолженности = ВыборкаДетальныеЗаписи.ОснованиеЗадолженности;
			СтрокаПотока.ДатаРегистрации 		= ВыборкаДетальныеЗаписи.ДатаРегистрации;
			СтрокаПотока.Валюта 				= ВыборкаДетальныеЗаписи.Валюта;
			СтрокаПотока.Сумма 					= ВыборкаДетальныеЗаписи.СуммаОстаток;
			СтрокаПотока.Период 				= Период;
			
			//расчет дисконта 
			СтавкаКБД = Окр(РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходностиПоПараметрам(
						Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017, 
						ВыборкаДетальныеЗаписи, 
						ВыборкаДетальныеЗаписи.СрокДоПогашенияДляКБД,
						Отказ), 2);   
						
			СуммаДисконт = СтрокаПотока.Сумма - СтрокаПотока.Сумма/ pow(1 + СтавкаКБД/100, ВыборкаДетальныеЗаписи.СрокДоПогашения);
			
			СтрокаПотока.Проценты = Окр(СуммаДисконт, 2);   
			
		КонецЦикла;		
								
		Возврат ТаблицаРезультат;

	КонецЕсли;	
	
	Если Активы.Найти(Продажа_РПИ_270624_18_2) <> Неопределено И ДоПогашения Тогда 
			
		//#545082 Хардкод по начислению процентов на дебиторку		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(ЗадолженностиПоДенежнымСредствамОбороты.Период) КАК Период
			|ПОМЕСТИТЬ _ДатаПоследнейОплаты
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
			|			,
			|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
			|			День,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|				И Основание = &Сделка) КАК ЗадолженностиПоДенежнымСредствамОбороты
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплатыПлановая,
			|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток, 0) КАК СуммаОстаток,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке) КАК ВидЗадолженности,
			|	&Сделка КАК ОснованиеЗадолженности,
			|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаРегистрации,
			|	ЕСТЬNULL(_ДатаПоследнейОплаты.Период, &Период) КАК ДатаОплатыАванса,
			|	УсловияСделокСрезПоследних.ВалютаОплаты КАК Валюта
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(
			|			&ПериодГраница,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Сделка = &Сделка) КАК УсловияСделокСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|				&ПериодГраница,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
			|					И Основание = &Сделка) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ПО УсловияСделокСрезПоследних.Организация = ЗадолженностиПоДенежнымСредствамОстатки.Организация
			|			И УсловияСделокСрезПоследних.Сделка = ЗадолженностиПоДенежнымСредствамОстатки.Основание,
			|	_ДатаПоследнейОплаты КАК _ДатаПоследнейОплаты";       
	
		
		РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Продажа_РПИ_270624_18_2, "Организация, СчетДоверительногоУправления"); 
		
		Запрос.УстановитьПараметр("Организация", 					РеквизитыСделки.Организация);
		Запрос.УстановитьПараметр("ПериодГраница", 					Новый Граница(КонецДня(Период), ВидГраницы.Включая));		
		Запрос.УстановитьПараметр("Период", 						НачалоДня(Период));		
		Запрос.УстановитьПараметр("Сделка", 						Продажа_РПИ_270624_18_2);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	РеквизитыСделки.СчетДоверительногоУправления);
						
		СтавкаПроцента = 15;
		
		ВключаяДатуНачала		= Ложь;
		ВключаяДатуОкончания	= Истина;
		
	КонецЕсли;
	
	Если Активы.Найти(Договор_РПИ_Инвестконтракт_301120) <> Неопределено Тогда 
			
		//#484263. Отрабатываем только дебиторку по инвестконтрактам (возврат переплаты)		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствам.Основание КАК Ссылка,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.Оплата).Дата КАК ДатаОплатыАванса,
			|	МИНИМУМ(ЗадолженностиПоДенежнымСредствам.Период) КАК ДатаРегистрации
			|ПОМЕСТИТЬ _ОплатыПоИнвестконтракту
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
			|	И ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.Оплата).Договор = &Договор
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = &ВидЗадолженности
			|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = &ТипЗадолженности
			|	И ЗадолженностиПоДенежнымСредствам.Аванс
			|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗадолженностиПоДенежнымСредствам.Основание,
			|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствам.Основание КАК Документ.Оплата).Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
			|	ПлановыеДатыОплатСрезПоследних.ДатаОплаты КАК ДатаОплатыПлановая,
			|	_ОплатыПоИнвестконтракту.ДатаРегистрации КАК ДатаРегистрации,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
			|	_ОплатыПоИнвестконтракту.ДатаОплатыАванса КАК ДатаОплатыАванса,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту) КАК ВидЗадолженности,
			|	&Договор КАК ОснованиеЗадолженности
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Аванс
			|				И Основание В
			|					(ВЫБРАТЬ
			|						_ОплатыПоИнвестконтракту.Ссылка КАК Ссылка
			|					ИЗ
			|						_ОплатыПоИнвестконтракту КАК _ОплатыПоИнвестконтракту)
			|				И ВидЗадолженности = &ВидЗадолженности
			|				И ТипЗадолженности = &ТипЗадолженности) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
			|				&Период,
			|				Основание В
			|						(ВЫБРАТЬ
			|							_ОплатыПоИнвестконтракту.Ссылка КАК Ссылка
			|						ИЗ
			|							_ОплатыПоИнвестконтракту КАК _ОплатыПоИнвестконтракту)
			|					И ВидЗадолженности = &ВидЗадолженности
			|					И Активность
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Организация = &Организация) КАК ПлановыеДатыОплатСрезПоследних
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = ПлановыеДатыОплатСрезПоследних.Основание
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОплатыПоИнвестконтракту КАК _ОплатыПоИнвестконтракту
			|		ПО ЗадолженностиПоДенежнымСредствамОстатки.Основание = _ОплатыПоИнвестконтракту.Ссылка";
		
		Запрос.УстановитьПараметр("ВидЗадолженности", Справочники.ВидыЗадолженности.ПоИнвестконтракту);
		Запрос.УстановитьПараметр("Договор", Договор_РПИ_Инвестконтракт_301120);
		Запрос.УстановитьПараметр("Организация", Договор_РПИ_Инвестконтракт_301120.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ТипЗадолженности", Перечисления.ТипыЗадолженности.Дебиторская);
				
		СтавкаПроцента = 2.6;
		
		ВключаяДатуНачала = Истина;
		ВключаяДатуОкончания = Истина;
		
	КонецЕсли;
	
	Если Активы.Найти(Продажа_РПИ_160522_132387) <> Неопределено и Период >= Дата(2022,11,16) Тогда
			
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА &ПериодДата >= ДАТАВРЕМЯ(2023, 1, 31)
			|			ТОГДА ДОБАВИТЬКДАТЕ(УсловияСделокСрезПоследних.ДатаОплаты, ДЕНЬ, 1)
			|		ИНАЧЕ УсловияСделокСрезПоследних.ДатаОплаты
			|	КОНЕЦ КАК ДатаОплатыПлановая,
			|	СУММА(УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона) КАК СуммаОстаток,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке) КАК ВидЗадолженности,
			|	&Сделка КАК ОснованиеЗадолженности,
			|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаРегистрации,
			|	ДАТАВРЕМЯ(2023, 5, 16) КАК ДатаОплатыАванса,
			|	УсловияСделокСрезПоследних.ВалютаОплаты КАК Валюта
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Сделка = &Сделка) КАК УсловияСделокСрезПоследних
			|
			|СГРУППИРОВАТЬ ПО
			|	УсловияСделокСрезПоследних.ДатаОплаты,
			|	УсловияСделокСрезПоследних.ДатаПоставки,
			|	УсловияСделокСрезПоследних.ВалютаОплаты";
		
		Запрос.УстановитьПараметр("Организация", Продажа_РПИ_160522_132387.Организация);
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодДата", Период);
		Запрос.УстановитьПараметр("Сделка", Продажа_РПИ_160522_132387);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Продажа_РПИ_160522_132387.СчетДоверительногоУправления);
				
		СтавкаПроцента = 9;
		
		ВключаяДатуНачала = Ложь;
		//#695772 Харкод, эхо #386115 и #468527. Ранее хардкодом дата окончания смещалась на день вперёд, потому что выпадала на выходной. C 14.11.2025 новая дата окончания - рабочий день. Но на текущую дату должны включать дату окончания
		ВключаяДатуОкончания = Период < Дата(2025, 11, 14) Или Не ДоПогашения;
		
	КонецЕсли;
		
	Если Не ПустаяСтрока(Запрос.Текст) Тогда
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаПотока = ТаблицаРезультат.Добавить();
			СтрокаПотока.ВидЗадолженности 		= ВыборкаДетальныеЗаписи.ВидЗадолженности;
			СтрокаПотока.ТипЗадолженности 		= Перечисления.ТипыЗадолженности.Дебиторская;
			СтрокаПотока.ОснованиеЗадолженности = ВыборкаДетальныеЗаписи.ОснованиеЗадолженности;
			СтрокаПотока.ДатаРегистрации 		= НачалоДня(ВыборкаДетальныеЗаписи.ДатаРегистрации);
			СтрокаПотока.Валюта 				= ВыборкаДетальныеЗаписи.Валюта;
			СтрокаПотока.Сумма 					= ВыборкаДетальныеЗаписи.СуммаОстаток;
			СтрокаПотока.Период 				= ?(ДоПогашения, ВыборкаДетальныеЗаписи.ДатаОплатыПлановая, Период);
			
			//доначислим проценты
			Дни = РаботаСКредитнымиИнструментами.РасчетВисокосныхИОбычныхДней(
						ВыборкаДетальныеЗаписи.ДатаОплатыАванса + ?(ВключаяДатуНачала, 0, 86400), 
						СтрокаПотока.Период + ?(ВключаяДатуОкончания, 86400, 0), Ложь);
			
			СтрокаПотока.Проценты = СтрокаПотока.Сумма * СтавкаПроцента / 100 * (Дни["Дней365"] / 365 + Дни["Дней366"] / 366);
			
		КонецЦикла;
		
		ТаблицаРезультат.Свернуть("ОснованиеЗадолженности,ВидЗадолженности,ТипЗадолженности,ДатаРегистрации,Валюта,Период", "Сумма,Проценты");
		
		Для Каждого СтрокаПотока из ТаблицаРезультат Цикл
			СтрокаПотока.Проценты = Окр(СтрокаПотока.Проценты, 2);
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти
