
#Область Рейтинг_и_кредитный_спред

// Помещает таблицу рейтинговых групп переданных субъектов в менеджер временных таблиц
//
// Параметры
//	ИсточникВременныхТаблиц		- Запрос, МенеджерВременныхТаблиц	- источник временных таблиц
//	Субъекты					- Массив							- массив субъектов
//								- ТаблицаЗначений					- таблица субъектов, указанных в колонке "Субъект"
//								- Строка							- имя временной таблицы субъектов, указанных в колонке "Субъект"
//	Дата						- Дата								- дата получения рейтинга
//	ПараметрыРасчетаРейтинга	- Структура							- параметры расчета рейтинга
//	ИмяВременнойТаблицы			- Строка							- имя таблицы, под которым она будет создана в менеджере
//	РасшифровкаРасчета			- Структура							- структура расшифровки
//								- Неопределено						- без расшифровки
//
Процедура ПоместитьРейтинговыеГруппыСубъектовВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, Субъекты, Дата, ПараметрыРасчетаРейтинга, ИмяВременнойТаблицы = "_РейтинговыеГруппы", РасшифровкаРасчета = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СистемныеФункции.МенеджерВременныхТаблицИзИсточникаВременныхТаблиц(ИсточникВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ДатаОценки", Дата);
	
	Если ПараметрыРасчетаРейтинга.Свойство("РейтинговаяГруппа") Тогда
		
		#Область Ранее_рассчитанная_рейтинговая_группа
		
		// #Техдолг: Переписать на поиск в МВТ таблицы _РейтинговыеГруппы
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Субъект КАК Субъект,
			|	РейтинговыеГруппы.РейтинговаяГруппа КАК НомерГруппы,
			|	""Ранее рассчитанная рейтинговая группа"" КАК Описание
			|ПОМЕСТИТЬ #РейтинговыеГруппы#
			|ИЗ
			|	(ВЫБРАТЬ
			|		1 КАК РейтинговаяГруппа
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		5) КАК РейтинговыеГруппы
			|ГДЕ
			|	РейтинговыеГруппы.РейтинговаяГруппа В(&РейтинговаяГруппа)";
		
		Запрос.УстановитьПараметр("Субъект",			Субъекты);
		Запрос.УстановитьПараметр("РейтинговаяГруппа",	ПараметрыРасчетаРейтинга.РейтинговаяГруппа);
		
		#КонецОбласти		
		
	Иначе
		
		#Область Расчет_рейтинговой_группы
		
		#Область Заполняем_таблицу_субъектов		
		
		ИмяТаблицыСубъектовРейтинга = "_СубъектыРейтинга";
		
		Если ТипЗнч(Субъекты) = Тип("Массив") ИЛИ ТипЗнч(Субъекты) = Тип("ТаблицаЗначений") Тогда
			
			#Область Массив_или_таблица_субъектов
			
			Если ТипЗнч(Субъекты) = Тип("Массив") Тогда
				
				ТаблицаСубъектов = Новый ТаблицаЗначений;
				ТаблицаСубъектов.Колонки.Добавить("Субъект");
				ТаблицаСубъектов.Колонки.Добавить("ТипЗначения");
				
				Для Каждого ЭлементМассива Из Субъекты Цикл
					СтрокаТаблицыСубъектов = ТаблицаСубъектов.Добавить();
					СтрокаТаблицыСубъектов.Субъект		= ЭлементМассива;
					СтрокаТаблицыСубъектов.ТипЗначения	= ТипЗнч(ЭлементМассива);
				КонецЦикла;
				
				ТипыЗначенийСубъектов = ТаблицаСубъектов.Скопировать(Неопределено, "ТипЗначения");
				ТипыЗначенийСубъектов.Свернуть("ТипЗначения");
				
				РаботаСКоллекциями.ТаблицаЗначений_ИзменитьТипЗначенияКолонки(ТаблицаСубъектов, "Субъект", Новый ОписаниеТипов(ТипыЗначенийСубъектов.ВыгрузитьКолонку(0)));
				
				ТаблицаСубъектов.Колонки.Удалить(ТаблицаСубъектов.Колонки.Найти("ТипЗначения"));
				
			Иначе
				
				ТаблицаСубъектов = Субъекты;
				
			КонецЕсли;
			
			СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаСубъектов, ИмяТаблицыСубъектовРейтинга, Запрос);

			#КонецОбласти	
			
		ИначеЕсли ТипЗнч(Субъекты) = Тип("Строка") Тогда
			
			ИмяТаблицыСубъектовРейтинга = Субъекты; // Таблица субьектов во временных таблицах под нестандартным именем
			
		ИначеЕсли Субъекты <> Неопределено Тогда
			
			#Область Прочие_субъекты		
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Субъект КАК Субъект
				|ПОМЕСТИТЬ " + ИмяТаблицыСубъектовРейтинга;
			
			Запрос.УстановитьПараметр("Субъект", Субъекты);
			
			Запрос.Выполнить();
			
			#КонецОбласти	
			
		Иначе
			
			ВызватьИсключение "Не заполнен параметр Субъекты";
			
		КонецЕсли;
		
		#КонецОбласти		
		
		#Область Заполняем_таблицу_связанных_субъектов
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвязанныеСубъектыРейтинга.Субъект КАК Субъект,
			|	СвязанныеСубъектыРейтинга.СвязанныйСубъект КАК СвязанныйСубъект,
			|	СвязанныеСубъектыРейтинга.ВидСвязи КАК ВидСвязи,
			|	ВЫБОР
			|		КОГДА &УчитыватьПриоритетРейтингов
			|			ТОГДА СвязанныеСубъектыРейтинга.Приоритет
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Приоритет,
			|	СвязанныеСубъектыРейтинга.ПредопределеннаяРейтинговаяГруппа КАК ПредопределеннаяРейтинговаяГруппа
			|ПОМЕСТИТЬ _СвязанныеСубъектыРейтинга
			|ИЗ
			|	(ВЫБРАТЬ
			|		Облигации.Ссылка КАК Субъект,
			|		ВЫБОР
			|			КОГДА СвязиСубъектов.ВидСвязи = ""Субъект""
			|				ТОГДА Облигации.Ссылка
			|			КОГДА СвязиСубъектов.ВидСвязи = ""Эмитент""
			|				ТОГДА Облигации.Эмитент.ЮрФизЛицо
			|			КОГДА СвязиСубъектов.ВидСвязи = ""Гарант""
			|				ТОГДА Облигации.Гарант
			|			КОГДА СвязиСубъектов.ВидСвязи = ""Оригинатор""
			|				ТОГДА Облигации.Оригинатор
			|		КОНЕЦ КАК СвязанныйСубъект,
			|		СвязиСубъектов.ВидСвязи КАК ВидСвязи,
			|		СвязиСубъектов.Приоритет КАК Приоритет,
			|		ВЫБОР
			|			КОГДА СвязиСубъектов.ВидСвязи = ""Субъект""
			|					И Облигации.УчетныйАктивЦБРФ = ЗНАЧЕНИЕ(Справочник.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства)
			|					И &РейтинговаяГруппаГосударственныхОблигаций <> НЕОПРЕДЕЛЕНО
			|				ТОГДА &РейтинговаяГруппаГосударственныхОблигаций
			|			ИНАЧЕ НЕОПРЕДЕЛЕНО
			|		КОНЕЦ КАК ПредопределеннаяРейтинговаяГруппа
			|	ИЗ
			|		Справочник.Облигации КАК Облигации
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #СубъектыРейтинга# КАК _СубъектыРейтинга
			|			ПО (_СубъектыРейтинга.Субъект = Облигации.Ссылка)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|					&ДатаОценки,
			|					&УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов
			|						И (Подразделение, Язык, ЮрФизЛицо) В
			|							(ВЫБРАТЬ
			|								ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний),
			|								ЗНАЧЕНИЕ(Справочник.Языки.Русский),
			|								Облигации.Оригинатор
			|							ИЗ
			|								Справочник.Облигации КАК Облигации
			|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ #СубъектыРейтинга# КАК _СубъектыРейтинга
			|									ПО
			|										Облигации.Ссылка = _СубъектыРейтинга.Субъект
			|							ГДЕ
			|								НЕ Облигации.Оригинатор = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))) КАК РеквизитыОригинатора
			|			ПО Облигации.Оригинатор = РеквизитыОригинатора.ЮрФизЛицо,
			|		(ВЫБРАТЬ
			|			""Субъект"" КАК ВидСвязи,
			|			1 КАК Приоритет
			|		ГДЕ
			|			&РейтингЦеннойБумаги
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Эмитент"",
			|			2
			|		ГДЕ
			|			&РейтингЭмитента
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Гарант"",
			|			3
			|		ГДЕ
			|			&РейтингГаранта
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Оригинатор"",
			|			4
			|		ГДЕ
			|			&УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов) КАК СвязиСубъектов
			|	ГДЕ
			|		НЕ(СвязиСубъектов.ВидСвязи = ""Гарант""
			|					И Облигации.Гарант = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
			|		И НЕ(СвязиСубъектов.ВидСвязи = ""Оригинатор""
			|					И (Облигации.Оригинатор = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|						ИЛИ НЕ Облигации.УчетныйАктивЦБРФ В (&УчетныеАктивыОблигацийНерезидентов)
			|						ИЛИ НЕ РеквизитыОригинатора.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия), ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)))
			|					И НЕ(&БезОтбораОблигацийНерезидентовУчитывающихРейтингОригинатора
			|							ИЛИ Облигации.Ссылка В (&ОблигацииНерезидентовУчитывающиеРейтингОригинатора)))
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДепозитныеВклады.Ссылка,
			|		ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо),
			|		""Банк"",
			|		1,
			|		НЕОПРЕДЕЛЕНО
			|	ИЗ
			|		Справочник.ДепозитныеВклады КАК ДепозитныеВклады
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #СубъектыРейтинга# КАК _СубъектыРейтинга
			|			ПО (_СубъектыРейтинга.Субъект = ДепозитныеВклады.Ссылка)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаОценки, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
			|			ПО ДепозитныеВклады.БанковскийСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
			|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		МНО.Ссылка,
			|		ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, МНО.РасчетныйСчет.Банк.ЮрФизЛицо),
			|		""Банк"",
			|		1,
			|		НЕОПРЕДЕЛЕНО
			|	ИЗ
			|		Документ.МНО КАК МНО
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #СубъектыРейтинга# КАК _СубъектыРейтинга
			|			ПО (_СубъектыРейтинга.Субъект = МНО.Ссылка)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ДатаОценки, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
			|			ПО МНО.РасчетныйСчет.Банк.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
			|				И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		_СубъектыРейтинга.Субъект,
			|		_СубъектыРейтинга.Субъект,
			|		""Субъект"",
			|		1,
			|		НЕОПРЕДЕЛЕНО
			|	ИЗ
			|		#СубъектыРейтинга# КАК _СубъектыРейтинга
			|	ГДЕ
			|		НЕ ТИПЗНАЧЕНИЯ(_СубъектыРейтинга.Субъект) В (ТИП(Справочник.Облигации), ТИП(Справочник.ДепозитныеВклады), ТИП(Документ.МНО))) КАК СвязанныеСубъектыРейтинга";		
		
		Если ПараметрыРасчетаРейтинга.Свойство("РейтинговаяГруппаГосударственныхОблигаций") Тогда
			Запрос.УстановитьПараметр("РейтинговаяГруппаГосударственныхОблигаций", ПараметрыРасчетаРейтинга.РейтинговаяГруппаГосударственныхОблигаций);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РейтинговаяГруппаГосударственныхОблигаций", "НЕОПРЕДЕЛЕНО");	
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СубъектыРейтинга#", ИмяТаблицыСубъектовРейтинга);
		
		Если РасшифровкаРасчета = Неопределено
			ИЛИ СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, ИмяТаблицыСубъектовРейтинга, , "Субъект", "ТИПЗНАЧЕНИЯ(Субъект) = ТИП(Справочник.Облигации)").Выбрать().Следующий()
		Тогда
		
			#Область Параметры_рейтинга_ценных_бумаг
			
			// Старый способ фильтрации рейтингов субъектов
			
			Если ПараметрыРасчетаРейтинга.Свойство("ТолькоЭмитент")
				И ПараметрыРасчетаРейтинга.ТолькоЭмитент = Истина
			Тогда
				ПараметрыРасчетаРейтинга.Вставить("РейтингЦеннойБумаги",	Ложь);
				ПараметрыРасчетаРейтинга.Вставить("РейтингЭмитента",		Истина);
				ПараметрыРасчетаРейтинга.Вставить("РейтингГаранта",			Истина);
			КонецЕсли;				
			
			// Если не указаны субъекты, то берем все
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("РейтингЦеннойБумаги")
				И Не ПараметрыРасчетаРейтинга.Свойство("РейтингЭмитента")
				И Не ПараметрыРасчетаРейтинга.Свойство("РейтингГаранта")
			Тогда
				ПараметрыРасчетаРейтинга.Вставить("РейтингЦеннойБумаги",	Истина);
				ПараметрыРасчетаРейтинга.Вставить("РейтингЭмитента",		Истина);
				ПараметрыРасчетаРейтинга.Вставить("РейтингГаранта",			Истина);
			КонецЕсли;				
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("РейтингЦеннойБумаги") Тогда
				ПараметрыРасчетаРейтинга.Вставить("РейтингЦеннойБумаги", Ложь);
			КонецЕсли;
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("РейтингЭмитента") Тогда
				ПараметрыРасчетаРейтинга.Вставить("РейтингЭмитента", Ложь);
			КонецЕсли;
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("РейтингГаранта") Тогда
				ПараметрыРасчетаРейтинга.Вставить("РейтингГаранта", Ложь);
			КонецЕсли;
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов") Тогда
				ПараметрыРасчетаРейтинга.Вставить("УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов", Ложь);
			ИначеЕсли ПараметрыРасчетаРейтинга.УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов Тогда
				УчетныеАктивыОблигацийНерезидентов = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииНерезидентов();
			КонецЕсли;
			
			Если Не ПараметрыРасчетаРейтинга.Свойство("ОблигацииНерезидентовУчитывающиеРейтингОригинатора") Тогда
				ПараметрыРасчетаРейтинга.Вставить("ОблигацииНерезидентовУчитывающиеРейтингОригинатора", Неопределено);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("РейтингЦеннойБумаги",	ПараметрыРасчетаРейтинга.РейтингЦеннойБумаги);
			Запрос.УстановитьПараметр("РейтингЭмитента",		ПараметрыРасчетаРейтинга.РейтингЭмитента);
			Запрос.УстановитьПараметр("РейтингГаранта",			ПараметрыРасчетаРейтинга.РейтингГаранта);
			
			Запрос.УстановитьПараметр("УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов", ПараметрыРасчетаРейтинга.УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов);
			Запрос.УстановитьПараметр("УчетныеАктивыОблигацийНерезидентов",							 УчетныеАктивыОблигацийНерезидентов);
			Запрос.УстановитьПараметр("БезОтбораОблигацийНерезидентовУчитывающихРейтингОригинатора", (ПараметрыРасчетаРейтинга.ОблигацииНерезидентовУчитывающиеРейтингОригинатора = Неопределено));
			Запрос.УстановитьПараметр("ОблигацииНерезидентовУчитывающиеРейтингОригинатора",			 ПараметрыРасчетаРейтинга.ОблигацииНерезидентовУчитывающиеРейтингОригинатора);
			
			#КонецОбласти
			
		Иначе // Так в расшифровке не будет лишних параметров, но не уверен, что это хорошо архитектурно
			
			#Область Замена_параметров_рейтинга_ценных_бумаг_на_дефолтные_значения 
			
			ПараметрыРейтингаЦенныхБумаг = Новый Структура;
			ПараметрыРейтингаЦенныхБумаг.Вставить("РейтингЦеннойБумаги",										 "ЛОЖЬ");
			ПараметрыРейтингаЦенныхБумаг.Вставить("РейтингЭмитента",											 "ЛОЖЬ");
			ПараметрыРейтингаЦенныхБумаг.Вставить("РейтингГаранта",												 "ЛОЖЬ");
			ПараметрыРейтингаЦенныхБумаг.Вставить("УчитыватьРейтингРоссийскогоОригинатораОблигацийНерезидентов", "ЛОЖЬ");
			ПараметрыРейтингаЦенныхБумаг.Вставить("БезОтбораОблигацийНерезидентовУчитывающихРейтингОригинатора", "ИСТИНА");
			ПараметрыРейтингаЦенныхБумаг.Вставить("ОблигацииНерезидентовУчитывающиеРейтингОригинатора",			 "НЕОПРЕДЕЛЕНО");
			ПараметрыРейтингаЦенныхБумаг.Вставить("УчетныеАктивыОблигацийНерезидентов",							 "НЕОПРЕДЕЛЕНО");
			
			Для каждого Параметр Из ПараметрыРейтингаЦенныхБумаг Цикл
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&" + Параметр.Ключ, Параметр.Значение); 	
			КонецЦикла; 
			
			#КонецОбласти
			
		КонецЕсли;
		
		Если Не ПараметрыРасчетаРейтинга.Свойство("УчитыватьПриоритетРейтингов") Тогда
			ПараметрыРасчетаРейтинга.Вставить("УчитыватьПриоритетРейтингов", Ложь);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("УчитыватьПриоритетРейтингов", ПараметрыРасчетаРейтинга.УчитыватьПриоритетРейтингов);
		
		Запрос.Выполнить();
		
		#КонецОбласти
		
		#Область Составляем_текст_запроса_рейтингов
		
		ТекстЗапросаРейтингов =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СвязанныеСубъектыРейтинга.Субъект КАК Субъект,
			|	_СвязанныеСубъектыРейтинга.СвязанныйСубъект КАК СвязанныйСубъект,
			|	РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
			|	РейтингиСрезПоследних.Шкала КАК Шкала,
			|	РейтингиСрезПоследних.ЗначениеРейтинга КАК Рейтинг,
			|	РейтингиСрезПоследних.ЗначениеРейтинга.Оценка КАК Оценка,
			|	&ДатаОценки КАК ДатаРейтинга
			|ПОМЕСТИТЬ _Рейтинги
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&ДатаОценки,
			|				(&УчитыватьРейтингНРАТолькоДляБанков_
			|					ИЛИ &УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний_
			|					ИЛИ &УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний)
			|					И (Подразделение, Язык, ЮрФизЛицо) В
			|						(ВЫБРАТЬ
			|							ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний),
			|							ЗНАЧЕНИЕ(Справочник.Языки.Русский),
			|							_СвязанныеСубъектыРейтинга.СвязанныйСубъект
			|						ИЗ
			|							_СвязанныеСубъектыРейтинга)) КАК РеквизитыСвязанныхСубъектов
			|		ПО _СвязанныеСубъектыРейтинга.СвязанныйСубъект = РеквизитыСвязанныхСубъектов.ЮрФизЛицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Рейтинги.СрезПоследних(
			|				&ДатаОценки,
			|				(Субъект, Агрегатор) В
			|						(ВЫБРАТЬ
			|							_СвязанныеСубъектыРейтинга.СвязанныйСубъект,
			|							ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)
			|						ИЗ
			|							_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|						ГДЕ
			|							&ФильтрСвязанныхСубъектов)
			|					И Шкала.Срок = ЗНАЧЕНИЕ(Перечисление.СрокиРейтингов.Долгосрочный)
			|					И РейтинговоеАгентство В (&РейтинговыеАгентства)
			|					И &ФильтрРейтингов
			|					И (Шкала.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1)
			|						ИЛИ Шкала.ДатаПереходаВАрхив > &ДатаОценки)) КАК РейтингиСрезПоследних
			|		ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
			|			И (РейтингиСрезПоследних.ЗначениеРейтинга.РейтингСнят = ЛОЖЬ)
			|			И (РейтингиСрезПоследних.РейтинговоеАгентство <> ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.НРА)
			|				ИЛИ (НЕ &УчитыватьРейтингНРАТолькоДляБанков_
			|					ИЛИ РеквизитыСвязанныхСубъектов.Отрасль В (&Отрасль_Банки))
			|					И (НЕ &УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний_
			|						ИЛИ РеквизитыСвязанныхСубъектов.Отрасль В (&Отрасль_Банки)
			|						ИЛИ НЕ РеквизитыСвязанныхСубъектов.Отрасль В (&Отрасль_ФинансовыеКомпании)))
			|			И (РейтингиСрезПоследних.РейтинговоеАгентство <> ЗНАЧЕНИЕ(Справочник.РейтинговыеАгентства.НКР)
			|				ИЛИ НЕ &УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний
			|				ИЛИ РеквизитыСвязанныхСубъектов.Отрасль В (&Отрасль_Банки)
			|				ИЛИ НЕ РеквизитыСвязанныхСубъектов.Отрасль В (&Отрасль_ФинансовыеКомпании))";
		
		Если ПараметрыРасчетаРейтинга.Свойство("РейтинговыеАгентства") Тогда
			Запрос.УстановитьПараметр("РейтинговыеАгентства", ПараметрыРасчетаРейтинга.РейтинговыеАгентства);
		Иначе
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов, "РейтинговоеАгентство В (&РейтинговыеАгентства)", "ИСТИНА");
		КонецЕсли;
		
		#Область Учет_рейтингов_в_зависимости_от_отрасли_субъекта
		
		Отрасль_Банки				= Неопределено;
		Отрасль_ФинансовыеКомпании	= Неопределено;
		
		#Область НРА_только_для_банков
		
		УчитыватьРейтингНРАТолькоДляБанков = Ложь;
		
		Если ПараметрыРасчетаРейтинга.Свойство("УчитыватьРейтингНРАТолькоДляБанков")
			И ПараметрыРасчетаРейтинга.УчитыватьРейтингНРАТолькоДляБанков
		Тогда
			УчитыватьРейтингНРАТолькоДляБанков	= Истина;
			Отрасль_Банки						= ОбщегоНазначения.ПолучитьИменованныйОбъект("Отрасль_Банки");
			
			Запрос.УстановитьПараметр("УчитыватьРейтингНРАТолькоДляБанков", УчитыватьРейтингНРАТолькоДляБанков);
		КонецЕсли;
		
		ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов,
			"&УчитыватьРейтингНРАТолькоДляБанков_",
			?(УчитыватьРейтингНРАТолькоДляБанков, "&УчитыватьРейтингНРАТолькоДляБанков", "ЛОЖЬ"));
			
		#КонецОбласти		
		
		#Область НРА_только_для_банков_и_нефинансовых_компаний
		
		УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний = Ложь;
		
		Если ПараметрыРасчетаРейтинга.Свойство("УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний")
			И ПараметрыРасчетаРейтинга.УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний
		Тогда
			УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний	= Истина;
			Отрасль_Банки											= ОбщегоНазначения.ПолучитьИменованныйОбъект("Отрасль_Банки");
			Отрасль_ФинансовыеКомпании								= ОбщегоНазначения.ПолучитьИменованныйОбъект("Отрасль_ФинансовыеКомпании");
			
			Запрос.УстановитьПараметр("УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний", УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний);
		КонецЕсли;
		
		ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов,
			"&УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний_",
			?(УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний, "&УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний", "ЛОЖЬ"));
			
		#КонецОбласти
		
		#Область НКР_только_для_банков_и_нефинансовых_компаний
		
		УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний = Ложь;
		
		Если ПараметрыРасчетаРейтинга.Свойство("УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний")
			И ПараметрыРасчетаРейтинга.УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний
		Тогда
			УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний	= Истина;
			Отрасль_Банки											= ОбщегоНазначения.ПолучитьИменованныйОбъект("Отрасль_Банки");
			Отрасль_ФинансовыеКомпании								= ОбщегоНазначения.ПолучитьИменованныйОбъект("Отрасль_ФинансовыеКомпании");
		КонецЕсли;
		
		Если УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний Тогда
			Запрос.УстановитьПараметр("УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний", УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний);
		Иначе
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов, "&УчитыватьРейтингНКРТолькоДляБанковИНефинансовыхКомпаний", "ЛОЖЬ");			
		КонецЕсли;
		
		#КонецОбласти
		
		Если УчитыватьРейтингНРАТолькоДляБанков
			И УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний
		Тогда
			ВызватьИсключение "Параметры 'УчитыватьРейтингНРАТолькоДляБанков' и 'УчитыватьРейтингНРАТолькоДляБанковИНефинансовыхКомпаний' не могут быть заданы одновременно!";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отрасль_Банки) Тогда
			Запрос.УстановитьПараметр("Отрасль_Банки", Отрасль_Банки);
		Иначе
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов, "&Отрасль_Банки", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отрасль_ФинансовыеКомпании) Тогда
			Запрос.УстановитьПараметр("Отрасль_ФинансовыеКомпании", Отрасль_ФинансовыеКомпании);
		Иначе
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов, "&Отрасль_ФинансовыеКомпании", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;		
		
		#КонецОбласти
		
		Если ПараметрыРасчетаРейтинга.Свойство("ИсключатьДляРублевыхОблигацийРейтингFitchRatings") 
			И ПараметрыРасчетаРейтинга.ИсключатьДляРублевыхОблигацийРейтингFitchRatings = Истина
		Тогда
		
			#Область Исключение_рейтинга_Fitch_Ratings_для_рублевых_облигаций
			
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов,
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)",
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
				|			И НЕ (ТИПЗНАЧЕНИЯ(_СвязанныеСубъектыРейтинга.СвязанныйСубъект) = ТИП(Справочник.Облигации)
				|					И ВЫРАЗИТЬ(_СвязанныеСубъектыРейтинга.СвязанныйСубъект КАК Справочник.Облигации).ВалютаНоминала = &ВалютаРубли
				|					И РейтингиСрезПоследних.РейтинговоеАгентство = &FitchRatings)");		
		
			Запрос.УстановитьПараметр("FitchRatings", Справочники.РейтинговыеАгентства.FitchRatings);
			Запрос.УстановитьПараметр("ВалютаРубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
			
			#КонецОбласти
		
		КонецЕсли;
		
		Если ПараметрыРасчетаРейтинга.Свойство("ИсключатьДляРублевыхОблигацийРейтингИностранныхАгентств") 
			И ПараметрыРасчетаРейтинга.ИсключатьДляРублевыхОблигацийРейтингИностранныхАгентств = Истина
		Тогда
		
			#Область Исключение_рейтинга_иностранных_агентств_для_рублевых_облигаций
			
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов,
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)",
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
				|			И НЕ (ТИПЗНАЧЕНИЯ(_СвязанныеСубъектыРейтинга.Субъект) = ТИП(Справочник.Облигации)
				|					И ВЫРАЗИТЬ(_СвязанныеСубъектыРейтинга.Субъект КАК Справочник.Облигации).ВалютаНоминала = &ВалютаРубли
				|					И РейтингиСрезПоследних.РейтинговоеАгентство В (&ИностранныеАгентства))");		
		
			Запрос.УстановитьПараметр("ВалютаРубли",			ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
			Запрос.УстановитьПараметр("ИностранныеАгентства",	Справочники.РейтинговыеАгентства.ИностранныеРейтинговыеАгентства());
			
			#КонецОбласти
		
		КонецЕсли;
		
		Если ПараметрыРасчетаРейтинга.Свойство("ИсключатьДляРублевыхОблигацийРейтингВИностраннойВалюте") 
			И ПараметрыРасчетаРейтинга.ИсключатьДляРублевыхОблигацийРейтингВИностраннойВалюте = Истина
		Тогда
		
			#Область Исключение_рейтинга_в_иностранной_валюте_для_рублевых_облигаций
			
			ТекстЗапросаРейтингов = СтрЗаменить(ТекстЗапросаРейтингов,
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)",
				"ПО (РейтингиСрезПоследних.Субъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
				|			И НЕ (ТИПЗНАЧЕНИЯ(_СвязанныеСубъектыРейтинга.Субъект) = ТИП(Справочник.Облигации)
				|					И ВЫРАЗИТЬ(_СвязанныеСубъектыРейтинга.Субъект КАК Справочник.Облигации).ВалютаНоминала = &ВалютаРубли
				|					И РейтингиСрезПоследних.Шкала.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.МеждународнаяИнВалюта))");		
		
			Запрос.УстановитьПараметр("ВалютаРубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
			
			#КонецОбласти
		
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(ТекстЗапросаРейтингов, "&ФильтрСвязанныхСубъектов", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,		  "&ФильтрРейтингов",		   "ИСТИНА");
		
		ИспользуютсяСобственныеПараметрыРейтингаРФ = (ПараметрыРасчетаРейтинга.Свойство("ПараметрыРейтингаРФ") И ТипЗнч(ПараметрыРасчетаРейтинга.ПараметрыРейтингаРФ) = Тип("Структура"));
		
		Если ИспользуютсяСобственныеПараметрыРейтингаРФ Тогда

			#Область Дополняем_текст_запроса_рейтингами_РФ_на_указанную_дату
			
			ТекстЗапросаРейтинговРФ = СтрЗаменить(ТекстЗапросаРейтингов,   "ВЫБРАТЬ РАЗРЕШЕННЫЕ",		"ВЫБРАТЬ");
			ТекстЗапросаРейтинговРФ = СтрЗаменить(ТекстЗапросаРейтинговРФ, "ПОМЕСТИТЬ _Рейтинги",		"");
			ТекстЗапросаРейтинговРФ = СтрЗаменить(ТекстЗапросаРейтинговРФ, "&ДатаОценки",				"&ДатаРейтингаРФ");
			ТекстЗапросаРейтинговРФ = СтрЗаменить(ТекстЗапросаРейтинговРФ, "&ФильтрСвязанныхСубъектов",	"_СвязанныеСубъектыРейтинга.СвязанныйСубъект = &МинфинРоссии");
			ТекстЗапросаРейтинговРФ = СтрЗаменить(ТекстЗапросаРейтинговРФ, "&ФильтрРейтингов",			"&ДатаОценки <> &ДатаРейтингаРФ");

			Запрос.Текст = Запрос.Текст + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + ТекстЗапросаРейтинговРФ;
			
			#КонецОбласти
			
		КонецЕсли;
		
		#КонецОбласти
		
		Запрос.Текст = Запрос.Текст + ";" + Символы.ПС + Символы.ПС +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СвязанныеСубъектыРейтинга.Субъект КАК Субъект,
			|	ЕСТЬNULL(МАКСИМУМ(_СвязанныеСубъектыРейтинга.Субъект = _Рейтинги.СвязанныйСубъект), ЛОЖЬ) КАК РейтингСубъекта,
			|	ЕСТЬNULL(МАКСИМУМ(_СвязанныеСубъектыРейтинга.ВидСвязи = ""Эмитент""
			|				И _Рейтинги.СвязанныйСубъект ЕСТЬ НЕ NULL ), ЛОЖЬ) КАК РейтингЭмитента
			|ПОМЕСТИТЬ _НаличиеРейтинговНаДатуОценки
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|		ЛЕВОЕ СОЕДИНЕНИЕ _Рейтинги КАК _Рейтинги
			|		ПО (_Рейтинги.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|			И (_Рейтинги.СвязанныйСубъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
			|			И (_Рейтинги.ДатаРейтинга = &ДатаОценки)
			|
			|СГРУППИРОВАТЬ ПО
			|	_СвязанныеСубъектыРейтинга.Субъект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_СвязанныеСубъектыРейтинга.Субъект КАК Субъект
			|ПОМЕСТИТЬ _НаличиеГарантииРФ
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|ГДЕ
			|	_СвязанныеСубъектыРейтинга.ВидСвязи = ""Гарант""
			|	И _СвязанныеСубъектыРейтинга.СвязанныйСубъект = &МинфинРоссии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_СубъектыРейтинга.Субъект КАК Субъект
			|ПОМЕСТИТЬ _СубординированныеВыпуски
			|ИЗ
			|	#СубъектыРейтинга# КАК _СубъектыРейтинга
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
			|		ПО (Облигации.Ссылка = _СубъектыРейтинга.Субъект)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
			|		ПО (ДепозитныеВклады.Ссылка = _СубъектыРейтинга.Субъект)
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(_СубъектыРейтинга.Субъект) В (ТИП(Справочник.Облигации), ТИП(Справочник.ДепозитныеВклады))
			|	И ЕСТЬNULL(Облигации.Субординированность, ДепозитныеВклады.Субординированность)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СвязанныеСубъектыРейтинга.Субъект КАК Субъект,
			|	_СвязанныеСубъектыРейтинга.СвязанныйСубъект КАК СвязанныйСубъект,
			|	ВЫБОР
			|		КОГДА &ПриоритетРоссийскихАгентствПередИностранными
			|				И _Рейтинги.РейтинговоеАгентство В (&ИностранныеАгентства)
			|			ТОГДА 100
			|		ИНАЧЕ 0
			|	КОНЕЦ + _СвязанныеСубъектыРейтинга.Приоритет КАК Приоритет,
			|	СопоставлениеРейтинговыхШкал.СтрокаСопоставления КАК СтрокаСопоставления,
			|	_Рейтинги.Рейтинг КАК Рейтинг,
			|	_Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
			|	_Рейтинги.Шкала КАК Шкала,
			|	_Рейтинги.Оценка КАК Оценка,
			|	ВЫБОР
			|		КОГДА &СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска <> 0
			|				И _СубординированныеВыпуски.Субъект ЕСТЬ НЕ NULL 
			|				И _НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ЛОЖЬ
			|			ТОГДА _Рейтинги.Оценка + &СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска
			|		ИНАЧЕ _Рейтинги.Оценка
			|	КОНЕЦ КАК СопоставляемаяОценка,
			|	СопоставлениеРейтинговыхШкал.ЗначениеМинимальное.Оценка КАК ЗначениеМинимальноеОценка,
			|	СопоставлениеРейтинговыхШкал.ЗначениеМаксимальное.Оценка КАК ЗначениеМаксимальноеОценка,
			|	ИСТИНА КАК НаблюдаемыеДанные
			|ПОМЕСТИТЬ _СопоставленныеРейтинги
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаличиеРейтинговНаДатуОценки КАК _НаличиеРейтинговНаДатуОценки
			|		ПО (_НаличиеРейтинговНаДатуОценки.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Рейтинги КАК _Рейтинги
			|		ПО (_Рейтинги.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|			И (_Рейтинги.СвязанныйСубъект = _СвязанныеСубъектыРейтинга.СвязанныйСубъект)
			|			И (ВЫБОР
			|				КОГДА _СвязанныеСубъектыРейтинга.СвязанныйСубъект = &МинфинРоссии
			|						И (&ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг
			|								И _СвязанныеСубъектыРейтинга.ВидСвязи = ""Эмитент""
			|							ИЛИ &ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента
			|								И _СвязанныеСубъектыРейтинга.ВидСвязи = ""Гарант""
			|								И _НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ЛОЖЬ
			|								И _НаличиеРейтинговНаДатуОценки.РейтингЭмитента = ЛОЖЬ)
			|					ТОГДА _Рейтинги.ДатаРейтинга = &ДатаРейтингаРФ
			|				ИНАЧЕ _Рейтинги.ДатаРейтинга = &ДатаОценки
			|			КОНЕЦ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СубординированныеВыпуски КАК _СубординированныеВыпуски
			|		ПО (_СубординированныеВыпуски.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(
			|				&ДатаОценки,
			|				Источник В (&ИсточникТаблицыСоответствияРейтингов, &ИсточникТаблицыСоответствияРейтинговРФ)
			|					И Агрегатор = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)) КАК СопоставлениеРейтинговыхШкал
			|		ПО (СопоставлениеРейтинговыхШкал.Активно)
			|			И (ВЫБОР
			|				КОГДА _СвязанныеСубъектыРейтинга.СвязанныйСубъект = &МинфинРоссии
			|						И (&ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг
			|								И _СвязанныеСубъектыРейтинга.ВидСвязи = ""Эмитент""
			|							ИЛИ &ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента
			|								И _СвязанныеСубъектыРейтинга.ВидСвязи = ""Гарант""
			|								И _НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ЛОЖЬ
			|								И _НаличиеРейтинговНаДатуОценки.РейтингЭмитента = ЛОЖЬ)
			|					ТОГДА СопоставлениеРейтинговыхШкал.Источник = &ИсточникТаблицыСоответствияРейтинговРФ
			|				ИНАЧЕ СопоставлениеРейтинговыхШкал.Источник = &ИсточникТаблицыСоответствияРейтингов
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА СопоставлениеРейтинговыхШкал.ОтборПоЭталоннойШкале
			|					ТОГДА СопоставлениеРейтинговыхШкал.ШкалаРейтингаЭталонная = _Рейтинги.Шкала
			|				ИНАЧЕ СопоставлениеРейтинговыхШкал.Агрегатор = _Рейтинги.Шкала.Агрегатор
			|						И СопоставлениеРейтинговыхШкал.ТипШкалы = _Рейтинги.Шкала.ТипШкалы
			|						И СопоставлениеРейтинговыхШкал.Срок = _Рейтинги.Шкала.Срок
			|						И СопоставлениеРейтинговыхШкал.РейтинговоеАгенство = _Рейтинги.Шкала.Владелец
			|						И (НЕ &УчитыватьВидРейтинга
			|							ИЛИ СопоставлениеРейтинговыхШкал.ВидРейтинга = _Рейтинги.Шкала.ВидРейтинга)
			|			КОНЕЦ)
			|			И (ВЫБОР
			|				КОГДА &СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска <> 0
			|						И _СубординированныеВыпуски.Субъект ЕСТЬ НЕ NULL 
			|						И _НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ЛОЖЬ
			|					ТОГДА _Рейтинги.Оценка + &СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска
			|				ИНАЧЕ _Рейтинги.Оценка
			|			КОНЕЦ МЕЖДУ ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМаксимальное.Оценка, 0) И ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМинимальное.Оценка, 0))
			|		ЛЕВОЕ СОЕДИНЕНИЕ _НаличиеГарантииРФ КАК _НаличиеГарантииРФ
			|		ПО (_НаличиеГарантииРФ.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|ГДЕ
			|	_СвязанныеСубъектыРейтинга.ПредопределеннаяРейтинговаяГруппа = НЕОПРЕДЕЛЕНО
			|	И (&РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента = НЕОПРЕДЕЛЕНО
			|			ИЛИ _СвязанныеСубъектыРейтинга.ВидСвязи <> ""Субъект""
			|			ИЛИ _НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ИСТИНА
			|			ИЛИ _НаличиеРейтинговНаДатуОценки.РейтингЭмитента = ИСТИНА
			|			ИЛИ _НаличиеГарантииРФ.Субъект ЕСТЬ NULL)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_СвязанныеСубъектыРейтинга.Субъект,
			|	_СвязанныеСубъектыРейтинга.СвязанныйСубъект,
			|	_СвязанныеСубъектыРейтинга.Приоритет,
			|	&РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ЛОЖЬ
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаличиеРейтинговНаДатуОценки КАК _НаличиеРейтинговНаДатуОценки
			|		ПО (_НаличиеРейтинговНаДатуОценки.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|			И (_НаличиеРейтинговНаДатуОценки.РейтингСубъекта = ЛОЖЬ)
			|			И (_НаличиеРейтинговНаДатуОценки.РейтингЭмитента = ЛОЖЬ)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаличиеГарантииРФ КАК _НаличиеГарантииРФ
			|		ПО (_НаличиеГарантииРФ.Субъект = _СвязанныеСубъектыРейтинга.Субъект)
			|ГДЕ
			|	_СвязанныеСубъектыРейтинга.ПредопределеннаяРейтинговаяГруппа = НЕОПРЕДЕЛЕНО
			|	И &РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента <> НЕОПРЕДЕЛЕНО
			|	И _СвязанныеСубъектыРейтинга.ВидСвязи = ""Субъект""
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	_СвязанныеСубъектыРейтинга.Субъект,
			|	_СвязанныеСубъектыРейтинга.СвязанныйСубъект,
			|	_СвязанныеСубъектыРейтинга.Приоритет,
			|	_СвязанныеСубъектыРейтинга.ПредопределеннаяРейтинговаяГруппа,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ЛОЖЬ
			|ИЗ
			|	_СвязанныеСубъектыРейтинга КАК _СвязанныеСубъектыРейтинга
			|ГДЕ
			|	_СвязанныеСубъектыРейтинга.ПредопределеннаяРейтинговаяГруппа <> НЕОПРЕДЕЛЕНО
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_СубъектыРейтинга.Субъект,
			|	NULL,
			|	1000,
			|	&КоличествоРейтинговыхГрупп,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ЛОЖЬ
			|ИЗ
			|	#СубъектыРейтинга# КАК _СубъектыРейтинга
			|ГДЕ
			|	&ТолькоНаблюдаемыеДанные = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СопоставленныеРейтинги.Субъект КАК Субъект,
			|	МИНИМУМ(_СопоставленныеРейтинги.СтрокаСопоставления) КАК НомерГруппы
			|ПОМЕСТИТЬ #РейтинговыеГруппы#
			|ИЗ
			|	_СопоставленныеРейтинги КАК _СопоставленныеРейтинги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_СопоставленныеРейтинги.Субъект КАК Субъект,
			|			МИНИМУМ(_СопоставленныеРейтинги.Приоритет) КАК Приоритет
			|		ИЗ
			|			_СопоставленныеРейтинги КАК _СопоставленныеРейтинги
			|		ГДЕ
			|			_СопоставленныеРейтинги.СтрокаСопоставления ЕСТЬ НЕ NULL 
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_СопоставленныеРейтинги.Субъект) КАК ПриоритетРейтингов
			|		ПО (ПриоритетРейтингов.Субъект = _СопоставленныеРейтинги.Субъект)
			|			И (ПриоритетРейтингов.Приоритет = _СопоставленныеРейтинги.Приоритет)
			|
			|СГРУППИРОВАТЬ ПО
			|	_СопоставленныеРейтинги.Субъект";		
		
		Если Не ПараметрыРасчетаРейтинга.Свойство("КоличествоРейтинговыхГрупп") Тогда
			Если ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Атом_РасчетСС
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.НПФ_ОПФ
		 	Тогда 	
				ПараметрыРасчетаРейтинга.Вставить("КоличествоРейтинговыхГрупп", 3);		
			ИначеЕсли ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Газфонд
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.ОПИФ
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.ОПИФ2022
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.ОПИФ2023
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.ОПИФ2023_МРА
		 		ИЛИ	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Традиция2024
				ИЛИ ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Сургутнефтегаз2023
				ИЛИ ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Сургутнефтегаз20230619
			Тогда 	
				ПараметрыРасчетаРейтинга.Вставить("КоличествоРейтинговыхГрупп", 4);
			ИначеЕсли ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.Будущее Тогда 	
				ПараметрыРасчетаРейтинга.Вставить("КоличествоРейтинговыхГрупп", 5);
			ИначеЕсли ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов = Справочники.ВнешниеСистемы.ОПК Тогда 	
				ПараметрыРасчетаРейтинга.Вставить("КоличествоРейтинговыхГрупп", 17);
			Иначе
				ПараметрыРасчетаРейтинга.Вставить("КоличествоРейтинговыхГрупп", Неопределено);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ПараметрыРасчетаРейтинга.Свойство("ТолькоНаблюдаемыеДанные") Тогда
			ПараметрыРасчетаРейтинга.Вставить("ТолькоНаблюдаемыеДанные", Ложь);
		КонецЕсли;
		
		Если ПараметрыРасчетаРейтинга.ТолькоНаблюдаемыеДанные = Ложь И Не ЗначениеЗаполнено(ПараметрыРасчетаРейтинга.КоличествоРейтинговыхГрупп) Тогда
			ВызватьИсключение "Для таблицы соответствия рейтингов не задано количество рейтинговых групп!
							  |Определение рейтинговой группы по ненаблюдаемым данным не может быть выполнено.";
		КонецЕсли;
		
		// #ТехДолг: необходимо проверить нужна ли данная вариативность для других методик
		Если Не ПараметрыРасчетаРейтинга.Свойство("УчитыватьВидРейтинга") Тогда
			ПараметрыРасчетаРейтинга.Вставить("УчитыватьВидРейтинга", Ложь);
		КонецЕсли;
		// #ТехДолг
		
		Если ПараметрыРасчетаРейтинга.Свойство("ПриоритетРоссийскихАгентствПередИностранными") Тогда
			Запрос.УстановитьПараметр("ПриоритетРоссийскихАгентствПередИностранными", ПараметрыРасчетаРейтинга.ПриоритетРоссийскихАгентствПередИностранными);
			Запрос.УстановитьПараметр("ИностранныеАгентства",						  Справочники.РейтинговыеАгентства.ИностранныеРейтинговыеАгентства());
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПриоритетРоссийскихАгентствПередИностранными", "ЛОЖЬ");	
		КонецЕсли;
		
		Если Не Запрос.Параметры.Свойство("ИностранныеАгентства") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИностранныеАгентства", "NULL"); // Если параметр не задан, то он и не нужен (убираем из расшифровки)	
		КонецЕсли;
		
		Если Не ПараметрыРасчетаРейтинга.Свойство("СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска") Тогда
			ПараметрыРасчетаРейтинга.Вставить("СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска", 0);
		КонецЕсли;
		
		ЗаданаРейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента = 
			ПараметрыРасчетаРейтинга.Свойство("РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента")
				И ПараметрыРасчетаРейтинга.РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента <> Неопределено;
		
		Если ЗаданаРейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента Тогда
			Запрос.УстановитьПараметр("РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента", ПараметрыРасчетаРейтинга.РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента", "НЕОПРЕДЕЛЕНО");	
		КонецЕсли;
		
		Если ИспользуютсяСобственныеПараметрыРейтингаРФ
			ИЛИ ЗаданаРейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента
		Тогда
			Запрос.УстановитьПараметр("МинфинРоссии", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МинфинРоссии"));
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МинфинРоссии", "NULL");
		КонецЕсли;
		
		Если ИспользуютсяСобственныеПараметрыРейтингаРФ
			И ПараметрыРасчетаРейтинга.ПараметрыРейтингаРФ.Свойство("ДатаРейтинга")
		Тогда
			Запрос.УстановитьПараметр("ДатаРейтингаРФ", ПараметрыРасчетаРейтинга.ПараметрыРейтингаРФ.ДатаРейтинга);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаРейтингаРФ", "&ДатаОценки");
		КонецЕсли;
		
		Если ИспользуютсяСобственныеПараметрыРейтингаРФ
			И ПараметрыРасчетаРейтинга.ПараметрыРейтингаРФ.Свойство("ИсточникТаблицыСоответствияРейтингов")
		Тогда
			Запрос.УстановитьПараметр("ИсточникТаблицыСоответствияРейтинговРФ", ПараметрыРасчетаРейтинга.ПараметрыРейтингаРФ.ИсточникТаблицыСоответствияРейтингов);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсточникТаблицыСоответствияРейтинговРФ", "&ИсточникТаблицыСоответствияРейтингов");
		КонецЕсли;
		
		Если ПараметрыРасчетаРейтинга.Свойство("ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг") Тогда
			
			Если ПараметрыРасчетаРейтинга.ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг
				И ПараметрыРасчетаРейтинга.Свойство("РейтинговаяГруппаГосударственныхОблигаций")
				И ПараметрыРасчетаРейтинга.РейтинговаяГруппаГосударственныхОблигаций <> Неопределено
			Тогда
				ВызватьИсключение "Параметры 'РейтинговаяГруппаГосударственныхОблигаций' и 'ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг' не могут быть заданы одновременно!";
			КонецЕсли;

			Запрос.УстановитьПараметр("ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг", ПараметрыРасчетаРейтинга.ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИспользоватьПараметрыРейтингаРФДляГосударственныхЦенныхБумаг", "ЛОЖЬ");
		КонецЕсли;

		Если ПараметрыРасчетаРейтинга.Свойство("ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента") Тогда
			
			Если ЗаданаРейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента
				И ПараметрыРасчетаРейтинга.ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента
			Тогда
				ВызватьИсключение "Параметры 'РейтинговаяГруппаБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента' и 'ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента' не могут быть заданы одновременно!";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента", ПараметрыРасчетаРейтинга.ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИспользоватьПараметрыРейтингаРФДляБумагСГарантиейРФПриОтсутствииРейтингаВыпускаИЭмитента", "ЛОЖЬ");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТолькоНаблюдаемыеДанные",				ПараметрыРасчетаРейтинга.ТолькоНаблюдаемыеДанные);
		Запрос.УстановитьПараметр("ИсточникТаблицыСоответствияРейтингов",	ПараметрыРасчетаРейтинга.ИсточникТаблицыСоответствияРейтингов);	
		Запрос.УстановитьПараметр("КоличествоРейтинговыхГрупп",				ПараметрыРасчетаРейтинга.КоличествоРейтинговыхГрупп);
		Запрос.УстановитьПараметр("УчитыватьВидРейтинга",					ПараметрыРасчетаРейтинга.УчитыватьВидРейтинга);
		
		Запрос.УстановитьПараметр("СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска", ПараметрыРасчетаРейтинга.СнижениеРейтингаСубординированнойБумагиПриОтсутствииРейтингаВыпуска);
		
		#КонецОбласти		
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СубъектыРейтинга#",	ИмяТаблицыСубъектовРейтинга);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РейтинговыеГруппы#", ИмяВременнойТаблицы);
	
	Если РасшифровкаРасчета = Неопределено Тогда
		Запрос.Выполнить();
	Иначе
		РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаРасчета, Запрос, "Определение рейтинговой группы", "Рейтинг", Неопределено, , , Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьРейтинговуюГруппу(Субъект, Дата, ПараметрыРасчетаРейтинга, МенеджерВременныхТаблиц = Неопределено, РасшифровкаРасчета = Неопределено) Экспорт
	
	МенеджерВТ = ?(МенеджерВременныхТаблиц = Неопределено, Новый МенеджерВременныхТаблиц, МенеджерВременныхТаблиц);
	
	ПоместитьРейтинговыеГруппыСубъектовВМенеджерВременныхТаблиц(МенеджерВТ, Субъект, Дата, ПараметрыРасчетаРейтинга, "_РейтинговыеГруппы", РасшифровкаРасчета);
	
	РейтинговыеГруппы = МенеджерВТ.Таблицы["_РейтинговыеГруппы"].ПолучитьДанные().Выбрать();
	Если РейтинговыеГруппы.Следующий() Тогда
		РейтинговаяГруппа = РейтинговыеГруппы.НомерГруппы;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РейтинговаяГруппа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рейтинг " + Субъект + " не попал ни в одну рейтинговую группу");
	КонецЕсли;
	
	Возврат РейтинговаяГруппа;
	
КонецФункции

Функция РассчитатьКредитныйСпред(Субъект, Дата, ПараметрыРасчетаРейтинга, ПараметрыРасчетаКредитногоСпреда, Отказ, РасшифровкаРасчета = Неопределено) Экспорт
	
	Перем СтрокаПремииЗаСубординированность, ОтклонениеКредитногоСпреда, КоличествоДнейРасчетаКредитногоСпреда, ТочностьМедианыКредитногоСпреда;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаОперации = РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, "Расчет кредитного спреда", , , Истина);
	КонецЕсли;	
	
	// Проверки	
	
	Если ТипЗнч(Субъект) <> Тип("СправочникСсылка.Облигации")
		И ТипЗнч(Субъект) <> Тип("СправочникСсылка.ДепозитныеВклады")
		И ТипЗнч(Субъект) <> Тип("ДокументСсылка.МНО")
	Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область Получение_рейтинговой_группы_субъекта
	
	РейтинговаяГруппа = ОпределитьРейтинговуюГруппу(Субъект, Дата, ПараметрыРасчетаРейтинга, МенеджерВременныхТаблиц, РасшифровкаОперации);
	
	Если Не ЗначениеЗаполнено(РейтинговаяГруппа) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	#КонецОбласти	
	
	#Область Возвращаем_нулевой_кредитный_спред_для_государственных_облигаций
	
	РассчитыватьКредитныйСпредДляГосударственныхОблигаций = 
		ПараметрыРасчетаКредитногоСпреда.Свойство("РассчитыватьКредитныйСпредДляГосударственныхОблигаций")
			И ПараметрыРасчетаКредитногоСпреда.РассчитыватьКредитныйСпредДляГосударственныхОблигаций;
	
	Если Не РассчитыватьКредитныйСпредДляГосударственныхОблигаций
		И ТипЗнч(Субъект) = Тип("СправочникСсылка.Облигации")
		И Субъект.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства
	Тогда
		
		ТаблицаГос = Новый ТаблицаЗначений;
		ТаблицаГос.Колонки.Добавить("СтрокаСопоставления",		Новый ОписаниеТипов("Число"));
		ТаблицаГос.Колонки.Добавить("Медиана",					Новый ОписаниеТипов("Число"));
		ТаблицаГос.Колонки.Добавить("МинимумКредитногоСпреда",	Новый ОписаниеТипов("Число"));
		ТаблицаГос.Колонки.Добавить("МаксимумКредитногоСпреда",	Новый ОписаниеТипов("Число"));
		
		НоваяСтрокаТаблицаГос = ТаблицаГос.Добавить();
		НоваяСтрокаТаблицаГос.СтрокаСопоставления		= РейтинговаяГруппа;
		НоваяСтрокаТаблицаГос.Медиана					= 0;
		НоваяСтрокаТаблицаГос.МинимумКредитногоСпреда	= 0;
		НоваяСтрокаТаблицаГос.МаксимумКредитногоСпреда	= 0;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаОперации, , "Кредитный спред", 
				Новый Структура("Описание", "Расчет кредитного спреда для государственных облигаций не выполняется."));
		КонецЕсли;
		
		Возврат	ТаблицаГос;
		
	КонецЕсли;	
	
	#КонецОбласти

	#Область Заполнение_параметров_расчета_кредитного_спреда
	
	ОсновнойКалендарьКотировок = Константы.ОсновнойКалендарьКотировок.Получить();
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("ВариантРасчетаКредитногоСпреда") Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("ВариантРасчетаКредитногоСпреда", "ПоИндексамСовокупногоДоходаГосударственныхИКорпоративныхОблигаций");	
	КонецЕсли;
	
	ВариантРасчетаКредитногоСпреда = ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпреда;
	
	Если ПараметрыРасчетаКредитногоСпреда.Свойство("ВариантРасчетаКредитногоСпредаМуниципальныхОблигаций")
		И ЗначениеЗаполнено(ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаМуниципальныхОблигаций)
		И ТипЗнч(Субъект) = Тип("СправочникСсылка.Облигации")
		И (Субъект.Категория = Перечисления.КатегорииОблигаций.Муниципальная ИЛИ Субъект.Категория = Перечисления.КатегорииОблигаций.Субфедеральная)		
	Тогда
		ВариантРасчетаКредитногоСпреда = ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаМуниципальныхОблигаций;			
	КонецЕсли;	
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы") Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы", Неопределено); // т.е. переопределения расчета для данной рейтинговой группы нет  	
	КонецЕсли;
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("ВариантРасчетаДиапазонаКредитногоСпреда") Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("ВариантРасчетаДиапазонаКредитногоСпреда", "ПоМедиане");	
	КонецЕсли;
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьМедианыКредитногоСпреда", ТочностьМедианыКредитногоСпреда) Тогда
		ТочностьМедианыКредитногоСпреда = 0;
	КонецЕсли;
	
	Если ПараметрыРасчетаКредитногоСпреда.Свойство("ПремииЗаСубординированность") Тогда
		СтрокаПремииЗаСубординированность = ПараметрыРасчетаКредитногоСпреда.ПремииЗаСубординированность.Найти(Субъект, "ЦеннаяБумага");
	КонецЕсли;
	
	ПремияЗаСубординированность = ?(СтрокаПремииЗаСубординированность = Неопределено, 0, СтрокаПремииЗаСубординированность.ПроцентПремии * 100);
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("УчитыватьПремиюЗаСубординированностьТолькоПриОтсутствииРейтингаВыпуска") Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("УчитыватьПремиюЗаСубординированностьТолькоПриОтсутствииРейтингаВыпуска", Ложь);
	КонецЕсли;
	
	Если ПремияЗаСубординированность <> 0
		И ПараметрыРасчетаКредитногоСпреда.УчитыватьПремиюЗаСубординированностьТолькоПриОтсутствииРейтингаВыпуска
		И (ТипЗнч(Субъект) = Тип("СправочникСсылка.Облигации") ИЛИ ТипЗнч(Субъект) = Тип("СправочникСсылка.ДепозитныеВклады"))
	Тогда
		
		#Область Ищем_рейтинг_выпуска
		
		ЗапросРейтингов = Новый Запрос;
		ЗапросРейтингов.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ЗапросРейтингов.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	*
			|ИЗ
			|	_СопоставленныеРейтинги КАК _СопоставленныеРейтинги
			|ГДЕ
			|	_СопоставленныеРейтинги.СвязанныйСубъект = _СопоставленныеРейтинги.Субъект
			|	И _СопоставленныеРейтинги.НаблюдаемыеДанные = ИСТИНА
			|	И _СопоставленныеРейтинги.СтрокаСопоставления ЕСТЬ НЕ NULL ";
			
		РейтингВыпускаНайден = Не ЗапросРейтингов.Выполнить().Пустой();
		
		#КонецОбласти
		
		Если РейтингВыпускаНайден Тогда
			ПремияЗаСубординированность = 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("КоличествоДнейРасчетаКредитногоСпреда", КоличествоДнейРасчетаКредитногоСпреда) Тогда
		КоличествоДнейРасчетаКредитногоСпреда = 20;	
	КонецЕсли;	
	
	Если ПараметрыРасчетаКредитногоСпреда.Свойство("ИсключитьДеньПереоценки") И ПараметрыРасчетаКредитногоСпреда.ИсключитьДеньПереоценки Тогда
		ДатаПереоценки = НачалоДня(Дата) - 1;
	Иначе
		ДатаПереоценки = Дата;
	КонецЕсли;	
	
	Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("БратьБиржевыеИндексыТолькоВДниТорговИнструментом") Тогда
		ПараметрыРасчетаКредитногоСпреда.Вставить("БратьБиржевыеИндексыТолькоВДниТорговИнструментом", Ложь);
	КонецЕсли;	
	
	#Область Определяем_календарь_индексов
	
	ЗапросКалендаря = Новый Запрос;
	ЗапросКалендаря.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ТипЗнч(Субъект) = Тип("СправочникСсылка.Облигации")
		И ПараметрыРасчетаКредитногоСпреда.БратьБиржевыеИндексыТолькоВДниТорговИнструментом
	Тогда
		
		РаботаСПереоценкой.ПоместитьСведенияОТоргахЦеннымиБумагамиВМенеджерВременныхТаблиц(ЗапросКалендаря, Субъект, ДатаПереоценки, КоличествоДнейРасчетаКредитногоСпреда, "_КалендарьИндексов");
		
	Иначе
		
		ЗапросКалендаря.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
			|	ДанныеКалендаря.Дата КАК Дата,
			|	АВТОНОМЕРЗАПИСИ() КАК ТорговыхДнейНазад
			|ПОМЕСТИТЬ _КалендарьИндексов
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Календарь = &ОсновнойКалендарьКотировок
			|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|	И ДанныеКалендаря.Дата <= &Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДанныеКалендаря.Дата УБЫВ";
		
		ЗапросКалендаря.Текст = СтрЗаменить(ЗапросКалендаря.Текст, "ПЕРВЫЕ 20", "ПЕРВЫЕ " + Формат(КоличествоДнейРасчетаКредитногоСпреда, "ЧН=; ЧГ="));
		
		ЗапросКалендаря.УстановитьПараметр("ОсновнойКалендарьКотировок", ОсновнойКалендарьКотировок);
		ЗапросКалендаря.УстановитьПараметр("Период",					 ДатаПереоценки);
		
		ЗапросКалендаря.Выполнить();
		
	КонецЕсли;
	
	ЗапросКалендаря.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Дата ИЗ _КалендарьИндексов ГДЕ ТорговыхДнейНазад = 1";
	
	ПоследняяДатаТоргов = ЗапросКалендаря.Выполнить().Выгрузить()[0].Дата;
		
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Субъект",												  Субъект);
	Запрос.УстановитьПараметр("ПоследняяДатаТоргов",									  ПоследняяДатаТоргов);
	
	Запрос.УстановитьПараметр("ВариантРасчетаКредитногоСпреда",							  ВариантРасчетаКредитногоСпреда);
	Запрос.УстановитьПараметр("ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы);
	
	#КонецОбласти
	
	// Расчет кредитного спреда 	
	
	ОшибкаРасчета = Ложь;	

	Если ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаКорпоративныхОблигацийИКБДВТочкеДюрацииИндекса" Тогда
		
		#Область Индексы_RUCBTRAAANS_RUCBTRA2A_RUCBTR2B3B		
		
		// Индексы: RUCBTRAAANS, RUCBTRA2A, RUCBTR2B3B
		
		// Рейтинговая группа I:		(Y_RUCBTRAAANS - КБД_DURATION_RUCBTRAAANS) * 100
		// Рейтинговая группа II:		(Y_RUCBTRA2A - КБД_DURATION_RUCBTRA2A) * 100
		// Рейтинговая группа III:		(Y_RUCBTR2B3B - КБД_DURATION_RUCBTR2B3B) * 100
		// Рейтинговая группа IV (1):	ОКРУГЛ(СРЗНАЧ(Y_TM - КБД_СРВЗВЕШ_СРОК_ДО_ПОГАШЕНИЯ_ЦБ), 4) * 100		
		// Рейтинговая группа IV (2):	(Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа IV (3):	(Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ

		ПоследняяРейтинговаяГруппа = 4;

		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUCBTRAAANS, RUCBTRA2A, RUCBTR2B3B - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|КБД_DURATION - значение ставки КБД в точке, соответствующей дюрации соответствующего индекса ММВБ
			|Sрг - медиана спреда соответствующей рейтинговой группы 
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:   (Y_RUCBTRAAANS - КБД_DURATION_RUCBTRAAANS) * 100
			|Рейтинговая группа II:  (Y_RUCBTRA2A - КБД_DURATION_RUCBTRA2A) * 100
			|Рейтинговая группа III: (Y_RUCBTR2B3B - КБД_DURATION_RUCBTR2B3B) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "ПоЗначениюПредыдущейРейтинговойГруппы" Тогда
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV: значение кредитного спреда для III рейтинговой группы, увеличенное на ОтклонениеКредитногоСпреда базисных пунктов";
		
		ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций" Тогда
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV (1): (Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа IV (2): (Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV:  ОКРУГЛ(СРЗНАЧ(Y_TM - КБД_СРВЗВЕШ_СРОК_ДО_ПОГАШЕНИЯ_ЦБ), 4) * 100";
			
			Если РейтинговаяГруппа = 4 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рейтинг " + Субъект + " попал в рейтинговую группу IV. Расчет кредитного спреда для данной группы не реализован.", , , , ОшибкаРасчета);
			КонецЕсли;
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти

		#Область Получение_значений_индексов_и_расчет_значений_КБД_в_точке_дюрации_индекса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUCBTRAAANS.YIELD КАК Y_RUCBTRAAANS,
			|	RUCBTRAAANS.DURATION КАК DURATION_RUCBTRAAANS,
			|	0 КАК GCURVE_DURATION_RUCBTRAAANS,
			|	RUCBTRA2A.YIELD КАК Y_RUCBTRA2A,
			|	RUCBTRA2A.DURATION КАК DURATION_RUCBTRA2A,
			|	0 КАК GCURVE_DURATION_RUCBTRA2A,
			|	RUCBTR2B3B.YIELD КАК Y_RUCBTR2B3B,
			|	RUCBTR2B3B.DURATION КАК DURATION_RUCBTR2B3B,
			|	0 КАК GCURVE_DURATION_RUCBTR2B3B,
			|	RUGBICP3Y.YIELD КАК Y_RUGBICP3Y,
			|	RUCBICPL3.YIELD КАК Y_RUCBICPL3,
			|	RUCBICPL2.YIELD КАК Y_RUCBICPL2
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRAAANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRAAANS
			|			ПО (БиржевойИндекс_RUCBTRAAANS.Код = ""RUCBTRAAANS"")
			|				И (БиржевойИндекс_RUCBTRAAANS.Ссылка = RUCBTRAAANS.БиржевойИндекс)
			|		ПО (RUCBTRAAANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRA2A
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRA2A
			|			ПО (БиржевойИндекс_RUCBTRA2A.Код = ""RUCBTRA2A"")
			|				И (БиржевойИндекс_RUCBTRA2A.Ссылка = RUCBTRA2A.БиржевойИндекс)
			|		ПО (RUCBTRA2A.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTR2B3B
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTR2B3B
			|			ПО (БиржевойИндекс_RUCBTR2B3B.Код = ""RUCBTR2B3B"")
			|				И (БиржевойИндекс_RUCBTR2B3B.Ссылка = RUCBTR2B3B.БиржевойИндекс)
			|		ПО (RUCBTR2B3B.Период = _КалендарьИндексов.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBICP3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBICP3Y
			|			ПО (БиржевойИндекс_RUGBICP3Y.Код = ""RUGBICP3Y"")
			|				И (БиржевойИндекс_RUGBICP3Y.Ссылка = RUGBICP3Y.БиржевойИндекс)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL3
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL3
			|				ПО (БиржевойИндекс_RUCBICPL3.Код = ""RUCBICPL3"")
			|					И (БиржевойИндекс_RUCBICPL3.Ссылка = RUCBICPL3.БиржевойИндекс)
			|			ПО (RUCBICPL3.Период = RUGBICP3Y.Период)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL2
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL2
			|				ПО (БиржевойИндекс_RUCBICPL2.Код = ""RUCBICPL2"")
			|					И (БиржевойИндекс_RUCBICPL2.Ссылка = RUCBICPL2.БиржевойИндекс)
			|			ПО (RUCBICPL2.Период = RUGBICP3Y.Период)
			|		ПО (RUGBICP3Y.Период = _КалендарьИндексов.Дата)
			|			И (&ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"")
			|ГДЕ
			|	НЕ(RUGBICP3Y.Период ЕСТЬ NULL
			|				И &ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"")";
		
		// Расчет значения КБД в точке дюрации индекса
		
		ТочностьКБД = 2;
		Если ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьКБД") Тогда
			ТочностьКБД = ПараметрыРасчетаКредитногоСпреда.ТочностьКБД;
		КонецЕсли;
		
		ЗначенияБиржевыхИндексов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ЗначениеБиржевогоИндекса Из ЗначенияБиржевыхИндексов Цикл

			ДюрацииИндексов = Новый Структура;
			ДюрацииИндексов.Вставить("RUCBTRAAANS",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRAAANS);
			ДюрацииИндексов.Вставить("RUCBTRA2A",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRA2A);
			ДюрацииИндексов.Вставить("RUCBTR2B3B",	ЗначениеБиржевогоИндекса.DURATION_RUCBTR2B3B);
				
			Для Каждого ДюрацияИндекса Из ДюрацииИндексов Цикл
				Если ДюрацияИндекса.Значение = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Значение дюрации индекса %1 за %2 равно 0", ДюрацияИндекса.Ключ, Формат(ЗначениеБиржевогоИндекса.Период, "ДФ=dd.MM.yyyy")), , , , ОшибкаРасчета);
				КонецЕсли;
			Конеццикла;
			
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRAAANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRAAANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRA2A = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRA2A / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTR2B3B = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTR2B3B / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			
			Если ОшибкаРасчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка расчета кредитного спреда '%1'", Субъект), , , , Отказ);
				Возврат Новый ТаблицаЗначений;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Расчет_кредитного_спреда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRAAANS КАК Y_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRAAANS КАК DURATION_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAAANS КАК GCURVE_DURATION_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRA2A КАК Y_RUCBTRA2A,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRA2A КАК DURATION_RUCBTRA2A,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRA2A КАК GCURVE_DURATION_RUCBTRA2A,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTR2B3B КАК Y_RUCBTR2B3B,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTR2B3B КАК DURATION_RUCBTR2B3B,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTR2B3B КАК GCURVE_DURATION_RUCBTR2B3B,
			|	ЗначенияБиржевыхИндексов.Y_RUGBICP3Y КАК Y_RUGBICP3Y,
			|	ЗначенияБиржевыхИндексов.Y_RUCBICPL3 КАК Y_RUCBICPL3,
			|	ЗначенияБиржевыхИндексов.Y_RUCBICPL2 КАК Y_RUCBICPL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	&ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRAAANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAAANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRA2A - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRA2A) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTR2B3B - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTR2B3B) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL3 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL2 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 4)
			|		ГДЕ
			|			&ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций""
			|			И КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 4)";
		
		Запрос.УстановитьПараметр("ММВБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));		
		Запрос.УстановитьПараметр("ЗначенияБиржевыхИндексов",	ЗначенияБиржевыхИндексов);

		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти
		
		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUCBTRAAANS_RUCBTRAANS_RUCBTRANS_RUCBTRBBBNS_ИКБДВТочкеДюрацииИндекса" Тогда
		
		#Область Индексы_RUCBTRAAANS_RUCBTRAANS_RUCBTRANS_RUCBTRBBBNS		
		
		// Индексы: RUCBTRAAANS, RUCBTRAANS, RUCBTRANS, RUCBTRBBBNS
		
		// Рейтинговая группа I:	(Y_RUCBTRAAANS - КБД_DURATION_RUCBTRAAANS) * 100
		// Рейтинговая группа II:	(Y_RUCBTRAANS - КБД_DURATION_RUCBTRAANS) * 100
		// Рейтинговая группа III:	(Y_RUCBTRANS - КБД_DURATION_RUCBTRANS) * 100
		// Рейтинговая группа IV:	(Y_RUCBTRBBBNS - КБД_DURATION_RUCBTRBBBNS) * 100		
		// Рейтинговая группа V:	значение индекса G-spread полной доходности российского рынка высокодоходных (ВДО) корпоративных облигаций		

		ПоследняяРейтинговаяГруппа = 5;

		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUCBTRAAANS, RUCBTRAANS, RUCBTRANS - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|КБД_DURATION - значение ставки КБД в точке, соответствующей дюрации соответствующего индекса ММВБ
			|Sрг - медиана спреда соответствующей рейтинговой группы 
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:   (Y_RUCBTRAAANS - КБД_DURATION_RUCBTRAAANS) * 100
			|Рейтинговая группа II:  (Y_RUCBTRAANS - КБД_DURATION_RUCBTRAANS) * 100
			|Рейтинговая группа III: (Y_RUCBTRANS - КБД_DURATION_RUCBTRANS) * 100
			|Рейтинговая группа IV:  (Y_RUCBTRBBBNS - КБД_DURATION_RUCBTRBBBNS) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа V:  значение индекса G-spread полной доходности российского рынка высокодоходных (ВДО) корпоративных облигаций";
			
			Если РейтинговаяГруппа = ПоследняяРейтинговаяГруппа Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Рейтинг ""%1"" попал в рейтинговую группу %2. Расчет кредитного спреда для данной группы не реализован.",
						Субъект, РаботаСоСтрокамиКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РейтинговаяГруппа, Ложь)), , , , ОшибкаРасчета);
			КонецЕсли;

		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда V рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти

		#Область Получение_значений_индексов_и_расчет_значений_КБД_в_точке_дюрации_индекса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUCBTRAAANS.YIELD КАК Y_RUCBTRAAANS,
			|	RUCBTRAAANS.DURATION КАК DURATION_RUCBTRAAANS,
			|	0 КАК GCURVE_DURATION_RUCBTRAAANS,
			|	RUCBTRAANS.YIELD КАК Y_RUCBTRAANS,
			|	RUCBTRAANS.DURATION КАК DURATION_RUCBTRAANS,
			|	0 КАК GCURVE_DURATION_RUCBTRAANS,
			|	RUCBTRANS.YIELD КАК Y_RUCBTRANS,
			|	RUCBTRANS.DURATION КАК DURATION_RUCBTRANS,
			|	0 КАК GCURVE_DURATION_RUCBTRANS,
			|	RUCBTRBBBNS.YIELD КАК Y_RUCBTRBBBNS,
			|	RUCBTRBBBNS.DURATION КАК DURATION_RUCBTRBBBNS,
			|	0 КАК GCURVE_DURATION_RUCBTRBBBNS
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRAAANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRAAANS
			|			ПО (БиржевойИндекс_RUCBTRAAANS.Код = ""RUCBTRAAANS"")
			|				И (БиржевойИндекс_RUCBTRAAANS.Ссылка = RUCBTRAAANS.БиржевойИндекс)
			|		ПО (RUCBTRAAANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRAANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRAANS
			|			ПО (БиржевойИндекс_RUCBTRAANS.Код = ""RUCBTRAANS"")
			|				И (БиржевойИндекс_RUCBTRAANS.Ссылка = RUCBTRAANS.БиржевойИндекс)
			|		ПО (RUCBTRAANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRANS
			|			ПО (БиржевойИндекс_RUCBTRANS.Код = ""RUCBTRANS"")
			|				И (БиржевойИндекс_RUCBTRANS.Ссылка = RUCBTRANS.БиржевойИндекс)
			|		ПО (RUCBTRANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBTRBBBNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBTRBBBNS
			|			ПО (БиржевойИндекс_RUCBTRBBBNS.Код = ""RUCBTRBBBNS"")
			|				И (БиржевойИндекс_RUCBTRBBBNS.Ссылка = RUCBTRBBBNS.БиржевойИндекс)
			|		ПО (RUCBTRBBBNS.Период = _КалендарьИндексов.Дата)";
		
		// Расчет значения КБД в точке дюрации индекса
		
		ТочностьКБД = 2;
		Если ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьКБД") Тогда
			ТочностьКБД = ПараметрыРасчетаКредитногоСпреда.ТочностьКБД;
		КонецЕсли;
		
		ЗначенияБиржевыхИндексов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ЗначениеБиржевогоИндекса Из ЗначенияБиржевыхИндексов Цикл

			ДюрацииИндексов = Новый Структура;
			ДюрацииИндексов.Вставить("RUCBTRAAANS",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRAAANS);
			ДюрацииИндексов.Вставить("RUCBTRAANS",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRAANS);
			ДюрацииИндексов.Вставить("RUCBTRANS",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRANS);
			ДюрацииИндексов.Вставить("RUCBTRBBBNS",	ЗначениеБиржевогоИндекса.DURATION_RUCBTRBBBNS);
				
			Для Каждого ДюрацияИндекса Из ДюрацииИндексов Цикл
				Если ДюрацияИндекса.Значение = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Значение дюрации индекса %1 за %2 равно 0", ДюрацияИндекса.Ключ, Формат(ЗначениеБиржевогоИндекса.Период, "ДФ=dd.MM.yyyy")), , , , ОшибкаРасчета);
				КонецЕсли;
			Конеццикла;
			
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRAAANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRAAANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRAANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRAANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBTRBBBNS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBTRBBBNS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			
			Если ОшибкаРасчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка расчета кредитного спреда '%1'", Субъект), , , , Отказ);
				Возврат Новый ТаблицаЗначений;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Расчет_кредитного_спреда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRAAANS КАК Y_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRAAANS КАК DURATION_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAAANS КАК GCURVE_DURATION_RUCBTRAAANS,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRAANS КАК Y_RUCBTRAANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRAANS КАК DURATION_RUCBTRAANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAANS КАК GCURVE_DURATION_RUCBTRAANS,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRANS КАК Y_RUCBTRANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRANS КАК DURATION_RUCBTRANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRANS КАК GCURVE_DURATION_RUCBTRANS,
			|	ЗначенияБиржевыхИндексов.Y_RUCBTRBBBNS КАК Y_RUCBTRBBBNS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBTRBBBNS КАК DURATION_RUCBTRBBBNS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRBBBNS КАК GCURVE_DURATION_RUCBTRBBBNS
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	&ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRAAANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAAANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRAANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRAANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBTRBBBNS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBTRBBBNS) * 100
			|	КОНЕЦ КАК КредитныйСпред
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		5) КАК НомераРейтинговыхГрупп";
		
		Запрос.УстановитьПараметр("ММВБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));		
		Запрос.УстановитьПараметр("ЗначенияБиржевыхИндексов",	ЗначенияБиржевыхИндексов);

		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти
		
		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUMBTRAAANS_RUMBTRAANS_RUMBTRANS_RUMBTRBBBNS_ИКБДВТочкеДюрацииИндекса" Тогда
		
		#Область Индексы_RUMBTRAAANS_RUMBTRAANS_RUMBTRANS_RUMBTRBBBNS		
		
		// Индексы: RUMBTRAAANS, RUMBTRAANS, RUMBTRANS, RUMBTRBBBNS
		
		// Рейтинговая группа I:	(Y_RUMBTRAAANS - КБД_DURATION_RUMBTRAAANS) * 100
		// Рейтинговая группа II:	(Y_RUMBTRAANS - КБД_DURATION_RUMBTRAANS) * 100
		// Рейтинговая группа III:	(Y_RUMBTRANS - КБД_DURATION_RUMBTRANS) * 100
		// Рейтинговая группа IV:	(Y_RUMBTRBBBNS - КБД_DURATION_RUMBTRBBBNS) * 100		
		// Рейтинговая группа V:	значение индекса G-spread полной доходности российского рынка высокодоходных (ВДО) корпоративных облигаций		

		ПоследняяРейтинговаяГруппа = 5;

		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUMBTRAAANS, RUMBTRAANS, RUMBTRANS - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|КБД_DURATION - значение ставки КБД в точке, соответствующей дюрации соответствующего индекса ММВБ
			|Sрг - медиана спреда соответствующей рейтинговой группы 
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:   (Y_RUMBTRAAANS - КБД_DURATION_RUMBTRAAANS) * 100
			|Рейтинговая группа II:  (Y_RUMBTRAANS - КБД_DURATION_RUMBTRAANS) * 100
			|Рейтинговая группа III: (Y_RUMBTRANS - КБД_DURATION_RUMBTRANS) * 100
			|Рейтинговая группа IV:  (Y_RUMBTRBBBNS - КБД_DURATION_RUMBTRBBBNS) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа V:  значение индекса G-spread полной доходности российского рынка высокодоходных (ВДО) корпоративных облигаций";
			
			Если РейтинговаяГруппа = ПоследняяРейтинговаяГруппа Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Рейтинг ""%1"" попал в рейтинговую группу %2. Расчет кредитного спреда для данной группы не реализован.",
						Субъект, РаботаСоСтрокамиКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РейтинговаяГруппа, Ложь)), , , , ОшибкаРасчета);
			КонецЕсли;

		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда V рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти

		#Область Получение_значений_индексов_и_расчет_значений_КБД_в_точке_дюрации_индекса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUMBTRAAANS.YIELD КАК Y_RUMBTRAAANS,
			|	RUMBTRAAANS.DURATION КАК DURATION_RUMBTRAAANS,
			|	0 КАК GCURVE_DURATION_RUMBTRAAANS,
			|	RUMBTRAANS.YIELD КАК Y_RUMBTRAANS,
			|	RUMBTRAANS.DURATION КАК DURATION_RUMBTRAANS,
			|	0 КАК GCURVE_DURATION_RUMBTRAANS,
			|	RUMBTRANS.YIELD КАК Y_RUMBTRANS,
			|	RUMBTRANS.DURATION КАК DURATION_RUMBTRANS,
			|	0 КАК GCURVE_DURATION_RUMBTRANS,
			|	RUMBTRBBBNS.YIELD КАК Y_RUMBTRBBBNS,
			|	RUMBTRBBBNS.DURATION КАК DURATION_RUMBTRBBBNS,
			|	0 КАК GCURVE_DURATION_RUMBTRBBBNS
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUMBTRAAANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUMBTRAAANS
			|			ПО (БиржевойИндекс_RUMBTRAAANS.Код = ""RUMBTRAAANS"")
			|				И (БиржевойИндекс_RUMBTRAAANS.Ссылка = RUMBTRAAANS.БиржевойИндекс)
			|		ПО (RUMBTRAAANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUMBTRAANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUMBTRAANS
			|			ПО (БиржевойИндекс_RUMBTRAANS.Код = ""RUMBTRAANS"")
			|				И (БиржевойИндекс_RUMBTRAANS.Ссылка = RUMBTRAANS.БиржевойИндекс)
			|		ПО (RUMBTRAANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUMBTRANS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUMBTRANS
			|			ПО (БиржевойИндекс_RUMBTRANS.Код = ""RUMBTRANS"")
			|				И (БиржевойИндекс_RUMBTRANS.Ссылка = RUMBTRANS.БиржевойИндекс)
			|		ПО (RUMBTRANS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUMBTRBBBNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUMBTRBBBNS
			|			ПО (БиржевойИндекс_RUMBTRBBBNS.Код = ""RUMBTRBBBNS"")
			|				И (БиржевойИндекс_RUMBTRBBBNS.Ссылка = RUMBTRBBBNS.БиржевойИндекс)
			|		ПО (RUMBTRBBBNS.Период = _КалендарьИндексов.Дата)";
		
		// Расчет значения КБД в точке дюрации индекса
		
		ТочностьКБД = 2;
		Если ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьКБД") Тогда
			ТочностьКБД = ПараметрыРасчетаКредитногоСпреда.ТочностьКБД;
		КонецЕсли;
		
		ЗначенияБиржевыхИндексов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ЗначениеБиржевогоИндекса Из ЗначенияБиржевыхИндексов Цикл

			ДюрацииИндексов = Новый Структура;
			ДюрацииИндексов.Вставить("RUMBTRAAANS",	ЗначениеБиржевогоИндекса.DURATION_RUMBTRAAANS);
			ДюрацииИндексов.Вставить("RUMBTRAANS",	ЗначениеБиржевогоИндекса.DURATION_RUMBTRAANS);
			ДюрацииИндексов.Вставить("RUMBTRANS",	ЗначениеБиржевогоИндекса.DURATION_RUMBTRANS);
			ДюрацииИндексов.Вставить("RUMBTRBBBNS",	ЗначениеБиржевогоИндекса.DURATION_RUMBTRBBBNS);
				
			Для Каждого ДюрацияИндекса Из ДюрацииИндексов Цикл
				Если ДюрацияИндекса.Значение = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Значение дюрации индекса %1 за %2 равно 0", ДюрацияИндекса.Ключ, Формат(ЗначениеБиржевогоИндекса.Период, "ДФ=dd.MM.yyyy")), , , , ОшибкаРасчета);
				КонецЕсли;
			Конеццикла;
			
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUMBTRAAANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUMBTRAAANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUMBTRAANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUMBTRAANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUMBTRANS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUMBTRANS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUMBTRBBBNS = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUMBTRBBBNS / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			
			Если ОшибкаРасчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка расчета кредитного спреда '%1'", Субъект), , , , Отказ);
				Возврат Новый ТаблицаЗначений;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Расчет_кредитного_спреда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ЗначенияБиржевыхИндексов.Y_RUMBTRAAANS КАК Y_RUMBTRAAANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUMBTRAAANS КАК DURATION_RUMBTRAAANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRAAANS КАК GCURVE_DURATION_RUMBTRAAANS,
			|	ЗначенияБиржевыхИндексов.Y_RUMBTRAANS КАК Y_RUMBTRAANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUMBTRAANS КАК DURATION_RUMBTRAANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRAANS КАК GCURVE_DURATION_RUMBTRAANS,
			|	ЗначенияБиржевыхИндексов.Y_RUMBTRANS КАК Y_RUMBTRANS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUMBTRANS КАК DURATION_RUMBTRANS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRANS КАК GCURVE_DURATION_RUMBTRANS,
			|	ЗначенияБиржевыхИндексов.Y_RUMBTRBBBNS КАК Y_RUMBTRBBBNS,
			|	ЗначенияБиржевыхИндексов.DURATION_RUMBTRBBBNS КАК DURATION_RUMBTRBBBNS,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRBBBNS КАК GCURVE_DURATION_RUMBTRBBBNS
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	&ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUMBTRAAANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRAAANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUMBTRAANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRAANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUMBTRANS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRANS) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUMBTRBBBNS - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUMBTRBBBNS) * 100
			|	КОНЕЦ КАК КредитныйСпред
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		5) КАК НомераРейтинговыхГрупп";
		
		Запрос.УстановитьПараметр("ММВБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));		
		Запрос.УстановитьПараметр("ЗначенияБиржевыхИндексов",	ЗначенияБиржевыхИндексов);

		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти
		
		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "СУчетомЗначенийКБДВТочкеДюрацииИндекса" Тогда
		
		#Область Индексы_RUCBITRBBB_RUCBITRBB_RUCBITRB		
		
		// Индексы: RUCBITRBBB, RUCBITRBB, RUCBITRB
		
		// Рейтинговая группа I:		(Y_RUCBITRBBB - КБД_DURATION_RUCBITRBBB) * 100
		// Рейтинговая группа II:		(Y_RUCBITRBB - КБД_DURATION_RUCBITRBB) * 100
		// Рейтинговая группа III:		(Y_RUCBITRB - КБД_DURATION_RUCBITRB) * 100
		// Рейтинговая группа IV (1):	ОКРУГЛ(СРЗНАЧ(Y_TM - КБД_СРВЗВЕШ_СРОК_ДО_ПОГАШЕНИЯ_ЦБ), 4) * 100		
		// Рейтинговая группа IV (2):	(Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа IV (3):	(Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ

		ПоследняяРейтинговаяГруппа = 4;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUCBITRBBB, RUCBITRBB, RUCBITRB - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|КБД_DURATION - значение ставки КБД в точке, соответствующей дюрации соответствующего индекса ММВБ
			|Sрг - медиана спреда соответствующей рейтинговой группы 
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:   (Y_RUCBITRBBB - КБД_DURATION_RUCBITRBBB) * 100
			|Рейтинговая группа II:  (Y_RUCBITRBB - КБД_DURATION_RUCBITRBB) * 100
			|Рейтинговая группа III: (Y_RUCBITRB - КБД_DURATION_RUCBITRB) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "ПоЗначениюПредыдущейРейтинговойГруппы" Тогда
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV: значение кредитного спреда для III рейтинговой группы, увеличенное на ОтклонениеКредитногоСпреда базисных пунктов";
		
		ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций" Тогда
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV (1): (Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа IV (2): (Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV:  ОКРУГЛ(СРЗНАЧ(Y_TM - КБД_СРВЗВЕШ_СРОК_ДО_ПОГАШЕНИЯ_ЦБ), 4) * 100";
			
			Если РейтинговаяГруппа = 4 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рейтинг " + Субъект + " попал в рейтинговую группу IV. Расчет кредитного спреда для данной группы не реализован.", , , , ОшибкаРасчета);
			КонецЕсли;
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти

		#Область Получение_значений_индексов_и_расчет_значений_КБД_в_точке_дюрации_индекса
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUCBITRBBB.YIELD КАК Y_RUCBITRBBB,
			|	RUCBITRBBB.DURATION КАК DURATION_RUCBITRBBB,
			|	0 КАК GCURVE_DURATION_RUCBITRBBB,
			|	RUCBITRBB.YIELD КАК Y_RUCBITRBB,
			|	RUCBITRBB.DURATION КАК DURATION_RUCBITRBB,
			|	0 КАК GCURVE_DURATION_RUCBITRBB,
			|	RUCBITRB.YIELD КАК Y_RUCBITRB,
			|	RUCBITRB.DURATION КАК DURATION_RUCBITRB,
			|	0 КАК GCURVE_DURATION_RUCBITRB,
			|	RUGBICP3Y.YIELD КАК Y_RUGBICP3Y,
			|	RUCBICPL3.YIELD КАК Y_RUCBICPL3,
			|	RUCBICPL2.YIELD КАК Y_RUCBICPL2
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBBB
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBBB
			|			ПО (БиржевойИндекс_RUCBITRBBB.Код = ""RUCBITRBBB"")
			|				И (БиржевойИндекс_RUCBITRBBB.Ссылка = RUCBITRBBB.БиржевойИндекс)
			|		ПО (RUCBITRBBB.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBB
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBB
			|			ПО (БиржевойИндекс_RUCBITRBB.Код = ""RUCBITRBB"")
			|				И (БиржевойИндекс_RUCBITRBB.Ссылка = RUCBITRBB.БиржевойИндекс)
			|		ПО (RUCBITRBB.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRB
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRB
			|			ПО (БиржевойИндекс_RUCBITRB.Код = ""RUCBITRB"")
			|				И (БиржевойИндекс_RUCBITRB.Ссылка = RUCBITRB.БиржевойИндекс)
			|		ПО (RUCBITRB.Период = _КалендарьИндексов.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBICP3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBICP3Y
			|			ПО (БиржевойИндекс_RUGBICP3Y.Код = ""RUGBICP3Y"")
			|				И (БиржевойИндекс_RUGBICP3Y.Ссылка = RUGBICP3Y.БиржевойИндекс)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL3
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL3
			|				ПО (БиржевойИндекс_RUCBICPL3.Код = ""RUCBICPL3"")
			|					И (БиржевойИндекс_RUCBICPL3.Ссылка = RUCBICPL3.БиржевойИндекс)
			|			ПО (RUCBICPL3.Период = RUGBICP3Y.Период)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL2
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL2
			|				ПО (БиржевойИндекс_RUCBICPL2.Код = ""RUCBICPL2"")
			|					И (БиржевойИндекс_RUCBICPL2.Ссылка = RUCBICPL2.БиржевойИндекс)
			|			ПО (RUCBICPL2.Период = RUGBICP3Y.Период)
			|		ПО (RUGBICP3Y.Период = _КалендарьИндексов.Дата)
			|			И (&ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"")
			|ГДЕ
			|	НЕ(RUGBICP3Y.Период ЕСТЬ NULL
			|				И &ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"")";
		
		// Расчет значения КБД в точке дюрации индекса
		
		ТочностьКБД = 2;
		Если ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьКБД") Тогда
			ТочностьКБД = ПараметрыРасчетаКредитногоСпреда.ТочностьКБД;
		КонецЕсли;
		
		ЗначенияБиржевыхИндексов = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ЗначениеБиржевогоИндекса Из ЗначенияБиржевыхИндексов Цикл

			ДюрацииИндексов = Новый Структура;
			ДюрацииИндексов.Вставить("RUCBITRBBB", ЗначениеБиржевогоИндекса.DURATION_RUCBITRBBB);
			ДюрацииИндексов.Вставить("RUCBITRBB",  ЗначениеБиржевогоИндекса.DURATION_RUCBITRBB);
			ДюрацииИндексов.Вставить("RUCBITRB",   ЗначениеБиржевогоИндекса.DURATION_RUCBITRB);
				
			Для Каждого ДюрацияИндекса Из ДюрацииИндексов Цикл
				Если ДюрацияИндекса.Значение = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Значение дюрации индекса %1 за %2 равно 0", ДюрацияИндекса.Ключ, Формат(ЗначениеБиржевогоИндекса.Период, "ДФ=dd.MM.yyyy")), , , , ОшибкаРасчета);
				КонецЕсли;
			Конеццикла;
			
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBITRBBB = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBITRBBB / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBITRBB = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBITRBB / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			Если Не ОшибкаРасчета Тогда
				ЗначениеБиржевогоИндекса.GCURVE_DURATION_RUCBITRB = Окр(РассчитатьЗначениеКривойБескупоннойДоходности(ЗначениеБиржевогоИндекса.Период, Окр(ДюрацииИндексов.RUCBITRB / 365, 4), , ОшибкаРасчета), ТочностьКБД);
			КонецЕсли;
			
			Если ОшибкаРасчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка расчета кредитного спреда '%1'", Субъект), , , , Отказ);
				Возврат Новый ТаблицаЗначений;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Расчет_кредитного_спреда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ЗначенияБиржевыхИндексов.Y_RUCBITRBBB КАК Y_RUCBITRBBB,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBITRBBB КАК DURATION_RUCBITRBBB,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRBBB КАК GCURVE_DURATION_RUCBITRBBB,
			|	ЗначенияБиржевыхИндексов.Y_RUCBITRBB КАК Y_RUCBITRBB,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBITRBB КАК DURATION_RUCBITRBB,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRBB КАК GCURVE_DURATION_RUCBITRBB,
			|	ЗначенияБиржевыхИндексов.Y_RUCBITRB КАК Y_RUCBITRB,
			|	ЗначенияБиржевыхИндексов.DURATION_RUCBITRB КАК DURATION_RUCBITRB,
			|	ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRB КАК GCURVE_DURATION_RUCBITRB,
			|	ЗначенияБиржевыхИндексов.Y_RUGBICP3Y КАК Y_RUGBICP3Y,
			|	ЗначенияБиржевыхИндексов.Y_RUCBICPL3 КАК Y_RUCBICPL3,
			|	ЗначенияБиржевыхИндексов.Y_RUCBICPL2 КАК Y_RUCBICPL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	&ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRBBB - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRBBB) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRBB - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRBB) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRB - _ЗначенияБиржевыхИндексов.GCURVE_DURATION_RUCBITRB) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL3 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL2 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 4)
			|		ГДЕ
			|			&ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = ""РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций""
			|			И КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 4)";
		
		Запрос.УстановитьПараметр("ММВБ",						ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));		
		Запрос.УстановитьПараметр("ЗначенияБиржевыхИндексов",	ЗначенияБиржевыхИндексов);

		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти
		
		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций" Тогда		
		
		#Область Индексы_RUGBICP3Y_RUCBICPBBB3Y_RUCBICPBB3Y_RUCBICPB3Y_RUCBICPL3_RUCBICPL2		
		
		// Индексы: RUGBICP3Y, RUCBICPBBB3Y, RUCBICPBB3Y, RUCBICPB3Y, RUCBICPL3, RUCBICPL2

		// Рейтинговая группа I:		(Y_RUCBICPBBB3Y - Y_RUGBICP3Y) * 100
		// Рейтинговая группа II:		(Y_RUCBICPBB3Y - Y_RUGBICP3Y) * 100
		// Рейтинговая группа III:		(Y_RUCBICPB3Y - Y_RUGBICP3Y) * 100
		// Рейтинговая группа IV (1):	(Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа IV (2):	(Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ
		// Рейтинговая группа IV (3):	по аналогам по итогам сделок

		ПоследняяРейтинговаяГруппа = 4;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUGBICP3Y, RUCBICPBBB3Y, RUCBICPBB3Y, RUCBICPB3Y, RUCBICPL3, RUCBICPL2 - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:      (Y_RUCBICPBBB3Y - Y_RUGBICP3Y) * 100
			|Рейтинговая группа II:     (Y_RUCBICPBB3Y - Y_RUGBICP3Y) * 100
			|Рейтинговая группа III:    (Y_RUCBICPB3Y - Y_RUGBICP3Y) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "ПоАналогамПоИтогамСделок" Тогда
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV:     по аналогам по итогам сделок";
			
			Если РейтинговаяГруппа = 4 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рейтинг " + Субъект + " попал в рейтинговую группу IV. Расчет кредитного спреда по итогам сделок на дату оценки с аналогичными облигациями не реализован.", , , , ОшибкаРасчета);
			КонецЕсли;	
				
		ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV (1): (Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа IV (2): (Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
						
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Получение_значений_индексов_и_расчет_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUGBICP3Y.YIELD КАК Y_RUGBICP3Y,
			|	RUCBICPBBB3Y.YIELD КАК Y_RUCBICPBBB3Y,
			|	RUCBICPBB3Y.YIELD КАК Y_RUCBICPBB3Y,
			|	RUCBICPB3Y.YIELD КАК Y_RUCBICPB3Y,
			|	RUCBICPL3.YIELD КАК Y_RUCBICPL3,
			|	RUCBICPL2.YIELD КАК Y_RUCBICPL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBICP3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBICP3Y
			|			ПО (БиржевойИндекс_RUGBICP3Y.Код = ""RUGBICP3Y"")
			|				И (БиржевойИндекс_RUGBICP3Y.Ссылка = RUGBICP3Y.БиржевойИндекс)
			|		ПО (RUGBICP3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPBBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPBBB3Y
			|			ПО (БиржевойИндекс_RUCBICPBBB3Y.Код = ""RUCBICPBBB3Y"")
			|				И (БиржевойИндекс_RUCBICPBBB3Y.Ссылка = RUCBICPBBB3Y.БиржевойИндекс)
			|		ПО (RUCBICPBBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPBB3Y
			|			ПО (БиржевойИндекс_RUCBICPBB3Y.Код = ""RUCBICPBB3Y"")
			|				И (БиржевойИндекс_RUCBICPBB3Y.Ссылка = RUCBICPBB3Y.БиржевойИндекс)
			|		ПО (RUCBICPBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPB3Y
			|			ПО (БиржевойИндекс_RUCBICPB3Y.Код = ""RUCBICPB3Y"")
			|				И (БиржевойИндекс_RUCBICPB3Y.Ссылка = RUCBICPB3Y.БиржевойИндекс)
			|		ПО (RUCBICPB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL3
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL3
			|			ПО (БиржевойИндекс_RUCBICPL3.Код = ""RUCBICPL3"")
			|				И (БиржевойИндекс_RUCBICPL3.Ссылка = RUCBICPL3.БиржевойИндекс)
			|		ПО (RUCBICPL3.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL2
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL2
			|			ПО (БиржевойИндекс_RUCBICPL2.Код = ""RUCBICPL2"")
			|				И (БиржевойИндекс_RUCBICPL2.Ссылка = RUCBICPL2.БиржевойИндекс)
			|		ПО (RUCBICPL2.Период = _КалендарьИндексов.Дата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPBBB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPBB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL3 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL2 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 4)
			|		ГДЕ
			|			КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 4)";
			
		Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));	
		
		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти

		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций2023" Тогда		
		
		#Область Индексы_RUGBICP3Y_RUCBCP3A3YNS_RUCBCPAA3YNS_RUCBCPA3YNS_RUCBCPBBBNS_RUCBICPL2_RUCBICPL3		
		
		// Индексы: RUGBICP3Y, RUCBCP3A3YNS, RUCBCPAA3YNS, RUCBCPA3YNS, RUCBCPBBBNS, RUCBICPL2, RUCBICPL3
		
		// Рейтинговая группа I:		(Y_RUCBCP3A3YNS - Y_RUGBICP3Y) * 100
		// Рейтинговая группа II:		(Y_RUCBCPAA3YNS - Y_RUGBICP3Y) * 100
		// Рейтинговая группа III:		(Y_RUCBCPA3YNS - Y_RUGBICP3Y) * 100
		// Рейтинговая группа IV:		(Y_RUCBCPBBBNS - Y_RUGBICP3Y) * 100		
		// Рейтинговая группа V (1):	(Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа V (2):	(Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ

		ПоследняяРейтинговаяГруппа = 5;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUGBICP3Y, RUCBCP3A3YNS, RUCBCPAA3YNS, RUCBCPA3YNS, RUCBCPBBBNS, RUCBICPL2, RUCBICPL3 - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:      (Y_RUCBCP3A3YNS - Y_RUGBICP3Y) * 100
			|Рейтинговая группа II:     (Y_RUCBCPAA3YNS - Y_RUGBICP3Y) * 100
			|Рейтинговая группа III:    (Y_RUCBCPA3YNS - Y_RUGBICP3Y) * 100
			|Рейтинговая группа IV:     (Y_RUCBCPBBBNS - Y_RUGBICP3Y) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа V (1):  (Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа V (2):  (Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда V рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
						
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Получение_значений_индексов_и_расчет_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUGBICP3Y.YIELD КАК Y_RUGBICP3Y,
			|	RUCBCP3A3YNS.YIELD КАК Y_RUCBCP3A3YNS,
			|	RUCBCPAA3YNS.YIELD КАК Y_RUCBCPAA3YNS,
			|	RUCBCPA3YNS.YIELD КАК Y_RUCBCPA3YNS,
			|	RUCBCPBBBNS.YIELD КАК Y_RUCBCPBBBNS,
			|	RUCBICPL3.YIELD КАК Y_RUCBICPL3,
			|	RUCBICPL2.YIELD КАК Y_RUCBICPL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBICP3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBICP3Y
			|			ПО (БиржевойИндекс_RUGBICP3Y.Код = ""RUGBICP3Y"")
			|				И (БиржевойИндекс_RUGBICP3Y.Ссылка = RUGBICP3Y.БиржевойИндекс)
			|		ПО (RUGBICP3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCP3A3YNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCP3A3YNS
			|			ПО (БиржевойИндекс_RUCBCP3A3YNS.Код = ""RUCBCP3A3YNS"")
			|				И (БиржевойИндекс_RUCBCP3A3YNS.Ссылка = RUCBCP3A3YNS.БиржевойИндекс)
			|		ПО (RUCBCP3A3YNS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCPAA3YNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCPAA3YNS
			|			ПО (БиржевойИндекс_RUCBCPAA3YNS.Код = ""RUCBCPAA3YNS"")
			|				И (БиржевойИндекс_RUCBCPAA3YNS.Ссылка = RUCBCPAA3YNS.БиржевойИндекс)
			|		ПО (RUCBCPAA3YNS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCPA3YNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCPA3YNS
			|			ПО (БиржевойИндекс_RUCBCPA3YNS.Код = ""RUCBCPA3YNS"")
			|				И (БиржевойИндекс_RUCBCPA3YNS.Ссылка = RUCBCPA3YNS.БиржевойИндекс)
			|		ПО (RUCBCPA3YNS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCPBBBNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCPBBBNS
			|			ПО (БиржевойИндекс_RUCBCPBBBNS.Код = ""RUCBCPBBBNS"")
			|				И (БиржевойИндекс_RUCBCPBBBNS.Ссылка = RUCBCPBBBNS.БиржевойИндекс)
			|		ПО (RUCBCPBBBNS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL3
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL3
			|			ПО (БиржевойИндекс_RUCBICPL3.Код = ""RUCBICPL3"")
			|				И (БиржевойИндекс_RUCBICPL3.Ссылка = RUCBICPL3.БиржевойИндекс)
			|		ПО (RUCBICPL3.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL2
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL2
			|			ПО (БиржевойИндекс_RUCBICPL2.Код = ""RUCBICPL2"")
			|				И (БиржевойИндекс_RUCBICPL2.Ссылка = RUCBICPL2.БиржевойИндекс)
			|		ПО (RUCBICPL2.Период = _КалендарьИндексов.Дата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCP3A3YNS - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCPAA3YNS - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCPA3YNS - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCPBBBNS - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 5
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL3 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 5
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL2 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		5) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 5)
			|		ГДЕ
			|			КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 5)";
			
		Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));	
		
		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти

		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций2024" Тогда		
		
		#Область Индексы_RUGBICP3Y_RUCBCP3A3YNS_RUCBCPAA3YNS_RUCBCPA3YNS_RUCBCPBBBNS_RUCBICPL2_RUCBICPL3		
		
		// Индексы: RUGBICP3Y, RUCBCP3A3YNS, RUCBCPA2A3Y, RUCBCP2B3B, RUCBICPL2, RUCBICPL3
		
		// Рейтинговая группа I:		(Y_RUCBCP3A3YNS - Y_RUGBICP3Y) * 100
		// Рейтинговая группа II:		(Y_RUCBCPA2A3Y - Y_RUGBICP3Y) * 100
		// Рейтинговая группа III:		(Y_RUCBCP2B3B - Y_RUGBICP3Y) * 100		
		// Рейтинговая группа IV (1):	(Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа IV (2):	(Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ

		ПоследняяРейтинговаяГруппа = 4;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUGBICP3Y, RUCBCP3A3YNS, RUCBCPA2A3Y, RUCBCP2B3B, RUCBICPL2, RUCBICPL3 - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:      (Y_RUCBCP3A3YNS - Y_RUGBICP3Y) * 100
			|Рейтинговая группа II:     (Y_RUCBCPA2A3Y - Y_RUGBICP3Y) * 100
			|Рейтинговая группа III:    (Y_RUCBCP2B3B - Y_RUGBICP3Y) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV (1):  (Y_RUCBICPL3 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа IV (2):  (Y_RUCBICPL2 - Y_RUGBICP3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
						
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Получение_значений_индексов_и_расчет_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUGBICP3Y.YIELD КАК Y_RUGBICP3Y,
			|	RUCBCP3A3YNS.YIELD КАК Y_RUCBCP3A3YNS,
			|	RUCBCPA2A3Y.YIELD КАК Y_RUCBCPA2A3Y,
			|	RUCBCP2B3B.YIELD КАК Y_RUCBCP2B3B,
			|	RUCBICPL3.YIELD КАК Y_RUCBICPL3,
			|	RUCBICPL2.YIELD КАК Y_RUCBICPL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBICP3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBICP3Y
			|			ПО (БиржевойИндекс_RUGBICP3Y.Код = ""RUGBICP3Y"")
			|				И (БиржевойИндекс_RUGBICP3Y.Ссылка = RUGBICP3Y.БиржевойИндекс)
			|		ПО (RUGBICP3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCP3A3YNS
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCP3A3YNS
			|			ПО (БиржевойИндекс_RUCBCP3A3YNS.Код = ""RUCBCP3A3YNS"")
			|				И (БиржевойИндекс_RUCBCP3A3YNS.Ссылка = RUCBCP3A3YNS.БиржевойИндекс)
			|		ПО (RUCBCP3A3YNS.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCPA2A3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCPA2A3Y
			|			ПО (БиржевойИндекс_RUCBCPA2A3Y.Код = ""RUCBCPA2A3Y"")
			|				И (БиржевойИндекс_RUCBCPA2A3Y.Ссылка = RUCBCPA2A3Y.БиржевойИндекс)
			|		ПО (RUCBCPA2A3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBCP2B3B
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBCP2B3B
			|			ПО (БиржевойИндекс_RUCBCP2B3B.Код = ""RUCBCP2B3B"")
			|				И (БиржевойИндекс_RUCBCP2B3B.Ссылка = RUCBCP2B3B.БиржевойИндекс)
			|		ПО (RUCBCP2B3B.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL3
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL3
			|			ПО (БиржевойИндекс_RUCBICPL3.Код = ""RUCBICPL3"")
			|				И (БиржевойИндекс_RUCBICPL3.Ссылка = RUCBICPL3.БиржевойИндекс)
			|		ПО (RUCBICPL3.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBICPL2
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBICPL2
			|			ПО (БиржевойИндекс_RUCBICPL2.Код = ""RUCBICPL2"")
			|				И (БиржевойИндекс_RUCBICPL2.Ссылка = RUCBICPL2.БиржевойИндекс)
			|		ПО (RUCBICPL2.Период = _КалендарьИндексов.Дата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCP3A3YNS - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCPA2A3Y - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBCP2B3B - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL3 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBICPL2 - _ЗначенияБиржевыхИндексов.Y_RUGBICP3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 4)
			|		ГДЕ
			|			КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 4)";
			
		Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));	
		
		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти

		#КонецОбласти
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаГосударственныхИКорпоративныхОблигаций" Тогда		
		
		#Область Индексы_RUGBITR3Y_RUCBITRBBB3Y_RUCBITRBB3Y_RUCBITRB3Y_RUCBITRL3_RUCBITRL2		
		
		// Индексы: RUGBITR3Y, RUCBITRBBB3Y, RUCBITRBB3Y, RUCBITRB3Y, RUCBITRL3, RUCBITRL2

		// Рейтинговая группа I:		(Y_RUCBITRBBB3Y - Y_RUGBITR3Y) * 100
		// Рейтинговая группа II:		(Y_RUCBITRBB3Y - Y_RUGBITR3Y) * 100
		// Рейтинговая группа III:		(Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100
		// Рейтинговая группа IV (1):	(Y_RUCBITRL3 - Y_RUGBITR3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
		// Рейтинговая группа IV (2):	(Y_RUCBITRL2 - Y_RUGBITR3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ

		ПоследняяРейтинговаяГруппа = 4;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUGBITR3Y, RUCBITRBBB3Y, RUCBITRBB3Y, RUCBITRB3Y, RUCBITRL3, RUCBITRL2 - индексы ММВБ
			|Y - значение доходности соответствующего индекса
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:      (Y_RUCBITRBBB3Y - Y_RUGBITR3Y) * 100
			|Рейтинговая группа II:     (Y_RUCBITRBB3Y - Y_RUGBITR3Y) * 100
			|Рейтинговая группа III:    (Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено Тогда 
			
			ОписаниеРасчета.Описание = ОписаниеРасчета.Описание + "
				|Рейтинговая группа IV (1): (Y_RUCBITRL3 - Y_RUGBITR3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 3 ММВБ
				|Рейтинговая группа IV (2): (Y_RUCBITRL2 - Y_RUGBITR3Y) * 100, для долговых ценных бумаг, входящих в котировальный уровень 2 ММВБ";
			
		Иначе
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , ОшибкаРасчета);
			
		КонецЕсли;
						
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;
		
		Если ОшибкаРасчета Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		#КонецОбласти
		
		#Область Получение_значений_индексов_и_расчет_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUGBITR3Y.YIELD КАК Y_RUGBITR3Y,
			|	RUCBITRBBB3Y.YIELD КАК Y_RUCBITRBBB3Y,
			|	RUCBITRBB3Y.YIELD КАК Y_RUCBITRBB3Y,
			|	RUCBITRB3Y.YIELD КАК Y_RUCBITRB3Y,
			|	RUCBITRL3.YIELD КАК Y_RUCBITRL3,
			|	RUCBITRL2.YIELD КАК Y_RUCBITRL2
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBITR3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBITR3Y
			|			ПО (БиржевойИндекс_RUGBITR3Y.Код = ""RUGBITR3Y"")
			|				И (БиржевойИндекс_RUGBITR3Y.Ссылка = RUGBITR3Y.БиржевойИндекс)
			|		ПО (RUGBITR3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBBB3Y
			|			ПО (БиржевойИндекс_RUCBITRBBB3Y.Код = ""RUCBITRBBB3Y"")
			|				И (БиржевойИндекс_RUCBITRBBB3Y.Ссылка = RUCBITRBBB3Y.БиржевойИндекс)
			|		ПО (RUCBITRBBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBB3Y
			|			ПО (БиржевойИндекс_RUCBITRBB3Y.Код = ""RUCBITRBB3Y"")
			|				И (БиржевойИндекс_RUCBITRBB3Y.Ссылка = RUCBITRBB3Y.БиржевойИндекс)
			|		ПО (RUCBITRBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRB3Y
			|			ПО (БиржевойИндекс_RUCBITRB3Y.Код = ""RUCBITRB3Y"")
			|				И (БиржевойИндекс_RUCBITRB3Y.Ссылка = RUCBITRB3Y.БиржевойИндекс)
			|		ПО (RUCBITRB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRL3
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRL3
			|			ПО (БиржевойИндекс_RUCBITRL3.Код = ""RUCBITRL3"")
			|				И (БиржевойИндекс_RUCBITRL3.Ссылка = RUCBITRL3.БиржевойИндекс)
			|		ПО (RUCBITRL3.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRL2
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRL2
			|			ПО (БиржевойИндекс_RUCBITRL2.Код = ""RUCBITRL2"")
			|				И (БиржевойИндекс_RUCBITRL2.Ссылка = RUCBITRL2.БиржевойИндекс)
			|		ПО (RUCBITRL2.Период = _КалендарьИндексов.Дата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRBBB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBITR3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRBB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBITR3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRB3Y - _ЗначенияБиржевыхИндексов.Y_RUGBITR3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRL3 - _ЗначенияБиржевыхИндексов.Y_RUGBITR3Y) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 4
			|				И КотировальныйУровеньММВБ.Значение = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.Y_RUCBITRL2 - _ЗначенияБиржевыхИндексов.Y_RUGBITR3Y) * 100
			|	КОНЕЦ КАК КредитныйСпред,
			|	КотировальныйУровеньММВБ.Значение КАК КотировальныйУровеньММВБ
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		4) КАК НомераРейтинговыхГрупп
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
			|			КотировкиТорговыхПлощадок.LISTNAME КАК Значение
			|		ИЗ
			|			РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РейтинговыеГруппы КАК _РейтинговыеГруппы
			|				ПО (_РейтинговыеГруппы.НомерГруппы = 4)
			|		ГДЕ
			|			КотировкиТорговыхПлощадок.ЦеннаяБумага = &Субъект
			|			И КотировкиТорговыхПлощадок.Период = &ПоследняяДатаТоргов
			|			И КотировкиТорговыхПлощадок.Биржа = &ММВБ
			|			И КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим) КАК КотировальныйУровеньММВБ
			|		ПО (НомераРейтинговыхГрупп.НомерГруппы = 4)";
			
		Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));	
		
		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти

		#КонецОбласти		
		
	ИначеЕсли ВариантРасчетаКредитногоСпреда = "ПоИндексамСовокупногоДоходаГосударственныхИКорпоративныхОблигаций" Тогда 
		
		#Область Индексы_RUGBITR3Y_RUCBITRBBB3Y_RUCBITRBB3Y_RUCBITRB3Y		
		
		// Индексы: RUGBITR3Y, RUCBITRBBB3Y, RUCBITRBB3Y, RUCBITRB3Y
		
		// Рейтинговая группа I:   ((Y_RUCBITRBBB3Y - Y_RUGBITR3Y) * 100 + (Y_RUCBITRBB3Y - Y_RUGBITR3Y) * 100) / 2
		// Рейтинговая группа II:  (Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100
		// Рейтинговая группа III: 1,5 * (Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100

		ПоследняяРейтинговаяГруппа = 3;
		
		#Область Проверка_параметров_и_описание_алгоритма_расчета
		
		ОписаниеРасчета = Новый Структура("Описание",
			"RUGBITR3Y, RUCBITRBBB3Y, RUCBITRBB3Y, RUCBITRB3Y - индексы
			|Y - значение доходности соответствующего индекса ММВБ
			|Sрг - медиана спреда соответствующей рейтинговой группы 
			|
			|Расчет кредитного спреда:
			|Рейтинговая группа I:   ((Y_RUCBITRBBB3Y - Y_RUGBITR3Y) * 100 + (Y_RUCBITRBB3Y - Y_RUGBITR3Y) * 100) / 2
			|Рейтинговая группа II:  (Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100
			|Рейтинговая группа III: 1,5 * (Y_RUCBITRB3Y - Y_RUGBITR3Y) * 100");
		
		Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы <> Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда IV рейтинговой группы '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы), , , , Отказ);
			Возврат Новый ТаблицаЗначений;			
		КонецЕсли;
		
		Если РасшифровкаРасчета <> Неопределено Тогда
			РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Алгоритм", ОписаниеРасчета, "Алгоритм расчета кредитного спреда");
		КонецЕсли;		
		
		#КонецОбласти
		
		#Область Получение_значений_индексов_и_расчет_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_КалендарьИндексов.Дата КАК Период,
			|	RUGBITR3Y.YIELD КАК YIELD,
			|	RUCBITRBBB3Y.YIELD КАК YIELD1,
			|	RUCBITRBB3Y.YIELD КАК YIELD2,
			|	RUCBITRB3Y.YIELD КАК YIELD3
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	_КалендарьИндексов КАК _КалендарьИндексов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUGBITR3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUGBITR3Y
			|			ПО (БиржевойИндекс_RUGBITR3Y.Код = ""RUGBITR3Y"")
			|				И (БиржевойИндекс_RUGBITR3Y.Ссылка = RUGBITR3Y.БиржевойИндекс)
			|		ПО (RUGBITR3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBBB3Y
			|			ПО (БиржевойИндекс_RUCBITRBBB3Y.Код = ""RUCBITRBBB3Y"")
			|				И (БиржевойИндекс_RUCBITRBBB3Y.Ссылка = RUCBITRBBB3Y.БиржевойИндекс)
			|		ПО (RUCBITRBBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRBB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRBB3Y
			|			ПО (БиржевойИндекс_RUCBITRBB3Y.Код = ""RUCBITRBB3Y"")
			|				И (БиржевойИндекс_RUCBITRBB3Y.Ссылка = RUCBITRBB3Y.БиржевойИндекс)
			|		ПО (RUCBITRBB3Y.Период = _КалендарьИндексов.Дата)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК RUCBITRB3Y
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК БиржевойИндекс_RUCBITRB3Y
			|			ПО (БиржевойИндекс_RUCBITRB3Y.Код = ""RUCBITRB3Y"")
			|				И (БиржевойИндекс_RUCBITRB3Y.Ссылка = RUCBITRB3Y.БиржевойИндекс)
			|		ПО (RUCBITRB3Y.Период = _КалендарьИндексов.Дата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераРейтинговыхГрупп.НомерГруппы КАК НомерГруппы,
			|	_ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ВЫБОР
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 1
			|			ТОГДА (_ЗначенияБиржевыхИндексов.YIELD1 + _ЗначенияБиржевыхИндексов.YIELD2 - 2 * _ЗначенияБиржевыхИндексов.YIELD) * 100 / 2
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 2
			|			ТОГДА (_ЗначенияБиржевыхИндексов.YIELD3 - _ЗначенияБиржевыхИндексов.YIELD) * 100
			|		КОГДА НомераРейтинговыхГрупп.НомерГруппы = 3
			|			ТОГДА (_ЗначенияБиржевыхИндексов.YIELD3 - _ЗначенияБиржевыхИндексов.YIELD) * 100 * 1.5
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КредитныйСпред
			|ПОМЕСТИТЬ _ЗначенияКредитныхСпредов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов,
			|	(ВЫБРАТЬ
			|		1 КАК НомерГруппы
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		2
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		3) КАК НомераРейтинговыхГрупп";
				
		Если РасшифровкаРасчета = Неопределено Тогда
			Запрос.Выполнить();
		Иначе
			РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", Неопределено, "ПараметрыЗапроса, _ЗначенияБиржевыхИндексов, _ЗначенияКредитныхСпредов");
		КонецЕсли;
		
		#КонецОбласти		
		
		#КонецОбласти		
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета кредитного спреда '%1' не реализован", ВариантРасчетаКредитногоСпреда), , , , Отказ);
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;	
	
	#Область Проверка_кредитных_спредов
	
	Если (ВариантРасчетаКредитногоСпреда = "СУчетомЗначенийКБДВТочкеДюрацииИндекса"
				ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаКорпоративныхОблигацийИКБДВТочкеДюрацииИндекса")
			И ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"
		ИЛИ (ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"
				ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций2023"
				ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаГосударственныхИКорпоративныхОблигаций")
			И ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = Неопределено
	Тогда
	
		Если РейтинговаяГруппа = ПоследняяРейтинговаяГруппа Тогда
			ЗначенияКредитныхСпредов = Запрос.МенеджерВременныхТаблиц.Таблицы["_ЗначенияКредитныхСпредов"].ПолучитьДанные().Выбрать();
			Если ЗначенияКредитныхСпредов.НайтиСледующий(РейтинговаяГруппа, "НомерГруппы") Тогда
				Если Не (ЗначенияКредитныхСпредов.КотировальныйУровеньММВБ = 2 ИЛИ ЗначенияКредитныхСпредов.КотировальныйУровеньММВБ = 3) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрШаблон("Алгоритм расчета кредитного спреда ""%1"", входящего в котировальный уровень %2 ММВБ, для %3 рейтинговой группы не определен",
							Субъект, ЗначенияКредитныхСпредов.КотировальныйУровеньММВБ, РаботаСоСтрокамиКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РейтинговаяГруппа, Ложь)));
					Возврат Новый ТаблицаЗначений;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Расчет_медианы_кредитного_спреда
	
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1000000
		|	_ЗначенияКредитныхСпредов.НомерГруппы КАК НомерГруппы,
		|	_ЗначенияКредитныхСпредов.КредитныйСпред КАК КредитныйСпред,
		|	АВТОНОМЕРЗАПИСИ() КАК Порядок
		|ПОМЕСТИТЬ _УпорядоченныеКредитныеСпреды
		|ИЗ
		|	_ЗначенияКредитныхСпредов КАК _ЗначенияКредитныхСпредов
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ЗначенияКредитныхСпредов.НомерГруппы,
		|	_ЗначенияКредитныхСпредов.КредитныйСпред
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УпорядоченныеКредитныеСпреды.НомерГруппы КАК НомерГруппы,
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(_УпорядоченныеКредитныеСпреды.КредитныйСпред) КАК ЧИСЛО(10, 0)) КАК Медиана
		|ПОМЕСТИТЬ _МедианыКредитныхСпредов
		|ИЗ
		|	_УпорядоченныеКредитныеСпреды КАК _УпорядоченныеКредитныеСпреды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_УпорядоченныеКредитныеСпреды.НомерГруппы КАК НомерГруппы,
		|			СРЕДНЕЕ(_УпорядоченныеКредитныеСпреды.Порядок) КАК Порядок
		|		ИЗ
		|			_УпорядоченныеКредитныеСпреды КАК _УпорядоченныеКредитныеСпреды
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_УпорядоченныеКредитныеСпреды.НомерГруппы) КАК Середины
		|		ПО _УпорядоченныеКредитныеСпреды.НомерГруппы = Середины.НомерГруппы
		|			И (_УпорядоченныеКредитныеСпреды.Порядок МЕЖДУ Середины.Порядок - 0.5 И Середины.Порядок + 0.5)
		|
		|СГРУППИРОВАТЬ ПО
		|	_УпорядоченныеКредитныеСпреды.НомерГруппы";

	КоличествоЗначенийКредитныхСпредов = СистемныеФункции.КоличествоЗаписейВременнойТаблицы(МенеджерВременныхТаблиц, "_ЗначенияКредитныхСпредов");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000000", "ПЕРВЫЕ " + Формат(КоличествоЗначенийКредитныхСпредов, "ЧН=; ЧГ="));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(10, 0)", СтрШаблон("ЧИСЛО(%1, %2)", ТочностьМедианыКредитногоСпреда + 10, ТочностьМедианыКредитногоСпреда));
	
	Запрос.Выполнить();
	
	#КонецОбласти
	
	#Область Расчет_диапазона_кредитного_спреда
	
	Запрос.Параметры.Очистить(); // Старые параметры больше не нужны	
	
	ОписаниеРасчетаДиапазонаСпреда = Новый ТаблицаЗначений;
	ОписаниеРасчетаДиапазонаСпреда.Колонки.Добавить("Группа");
	ОписаниеРасчетаДиапазонаСпреда.Колонки.Добавить("Min");
	ОписаниеРасчетаДиапазонаСпреда.Колонки.Добавить("Медиана");
	ОписаниеРасчетаДиапазонаСпреда.Колонки.Добавить("Max");
	
	Если ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "ОтМедианыПредыдущейГруппыДоРазницыУдвоеннойМедианыТекущейИПредыдущейГрупп_ВерхняяГраница2ГруппыРавнаМедиане3" Тогда
	
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа I", "0 + премия", "SргI + премия", "2*SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа II", "SргI + премия", "SргII + премия", "SргIII + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа III", "SргII + премия", "SргIII + премия", "2*SргIII - SргII + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа IV", "не считается", "SргIV + премия", "не считается"));			
		
		#Область Расчет_диапазона_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 4
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК Медиана,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 4
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 2
			|			ТОГДА ЕСТЬNULL(_МедианыКредитныхСпредовПлюс1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|		ИНАЧЕ 2 * _МедианыКредитныхСпредов.Медиана - ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовМинус1
			|		ПО (_МедианыКредитныхСпредовМинус1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы - 1)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовПлюс1
			|		ПО (_МедианыКредитныхСпредовПлюс1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы + 1)";	
		
		#КонецОбласти		
		
	ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "ОтМедианыПредыдущейГруппыДоРазницыУдвоеннойМедианыТекущейИПредыдущейГрупп_ВерхняяГраница2и3ГруппРавнаМедианеСледующейГруппы" Тогда
	
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа I", "0 + премия", "SргI + премия", "2*SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа II", "SргI + премия", "SргII + премия", "SргIII + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа III", "SргII + премия", "SргIII + премия", "SргIV + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа IV", "SргIII + премия", "SргIV + премия", "2*SргIV - SргIII + премия"));			
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа V", "не считается", "SргV + премия", "не считается"));			
		
		РейтинговаяГруппаБезРасчетаГраницДипазона = 5;
		
		#Область Расчет_диапазона_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = &РейтинговаяГруппаБезРасчетаГраницДипазона
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК Медиана,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = &РейтинговаяГруппаБезРасчетаГраницДипазона
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы В (2, 3)
			|			ТОГДА ЕСТЬNULL(_МедианыКредитныхСпредовПлюс1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|		ИНАЧЕ 2 * _МедианыКредитныхСпредов.Медиана - ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовМинус1
			|		ПО (_МедианыКредитныхСпредовМинус1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы - 1)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовПлюс1
			|		ПО (_МедианыКредитныхСпредовПлюс1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы + 1)";	
		
		Запрос.УстановитьПараметр("РейтинговаяГруппаБезРасчетаГраницДипазона", РейтинговаяГруппаБезРасчетаГраницДипазона);
		
		#КонецОбласти		
		
	ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "ПоЗначениямКредитногоСпредаРейтинговойГруппы" Тогда
		
		ОписаниеРасчетаДиапазонаСпреда = Новый Структура("Описание",
			"Минимальное, максимальное и медианное значения кредитных спредов для долговой ценной бумаги
			|принимаются равными соответствующим значениям кредитных спредов,
			|рассчитанным для рейтинговой группы, к которой отнесена ценная бумага");
		
		#Область Диапазон_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	ЭкстремумыКредитныхСпредов.МинимумКредитногоСпреда + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК Медиана,
			|	ЭкстремумыКредитныхСпредов.МаксимумКредитногоСпреда + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_ЗначенияКредитныхСпредов.НомерГруппы КАК НомерГруппы,
			|			МИНИМУМ(_ЗначенияКредитныхСпредов.КредитныйСпред) КАК МинимумКредитногоСпреда,
			|			МАКСИМУМ(_ЗначенияКредитныхСпредов.КредитныйСпред) КАК МаксимумКредитногоСпреда
			|		ИЗ
			|			_ЗначенияКредитныхСпредов КАК _ЗначенияКредитныхСпредов
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_ЗначенияКредитныхСпредов.НомерГруппы) КАК ЭкстремумыКредитныхСпредов
			|		ПО (ЭкстремумыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)";
		
		#КонецОбласти		
		
	ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "ПоМедиане" // "ОтМедианыПредыдущейГруппыДоРазницыУдвоеннойМедианыТекущейИПредыдущейГрупп"
		И (ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаКорпоративныхОблигацийИКБДВТочкеДюрацииИндекса"
			ИЛИ ВариантРасчетаКредитногоСпреда = "СУчетомЗначенийКБДВТочкеДюрацииИндекса"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций2023"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексовСовокупногоДоходаГосударственныхИКорпоративныхОблигаций"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUCBTRAAANS_RUCBTRAANS_RUCBTRANS_RUCBTRBBBNS_ИКБДВТочкеДюрацииИндекса"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUMBTRAAANS_RUMBTRAANS_RUMBTRANS_RUMBTRBBBNS_ИКБДВТочкеДюрацииИндекса")
	Тогда 
	
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа I", "0 + премия", "SргI + премия", "2*SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа II", "SргI + премия", "SргII + премия", "2*SргII - SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа III", "SргII + премия", "SргIII + премия", "2*SргIII - SргII + премия"));
		
		Если ВариантРасчетаКредитногоСпреда = "РазностьИндексовЧистыхЦенГосударственныхИКорпоративныхОблигаций2023"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUCBTRAAANS_RUCBTRAANS_RUCBTRANS_RUCBTRBBBNS_ИКБДВТочкеДюрацииИндекса"
			ИЛИ ВариантРасчетаКредитногоСпреда = "РазностьИндексов_RUMBTRAAANS_RUMBTRAANS_RUMBTRANS_RUMBTRBBBNS_ИКБДВТочкеДюрацииИндекса"
		Тогда
			ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
				"Рейтинговая группа IV", "SргIII + премия", "SргIV + премия", "2*SргIV - SргIII + премия"));
			ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
				"Рейтинговая группа V", "не считается", "SргV + премия", "не считается"));
			РейтинговаяГруппаБезРасчетаГраницДипазона = 5;
		Иначе
			ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
				"Рейтинговая группа IV", "не считается", "SргIV + премия", "не считается"));
			РейтинговаяГруппаБезРасчетаГраницДипазона = 4;
		КонецЕсли;
	
		#Область Диапазон_кредитного_спреда
	
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = &РейтинговаяГруппаБезРасчетаГраницДипазона
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК Медиана,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = &РейтинговаяГруппаБезРасчетаГраницДипазона
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ 2 * _МедианыКредитныхСпредов.Медиана - ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда
			|	КОНЕЦ КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовМинус1
			|		ПО (_МедианыКредитныхСпредовМинус1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы - 1)";
		
		Запрос.УстановитьПараметр("РейтинговаяГруппаБезРасчетаГраницДипазона", РейтинговаяГруппаБезРасчетаГраницДипазона);
		
		#КонецОбласти		
		
	ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "ПоМедиане" // ОтМедианыПредыдущейГруппыДоРазницыУдвоеннойМедианыТекущейИПредыдущейГрупп_ВерхняяГраница3ГруппыРавнаУдвоеннойМедиане2
		И ВариантРасчетаКредитногоСпреда = "ПоИндексамСовокупногоДоходаГосударственныхИКорпоративныхОблигаций"
	Тогда		
				
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа I", "0 + премия", "SргI + премия", "2*SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа II", "SргI + премия", "SргII + премия", "2*SргII - SргI + премия"));
		ЗаполнитьЗначенияСвойств(ОписаниеРасчетаДиапазонаСпреда.Добавить(), Новый Структура("Группа, Min, Медиана, Max",
			"Рейтинговая группа III", "SргII + премия", "SргIII + премия", "2*SргII + премия"));
		
		#Область Диапазон_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	ЕСТЬNULL(_МедианыКредитныхСпредовМинус1.Медиана, 0) - &ОтклонениеКредитногоСпреда + &ПремияЗаСубординированность КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность КАК Медиана,
			|	ВЫБОР
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 1
			|			ТОГДА 2 * _МедианыКредитныхСпредов.Медиана + &ОтклонениеКредитногоСпреда
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 2
			|			ТОГДА 2 * _МедианыКредитныхСпредов.Медиана - _МедианыКредитныхСпредовМинус1.Медиана + &ОтклонениеКредитногоСпреда
			|		КОГДА _МедианыКредитныхСпредов.НомерГруппы = 3
			|			ТОГДА 2 * _МедианыКредитныхСпредовМинус1.Медиана + &ОтклонениеКредитногоСпреда
			|		ИНАЧЕ 0
			|	КОНЕЦ + &ПремияЗаСубординированность КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредовМинус1
			|		ПО (_МедианыКредитныхСпредовМинус1.НомерГруппы = _МедианыКредитныхСпредов.НомерГруппы - 1)";
		
		#КонецОбласти		
		
	ИначеЕсли ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда = "НеРассчитывать" Тогда	
		
		ОписаниеРасчетаДиапазонаСпреда = Новый Структура("Описание", "Расчет не выполняется");
		
		#Область Диапазон_кредитного_спреда
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_РейтинговыеГруппы.НомерГруппы КАК НомерГруппы,
			|	НЕОПРЕДЕЛЕНО КАК МинимумКредитногоСпреда,
			|	_МедианыКредитныхСпредов.Медиана + &ПремияЗаСубординированность + &ОтклонениеКредитногоСпреда КАК Медиана,
			|	НЕОПРЕДЕЛЕНО КАК МаксимумКредитногоСпреда
			|ИЗ
			|	_РейтинговыеГруппы КАК _РейтинговыеГруппы
			|		ЛЕВОЕ СОЕДИНЕНИЕ _МедианыКредитныхСпредов КАК _МедианыКредитныхСпредов
			|		ПО (_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы)";
		
		#КонецОбласти		
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант расчета диапазона кредитного спреда '%1' не реализован", ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда), , , , Отказ);
		Возврат Новый ТаблицаЗначений;			
		
	КонецЕсли;
	
	Если РейтинговаяГруппа = ПоследняяРейтинговаяГруппа
		И ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаКредитногоСпредаПоследнейРейтинговойГруппы = "ПоЗначениюПредыдущейРейтинговойГруппы"
	Тогда
		
		Если Не ПараметрыРасчетаКредитногоСпреда.Свойство("ОтклонениеКредитногоСпредаПоследнейРейтинговойГруппы", ОтклонениеКредитногоСпреда) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Рейтинг ""%1"" попал в рейтинговую группу %2. Расчет кредитного спреда для данной группы выполняется на основании экспертного значения, которое на %3 не задано.",
					Субъект, РаботаСоСтрокамиКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РейтинговаяГруппа, Ложь), Формат(Дата, "ДФ=dd.MM.yyyy")), , , , Отказ);
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "_МедианыКредитныхСпредов.НомерГруппы = _РейтинговыеГруппы.НомерГруппы", "_МедианыКредитныхСпредов.НомерГруппы = " + (РейтинговаяГруппа - 1));
		
	ИначеЕсли Не ПараметрыРасчетаКредитногоСпреда.Свойство("ОтклонениеКредитногоСпреда", ОтклонениеКредитногоСпреда) Тогда
		
		ОтклонениеКредитногоСпреда = 0;
		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ВариантРасчетаДиапазонаКредитногоСпреда",								ПараметрыРасчетаКредитногоСпреда.ВариантРасчетаДиапазонаКредитногоСпреда);
	
	Запрос.УстановитьПараметр("ПремияЗаСубординированность",											ПремияЗаСубординированность);
	Запрос.УстановитьПараметр("УчитыватьПремиюЗаСубординированностьТолькоПриОтсутствииРейтингаВыпуска", ПараметрыРасчетаКредитногоСпреда.УчитыватьПремиюЗаСубординированностьТолькоПриОтсутствииРейтингаВыпуска);
	
	Запрос.УстановитьПараметр("ОтклонениеКредитногоСпреда",												ОтклонениеКредитногоСпреда);
	Запрос.УстановитьПараметр("ТочностьМедианыКредитногоСпреда",										ТочностьМедианыКредитногоСпреда); // чисто для расшифровки
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Диапазон кредитных спредов рейтинговых групп", ОписаниеРасчетаДиапазонаСпреда);
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаОперации, "Параметры расчета диапазона", Запрос.Параметры, , Истина, Истина);
	КонецЕсли;
	
	#КонецОбласти
	
	Если РасшифровкаРасчета = Неопределено Тогда
		КредитныйСпред = Запрос.Выполнить().Выгрузить();
	Иначе
		КредитныйСпред = РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаОперации, Запрос, , "Кредитный спред", , "");
	КонецЕсли;	
	
	// Проверка корректности расчета кредитного спреда
	
	Если ТипЗнч(КредитныйСпред) <> Тип("ТаблицаЗначений")
		ИЛИ КредитныйСпред.Количество() = 0
		ИЛИ КредитныйСпред[0].Медиана = NULL
		ИЛИ КредитныйСпред[0].МинимумКредитногоСпреда = NULL
		ИЛИ КредитныйСпред[0].МаксимумКредитногоСпреда = NULL
	Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка расчета кредитного спреда '%1'", Субъект), , , , Отказ);
		
	Иначе
		
		Если ПараметрыРасчетаКредитногоСпреда.Свойство("ТочностьДиапазонаКредитныхСпредов") Тогда
			
			ОписаниеТипаДиапазонаКредитныхСпредов = Новый ОписаниеТипов("Число, NULL", 
				Новый КвалификаторыЧисла(27, ПараметрыРасчетаКредитногоСпреда.ТочностьДиапазонаКредитныхСпредов));
			
			РаботаСКоллекциями.ТаблицаЗначений_ОбновитьТочностьКолонок(КредитныйСпред,
				Новый Структура("МинимумКредитногоСпреда, МаксимумКредитногоСпреда", ОписаниеТипаДиапазонаКредитныхСпредов, ОписаниеТипаДиапазонаКредитныхСпредов));

		КонецЕсли;

	КонецЕсли;	
	
	Возврат КредитныйСпред;
	
КонецФункции

#КонецОбласти

#Область Средневзвешенный_срок_до_погашения

Функция РассчитатьСредневзвешенныйСрокДоПогашенияИлиОферты(Облигация, Дата, ДенежныйПоток)
	
	// Получаем потоки по погашению тела
	
	ДатаПереоценки = Неопределено;
	
	Если ДенежныйПоток = Неопределено Тогда	
		ВызватьИсключение "Не задан параметр 'Денежный поток'";
	КонецЕсли;	
		
	Если ДенежныйПоток.Колонки.Найти("Купон") <> Неопределено Тогда
		
		ПогашениеТела = ДенежныйПоток.Скопировать(Новый Структура("Купон", Ложь), "Дата, Поток");
		ПогашениеТела.Свернуть("Дата", "Поток");
		
	ИначеЕсли ДенежныйПоток.Колонки.Найти("ПотокПоТелу") <> Неопределено Тогда
		
		ПогашениеТела = Новый ТаблицаЗначений;
		ПогашениеТела.Колонки.Добавить("Дата",	Новый ОписаниеТипов("Дата"));
		ПогашениеТела.Колонки.Добавить("Поток",	Новый ОписаниеТипов("Число"));
		
		Для Каждого СтрокаПотока Из ДенежныйПоток Цикл
			Если СтрокаПотока.ПотокПоТелу <> 0 Тогда
				СтрокаПогашенияТела = ПогашениеТела.Добавить();
				СтрокаПогашенияТела.Дата	= СтрокаПотока.Дата;	
				СтрокаПогашенияТела.Поток	= СтрокаПотока.ПотокПоТелу;
			КонецЕсли;
		КонецЦикла;
		
		ПогашениеТела.Свернуть("Дата", "Поток");
		
	Иначе
		
		ПогашениеТела = ДенежныйПоток;	
		
	КонецЕсли;
	
	// Расчет	
	
	НоминалНаДату = Справочники.Облигации.ПолучитьНоминал(Облигация, Дата);
	
	СрокДоПогашения = 0;
	Для Каждого СтрокаПотока Из ПогашениеТела Цикл
		СрокДоПогашения = СрокДоПогашения + СтрокаПотока.Поток / НоминалНаДату * (СтрокаПотока.Дата - Дата) / 86400 / 365;
	КонецЦикла;
	
	Возврат СрокДоПогашения;
	
КонецФункции	

Функция РассчитатьСредневзвешенныйСрокДоПогашенияДепозита(ДепозитныйВклад, Дата)
	
	ДенежныйПоток = ДепозитныйВклад.ПлановыеВыплаты;
	НоминалНаДату = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ДепозитныйВклад, Дата).Номинал;
	
	СрокДоПогашения = 0;
	Для Каждого КусокПотока Из ДенежныйПоток Цикл
		Если КусокПотока.Тип = Перечисления.ТипыВыплатПоДепозитнымВкладам.Проценты Тогда
			Продолжить;
		КонецЕсли;
		Если КусокПотока.Период > Дата Тогда
			Если ЗначениеЗаполнено(НоминалНаДату) Тогда
				СрокДоПогашения = СрокДоПогашения + КусокПотока.Сумма / НоминалНаДату * (КусокПотока.Период - НачалоДня(Дата)) / 86400 / 365;
			Иначе
				СрокДоПогашения = СрокДоПогашения + (КусокПотока.Период - НачалоДня(Дата)) / 86400 / 365;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат СрокДоПогашения;
	
КонецФункции

Функция РассчитатьСредневзвешенныйСрокДоПогашенияМНО(МНО, Дата)
	
	СрокДоПогашения = 0;
	Если МНО.ДатаВозврата > Дата Тогда
		СрокДоПогашения = (МНО.ДатаВозврата - НачалоДня(Дата)) / 86400 / 365;
	КонецЕсли;
	
	Возврат СрокДоПогашения;
	
КонецФункции

#КонецОбласти

#Область Безрисковая_ставка_доходности

Функция РассчитатьБезрисковуюСтавкуДоходности(ЦеннаяБумага, Дата, ДенежныйПоток = Неопределено, Отказ, РасшифровкаРасчета = Неопределено) Экспорт
	
	БезрисковаяСтавкаДоходности = 0;	
	
	Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") И ЦеннаяБумага.ИндексируемыйНоминал Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КотировкиТорговыхПлощадокСводныеСрезПоследних.YIELDCLOSE
			|ИЗ
			|	РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
			|			&Период,
			|			ЦеннаяБумага = &ЦеннаяБумага) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
			|ГДЕ
			|	КотировкиТорговыхПлощадокСводныеСрезПоследних.YIELDCLOSE <> 0");
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			БезрисковаяСтавкаДоходности = ВыборкаДетальныеЗаписи.YIELDCLOSE;
		КонецЕсли;

	Иначе
		
		БезрисковаяСтавкаДоходности = РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(ЦеннаяБумага, Дата, ДенежныйПоток, Отказ, , 2, РасшифровкаРасчета);
		
	КонецЕсли;

	Возврат БезрисковаяСтавкаДоходности;
	
КонецФункции

// Бескупонная доходность актива в точке, соответствующей средневзвешенному сроку до погашения, в процентах
Функция РассчитатьНоминальнуюБезрисковуюСтавкуДоходности(Актив, Дата, ДенежныйПоток = Неопределено, Отказ, ТочностьСрокаДоПогашения = 4, ТочностьСтавки = Неопределено, РасшифровкаРасчета = Неопределено) Экспорт
	
	Если ТипЗнч(Актив) <> Тип("СправочникСсылка.Облигации")
		И ТипЗнч(Актив) <> Тип("СправочникСсылка.ДепозитныеВклады")
		И ТипЗнч(Актив) <> Тип("ДокументСсылка.МНО")
	Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипЗнч(Актив) = Тип("СправочникСсылка.Облигации") Тогда
		СрокДоПогашения = РассчитатьСредневзвешенныйСрокДоПогашенияИлиОферты(Актив, Дата, ДенежныйПоток);
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		СрокДоПогашения = РассчитатьСредневзвешенныйСрокДоПогашенияДепозита(Актив, Дата);
	ИначеЕсли ТипЗнч(Актив) = Тип("ДокументСсылка.МНО") Тогда
		СрокДоПогашения = РассчитатьСредневзвешенныйСрокДоПогашенияМНО(Актив, Дата);
	КонецЕсли;
	
	Если ТочностьСрокаДоПогашения <> Неопределено Тогда
		СрокДоПогашения = Окр(СрокДоПогашения, ТочностьСрокаДоПогашения); // у Атома и Ливанова в методике описано округление. СД Инфинитум так считает
	КонецЕсли;
	
	ЗначениеКривой = 0;
	
	Если СрокДоПогашения <> 0 Тогда // дефолтные бумаги?
		ЗначениеКривой = РассчитатьЗначениеКривойБескупоннойДоходности(Дата, СрокДоПогашения, , Отказ);
	КонецЕсли;	
	
	Если ТочностьСтавки <> Неопределено Тогда
		ЗначениеКривой = Окр(ЗначениеКривой, ТочностьСтавки);	
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РассчитатьНоминальнуюБезрисковуюСтавкуДоходности",
			Новый Структура("ТочностьСрокаДоПогашения, СрокДоПогашения, ТочностьСтавки, ЗначениеКБД", ТочностьСрокаДоПогашения, СрокДоПогашения, ТочностьСтавки, ЗначениеКривой),
			"Бескупонная доходность актива в точке, соответствующей средневзвешенному сроку до погашения");
	КонецЕсли;
	
	Возврат ЗначениеКривой; 
		
КонецФункции

// Возвращает значение КБД в процентах
//
// Параметры:
//	Дата				- Дата													- дата, на которую определяется значение
//	СрокДоПогашения		- Число													- срок до погашения в годах
//	ВидКривой			- ПеречислениеСсылка.ВидыКривойБескупоннойДоходности	- вид кривой
//						- Неопределено											- актуальный вид кривой Московской биржи, действующий на указанную дату
//	Отказ				- Булево												- выходной параметр, при ошибке устанавливается в значение Истина
//	ДатаЗначения		- Дата													- Необязательный. Выходной параметр, заполняется датой значения
//	РасшифровкаРасчета	- Структура, Неопределено								- 
//
// Возвращаемое значение:
//	Значение - Число - значение КБД или 0 при ошибке
//
Функция РассчитатьЗначениеКривойБескупоннойДоходности(Дата, СрокДоПогашения, ВидКривой = Неопределено, Отказ, ДатаЗначения = Неопределено, РасшифровкаРасчета = Неопределено) Экспорт
	
	#Область Проверка_входящих_параметров

	Если (ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.ЕврозонаААА 
		ИЛИ ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.Еврозона) 
		И Дата > Дата(2026, 7, 2) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Значения КБД '%1' не закачиваются с 02.07.2026 г. Обратитесь к программистам!", ВидКривой), , , , Отказ);
	КонецЕсли;	
	
	Если ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.ЕврозонаААА И СрокДоПогашения <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Получение значения КБД '%1' реализовано только для срока погашения 1 год", ВидКривой), , , , Отказ);
	КонецЕсли;
	
	#КонецОбласти
	
	КривыеСПредопределеннымиСроками = Новый Массив;
	КривыеСПредопределеннымиСроками.Добавить(Перечисления.ВидыКривойБескупоннойДоходности.США);
	КривыеСПредопределеннымиСроками.Добавить(Перечисления.ВидыКривойБескупоннойДоходности.Еврозона);
	КривыеСПредопределеннымиСроками.Добавить(Перечисления.ВидыКривойБескупоннойДоходности.ЕврозонаААА);
	
	Если ВидКривой = Неопределено
		ИЛИ КривыеСПредопределеннымиСроками.Найти(ВидКривой) = Неопределено
	Тогда
	
	    #Область Расчет_для_рублей
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПараметрыКривойБескупоннойДоходности.beta0,
			|	ПараметрыКривойБескупоннойДоходности.beta1,
			|	ПараметрыКривойБескупоннойДоходности.beta2,
			|	ПараметрыКривойБескупоннойДоходности.tau,
			|	ПараметрыКривойБескупоннойДоходности.g1,
			|	ПараметрыКривойБескупоннойДоходности.g2,
			|	ПараметрыКривойБескупоннойДоходности.g3,
			|	ПараметрыКривойБескупоннойДоходности.g4,
			|	ПараметрыКривойБескупоннойДоходности.g5,
			|	ПараметрыКривойБескупоннойДоходности.g6,
			|	ПараметрыКривойБескупоннойДоходности.g7,
			|	ПараметрыКривойБескупоннойДоходности.g8,
			|	ПараметрыКривойБескупоннойДоходности.g9,
			|	ПараметрыКривойБескупоннойДоходности.ВидПараметра
			|ИЗ
			|	РегистрСведений.ПараметрыКривойБескупоннойДоходности КАК ПараметрыКривойБескупоннойДоходности
			|ГДЕ
			|	ПараметрыКривойБескупоннойДоходности.Период = &Период
			|	И ПараметрыКривойБескупоннойДоходности.ВидПараметра В (&ВидКривой)");
			
		ДатаЗначения = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Константы.ОсновнойКалендарьКотировок.Получить(), Дата);

		Если ДатаЗначения = '20220107' Тогда // биржа торговала, но параметры КБД не рассчитывала (#410701 #Хардкод)
			ДатаЗначения = '20220106';		
		КонецЕсли;

		Если ВидКривой = Неопределено Тогда
			ВидКривой = Новый Массив;
			ВидКривой.Добавить(Перечисления.ВидыКривойБескупоннойДоходности.Текущее);
			ВидКривой.Добавить(Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017);
		КонецЕсли;

		Запрос.УстановитьПараметр("Период",		ДатаЗначения);
		Запрос.УстановитьПараметр("ВидКривой",	ВидКривой);

		РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет параметров кривой бескупонной доходности на " + Формат(ДатаЗначения, "ДФ=dd.MM.yyyy"), , , , Отказ);
			
		Иначе
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			Если Не ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("ВидПараметра", Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017)) Тогда
				ВыборкаДетальныеЗаписи.Сбросить();
				ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("ВидПараметра", Перечисления.ВидыКривойБескупоннойДоходности.Текущее));
			КонецЕсли;

			Возврат РассчитатьЗначениеКривойБескупоннойДоходностиПоПараметрам(ВыборкаДетальныеЗаписи.ВидПараметра, ВыборкаДетальныеЗаписи, СрокДоПогашения, Отказ);		
			
		КонецЕсли;

		#КонецОбласти			
	
	Иначе
	
	    #Область Расчет_для_США_и_Еврозоны
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(ТаблицаИндексов.Индекс КАК Справочник.БиржевыеИндексы) КАК Индекс,
			|	ТаблицаИндексов.Срок КАК Срок
			|ПОМЕСТИТЬ _ТаблицаИндексов
			|ИЗ
			|	&ТаблицаИндексов КАК ТаблицаИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗначенияБиржевыхИндексов.Период КАК Период,
			|	ЗначенияБиржевыхИндексов.БиржевойИндекс КАК Индекс,
			|	ЗначенияБиржевыхИндексов.YIELD КАК Доходность
			|ПОМЕСТИТЬ _ЗначенияБиржевыхИндексов
			|ИЗ
			|	РегистрСведений.ЗначенияБиржевыхИндексов.СрезПоследних(
			|			&Период,
			|			(Биржа, БиржевойИндекс) В
			|				(ВЫБРАТЬ
			|					_ТаблицаИндексов.Индекс.Владелец,
			|					_ТаблицаИндексов.Индекс
			|				ИЗ
			|					_ТаблицаИндексов)) КАК ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(_ЗначенияБиржевыхИндексов.Период) КАК Период
			|ПОМЕСТИТЬ _ПоследняяДатаИндексов
			|ИЗ
			|	_ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТаблицаИндексов.Индекс КАК Индекс,
			|	_ТаблицаИндексов.Срок КАК Срок,
			|	_ЗначенияБиржевыхИндексов.Доходность КАК Доходность
			|ИЗ
			|	_ТаблицаИндексов КАК _ТаблицаИндексов
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗначенияБиржевыхИндексов КАК _ЗначенияБиржевыхИндексов
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПоследняяДатаИндексов КАК _ПоследняяДатаИндексов
			|			ПО _ЗначенияБиржевыхИндексов.Период = _ПоследняяДатаИндексов.Период
			|		ПО (_ЗначенияБиржевыхИндексов.Индекс = _ТаблицаИндексов.Индекс)";
		
		Если ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.США Тогда
			ТаблицаИндексов = Справочники.БиржевыеИндексы.ИндексыГосударственныхОблигацийСША();
		Иначе
			ТаблицаИндексов = Справочники.БиржевыеИндексы.ИндексыГосударственныхОблигацийЕврозоны(ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.ЕврозонаААА);
		КонецЕсли;		

		СтрокаИндекса = ТаблицаИндексов.Найти(СрокДоПогашения, "Срок"); // Если указана узловая точка, то наличие других значений не требуется
		
		Если СтрокаИндекса <> Неопределено Тогда
			ТаблицаИндексов = ТаблицаИндексов.Скопировать(РаботаСКоллекциями.ЗначениеВМассив(СтрокаИндекса));
		КонецЕсли;	
			
		Запрос.УстановитьПараметр("Период",			 Дата);
		Запрос.УстановитьПараметр("ТаблицаИндексов", ТаблицаИндексов);

		ЗначенияИндексов = Запрос.Выполнить().Выгрузить();
		ДатаЗначения	 = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПоследняяДатаИндексов"].ПолучитьДанные().Выгрузить()[0][0];

		Если ЗначенияИндексов.Количество() > 0 Тогда

			ПустыеЗначения = ЗначенияИндексов.НайтиСтроки(Новый Структура("Доходность", NULL));
			
			Если ПустыеЗначения.Количество() = 0 Тогда
				
				Если СтрокаИндекса = Неопределено Тогда
					
					Возврат МатематическиеФункции.ЛинейнаяИнтерполяция(СрокДоПогашения, ЗначенияИндексов, "Срок", "Доходность", РасшифровкаРасчета);
					
				Иначе	
					
					Если РасшифровкаРасчета <> Неопределено Тогда
						РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "Значение КБД в точке " + СрокДоПогашения, Новый Структура("Описание, Значение", "Точка совпадает с узловой", ЗначенияИндексов[0].Доходность));
					КонецЕсли;
					
					Возврат ЗначенияИндексов[0].Доходность;
					
				КонецЕсли;					
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("На %1 нет значений индексов %2",
						Формат(ДатаЗначения, "ДФ=dd.MM.yyyy"), СтрСоединить(ЗначенияИндексов.Скопировать(ПустыеЗначения).ВыгрузитьКолонку("Индекс"), ", ")), , , , Отказ);
						
			КонецЕсли;
				
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("На %1 нет значений КБД '%2'", Формат(Дата, "ДФ=dd.MM.yyyy"), ВидКривой), , , , Отказ);
			
		КонецЕсли;		

		#КонецОбласти
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция РассчитатьЗначениеКривойБескупоннойДоходностиПоПараметрам(ВидКривой, ПараметрыКривой, СрокДоПогашения, Отказ) Экспорт
	
	Если СрокДоПогашения = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Срок до погашения не может быть равен 0", , , , Отказ);
		Возврат 0;
	КонецЕсли;	
	
	Если ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017 Тогда
		
		beta0 	= ПараметрыКривой.beta0;
		beta1 	= ПараметрыКривой.beta1;
		beta2 	= ПараметрыКривой.beta2;
		tau 	= ПараметрыКривой.tau;
		
		g		= Новый Массив(10);
		g[1]	= ПараметрыКривой.g1;
		g[2]	= ПараметрыКривой.g2;
		g[3]	= ПараметрыКривой.g3;
		g[4]	= ПараметрыКривой.g4;
		g[5]	= ПараметрыКривой.g5;
		g[6]	= ПараметрыКривой.g6;
		g[7]	= ПараметрыКривой.g7;
		g[8]	= ПараметрыКривой.g8;
		g[9]	= ПараметрыКривой.g9;
		
		ЗначениеКривой = beta0 
			+ (beta1 + beta2) * tau / СрокДоПогашения * (1 - Exp( - СрокДоПогашения / tau))
			- beta2 * Exp( - СрокДоПогашения / tau);
		
		к = 1.6;
		а2 = 0.6;
		
		Для сц=1 по 9 Цикл
			
			а = ?(сц=1, 0, ?(сц=2, а2, а + а2 * Pow(к,сц-2)));
			б = ?(сц=1, а2, б * к);
			
			ЗначениеКривой = ЗначениеКривой
				+ g[сц] * Exp( - Pow(СрокДоПогашения - а, 2) / Pow(б, 2));
				
		КонецЦикла;	
			
	ИначеЕсли ВидКривой = Перечисления.ВидыКривойБескупоннойДоходности.Текущее Тогда
		
		beta0 	= ПараметрыКривой.beta0;
		beta1 	= ПараметрыКривой.beta1;
		beta2 	= ПараметрыКривой.beta2;
		tau 	= ПараметрыКривой.tau;
		g1 		= ПараметрыКривой.g1;
		g2 		= ПараметрыКривой.g2;
		g3 		= ПараметрыКривой.g3;
		
		ЗначениеКривой = beta0 
			+ (beta1 + beta2) * tau / СрокДоПогашения * (1 - Exp( - СрокДоПогашения / tau))
			- beta2 * Exp( - СрокДоПогашения / tau)
			+ g1 * Exp( - Pow(СрокДоПогашения, 2) / 2)
			+ g2 * Exp( - Pow(СрокДоПогашения - 1, 2) / 2)
			+ g3 * Exp( - Pow(СрокДоПогашения - 2, 2) / 2);		
		
	КонецЕсли;
	
	ЗначениеКривойВПроцентах = 100 * (Exp(ЗначениеКривой / 10000) - 1);
	
	Возврат ЗначениеКривойВПроцентах;	
	
КонецФункции

#КонецОбласти

#Область Дисконтирование_стоимости_денежного_потока

// Возвращает дисконтированную стоимость денежных потоков, рассчитанную по формуле:
//                CF(i)
// СС = Σ ———————————————————————— 
//                   t(i) - t(0)
//                   ——————————— 
//        (1 + r) ^       T
//			
// CF(i)    – будущие денежные потоки по долговой ценной бумаге
// r     	– ставка дисконтирования
// t(i)     – дата i-го платежа
// t(0)		– дата оценки
// T		– количество календарных дней в году, к которому относится платеж
//
// Параметры:
//	ДенежныйПоток					- ТаблицаЗначений			- денежные потоки
//	СтавкаДисконтирования			- Число 					- ставка дисконтирования
//	ДатаПереоценки					- Дата 						- 
//	ПараметрыОценки					- Структура, Неопределено	- ключи ТочностьДисконтированногоПотока 
//	Отказ							- Булево					- 
//	РасшифровкаРасчета				- Структура, Неопределено 	- 
//
// Возвращаемое значение:
//	Стоимость - Число - рассчитанная стоимость или 0 при ошибке (Отказ = Истина)
//
Функция РассчитатьДисконтированнуюСтоимость(ДенежныйПоток, СтавкаДисконтирования, ДатаПереоценки, ПараметрыОценки = Неопределено, Отказ = Ложь, РасшифровкаРасчета = Неопределено) Экспорт

	#Область Проверка_и_обработка_входящих_параметров
	
	Если ТипЗнч(ДенежныйПоток) <> Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Некорректное значение параметра денежный поток '%1'", ТипЗнч(ДенежныйПоток)), , , , Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТочностьДисконтированногоПотока	= Неопределено;
	
	Если ТипЗнч(ПараметрыОценки) = Тип("Структура") Тогда
		ПараметрыОценки.Свойство("ТочностьДисконтированногоПотока",	ТочностьДисконтированногоПотока);
	КонецЕсли;
	
	#КонецОбласти
	
	БудущиеПотоки = ДенежныйПоток.Скопировать(, "Дата, Поток");
	
	БудущиеПотоки.Колонки.Добавить("КоличествоДней",		Новый ОписаниеТипов("Число"));
	БудущиеПотоки.Колонки.Добавить("ДисконтированныйПоток",	Новый ОписаниеТипов("Число"));
	
	Для Каждого Поток Из БудущиеПотоки Цикл
		
		Поток.КоличествоДней = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Поток.Дата, ДатаПереоценки);
		
		ДисконтированныйПоток = Поток.Поток / Pow(1 + СтавкаДисконтирования / 100, Поток.КоличествоДней / 365);
		
		Поток.ДисконтированныйПоток = ?(ТочностьДисконтированногоПотока = Неопределено, ДисконтированныйПоток, Окр(ДисконтированныйПоток, ТочностьДисконтированногоПотока));  
		
	КонецЦикла;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, , "Дисконтирование денежных потоков", БудущиеПотоки);
	КонецЕсли;
	
	Возврат БудущиеПотоки.Итог("ДисконтированныйПоток");
	
КонецФункции

// Возвращает дисконтированную стоимость денежных потоков, рассчитанную по формуле:
//                  CF(i) * k
// СС = Σ ————————————————————————————— 
//                         t(i) - t(0)
//                         ——————————— 
//        (1 + r(i) + Δ) ^      T
//			
// CF(i)    – будущие денежные потоки по долговой ценной бумаге
// k		- коэффициент (k) корректировки потока (например, в результате оценки ожидаемых потерь в случае дефолта)
// r(i)     – доходность кривой бескупонной доходности (G-кривая), соответствующая дате выплаты i-го денежного потока
// Δ        - отклонение от КБД (например, CrSpread – медианное значение кредитного спреда облигационного индекса)
// t(i)     – дата i-го платежа
// t(0)		– дата оценки
// T		– количество календарных дней в году, к которому относится платеж
//
// Параметры:
//	ДенежныйПоток					- ТаблицаЗначений			- денежные потоки
//	ДатаПереоценки					- Дата 						- 
//	ОтклонениеСтавки				- Число						- отклонение (Δ) от доходности кривой бескупонной доходности  
//	КоэффициентКорректировкиПотока	- Число						- коэффициент (k) корректировки потока  
//	ПараметрыОценки					- Структура, Неопределено	- ключи ТочностьКБД, ТочностьСтавкиДисконтирования, ТочностьДисконтированногоПотока 
//	Отказ							- Булево					- 
//	РасшифровкаРасчета				- Структура, Неопределено 	- 
//
// Возвращаемое значение:
//	Стоимость - Число - рассчитанная стоимость или 0 при ошибке (Отказ = Истина)
//
Функция РассчитатьДисконтированнуюСтоимостьПоЗначениямКривойБескупоннойДоходности(ДенежныйПоток, ДатаПереоценки, ОтклонениеСтавки = 0, КоэффициентКорректировкиПотока = 1, ПараметрыОценки = Неопределено, Отказ = Ложь, РасшифровкаРасчета = Неопределено) Экспорт
	
	#Область Проверка_и_обработка_входящих_параметров
	
	Если ТипЗнч(ДенежныйПоток) <> Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Некорректное значение параметра денежный поток '%1'", ТипЗнч(ДенежныйПоток)), , , , Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	ТочностьКБД						= Неопределено;
	ТочностьСтавкиДисконтирования	= Неопределено;
	ТочностьДисконтированногоПотока	= Неопределено;
	ТочностьСрокаДоДатыПотока		= Неопределено;
	
	Если ТипЗнч(ПараметрыОценки) = Тип("Структура") Тогда
		ПараметрыОценки.Свойство("ТочностьКБД",						ТочностьКБД);
		ПараметрыОценки.Свойство("ТочностьСтавкиДисконтирования",	ТочностьСтавкиДисконтирования);
		ПараметрыОценки.Свойство("ТочностьДисконтированногоПотока",	ТочностьДисконтированногоПотока);
		ПараметрыОценки.Свойство("ТочностьСрокаДоДатыПотока",		ТочностьСрокаДоДатыПотока);
	КонецЕсли;
	
	#КонецОбласти
	
	БудущиеПотоки = ДенежныйПоток.Скопировать(, "Дата, Поток");

	Если КоэффициентКорректировкиПотока <> 1 Тогда
		БудущиеПотоки.Колонки.Добавить("СкорректированныйПоток", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	БудущиеПотоки.Колонки.Добавить("КоличествоДней",		Новый ОписаниеТипов("Число"));
	БудущиеПотоки.Колонки.Добавить("КоличествоЛет",			Новый ОписаниеТипов("Число"));
	БудущиеПотоки.Колонки.Добавить("СтавкаКБД",				Новый ОписаниеТипов("Число"));
	БудущиеПотоки.Колонки.Добавить("СтавкаДисконтирования",	Новый ОписаниеТипов("Число"));
	БудущиеПотоки.Колонки.Добавить("ДисконтированныйПоток",	Новый ОписаниеТипов("Число"));
	
	Для Каждого Поток Из БудущиеПотоки Цикл
		
		Если КоэффициентКорректировкиПотока <> 1 Тогда
			Поток.СкорректированныйПоток = Поток.Поток * КоэффициентКорректировкиПотока;
		КонецЕсли;
		
		Поток.КоличествоДней = ОбщегоНазначенияКлиентСервер.РазностьДатВДнях(Поток.Дата, ДатаПереоценки);
		Поток.КоличествоЛет	 = Поток.КоличествоДней / 365;
		
		Если ТочностьСрокаДоДатыПотока <> Неопределено Тогда
			Поток.КоличествоЛет	 = Окр(Поток.КоличествоЛет, ТочностьСрокаДоДатыПотока);
		КонецЕсли;
		
		ЗначениеКБД = РаботаСПоказателямиФинансовыхИнструментов.РассчитатьЗначениеКривойБескупоннойДоходности(ДатаПереоценки, Поток.КоличествоЛет, , Отказ);
		
		Если Отказ = Истина Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Поток.СтавкаКБД = ?(ТочностьКБД = Неопределено, ЗначениеКБД, Окр(ЗначениеКБД, ТочностьКБД)) / 100;
		
		СтавкаДисконтирования = Поток.СтавкаКБД + ОтклонениеСтавки;
		
		Поток.СтавкаДисконтирования = ?(ТочностьСтавкиДисконтирования = Неопределено, СтавкаДисконтирования, Окр(СтавкаДисконтирования, ТочностьСтавкиДисконтирования + 2));
		
		СуммаПотока = ?(КоэффициентКорректировкиПотока <> 1, Поток.СкорректированныйПоток, Поток.Поток); 
		
		ДисконтированныйПоток = СуммаПотока / Pow(1 + Поток.СтавкаДисконтирования, Поток.КоличествоДней / 365);
		
		Поток.ДисконтированныйПоток = ?(ТочностьДисконтированногоПотока = Неопределено, ДисконтированныйПоток, Окр(ДисконтированныйПоток, ТочностьДисконтированногоПотока));  
		
	КонецЦикла;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РаботаСДокументами.ДобавитьРасшифровкуОперации(РасшифровкаРасчета, , "Дисконтирование денежных потоков по ставке КБД в точке, соответствующей дате потока", БудущиеПотоки);
	КонецЕсли;
	
	Возврат БудущиеПотоки.Итог("ДисконтированныйПоток");
				
КонецФункции

#КонецОбласти
