
Функция ПолучитьТекстЗапросаДляКонтроляКоличестваРегистраторов() Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Регистратор КАК Регистратор,
		|	НаборЗаписей.ВидДвижения КАК ВидДвижения,
		|	НАЧАЛОПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодНачало,
		|	КОНЕЦПЕРИОДА(НаборЗаписей.Период, ДЕНЬ) КАК ПериодКонец,
		|	НаборЗаписей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.Резерв КАК Резерв
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|ГДЕ
		|	НаборЗаписей.Резерв В (ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеДепозитарияАудитораОценщика), ЗНАЧЕНИЕ(Справочник.Резервы.ВознаграждениеУправляющего), ЗНАЧЕНИЕ(Справочник.Резервы.ПрочиеВозмещаемыеРасходыУправляющего))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РезервыПИФ.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.РезервыПИФ КАК РезервыПИФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО (РезервыПИФ.Период МЕЖДУ _НаборЗаписей.ПериодНачало И _НаборЗаписей.ПериодКонец)
		|			И РезервыПИФ.Организация = _НаборЗаписей.Организация
		|			И РезервыПИФ.СчетДоверительногоУправления = _НаборЗаписей.СчетДоверительногоУправления
		|			И РезервыПИФ.Резерв = _НаборЗаписей.Резерв
		|			И РезервыПИФ.ВидДвижения = _НаборЗаписей.ВидДвижения
		|ГДЕ
		|	РезервыПИФ.Активность
		|	И РезервыПИФ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И РезервыПИФ.Регистратор <> _НаборЗаписей.Регистратор";
	
	Возврат ТекстЗапроса

КонецФункции

