Процедура ЗарегистрироватьИнвестиционныйПрофиль(РеквизитыПрофиля) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИнвестиционныеПрофили.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Регистратор.Установить(РеквизитыПрофиля.Ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период						= НачалоДня(РеквизитыПрофиля.Дата);
	НоваяЗапись.Организация					= РеквизитыПрофиля.Организация;
	НоваяЗапись.СубъектУчета				= РеквизитыПрофиля.СубъектУчета;
	НоваяЗапись.Цель						= РеквизитыПрофиля.ИнвестиционнаяЦель;
	НоваяЗапись.ВариантГоризонта			= РеквизитыПрофиля.ВариантИнвестиционногоГоризонта;
	НоваяЗапись.НачалоПериодаГоризонта		= РеквизитыПрофиля.НачалоПериодаИнвестиционногоГоризонта;
	НоваяЗапись.ОкончаниеПериодаГоризонта	= РеквизитыПрофиля.ОкончаниеПериодаИнвестиционногоГоризонта;
	НоваяЗапись.ОтносительныйСрокГоризонта	= РеквизитыПрофиля.ОтносительныйСрокИнвестиционногоГоризонта;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // ЗарегистрироватьИнвестиционныйПрофиль

Процедура КонтрольПовышенияДопустимогоРискаПоСтандартнымСтратегиям(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестирования.Ссылка КАК Стратегия,
		|	ИнвестиционныеПрофили.Период КАК Период,
		|	ИнвестиционныеПрофили.Цель.ДопустимыйРискВПроцентах КАК ДопустимыйРиск
		|ПОМЕСТИТЬ _ДопустимыйРискСтратегийСПериодами
		|ИЗ
		|	Справочник.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеПрофили КАК ИнвестиционныеПрофили
		|		ПО СтратегииИндивидуальногоИнвестирования.Ссылка = ИнвестиционныеПрофили.СубъектУчета
		|ГДЕ
		|	СтратегииИндивидуальногоИнвестирования.Стандартная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДопустимыйРискСтратегийСПериодами.Стратегия КАК Стратегия,
		|	_ДопустимыйРискСтратегийСПериодами.Период КАК Период,
		|	_ДопустимыйРискСтратегийСПериодамиДо.ДопустимыйРиск КАК ПредыдущийДопустимыйРиск,
		|	_ДопустимыйРискСтратегийСПериодами.ДопустимыйРиск КАК ДопустимыйРиск
		|ИЗ
		|	_ДопустимыйРискСтратегийСПериодами КАК _ДопустимыйРискСтратегийСПериодами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДопустимыйРискСтратегийСПериодами КАК _ДопустимыйРискСтратегийСПериодамиДо
		|		ПО _ДопустимыйРискСтратегийСПериодами.Стратегия = _ДопустимыйРискСтратегийСПериодамиДо.Стратегия
		|			И _ДопустимыйРискСтратегийСПериодами.Период > _ДопустимыйРискСтратегийСПериодамиДо.Период
		|			И _ДопустимыйРискСтратегийСПериодами.ДопустимыйРиск > _ДопустимыйРискСтратегийСПериодамиДо.ДопустимыйРиск";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = СтрШаблон(
			"По стратегии '%1' обнаружено повышение допустимого риска с %2. Предыдущий уровень риска %3, новое значение %4",
			Выборка.Стратегия,
			Формат(Выборка.Период, "ДФ=dd.MM.yyyy"),
			Выборка.ПредыдущийДопустимыйРиск,
			Выборка.ДопустимыйРиск);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
