
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Если эта форма объекта, то открытие в том же окне. параметр Ключ есть только у объектов
	Если ПараметрыВыполненияКоманды.Источник.Параметры.Свойство("Ключ") Тогда
		Окно = ПараметрыВыполненияКоманды.Источник.Окно;
	Иначе
		Окно = Неопределено;
	КонецЕсли;
	
	ОткрытьФорму(
		"Отчет.ДвиженияДокумента.Форма",
		Новый Структура("Документ", ПараметрКоманды),
		ПараметрыВыполненияКоманды.Источник, 
		Истина, 
		Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

