
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		
		Отчет.Период = НачалоДня(ТекущаяДатаСеанса());
		Отчет.Организация = ПараметрыСеанса.ТекущаяОрганизация;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗачислениеПаев", Отчет.ЗачислениеПаев) Тогда
		
		РеквизитыЗачисленияПаев = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.ЗачислениеПаев, "ПаевойИнвестиционныйФонд, ПоступлениеДенежныхСредств, Организация");
		ДатаПоступленияДС 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЗачисленияПаев.ПоступлениеДенежныхСредств, "Дата"); 
		Отчет.ПаевойИнвестиционныйФонд = РеквизитыЗачисленияПаев.ПаевойИнвестиционныйФонд;
		Отчет.Период = НачалоДня(ДатаПоступленияДС);
		Отчет.Организация = РеквизитыЗачисленияПаев.Организация;
		СкомпоноватьРезультат();
		
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Отчет.Период, Отчет.Организация.ЮрФизЛицо)));
	
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ЗачислениеПаевПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.ЗачислениеПаев) Тогда
		
		РеквизитыЗачисленияПаев = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.ЗачислениеПаев, "ПаевойИнвестиционныйФонд, ПоступлениеДенежныхСредств");
		ДатаПоступленияДС 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЗачисленияПаев.ПоступлениеДенежныхСредств, "Дата"); 
		
		Отчет.ПаевойИнвестиционныйФонд = РеквизитыЗачисленияПаев.ПаевойИнвестиционныйФонд;
		Отчет.Период = НачалоДня(ДатаПоступленияДС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

