
////////////////////////////////////////////////////////////////////////////////
// МОДИФИКАЦИЯ ЭЛЕМЕНТОВ ОТБОРА ДИНАМИЧЕСКОГО СПИСКА

// Изменяет найденные элементы отбора по ключу, или создает новый, если таковые не были найдены
//
// Параметры
//   Контейнер - контейнер с элементами и группами отбора, например "Список.Отбор" или группа в отборе
//   Ключ      - поле компоновки данных, имя поля компоновки или структура, содержащая свойства элемента компоновки (не используется для групп)
// Устанавливаемые поля:
//   Представление    - строка (используется вместо ключа, если он не задан)
//   ВидСравнения     - ВидСравненияКомпоновкиДанных
//   ПравоеЗначение   - произвольный
//   Использование    - булево
//   РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных
//
Процедура УстановитьЭлементОтбора(Контейнер, Ключ, Представление = Неопределено, ВидСравнения = Неопределено, ПравоеЗначение = Неопределено, Использование = Неопределено, РежимОтображения = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(Контейнер, Ключ, Представление, ВидСравнения, ПравоеЗначение, Использование, РежимОтображения);
	
	Если ЧислоИзмененных = 0 Тогда
		ИмяПоля = Ключ;
		Если ТипЗнч(Ключ) = Тип("Структура") Тогда
			Ключ.Свойство("ИмяПоля", ИмяПоля);
		КонецЕсли;
		
		ДобавитьЭлементОтбора(Контейнер, ИмяПоля, Представление, ВидСравнения, ПравоеЗначение, Использование, РежимОтображения);
	КонецЕсли;
	
КонецПроцедуры // УстановитьЭлементОтбора

// Добавление элемента компоновки в контейнер элементов компоновки
//
// Параметры:
//   Контейнер        - контейнер с элементами и группами отбора, например "Список.Отбор" или группа в отборе
//   ИмяПоля          - строка, имя для поля компоновки данных
//   ВидСравнения     - ВидСравненияКомпоновкиДанных
//   ПравоеЗначение   - произвольный
//   Представление    - строка, представление элемента компоновки данных
//   Использование    - булево
//   РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения
//
Функция ДобавитьЭлементОтбора(Контейнер, ИмяПоля, Представление  = Неопределено, ВидСравнения = Неопределено, ПравоеЗначение = Неопределено, Использование = Неопределено, РежимОтображения = Неопределено) Экспорт
	
	Элемент = Контейнер.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Элемент.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	Элемент.ПравоеЗначение   = ПравоеЗначение;
	Элемент.Представление    = Представление;
	Элемент.Использование    = ?(Использование = Неопределено, Истина, Использование);
	Элемент.РежимОтображения = ?(РежимОтображения = Неопределено, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто, РежимОтображения);
	
	Возврат Элемент;
	
КонецФункции // ДобавитьЭлементОтбора

// Изменяет найденные группы элементов отбора по ключу, или создает новую, если таковые не были найдены
//
// Параметры:
//   Контейнер     - отбор, элементы отбора или группами отбора, например "Список.Отбор", "Список.Отбор.Элементы"
//   ТипГруппы     - ТипГруппыЭлементовОтбораКомпоновкиДанных
//   Представление - строка, представление группы
//
Функция УстановитьГруппуЭлементовОтбора(Знач Контейнер, Ключ = Неопределено, Представление, ТипГруппы, Использование = Истина, Применение = Неопределено, РежимОтображения = Неопределено) Экспорт
	
	ТипГруппаЭлементовОтбораКомпоновкиДанных = Тип("ГруппаЭлементовОтбораКомпоновкиДанных");
	
	Если ТипЗнч(Контейнер) = ТипГруппаЭлементовОтбораКомпоновкиДанных Или ТипЗнч(Контейнер) = Тип("ОтборКомпоновкиДанных") Тогда
		Контейнер = Контейнер.Элементы;
	КонецЕсли;
	
	ГруппыЭлементовОтбора = НайтиЭлементыИГруппыОтбора(Контейнер, Ключ, Представление);
	
	// удалим элементы, не являющиеся группами
	Для Инд = 1 - ГруппыЭлементовОтбора.Количество По 0 Цикл
		Если ТипЗнч(ГруппыЭлементовОтбора[-Инд]) <> ТипГруппаЭлементовОтбораКомпоновкиДанных Тогда
			ГруппыЭлементовОтбора.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	Если ГруппыЭлементовОтбора.Количество() = 0 Тогда
		ГруппыЭлементовОтбора.Добавить(
			Контейнер.Добавить(ТипГруппаЭлементовОтбораКомпоновкиДанных));
	КонецЕсли;
	
	Для каждого ГруппаЭлементовОтбора Из ГруппыЭлементовОтбора Цикл
		ГруппаЭлементовОтбора.Представление    = Представление;
		ГруппаЭлементовОтбора.ТипГруппы        = ТипГруппы;
		ГруппаЭлементовОтбора.Использование    = Использование;
		ГруппаЭлементовОтбора.Применение       = ?(Применение = Неопределено, ТипПримененияОтбораКомпоновкиДанных.Элементы, Применение);
		ГруппаЭлементовОтбора.РежимОтображения = ?(РежимОтображения = Неопределено, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто, РежимОтображения);
	КонецЦикла;
	
	Возврат ГруппыЭлементовОтбора;
	
КонецФункции // УстановитьГруппуЭлементовОтбора

Процедура УстановитьЭлементОтбораСписка(Форма, ИмяСписка, ИмяПоля) Экспорт

	КлючЭлементаОтбора = Новый Структура("ИмяПоля, Представление", ИмяПоля, "БыстрыйОтбор" + ИмяПоля);
	ПолеНеРедактируется = Форма.Элементы["БыстрыйОтбор" + ИмяСписка + ИмяПоля].ТолькоПросмотр;	
	ЗначениеПоля        = Форма[ИмяПоля];
		
	Если ПолеНеРедактируется Тогда // отбираем даже по пустому значению
		РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма[ИмяСписка].Отбор, КлючЭлементаОтбора, "БыстрыйОтбор" + ИмяПоля,
			ВидСравненияКомпоновкиДанных.Равно, ЗначениеПоля, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	Иначе
		Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
			// установим отбор
			РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма[ИмяСписка].Отбор, КлючЭлементаОтбора, "БыстрыйОтбор" + ИмяПоля,
				ВидСравненияКомпоновкиДанных.Равно, ЗначениеПоля, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
		Иначе
			// отключим отбор
			РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Форма[ИмяСписка].Отбор, КлючЭлементаОтбора, "БыстрыйОтбор" + ИмяПоля,
				ВидСравненияКомпоновкиДанных.Равно, ЗначениеПоля, Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка

Процедура УстановитьБыстрыеОтборы(Форма, ИмяСписка, ПоляБыстрогоОтбора, ОтсутствующиеВСпискеПоля = "", УстанавливатьТолькоПросмотр = Ложь) Экспорт
	
	ПараметрыФормы = Форма.Параметры;
	Элементы = Форма.Элементы;
	МассивПоляБыстрогоОтбора = СтрРазделить(ПоляБыстрогоОтбора, ",");
	МассивОтсутствующихПолей = СтрРазделить(ОтсутствующиеВСпискеПоля, ",");
	
	Для Каждого ПолеБыстрогоОтбора Из МассивПоляБыстрогоОтбора Цикл
				
		Если ПараметрыФормы.Свойство(ПолеБыстрогоОтбора) Тогда
			
			Форма[ПолеБыстрогоОтбора] = ПараметрыФормы[ПолеБыстрогоОтбора];
			Если УстанавливатьТолькоПросмотр Тогда
				Элементы["БыстрыйОтбор" + ИмяСписка + ПолеБыстрогоОтбора].ТолькоПросмотр = Истина;
			КонецЕсли;
			
			Если МассивОтсутствующихПолей.Найти(ПолеБыстрогоОтбора) = Неопределено Тогда																
				// если не пользоваться отборами, то при создании записи регистра поля будут не заполнены
				УстановитьЭлементОтбораСписка(Форма, ИмяСписка, ПолеБыстрогоОтбора);							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
				
КонецПроцедуры  

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

// Поиск элементов и групп отбора динамического списка по ключу или представлению, если ключ не задан
//
// Параметры:
//   Контейнер     - контейнер с элементами и группами отбора, например "Список.Отбор" или группа в отборе
//   Ключ          - поле компоновки данных, имя поля компоновки или структура, содержащая свойства элемента компоновки (не используется для групп)
//   Представление - строка поиска (используется вместо ключа, если он не задан)
//
Функция НайтиЭлементыИГруппыОтбора(Контейнер, Знач Ключ = Неопределено, Представление = Неопределено) Экспорт
	
	МассивЭлементов = Новый Массив;
	
	НайтиЭлементыИГруппыОтбораРекурсивно(Контейнер.Элементы, МассивЭлементов, ?(ЗначениеЗаполнено(Ключ), Ключ, Представление), Не ЗначениеЗаполнено(Ключ));
	
	Возврат МассивЭлементов;
	
КонецФункции // НайтиЭлементыИГруппыОтбора

// Изменение элементов отбора, соответствующих ключу или представлению, если ключ не задан
//
// Параметры:
//   Контейнер        - контейнер с элементами и группами отбора, например "Список.Отбор" или группа в отборе
//   Ключ             - поле компоновки данных, имя поля компоновки или структура, содержащая свойства элемента компоновки (не используется для групп)
// Устанавливаемые значения (если заданы):
//   Представление    - представление поля компоновки (также используется вместо ключа, если он не задан)
//   ПравоеЗначение   - произвольный
//   ВидСравнения     - ВидСравненияКомпоновкиДанных
//   Использование    - булево
//   РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных
//
Функция ИзменитьЭлементыОтбора(Контейнер, Ключ, Представление = Неопределено, ВидСравнения = Неопределено, ПравоеЗначение = Неопределено, Использование = Неопределено, РежимОтображения = Неопределено)
	
	МассивЭлементов = НайтиЭлементыИГруппыОтбора(Контейнер, Ключ, Представление);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции // ИзменитьЭлементыОтбора

Функция ЭлементОтбораСоответствуетКлючу(ЭлементОтбора, Ключ)
	
	ПолноеСоответствие = Неопределено;
	
	Если ТипЗнч(Ключ) = Тип("Структура") Тогда
		ПолноеСоответствие = Истина;
		
		// последовательно и поименно проверим соответствие свойств элемента отбора и переданных свойств ключа
		Для каждого ЭлементКлюча Из Ключ Цикл
			Если      ВРег(ЭлементКлюча.Ключ) = ВРег("ЛевоеЗначение") Тогда
				ПолноеСоответствие = (ЭлементОтбора.ЛевоеЗначение = ЭлементКлюча.Значение);
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("ИмяПоля") Тогда
				ПолноеСоответствие = (ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементКлюча.Значение));
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("ВидСравнения") Тогда
				ПолноеСоответствие = (ЭлементОтбора.ВидСравнения = ЭлементКлюча.Значение);
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("ПравоеЗначение") Тогда
				ПолноеСоответствие = (ЭлементОтбора.ПравоеЗначение = ЭлементКлюча.Значение);
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("Использование") Тогда
				ПолноеСоответствие = (ЭлементОтбора.Использование = ЭлементКлюча.Значение);
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("РежимОтображения") Тогда
				ПолноеСоответствие = (ЭлементОтбора.РежимОтображения = ЭлементКлюча.Значение);
			ИначеЕсли ВРег(ЭлементКлюча.Ключ) = ВРег("Представление") Тогда
				ПолноеСоответствие = (ЭлементОтбора.Представление = ЭлементКлюча.Значение);
			КонецЕсли;
				
			Если Не ПолноеСоответствие Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ПолноеСоответствие = (ЭлементОтбора.ЛевоеЗначение = ?(ТипЗнч(Ключ) = Тип("Строка"), Новый ПолеКомпоновкиДанных(Ключ), Ключ));
			
	КонецЕсли;

	Возврат ПолноеСоответствие;
	
КонецФункции // ЭлементОтбораСоответствуетКлючу

Процедура НайтиЭлементыИГруппыОтбораРекурсивно(Контейнер, МассивЭлементов, Ключ, ИскатьПоПредставлению)
	
	Для каждого ЭлементОтбора Из Контейнер Цикл
		Если ИскатьПоПредставлению И ЭлементОтбора.Представление = Ключ Тогда
			МассивЭлементов.Добавить(ЭлементОтбора);
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Не ИскатьПоПредставлению Тогда
				Если ЭлементОтбораСоответствуетКлючу(ЭлементОтбора, Ключ) Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			НайтиЭлементыИГруппыОтбораРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, Ключ, ИскатьПоПредставлению);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // НайтиЭлементыИГруппыОтбораРекурсивно
