
&НаСервере
Процедура РасчитатьНаСервере()
	
	ЭтаФорма.Доходность = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ЭтаФорма.ДенежныйПоток.Выгрузить(), ЭтаФорма.Дата, ЭтаФорма.Цена, ЭтаФорма.Точность).Доходность;
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Расчитать");
	Попытка
		ВыполнитьРасчет(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчет(ПараметрыСессии)
	
	Если ЭтаФорма.Дата = '00010101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата");
		ПараметрыСессии.ТекстОшибки = "Не указана дата";
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Цена = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Цена не может быть нолевой");
		ПараметрыСессии.ТекстОшибки = "Цена не может быть нолевой";
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДенежныйПоток Из ЭтаФорма.ДенежныйПоток Цикл
	
		Если СтрокаДенежныйПоток.Дата = '00010101' Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата потока");
			ПараметрыСессии.ТекстОшибки = "Не указана дата потока";
			Возврат;
		КонецЕсли;	
		
		Если СтрокаДенежныйПоток.Поток = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма потока не может быть нолевой");
			ПараметрыСессии.ТекстОшибки = "Сумма потока не может быть нолевой";
			Возврат;
		КонецЕсли;	
		
	КонецЦикла;
	
	РасчитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Точность = 0.0000000001;
	
КонецПроцедуры

&НаКлиенте
Функция РасчетИзДокументаРегистрации() Экспорт
	
	РасчитатьНаСервере();
	ЭтаФорма.Открыть();
	
КонецФункции 

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
