#Область Служебные_Процедуры_и_Функции

&НаСервереБезКонтекста
Функция ПолучитьСписокАктивныхСчетовДоверительногоУправления(Организация, Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РаспоряжениеНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления
	|ИЗ
	|	Документ.Распоряжение КАК РаспоряжениеНаМНО
	|ГДЕ
	|	РаспоряжениеНаМНО.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|	И РаспоряжениеНаМНО.Организация = &Организация
	|	И РаспоряжениеНаМНО.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами))
	|	И РаспоряжениеНаМНО.СчетДоверительногоУправления.СпециализированныйДепозитарий = &ОСД
	|	И РаспоряжениеНаМНО.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
	|	И РаспоряжениеНаМНО.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("ОСД", 		 ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ОСД"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
	
КонецФункции

#КонецОбласти