
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		ЭтаФорма.Сервер = "АП55";
		Элементы.ГруппаРежимОтладки.Видимость = Ложь;
	Иначе
		ЭтаФорма.Сервер = "АП91";
	КонецЕсли; 
	
	Объект.ДатаВыгрузки = ТекущаяДатаСеанса();
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.ГруппаПолныеПрава.Видимость = ЭтоПолноправныйПользователь;
	Элементы.ГруппаОбычныйПользователь.Видимость = Не ЭтоПолноправныйПользователь;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаВыгрузитьПредварительныеЦены(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Сервер) Тогда
		Ошибки = Новый Структура;
		ВыгрузитьПредварительныеЦеныНаСервере(Ошибки);
		Для каждого КЗ Из Ошибки Цикл
			Если ТипЗнч(КЗ.Значение) = Тип("ТабличныйДокумент") Тогда
				КЗ.Значение.Показать(КЗ.Ключ);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьЦеныОценки(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Сервер) И ДокументыДляВыгрузки.Количество() > 0 Тогда
		ВыгрузитьЦеныОценкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗначениеИзХранилища(Команда)
	
	УИД = "";
	Если ВвестиСтроку(УИД, "Введите УИД записи в хранилище значений", 36) Тогда
	
		Результат = КомандаОткрытьЗначениеИзХранилищаНаСервере(УИД);
		Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
			Результат.ТолькоПросмотр = Истина;
			Результат.ОтображатьСетку = Ложь;
			Результат.Показать("Результат расчета предварительных цен");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить результат по переданному УИДу"); 
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ВыгрузитьПредварительныеЦеныНаСервере(Ошибки)

	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ВыгрузитьПредварительныеЦены(ЭтаФорма.Сервер, Не ЭтаФорма.НеОтправлятьОповещения, Истина, Ошибки);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЦеныОценкиНаСервере()

	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	ОбработкаНаСервере.ВыгрузитьЦеныОценкиПоСписку(ЭтаФорма.Сервер, ДокументыДляВыгрузки.ВыгрузитьЗначения(), Не ЭтаФорма.НеОтправлятьОповещения);
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандаОткрытьЗначениеИзХранилищаНаСервере(УИД)

	Запись = РегистрыСведений.ХранилищеЗначений.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Новый УникальныйИдентификатор(УИД);
	Запись.Прочитать();
	
	Результат = Запись.ХранилищеЗначения.Получить();
	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, Результат, , , , Истина);    
		РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
		
		Возврат ПараметрыВывода.ДокументРезультат;	
		
	КонецЕсли; 

КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
 
#КонецОбласти