&НаСервере
Процедура ВыгрузитьОперацииНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.УстановитьПериодИВыполнитьКоманду("ИнтерактивныйВызов");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	
	Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ЭтаФорма.Элементы.Расхождения.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаРасхожденияРЭМ;
	ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ЭтаФорма.Элементы.Расхождения.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаРасхожденияТраст;
	ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") Тогда
		ЭтаФорма.Элементы.Расхождения.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаРасхожденияМДТ;
	ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		ЭтаФорма.Элементы.Расхождения.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаРасхожденияРПИ;
	КонецЕсли;

	ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокРЭМ"];	
	ТаблДок.Очистить();
	ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокТраст"];
	ТаблДок.Очистить();
	ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокРПИ"];
	ТаблДок.Очистить();
	ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокМДТ"];
	ТаблДок.Очистить();
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ДанныеДляСверки = ОбъектНаСервере.СформироватьДанныеДляСверки();
	
	Если ДанныеДляСверки <> Неопределено И ДанныеДляСверки.Количество() > 0 Тогда
		Макет = ОбъектНаСервере.ПолучитьМакет("СверкаКоличестваОпераций");
		Пока ДанныеДляСверки.Следующий() Цикл
			Макет = ОбъектНаСервере.ПолучитьМакет("СверкаКоличестваОпераций");
				
			Если СтрНайти(ДанныеДляСверки.НаименованиеУК, "ЭсМ") Тогда
				ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокРЭМ"];
			ИначеЕсли СтрНайти(ДанныеДляСверки.НаименованиеУК, "РЕГИОН Траст") Тогда
				ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокТраст"];
			ИначеЕсли СтрНайти(ДанныеДляСверки.НаименованиеУК, "ПИ") Тогда
				ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокРПИ"];
			ИначеЕсли СтрНайти(ДанныеДляСверки.НаименованиеУК, "МД ТРАСТ") Тогда
				ТаблДок = ЭтаФорма["РасхождениеКоличестваСделокМДТ"];
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("ШапкаОтчета");
			Область.Параметры["Период"] = "Отчет за период с " + Формат(Объект.Период.ДатаНачала, "ДЛФ=Д") + " по " + Формат(Объект.Период.ДатаОкончания, "ДЛФ=Д");
			ТаблДок.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТаблДок.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ВыборкаДетальныеЗаписи = ДанныеДляСверки.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Количество_1С = ВыборкаДетальныеЗаписи.Количество_SQL Тогда
					Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
				Иначе
					Область = Макет.ПолучитьОбласть("СтрокаРасхождений");
				КонецЕсли;
				
				Область.Параметры["ДатаСверки"] = Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=Д");
				Область.Параметры["Кол_1С"]     = ВыборкаДетальныеЗаписи.Количество_1С;
				Область.Параметры["Кол_SQL"]    = ВыборкаДетальныеЗаписи.Количество_SQL;
				
				ТаблДок.Вывести(Область);
			КонецЦикла;
			
			ТаблДок.ТолькоПросмотр      = Истина;
			ТаблДок.ОтображатьСетку     = Ложь;
			ТаблДок.ОтображатьЗаголовки = Ложь;
		КонецЦикла;
		Сообщить("Отчет сформирован!");
	Иначе
		Сообщить("В заданном периоде (" + Формат(Объект.Период.ДатаНачала, "ДЛФ=Д") + " - " + Формат(Объект.Период.ДатаОкончания, "ДЛФ=Д") + ") отсутствуют операции.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	Объект.Организация    = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период.Вариант = ВариантСтандартногоПериода.Вчера;
	
	НастроитьВидимостьЭлементовФормы();
		
КонецПроцедуры //ПриСозданииНаСервере

&НаСервере
Функция ЭтоРПИ()
	
	Возврат (Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ"));
	
КонецФункции //ЭтоРПИ

&НаКлиенте
Процедура ВыгрузитьОперации(Команда)
	
	ВыгрузитьОперацииНаСервере();
	
КонецПроцедуры //ВыгрузитьОперации

&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
		ВыполнитьПроверкуНаСервере();
		
КонецПроцедуры //ВыполнитьПроверку

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
		
	НастроитьВидимостьЭлементовФормы();

КонецПроцедуры //ОрганизацияПриИзменении

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры //ПриЗагрузкеДанныхИзНастроекНаСервере

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы()
	
	ОрганизацияРПИ = ЭтоРПИ();
	
	ЭтаФорма.Элементы.СтраницаРасхожденияРПИ.Видимость   = ОрганизацияРПИ;

	ЭтаФорма.Элементы.СтраницаРасхожденияРЭМ.Видимость   = Не ОрганизацияРПИ; 
	ЭтаФорма.Элементы.СтраницаРасхожденияТраст.Видимость = Не ОрганизацияРПИ;
	ЭтаФорма.Элементы.СтраницаРасхожденияМДТ.Видимость   = Не ОрганизацияРПИ;
	
КонецПроцедуры //НастроитьВидимостьЭлементовФормы
