&НаКлиенте
Процедура УстановитьВидимостьИДоступность()

	ЭтаФорма.Элементы.Время.Видимость = ЭтаФорма.УточнитьВремя И НЕ ЭтаФорма.Незавершенные;
	ЭтаФорма.Элементы.Время.Доступность = ЭтаФорма.УточнитьВремя И НЕ ЭтаФорма.Незавершенные;
	
	ЭтаФорма.Элементы.УточнитьВремя.Видимость = НЕ ЭтаФорма.Незавершенные;
	ЭтаФорма.Элементы.УточнитьВремя.Доступность = НЕ ЭтаФорма.Незавершенные;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Дата = ТекущаяДата();
	ЭтаФорма.Время = '00010101000000';
	ЭтаФорма.УточнитьВремя = Ложь;
	ЭтаФорма.Незавершенные = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПосмотретьНаСервере()
	
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	
	Механизм = "ВнешнийОтчет._КтоИПоКомуФормируетУчет.Форма.ПосмотретьНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОтчетНаСервере,, Новый Структура("Дата,Организация,СчетДоверительногоУправления", ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.СчетДоверительногоУправления));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Макет = ОтчетНаСервере.ПолучитьМакет("Макет");
	
	Результат.Очистить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Результат.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияНачало КАК ПериодВыполненияНачало,
		|	СтатистикаРаботыВнутреннихМеханизмов.Ответственный КАК Ответственный,
		|	СтатистикаРаботыВнутреннихМеханизмов.ПараметрыВыполнения КАК ПараметрыВыполнения,
		|	СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияОкончание КАК ПериодВыполненияОкончание,
		|	СтатистикаРаботыВнутреннихМеханизмов.СессияЗавершенаСОшибкой КАК СессияЗавершенаСОшибкой
		|ИЗ
		|	РегистрСведений.СтатистикаРаботыВнутреннихМеханизмов КАК СтатистикаРаботыВнутреннихМеханизмов
		|ГДЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.Механизм = &ИскомыйМеханизм
		|	И (СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ НЕ &Незавершенные)
		|	И СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияНачало >= &Дата
		|	И СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияНачало <= &КонецДня
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВыполненияНачало";
	
	Запрос.УстановитьПараметр("Дата", ЭтаФорма.Дата);
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ЭтаФорма.Дата));
	Запрос.УстановитьПараметр("Незавершенные", ЭтаФорма.Незавершенные);
	Запрос.УстановитьПараметр("ИскомыйМеханизм", "Обработки.ФормированиеБухгалтерскогоУчета.ОбработатьСчетаДУФоново");
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыФормирования = ВыборкаДетальныеЗаписи.ПараметрыВыполнения.Получить();
		
		Если ТипЗнч(ПараметрыФормирования) = Тип("Структура") Тогда // по новому
		
			ПараметрыФормированияСтруктура = ПараметрыФормирования;
			
			ПараметрыФормирования = Новый Массив;
			ПараметрыФормирования.Добавить(ПараметрыФормированияСтруктура);
		
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ЭтаФорма.Организация)
			И ЭтаФорма.Организация <> ПараметрыФормирования[0].Организация Тогда
			Продолжить;
		КонецЕсли;
		
		Если УточнитьВремя Тогда
			
			Если ВыборкаДетальныеЗаписи.ПериодВыполненияНачало > ЭтаФорма.Дата + (ЭтаФорма.Время - НачалоДня(ЭтаФорма.Время)) Тогда // началось позже
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ПериодВыполненияОкончание < ЭтаФорма.Дата + (ЭтаФорма.Время - НачалоДня(ЭтаФорма.Время))	// окончилось раньше
				И ВыборкаДетальныеЗаписи.ПериодВыполненияОкончание <> ДАТА(1,1,1) Тогда												// точно окончилось
			
				Продолжить;
			
			КонецЕсли;
		
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СессияЗавершенаСОшибкой Тогда
			ОбластьСтрока.Параметры.Завершено = "Ручная отмена";
		ИначеЕсли ВыборкаДетальныеЗаписи.ПериодВыполненияОкончание = ДАТА(1,1,1) Тогда
			ОбластьСтрока.Параметры.Завершено = "Нет";
		Иначе	
			ОбластьСтрока.Параметры.Завершено = ВыборкаДетальныеЗаписи.ПериодВыполненияОкончание;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Организация = ПараметрыФормирования[0].Организация;
		ОбластьСтрока.Параметры.ПериодСтр = ПредставлениеПериода(ПараметрыФормирования[0].НачалоПериода, ПараметрыФормирования[0].КонецПериода);
		ОбластьСтрока.Параметры.НачалоФормирования = ВыборкаДетальныеЗаписи.ПериодВыполненияНачало;
		ОбластьСтрока.Параметры.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
		
		Если ПараметрыФормирования[0].Свойство("ВидыУчета") Тогда // по-старому
		
			ВидыУчета = "";
			Для каждого ВидУчета Из ПараметрыФормирования[0].ВидыУчета Цикл
				Если ВидУчета.Пометка Тогда
					ВидыУчета = ВидыУчета + Строка(ВидУчета) + ";";
				КонецЕсли;	
			КонецЦикла;
			ОбластьСтрока.Параметры.ВидыУчета = Лев(ВидыУчета, СтрДлина(ВидыУчета) - 1);
			
		Иначе // по-новому
			
			ОбластьСтрока.Параметры.ВидыУчета = ПараметрыФормирования[0].ВидУчета;
		КонецЕсли;
		
		Если ПараметрыФормирования[0].Свойство("МассивСчетовДУ") Тогда // по-старому
		
			Для каждого СчетДУ Из ПараметрыФормирования[0].МассивСчетовДУ Цикл
				
				Если ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления)
					И ЭтаФорма.СчетДоверительногоУправления <> СчетДУ Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьСтрока.Параметры.СчетДоверительногоУправления = СчетДУ;
				Результат.Вывести(ОбластьСтрока);
			
			КонецЦикла;
			
		Иначе // по новому
			
			Если ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления)
				И ЭтаФорма.СчетДоверительногоУправления <> ПараметрыФормирования[0].СчетДоверительногоУправления Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.СчетДоверительногоУправления = ПараметрыФормирования[0].СчетДоверительногоУправления;
			Результат.Вывести(ОбластьСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаКлиенте
Процедура Посмотреть(Команда)
	ПосмотретьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УточнитьВремяПриИзменении(Элемент)
	ЭтаФорма.Время = '00010101000000';
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НезавершенныеПриИзменении(Элемент)
	ЭтаФорма.Время = '00010101000000';
	ЭтаФорма.УточнитьВремя = Ложь;
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
