Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводПрочихАктивовИмущество.Ссылка.Дата КАК Период,
		|	ВводПрочихАктивовИмущество.Ссылка.Организация КАК Организация,
		|	ВводПрочихАктивовИмущество.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводПрочихАктивовИмущество.Ссылка.Основание КАК Основание,
		|	ВводПрочихАктивовИмущество.Ссылка.Основание.Пайщик КАК Пайщик,
		|	ВводПрочихАктивовИмущество.Ссылка.ВидИмущества КАК ВидИмущества,
		|	ВводПрочихАктивовИмущество.Имущество КАК Имущество,
		|	ВводПрочихАктивовИмущество.Количество КАК Количество,
		|	ВводПрочихАктивовИмущество.Сумма КАК Сумма
		|ИЗ
		|	Документ.ВводПрочихАктивов.Имущество КАК ВводПрочихАктивовИмущество
		|ГДЕ
		|	ВводПрочихАктивовИмущество.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ПрочееИмуществоПереданноеВОплатуПаев.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
		Движение = Движения.ЗадолженностиПоПрочимАктивам.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	Движения.ПрочееИмуществоПереданноеВОплатуПаев.Записать();
	Движения.ЗадолженностиПоПрочимАктивам.Записать();
	
	//Проверка 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗадолженностиПоПрочимАктивамОстатки.Имущество.Представление КАК ИмуществоПредставление,
		|	ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток = 0
		|		И ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток <> 0 КАК СтоимостьНеСовпала,
		|	ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток < 0 КАК ПринялиБольше
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоПрочимАктивам.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание = &Основание) КАК ЗадолженностиПоПрочимАктивамОстатки
		|ГДЕ
		|	(ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток = 0
		|				И ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток <> 0
		|			ИЛИ ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток < 0)";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.СтоимостьНеСовпала Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Стоимость принятого имущества """ + ВыборкаДетальныеЗаписи.ИмуществоПредставление 
				+ """ не совпадает со стоимостью в заявке пайщика. Разница составила "+ ВыборкаДетальныеЗаписи.СуммаОстаток, ЭтотОбъект,,, Отказ);
		ИначеЕсли ВыборкаДетальныеЗаписи.ПринялиБольше Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество принятого имущества """ + ВыборкаДетальныеЗаписи.ИмуществоПредставление 
				+ """ превышает количество, указанное в заявке пайщика. Разница составила "+ ВыборкаДетальныеЗаписи.КоличествоОстаток, ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.Имущество.Представление КАК ИмуществоПредставление,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПрочееИмуществоПереданноеВОплатуПаев.Остатки(
		|			&ПослеПроведения,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидИмущества = &ВидИмущества
		|				И Имущество В
		|					(ВЫБРАТЬ
		|						ВводПрочихАктивовИмущество.Имущество КАК Имущество
		|					ИЗ
		|						Документ.ВводПрочихАктивов.Имущество КАК ВводПрочихАктивовИмущество
		|					ГДЕ
		|						ВводПрочихАктивовИмущество.Ссылка = &Ссылка)) КАК ПрочееИмуществоПереданноеВОплатуПаевОстатки
		|ГДЕ
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток > 1";
	
	Запрос.УстановитьПараметр("ВидИмущества", Перечисления.ВидыАктивов.Недвижимость);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПослеПроведения", Новый Граница(ЭтотОбъект.МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Попытка принять объект имущества """ 
			+ ВыборкаДетальныеЗаписи.ИмуществоПредставление + """ несколько раз провалилась!", ЭтотОбъект, ,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ЭтотОбъект.ВидИмущества = Перечисления.ВидыАктивов.Недвижимость;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоДокументу.НомерСтроки КАК НомерСтроки,
			|	_ПоДокументу.Имущество КАК Имущество,
			|	_ПоДокументу.Количество КАК Количество,
			|	_ПоДокументу.Сумма КАК Сумма,
			|	_ПоДокументу.СуммаБезНДС КАК СуммаБезНДС
			|ПОМЕСТИТЬ _ПоДокументу
			|ИЗ
			|	&_ПоДокументу КАК _ПоДокументу
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоДокументу.Имущество КАК Имущество,
			|	_ПоДокументу.Сумма КАК Сумма,
			|	_ПоДокументу.СуммаБезНДС КАК СуммаБезНДС,
			|	_ПоДокументу.Количество КАК Количество,
			|	ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток КАК СуммаЗаявкиПайщика,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость КАК Стоимость,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
			|	_ПоДокументу.НомерСтроки КАК НомерСтроки,
			|	_ПоДокументу.Количество > 1
			|		И &ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость) КАК НекорректноеКоличество,
			|	_ПоДокументу.Сумма = 0 КАК НеУказанаСтоимость,
			|	_ПоДокументу.СуммаБезНДС <> ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0) КАК СтоимостьНеСоответствуетОтчетуОценщика,
			|	_ПоДокументу.Сумма <> ЕСТЬNULL(ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток, 0) КАК СтоимостьНеСоответствуетЗаявкеПайщика,
			|	ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость ЕСТЬ NULL КАК НеНайденаОценочнаяСтоимость
			|ИЗ
			|	_ПоДокументу КАК _ПоДокументу
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидАктива = &ВидАктива
			|					И СубъектАналитики В
			|						(ВЫБРАТЬ
			|							_ПоДокументу.Имущество КАК Имущество
			|						ИЗ
			|							_ПоДокументу КАК _ПоДокументу)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
			|		ПО _ПоДокументу.Имущество = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
			|			И (ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия >= &Период)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоПрочимАктивам.Остатки(
			|				&ГраницаДоДокумента,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И Основание = &Основание) КАК ЗадолженностиПоПрочимАктивамОстатки
			|		ПО _ПоДокументу.Имущество = ЗадолженностиПоПрочимАктивамОстатки.Имущество
			|ГДЕ
			|	(_ПоДокументу.Сумма = 0
			|			ИЛИ _ПоДокументу.Сумма <> ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0)
			|			ИЛИ _ПоДокументу.Количество <> 1
			|				И &ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость))";
		
		Запрос.УстановитьПараметр("ВидАктива", ЭтотОбъект.ВидИмущества);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("ГраницаДоДокумента", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("_ПоДокументу", ЭтотОбъект.Имущество.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НекорректноеКоличество Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " указано некорректное количество", ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.номерСтроки - 1) + "].Количество",,Отказ);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.НеУказанаСтоимость Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не указана стоимость имущества", ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.номерСтроки - 1) + "].Сумма",,Отказ);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.НеНайденаОценочнаяСтоимость Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для имущества, указанного в строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не найдена оценочная стоимость ", ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.номерСтроки - 1) + "].Имущество",,Отказ);
			ИначеЕсли ВыборкаДетальныеЗаписи.СтоимостьНеСоответствуетОтчетуОценщика Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " указана стоимость " + Формат(ВыборкаДетальныеЗаписи.СуммаБезНДС,"ЧДЦ=2; ЧРГ=' '; ЧН=0") + ", не соответствующая отчету оценщика " + Формат(ВыборкаДетальныеЗаписи.Стоимость,"ЧДЦ=2; ЧРГ=' '; ЧН=0"), ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.номерСтроки - 1) + "].Сумма",,Отказ);
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.СтоимостьНеСоответствуетЗаявкеПайщика Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " указана стоимость " + Формат(ВыборкаДетальныеЗаписи.Сумма,"ЧДЦ=2; ЧРГ=' '; ЧН=0") + ", не соответствующая заявке пайщика " + Формат(ВыборкаДетальныеЗаписи.СуммаЗаявкиПайщика,"ЧДЦ=2; ЧРГ=' '; ЧН=0"), ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.номерСтроки - 1) + "].Сумма",,Отказ);
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти