
Функция ПолучитьСтатусФНС(ИННДоверителя, НомерДоверенности) Экспорт

	Прокси = РаботаСФайловымХранилищем.ПолучитьПроксиВебСервисаФайловогоХранилища(, "dmmchd");
	Возврат Прокси.GetStatusFNS(ИННДоверителя, НомерДоверенности);

КонецФункции

// Читает XDTO-объект МЧД из двоичных данных.
// 
// Параметры:
//  ДанныеМЧД - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Структура:
// * ТекстОшибки - Строка
// * ОбъектМЧД - Неопределено
//             - ОбъектXDTO
Функция ОбъектXDTOМЧД(ДанныеМЧД) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ОбъектМЧД", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
		
	Попытка
		
		РезультатЧтения = ДанныеXMLМЧД(ДанныеМЧД);
		Если НЕ РезультатЧтения.Успех Тогда
			Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		
		Результат.ОбъектМЧД = РезультатЧтения.ДанныеДоверенности;
		
	Исключение
		
		ВидОперации = НСтр("ru = 'Загрузка машиночитаемой доверенности из файла.'");
		ТекстОшибки = НСтр("ru = 'Ошибка при чтении файла доверенности: файл не соответствует формату ФНС.'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки);
		Результат.ТекстОшибки = ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// возвращает результат чтения данных xml файла МЧД.
//
// Параметры:
//  ДанныеXML - ДвоичныеДанные - Двоичные данные xml файла машиночитаемой доверенности.
//
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ДанныеДоверенности - ОбъектXDTO, Неопределено - в случае неудачного чтения данных - Неопределено
//  * ТекстОшибки - Строка
//
Функция ДанныеXMLМЧД(Знач ДанныеXML)
	
	Результат = Новый Структура("Успех, ДанныеДоверенности, ТекстОшибки", Ложь, Неопределено, "");
	
	ИмяТипа = "Файл";
	ПространствоИмен = "";
	ВидОперации = НСтр("ru = 'Чтение данных машиночитаемой доверенности.'");
	
	Попытка
		
		ПространствоИмен = ВерсияФорматаФайлаМЧД(ДанныеXML);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = ОбработатьОшибку(ВидОперации, ТекстОшибки, ТекстОшибки);
		Результат.ТекстОшибки = ТекстОшибки;
		Возврат Результат;
		
	КонецПопытки;
	
	Если ПространствоИмен = ПилотныйФорматМЧД()
		Или ПространствоИмен = ФорматМЧД_2022()
		Или ПространствоИмен = ФорматМЧД_2022_Версия_002()
		Или ПространствоИмен = ФорматМЧД_003() Тогда
			ИмяТипа = "Доверенность";
	ИначеЕсли ПространствоИмен = ФорматМЧД_b2g() Тогда
		ТекстОшибки = ТекстОшибкиЗагрузкиДоверенности_B2G();
		Результат.ТекстОшибки = ТекстОшибки;
		Возврат Результат;
	Иначе
		ТекстОшибки = ТекстОшибкиЗагрузкиДоверенностиДругогоФормата();
		Результат.ТекстОшибки = ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Кодировка = КодировкаИзОбъявленияXML(ДанныеXML); // для поддержки устаревших версий МЧД
	Если ПустаяСтрока(Кодировка) Тогда
		Кодировка = "windows-1251";
	КонецЕсли;
	Данные = ДобавитьПространствоИмен(ДанныеXML, ПространствоИмен, Кодировка);
	Объект = ОбъектXDTOИзДанныхXML(Данные, ПространствоИмен, ИмяТипа, Кодировка);
	Результат.ДанныеДоверенности = Объект;
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// Определяет пространство имен файла МЧД по его содержимому.
// 
// Параметры:
//  ДвоичныеДанныеМЧД - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияФорматаФайлаМЧД(ДвоичныеДанныеМЧД)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДвоичныеДанныеМЧД.ОткрытьПотокДляЧтения());
	ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	Возврат ВерсияФорматаОбъектаМЧД(ДанныеXDTO);
	
КонецФункции      

// Определяет пространство имен XDTO объекта МЧД по его содержимому.
// 
// Параметры:
//  ДанныеXDTO - ОбъектXDTO
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияФорматаОбъектаМЧД(ДанныеXDTO) Экспорт
	
	ЭтоФормализованныеДоверенностиB2B = ДанныеXDTO.Свойства().Получить("ИдФайл") <> Неопределено
		И ЭтоПространствоИменМЧД(ДанныеXDTO.ИдФайл);
	
	ЭтоДоверенностиB2B = ЗначениеСвойстваXDTO(ДанныеXDTO, "Документ.СвДов") <> Неопределено
		И ЗначениеСвойстваXDTO(ДанныеXDTO, "Документ.СвПолн") <> Неопределено;
	
	Если ЗначениеСвойстваXDTO(ДанныеXDTO, "ВерсФорм") = "EMCHD_1"
		И ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат ФорматМЧД_003();
	КонецЕсли;
	
	Если ЗначениеСвойстваXDTO(ДанныеXDTO, "ВерсФорм") = "002"
		И ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат ФорматМЧД_2022_Версия_002();
	КонецЕсли;
	
	Если ЭтоДоверенностиB2B Тогда
		Возврат ФорматМЧД_2022();
	КонецЕсли;
	
	Если ЭтоФормализованныеДоверенностиB2B Тогда
		Возврат ПилотныйФорматМЧД();
	ИначеЕсли ДанныеXDTO.Свойства().Получить("ИдФайл") <> Неопределено
		И СтрНайти(ДанныеXDTO.ИдФайл, ПространствоИмен_МЧД_b2g()) > 0 Тогда
		Возврат ФорматМЧД_b2g();
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции 

#Область XDTO

// Возвращает значение свойства XDTO.
// 
// Параметры:
// 	ОбъектXDTO - ОбъектXDTO
// 	ИмяСвойства - Строка
// 	ЗначениеПоУмолчанию - Произвольный - значение, которое будет возвращено, в случае отсутствия значения
// 	Тип - Строка - тип, к которому будет приведено возвращаемое значение
// 	ЭтоСписок - Булево
// 	НеопределеноПоУмолчанию - Булево - не приводить к значению по умолчанию типа, указанного в параметре Тип.
// 	                          В случае отсутствия значения, будет возвращено Неопределено.
// Возвращаемое значение:
// 	Произвольный
Функция ЗначениеСвойстваXDTO(ОбъектXDTO, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено, Тип = Неопределено,
	ЭтоСписок = Ложь, НеопределеноПоУмолчанию = Ложь) Экспорт
	
	Значение = ЗначениеСвойстваXDTOСлужебный(ОбъектXDTO, ИмяСвойства);
	
	Если Тип <> Неопределено Тогда
		
		Если Значение <> Неопределено Тогда
			Если Тип = "Число" Тогда
				Значение = Число(Значение);
			ИначеЕсли Тип = "Дата" Тогда
				Значение = ДатаИзСтроки(Значение);
			ИначеЕсли Тип = "Время" Тогда
				Значение = ВремяИзСтроки(Значение);
			ИначеЕсли Тип = "XMLДата" Тогда
				Значение = XMLЗначение(Тип("Дата"),Значение);
			ИначеЕсли Тип = "Булево" Тогда
				Значение = Булево(Значение);
			КонецЕсли;
			
		ИначеЕсли НеопределеноПоУмолчанию Тогда
			Значение = Неопределено;
		ИначеЕсли Тип = "Число" Тогда
			Значение = 0;
		ИначеЕсли Тип = "Дата" Тогда
			Значение = '00010101';
		ИначеЕсли Тип = "XMLДата" Тогда
			Значение = '00010101';
		ИначеЕсли Тип = "Булево" Тогда
			Значение = Ложь;
		ИначеЕсли Тип = "Строка" Тогда
			Значение = "";
		КонецЕсли;
		
	ИначеЕсли ЭтоСписок И ТипЗнч(Значение) <> Тип("СписокXDTO") И Значение <> Неопределено Тогда
		
		// При чтении xml файла фабрикой XDTO без указания типа, если в СпискеXDTO только 1 строка,
		// то список конвертируется в ОбъектXDTO. Вернем его в массиве, чтобы
		// всегда обходить в цикле, вне зависимости от количества строк.
		
		Коллекция = Новый Массив;
		Коллекция.Добавить(Значение);
		
		Значение = Коллекция;
		
	КонецЕсли;
	
	Если Значение = Неопределено И ЗначениеПоУмолчанию <> Неопределено Тогда
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Возвращает значение свойства XDTO
//
// Параметры:
//  ОбъектXDTO - ОбъектXDTO - объект, значение свойства которого нужно получить
//  Путь - Строка - путь к свойству, разделителем является символ ".".
// 
// Возвращаемое значение:
//  Неопределено - данное свойство отсутствует;
//  Строка - значение свойства;
//  ОбъектXDTO - объект XDTO.
//
Функция ЗначениеСвойстваXDTOСлужебный(ОбъектXDTO, Путь)
	
	Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСтрок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Путь, ".");
	
	Если ОбъектXDTO.Свойства().Получить(МассивСтрок[0]) = Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 1 Тогда
		Значение = ОбъектXDTO[МассивСтрок[0]];
		Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Значение;
	Иначе
		НаборСвойств = ОбъектXDTO.Свойства();
		Свойство = НаборСвойств.Получить(МассивСтрок[0]);
		Если Свойство = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Свойство.ВерхняяГраница = 1 Тогда
			ПодОбъектXDTO = ОбъектXDTO.ПолучитьXDTO(Свойство);
		Иначе
			Список = ОбъектXDTO.ПолучитьСписок(Свойство);
			Если Список.Количество() = 0 Тогда
				Возврат Неопределено;
			Иначе
				ПодОбъектXDTO = Список[0];
			КонецЕсли;
		КонецЕсли;
		МассивСтрок.Удалить(0);
		НоваяСтрока = "";
		Для Каждого Элемент Из МассивСтрок Цикл
			НоваяСтрока = НоваяСтрока + ?(ПустаяСтрока(НоваяСтрока), "", ".") + Элемент;
		КонецЦикла;
		Возврат ЗначениеСвойстваXDTO(ПодОбъектXDTO, НоваяСтрока);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Преобразует строковое представление времени в форматах HH.mm.ss в дату.
//
// Параметры:
//  ВремяСтрокой - Строка - представление времени.
//  Разделитель - Строка - разделитель часов, минут, секунд.
// Возвращаемое значение:
//  Дата - преобразованное значение.
//
Функция ВремяИзСтроки(Знач ВремяСтрокой, Знач Разделитель = ".")
	
	ЧастьДаты = "00010101";
	ЧастьВремени = СтрЗаменить(СокрЛП(ВремяСтрокой), Разделитель, "");
	
	Возврат Дата(ЧастьДаты + ЧастьВремени);
	
КонецФункции

// Преобразует строковое представление даты в форматах DD.MM.YYYY, YYYY-MM-DD в дату.
//
// Параметры:
//  Строка	 - Строка - представление даты.
// Возвращаемое значение:
//  Дата - преобразованное значение.
//
Функция ДатаИзСтроки(Строка)
	
	Если ТипЗнч(Строка) = Тип("Дата") Тогда
		Возврат Строка;
	КонецЕсли;
	
	ЧастьДаты    = "";
	ЧастьВремени = "000000";
	Если Не РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(Сред(Строка, 3, 1)) Тогда
		ЧастьДаты = Сред(Строка, 7, 4) + Сред(Строка, 4, 2) + Сред(Строка, 1, 2);
		// заполним дополнительно время для формата "dd.MM.yyyy HH.mm.ss".
		Если СтрДлина(Строка) = 19 Тогда
			ЧастьВремени = РаботаСоСтрокамиКлиентСервер.ЗаменитьОдниСимволыДругими(".:", Сред(Строка, 12), "");
		КонецЕсли;
	Иначе
		ЧастьДаты = Сред(Строка, 1, 4) + Сред(Строка, 6, 2) + Сред(Строка, 9, 2);
		// заполним дополнительно время для формата 20 символов.
		Если СтрДлина(Строка) = 20 Тогда
			ЧастьВремени = РаботаСоСтрокамиКлиентСервер.ЗаменитьОдниСимволыДругими(".:", Сред(Строка, 12), "");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Дата(ЧастьДаты + ЧастьВремени);
	
КонецФункции

#Область Форматы_МЧД

// Возвращает идентификатор пространства имен МЧД b2g
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_b2g()
	Возврат "ON_DOVEL";
КонецФункции

Функция ТекстОшибкиЗагрузкиДоверенности_B2G()
	Возврат НСтр("ru = 'Загружаемая доверенность, предназначена для передачи в адрес налоговых органов.
						|Такая доверенность не может быть использована при обмене с контрагентами.
						|Выберите для загрузки доверенность подходящего назначения.'");
КонецФункции

Функция ТекстОшибкиЗагрузкиДоверенностиДругогоФормата()
	Возврат НСтр("ru = 'Формат загружаемой доверенности не поддерживается в текущей версии программы.
						|Обновитесь до актуальной версии и повторите загрузку.'");
КонецФункции

// Возвращает идентификатор пространства имен пилотного формата МЧД.
// 
// Возвращаемое значение:
//  Строка
Функция ПилотныйФорматМЧД() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_01";
КонецФункции

// Возвращает идентификатор пространства имен утвержденного в 2022г. формата МЧД.
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_2022() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_01_01";
КонецФункции

// Возвращает идентификатор пространства имен утвержденного в 2022г., формата МЧД версии 002
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_2022_Версия_002() Экспорт
	Возврат "ON_DOVBB_1_928_00_01_02_01";
КонецФункции

// Возвращает идентификатор пространства имен универсального формата МЧД версии 003
// 
// Возвращаемое значение:
//  Строка
Функция ФорматМЧД_003() Экспорт
	Возврат "urn://x-artefacts/EMCHD_1";
КонецФункции

#КонецОбласти

#Область ПространствоИмен

// Проверяет пространство имен на принадлежность к МЧД
// 
// Параметры:
//  ПространствоИмен - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоПространствоИменМЧД(ПространствоИмен)
	Возврат СтрНачинаетсяС(ПространствоИмен, ПространствоИмен_МЧД())
			Или СтрНачинаетсяС(ПространствоИмен, ПространствоИмен_МЧД_003());
КонецФункции

// Возвращает подстроку, характерную для пространства имен МЧД b2b.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД()
	
	Возврат "ON_DOVBB";
	
КонецФункции

// Возвращает подстроку, характерную для пространства имен МЧД b2g.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД_b2g()
	
	Возврат "ON_DOVEL";
	
КонецФункции

// Возвращает подстроку, характерную для пространства имен МЧД b2b версии 003.
// 
// Возвращаемое значение:
//  Строка
Функция ПространствоИмен_МЧД_003()
	
	Возврат "ON_EMCHD";
	
КонецФункции

#КонецОбласти

#Область ОбщегоНазначенияБЭД

// Возвращает кодировку, полученную из двоичных данных файла, если
// файл содержит объявление XML.
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные- двоичные данные файла.
//
// Возвращаемое значение:
//  Строка - кодировка файла. Если невозможно прочитать 
//                          объявление XML, возвращает пустую строку.
//
Функция КодировкаИзОбъявленияXML(ДвоичныеДанные)
	
	БуферДвоичныхДанных = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанных);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокВПамяти);
	Попытка
		ЧтениеXML.ПерейтиКСодержимому();
		КодировкаXML = ЧтениеXML.КодировкаXML;
	Исключение
		КодировкаXML = "";
	КонецПопытки;
	ЧтениеXML.Закрыть();
	ПотокВПамяти.Закрыть();
	
	Возврат КодировкаXML;
	
КонецФункции  

// Добавляет в XML пространство имен.
//  Примечание. Не следует использовать объектную модель ПостроительDOM, из-за возникновения ошибки чтения сверхбольших
//  файлов.
//
// Параметры:
//  ДанныеXML - ДвоичныеДанные
//            - Поток
//            - ПотокВПамяти
//            - ФайловыйПоток
//  ПространствоИмен - Строка - Пространство имен, которое необходимо добавить.
//  Кодировка - Строка - Кодировка данных XML.
//
// Возвращаемое значение:
//  ДвоичныеДанные - Двоичные данные XML с добавленным пространством имен.
//
Функция ДобавитьПространствоИмен(Знач ДанныеXML, Знач ПространствоИмен, Знач Кодировка = "windows-1251")
	
	Если ТипЗнч(ДанныеXML) = Тип("ДвоичныеДанные") Тогда
		ПотокЧтения = ДанныеXML.ОткрытьПотокДляЧтения();
	Иначе
		ПотокЧтения = ДанныеXML;
		ПотокЧтения.Перейти(0, ПозицияВПотоке.Начало);
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокЧтения, , , Кодировка);
	
	ПотокЗаписи = Новый ПотокВПамяти();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьПоток(ПотокЗаписи, Кодировка);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ПространствоИменУстановлено = Ложь;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		ЗаписьXML.ЗаписатьТекущий(ЧтениеXML);
		Если Не ПространствоИменУстановлено И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			МассивУстановленныхПространствИмен = ЗаписьXML.КонтекстПространствИмен.URIПространствИмен();
			Если МассивУстановленныхПространствИмен.Найти(ПространствоИмен) = Неопределено Тогда
				ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", ПространствоИмен);
			КонецЕсли;
			ПространствоИменУстановлено = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьXML.Закрыть();
	ЧтениеXML.Закрыть();
	ПотокЧтения.Закрыть();
	
	ДвоичныеДанные = ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Формирует XDTO-объект по двоичным данным XML.
//
// Параметры:
//  ДанныеXML - ДвоичныеДанные - Данные XML.
//  ПространствоИмен - Строка - Пространство имен.
//  ИмяТипа - Строка - Имя типа элемента данных XDTO.
//  Кодировка - Строка - Кодировка данных XML.
//
// Возвращаемое значение:
//  ОбъектXDTO - XDTO-объект.
//
Функция ОбъектXDTOИзДанныхXML(Знач ДанныеXML, Знач ПространствоИмен, Знач ИмяТипа, Знач Кодировка = "windows-1251")
	
	ПотокЧтения = ДанныеXML.ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ПотокЧтения, , , Кодировка);
	
	ТипЗначения = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипЗначения);
	
	Возврат ОбъектXDTO;
	
КонецФункции

#КонецОбласти

Функция ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстОшибки)

	Возврат СтрШаблон("%1%2%3%2%4", ВидОперации, Символы.ПС, ТекстОшибки, ПодробныйТекстОшибки);

КонецФункции

// Возвращает строковое представление неограниченных полномочий.
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеНеограниченныхПолномочий()
	Возврат НСтр("ru = 'Все полномочия'");
КонецФункции

// Проверяет текст на наличие полных полномочий.
// 
// Параметры:
//  ТекстПолномочий - Строка - Текст полномочий
// 
// Возвращаемое значение:
//  Булево
//  
Функция ЭтоТекстПолныхПолномочий(ТекстПолномочий)
	
	ТекстыПолныхПолномочий = Новый Массив;
	ТекстыПолныхПолномочий.Добавить(ПредставлениеНеограниченныхПолномочий());
	ТекстыПолныхПолномочий.Добавить(НСтр("ru = 'Полные полномочия'"));
	
	Возврат ТекстыПолныхПолномочий.Найти(СокрЛП(ТекстПолномочий)) <> Неопределено;
	
КонецФункции

Функция ПолучитьПредставлениеФИО(СтрокаФИО) Экспорт

	Представление = "";

	Если ЗначениеЗаполнено(СтрокаФИО.Фамилия) Тогда
		Представление = СтрокаФИО.Фамилия;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаФИО.Имя) Тогда
		Представление = Представление + " " + СтрокаФИО.Имя;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаФИО.Отчество) Тогда
		Представление = Представление + " " + СтрокаФИО.Отчество;
	КонецЕсли;

	Возврат Представление;

КонецФункции

#Область Загрузка_МЧД003

#Область ЗначенияПеречислений

// Типы полномочий.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * Текстовые - Строка
//    * Машиночитаемые - Строка
Функция ТипыПолномочий()
	
	Возврат Новый ФиксированнаяСтруктура("Текстовые, Машиночитаемые", "0", "1");
	
КонецФункции

// Типы представителей.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ЮридическоеЛицо - Строка
//    * ИндивидуальныйПредприниматель - Строка
//    * ФизическоеЛицо - Строка
//    * ФилиалЮридическогоЛица - Строка
//    * ФилиалИностраннойОрганизации - Строка
Функция ТипыПредставителей() Экспорт
	
	ТипыПредставителей = Новый Структура;
	ТипыПредставителей.Вставить("ЮридическоеЛицо", "1");
	ТипыПредставителей.Вставить("ИндивидуальныйПредприниматель", "2");
	ТипыПредставителей.Вставить("ФизическоеЛицо", "3");
	ТипыПредставителей.Вставить("ФилиалЮридическогоЛица", "4");
	ТипыПредставителей.Вставить("ФилиалИностраннойОрганизации", "5");
	
	Возврат Новый ФиксированнаяСтруктура(ТипыПредставителей);
	
КонецФункции

// Типы доверителей.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ЮридическоеЛицо - Строка
//    * ИностраннаяОрганизация - Строка
//    * ИндивидуальныйПредприниматель - Строка
//    * ФизическоеЛицо - Строка
Функция ТипыДоверителей() Экспорт
	
	ТипыДоверителей = Новый Структура;
	ТипыДоверителей.Вставить("ЮридическоеЛицо", "1");
	ТипыДоверителей.Вставить("ИностраннаяОрганизация", "2");
	ТипыДоверителей.Вставить("ИндивидуальныйПредприниматель", "3");
	ТипыДоверителей.Вставить("ФизическоеЛицо", "4");
	
	Возврат Новый ФиксированнаяСтруктура(ТипыДоверителей);
	
КонецФункции

#КонецОбласти

// Формирует новые данные участника (доверителя или представителя).
// 
// Возвращаемое значение:
//  Структура - Новые данные участника: 
// * ТипУчастника - Строка
// * ИНН - Строка
// * КПП - Строка
// * ОГРН - Строка
// * СНИЛС - Строка - в формате 999-999-999 99
Функция НовыеДанныеУчастника()
	
	Результат = Новый Структура();
	Результат.Вставить("ТипУчастника", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("СНИЛС", "");
	Возврат Результат;
	
КонецФункции

// Формирует новые данные машиночитаемого полномочия.
// 
// Возвращаемое значение:
//  Структура - Новые данные участника:
// * Мнемоника    - Строка
// * Код          - Строка
// * Наименование - Строка
Функция НовыеДанныеМашиночитаемогоПолномочия()
	
	Результат = Новый Структура();
	
	Результат.Вставить("Мнемоника",    "");
	Результат.Вставить("Код",          "");
	Результат.Вставить("Наименование", "");

	Возврат Результат;
	
КонецФункции

Функция ПолучитьУчастника_ЮридическоеЛицо(ДанныеXDTO)
	
	Участник = НовыеДанныеУчастника();
	Участник.ИНН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ИННЮЛ", "");
	Участник.КПП = ЗначениеСвойстваXDTO(ДанныеXDTO, "КПП", "");
	Участник.ОГРН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ОГРН", "");
	Возврат Участник;
	
КонецФункции

Функция ПолучитьУчастника_ИндивидуальныйПредприниматель(ДанныеXDTO)
	
	Участник = НовыеДанныеУчастника();
	Участник.ИНН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ИННФЛ", "");
	Участник.ОГРН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ОГРНИП", "");
	Участник.СНИЛС = ЗначениеСвойстваXDTO(ДанныеXDTO, "СНИЛС", "");
	Возврат Участник;
	
КонецФункции

Функция ПолучитьУчастника_ФизическоеЛицо(ДанныеXDTO)
	
	Участник = НовыеДанныеУчастника();
	Участник.ИНН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ИННФЛ", "");
	Участник.СНИЛС = ЗначениеСвойстваXDTO(ДанныеXDTO, "СНИЛС", "");
	Возврат Участник;
	
КонецФункции

Функция ПолучитьУчастника_ФилиалЮридическогоЛица(ДанныеXDTO)
	
	Возврат ПолучитьУчастника_ЮридическоеЛицо(ДанныеXDTO);
	
КонецФункции

Функция ПолучитьУчастника_ИностраннаяОрганизация(ДанныеXDTO)
	
	Участник = НовыеДанныеУчастника();
	Участник.ИНН = ЗначениеСвойстваXDTO(ДанныеXDTO, "ИННЮЛ", "");
	Участник.КПП = ЗначениеСвойстваXDTO(ДанныеXDTO, "КПП", "");
	Возврат Участник;
	
КонецФункции

Функция ПолучитьУчастника_ФилиалИностраннойОрганизации(ДанныеXDTO)
	
	Возврат ПолучитьУчастника_ИностраннаяОрганизация(ДанныеXDTO);
	
КонецФункции

// Заполняет представителей.
// 
// Параметры:
//  МассивУчастников - Массив из см. НовыеДанныеУчастника
//  ОбъектМЧД - ОбъектXDTO
Процедура ЗаполнитьПредставителей(МассивУчастников, ОбъектМЧД)
	
	ТипыПредставителей = ТипыПредставителей();
	
	ПредставителиXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Довер.СвУпПред", , , Истина, Неопределено);
	Если ПредставителиXDTO = Неопределено Тогда
	    ПредставителиXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПолучПолн", , , Истина, Неопределено);
	КонецЕсли;
	
	Для Каждого ПредставительXDTO Из ПредставителиXDTO Цикл
		
		Участник = Неопределено;
		ТипУчастника = ПредставительXDTO.ТипПред;
		
		Если ТипУчастника = ТипыПредставителей.ЮридическоеЛицо Тогда
			СведОргXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведОрг");
			Участник = ПолучитьУчастника_ЮридическоеЛицо(СведОргXDTO);
		ИначеЕсли ТипУчастника = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда
			СведИПXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИП");
			Участник = ПолучитьУчастника_ИндивидуальныйПредприниматель(СведИПXDTO);			
		ИначеЕсли ТипУчастника = ТипыПредставителей.ФизическоеЛицо Тогда	
			СведФизЛXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФизЛ");
			Участник = ПолучитьУчастника_ФизическоеЛицо(СведФизЛXDTO);
		ИначеЕсли ТипУчастника = ТипыПредставителей.ФилиалЮридическогоЛица Тогда
			СведФилиалXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФилиал");
			Участник = ПолучитьУчастника_ФилиалЮридическогоЛица(СведФилиалXDTO);
		ИначеЕсли ТипУчастника = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда	
			СведИОXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИО");
			Участник = ПолучитьУчастника_ФилиалИностраннойОрганизации(СведИОXDTO);
		КонецЕсли;	
		
		Если Участник <> Неопределено Тогда
			Участник.ТипУчастника = ТипУчастника;
			МассивУчастников.Добавить(Участник);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет доверителей.
// 
// Параметры:
//  МассивУчастников - Массив из см. НовыеДанныеУчастника
//  ОбъектМЧД - ОбъектXDTO
Процедура ЗаполнитьДоверителей(МассивУчастников, ОбъектМЧД)
	
	ТипыДоверителей = ТипыДоверителей();
	ТипыПредставителей = ТипыПредставителей();
	ДаНет = Новый Структура("Да, Нет", "1", "0"); // Классификатор из формата
	
	СвДоверитXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Довер.СвДоверит", , , Истина, Неопределено); // СписокXDTO Из См. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.СвДоверитТип
	Если СвДоверитXDTO <> Неопределено Тогда
		Для Каждого ДоверительXDTO Из СвДоверитXDTO Цикл	
			
			Участник = Неопределено;
			ТипУчастника = ДоверительXDTO.ТипДоверит;
			
			Если ТипУчастника = ТипыДоверителей.ЮридическоеЛицо Тогда
				СвРосОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.РосОргДовер.СвРосОрг");
				Участник = ПолучитьУчастника_ЮридическоеЛицо(СвРосОргXDTO);
				Если ДоверительXDTO.Доверит.РосОргДовер.ЕИОФЛ = ДаНет.Да Тогда
					ЛицоБезДоверенности = ДоверительXDTO.Доверит.РосОргДовер.ЛицоБезДов.Получить(0); // См. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.ЛицоБезДовТип
					Участник.СНИЛС = Строка(ЛицоБезДоверенности.СвФЛ.СНИЛС);
				КонецЕсли;
			ИначеЕсли ТипУчастника = ТипыДоверителей.ИностраннаяОрганизация Тогда
				СвИнОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИнОргДовер.СвИнОрг");
				Участник = ПолучитьУчастника_ИностраннаяОрганизация(СвИнОргXDTO);
			ИначеЕсли ТипУчастника = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда
				ИПДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИПДовер");
				Участник = ПолучитьУчастника_ИндивидуальныйПредприниматель(ИПДоверXDTO);
			ИначеЕсли ТипУчастника = ТипыДоверителей.ФизическоеЛицо Тогда
				ФЛДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ФЛДовер");
				Участник = ПолучитьУчастника_ФизическоеЛицо(ФЛДоверXDTO);
			КонецЕсли;
			
			Если Участник <> Неопределено Тогда
				Участник.ТипУчастника = ТипУчастника;
				МассивУчастников.Добавить(Участник);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	
	СвПередПолнXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПередПолн", , , Истина, Неопределено);
	Если СвПередПолнXDTO <> Неопределено Тогда
		Для Каждого ДоверительXDTO Из СвПередПолнXDTO Цикл
			
			Участник = Неопределено;
			ТипУчастника = ДоверительXDTO.ТипПерПолн;
			
			Если ТипУчастника = ТипыПредставителей.ЮридическоеЛицо Тогда
				СвРосОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ПередПолн.РосОргПерПолн.СвРосОрг");
				Участник = ПолучитьУчастника_ЮридическоеЛицо(СвРосОргXDTO);
			ИначеЕсли ТипУчастника = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда	
				ИППерПолнXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ПередПолн.ИППерПолн");
				Участник = ПолучитьУчастника_ИндивидуальныйПредприниматель(ИППерПолнXDTO);
			ИначеЕсли ТипУчастника = ТипыПредставителей.ФизическоеЛицо Тогда	
				ФЛПерПолнЛXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ПередПолн.ФЛПерПолн");
				Участник = ПолучитьУчастника_ФизическоеЛицо(ФЛПерПолнЛXDTO);
			ИначеЕсли ТипУчастника = ТипыПредставителей.ФилиалЮридическогоЛица Тогда	
				СвФилXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ПередПолн.ФилПерПолн.СвФил");
				Участник = ПолучитьУчастника_ФилиалЮридическогоЛица(СвФилXDTO);
			ИначеЕсли ТипУчастника = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда	
				СвИнОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ПередПолн.ИнПерПолн.СвИнОрг");
				Участник = ПолучитьУчастника_ФилиалИностраннойОрганизации(СвИнОргXDTO);
			КонецЕсли;	
			
			Если Участник <> Неопределено Тогда
				Участник.ТипУчастника = ТипУчастника;
				МассивУчастников.Добавить(Участник);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Заполняет полномочия и связанные реквизиты.
// 
// Параметры:
//  ДанныеДляЗаполнения - см. НовыеДанныеМЧД
//  ОбъектМЧД           - ОбъектXDTO
Процедура ЗаполнитьДанныеПолномочий(ДанныеДляЗаполнения, ОбъектМЧД)
	
	СведенияОПолномочиях = Неопределено;
	
	СвПолнXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПолн", , , Истина, Неопределено);
	Если СвПолнXDTO <> Неопределено Тогда
		СведенияОПолномочиях = ОбъектМЧД.Документ.Передов.СвПолн; // см. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.СвПолнТип
	КонецЕсли;
	
	СвПолнXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Довер.СвПолн", , , Истина, Неопределено);
	Если СвПолнXDTO <> Неопределено Тогда
		СведенияОПолномочиях = ОбъектМЧД.Документ.Довер.СвПолн; // см. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.СвПолнТип
	КонецЕсли;
	
	Если СведенияОПолномочиях = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось сформировать сведения по полномочиям'");
	КонецЕсли;
	
	ДанныеДляЗаполнения.ПолномочияОграничены = Истина;
	ДанныеДляЗаполнения.СовместныеПолномочия = СведенияОПолномочиях.ПрСовмПолн = "2"; 
	
	Если СведенияОПолномочиях.ТипПолн = ТипыПолномочий().Текстовые Тогда
		
		ДанныеДляЗаполнения.ВариантЗаполненияПолномочий = "Текст";
		ДанныеДляЗаполнения.ТекстовоеПолномочие = ЗначениеСвойстваXDTO(СведенияОПолномочиях,
			"ТекстПолн", "");
		
		ДанныеДляЗаполнения.ПолномочияОграничены =
			НЕ ЭтоТекстПолныхПолномочий(ДанныеДляЗаполнения.ТекстовоеПолномочие);
			
	Иначе
		
		ДанныеДляЗаполнения.ВариантЗаполненияПолномочий = "КлассификаторФНС";
		
		МашиночитаемыеПолномочия = СведенияОПолномочиях.МашПолн;
		Если ТипЗнч(МашиночитаемыеПолномочия) <> Тип("СписокXDTO") Тогда
			МашиночитаемыеПолномочия = РаботаСКоллекциями.ЗначениеВМассив(МашиночитаемыеПолномочия);
		КонецЕсли;
		
		Для Каждого Полномочие Из МашиночитаемыеПолномочия Цикл
		
			ДанныеПолномочия = НовыеДанныеМашиночитаемогоПолномочия();
			ДанныеПолномочия.Мнемоника    = ЗначениеСвойстваXDTO(Полномочие, "МнПолн", "");
			ДанныеПолномочия.Код          = ЗначениеСвойстваXDTO(Полномочие, "КодПолн", "");
			ДанныеПолномочия.Наименование = ЗначениеСвойстваXDTO(Полномочие, "НаимПолн", "");
			
			ДанныеДляЗаполнения.Полномочия.Добавить(ДанныеПолномочия);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Новые данные для загрузки МЧД.
// 
// Возвращаемое значение:
//  Структура - Новые данные для загрузки МЧД:
//  * НомерДоверенности - Строка
//  * НомерРодительскойДоверенности - Строка
//  * ИННДоверителяРодительскойДоверенности - Строка
//  * ДатаВыдачи - Дата
//  * СрокДействия - Дата
//  * ПолномочияОграничены - Булево
//  * СовместныеПолномочия - Булево
//  * Доверители - Массив из см. НовыеДанныеУчастника
//  * Представители - Массив из см. НовыеДанныеУчастника
//  * СтатусВРеестреФНС - ПеречислениеСсылка.СтатусыМашиночитаемойДоверенностиВРеестреФНС
//  * Полномочия - Массив из см. НовыеДанныеМашиночитаемогоПолномочия
//  * ТекстовоеПолномочие - Строка
//  * ВариантЗаполненияПолномочий - Строка
//  * ПередовериеРазрешено - Булево
Функция НовыеДанныеМЧД003()
	
	ДанныеДляЗагрузки = Новый Структура();
	ДанныеДляЗагрузки.Вставить("НомерДоверенности", "");
	ДанныеДляЗагрузки.Вставить("НомерРодительскойДоверенности", "");
	ДанныеДляЗагрузки.Вставить("ИННДоверителяРодительскойДоверенности", "");
	ДанныеДляЗагрузки.Вставить("ДатаВыдачи", '00010101');
	ДанныеДляЗагрузки.Вставить("СрокДействия", '00010101');
	ДанныеДляЗагрузки.Вставить("ПолномочияОграничены", Истина);
	ДанныеДляЗагрузки.Вставить("СовместныеПолномочия", Ложь);
	ДанныеДляЗагрузки.Вставить("Доверители", Новый Массив());
	ДанныеДляЗагрузки.Вставить("Представители", Новый Массив());
	ДанныеДляЗагрузки.Вставить("СтатусВРеестреФНС", Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка());
	ДанныеДляЗагрузки.Вставить("Полномочия", Новый Массив());
	ДанныеДляЗагрузки.Вставить("ТекстовоеПолномочие", "");
	ДанныеДляЗагрузки.Вставить("ВариантЗаполненияПолномочий", "");
	ДанныеДляЗагрузки.Вставить("ПередовериеРазрешено", Ложь);
	
	Возврат ДанныеДляЗагрузки;
	
КонецФункции

// Формирует пустую структуру данных МЧД.
// 
// Возвращаемое значение:
//  Структура:
//	* XMLфайлМЧД - Неопределено
//				 - ХранилищеЗначения
//	* ДатаЗагрузкиИзРеестра - Дата
//	* НомерДоверенности - Строка
//	* ДатаВыдачи - Дата
//	* ДатаОкончания - Дата
//	* СрокДействия - Строка
//	* СведенияОбИнформационнойСистеме - Строка
//	* НомерРодительскойДоверенности - Строка
//	* НомерОсновнойДоверенности - Строка
//	* ИННДоверителяРодительскойДоверенности - Строка
//	* КППДоверителяРодительскойДоверенности - Строка
//	* ВозможноПередоверие - Булево
//	* ТипПередоверия - Строка
//	* ФИО - Массив из см. НовыеДанныеСубъектаМЧД
//	* Полномочия - Массив из см. НовыеПолномочияПредставителя
//	* УдостоверенияЛичности - Массив из см. НовыеДанныеУдостоверенияЛичности
//	* ТипОрганизации - Строка
//	* СовместныеПолномочия - Булево
//	* НесколькоПредставителей - Булево
//	* Представители - Массив Из Структура:
//		** ПредставительЮЛ_НаимОрг - Строка
//		** ПредставительЮЛ_ИНН - Строка
//		** ПредставительЮЛ_КПП - Строка
//		** ПредставительЮЛ_ОГРН - Строка
//		** ПредставительФЛ_ИНН - Строка
//		** ПредставительФЛ_ОГРН - Строка
//		** ПредставительФЛ_СНИЛС - Строка
//		** ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//		** ПредставительФЛ_ДатаРождения - Дата
//		** Представитель - Неопределено,
//						- СправочникСсылка
//		** Фамилия - Строка
//		** Имя - Строка
//		** Отчество - Строка
//		** УдостоверениеЛичности см. НовыеДанныеУдостоверенияЛичности
//		** ТипУполномоченногоПредставителя - Строка
//	* ДоверительЮЛ_НаимОрг - Строка
//	* ДоверительЮЛ_ИНН - Строка
//	* ДоверительЮЛ_КПП - Строка
//	* ДоверительЮЛ_ОГРН - Строка
//	* ДоверительЮЛ_Адр - Строка
//	* ЛицоБезДовФЛ_ИНН - Строка
//	* ЛицоБезДовФЛ_СНИЛС - Строка
//	* ЛицоБезДовФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ЛицоБезДовФЛ_ДатаРождения - Дата
//	* ЛицоБезДовФЛ_Должность - Строка
//	* ЛицоБезДовФЛ - Неопределено,
//				   - СправочникСсылка
//	* ЛицоБезДовЮЛ_НаимОрг - Строка
//	* ЛицоБезДовЮЛ_ИНН - Строка
//	* ЛицоБезДовЮЛ_КПП - Строка
//	* ЛицоБезДовЮЛ_ОГРН - Строка
//	* ЛицоБезДовЮЛ - Неопределено,
//				   - СправочникСсылка
//	* ДоверительЮЛ_ИностраннаяОрганизация - Булево
//	* ДоверительЮЛ_СтрРег - СправочникСсылка.СтраныМира
//	* ДоверительЮЛ_НаимРегОрг - Строка
//	* ДоверительЮЛ_РегНомер - Строка
//	* ДоверительФЛ_ИНН - Строка
//	* ДоверительФЛ_СНИЛС - Строка
//	* ДоверительФЛ_ДатаРождения - Дата
//	* ДоверительФЛ_МестоРожд - Строка
//	* ДоверительФЛ_Пол - Число - 1-мужской, 2-женский
//	* ДоверительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительЮЛ_НаимОрг - Строка
//	* ПредставительЮЛ_ИНН - Строка
//	* ПредставительЮЛ_КПП - Строка
//	* ПредставительЮЛ_ОГРН - Строка
//	* ПредставительФЛ_ИНН - Строка
//	* ПредставительФЛ_ОГРН - Строка
//	* ПредставительФЛ_СНИЛС - Строка
//	* ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительФЛ_ДатаРождения - Дата
//	* Представитель - Неопределено,
//					- СправочникСсылка
//	* Организация - Неопределено,
//				  - СправочникСсылка
// 
Функция НовыеДанныеМЧД()

	ДанныеДоверенности = Новый Структура;

	ДанныеДоверенности.Вставить("XMLфайлМЧД", Неопределено);
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	ДанныеДоверенности.Вставить("НомерДоверенности", "");
	ДанныеДоверенности.Вставить("ДатаВыдачи", '00010101');
	ДанныеДоверенности.Вставить("ДатаОкончания", '00010101');
	ДанныеДоверенности.Вставить("СрокДействия", "");
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", "");
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("НомерОсновнойДоверенности", "");
	ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("КППДоверителяРодительскойДоверенности", "");
	
	ДанныеДоверенности.Вставить("ВозможноПередоверие", Ложь);
	ДанныеДоверенности.Вставить("ТипПередоверия", "");
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("Полномочия", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);
	ДанныеДоверенности.Вставить("ТипОрганизации", "");
	ДанныеДоверенности.Вставить("СовместныеПолномочия", Ложь);
	ДанныеДоверенности.Вставить("НесколькоПредставителей", Ложь);
	ДанныеДоверенности.Вставить("Представители", Новый Массив);

	ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", "");

	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Гражданство", Справочники.СтраныМира.ПустаяСсылка());
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", '00010101');
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовФЛ", Неопределено);

	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ", Неопределено);
	
	ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Ложь);
	ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", Справочники.СтраныМира.ПустаяСсылка());
	ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", "");
	ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", "");

	ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", '00010101');
	ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", "");
	ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", 1);
	ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", Справочники.СтраныМира.ПустаяСсылка());

	ДанныеДоверенности.Вставить("ПредставительЮЛ_НаимОрг", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_КПП", "");
	ДанныеДоверенности.Вставить("ПредставительЮЛ_ОГРН", "");
	
	ДанныеДоверенности.Вставить("ПредставительФЛ_ИНН", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_ОГРН", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_СНИЛС", "");
	ДанныеДоверенности.Вставить("ПредставительФЛ_Гражданство", Справочники.СтраныМира.ПустаяСсылка());
	ДанныеДоверенности.Вставить("ПредставительФЛ_ДатаРождения", '00010101');
	
	ДанныеДоверенности.Вставить("Представитель", Неопределено);
	ДанныеДоверенности.Вставить("Организация", Неопределено);
		
	Возврат ДанныеДоверенности;
	
КонецФункции

// Получить данные для заполнения МЧД.
// 
// Параметры:
//  ОбъектМЧД - см. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.Доверенность
// 
// Возвращаемое значение:
//  см. НовыеДанныеМЧД
Функция ДанныеДляЗаполненияМЧД003(ОбъектМЧД)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Истина, "", НовыеДанныеМЧД003());
	ДанныеДляЗаполнения = Результат.ДанныеДоверенности;
	
	СвДовXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Довер.СвДов", Неопределено);
	Если СвДовXDTO <> Неопределено Тогда
		Сведения = СвДовXDTO;
	КонецЕсли;
	
	СвПереДоверXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПереДовер", Неопределено);
	Если СвПереДоверXDTO <> Неопределено Тогда
		Сведения = СвПереДоверXDTO;
	КонецЕсли;
	
	СвПервДоверXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПервДовер", Неопределено);
	Если СвПервДоверXDTO <> Неопределено Тогда

		ДанныеДляЗаполнения.НомерРодительскойДоверенности = СвПервДоверXDTO.НомДоверПерв;
		
		СвДоверПервXDTO = ЗначениеСвойстваXDTO(ОбъектМЧД, "Документ.Передов.СвПервДовер.СвДоверПерв", , , Истина); 
		ДоверительXDTO = СвДоверПервXDTO[0];
		Участник = Неопределено;
		ТипУчастника = ДоверительXDTO.ТипДоверит;
		ТипыДоверителей = ТипыДоверителей();
		
		Если ТипУчастника = ТипыДоверителей.ЮридическоеЛицо Тогда
			СвРосОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.РосОргДовер");
			Участник = ПолучитьУчастника_ЮридическоеЛицо(СвРосОргXDTO);
		ИначеЕсли ТипУчастника = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда	
			ИППерПолнXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ИПДовер");
			Участник = ПолучитьУчастника_ИндивидуальныйПредприниматель(ИППерПолнXDTO);
		ИначеЕсли ТипУчастника = ТипыДоверителей.ФизическоеЛицо Тогда	
			ФЛПерПолнЛXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ФЛДовер");
			Участник = ПолучитьУчастника_ФизическоеЛицо(ФЛПерПолнЛXDTO);
		ИначеЕсли ТипУчастника = ТипыДоверителей.ИностраннаяОрганизация Тогда	
			СвИнОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ИнОргДовер");
			Участник = ПолучитьУчастника_ИностраннаяОрганизация(СвИнОргXDTO);
		КонецЕсли;	
		
		Если Участник <> Неопределено Тогда
			ДанныеДляЗаполнения.ИННДоверителяРодительскойДоверенности = Участник.ИНН;
		КонецЕсли;

	КонецЕсли;
	
	ДанныеДляЗаполнения.НомерДоверенности = ЗначениеСвойстваXDTO(Сведения, "НомДовер", "");
	ДанныеДляЗаполнения.ДатаВыдачи = ЗначениеСвойстваXDTO(Сведения, "ДатаВыдДовер", '00010101', "Дата");
	ДанныеДляЗаполнения.СрокДействия = ЗначениеСвойстваXDTO(Сведения, "СрокДейст", '00010101', "Дата");
	
	ПрПередов = ЗначениеСвойстваXDTO(Сведения, "ПрПередов", Ложь);
	ДанныеДляЗаполнения.ПередовериеРазрешено = ПередовериеРазрешено(ПрПередов);
	
	ЗаполнитьДоверителей(ДанныеДляЗаполнения.Доверители, ОбъектМЧД);
	ЗаполнитьПредставителей(ДанныеДляЗаполнения.Представители, ОбъектМЧД);
	ЗаполнитьДанныеПолномочий(ДанныеДляЗаполнения, ОбъектМЧД);
	
	Возврат Результат;
	
КонецФункции

// Определяет по признаку что передоверие разрешено
//
// Параметры:
//  ПризнакПередоверия - Строка
//
// Возвращаемое значение:
//  Булево
Функция ПередовериеРазрешено(ПризнакПередоверия)
	
	Признаки = ПризнакВозможностиПередоверия();
	Если ПризнакПередоверия = Признаки.ПоследующееПередоверие Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Признак возможности передоверия.
// 
// Возвращаемое значение:
//  Структура:
//    * БезПередоверия - Строка
//    * Однократное - Строка
//    * ПоследующееПередоверие - Строка
Функция ПризнакВозможностиПередоверия()
	
	Структура = Новый Структура("БезПередоверия, Однократное, ПоследующееПередоверие", "1", "2", "3");
	Возврат Структура;
	
КонецФункции


#КонецОбласти

#Область Представление_МЧД003

// Возвращает табличный документ МЧД.
// 
// Параметры:
//  ДоверенностьXDTO - См. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.Доверенность
// 
// Возвращаемое значение:
//   ТабличныйДокумент - ТабличныйДокумент -  табличный документ МЧД
//
Функция ТабличныйДокументМЧД003(ДоверенностьXDTO)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ИмяМакета = "КарточкаМЧД003";
	Макет = Справочники.Доверенности.ПолучитьМакет(ИмяМакета);
	
	ДокументXDTO = ДоверенностьXDTO.Документ;
	
	ДоверXDTO = ЗначениеСвойстваXDTO(ДокументXDTO, "Довер", Неопределено);
	Если ДоверXDTO <> Неопределено Тогда
		ВывестиДоверенность(ТабличныйДокумент, Макет, ДоверXDTO);
	КонецЕсли; 
	
	ПередовXDTO = ЗначениеСвойстваXDTO(ДокументXDTO, "Передов", Неопределено);
	Если ПередовXDTO <> Неопределено Тогда
		ВывестиПередоверие(ТабличныйДокумент, Макет, ПередовXDTO);
	КонецЕсли;	
		
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиДоверенность(ТабличныйДокумент, Макет, Доверенность)
	
	ТипыДоверителей = ТипыДоверителей();
	ТипыПредставителей = ТипыПредставителей();
	
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	
	ВывестиШапку(ТабличныйДокумент, Макет, Доверенность.СвДов);
	
	СвДоверитXDTO = ЗначениеСвойстваXDTO(Доверенность, "СвДоверит", , , Истина);
	
	ЗаголовокОбласти = Макет.ПолучитьОбласть("ЗаголовокОбласти");
	ЗаголовокОбласти.Параметры.ТекстЗаголовка = 
		?(СвДоверитXDTO.Количество() > 1, НСтр("ru='Сведения о доверителях'"), НСтр("ru='Сведения о доверителе'"));
	ТабличныйДокумент.Вывести(ЗаголовокОбласти);	
	
	Для Каждого ДоверительXDTO Из СвДоверитXDTO Цикл	
		
		Если ДоверительXDTO.ТипДоверит = ТипыДоверителей.ЮридическоеЛицо Тогда
						
			СвРосОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.РосОргДовер.СвРосОрг");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СвРосОргXDTO);
			
			ЛицоБезДовXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.РосОргДовер.ЛицоБезДов", , , Истина);
			
			Для Каждого ЛицоБезДоверенностиXDTO Из ЛицоБезДовXDTO Цикл
				ВывестиЛицоБезДоверенности(ТабличныйДокумент, Макет, ЛицоБезДоверенностиXDTO);
			КонецЦикла;
			
		ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИностраннаяОрганизация Тогда	
			
			СвИнОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИнОргДовер.СвИнОрг");
			ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, СвИнОргXDTO);
			
			СвРукОПXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИнОргДовер.СвРукОП", , , Истина);
			
			Для Каждого РуководительXDTO Из СвРукОПXDTO Цикл
				
				Заголовок = НСтр("ru='Сведения о подписанте'");
				ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
				ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
				
				ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, РуководительXDTO);
				
			КонецЦикла;	
			
		ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда
			
			ИПДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИПДовер");
			ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, ИПДоверXDTO);
			
		ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ФизическоеЛицо Тогда	
			
			Заголовок = НСтр("ru='Сведения о подписанте'");
			ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);

			ФЛДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ФЛДовер");
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, ФЛДоверXDTO);
						
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
	КонецЦикла;	
	
	СвУпПредXDTO = ЗначениеСвойстваXDTO(Доверенность, "СвУпПред", , , Истина);
	
	ЗаголовокОбласти = Макет.ПолучитьОбласть("ЗаголовокОбласти");
	ЗаголовокОбласти.Параметры.ТекстЗаголовка = 
		?(СвУпПредXDTO.Количество() > 1, НСтр("ru='Сведения о представителях'"), НСтр("ru='Сведения о представителе'"));
	ТабличныйДокумент.Вывести(ЗаголовокОбласти);	
		
	Для Каждого ПредставительXDTO Из СвУпПредXDTO Цикл

		Если ПредставительXDTO.ТипПред = ТипыПредставителей.ЮридическоеЛицо Тогда

			СведОргXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведОрг");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СведОргXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда	

			СведИПXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИП");
			ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, СведИПXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФизическоеЛицо Тогда	
			
			Заголовок = НСтр("ru='Сведения о доверенном лице'");
			ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
			
			СведФизЛXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФизЛ");
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, СведФизЛXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалЮридическогоЛица Тогда	
			
			СведФилиалXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФилиал");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СведФилиалXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
			
			СведИОXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИО");
			ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, СведИОXDTO);
			
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
	КонецЦикла;
	
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о полномочиях'");
	ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
	
	ВывестиПолномочия(ТабличныйДокумент, Макет, Доверенность.СвПолн);
	ТабличныйДокумент.Вывести(ОбластьРазделитель);
	
	СвНотУдXDTO = ЗначениеСвойстваXDTO(Доверенность, "СвНотУд", Неопределено); 
	Если СвНотУдXDTO <> Неопределено Тогда
		
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о нотариальном удостоверении'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		
		ВывестиНотариальноеУдостоверение(ТабличныйДокумент, Макет, СвНотУдXDTO);
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ВывестиПередоверие(ТабличныйДокумент, Макет, Передоверие)
	
	ТипыПредставителей = ТипыПредставителей();
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	
	ВывестиШапку(ТабличныйДокумент, Макет, Передоверие.СвПереДовер);
	
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о первоначальной доверенности'");
	ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
	ВывестиСведенияПервоначальнойДоверенности(ТабличныйДокумент, Макет, Передоверие.СвПервДовер);
	
    СвПередовXDTO = ЗначениеСвойстваXDTO(Передоверие, "СвПередов", Неопределено);
	Если СвПередовXDTO <> Неопределено Тогда
		
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о доверенности, на основании которой осуществляется передоверие'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		ВывестиСведенияПервоначальнойДоверенности(ТабличныйДокумент, Макет, СвПередовXDTO);
		
	КонецЕсли;	
	
	СвПередПолнXDTO = ЗначениеСвойстваXDTO(Передоверие, "СвПередПолн", , , Истина);
	
	ЗаголовокОбласти = Макет.ПолучитьОбласть("ЗаголовокОбласти");
	ЗаголовокОбласти.Параметры.ТекстЗаголовка = 
		?(СвПередПолнXDTO.Количество() > 1, НСтр("ru='Лица, передавшие полномочия'"), НСтр("ru='Лицо, передавшее полномочия'"));
	ТабличныйДокумент.Вывести(ЗаголовокОбласти);
	
	Для Каждого ПредставительXDTO Из СвПередПолнXDTO Цикл
		
		Если ПредставительXDTO.ТипПерПолн = ТипыПредставителей.ЮридическоеЛицо Тогда
			
			СвРосОргXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.РосОргПерПолн.СвРосОрг");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СвРосОргXDTO);
			
			ЛицоБезДовXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.РосОргПерПолн.ЛицоБезДов", , , Истина);
			
			ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
			ПроизвольныйЗаголовок.Параметры.Заголовок = 
				?(ЛицоБезДовXDTO.Количество() > 1, НСтр("ru='Представители'"), НСтр("ru='Представитель'"));
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
			
			Для Каждого ЛицоБезДоверенностиXDTO Из ЛицоБезДовXDTO Цикл
				ВывестиЛицоБезДоверенности(ТабличныйДокумент, Макет, ЛицоБезДоверенностиXDTO);
			КонецЦикла;
			
		ИначеЕсли ПредставительXDTO.ТипПерПолн = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда	
			
			ИППерПолнXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ИППерПолн");
			ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, ИППерПолнXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПерПолн = ТипыПредставителей.ФизическоеЛицо Тогда	
			
			ФЛПерПолнЛXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ФЛПерПолн");
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, ФЛПерПолнЛXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПерПолн = ТипыПредставителей.ФилиалЮридическогоЛица Тогда	
			
			СвФилXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ФилПерПолн.СвФил");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СвФилXDTO);
			
			ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
			ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Руководитель филиала (обособленного подразделения) юридического лица'");
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
			
			СвРукФилXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ФилПерПолн.СвРукФил");
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, СвРукФилXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПерПолн = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
			
			СвИнОргXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ИнПерПолн.СвИнОрг");
			ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, СвИнОргXDTO);
			
			СвРукОПXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "ПередПолн.ИнПерПолн.СвРукОП", , , Истина);
			
			ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
			ПроизвольныйЗаголовок.Параметры.Заголовок = 
				?(СвРукОПXDTO.Количество() > 1, НСтр("ru='Сведения о руководителях'"), НСтр("ru='Сведения о руководителе'"));
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
			
			Для Каждого РуководительXDTO Из СвРукОПXDTO Цикл
				ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, РуководительXDTO);
			КонецЦикла;
			
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
	КонецЦикла;
	
	СвПолучПолнXDTO = ЗначениеСвойстваXDTO(Передоверие, "СвПолучПолн", , , Истина);
	
	ЗаголовокОбласти = Макет.ПолучитьОбласть("ЗаголовокОбласти");
	ЗаголовокОбласти.Параметры.ТекстЗаголовка = 
		?(СвПолучПолнXDTO.Количество() > 1, НСтр("ru='Лица, получившие полномочия'"), НСтр("ru='Лицо, получившее полномочия'"));
	ТабличныйДокумент.Вывести(ЗаголовокОбласти);
	
	Для Каждого ПредставительXDTO Из СвПолучПолнXDTO Цикл
		
		Если ПредставительXDTO.ТипПред = ТипыПредставителей.ЮридическоеЛицо Тогда
			
			СведОргXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведОрг");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СведОргXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда	
			
			СведИПXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИП");
			ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, СведИПXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФизическоеЛицо Тогда	
			
			СведФизЛXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФизЛ");
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, СведФизЛXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалЮридическогоЛица Тогда	
			
			СведФилиалXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФилиал");
			ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СведФилиалXDTO);
			
		ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
			
			СведИОXDTO = ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИО");
			ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, СведИОXDTO);
			
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
	КонецЦикла;	
	
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о полномочиях'");
	ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
	
	ВывестиПолномочия(ТабличныйДокумент, Макет, Передоверие.СвПолн);
	ТабличныйДокумент.Вывести(ОбластьРазделитель);
	
	СвНотУдXDTO = ЗначениеСвойстваXDTO(Передоверие, "СвНотУд", Неопределено); 
	Если СвНотУдXDTO <> Неопределено Тогда
		
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о нотариальном удостоверении'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		
		ВывестиНотариальноеУдостоверение(ТабличныйДокумент, Макет, СвНотУдXDTO);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ВывестиШапку(ТабличныйДокумент, Макет, Доверенность)
	
	ВидДоверенностиXDTO = Новый Соответствие();
	ВидДоверенностиXDTO.Вставить("1", НСтр("ru='С возможностью отзыва'"));
	ВидДоверенностиXDTO.Вставить("2", НСтр("ru='Без возможности отзыва'"));
	
	ПередовериеДоверенностиXDTO = Новый Соответствие();
	ПередовериеДоверенностиXDTO.Вставить("1", НСтр("ru='Без права передоверия'"));
	ПередовериеДоверенностиXDTO.Вставить("2", НСтр("ru='Однократное передоверие'"));
	ПередовериеДоверенностиXDTO.Вставить("3", НСтр("ru='С правом передоверия'"));
	
	ПередовериеБезотзывнойДоверенностиXDTO = Новый Соответствие();
	ПередовериеБезотзывнойДоверенностиXDTO.Вставить("1", НСтр("ru='С возможностью передоверия'"));
	ПередовериеБезотзывнойДоверенностиXDTO.Вставить("2", НСтр("ru='Невозможно'"));
	
	УсловиеОтзываБезотзывнойДоверенностиXDTO = Новый Соответствие();
	УсловиеОтзываБезотзывнойДоверенностиXDTO.Вставить("1", НСтр("ru='По истечению срока действия'"));
	УсловиеОтзываБезотзывнойДоверенностиXDTO.Вставить("2", НСтр("ru='По условию'"));
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.НомерДоверенности = Доверенность.НомДовер;
	Шапка.Параметры.ДатаВыдачи = Доверенность.ДатаВыдДовер;
	Шапка.Параметры.СрокДействия = Доверенность.СрокДейст;
	Шапка.Параметры.ВидДоверенности = ВидДоверенностиXDTO[Доверенность.ВидДовер];
	Шапка.Параметры.ПравоПередоверия = ПередовериеДоверенностиXDTO[Доверенность.ПрПередов];
	ТабличныйДокумент.Вывести(Шапка);
	
	БезотзывXDTO = ЗначениеСвойстваXDTO(Доверенность, "Безотзыв", Неопределено);
	Если БезотзывXDTO <> Неопределено Тогда
		
		БезотзывнаяДоверенность = Макет.ПолучитьОбласть("БезотзывнаяДоверенность");
		БезотзывнаяДоверенность.Параметры.ПравоПередоверия = ПередовериеБезотзывнойДоверенностиXDTO[БезотзывXDTO.ПрПерБезДов];
		БезотзывнаяДоверенность.Параметры.УсловиеОтзыва = УсловиеОтзываБезотзывнойДоверенностиXDTO[БезотзывXDTO.УслОтзыва];
		ТабличныйДокумент.Вывести(БезотзывнаяДоверенность);
		
		Если БезотзывXDTO.УслОтзыва = "2" Тогда
			УсловиеОтзываБезотзывнойДоверенности = Макет.ПолучитьОбласть("УсловиеОтзываБезотзывнойДоверенности");
			УсловиеОтзываБезотзывнойДоверенности.Параметры.УсловиеОтзыва =
				ЗначениеСвойстваXDTO(БезотзывXDTO, "ОписУслОт", "");
			ТабличныйДокумент.Вывести(УсловиеОтзываБезотзывнойДоверенности);
		КонецЕсли;	
		
	КонецЕсли
	
КонецПроцедуры	

Процедура ВывестиСведенияПервоначальнойДоверенности(ТабличныйДокумент, Макет, ПервоначальнаяДоверенность)
	
	ТипыДоверителей = ТипыДоверителей();
	
	ТипДоверенностиXDTO = Новый Соответствие();
	ТипДоверенностиXDTO.Вставить("1", НСтр("ru='Первоначальная доверенность'"));
	ТипДоверенностиXDTO.Вставить("2", НСтр("ru='Доверенность, выданная в порядке передоверия'"));
	
	ФормаДоверенностиXDTO = Новый Соответствие();
	ФормаДоверенностиXDTO.Вставить("1", НСтр("ru='В электронной форме в машиночитаемом виде'"));
	ФормаДоверенностиXDTO.Вставить("2", НСтр("ru='На бумажном носителе'"));
	
	НомДоверПерв = ЗначениеСвойстваXDTO(ПервоначальнаяДоверенность, "НомДоверПерв", "");
	Если Не ПустаяСтрока(НомДоверПерв) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Номер первоначальной доверенности'"); 
		ПроизвольныеСведения.Параметры.Текст = НомДоверПерв;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
	
	// АПК:216-выкл не проверяем смесь латиницы и кириллицы для НомДоверN.
	
	НомДоверN = ЗначениеСвойстваXDTO(ПервоначальнаяДоверенность, "НомДоверN", "");
	Если Не ПустаяСтрока(НомДоверN) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Номер доверенности, на основании которой осуществляется передоверие'"); 
		ПроизвольныеСведения.Параметры.Текст = НомДоверN;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
		
	// АПК:216-вкл включаем проверку обратно.
	
	СведенияПервоначальнойДоверенности = Макет.ПолучитьОбласть("СведенияПервоначальнойДоверенности");
	СведенияПервоначальнойДоверенности.Параметры.ДатаВыдачи = ПервоначальнаяДоверенность.ДатаВыдДовер;
	СведенияПервоначальнойДоверенности.Параметры.СрокДействия = ПервоначальнаяДоверенность.СрокДейст;
	СведенияПервоначальнойДоверенности.Параметры.ТипДоверенности = ТипДоверенностиXDTO[ПервоначальнаяДоверенность.ПрДовер];	
	СведенияПервоначальнойДоверенности.Параметры.ФормаДоверенности = ФормаДоверенностиXDTO[ПервоначальнаяДоверенность.ФормДовер];
	ТабличныйДокумент.Вывести(СведенияПервоначальнойДоверенности);	
	
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	
	СвДоверПервXDTO = ЗначениеСвойстваXDTO(ПервоначальнаяДоверенность, "СвДоверПерв", Неопределено, , Истина);
	Если СвДоверПервXDTO <> Неопределено Тогда
		Для Каждого ДоверительXDTO Из СвДоверПервXDTO Цикл	
		
			Если ДоверительXDTO.ТипДоверит = ТипыДоверителей.ЮридическоеЛицо Тогда
				
				СвРосОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.РосОргДовер");
				
				ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СвРосОргXDTO);
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИностраннаяОрганизация Тогда	
				
				СвИнОргXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ИнОргДовер.СвИнОрг");
				ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, СвИнОргXDTO);
				
				СвРукОПXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ИнОргДовер.СвРукОП", , , Истина);
				
				ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
				ПроизвольныйЗаголовок.Параметры.Заголовок = 
					?(СвРукОПXDTO.Количество() > 1, НСтр("ru='Сведения о руководителях'"), НСтр("ru='Сведения о руководителе'"));
				ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
				
				Для Каждого РуководительXDTO Из СвРукОПXDTO Цикл
					ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, РуководительXDTO);
				КонецЦикла;	
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда
				
				ИПДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ИПДовер");
				ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, ИПДоверXDTO);
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ФизическоеЛицо Тогда	
				
				ФЛДоверXDTO = ЗначениеСвойстваXDTO(ДоверительXDTO, "ДоверитПерв.ФЛДовер");
				ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, ФЛДоверXDTO);
							
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьРазделитель);
			
		КонецЦикла;
	КонецЕсли;	
	
	СвНотДействXDTO = ЗначениеСвойстваXDTO(ПервоначальнаяДоверенность, "СвНотДейств", Неопределено);
	Если СвНотДействXDTO <> Неопределено Тогда
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о нотариусе'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		ВывестиНотариуса(ТабличныйДокумент, Макет, СвНотДействXDTO);
	КонецЕсли;
	
	ВриоНотXDTO = ЗначениеСвойстваXDTO(ПервоначальнаяДоверенность, "ВриоНот", Неопределено);
	Если ВриоНотXDTO <> Неопределено Тогда
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о ВРИО нотариуса'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		ВывестиНотариуса(ТабличныйДокумент, Макет, ВриоНотXDTO, Истина);
	КонецЕсли;

КонецПроцедуры	
	
Процедура ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, ЮридическоеЛицо)

	СведенияЮридическогоЛица = Макет.ПолучитьОбласть("СведенияЮридическогоЛица");
	СведенияЮридическогоЛица.Параметры.Наименование = ЮридическоеЛицо.НаимОрг;
	СведенияЮридическогоЛица.Параметры.ИНН = ЗначениеСвойстваXDTO(ЮридическоеЛицо, "ИННЮЛ", "");
	СведенияЮридическогоЛица.Параметры.КПП = ЮридическоеЛицо.КПП;
	СведенияЮридическогоЛица.Параметры.ОГРН = ЗначениеСвойстваXDTO(ЮридическоеЛицо, "ОГРН", "");
	ТабличныйДокумент.Вывести(СведенияЮридическогоЛица);
	
	АдрРегXDTO = ЗначениеСвойстваXDTO(ЮридическоеЛицо, "АдрРег", Неопределено);
	Если АдрРегXDTO <> Неопределено Тогда
		ВывестиАдрес(ТабличныйДокумент, Макет, АдрРегXDTO);
	КонецЕсли;
	
	ДокПдтвXDTO = ЗначениеСвойстваXDTO(ЮридическоеЛицо, "ДокПдтв", Неопределено);
	Если ДокПдтвXDTO <> Неопределено Тогда
		ВывестиДокументПодтверждающийПолномочия(ТабличныйДокумент, Макет, ДокПдтвXDTO);
	КонецЕсли;
	
КонецПроцедуры	

Процедура ВывестиСведенияИностранногоЮридическогоЛица(ТабличныйДокумент, Макет, ИностранноеЮридическоеЛицо)

	СведенияИностранногоЮридическогоЛица = Макет.ПолучитьОбласть("СведенияИностранногоЮридическогоЛица");
	СведенияИностранногоЮридическогоЛица.Параметры.Наименование = ИностранноеЮридическоеЛицо.НаимИО;
	СведенияИностранногоЮридическогоЛица.Параметры.ИНН = ЗначениеСвойстваXDTO(ИностранноеЮридическоеЛицо, "ИННЮЛ", "");
	СведенияИностранногоЮридическогоЛица.Параметры.КПП = ЗначениеСвойстваXDTO(ИностранноеЮридическоеЛицо, "КПП", "");
	ТабличныйДокумент.Вывести(СведенияИностранногоЮридическогоЛица);
	
	АдрМНФактXDTO = ЗначениеСвойстваXDTO(СведенияИностранногоЮридическогоЛица, "АдрМНФакт", Неопределено);
	Если АдрМНФактXDTO <> Неопределено Тогда
		ВывестиАдрес(ТабличныйДокумент, Макет, АдрМНФактXDTO);
	КонецЕсли;
	
	АдрСтрРег = ЗначениеСвойстваXDTO(СведенияИностранногоЮридическогоЛица, "АдрСтрРег", "");
	Если Не ПустаяСтрока(АдрСтрРег) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Адрес юр. лица на территории государства, в котором оно зарегистрировано'"); 
		ПроизвольныеСведения.Параметры.Текст = АдрСтрРег;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, ИндивидуальныйПредприниматель)

	СведенияИндивидуальногоПредпринимателя = Макет.ПолучитьОбласть("СведенияИндивидуальногоПредпринимателя");
	СведенияИндивидуальногоПредпринимателя.Параметры.Наименование =
		ЗначениеСвойстваXDTO(ИндивидуальныйПредприниматель, "НаимИП", "");
	СведенияИндивидуальногоПредпринимателя.Параметры.ИНН = ИндивидуальныйПредприниматель.ИННФЛ;	
	СведенияИндивидуальногоПредпринимателя.Параметры.ОГРН = ИндивидуальныйПредприниматель.ОГРНИП;
	СведенияИндивидуальногоПредпринимателя.Параметры.СНИЛС = ИндивидуальныйПредприниматель.СНИЛС;
	
	СведФЛXDTO = ИндивидуальныйПредприниматель.СведФЛ;
	СведенияИндивидуальногоПредпринимателя.Параметры.ФИО = 
		ПолучитьПредставлениеФИО(СведФЛXDTO.ФИО);
	
	Если СведенияИндивидуальногоПредпринимателя.Параметры.Наименование = ""
		И СведенияИндивидуальногоПредпринимателя.Параметры.ФИО <> "" Тогда
			СведенияИндивидуальногоПредпринимателя.Параметры.Наименование = 
				СведенияИндивидуальногоПредпринимателя.Параметры.ФИО;
	КонецЕсли;
	
	СведенияИндивидуальногоПредпринимателя.Параметры.ДатаРождения = 
		ЗначениеСвойстваXDTO(СведФЛXDTO, "ДатаРожд", '00010101');
	ТабличныйДокумент.Вывести(СведенияИндивидуальногоПредпринимателя);
	
	АдрМЖXDTO = ЗначениеСвойстваXDTO(СведФЛXDTO, "АдрМЖ", Неопределено);
	Если АдрМЖXDTO <> Неопределено Тогда
		ВывестиАдрес(ТабличныйДокумент, Макет, АдрМЖXDTO);
	КонецЕсли;
	
	УдЛичнФЛXDTO = ЗначениеСвойстваXDTO(СведФЛXDTO, "УдЛичнФЛ", Неопределено);
	Если УдЛичнФЛXDTO <> Неопределено Тогда
		ВывестиУдостоверениеЛичности(ТабличныйДокумент, Макет, УдЛичнФЛXDTO);
	КонецЕсли;
	
	ДокПдтвXDTO = ЗначениеСвойстваXDTO(ИндивидуальныйПредприниматель, "ДокПдтв", Неопределено);
	Если ДокПдтвXDTO <> Неопределено Тогда
		ВывестиДокументПодтверждающийПолномочия(ТабличныйДокумент, Макет, ДокПдтвXDTO);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, ФизическоеЛицо)
	
	СведФЛXDTO = ФизическоеЛицо.СведФЛ;
	СведенияФизическогоЛица = Макет.ПолучитьОбласть("СведенияФизическогоЛица");
	СведенияФизическогоЛица.Параметры.ФИО = ПолучитьПредставлениеФИО(СведФЛXDTO.ФИО);
	СведенияФизическогоЛица.Параметры.ДатаРождения = ЗначениеСвойстваXDTO(СведФЛXDTO, "ДатаРожд", '00010101');
	СведенияФизическогоЛица.Параметры.ИНН = ЗначениеСвойстваXDTO(ФизическоеЛицо, "ИННФЛ", "");
	СведенияФизическогоЛица.Параметры.СНИЛС = ЗначениеСвойстваXDTO(ФизическоеЛицо, "СНИЛС", "");
	СведенияФизическогоЛица.Параметры.Должность = ЗначениеСвойстваXDTO(ФизическоеЛицо, "Должность", "");
	ТабличныйДокумент.Вывести(СведенияФизическогоЛица);
	
	АдрМЖXDTO = ЗначениеСвойстваXDTO(СведФЛXDTO, "АдрМЖ", Неопределено);
	Если АдрМЖXDTO <> Неопределено Тогда
		ВывестиАдрес(ТабличныйДокумент, Макет, АдрМЖXDTO);
	КонецЕсли;
	
	УдЛичнФЛXDTO = ЗначениеСвойстваXDTO(СведФЛXDTO, "УдЛичнФЛ", Неопределено);
	Если УдЛичнФЛXDTO <> Неопределено Тогда
		ВывестиУдостоверениеЛичности(ТабличныйДокумент, Макет, УдЛичнФЛXDTO);
	КонецЕсли;
	
	ДокПдтвXDTO = ЗначениеСвойстваXDTO(ФизическоеЛицо, "ДокПдтв", Неопределено);
	Если ДокПдтвXDTO <> Неопределено Тогда
		ВывестиДокументПодтверждающийПолномочия(ТабличныйДокумент, Макет, ДокПдтвXDTO);
	КонецЕсли;
	
	СведРукопXDTO = ЗначениеСвойстваXDTO(ФизическоеЛицо, "СведРукоп", Неопределено);
	Если СведРукопXDTO <> Неопределено Тогда
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Рукоприкладчик'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, СведРукопXDTO);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиЛицоБезДоверенности(ТабличныйДокумент, Макет, ЛицоБезДоверенности)
	
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	
	СВЮЛXDTO = ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СВЮЛ", Неопределено);
	Если СВЮЛXDTO <> Неопределено Тогда
		
		Заголовок = НСтр("ru='Сведения о лице, действующем без доверенности'");
		ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		
		ВывестиСведенияЮридическогоЛица(ТабличныйДокумент, Макет, СВЮЛXDTO.СвЮЛЕИО);
		СвФЛXDTO = ЗначениеСвойстваXDTO(СВЮЛXDTO, "СвФЛ", , , Истина);
		Для Каждого ФизическоеЛицоXDTO Из СвФЛXDTO Цикл
			
			Заголовок = НСтр("ru='Сведения о подписанте'");
			ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
			ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
			
			ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, ФизическоеЛицоXDTO);							
		КонецЦикла;
	КонецЕсли;
	
	СвФЛXDTO = ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвФЛ", Неопределено);
	Если СвФЛXDTO <> Неопределено Тогда
		
		Заголовок = НСтр("ru='Сведения о подписанте'");
		ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);

		ВывестиСведенияФизическогоЛица(ТабличныйДокумент, Макет, СвФЛXDTO);
	КонецЕсли;
	
	СвИПXDTO = ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвИП", Неопределено);
	Если СвИПXDTO <> Неопределено Тогда
		
		Заголовок = НСтр("ru='Сведения о лице, действующем без доверенности'");
		ПроизвольныйЗаголовок.Параметры.Заголовок = Заголовок;
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);

		ВывестиСведенияИндивидуальногоПредпринимателя(ТабличныйДокумент, Макет, СвИПXDTO);
	КонецЕсли;
	
	ПолномочияXDTO = Новый Соответствие();
	ПолномочияXDTO.Вставить("1", НСтр("ru='Индивидуальные полномочия'"));
	ПолномочияXDTO.Вставить("2", НСтр("ru='Совместные полномочия'"));
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Вид полномочий единоличного исполнительного органа'"); 
	ПроизвольныеСведения.Параметры.Текст = ПолномочияXDTO[ЛицоБезДоверенности.ПолнЮЛ];
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
КонецПроцедуры	

Процедура ВывестиАдрес(ТабличныйДокумент, Макет, Адрес)
	
	АдрРФ = ЗначениеСвойстваXDTO(Адрес, "АдрРФ", "");
	Если Не ПустаяСтрока(АдрРФ) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Адрес в Российской Федерации'"); 
		ПроизвольныеСведения.Параметры.Текст = АдрРФ;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
	
	ФИАСАдрРФ = ЗначениеСвойстваXDTO(Адрес, "ФИАСАдрРФ", "");
	Если Не ПустаяСтрока(ФИАСАдрРФ) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='ФИАС адрес в Российской Федерации'"); 
		ПроизвольныеСведения.Параметры.Текст = ФИАСАдрРФ;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
	
	ИдФИАС = ЗначениеСвойстваXDTO(Адрес, "ИдФИАС", "");
	Если Не ПустаяСтрока(ИдФИАС) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Идентификатор адреса по ФИАС'"); 
		ПроизвольныеСведения.Параметры.Текст = ИдФИАС;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВывестиУдостоверениеЛичности(ТабличныйДокумент, Макет, УдостоверениеЛичности)
	
	СерияНомер = СтрРазделить(УдостоверениеЛичности.СерНомДок, " ");
	СерияДокумента = ?(СерияНомер.Количество() > 0, СерияНомер[0], "");
	НомерДокумента = ?(СерияНомер.Количество() > 1, СерияНомер[1], "");
	Если СерияНомер.Количество() > 2 Тогда
		СерияДокумента = УдостоверениеЛичности.СерНомДок;
		НомерДокумента = "";
	КонецЕсли;
	
	ДанныеУдостоверенияЛичности = НовыеДанныеУдостоверенияЛичности();
	ДанныеУдостоверенияЛичности.СерДок = СерияДокумента;
	ДанныеУдостоверенияЛичности.НомДок = НомерДокумента;
	ДанныеУдостоверенияЛичности.ДатаДок = УдостоверениеЛичности.ДатаДок;
	ДанныеУдостоверенияЛичности.ВыдДок = УдостоверениеЛичности.ВыдДок;
	ДанныеУдостоверенияЛичности.ВидДок = УдостоверениеЛичности.КодВидДок;
	ДанныеУдостоверенияЛичности.КодВыдДок = УдостоверениеЛичности.КодВыдДок;
	
	ПредставлениеУдостоверения = ПолучитьПредставлениеУдостоверение(ДанныеУдостоверенияЛичности);
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Документ удостоверяющий личность'"); 
	ПроизвольныеСведения.Параметры.Текст = ПредставлениеУдостоверения;
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
КонецПроцедуры	

// Формирует пустую структуру данных удостоверения личности субъекта МЧД.
// 
// Возвращаемое значение:
//  Структура:
//  * СерДок - Строка
//  * НомДок - Строка
//  * ДатаДок - Дата
//  * ВыдДок - Строка
//  * ВидДок - Строка
//  * КодВыдДок - Строка
//  * Владелец - Строка
//  
Функция НовыеДанныеУдостоверенияЛичности()
	
	Результат = Новый Структура;
	Результат.Вставить("СерДок", "");
	Результат.Вставить("НомДок", "");
	Результат.Вставить("ДатаДок", '00010101');
	Результат.Вставить("ВыдДок", "");
	Результат.Вставить("ВидДок", "");
	Результат.Вставить("КодВыдДок", "");
	Результат.Вставить("Владелец", "");
	Возврат Результат;
	
КонецФункции

// Формирует представление удостоверения личности
//
// Параметры:
//  ДанныеУдостоверенияЛичности - См. НовыеДанныеУдостоверенияЛичности
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьПредставлениеУдостоверение(ДанныеУдостоверенияЛичности)

	Представление = "";
	
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ВидДок) Тогда
		ВидыДокументов = ВидыДокументовФизическихЛиц();
		Представление = ВидыДокументов.Получить(ДанныеУдостоверенияЛичности.ВидДок);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.СерДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.СерДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.НомДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.НомДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ДатаДок) Тогда
		Представление = Представление + " " + НСтр("ru = 'выдан'") + " " + Формат(ДанныеУдостоверенияЛичности.ДатаДок, "ДЛФ=ДД");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.ВыдДок) Тогда
		Представление = Представление + " " + ДанныеУдостоверенияЛичности.ВыдДок;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдостоверенияЛичности.КодВыдДок) Тогда
		Представление = Представление + ", " + НСтр("ru = 'код подразделения'") + ":" + ДанныеУдостоверенияЛичности.КодВыдДок;
	КонецЕсли;

	Возврат Представление;

КонецФункции

// Коллекция видов документов
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение- где:
//   * Ключ - Строка - код вида документа, 
//   * Значение - Строка - наименование вида документа.
//
Функция ВидыДокументовФизическихЛиц()
	
	ВидыДокументов = Новый Соответствие();
	
	ВидыДокументов.Вставить("07", НСтр("ru = 'Военный билет'"));
	ВидыДокументов.Вставить("10", НСтр("ru = 'Паспорт иностранного гражданина'"));
	ВидыДокументов.Вставить("11", НСтр("ru = 'Свидетельство о рассмотрении ходатайства о признании лица беженцем на территории Российской Федерации по существу'"));
	ВидыДокументов.Вставить("12", НСтр("ru = 'Вид на жительство в Российской Федерации'"));
	ВидыДокументов.Вставить("13", НСтр("ru = 'Удостоверение беженца'"));
	ВидыДокументов.Вставить("15", НСтр("ru = 'Разрешение на временное проживание в Российской Федерации'"));
	ВидыДокументов.Вставить("19", НСтр("ru = 'Свидетельство о предоставлении временного убежища на территории Российской Федерации'"));
	ВидыДокументов.Вставить("21", НСтр("ru = 'Паспорт гражданина Российской Федерации'"));
	ВидыДокументов.Вставить("24", НСтр("ru = 'Удостоверение личности военнослужащего Российской Федерации'"));
	
	Возврат ВидыДокументов;
	
КонецФункции

Процедура ВывестиДокументПодтверждающийПолномочия(ТабличныйДокумент, Макет, ДокументПодтверждающийПолномочия)
	
	МассивСтрок = Новый Массив;
	
	НаимДокПдтв = ЗначениеСвойстваXDTO(ДокументПодтверждающийПолномочия, "НаимДокПдтв", "");
	Если Не ПустаяСтрока(НаимДокПдтв) Тогда
		Текст = НСтр("ru = 'Наименование документа'") + ": " + НаимДокПдтв;
		МассивСтрок.Добавить(Текст);
	КонецЕсли;	
	
	ДатаВыд = ЗначениеСвойстваXDTO(ДокументПодтверждающийПолномочия, "ДатаВыд", Неопределено);
	Если ДатаВыд <> Неопределено Тогда
		Текст = НСтр("ru = 'Дата выдачи документа'") + ": " + Формат(ДатаВыд, "ДЛФ=ДД");
		МассивСтрок.Добавить(Текст);
	КонецЕсли;
	
	КемВыд = ЗначениеСвойстваXDTO(ДокументПодтверждающийПолномочия, "КемВыд", "");
	Если Не ПустаяСтрока(КемВыд) Тогда
		Текст = НСтр("ru = 'Наименование органа, выдавшего документ'") + ": " + КемВыд;
		МассивСтрок.Добавить(Текст);
	КонецЕсли;
	
	СвУдДок = ЗначениеСвойстваXDTO(ДокументПодтверждающийПолномочия, "СвУдДок", "");
	Если Не ПустаяСтрока(СвУдДок) Тогда
		Текст = НСтр("ru = 'Сведения об удостоверении документа'") + ": " + СвУдДок;
		МассивСтрок.Добавить(Текст);
	КонецЕсли;
	
	Если МассивСтрок.Количество() > 0 Тогда
	    ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Документ, подтверждающий полномочия лица'"); 
		ПроизвольныеСведения.Параметры.Текст = СтрСоединить(МассивСтрок, ". ");
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;	
	
КонецПроцедуры	

// Выводит полномочия в печатную форму МЧД
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
//  Макет - см. Справочник.МЧД003.Макет.КарточкаМЧД_ru
//  Полномочия - СписокXDTO Из см. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.СвПолнТип
Процедура ВывестиПолномочия(ТабличныйДокумент, Макет, Полномочия)
	
	ТипыПолномочийXDTO = Новый Структура();
	ТипыПолномочийXDTO.Вставить("Текстовые", "0");
	ТипыПолномочийXDTO.Вставить("Машиночитаемые", "1");
	
	Если Полномочия.ТипПолн = ТипыПолномочийXDTO.Текстовые Тогда
		
		ТекстПолномочий = ЗначениеСвойстваXDTO(Полномочия, "ТекстПолн", "");
		
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Текстовое содержание полномочия'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		
		Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстПолномочий) Цикл
		
			ПроизвольныйТекст = Макет.ПолучитьОбласть("ПроизвольныйТекст");
			ПроизвольныйТекст.Параметры.Текст = СтрПолучитьСтроку(ТекстПолномочий, НомерСтроки);
			ПроизвольныйТекст.Область(1, 2).ЦветТекста = Новый Цвет;
			ТабличныйДокумент.Вывести(ПроизвольныйТекст);
		
		КонецЦикла;
		
	ИначеЕсли Полномочия.ТипПолн = ТипыПолномочийXDTO.Машиночитаемые Тогда	
		
		МашПолнXDTO = ЗначениеСвойстваXDTO(Полномочия, "МашПолн", Неопределено, , Истина);
		Если МашПолнXDTO <> Неопределено Тогда
			Для Каждого ПолномочиеXDTO Из МашПолнXDTO Цикл
				
				Если Не ЗначениеЗаполнено(ПолномочиеXDTO.КодПолн)
					Или Не ЗначениеЗаполнено(ПолномочиеXDTO.НаимПолн) Тогда
					
					Продолжить;
				КонецЕсли;
				
				ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныйТекст");
				ПроизвольныеСведения.Параметры.Текст = ПолномочиеXDTO.КодПолн + " " + ПолномочиеXDTO.НаимПолн;
				ТабличныйДокумент.Вывести(ПроизвольныеСведения);
				
				ОгрСвПолнXDTO = ЗначениеСвойстваXDTO(ПолномочиеXDTO, "ОгрСвПолн", Неопределено, , Истина);
				Если ОгрСвПолнXDTO <> Неопределено Тогда
					
					МассивОграничений = Новый Массив;
					
					Для Каждого ОграничениеXDTO Из ОгрСвПолнXDTO Цикл	
						
						Текст = Строка(ОграничениеXDTO.ИдОгр) + ". "
							+ НСтр("ru='Код ограничения'") + ": " + ОграничениеXDTO.КодОгр + ", "
							+ НСтр("ru='наименование ограничения'") + ": " + ОграничениеXDTO.НаимОгр;
							
						КодЗначОгр = ЗначениеСвойстваXDTO(ОграничениеXDTO, "КодЗначОгр", "");
						Если Не ПустаяСтрока(КодЗначОгр) Тогда
							Текст = Текст + ", " + НСтр("ru='код значения для ограничения'") + ": " + КодЗначОгр;
						КонецЕсли;	
						
						ТексЗначОгр = ЗначениеСвойстваXDTO(ОграничениеXDTO, "ТексЗначОгр", "");
						Если Не ПустаяСтрока(ТексЗначОгр) Тогда
							Текст = Текст + ", " + НСтр("ru='текст значение для ограничения'") + ": " + ТексЗначОгр;
						КонецЕсли;
						
						МассивОграничений.Добавить(Текст);
						
					КонецЦикла;
					
					Если МассивОграничений.Количество() > 0 Тогда
						ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
						ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Ограничения к полномочию'"); 
						ПроизвольныеСведения.Параметры.Текст = СтрСоединить(МассивОграничений, Символы.ПС);
						ТабличныйДокумент.Вывести(ПроизвольныеСведения);
					КонецЕсли;
					
				КонецЕсли;	
					
			КонецЦикла;
			
			Разделитель = Макет.ПолучитьОбласть("ПроизвольныйТекст");
			ТабличныйДокумент.Вывести(Разделитель);
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Тип полномочий'"); 
	ПроизвольныеСведения.Параметры.Текст = ?(Полномочия.ПрСовмПолн = "2", 
		НСтр("ru='Полномочия осуществляются совместно'"),
		НСтр("ru='Полномочия индивидуальны'"));
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
КонецПроцедуры	

Процедура ВывестиНотариальноеУдостоверение(ТабличныйДокумент, Макет, НотариальноеУдостоверение)

	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Место совершения доверенности'"); 
	ПроизвольныеСведения.Параметры.Текст = НотариальноеУдостоверение.МестоДовер;
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
	ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
	ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о нотариусе'");
	ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
	ВывестиНотариуса(ТабличныйДокумент, Макет, НотариальноеУдостоверение.СвНотДейств);
		
	ВриоНотXDTO = ЗначениеСвойстваXDTO(НотариальноеУдостоверение, "ВриоНот", Неопределено);
	Если ВриоНотXDTO <> Неопределено Тогда
		ПроизвольныйЗаголовок = Макет.ПолучитьОбласть("ПроизвольныйЗаголовок");
		ПроизвольныйЗаголовок.Параметры.Заголовок = НСтр("ru='Сведения о ВРИО нотариуса'");
		ТабличныйДокумент.Вывести(ПроизвольныйЗаголовок);
		ВывестиНотариуса(ТабличныйДокумент, Макет, ВриоНотXDTO, Истина);
	КонецЕсли;	
	
	ДопСвНотДовер = ЗначениеСвойстваXDTO(НотариальноеУдостоверение, "ДопСвНотДовер", "");
	Если Не ПустаяСтрока(ДопСвНотДовер) Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Дополнительные сведения'"); 
		ПроизвольныеСведения.Параметры.Текст = ДопСвНотДовер;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
	
	ИнСвУдНадпис = ЗначениеСвойстваXDTO(НотариальноеУдостоверение, "ИнСвУдНадпис", "");
	Если Не ПустаяСтрока(ИнСвУдНадпис) <> Неопределено Тогда
		ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
		ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Иные сведения удостоверительной надписи'"); 
		ПроизвольныеСведения.Параметры.Текст = ИнСвУдНадпис;
		ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	КонецЕсли;
	
	МассивПодписей = Новый Массив;
	ПодпРукописXDTO = ЗначениеСвойстваXDTO(НотариальноеУдостоверение, "ПодпРукопис", , , Истина);
	Для Каждого ПодписьXDTO Из ПодпРукописXDTO Цикл
		Подпись = ПолучитьПредставлениеФИО(ПодписьXDTO.ФИООтв);
		МассивПодписей.Добавить(Подпись);
	КонецЦикла;
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = 
		?(ПодпРукописXDTO.Количество() > 1, НСтр("ru='Рукописные подписи'"), НСтр("ru='Рукописная подпись'"));
	ПроизвольныеСведения.Параметры.Текст = СтрСоединить(МассивПодписей, Символы.ПС);
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
КонецПроцедуры	

Процедура ВывестиНотариуса(ТабличныйДокумент, Макет, Нотариус, ЭтоВРИО = Ложь)
	
	Если ЭтоВРИО Тогда
		ФИО = ПолучитьПредставлениеФИО(Нотариус.ФИОВриоНот);
	Иначе
		ФИО = ПолучитьПредставлениеФИО(Нотариус.ФИОНотДейств);
	КонецЕсли;	
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='ФИО'"); 
	ПроизвольныеСведения.Параметры.Текст = ФИО;
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Должность'"); 
	ПроизвольныеСведения.Параметры.Текст = Нотариус.Должность;
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
	ПроизвольныеСведения = Макет.ПолучитьОбласть("ПроизвольныеСведения");
	ПроизвольныеСведения.Параметры.Заголовок = НСтр("ru='Регистрационный номер в Минюсте'"); 
	ПроизвольныеСведения.Параметры.Текст = Нотариус.РегНомНот;
	ТабличныйДокумент.Вывести(ПроизвольныеСведения);
	
КонецПроцедуры	

#КонецОбласти

// Получить данные для заполнения МЧД.
// 
// Параметры:
//  ОбъектМЧД - см. XDTOПакет.ON_EMCHD_1_928_00_01_01_01.Доверенность
// 
// Возвращаемое значение:
//  см. НовыеДанныеМЧД
Функция ДанныеДляЗаполненияМЧД(ОбъектМЧД) Экспорт

	ВерсияФормата = ВерсияФорматаОбъектаМЧД(ОбъектМЧД);
		
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ДанныеДоверенности", Неопределено);
	Результат.Вставить("ВерсияФорматаМЧД", ВерсияФормата);
	Результат.Вставить("ЭтоОбъектXDTO", Ложь);
	
	Если ВерсияФормата = ФорматМЧД_003() Тогда
		
		РезультатЧтения = ДанныеДляЗаполненияМЧД003(ОбъектМЧД);
		
	ИначеЕсли ВерсияФормата = ФорматМЧД_2022() Тогда
	
		РезультатЧтения = ДанныеИзФайлаОбменаВУтвержденномФормате(ОбъектМЧД);
		
	ИначеЕсли  ВерсияФормата = ПилотныйФорматМЧД() Тогда
		
		//РезультатЧтения = ДанныеИзФайлаОбменаВПилотномФормате(ОбъектМЧД);
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ТекстОшибкиЗагрузкиДоверенностиДругогоФормата();
		Возврат Результат;
		
	ИначеЕсли ВерсияФормата = ФорматМЧД_2022_Версия_002() Тогда
		
		РезультатЧтения = ДанныеИзФайлаОбменаВУтвержденномФорматеВерсия002(ОбъектМЧД);
		
	ИначеЕсли ВерсияФормата = ФорматМЧД_b2g() Тогда
		
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ТекстОшибкиЗагрузкиДоверенности_B2G();
		Возврат Результат;
		
	Иначе
		
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = ТекстОшибкиЗагрузкиДоверенностиДругогоФормата();
		Возврат Результат;
		
	КонецЕсли;
	
	Если Не РезультатЧтения.Успех Тогда
		Результат.ТекстОшибки = РезультатЧтения.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
		
	Результат.Успех = Истина;
	Результат.ДанныеДоверенности = РезультатЧтения.ДанныеДоверенности;
	Возврат Результат;	
	
КонецФункции

// Возвращает табличный документ МЧД.
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные.
//  ЭтоМЧДКонтрагента - Булево
// 
// Возвращаемое значение:
//  Структура:
//   * ПредставлениеДокумента - Неопределено, ТабличныйДокумент -  табличный документ МЧД
//   * Успех - Булево - Табличный документ сформирован
Функция ТабличныйДокументМЧД(ОбъектМЧД) Экспорт
	
	РезультатФормирования = Новый Структура;
	РезультатФормирования.Вставить("ПредставлениеДокумента", Неопределено);
	РезультатФормирования.Вставить("Успех", Ложь);
	
	ВерсияФормата = ВерсияФорматаОбъектаМЧД(ОбъектМЧД);
	
	Если ВерсияФормата = ФорматМЧД_003() Тогда
		
		ТабличныйДокумент = ТабличныйДокументМЧД003(ОбъектМЧД);
		
	Иначе
		
		РезультатЧтения = ДанныеДляЗаполненияМЧД(ОбъектМЧД);
		Если НЕ РезультатЧтения.Успех Тогда
			Возврат РезультатФормирования;
		КонецЕсли;
		
		СтруктураДанных = РезультатЧтения.ДанныеДоверенности;
			
		ДоверительФЛ_ФИО = "";
		ДоверительФЛ_Удостоверение = "";
		
		ЭтоПередоверие = ЗначениеЗаполнено(
			РаботаСКоллекциями.СвойствоСтруктуры(СтруктураДанных, "НомерРодительскойДоверенности", ""));
	
		ЭтоДоверительЮрЛицо = СтруктураДанных.ТипОрганизации = "ЮЛ" ИЛИ СтруктураДанных.ТипОрганизации = "ИО";
		
		Для каждого Строка Из СтруктураДанных.ФИО Цикл
			Если Строка.Владелец = "ДоверительРук"
				Или Строка.Владелец = "ДоверительФЛ" Тогда
				ДоверительФЛ_ФИО = ПолучитьПредставлениеФИО(Строка);
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого Строка Из СтруктураДанных.УдостоверенияЛичности Цикл
			Если Строка.Владелец = "ДоверительФЛ" Тогда
				ДоверительФЛ_Удостоверение = ПолучитьПредставлениеУдостоверение(Строка);
			КонецЕсли;
		КонецЦикла;
		
		СведенияДоверителя = Новый Структура("ИНН", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ДоверительЮЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		СведенияПодписанта = Новый Структура("ИНН",
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		
		СтруктураДанных.Вставить("ЗаголовокДолжность",
			?(ЗначениеЗаполнено(СтруктураДанных.ЛицоБезДовФЛ_Должность), НСтр("ru = 'Должность'"), ""));
		СтруктураДанных.Вставить("Должность", СтруктураДанных.ЛицоБезДовФЛ_Должность);
		СтруктураДанных.Вставить("ДоверительФИО", ДоверительФЛ_ФИО);
		СтруктураДанных.Вставить("ДоверительИНН", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_ИНН, СтруктураДанных.ДоверительФЛ_ИНН));
		СтруктураДанных.Вставить("ДоверительСНИЛС", 
			?(ЭтоДоверительЮрЛицо, СтруктураДанных.ЛицоБезДовФЛ_СНИЛС, СтруктураДанных.ДоверительФЛ_СНИЛС));
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Макет = Справочники.Доверенности.ПолучитьМакет("КарточкаМЧД");
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьШапкаПередоверие = Макет.ПолучитьОбласть("ОбластьШапкаПередоверие");
		
		ОбластьЗаголовокСведенияДоверителя = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияДоверителя");
		ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия");
		ОбластьЗаголовокСведенияОПредставителе = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителе");
		ОбластьЗаголовокСведенияОПредставителях = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителях");
		ОбластьЗаголовокСведенияОПредставителеФИО = Макет.ПолучитьОбласть("ОбластьЗаголовокСведенияОПредставителеФИО");
		ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия");
		ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия");
		
		ОбластьСведенияОбОрганизацииДоверителя = Макет.ПолучитьОбласть("ОбластьСведенияОбОрганизацииДоверителя");
		ОбластьСведенияОДоверителеИП = Макет.ПолучитьОбласть("ОбластьСведенияОДоверителеИП");
		ОбластьСведенияОПодписанте = Макет.ПолучитьОбласть("ОбластьСведенияОПодписанте");
		ОбластьСведенияОДоверенномЛице = Макет.ПолучитьОбласть("ОбластьСведенияОДоверенномЛице");
		ОбластьСведенияОПредставителеИП = Макет.ПолучитьОбласть("ОбластьСведенияОПредставителеИП");
		
		ОбластьПередовериеДоверительЮлЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительЮлЛицо");
		ОбластьПередовериеДоверительФизЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительФизЛицо");
		ОбластьПередовериеДоверительИП = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительИП");
		ОбластьПередовериеПолучательПолномочийФизЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательПолномочийФизЛицо");
		ОбластьПередовериеПолучательЮлЛицо = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательЮлЛицо");
		ОбластьПередовериеПолучательИП = Макет.ПолучитьОбласть("ОбластьПередовериеПолучательИП");
		ОбластьПередовериеДоверительФизЛицоЮЛ = Макет.ПолучитьОбласть("ОбластьПередовериеДоверительФизЛицоЮЛ");
		
		ОбластьЗаголовокПолномочия = Макет.ПолучитьОбласть("ОбластьЗаголовокПолномочия");
		ОбластьПереченьПолномочий = Макет.ПолучитьОбласть("ОбластьПереченьПолномочий");
		ОбластьПредставительОрганизация = Макет.ПолучитьОбласть("ОбластьПредставительОрганизация");
		ОбластьБезПраваПередоверия = Макет.ПолучитьОбласть("ОбластьБезПраваПередоверия");
		ОбластьСПравомПередоверия = Макет.ПолучитьОбласть("ОбластьСПравомПередоверия");
		ОбластьИндивидуальныеПолномочия =  Макет.ПолучитьОбласть("ОбластьИндивидуальныеПолномочия");
		ОбластьСовместныеПолномочия =  Макет.ПолучитьОбласть("ОбластьСовместныеПолномочия");
		ОбластьОднократногоПередоверия = Макет.ПолучитьОбласть("ОбластьОднократногоПередоверия");
		
		ОбластьОтступ = Макет.ПолучитьОбласть("ОбластьОтступ");
		ОбластьОтступЗаполнение = Макет.ПолучитьОбласть("ОбластьОтступЗаполнение");
		ОбластьДокументУдостоверяющийЛичность = Макет.ПолучитьОбласть("ОбластьДокументУдостоверяющийЛичность");
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
		ОбластьШапкаПередоверие.Параметры.Заполнить(СтруктураДанных);
		
		ОбластьСведенияОбОрганизацииДоверителя.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОДоверителеИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОПодписанте.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СтруктураДанных);
		ОбластьСведенияОПредставителеИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПредставительОрганизация.Параметры.Заполнить(СтруктураДанных);
		
		ОбластьПередовериеДоверительЮлЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительФизЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательЮлЛицо.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеПолучательИП.Параметры.Заполнить(СтруктураДанных);
		ОбластьПередовериеДоверительФизЛицоЮЛ.Параметры.Заполнить(СтруктураДанных);
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
			
		НесколькоПредставителей = СтруктураДанных.Представители.Количество() > 1;
	
		Если ЭтоПередоверие Тогда
			
			ТабличныйДокумент.Вывести(ОбластьШапкаПередоверие);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицоПередавшееПолномочия);
			
			Если (СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ЮЛ")
				Или (СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ИО") Тогда
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительЮлЛицо);
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительФизЛицоЮЛ);
			ИначеЕсли СтруктураДанных.Свойство("ТипДоверителяОсновнойДоверенности")
					И СтруктураДанных.ТипДоверителяОсновнойДоверенности = "ИП" Тогда
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительИП);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьПередовериеДоверительФизЛицо);
			КонецЕсли;
			
			Если Не ЭтоДоверительЮрЛицо И ЗначениеЗаполнено(ДоверительФЛ_Удостоверение) Тогда
				ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность = 
					ДоверительФЛ_Удостоверение;
				ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			
			Если НесколькоПредставителей Тогда 
				ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицаПолучившиеПолномочия);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьЗаголовокПередовериеЛицоПолучившееПолномочия);
			КонецЕсли;
			
			Для Каждого СведенияОПредставителе Из СтруктураДанных.Представители Цикл
				
				Если НесколькоПредставителей Тогда 
					ОбластьЗаголовокСведенияОПредставителеФИО.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителеФИО);
				КонецЕсли;
				
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ЮЛ"
					Или СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИО" Тогда
					
					ОбластьПередовериеПолучательЮлЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательЮлЛицо);
					
					ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательПолномочийФизЛицо);
					
				ИначеЕсли СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИП" Тогда
					ОбластьПередовериеПолучательИП.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательИП);
				Иначе
					ОбластьПередовериеПолучательПолномочийФизЛицо.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПередовериеПолучательПолномочийФизЛицо);
				КонецЕсли;
				
				Если СведенияОПредставителе.Свойство("ПредставлениеУдостоверения") Тогда 
					ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность =
						СведенияОПредставителе.ПредставлениеУдостоверения;
					ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
				КонецЕсли;
				
			КонецЦикла;
					
		Иначе
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияДоверителя);
			
			Если ЭтоДоверительЮрЛицо Тогда
				ТабличныйДокумент.Вывести(ОбластьСведенияОбОрганизацииДоверителя);
				ТабличныйДокумент.Вывести(ОбластьСведенияОПодписанте);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьСведенияОДоверителеИП);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			
			Если НесколькоПредставителей Тогда 
				ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителях);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителе);
			КонецЕсли;
			
			Для Каждого СведенияОПредставителе Из СтруктураДанных.Представители Цикл
				
				Если НесколькоПредставителей Тогда 
					ОбластьЗаголовокСведенияОПредставителеФИО.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьЗаголовокСведенияОПредставителеФИО);
				КонецЕсли;
				
				Если СведенияОПредставителе.ТипУполномоченногоПредставителя = "ЮЛ"
					ИЛИ СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИО" Тогда 
	
					ОбластьПредставительОрганизация.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьПредставительОрганизация);
	
					ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОДоверенномЛице);
	
				ИначеЕсли СведенияОПредставителе.ТипУполномоченногоПредставителя = "ИП" Тогда 
					ОбластьСведенияОПредставителеИП.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОПредставителеИП);
				Иначе
					ОбластьСведенияОДоверенномЛице.Параметры.Заполнить(СведенияОПредставителе);
					ТабличныйДокумент.Вывести(ОбластьСведенияОДоверенномЛице);
				КонецЕсли;
	
				Если СведенияОПредставителе.Свойство("ПредставлениеУдостоверения") Тогда 
					ОбластьДокументУдостоверяющийЛичность.Параметры.ДокументУдостоверяющийЛичность =
						СведенияОПредставителе.ПредставлениеУдостоверения;
					ТабличныйДокумент.Вывести(ОбластьДокументУдостоверяющийЛичность);
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Полномочия = ПолномочияДоверенности(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокПолномочия);
		Для Каждого СтрокаПолномочий Из Полномочия Цикл
			ОбластьПереченьПолномочий.Параметры.ПереченьПолномочий = СтрокаПолномочий;
			ТабличныйДокумент.Вывести(ОбластьПереченьПолномочий);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьОтступЗаполнение);
		
		Если СтруктураДанных.Свойство("ТипПередоверия") Тогда
			Если СтруктураДанных.ТипПередоверия = "1" Тогда
				ТабличныйДокумент.Вывести(ОбластьОднократногоПередоверия);
			ИначеЕсли СтруктураДанных.ТипПередоверия = "3" Тогда
				ТабличныйДокумент.Вывести(ОбластьСПравомПередоверия);
			Иначе
				ТабличныйДокумент.Вывести(ОбластьБезПраваПередоверия);
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураДанных.СовместныеПолномочия Тогда
			ТабличныйДокумент.Вывести(ОбластьСовместныеПолномочия);
		Иначе
			ТабличныйДокумент.Вывести(ОбластьИндивидуальныеПолномочия);
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
	КонецЕсли;
	
	РезультатФормирования.ПредставлениеДокумента = ТабличныйДокумент;
	РезультатФормирования.Успех = ТабличныйДокумент <> Неопределено;
	
	Возврат РезультатФормирования;
	
КонецФункции


#Область Загрузка_МЧД

// Возвращает данные, полученные из файла обмена в пилотном формате.
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - См. НовыеДанныеМЧД
//
Функция ДанныеИзФайлаОбменаВУтвержденномФормате(ДанныеXDTO)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Ложь, "", НовыеДанныеМЧД());
	ДанныеДоверенности = Результат.ДанныеДоверенности;
	
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');

	Документ = ДанныеXDTO.Документ;	
	СведенияДоверенности = Документ.СвДов;
		
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");
	СведенияОбИнформационнойСистеме = ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");		
	ДанныеДоверенности.Вставить("ВозможноПередоверие", ?(СведенияДоверенности.ПрПередов = "1", Истина, Ложь));
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	

	СведенияОДоверителе = Документ.СвДоверит[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипДовер);
	
	Если СведенияОДоверителе.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИО" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИнОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИПДовер;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛДовер;
	КонецЕсли;

	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрРФ);

		ЛицоБезДоверенности = СведенияДоверителя.ЛицоБезДов;
		СведенияПоФизическомуЛицу = ЛицоБезДоверенности.СвФЛ;
		СведенияОЮридическомЛице = ЛицоБезДоверенности.СвОрг;
		
		ОснованиеПолномочий = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "НаимДокПолн", "");
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ОснованиеПолномочий", ОснованиеПолномочий);
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ИННФЛ", "");		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", ИННФЛ);		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", СведенияПоФизическомуЛицу.СНИЛС);
		
		ДанныеДоверенности.Вставить(
			"ЛицоБезДовФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу.СведФЛ));
				
		ДатаРожд = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу.СведФЛ, "ДатаРожд", 
			'00010101', "Дата");		
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", ДатаРожд);
		Должность = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Должность", "");
		ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", Должность);		
		ЛицоБезДовЮЛ_НаимОрг = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "НаимОрг", "");		
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", ЛицоБезДовЮЛ_НаимОрг);
		ЛицоБезДовЮЛ_ИНН = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ИННЮЛ", "");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", ЛицоБезДовЮЛ_ИНН);
		ЛицоБезДовЮЛ_КПП = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "КПП", "");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", ЛицоБезДовЮЛ_КПП);
		ОГРН = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ОГРН", "");
		ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", ОГРН);

		ДобавитьСведенияОбУчастникеМЧД(
			СведенияОДоверителе.Подписант[0],
			"ДоверительРук",
			ДанныеДоверенности.ФИО); 

	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИО" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Истина);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИО);
		ИННЮЛ = ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННЮЛ", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ИННЮЛ);
		КПП = ЗначениеСвойстваXDTO(СведенияДоверителя, "КПП", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", СведенияДоверителя.СтрРег);
		НаимРегОрг = ЗначениеСвойстваXDTO(СведенияДоверителя, "НаимРегОрг", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", НаимРегОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", СведенияДоверителя.РегНомер);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрСтрРег);

		СведенияОРуководителеОбособленногоПодразделения = СведенияДоверителя.СвРукОП;
		СведенияПоФизическомуЛицу = СведенияОРуководителеОбособленногоПодразделения.СведФЛ;
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияОРуководителеОбособленногоПодразделения, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		МестоРожд = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "МестоРожд", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", МестоРожд);
		Пол = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Пол", 1);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));

	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));

		ДобавитьСведенияОбУчастникеМЧД(
			СведенияОДоверителе.Подписант[0],
			"ДоверительФЛ",
			ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвУпПред Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		
		СведенияОПредставителеМЧД = Новый Структура;
		Для Каждого СведенияОПредставителе Из СведенияОбУполномоченномПредставителе.СвПред Цикл
			
			СведенияФизЛица = ЗначениеСвойстваXDTO(СведенияОПредставителе, "СведФизЛ", Неопределено);
			СведенияЮрЛица = ЗначениеСвойстваXDTO(СведенияОПредставителе, "СвОрг", Неопределено);
			СведенияИП = ЗначениеСвойстваXDTO(СведенияОПредставителе, "СведИП", Неопределено);
			
			Если СведенияЮрЛица <> Неопределено 
				Или СведенияИП <> Неопределено Тогда
					СведенияОПредставителеМЧД = 
						ЗаполнитьСведенияОПредставителеМЧД(СведенияОПредставителе, ТипУполномоченногоПредставителя);
			КонецЕсли;
			
			ДобавляемыеСведенияОПредставителе = Новый Структура;
			Если СведенияФизЛица <> Неопределено Тогда
				ДобавляемыеСведенияОПредставителе =	ЗаполнитьСведенияОПредставителеМЧД(СведенияОПредставителе, "ФЛ");
				ДобавляемыеСведенияОПредставителе.ТипУполномоченногоПредставителя = ТипУполномоченногоПредставителя;
			КонецЕсли;
			
			РаботаСКоллекциями.ДополнитьСтруктуру(
				СведенияОПредставителеМЧД, ДобавляемыеСведенияОПредставителе, Ложь);
			
		КонецЦикла;
		
		ДанныеДоверенности.Представители.Добавить(СведенияОПредставителеМЧД);
		
	КонецЦикла;
	
	Полномочия = Документ.СвПолн;
	
	Для Каждого Полномочие Из Полномочия Цикл
		
		СведенияОПолномочиях = НовыеПолномочияПредставителя();
		СведенияОПолномочиях.Код = ЗначениеСвойстваXDTO(Полномочие, "КодПолн", "");
		СведенияОПолномочиях.Описание = ЗначениеСвойстваXDTO(Полномочие, "ТекстПолн", "");
		СведенияОПолномочиях.Содержание = ЗначениеСвойстваXDTO(Полномочие, "СодержПолн", "");
		СведенияОПолномочиях.Пояснение = ЗначениеСвойстваXDTO(Полномочие, "ДопТекстПолн", "");
		ДанныеДоверенности.Полномочия.Добавить(СведенияОПолномочиях);
		
	КонецЦикла;
	
	Результат.Успех = Истина;
	Возврат Результат; 

КонецФункции

// Возвращает данные, полученные из файла обмена в формате версии 002
// 
// Параметры:
//  ВходящиеДанные - ДвоичныеДанные, Строка - Двоичные данные файла обмена или путь к ним.
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * ТекстОшибки - Строка
//  * ДанныеДоверенности - См. НовыеДанныеМЧД
//
Функция ДанныеИзФайлаОбменаВУтвержденномФорматеВерсия002(ДанныеXDTO)
	
	Результат = Новый Структура("Успех, ТекстОшибки, ДанныеДоверенности", Ложь, "", НовыеДанныеМЧД());
	ДанныеДоверенности = Результат.ДанныеДоверенности;
	
	ДанныеДоверенности.Вставить("ДатаЗагрузкиИзРеестра", '00010101');
	
	Документ = ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Довер");

	ЭтоПередоверие = Ложь;
	Если ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Передов") <> Неопределено Тогда
		Документ = ЗначениеСвойстваXDTO(ДанныеXDTO.Документ, "Передов"); 
		ЭтоПередоверие = Истина;
	КонецЕсли;

	ДанныеДоверенности.Вставить("ЭтоПередоверие", ЭтоПередоверие);
	
	Если ЭтоПередоверие Тогда
		ЗаполнитьПередовериеПоФормату002(ДанныеДоверенности, Документ);
	Иначе
		ЗаполнитьДовериеПоФормату002(ДанныеДоверенности, Документ);
	КонецЕсли;
	
	Результат.Успех = Истина;
	Возврат Результат; 

КонецФункции

// Формирует пустую структуру описания полномочия представителя МЧД.
// 
// Возвращаемое значение:
//  Структура:
//	  * Код - Строка
//	  * Описание - Строка
//	  * Содержание - Строка
//	  * Пояснение - Строка
// 
Функция НовыеПолномочияПредставителя()
	
	Результат = Новый Структура();
	Результат.Вставить("Код", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("Содержание", "");
	Результат.Вставить("Пояснение", "");
	
	Возврат Результат;
	
КонецФункции

// Заполняет данные о полномочиях МЧД
//
// Параметры:
//  ДанныеДоверенности - см. НовыеДанныеМЧД
//  Полномочия - СписокXDTO
//
Процедура ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия)
	
	Для Каждого Полномочие Из Полномочия Цикл 
		
		КодПолномочий = ЗначениеСвойстваXDTO(Полномочие, "КодПолн", "");
		ОписаниеПолномочий = ЗначениеСвойстваXDTO(Полномочие, "ТекстПолн", "");
		СодержаниеПолномочий = ЗначениеСвойстваXDTO(Полномочие, "СодержПолн", "");
		ПояснениеПолномочий = ЗначениеСвойстваXDTO(Полномочие, "ДопТекстПолн", "");
		
		СведенияОПолномочиях = НовыеПолномочияПредставителя();
		СведенияОПолномочиях.Код = КодПолномочий;
		СведенияОПолномочиях.Описание = ОписаниеПолномочий;
		СведенияОПолномочиях.Содержание = СодержаниеПолномочий;
		СведенияОПолномочиях.Пояснение = ПояснениеПолномочий; 
		ДанныеДоверенности.Полномочия.Добавить(СведенияОПолномочиях);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает гражданство участника МЧД.
// 
// Параметры:
//  СведенияПоФизическомуЛицу - ОбъектXDTO
// 
// Возвращаемое значение:
//  СправочникСсылка.СтраныМира
//  
Функция ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу)
	
	Гражданство = Справочники.СтраныМира.ПустаяСсылка();
	ПризнакГражданства = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ПрГражд", "");
	
	Если ПризнакГражданства = "1" Тогда
		
		Гражданство = Справочники.СтраныМира.Россия;
		
	ИначеЕсли ПризнакГражданства = "2" Тогда
		
		КодСтраны = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Гражданство", "");
		Гражданство = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
		
	КонецЕсли;
	
	Возврат Гражданство;
	
КонецФункции

// Добавляет сведения об участнике МЧД в коллекцию.
// 
// Параметры:
//  ФИО - ОбъектXDTO
//  ТипУчастника - Строка 
//  МассивУчастников - Массив из Структура:
//  * Фамилия - Строка
//  * Имя - Строка
//  * Отчество - Строка
//  * Владелец - Строка
Процедура ДобавитьСведенияОбУчастникеМЧД(ФИО, ТипУчастника, МассивУчастников)
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Фамилия", ЗначениеСвойстваXDTO(ФИО, "Фамилия", ""));
	НоваяСтрока.Вставить("Имя", ЗначениеСвойстваXDTO(ФИО, "Имя", ""));
	НоваяСтрока.Вставить("Отчество", ЗначениеСвойстваXDTO(ФИО, "Отчество", ""));
	НоваяСтрока.Вставить("Владелец", ТипУчастника);
	МассивУчастников.Добавить(НоваяСтрока);
			
КонецПроцедуры 

//	Заполняет сведения о представителе с соблюдением формата МЧД версий 001, 002 и пилотной.
//	Состав ключей зависит от типа представителя.
//
// Параметры:
//  СведенияОбУполномоченномПредставителе - ОбъектXDTO
//  ТипУполномоченногоПредставителя - Строка
//  
// Возвращаемое значение:
//  Структура:
//	* ПредставительЮЛ_НаимОрг - Строка
//	* ПредставительЮЛ_ИНН - Строка
//	* ПредставительЮЛ_КПП - Строка
//	* ПредставительЮЛ_ОГРН - Строка
//	* ПредставительФЛ_ИНН - Строка
//	* ПредставительФЛ_ОГРН - Строка
//	* ПредставительФЛ_СНИЛС - Строка
//	* ПредставительФЛ_Гражданство - СправочникСсылка.СтраныМира
//	* ПредставительФЛ_ДатаРождения - Дата
//	* ПредставительФИО - Строка
//	* Представитель - Неопределено
//					- ОпределяемыйТип.Организация
//					- ОпределяемыйТип.КонтрагентБЭД
//					- ОпределяемыйТип.ФизическоеЛицо
//	* Фамилия - Строка
//	* Имя - Строка
//	* Отчество - Строка
//	* УдостоверениеЛичности - см. НовыеДанныеУдостоверенияЛичности
//	* ТипУполномоченногоПредставителя - Строка
//
Функция ЗаполнитьСведенияОПредставителеМЧД(СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя)
	
	Представитель = Новый Структура;
	Представитель.Вставить("ТипУполномоченногоПредставителя", ТипУполномоченногоПредставителя);

	Если ТипУполномоченногоПредставителя  = "ЮЛ" Тогда
		
		СведенияОрганизации = 
			ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СвОрг.СвОрг", "");
			
		Если ПустаяСтрока(СведенияОрганизации) Тогда
			СведенияОрганизации = 
				ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СвОрг", "");
		КонецЕсли;

		Представитель.Вставить("ПредставительЮЛ_НаимОрг", СведенияОрганизации.НаимОрг);
		Представитель.Вставить("ПредставительЮЛ_ИНН", СведенияОрганизации.ИННЮЛ);
		Представитель.Вставить("ПредставительЮЛ_КПП", СведенияОрганизации.КПП);
		ОГРН = ЗначениеСвойстваXDTO(СведенияОрганизации, "ОГРН", "");
		Представитель.Вставить("ПредставительЮЛ_ОГРН", ОГРН);
		
		СведенияФизЛица = 
			ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СвОрг.СвФЛ", "");
			
		Если ПустаяСтрока(СведенияФизЛица) Тогда
			СведенияФизЛица = 
				ЗначениеСвойстваXDTO(СведенияОбУполномоченномПредставителе, "СведФизЛ", "");
		Иначе
			СведенияФизЛица = СведенияФизЛица[0];
		КонецЕсли;
		
		Если Не ПустаяСтрока(СведенияФизЛица) Тогда
			
			Представитель.Вставить("ПредставительФЛ_ИНН", СведенияФизЛица.ИННФЛ);
			Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияФизЛица.СНИЛС);
			
			СведенияПоФизическомуЛицу = СведенияФизЛица.СведФЛ;
			Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
			Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
			
			Представитель.Вставить("Фамилия", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Фамилия", ""));
			Представитель.Вставить("Имя", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Имя", ""));
			Представитель.Вставить("Отчество", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Отчество", ""));
			
			ФИО = ФИОСтрокой(Представитель);
			Представитель.Вставить("ПредставительФИО", ФИО);
			
		КонецЕсли;
		
	ИначеЕсли ТипУполномоченногоПредставителя = "ИП" Тогда
		
		СведенияИП = СведенияОбУполномоченномПредставителе.СведИП;
		Представитель.Вставить("ПредставительЮЛ_НаимОрг", СведенияИП.НаимИП);
		Представитель.Вставить("ПредставительЮЛ_ИНН", СведенияИП.ИННФЛ);
		Представитель.Вставить("ПредставительЮЛ_ОГРН", СведенияИП.ОГРНИП);
		
		Представитель.Вставить("Фамилия", ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Фамилия", ""));
		Представитель.Вставить("Имя", ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Имя", ""));
		Представитель.Вставить("Отчество", ЗначениеСвойстваXDTO(СведенияИП.ФИО, "Отчество", ""));
		
		ФИО = ФИОСтрокой(Представитель);
		Представитель.Вставить("ПредставительФИО", ФИО);
		
		СведенияПоФизическомуЛицу = СведенияИП.СведФЛ;
		Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияИП.СНИЛС);
		
	ИначеЕсли ТипУполномоченногоПредставителя = "ФЛ" Тогда
		
		СведенияФизЛица = СведенияОбУполномоченномПредставителе.СведФизЛ;
		
		Представитель.Вставить("ПредставительФЛ_ИНН", СведенияФизЛица.ИННФЛ);
		Представитель.Вставить("ПредставительФЛ_СНИЛС", СведенияФизЛица.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияФизЛица.СведФЛ;
		Представитель.Вставить("ПредставительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		Представитель.Вставить("ПредставительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
		Представитель.Вставить("Фамилия", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Фамилия", ""));
		Представитель.Вставить("Имя", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Имя", ""));
		Представитель.Вставить("Отчество", ЗначениеСвойстваXDTO(СведенияФизЛица.ФИО, "Отчество", ""));
		
		ФИО = ФИОСтрокой(Представитель);
		Представитель.Вставить("ПредставительФИО", ФИО);

	КонецЕсли;
		
	УдостоверениеЛичности = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "УдЛичнФЛ", Неопределено);
	Если УдостоверениеЛичности <> Неопределено Тогда
		
		ДатаДок = ЗначениеСвойстваXDTO(УдостоверениеЛичности, "ДатаДок", '00010101');
		ВыдДок = ЗначениеСвойстваXDTO(УдостоверениеЛичности, "ВыдДок", "");
		Номер = УдостоверениеЛичности.СерНомДок;
		Серия = "";
		СерияНомерДокумента = СтрРазделить(СокрЛП(УдостоверениеЛичности.СерНомДок), " ", Ложь);
		
		Если СерияНомерДокумента.Количество() > 1 Тогда
			Номер = СерияНомерДокумента[СерияНомерДокумента.Количество() - 1];
			Серия = СокрЛП(СтрЗаменить(УдостоверениеЛичности.СерНомДок, Номер, ""));
		КонецЕсли;
		
		ДанныеУдостоверенияЛичности = НовыеДанныеУдостоверенияЛичности();
		ДанныеУдостоверенияЛичности.СерДок = Серия;
		ДанныеУдостоверенияЛичности.НомДок = Номер;
		ДанныеУдостоверенияЛичности.ДатаДок = ДатаДок;
		ДанныеУдостоверенияЛичности.ВыдДок = ВыдДок;
		ДанныеУдостоверенияЛичности.ВидДок = УдостоверениеЛичности.КодВидДок;
		ДанныеУдостоверенияЛичности.КодВыдДок = УдостоверениеЛичности.КодВыдДок;
		
		Представитель.Вставить("УдостоверениеЛичности", ДанныеУдостоверенияЛичности);
		
		ПредставлениеУдостоверения = 
			ПолучитьПредставлениеУдостоверение(ДанныеУдостоверенияЛичности);
		
		Представитель.Вставить("ПредставлениеУдостоверения", ПредставлениеУдостоверения);
	
	КонецЕсли;
	
	Возврат Представитель;
	
КонецФункции

// Возвращает данные, полученные из файла обмена доверенности в формате 002
// 
// Параметры:
//  ДанныеДоверенности - См. НовыеДанныеМЧД
//  Документ - Произвольный
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
//
Процедура ЗаполнитьДовериеПоФормату002(ДанныеДоверенности, Документ)
	
	СведенияДоверенности = Документ.СвДов;
	
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");
	СведенияОбИнформационнойСистеме = ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", "");		
	ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", "");
	ДанныеДоверенности.Вставить("ТипПередоверия", СведенияДоверенности.ПрПередов);
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	
	ДанныеДоверенности.Вставить("СовместныеПолномочия", ?(СведенияДоверенности.ПрСовмПолн = "2", Истина, Ложь));
	
	СведенияОДоверителе = Документ.СвДоверит[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипДовер);
	
	Если СведенияОДоверителе.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргДовер.СвРосОрг;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИО" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИнОргДовер;
	ИначеЕсли СведенияОДоверителе.ТипДовер = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИПДовер;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛДовер;
	КонецЕсли;
	
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ЛицоБезДоверенности = СведенияОДоверителе.РосОргДовер.ЛицоБезДов;
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрРФ);
		
		СведенияПоФизическомуЛицу = ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвФЛ");		
		Если СведенияПоФизическомуЛицу <> Неопределено Тогда
			
			ИННФЛ = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "ИННФЛ", "");		
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ИНН", ИННФЛ);		
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_СНИЛС", СведенияПоФизическомуЛицу.СНИЛС);
			
			ДанныеДоверенности.Вставить(
				"ЛицоБезДовФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу.СведФЛ));
			
			ДатаРожд = 
				ЗначениеСвойстваXDTO(
					СведенияПоФизическомуЛицу.СведФЛ, "ДатаРожд", '00010101', "Дата");
			
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ДатаРождения", ДатаРожд);
			Должность = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Должность", "");
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_Должность", Должность);
			
			ОснованиеПолномочий = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "НаимДокПолн", "");
			ДанныеДоверенности.Вставить("ЛицоБезДовФЛ_ОснованиеПолномочий", ОснованиеПолномочий);
			
		КонецЕсли;
		
		СведенияОЮридическомЛице = ЗначениеСвойстваXDTO(ЛицоБезДоверенности, "СвОрг");
		Если СведенияОЮридическомЛице <> Неопределено Тогда
			ЛицоБезДовЮЛ_НаимОрг = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "НаимОрг", "");		
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_НаимОрг", ЛицоБезДовЮЛ_НаимОрг);
			ЛицоБезДовЮЛ_ИНН = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ИННЮЛ", "");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ИНН", ЛицоБезДовЮЛ_ИНН);
			ЛицоБезДовЮЛ_КПП = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "КПП", "");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_КПП", ЛицоБезДовЮЛ_КПП);
			ОГРН = ЗначениеСвойстваXDTO(СведенияОЮридическомЛице, "ОГРН", "");
			ДанныеДоверенности.Вставить("ЛицоБезДовЮЛ_ОГРН", ОГРН);
		КонецЕсли;
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		"ДоверительРук",
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИО" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИностраннаяОрганизация", Истина);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИО);
		ИННЮЛ = ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННЮЛ", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", ИННЮЛ);
		КПП = ЗначениеСвойстваXDTO(СведенияДоверителя, "КПП", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_СтрРег", СведенияДоверителя.СтрРег);
		НаимРегОрг = ЗначениеСвойстваXDTO(СведенияДоверителя, "НаимРегОрг", "");
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимРегОрг", НаимРегОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_РегНомер", СведенияДоверителя.РегНомер);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", СведенияДоверителя.АдрСтрРег);
		
		СведенияОРуководителеОбособленногоПодразделения = СведенияДоверителя.СвРукОП;
		СведенияПоФизическомуЛицу = СведенияОРуководителеОбособленногоПодразделения.СведФЛ;
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияОРуководителеОбособленногоПодразделения, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		МестоРожд = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "МестоРожд", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_МестоРожд", МестоРожд);
		Пол = ЗначениеСвойстваXDTO(СведенияПоФизическомуЛицу, "Пол", 1);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Пол", Пол);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;		
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		"ДоверительФЛ",
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвУпПред Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		ДанныеДоверенности.Представители.Добавить(ЗаполнитьСведенияОПредставителеМЧД(
			СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя));
		
	КонецЦикла;
		
	Полномочия = Документ.СвПолн;
	ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия);
	
КонецПроцедуры

// Возвращает данные, полученные из файла обмена передоверия в формате 002
// 
// Параметры:
//  ДанныеДоверенности - См. НовыеДанныеМЧД
//  Документ - Произвольный
//  ЭтоДоверенностьОрганизации - Неопределено, Булево - Признак что данные относятся к МЧД организации,
//  								при установке Неопределено будет произведен поиск в организациях и контрагентах.
//
Процедура ЗаполнитьПередовериеПоФормату002(ДанныеДоверенности, Документ)
	
	СведенияДоверенности = Документ.СвДовПер.СвПереДовер;
	
	ДанныеДоверенности.Вставить("НомерДоверенности", СведенияДоверенности.НомДовер);
	ДанныеДоверенности.Вставить("ДатаВыдачи", СведенияДоверенности.ДатаВыдДовер);
	ДанныеДоверенности.Вставить("ДатаОкончания", СведенияДоверенности.ДатаКонДовер);
	ДанныеДоверенности.Вставить("СрокДействия", "");

	СведенияОбИнформационнойСистеме = ЗначениеСвойстваXDTO(СведенияДоверенности, "СведСистОтм", "");	
	ДанныеДоверенности.Вставить("СведенияОбИнформационнойСистеме", СведенияОбИнформационнойСистеме);	

	НомерРодительскойДоверенности = ЗначениеСвойстваXDTO(Документ, "СвДовПер.НомДоверN", "");	// АПК:216 не проверяем смесь латиницы и кириллицы для НомДоверN
	ДанныеДоверенности.Вставить("НомерРодительскойДоверенности", НомерРодительскойДоверенности);	
	ДанныеДоверенности.Вставить("ТипПередоверия", СведенияДоверенности.ПрПередов);
	ДанныеДоверенности.Вставить("УтратаПолномочийПриПередоверии", ?(СведенияДоверенности.ПрУтрПолн = "1", Истина, Ложь));
	ДанныеДоверенности.Вставить("СовместныеПолномочия", ?(СведенияДоверенности.ПрСовмПолн = "2", Истина, Ложь));
	ДанныеДоверенности.Вставить("ФИО", Новый Массив);
	ДанныеДоверенности.Вставить("УдостоверенияЛичности", Новый Массив);	
	
	СведенияОбОсновнойДоверенности = Документ.СвДовПер.СвОснДовер;
	СведенияОДоверителеОсновнойДоверенности = СведенияОбОсновнойДоверенности.СвДовер0[0];
	ДанныеДоверенности.НомерОсновнойДоверенности = СведенияОбОсновнойДоверенности.НомДовер0;
	ДанныеДоверенности.НомерРодительскойДоверенности = ДанныеДоверенности.НомерОсновнойДоверенности;
	ДанныеДоверенности.Вставить("ТипДоверителяОсновнойДоверенности", СведенияОДоверителеОсновнойДоверенности.ТипДовер);
	
	Если СведенияОДоверителеОсновнойДоверенности.ТипДовер = "ЮЛ" Тогда
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.РосОргДовер;
	ИначеЕсли СведенияОДоверителеОсновнойДоверенности.ТипДовер = "ИП" Тогда
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.ИПДовер;
	Иначе
		СведенияДоверителяОсновнойДоверенности = СведенияОДоверителеОсновнойДоверенности.ФЛДовер;
	КонецЕсли;
	
	Если ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ЮЛ" Тогда
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", СведенияДоверителяОсновнойДоверенности.ИННЮЛ);
		ДанныеДоверенности.КППДоверителяРодительскойДоверенности = СведенияДоверителяОсновнойДоверенности.КПП;
	ИначеЕсли ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ИП" Тогда
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", СведенияДоверителяОсновнойДоверенности.ИННФЛ);
	ИначеЕсли ДанныеДоверенности.ТипДоверителяОсновнойДоверенности = "ФЛ" Тогда
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияДоверителяОсновнойДоверенности, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ИННДоверителяРодительскойДоверенности", ИННФЛ);
	КонецЕсли;
	
	СведенияОДоверителе = Документ.СвЛицПередПолн[0];
	ДанныеДоверенности.Вставить("ТипОрганизации", СведенияОДоверителе.ТипЛицПрдПолн);
	
	Если СведенияОДоверителе.ТипЛицПрдПолн = "ЮЛ" Тогда
		СведенияДоверителя = СведенияОДоверителе.РосОргПрдПолн;
	ИначеЕсли СведенияОДоверителе.ТипЛицПрдПолн = "ИП" Тогда
		СведенияДоверителя = СведенияОДоверителе.ИППрдПолн;
	Иначе
		СведенияДоверителя = СведенияОДоверителе.ФЛПрдПолн;
	КонецЕсли;
	
	Если ДанныеДоверенности.ТипОрганизации = "ЮЛ" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимОрг);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ИНН", СведенияДоверителя.ИННЮЛ);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_КПП", СведенияДоверителя.КПП);
		ДанныеДоверенности.Вставить("ДоверительЮЛ_ОГРН", СведенияДоверителя.ОГРН);
		
		АдрРег = СведенияДоверителя.АдрРег;
		Если АдрРег <> Неопределено Тогда
			ДанныеДоверенности.Вставить("ДоверительЮЛ_Адр", АдрРег.АдрРФ);
		КонецЕсли;
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		"ДоверительРук",
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ИП" Тогда
		
		ДанныеДоверенности.Вставить("ДоверительЮЛ_НаимОрг", СведенияДоверителя.НаимИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", СведенияДоверителя.ИННФЛ);
		ДанныеДоверенности.Вставить("ДоверительФЛ_ОГРН", СведенияДоверителя.ОГРНИП);
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СведенияДоверителя.СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;		
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		
		ДобавитьСведенияОбУчастникеМЧД(
		СведенияОДоверителе.Подписант,
		"ДоверительФЛ",
		ДанныеДоверенности.ФИО); 
		
	ИначеЕсли ДанныеДоверенности.ТипОрганизации = "ФЛ" Тогда
		
		ИННФЛ = ЗначениеСвойстваXDTO(СведенияДоверителя, "ИННФЛ", "");
		ДанныеДоверенности.Вставить("ДоверительФЛ_ИНН", ИННФЛ);
		СНИЛС = ЗначениеСвойстваXDTO(СведенияДоверителя, "СНИЛС", "");		
		ДанныеДоверенности.Вставить("ДоверительФЛ_СНИЛС", СНИЛС);
		
		СведенияПоФизическомуЛицу = СведенияДоверителя.СведФЛ;
		ДанныеДоверенности.Вставить("ДоверительФЛ_Гражданство", ГражданствоУчастникаМЧД(СведенияПоФизическомуЛицу));
		ДанныеДоверенности.Вставить("ДоверительФЛ_ДатаРождения", СведенияПоФизическомуЛицу.ДатаРожд);
		
	КонецЕсли;
	
	Для Каждого СведенияОбУполномоченномПредставителе Из Документ.СвЛицПолучПолн Цикл
		
		ТипУполномоченногоПредставителя = СведенияОбУполномоченномПредставителе.ТипПред;
		ДанныеДоверенности.Представители.Добавить(ЗаполнитьСведенияОПредставителеМЧД(
			СведенияОбУполномоченномПредставителе, ТипУполномоченногоПредставителя));
		
	КонецЦикла;
	
	Полномочия = Документ.СвПолн;
	ЗаполнитьПолномочия(ДанныеДоверенности, Полномочия);
	
КонецПроцедуры

// Возвращает массив со строками полномочий доверенности
// 
// Параметры:
//  ДанныеДоверенности - см. НовыеДанныеМЧД
// 
// Возвращаемое значение:
//  Массив из Строка
//  
Функция ПолномочияДоверенности(ДанныеДоверенности)
	
	КодыПолномочий = Новый Массив;
	ТекстыПолномочий = Новый Массив;
	
	Для Каждого Полномочие Из ДанныеДоверенности.Полномочия Цикл
		
		МассивПолей = Новый Массив;
		
		Для Каждого КлючИЗначение Из Полномочие Цикл
			
			Если КлючИЗначение.Ключ <> "Код" И НЕ ПустаяСтрока(КлючИЗначение.Значение) Тогда
				МассивПолей.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Полномочие.Код) И Полномочие.Код <> "99" Тогда
			
			Если МассивПолей.Количество() = 0 Тогда
				КодыПолномочий.Добавить(Полномочие.Код);
			Иначе
				МассивПолей.Вставить(0, Полномочие.Код);
			КонецЕсли;
				
		КонецЕсли;
		
		Если МассивПолей.Количество() > 0 Тогда
			ТекстыПолномочий.Добавить(СтрСоединить(МассивПолей, "; "));
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиПолномочий = Новый Массив();
	
	Если КодыПолномочий.Количество() > 0 Тогда
		СтрокиПолномочий.Добавить(НСтр("ru = 'Коды полномочий:'") + " " + СтрСоединить(КодыПолномочий, ", "));
	КонецЕсли;
	
	Если ТекстыПолномочий.Количество() > 0 Тогда
		
		Если ТекстыПолномочий.Количество() = 1 Тогда
			СтрокиПолномочий.Добавить(ТекстыПолномочий[0]);
		Иначе
			Для Счетчик = 1 По ТекстыПолномочий.Количество() Цикл
				Индекс = Счетчик-1;
				СтрокаПолномочий = СтрШаблон("%1. %2", Счетчик, ТекстыПолномочий[Индекс]);
				СтрокиПолномочий.Добавить(СтрокаПолномочий);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокиПолномочий;
	
КонецФункции

#КонецОбласти

#Область БазовыйФункционалDOM

// ФИОСтрокой.
// 
// Параметры:
//  ФИОИлиФамилия - Строка - Фамилия
//                - Структура, ОбъектXDTO - объект, владеющий свойствами Фамилия, Имя, Отчество
//  Имя - Строка
//  Отчество - Строка
// 
// Варианты вызова:
//  ФИОСтрокой(ФИО) - передается объект, владеющий свойствами Фамилия, Имя и/или Отчество
//  ФИОСтрокой(Фамилия, Имя) - формирование имени без отчества
//  ФИОСтрокой(Фамилия, Имя, Отчество) - формировании полного имени, если в Отчество пустое значение, то будет
//                                       сформирован второй вариант.
// 
// Возвращаемое значение:
//  Строка - строка вида "[Фамилия] [Имя] [Отчество]" или "[Фамилия] [Имя]" при отсутствии отчества
Функция ФИОСтрокой(ФИОИлиФамилия, Имя = "", Отчество = "")
	ФИО = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	Если ТипЗнч(ФИОИлиФамилия) = Тип("Строка") Тогда
		ФИО.Фамилия = ФИОИлиФамилия;
		ФИО.Имя = Имя;
		ФИО.Отчество = Отчество;
	Иначе
		ЗаполнитьЗначенияСвойств(ФИО, ФИОИлиФамилия);
	КонецЕсли;
	Шаблон = "[Фамилия] [Имя] [Отчество]";
	Если ПустаяСтрока(СокрЛП(ФИО.Отчество)) Тогда
		Шаблон = "[Фамилия] [Имя]";
	КонецЕсли;
	Возврат РаботаСоСтрокамиКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ФИО);
КонецФункции

#КонецОбласти

Функция ПолучитьПрисоединенныйФайлМЧД(Доверенность, Идентификатор) Экспорт

	ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(Доверенность);
	ИмяАрхива = СтрШаблон("Доверенность_%1.zip", СокрЛП(Идентификатор));
	
	ФайлДоверенности = Неопределено;
	
	Для каждого ДанныеФайла Из ДанныеФайлов Цикл
		Если ДанныеФайла.Наименование + "." + ДанныеФайла.Расширение = ИмяАрхива Тогда
			ФайлДоверенности = РаботаСФайловымХранилищем.ПолучитьФайл(ДанныеФайла.ИдентификаторФайла);
			ФайлДоверенности.Вставить("ИдентификаторФайла", ДанныеФайла.ИдентификаторФайла);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФайлДоверенности;

КонецФункции

Функция ТребуетсяПерезаполнениеМЧД(ФайлДоверенности, ФайлыМЧД) Экспорт

	КаталогВременныхФайлов = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов() + Новый УникальныйИдентификатор + "\";
		
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДоверенности.Адрес);
	ЧтениеZip = Новый ЧтениеZipФайла(ДвоичныеДанные.ОткрытьПотокДляЧтения());
	ЧтениеZip.ИзвлечьВсе(КаталогВременныхФайлов);
	ЧтениеZip.Закрыть();
	
	ДанныеДоверенности = Неопределено;
	ДанныеПодписи = Неопределено;
	
	ФайлыАрхива = НайтиФайлы(КаталогВременныхФайлов, ПолучитьМаскуВсеФайлы());
	
	Для каждого ФайлАрхива Из ФайлыАрхива Цикл
		Если НРег(ФайлАрхива.Расширение) = ".xml" Тогда
			ДанныеДоверенности = Новый ДвоичныеДанные(ФайлАрхива.ПолноеИмя);
		Иначе
			ДанныеПодписи = Новый ДвоичныеДанные(ФайлАрхива.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьФайлы(КаталогВременныхФайлов);
	
	ИзменилсяФайлМЧД = (ДанныеДоверенности <> ПолучитьИзВременногоХранилища(ФайлыМЧД.Доверенность.Хранение));;
	ИзмениласьЭлектроннаяПодпись = (ДанныеПодписи <> ПолучитьИзВременногоХранилища(ФайлыМЧД.Подпись.Хранение));
	
	ТребуетсяПерезаполнение = ИзменилсяФайлМЧД Или ИзмениласьЭлектроннаяПодпись;
	Возврат ТребуетсяПерезаполнение;

КонецФункции

#Область Чтение_файла_доверенсти

Функция ПолучитьДанныеДоверенности(Адрес) Экспорт

	РезультатЧтения = Новый Структура;
	РезультатЧтения.Вставить("ДанныеМЧД", НовыеДанныеМЧДДляЗагрузки());
	РезультатЧтения.Вставить("ТекстОшибки", "");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ОбъектXDTO = РаботаСМашиночитаемымиДоверенностями.ОбъектXDTOМЧД(ДвоичныеДанные);
	
	Если ЗначениеЗаполнено(ОбъектXDTO.ТекстОшибки) Тогда
		РезультатЧтения.ТекстОшибки = ОбъектXDTO.ТекстОшибки;
	Иначе
		
		ВерсияФормата = РаботаСМашиночитаемымиДоверенностями.ВерсияФорматаОбъектаМЧД(ОбъектXDTO.ОбъектМЧД);
		РезультатЧтения.ДанныеМЧД.ВерсияФормата = ВерсияФормата;
		Если ВерсияФормата = РаботаСМашиночитаемымиДоверенностями.ФорматМЧД_003() Тогда
			
			ЗаполнитьДанныеМЧД003(РезультатЧтения.ДанныеМЧД, ОбъектXDTO.ОбъектМЧД.Документ);
			
		Иначе
			
			ДанныеДляЗаполненияМЧД = РаботаСМашиночитаемымиДоверенностями.ДанныеДляЗаполненияМЧД(ОбъектXDTO.ОбъектМЧД);
			ДанныеДоверенности = ДанныеДляЗаполненияМЧД.ДанныеДоверенности;
			РезультатЧтения.ДанныеМЧД.ДатаНачалаДействия = ДанныеДоверенности.ДатаВыдачи;
			РезультатЧтения.ДанныеМЧД.ДатаОкончанияДействия = ДанныеДоверенности.ДатаОкончания;
			РезультатЧтения.ДанныеМЧД.ИдентификаторДоверенности = ДанныеДоверенности.НомерДоверенности;
			РезультатЧтения.ДанныеМЧД.ИнформационнаяСистема = ДанныеДоверенности.СведенияОбИнформационнойСистеме;
			РезультатЧтения.ДанныеМЧД.Номер = ОбъектXDTO.ОбъектМЧД.Документ.Довер.СвДов.ВнНомДовер;
			
			СведенияОДоверителе = ОбъектXDTO.ОбъектМЧД.Документ.Довер.СвДоверит[0];
			Если СведенияОДоверителе.ТипДовер = "ЮЛ"
				Или СведенияОДоверителе.ТипДовер = "ИО" Тогда
				Наименование = ДанныеДоверенности.ДоверительЮЛ_НаимОрг;
				ИНН = ДанныеДоверенности.ДоверительЮЛ_ИНН;
				КПП = ДанныеДоверенности.ДоверительЮЛ_КПП;
				РезультатЧтения.ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				РезультатЧтения.ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				РезультатЧтения.ДанныеМЧД.ДоверительИННЮЛ = ИНН;
				
				Если СведенияОДоверителе.ТипДовер = "ЮЛ" Тогда
					РезультатЧтения.ДанныеМЧД.ДоверительИННФЛ = ДанныеДоверенности.ЛицоБезДовФЛ_ИНН;
				Иначе
					РезультатЧтения.ДанныеМЧД.ДоверительИННФЛ = ДанныеДоверенности.ДоверительФЛ_ИНН;
				КонецЕсли;
				
			ИначеЕсли СведенияОДоверителе.ТипДовер = "ИП" Тогда
				
				Наименование = ДанныеДоверенности.ДоверительЮЛ_НаимОрг;
				ИНН = ДанныеДоверенности.ДоверительФЛ_ИНН;
				РезультатЧтения.ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. ИНН: %2", Наименование, ИНН);
				РезультатЧтения.ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				РезультатЧтения.ДанныеМЧД.ДоверительИННФЛ = ИНН;
				РезультатЧтения.ДанныеМЧД.ДоверительИННЮЛ = ДанныеДоверенности.ДоверительЮЛ_ИНН;
				
			Иначе
				
				ФИО = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДанныеДоверенности.СведенияДоверителя, "ФИО", "");
				ИНН = ДанныеДоверенности.ДоверительФЛ_ИНН;
				ДатаРождения = ДанныеДоверенности.ДоверительФЛ_ДатаРождения;
				РезультатЧтения.ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. Дата рождения: %2 ИНН: %3", ФИО, Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), ИНН);
				РезультатЧтения.ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				РезультатЧтения.ДанныеМЧД.ДоверительИННФЛ = ИНН;
				РезультатЧтения.ДанныеМЧД.ДоверительИННЮЛ = ИНН;
				
			КонецЕсли; 
			
			РезультатЧтения.ДанныеМЧД.ЭтоПередоверие = (РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ОбъектXDTO.ОбъектМЧД, "Документ.Передов") <> Неопределено);
			
			Если ВерсияФормата = РаботаСМашиночитаемымиДоверенностями.ФорматМЧД_2022_Версия_002() Тогда
				Если Не РезультатЧтения.ДанныеМЧД.ЭтоПередоверие Тогда
					ПутьКСвойству = "Документ.Довер.СвДоверит.РосОргДовер.ЛицоБезДов.СвФЛ.СНИЛС";
				Иначе
					ПутьКСвойству = "Документ.Передов.СвЛицПередПолн.ФЛПрдПолн.СвФЛ.СНИЛС";
				КонецЕсли;
			Иначе
				ПутьКСвойству = "Документ.СвДоверит.РосОргДовер.ЛицоБезДов.СвФЛ.СНИЛС";
			КонецЕсли;
			
			СНИЛСДоверителяФЛ = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ОбъектXDTO.ОбъектМЧД, ПутьКСвойству, "");
			РезультатЧтения.ДанныеМЧД.СНИЛСДоверителяФЛ = РаботаСоСтрокамиКлиентСервер.ЗаменитьОдниСимволыДругими("- ", СНИЛСДоверителяФЛ, "");
			
			Для Каждого СведенияОбУполномоченномПредставителе Из ДанныеДляЗаполненияМЧД.ДанныеДоверенности.Представители Цикл
				
				ТипПредставителя = СведенияОбУполномоченномПредставителе.ТипУполномоченногоПредставителя;
				
				Если ТипПредставителя = "ЮЛ" Тогда

					Наименование = СведенияОбУполномоченномПредставителе.ПредставительЮЛ_НаимОрг;
					ИНН = СведенияОбУполномоченномПредставителе.ПредставительЮЛ_ИНН;
					КПП = СведенияОбУполномоченномПредставителе.ПредставительЮЛ_КПП;
					
					ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
					Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
					
				ИначеЕсли ТипПредставителя = "ИП" Тогда	

					Наименование = СведенияОбУполномоченномПредставителе.ПредставительЮЛ_НаимОрг;
					ИНН = СведенияОбУполномоченномПредставителе.ПредставительЮЛ_ИНН;
					
					ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2", Наименование, ИНН);
					Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
					
				ИначеЕсли ТипПредставителя = "ФЛ" Тогда	
					
					ФИО = СведенияОбУполномоченномПредставителе.ПредставительФИО;
					ДатаРождения = СведенияОбУполномоченномПредставителе.ПредставительФЛ_ДатаРождения;
					ИНН = СведенияОбУполномоченномПредставителе.ПредставительФЛ_ИНН;
					
					ПоверенныйПредставление = СтрШаблон("%1. Дата рождения: %2 ИНН: %3", ФИО, Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), ИНН);
					Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
					
				КонецЕсли;
				
				РезультатЧтения.ДанныеМЧД.Поверенные.Добавить(Новый Структура("Представление, Поверенный", ПоверенныйПредставление, Поверенный));
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат РезультатЧтения;

КонецФункции

Функция НовыеДанныеМЧДДляЗагрузки()

	ДанныеМЧД = Новый Структура; 
	ДанныеМЧД.Вставить("ЭтоПередоверие", Ложь);
	ДанныеМЧД.Вставить("ВерсияФормата", "");
	ДанныеМЧД.Вставить("Номер", "");
	ДанныеМЧД.Вставить("ДатаНачалаДействия", '00010101');
	ДанныеМЧД.Вставить("ДатаОкончанияДействия", '00010101');
	ДанныеМЧД.Вставить("ИдентификаторДоверенности", "");
	ДанныеМЧД.Вставить("ИнформационнаяСистема", "");
	ДанныеМЧД.Вставить("СтатусВФНС", Перечисления.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка());
	ДанныеМЧД.Вставить("ДатаПроверкиСтатуса", '00010101');
	ДанныеМЧД.Вставить("Доверитель", Справочники.ЮрФизЛица.ПустаяСсылка());
	ДанныеМЧД.Вставить("ДоверительИННФЛ", "");
	ДанныеМЧД.Вставить("ДоверительИННЮЛ", "");
	ДанныеМЧД.Вставить("СНИЛСДоверителяФЛ", "");
	ДанныеМЧД.Вставить("ДоверительПредставление", "");
	ДанныеМЧД.Вставить("Поверенные", Новый Массив);
	
	Возврат ДанныеМЧД;
	
КонецФункции

Функция ЗаполнитьДанныеМЧД003(ДанныеМЧД, ДокументXDTO)

	ТипыДоверителей = РаботаСМашиночитаемымиДоверенностями.ТипыДоверителей();
	ТипыПредставителей = РаботаСМашиночитаемымиДоверенностями.ТипыПредставителей();
		
	#Область Доверенность
	ДоверXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДокументXDTO, "Довер", Неопределено);
	Если ДоверXDTO <> Неопределено Тогда
		
		Шапка = ДоверXDTO.СвДов;
		
		// Основные сведения
		ДанныеМЧД.Номер = Шапка.ВнНомДовер;
		ДанныеМЧД.ДатаНачалаДействия = Шапка.ДатаВыдДовер;
		ДанныеМЧД.ДатаОкончанияДействия = Шапка.СрокДейст;
		ДанныеМЧД.ДатаПроверкиСтатуса = Шапка.НомДовер;
		ДанныеМЧД.ИнформационнаяСистема = Шапка.СведСист;
		ДанныеМЧД.ИдентификаторДоверенности = Шапка.НомДовер;
		
		СвДоверитXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверXDTO, "СвДоверит", , , Истина);
		
		Для Каждого ДоверительXDTO Из СвДоверитXDTO Цикл	
			
			Если ДоверительXDTO.ТипДоверит = ТипыДоверителей.ЮридическоеЛицо Тогда
							
				СвРосОргXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.РосОргДовер.СвРосОрг");
				Наименование = СвРосОргXDTO.НаимОрг;
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвРосОргXDTO, "ИННЮЛ", "");
				КПП = СвРосОргXDTO.КПП;
				
				ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				СвФЛXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.РосОргДовер.ЛицоБезДов.СвФЛ");
				ДанныеМЧД.ДоверительИННФЛ = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвФЛXDTO, "ИННФЛ", "");
				//ДанныеМЧД.ДоверительИННЮЛ = ИНН; 
				СНИЛСДоверителяФЛ = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвФЛXDTO, "СНИЛС", "");
				ДанныеМЧД.СНИЛСДоверителяФЛ = РаботаСоСтрокамиКлиентСервер.ЗаменитьОдниСимволыДругими("- ", СНИЛСДоверителяФЛ, "");
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИностраннаяОрганизация Тогда	
				
				СвИнОргXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИнОргДовер.СвИнОрг");
				Наименование = СвИнОргXDTO.НаимИО;
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвИнОргXDTO, "ИННЮЛ", "");
				КПП = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвИнОргXDTO, "КПП", "");	
				
				ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				СвФЛXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИнОргДовер.СвРукОП");
				//ДанныеМЧД.ДоверительИННФЛ = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СвФЛXDTO, "ИННФЛ", "");
				//ДанныеМЧД.ДоверительИННЮЛ = ИНН;
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ИндивидуальныйПредприниматель Тогда
				
				ИПДоверXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ИПДовер");
				Наименование = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ИПДоверXDTO, "НаимИП", "");
				ИНН = ИПДоверXDTO.ИННФЛ;
				
				ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. ИНН: %2", Наименование, ИНН);
				ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				//ДанныеМЧД.ДоверительИННФЛ = ИНН;
				//ДанныеМЧД.ДоверительИННЮЛ = ИНН;
				
				СНИЛСДоверителяФЛ = ИПДоверXDTO.СНИЛС;
				ДанныеМЧД.СНИЛСДоверителяФЛ = РаботаСоСтрокамиКлиентСервер.ЗаменитьОдниСимволыДругими("- ", СНИЛСДоверителяФЛ, "")
				
			ИначеЕсли ДоверительXDTO.ТипДоверит = ТипыДоверителей.ФизическоеЛицо Тогда	
				
				ФЛДоверXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверительXDTO, "Доверит.ФЛДовер");
				СведФЛXDTO = ФЛДоверXDTO.СведФЛ;
				ФИО = РаботаСМашиночитаемымиДоверенностями.ПолучитьПредставлениеФИО(СведФЛXDTO.ФИО);
				ДатаРождения = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведФЛXDTO, "ДатаРожд", '00010101');
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ФЛДоверXDTO, "ИННФЛ", "");
				
				ДанныеМЧД.ДоверительПредставление = СтрШаблон("%1. Дата рождения: %2 ИНН: %3", ФИО, Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), ИНН);
				ДанныеМЧД.Доверитель = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				ДанныеМЧД.ДоверительИННФЛ = ИНН;
				ДанныеМЧД.ДоверительИННЮЛ = ИНН;
							
			КонецЕсли;
			
		КонецЦикла;
		
		СвУпПредXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДоверXDTO, "СвУпПред", , , Истина);
		
		Для Каждого ПредставительXDTO Из СвУпПредXDTO Цикл
			
			АнкетныеДанные = Новый Структура;
			
			Если ПредставительXDTO.ТипПред = ТипыПредставителей.ЮридическоеЛицо Тогда

				СведОргXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведОрг");
				Наименование = СведОргXDTO.НаимОрг;
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведОргXDTO, "ИННЮЛ", "");
				КПП = СведОргXDTO.КПП;
				
				ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
			ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда	

				СведИПXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИП");
				Наименование = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведИПXDTO, "НаимИП", "");
				ИНН = СведИПXDTO.ИННФЛ;
				
				ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2", Наименование, ИНН);
				Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
			ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФизическоеЛицо Тогда	
				
				СведФизЛXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФизЛ");
				СведФЛXDTO = СведФизЛXDTO.СведФЛ;
				ФИО = РаботаСМашиночитаемымиДоверенностями.ПолучитьПредставлениеФИО(СведФЛXDTO.ФИО);
				ДатаРождения = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведФЛXDTO, "ДатаРожд", '00010101');
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведФизЛXDTO, "ИННФЛ", "");
				
				ПоверенныйПредставление = СтрШаблон("%1. Дата рождения: %2 ИНН: %3", ФИО, Формат(ДатаРождения, "ДФ=dd.MM.yyyy"), ИНН);
				Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
				Номер = СведФЛXDTO.УдЛичнФЛ.СерНомДок;
				Серия = "";
				СерияНомерДокумента = СтрРазделить(СокрЛП(Номер), " ", Ложь);
				
				Если СерияНомерДокумента.Количество() > 1 Тогда
					Номер = СерияНомерДокумента[СерияНомерДокумента.Количество() - 1];
					Серия = СокрЛП(СтрЗаменить(СведФЛXDTO.УдЛичнФЛ.СерНомДок, Номер, ""));
				КонецЕсли;
				
				ЮрФизЛицо = ПолучитьЮрФизЛицоПоИНН(ИНН, Истина);
				
				АнкетныеДанные.Вставить("Фамилия", СведФЛXDTO.ФИО.Фамилия);
				АнкетныеДанные.Вставить("Имя", СведФЛXDTO.ФИО.Имя);
				АнкетныеДанные.Вставить("Отчество", СведФЛXDTO.ФИО.Отчество);
				АнкетныеДанные.Вставить("ИНН", СведФизЛXDTO.ИННФЛ);
				АнкетныеДанные.Вставить("СНИЛС", СведФизЛXDTO.СНИЛС);
				АнкетныеДанные.Вставить("ДатаРождения", СведФЛXDTO.ДатаРожд);
				АнкетныеДанные.Вставить("ВидУдостоверенияЛичности", ?(СведФЛXDTO.УдЛичнФЛ.КодВидДок = "21", Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, Неопределено));
				АнкетныеДанные.Вставить("СерияУдостоверенияЛичности", Серия);
				АнкетныеДанные.Вставить("НомерУдостоверенияЛичности", Номер);
				АнкетныеДанные.Вставить("ОрганВыдавшийУдостоверениеЛичности", СведФЛXDTO.УдЛичнФЛ.ВыдДок);
				АнкетныеДанные.Вставить("КодОрганаВыдавшегоУдостоверениеЛичности", СведФЛXDTO.УдЛичнФЛ.КодВыдДок);
				АнкетныеДанные.Вставить("ДатаВыдачиУдостоверенияЛичности", СведФЛXDTO.УдЛичнФЛ.ДатаДок);
				АнкетныеДанные.Вставить("ДатаОкончанияДействияУдостоверенияЛичности", СведФЛXDTO.УдЛичнФЛ.expDate);
				АнкетныеДанные.Вставить("ЮрФизЛицо", ЮрФизЛицо);
				
			ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалЮридическогоЛица Тогда	
				
				СведФилиалXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведФилиал");
				Наименование = СведФилиалXDTO.НаимОрг;
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведФилиалXDTO, "ИННЮЛ", "");
				КПП = СведФилиалXDTO.КПП;
				
				ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
			ИначеЕсли ПредставительXDTO.ТипПред = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
				
				СведИОXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ПредставительXDTO, "Пред.СведИО");
				Наименование = СведИОXDTO.НаимИО;
				ИНН = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведИОXDTO, "ИННЮЛ", "");
				КПП = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(СведИОXDTO, "КПП", "");
				
				ПоверенныйПредставление = СтрШаблон("%1. ИНН: %2 КПП: %3", Наименование, ИНН, КПП);
				Поверенный = ПолучитьЮрФизЛицоПоИНН(ИНН);
				
			КонецЕсли;
			
			ДанныеМЧД.Поверенные.Добавить(Новый Структура("Представление, Поверенный, АнкетныеДанные", ПоверенныйПредставление, Поверенный, АнкетныеДанные));
			
		КонецЦикла;
	
	КонецЕсли;		
	#КонецОбласти 
	
	#Область Передоверие
	ПередовXDTO = РаботаСМашиночитаемымиДоверенностями.ЗначениеСвойстваXDTO(ДокументXDTO, "Передов", Неопределено);
	Если ПередовXDTO <> Неопределено Тогда
		
		ДанныеМЧД.ЭтоПередоверие = Истина;
		// не реализовано
		
	КонецЕсли;		
	#КонецОбласти
	
КонецФункции

Функция ПолучитьЮрФизЛицоПоИНН(ИНН, ИскатьПоДаннымГруппыКомпаний = Ложь)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			,
		|			&Условие
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|ГДЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН = &ИНН
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			,
		|			&Условие
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН = &ИНН";
	
	Если ИскатьПоДаннымГруппыКомпаний Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.ЮрФизЛицо;
	
	КонецЕсли;

КонецФункции

#КонецОбласти