
Функция СформироватьМенеджерВременныхТаблицСДанными(МассивДокументов) Экспорт
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.Ссылка КАК Ссылка,
		|	Распоряжение.Дата КАК Дата,
		|	Распоряжение.Организация КАК Организация,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	Распоряжение.Валюта КАК Валюта,
		|	Распоряжение.Сумма КАК Сумма,
		|	Распоряжение.Процент КАК Процент,
		|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
		|	ВЫБОР
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
		|		ИНАЧЕ НомераОбъектов.Номер
		|	КОНЕЦ КАК НомерПодтверждения,
		|	NULL КАК Брокер
		|ПОМЕСТИТЬ _ПорученияРаспоряжения
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО Распоряжение.Ссылка = НомераОбъектов.Объект
		|			И Распоряжение.Организация = НомераОбъектов.Организация
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|ГДЕ
		|	Распоряжение.Ссылка В(&МассивДокументов)
		|	И Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоручениеНаПереводДенежныхСредств.Ссылка,
		|	ПоручениеНаПереводДенежныхСредств.Дата,
		|	ПоручениеНаПереводДенежныхСредств.Организация,
		|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления,
		|	ПоручениеНаПереводДенежныхСредств.РасчетныйСчетПолучатель,
		|	ПоручениеНаПереводДенежныхСредств.Валюта,
		|	ПоручениеНаПереводДенежныхСредств.Сумма,
		|	0,
		|	NULL,
		|	"""",
		|	ПоручениеНаПереводДенежныхСредств.Брокер
		|ИЗ
		|	Документ.ПоручениеНаПереводДенежныхСредств КАК ПоручениеНаПереводДенежныхСредств
		|ГДЕ
		|	ПоручениеНаПереводДенежныхСредств.Ссылка В(&МассивДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПорученияРаспоряжения.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Ссылка) + 1 КАК Номер
		|ПОМЕСТИТЬ _НомераУведомлений
		|ИЗ
		|	_ПорученияРаспоряжения КАК _ПорученияРаспоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Распоряжение.Ссылка КАК Ссылка,
		|			Распоряжение.Дата КАК Дата,
		|			Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			Документ.Распоряжение КАК Распоряжение
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПорученияРаспоряжения КАК _ПорученияРаспоряжения
		|				ПО Распоряжение.СчетДоверительногоУправления = _ПорученияРаспоряжения.СчетДоверительногоУправления
		|					И (РАЗНОСТЬДАТ(Распоряжение.Дата, _ПорученияРаспоряжения.Дата, ДЕНЬ) = 0)
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ПоручениеНаПереводДенежныхСредств.Ссылка,
		|			ПоручениеНаПереводДенежныхСредств.Дата,
		|			ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления
		|		ИЗ
		|			Документ.ПоручениеНаПереводДенежныхСредств КАК ПоручениеНаПереводДенежныхСредств
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПорученияРаспоряжения КАК _ПорученияРаспоряжения
		|				ПО ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления = _ПорученияРаспоряжения.СчетДоверительногоУправления
		|					И (РАЗНОСТЬДАТ(ПоручениеНаПереводДенежныхСредств.Дата, _ПорученияРаспоряжения.Дата, ДЕНЬ) = 0)) КАК ВложенныйЗапрос
		|		ПО _ПорученияРаспоряжения.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|			И _ПорученияРаспоряжения.Дата > ВложенныйЗапрос.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПорученияРаспоряжения.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПорученияРаспоряжения.Дата КАК Дата,
		|	_ПорученияРаспоряжения.Организация КАК Организация,
		|	_ПорученияРаспоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПорученияРаспоряжения.РасчетныйСчет КАК РасчетныйСчет,
		|	_ПорученияРаспоряжения.Валюта КАК Валюта,
		|	_ПорученияРаспоряжения.Сумма КАК Сумма,
		|	_ПорученияРаспоряжения.Процент КАК Процент,
		|	_ПорученияРаспоряжения.ДатаВозврата КАК ДатаВозврата,
		|	_ПорученияРаспоряжения.НомерПодтверждения КАК НомерПодтверждения,
		|	_ПорученияРаспоряжения.Брокер КАК Брокер,
		|	_НомераУведомлений.Номер КАК НомерУведомленияОНамерении
		|ПОМЕСТИТЬ _ДанныеДокументов
		|ИЗ
		|	_ПорученияРаспоряжения КАК _ПорученияРаспоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераУведомлений КАК _НомераУведомлений
		|		ПО _ПорученияРаспоряжения.Ссылка = _НомераУведомлений.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	РеквизитыЮридическихЛиц.Период КАК Период,
		|	РеквизитыЮридическихЛиц.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛиц.ОГРН КАК ОГРН,
		|	РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _ПолнаяТаблицаРеквизитов
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата КАК Дата,
		|		_ДанныеДокументов.РасчетныйСчет КАК Объект,
		|		_ДанныеДокументов.РасчетныйСчет.Банк.ЮрФизЛицо КАК ЮрЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.СчетДоверительногоУправления.СпециализированныйДепозитарий,
		|		_ДанныеДокументов.СчетДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.Брокер,
		|		_ДанныеДокументов.Брокер.ЮрФизЛицо
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО ВложенныйЗапрос.ЮрЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.Дата >= РеквизитыЮридическихЛиц.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	_ПолнаяТаблицаРеквизитов.ИНН КАК ИНН,
		|	_ПолнаяТаблицаРеквизитов.ОГРН КАК ОГРН,
		|	_ПолнаяТаблицаРеквизитов.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	_ПолнаяТаблицаРеквизитов.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ РеквизитыЮрЛиц
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаРеквизитов.Объект КАК Объект,
		|		МАКСИМУМ(_ПолнаяТаблицаРеквизитов.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаРеквизитов КАК _ПолнаяТаблицаРеквизитов
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаРеквизитов.Объект) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаРеквизитов КАК _ПолнаяТаблицаРеквизитов
		|		ПО ВложенныйЗапрос.Объект = _ПолнаяТаблицаРеквизитов.Объект
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаРеквизитов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДанныеДокументов.Дата КАК ДатаДок,
		|	_ДанныеДокументов.Организация КАК Организация,
		|	_ДанныеДокументов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправления.Период КАК Период,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент
		|ПОМЕСТИТЬ _ПолнаяТаблицаКлиентов
		|ИЗ
		|	_ДанныеДокументов КАК _ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО _ДанныеДокументов.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И _ДанныеДокументов.Дата >= КлиентыДоверительногоУправления.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ДокДата КАК ДокДата,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПолнаяТаблицаКлиентов.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаКлиентов.ДатаДок КАК ДокДата,
		|		_ПолнаяТаблицаКлиентов.Организация КАК Организация,
		|		_ПолнаяТаблицаКлиентов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(_ПолнаяТаблицаКлиентов.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаКлиентов КАК _ПолнаяТаблицаКлиентов
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаКлиентов.ДатаДок,
		|		_ПолнаяТаблицаКлиентов.Организация,
		|		_ПолнаяТаблицаКлиентов.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаКлиентов КАК _ПолнаяТаблицаКлиентов
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = _ПолнаяТаблицаКлиентов.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаКлиентов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.ЭтоОрганизация КАК ЭтоОрганизация,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.Период, РеквизитыФизическихЛицАнкетные.Период) КАК Период,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицАнкетные.Фамилия + РеквизитыФизическихЛицАнкетные.Имя + РеквизитыФизическихЛицАнкетные.Отчество) КАК Наименование,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетные.ПолноеНаименованиеПоУставу, """") КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _ПолнаяТаблицаРеквизитовИзАнкет
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Клиенты.ДокДата КАК ДокДата,
		|		_Клиенты.Организация КАК Организация,
		|		_Клиенты.СчетДоверительногоУправления КАК Объект,
		|		_Клиенты.Клиент КАК ЮрФизЛицо,
		|		ЛОЖЬ КАК ЭтоОрганизация
		|	ИЗ
		|		_Клиенты КАК _Клиенты
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ДанныеДокументов.Дата,
		|		_ДанныеДокументов.Организация,
		|		_ДанныеДокументов.Организация,
		|		_ДанныеДокументов.Организация.ЮрФизЛицо,
		|		ИСТИНА
		|	ИЗ
		|		_ДанныеДокументов КАК _ДанныеДокументов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|		ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|			И ВложенныйЗапрос.Организация = РеквизитыЮридическихЛицАнкетные.Организация
		|			И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.ДокДата >= РеквизитыЮридическихЛицАнкетные.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|		ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо
		|			И ВложенныйЗапрос.Организация = РеквизитыФизическихЛицАнкетные.Организация
		|			И (РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВложенныйЗапрос.ДокДата >= РеквизитыФизическихЛицАнкетные.Период
		|			И (НЕ ВложенныйЗапрос.ЭтоОрганизация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Объект КАК Объект,
		|	ВложенныйЗапрос.ЮрФизЛицо ССЫЛКА Справочник.ПаевыеИнвестиционныеФонды КАК ЭтоПиф,
		|	ВложенныйЗапрос.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВложенныйЗапрос.ЭтоОрганизация КАК ЭтоОрганизация,
		|	_ПолнаяТаблицаРеквизитовИзАнкет.Наименование КАК Наименование,
		|	_ПолнаяТаблицаРеквизитовИзАнкет.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _РеквизитыЮрФизЛицАнкетные
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПолнаяТаблицаРеквизитовИзАнкет.Объект КАК Объект,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЮрФизЛицо КАК ЮрФизЛицо,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация КАК ЭтоОрганизация,
		|		МАКСИМУМ(_ПолнаяТаблицаРеквизитовИзАнкет.Период) КАК Период
		|	ИЗ
		|		_ПолнаяТаблицаРеквизитовИзАнкет КАК _ПолнаяТаблицаРеквизитовИзАнкет
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПолнаяТаблицаРеквизитовИзАнкет.Объект,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЮрФизЛицо,
		|		_ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПолнаяТаблицаРеквизитовИзАнкет КАК _ПолнаяТаблицаРеквизитовИзАнкет
		|		ПО ВложенныйЗапрос.Объект = _ПолнаяТаблицаРеквизитовИзАнкет.Объект
		|			И ВложенныйЗапрос.ЭтоОрганизация = _ПолнаяТаблицаРеквизитовИзАнкет.ЭтоОрганизация
		|			И ВложенныйЗапрос.Период = _ПолнаяТаблицаРеквизитовИзАнкет.Период";
#КонецОбласти

	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.Выполнить();	
		
	Возврат МВТ;	
			
КонецФункции