Функция ПолучитьПодписантов(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПоручениеНаПереводДенежныхСредств.Организация КАК Организация
		|	ИЗ
		|		Документ.ПоручениеНаПереводДенежныхСредств КАК ПоручениеНаПереводДенежныхСредств
		|	ГДЕ
		|		ПоручениеНаПереводДенежныхСредств.Ссылка В(&МассивДокументов)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Распоряжение.Организация
		|	ИЗ
		|		Документ.Распоряжение КАК Распоряжение
		|	ГДЕ
		|		Распоряжение.Ссылка В(&МассивДокументов)
		|		И Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО ВложенныйЗапрос.Организация.ЮрФизЛицо = КонтактныеЛица.Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактноеЛицо
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");	

КонецФункции
