
Функция ПолучитьОбщиеУсловияСделки(Период, Основание, ВидЗадолженности)
	
	ОбщиеУсловияСделки = Новый Структура("ДатаВторойЧастиРЕПО, ДатаИсполнения, ДатаОплаты, ДатаПоставки, ВалютаОплаты, СобственныйКурсОплаты, КурсОплаты, ПлатежноеУсловиеСделки, СтавкаРЕПО");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	&СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаИсполнения,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК ВалютаОплаты,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК КурсОплаты,
		|	УсловияСделокСрезПоследних.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&Период,
		|			НЕ Отменено
		|				И СделкаРЕПО = &Сделка
		|				И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних";
		
	Документы.ИзменениеУсловийСделки.УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, Основание);
		
	Запрос.УстановитьПараметр("Период",           Период);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбщиеУсловияСделки, Выборка);
	КонецЕсли;
	
	Возврат ОбщиеУсловияСделки;
	
КонецФункции // ПолучитьОбщиеУсловияСделки

Функция ПолучитьКорзинуЦенныхБумагСделкиДляИзменения(Период, Основание, ВидЗадолженности)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Исполнено,
		|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА СУММА(ЗадолженностиПоЦеннымБумагам.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ЗадолженностиПоЦеннымБумагам.Сумма) / СУММА(ЗадолженностиПоЦеннымБумагам.Количество)
		|	КОНЕЦ КАК Цена,
		|	NULL КАК ЦенаПроцент,
		|	ВЫБОР
		|		КОГДА СУММА(ЗадолженностиПоЦеннымБумагам.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ЗадолженностиПоЦеннымБумагам.СуммаКупона) / СУММА(ЗадолженностиПоЦеннымБумагам.Количество)
		|	КОНЕЦ КАК ЦенаКупона,
		|	СУММА(ЗадолженностиПоЦеннымБумагам.Количество) КАК Количество,
		|	СУММА(ЗадолженностиПоЦеннымБумагам.Сумма) КАК Сумма,
		|	СУММА(ЗадолженностиПоЦеннымБумагам.СуммаКупона) КАК СуммаКупона
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				НЕ Отменено
		|					И СделкаРЕПО = &Сделка
		|					И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних
		|		ПО ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|ГДЕ
		|	ЗадолженностиПоЦеннымБумагам.Активность
		|	И ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ЗадолженностиПоЦеннымБумагам.Основание = &Основание
		|	И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности = &ВидЗадолженности
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	НеИсполненныеУсловияСделок.ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет,
		|	УсловияСделокСрезПоследних.Цена,
		|	УсловияСделокСрезПоследних.ЦенаПроцент,
		|	УсловияСделокСрезПоследних.ЦенаКупона,
		|	НеИсполненныеУсловияСделок.Количество,
		|	НеИсполненныеУсловияСделок.Сумма,
		|	НеИсполненныеУсловияСделок.СуммаКупона
		|ИЗ
		|	(ВЫБРАТЬ
		|		НеИсполненныеУсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(НеИсполненныеУсловияСделок.Количество) КАК Количество,
		|		СУММА(НеИсполненныеУсловияСделок.Сумма) КАК Сумма,
		|		СУММА(НеИсполненныеУсловияСделок.СуммаКупона) КАК СуммаКупона
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|			-ЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
		|			-ЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
		|			-ЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона
		|		ИЗ
		|			РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|		ГДЕ
		|			ЗадолженностиПоЦеннымБумагам.Активность
		|			И ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ЗадолженностиПоЦеннымБумагам.Основание = &Основание
		|			И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности = &ВидЗадолженности
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			УсловияСделокСрезПоследних.ЦеннаяБумага,
		|			УсловияСделокСрезПоследних.Количество,
		|			УсловияСделокСрезПоследних.Сумма,
		|			УсловияСделокСрезПоследних.СуммаКупона
		|		ИЗ
		|			РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|					&Период,
		|					НЕ Отменено
		|						И СделкаРЕПО = &Сделка
		|						И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних) КАК НеИсполненныеУсловияСделок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НеИсполненныеУсловияСделок.ЦеннаяБумага
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(НеИсполненныеУсловияСделок.Количество) > 0
		|			ИЛИ СУММА(НеИсполненныеУсловияСделок.Сумма) > 0
		|			ИЛИ СУММА(НеИсполненныеУсловияСделок.СуммаКупона) > 0)) КАК НеИсполненныеУсловияСделок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				НЕ Отменено
		|					И СделкаРЕПО = &Сделка
		|					И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних
		|		ПО НеИсполненныеУсловияСделок.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага";
		
	Документы.ИзменениеУсловийСделки.УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, Основание);
	
	Запрос.УстановитьПараметр("Период",           Период);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("Основание",        Основание);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьКорзинуЦенныхБумагСделкиДляИзменения

Функция ПолучитьИзмененияЗадолженностиПоЦеннымБумагам()
	
	// в части задолженности по ценным бумагам изменяется только не исполненная ранее задолженность
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона,
		|	ИзменениеУсловийСделки.Организация КАК Организация,
		|	ИзменениеУсловийСделки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийСделки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ИзменениеУсловийСделки.ВидЗадолженности КАК ВидЗадолженности,
		|	ИзменениеУсловийСделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИзменениеУсловийСделки.Рынок КАК Рынок,
		|	ИзменениеУсловийСделки.Основание.ВалютаСделки КАК Валюта
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Количество) КАК Количество,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Сумма) КАК Сумма,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона) КАК СуммаКупона
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|			ИзменениеУсловийСделкиЦенныеБумаги.Количество КАК Количество,
		|			ИзменениеУсловийСделкиЦенныеБумаги.Сумма КАК Сумма,
		|			ИзменениеУсловийСделкиЦенныеБумаги.СуммаКупона КАК СуммаКупона
		|		ИЗ
		|			Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
		|		ГДЕ
		|			ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
		|			И НЕ ИзменениеУсловийСделкиЦенныеБумаги.Исполнено
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			УсловияСделокСрезПоследних.ЦеннаяБумага,
		|			-СУММА(УсловияСделокСрезПоследних.Количество),
		|			-СУММА(УсловияСделокСрезПоследних.Сумма),
		|			-СУММА(УсловияСделокСрезПоследних.СуммаКупона)
		|		ИЗ
		|			РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|					&Период,
		|					НЕ Отменено
		|						И СделкаРЕПО = &Сделка
		|						И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УсловияСделокСрезПоследних.ЦеннаяБумага) КАК ИзменениеЗадолженностиПоЦеннымБумагам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|					&Период,
		|					Основание = &Сделка
		|						И &ОтборПоВидуЗадолженности) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|			ПО ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага = ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага
		|	ГДЕ
		|		ЕСТЬNULL(ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток, 0) <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Количество) <> 0
		|			ИЛИ СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Сумма) <> 0
		|			ИЛИ СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона) <> 0)) КАК ИзменениеЗадолженностиПоЦеннымБумагам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО (ИзменениеУсловийСделки.Ссылка = &Ссылка)";
		
	Документы.ИзменениеУсловийСделки.УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, ЭтотОбъект.Основание);
		
	Запрос.УстановитьПараметр("Период"          , ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	Запрос.УстановитьПараметр("Ссылка"          , ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Основание"       , ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Сделка"          , ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьИзмененияЗадолженностиПоЦеннымБумагам

Функция ПолучитьИзмененияЗадолженностиПоДенежнымСредствамПоСделке()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмененияЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	ИзмененияЗадолженностиПоДенежнымСредствам.СуммаКупона КАК СуммаКупона,
		|	ИзменениеУсловийСделки.Организация КАК Организация,
		|	ИзменениеУсловийСделки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийСделки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ИзменениеУсловийСделки.ВидЗадолженности КАК ВидЗадолженности,
		|	ИзменениеУсловийСделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИзменениеУсловийСделки.Основание.Контрагент КАК Контрагент,
		|	ИзменениеУсловийСделки.Основание.ВалютаСделки КАК Валюта
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ИзмененияЗадолженностиПоДенежнымСредствам.Сумма) КАК Сумма,
		|		СУММА(ИзмененияЗадолженностиПоДенежнымСредствам.СуммаКупона) КАК СуммаКупона
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ИзменениеУсловийСделкиЦенныеБумаги.Сумма КАК Сумма,
		|			ИзменениеУсловийСделкиЦенныеБумаги.СуммаКупона КАК СуммаКупона
		|		ИЗ
		|			Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
		|		ГДЕ
		|			ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			-УсловияСделокСрезПоследних.Сумма,
		|			-УсловияСделокСрезПоследних.СуммаКупона
		|		ИЗ
		|			РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|					&Период,
		|					НЕ Отменено
		|						И СделкаРЕПО = &Сделка
		|						И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних) КАК ИзмененияЗадолженностиПоДенежнымСредствам
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(ИзмененияЗадолженностиПоДенежнымСредствам.Сумма) <> 0
		|			ИЛИ СУММА(ИзмененияЗадолженностиПоДенежнымСредствам.СуммаКупона) <> 0)) КАК ИзмененияЗадолженностиПоДенежнымСредствам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО (ИзменениеУсловийСделки.Ссылка = &Ссылка)";
		
	Документы.ИзменениеУсловийСделки.УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, ЭтотОбъект.Основание);
		
	Запрос.УстановитьПараметр("Период",           ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	Запрос.УстановитьПараметр("Ссылка",           ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьИзмененияЗадолженностиПоДенежнымСредствамПоСделке

Функция ПолучитьИзмененияЗадолженностиПоВторойЧастиРепо()
	
// в части задолженности по ценным бумагам изменяется только не исполненная ранее задолженность
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
		|	ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона,
		|	ИзменениеУсловийСделки.Организация КАК Организация,
		|	ИзменениеУсловийСделки.Основание КАК СделкаРепо,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийСделки.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|					КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			КОНЕЦ
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ИзменениеУсловийСделки.ВидЗадолженности КАК ВидЗадолженности,
		|	ИзменениеУсловийСделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИзменениеУсловийСделки.Рынок КАК Рынок,
		|	ИзменениеУсловийСделки.Основание.ВалютаСделки КАК Валюта
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Количество) КАК Количество,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Сумма) КАК Сумма,
		|		СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона) КАК СуммаКупона
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|			ИзменениеУсловийСделкиЦенныеБумаги.Количество КАК Количество,
		|			ИзменениеУсловийСделкиЦенныеБумаги.Сумма КАК Сумма,
		|			ИзменениеУсловийСделкиЦенныеБумаги.СуммаКупона КАК СуммаКупона
		|		ИЗ
		|			Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
		|		ГДЕ
		|			ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
		|			И НЕ ИзменениеУсловийСделкиЦенныеБумаги.Исполнено
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НеИсполненныеУсловияСделок.ЦеннаяБумага,
		|			-НеИсполненныеУсловияСделок.Количество,
		|			-НеИсполненныеУсловияСделок.Сумма,
		|			-НеИсполненныеУсловияСделок.СуммаКупона
		|		ИЗ
		|			(ВЫБРАТЬ
		|				НеИсполненныеУсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|				СУММА(НеИсполненныеУсловияСделок.Количество) КАК Количество,
		|				СУММА(НеИсполненныеУсловияСделок.Сумма) КАК Сумма,
		|				СУММА(НеИсполненныеУсловияСделок.СуммаКупона) КАК СуммаКупона
		|			ИЗ
		|				(ВЫБРАТЬ
		|					ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага,
		|					-ЗадолженностиПоЦеннымБумагам.Количество КАК Количество,
		|					-ЗадолженностиПоЦеннымБумагам.Сумма КАК Сумма,
		|					-ЗадолженностиПоЦеннымБумагам.СуммаКупона КАК СуммаКупона
		|				ИЗ
		|					РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|				ГДЕ
		|					ЗадолженностиПоЦеннымБумагам.Активность
		|					И ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И ЗадолженностиПоЦеннымБумагам.Основание = &Основание
		|					И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности = &ВидЗадолженности
		|				
		|				ОБЪЕДИНИТЬ ВСЕ
		|				
		|				ВЫБРАТЬ
		|					УсловияСделокСрезПоследних.ЦеннаяБумага,
		|					УсловияСделокСрезПоследних.Количество,
		|					УсловияСделокСрезПоследних.Сумма,
		|					УсловияСделокСрезПоследних.СуммаКупона
		|				ИЗ
		|					РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|							&Период,
		|							НЕ Отменено
		|								И СделкаРЕПО = &Сделка
		|								И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних) КАК НеИсполненныеУсловияСделок
		|			
		|			СГРУППИРОВАТЬ ПО
		|				НеИсполненныеУсловияСделок.ЦеннаяБумага) КАК НеИсполненныеУсловияСделок
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|						&Период,
		|						НЕ Отменено
		|							И СделкаРЕПО = &Сделка
		|							И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних
		|				ПО НеИсполненныеУсловияСделок.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага) КАК ИзменениеЗадолженностиПоЦеннымБумагам
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИзменениеЗадолженностиПоЦеннымБумагам.ЦеннаяБумага
		|	
		|	ИМЕЮЩИЕ
		|		(СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Количество) <> 0
		|			ИЛИ СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.Сумма) <> 0
		|			ИЛИ СУММА(ИзменениеЗадолженностиПоЦеннымБумагам.СуммаКупона) <> 0)) КАК ИзменениеЗадолженностиПоЦеннымБумагам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО (ИзменениеУсловийСделки.Ссылка = &Ссылка)";
		
	Документы.ИзменениеУсловийСделки.УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, ЭтотОбъект.Основание);
		
	Запрос.УстановитьПараметр("Период",           ЭтотОбъект.МоментВремени());
	Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	Запрос.УстановитьПараметр("Ссылка",           ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Основание",        ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
		
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции // ПолучитьИзмененияЗадолженностиПоВторойЧастиРепо

Функция ПолучитьНовыеУсловияСделки()
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.Сделка") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаИсполнения,
			|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
			|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
			|	УсловияСделокСрезПоследних.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	УсловияСделокСрезПоследних.РаздельноеИсполнение КАК РаздельноеИсполнение
			|ПОМЕСТИТЬ _ПредУсловияСделки
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(
			|			&Период,
			|			Сделка = &Сделка
			|				И НЕ Отменено) КАК УсловияСделокСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Период КАК Период,
			|	ИзменениеУсловийСделки.Организация КАК Организация,
			|	ИзменениеУсловийСделки.Основание КАК Сделка,
			|	ИзменениеУсловийСделки.Рынок КАК Рынок,
			|	НоваяКорзинаЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|				И НоваяКорзинаЦенныхБумаг.Сумма = 0
			|				И НоваяКорзинаЦенныхБумаг.СуммаКупона = 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Отменено,
			|	НоваяКорзинаЦенныхБумаг.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ИзменениеУсловийСделки.ДатаИсполнения
			|		ИНАЧЕ _ПредУсловияСделки.ДатаИсполнения
			|	КОНЕЦ КАК ДатаИсполнения,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ВЫБОР
			|					КОГДА _ПредУсловияСделки.РаздельноеИсполнение
			|						ТОГДА ИзменениеУсловийСделки.ДатаОплаты
			|					ИНАЧЕ ИзменениеУсловийСделки.ДатаИсполнения
			|				КОНЕЦ
			|		ИНАЧЕ _ПредУсловияСделки.ДатаОплаты
			|	КОНЕЦ КАК ДатаОплаты,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ВЫБОР
			|					КОГДА _ПредУсловияСделки.РаздельноеИсполнение
			|						ТОГДА ИзменениеУсловийСделки.ДатаПоставки
			|					ИНАЧЕ ИзменениеУсловийСделки.ДатаИсполнения
			|				КОНЕЦ
			|		ИНАЧЕ _ПредУсловияСделки.ДатаПоставки
			|	КОНЕЦ КАК ДатаПоставки,
			|	ИзменениеУсловийСделки.ВалютаОплаты КАК ВалютаОплаты,
			|	ИзменениеУсловийСделки.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
			|	ИзменениеУсловийСделки.КурсОплаты КАК КурсОплаты,
			|	ИзменениеУсловийСделки.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки,
			|	НоваяКорзинаЦенныхБумаг.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|			ТОГДА 0
			|		ИНАЧЕ НоваяКорзинаЦенныхБумаг.Сумма / НоваяКорзинаЦенныхБумаг.Количество
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА ИзменениеУсловийСделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ИзменениеУсловийСделки.ВалютаОплаты = НоваяКорзинаЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала
			|				И НоваяКорзинаЦенныхБумаг.Количество > 0
			|				И НоминалыЦенныхБумагСрезПоследних.Номинал > 0
			|			ТОГДА НоваяКорзинаЦенныхБумаг.Сумма / НоваяКорзинаЦенныхБумаг.Количество / НоминалыЦенныхБумагСрезПоследних.Номинал * 100
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЦенаПроцент,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|			ТОГДА 0
			|		ИНАЧЕ НоваяКорзинаЦенныхБумаг.СуммаКупона / НоваяКорзинаЦенныхБумаг.Количество
			|	КОНЕЦ КАК ЦенаКупона,
			|	НоваяКорзинаЦенныхБумаг.Сумма КАК Сумма,
			|	НоваяКорзинаЦенныхБумаг.СуммаКупона КАК СуммаКупона,
			|	_ПредУсловияСделки.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	_ПредУсловияСделки.РаздельноеИсполнение КАК РаздельноеИсполнение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка КАК Ссылка,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.Количество) КАК Количество,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.Сумма) КАК Сумма,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.СуммаКупона) КАК СуммаКупона
			|	ИЗ
			|		Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
			|	ГДЕ
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ДепозитарныйСчет) КАК НоваяКорзинаЦенныхБумаг
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПредУсловияСделки КАК _ПредУсловияСделки
			|		ПО (ИСТИНА)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
			|		ПО НоваяКорзинаЦенныхБумаг.Ссылка = ИзменениеУсловийСделки.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага В (&ЦенныеБумаги)) КАК НоминалыЦенныхБумагСрезПоследних
			|		ПО НоваяКорзинаЦенныхБумаг.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&Период,
			|	УсловияСделокРЕПОСрезПоследних.Организация,
			|	УсловияСделокРЕПОСрезПоследних.Сделка,
			|	УсловияСделокРЕПОСрезПоследних.Рынок,
			|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага,
			|	ИСТИНА,
			|	УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет,
			|	УсловияСделокРЕПОСрезПоследних.ДатаИсполнения,
			|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты,
			|	УсловияСделокРЕПОСрезПоследних.ДатаПоставки,
			|	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты,
			|	УсловияСделокРЕПОСрезПоследних.СобственныйКурсОплаты,
			|	УсловияСделокРЕПОСрезПоследних.КурсОплаты,
			|	УсловияСделокРЕПОСрезПоследних.ПлатежноеУсловиеСделки,
			|	УсловияСделокРЕПОСрезПоследних.Количество,
			|	УсловияСделокРЕПОСрезПоследних.Сумма,
			|	УсловияСделокРЕПОСрезПоследних.СуммаКупона,
			|	УсловияСделокРЕПОСрезПоследних.Цена,
			|	УсловияСделокРЕПОСрезПоследних.ЦенаПроцент,
			|	УсловияСделокРЕПОСрезПоследних.ЦенаКупона,
			|	УсловияСделокРЕПОСрезПоследних.ОтложенноеИсполнение,
			|	УсловияСделокРЕПОСрезПоследних.РаздельноеИсполнение
			|ИЗ
			|	РегистрСведений.УсловияСделок.СрезПоследних(
			|			&Период,
			|			НЕ Отменено
			|				И Сделка = &Сделка
			|				И НЕ ЦеннаяБумага В (&ЦенныеБумаги)) КАК УсловияСделокРЕПОСрезПоследних";
			
	ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	УсловияСделокСрезПоследних.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаИсполнения,
			|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
			|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
			|	УсловияСделокСрезПоследних.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	УсловияСделокСрезПоследних.РаздельноеИсполнение КАК РаздельноеИсполнение,
			|	УсловияСделокСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО
			|ПОМЕСТИТЬ _ПредУсловияСделки
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&Период,
			|			СделкаРЕПО = &Сделка
			|				И ВидЗадолженности = &ВидЗадолженности
			|				И НЕ Отменено) КАК УсловияСделокСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&Период КАК Период,
			|	ИзменениеУсловийСделки.Организация КАК Организация,
			|	ИзменениеУсловийСделки.Основание КАК СделкаРЕПО,
			|	_ПредУсловияСделки.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
			|	ИзменениеУсловийСделки.Рынок КАК Рынок,
			|	НоваяКорзинаЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|				И НоваяКорзинаЦенныхБумаг.Сумма = 0
			|				И НоваяКорзинаЦенныхБумаг.СуммаКупона = 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Отменено,
			|	НоваяКорзинаЦенныхБумаг.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|	ИзменениеУсловийСделки.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ИзменениеУсловийСделки.ДатаИсполнения
			|		КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|			ТОГДА ИзменениеУсловийСделки.ДатаВторойЧастиРЕПО
			|		ИНАЧЕ _ПредУсловияСделки.ДатаИсполнения
			|	КОНЕЦ КАК ДатаИсполнения,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ВЫБОР
			|					КОГДА _ПредУсловияСделки.РаздельноеИсполнение
			|						ТОГДА ИзменениеУсловийСделки.ДатаОплаты
			|					ИНАЧЕ ИзменениеУсловийСделки.ДатаИсполнения
			|				КОНЕЦ
			|		КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|			ТОГДА ИзменениеУсловийСделки.ДатаВторойЧастиРЕПО
			|		ИНАЧЕ _ПредУсловияСделки.ДатаОплаты
			|	КОНЕЦ КАК ДатаОплаты,
			|	ВЫБОР
			|		КОГДА _ПредУсловияСделки.ОтложенноеИсполнение
			|			ТОГДА ВЫБОР
			|					КОГДА _ПредУсловияСделки.РаздельноеИсполнение
			|						ТОГДА ИзменениеУсловийСделки.ДатаПоставки
			|					ИНАЧЕ ИзменениеУсловийСделки.ДатаИсполнения
			|				КОНЕЦ
			|		КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
			|			ТОГДА ИзменениеУсловийСделки.ДатаВторойЧастиРЕПО
			|		ИНАЧЕ _ПредУсловияСделки.ДатаПоставки
			|	КОНЕЦ КАК ДатаПоставки,
			|	ИзменениеУсловийСделки.ВалютаОплаты КАК ВалютаОплаты,
			|	ИзменениеУсловийСделки.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
			|	ИзменениеУсловийСделки.КурсОплаты КАК КурсОплаты,
			|	ИзменениеУсловийСделки.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки,
			|	НоваяКорзинаЦенныхБумаг.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|			ТОГДА 0
			|		ИНАЧЕ НоваяКорзинаЦенныхБумаг.Сумма / НоваяКорзинаЦенныхБумаг.Количество
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА ИзменениеУсловийСделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И ИзменениеУсловийСделки.ВалютаОплаты = НоваяКорзинаЦенныхБумаг.ЦеннаяБумага.ВалютаНоминала
			|				И НоваяКорзинаЦенныхБумаг.Количество > 0
			|				И НоминалыЦенныхБумагСрезПоследних.Номинал > 0
			|			ТОГДА НоваяКорзинаЦенныхБумаг.Сумма / НоваяКорзинаЦенныхБумаг.Количество / НоминалыЦенныхБумагСрезПоследних.Номинал * 100
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЦенаПроцент,
			|	ВЫБОР
			|		КОГДА НоваяКорзинаЦенныхБумаг.Количество = 0
			|			ТОГДА 0
			|		ИНАЧЕ НоваяКорзинаЦенныхБумаг.СуммаКупона / НоваяКорзинаЦенныхБумаг.Количество
			|	КОНЕЦ КАК ЦенаКупона,
			|	НоваяКорзинаЦенныхБумаг.Сумма КАК Сумма,
			|	НоваяКорзинаЦенныхБумаг.СуммаКупона КАК СуммаКупона,
			|	_ПредУсловияСделки.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
			|	_ПредУсловияСделки.РаздельноеИсполнение КАК РаздельноеИсполнение,
			|	ИзменениеУсловийСделки.СтавкаРЕПО КАК СтавкаРЕПО
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка КАК Ссылка,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.Количество) КАК Количество,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.Сумма) КАК Сумма,
			|		СУММА(ИзменениеУсловийСделкиЦенныеБумаги.СуммаКупона) КАК СуммаКупона
			|	ИЗ
			|		Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
			|	ГДЕ
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзменениеУсловийСделкиЦенныеБумаги.Ссылка,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага,
			|		ИзменениеУсловийСделкиЦенныеБумаги.ДепозитарныйСчет) КАК НоваяКорзинаЦенныхБумаг
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПредУсловияСделки КАК _ПредУсловияСделки
			|		ПО (ИСТИНА)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
			|		ПО НоваяКорзинаЦенныхБумаг.Ссылка = ИзменениеУсловийСделки.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ЦеннаяБумага В (&ЦенныеБумаги)) КАК НоминалыЦенныхБумагСрезПоследних
			|		ПО НоваяКорзинаЦенныхБумаг.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&Период,
			|	УсловияСделокРЕПОСрезПоследних.Организация,
			|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.Рынок,
			|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага,
			|	ИСТИНА,
			|	УсловияСделокРЕПОСрезПоследних.ДепозитарныйСчет,
			|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО,
			|	УсловияСделокРЕПОСрезПоследних.ДатаИсполнения,
			|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты,
			|	УсловияСделокРЕПОСрезПоследних.ДатаПоставки,
			|	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты,
			|	УсловияСделокРЕПОСрезПоследних.СобственныйКурсОплаты,
			|	УсловияСделокРЕПОСрезПоследних.КурсОплаты,
			|	УсловияСделокРЕПОСрезПоследних.ПлатежноеУсловиеСделки,
			|	УсловияСделокРЕПОСрезПоследних.Количество,
			|	УсловияСделокРЕПОСрезПоследних.Сумма,
			|	УсловияСделокРЕПОСрезПоследних.СуммаКупона,
			|	УсловияСделокРЕПОСрезПоследних.Цена,
			|	УсловияСделокРЕПОСрезПоследних.ЦенаПроцент,
			|	УсловияСделокРЕПОСрезПоследних.ЦенаКупона,
			|	УсловияСделокРЕПОСрезПоследних.ОтложенноеИсполнение,
			|	УсловияСделокРЕПОСрезПоследних.РаздельноеИсполнение,
			|	УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО
			|ИЗ
			|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
			|			&Период,
			|			НЕ Отменено
			|				И СделкаРЕПО = &Сделка
			|				И ВидЗадолженности = &ВидЗадолженности
			|				И НЕ ЦеннаяБумага В (&ЦенныеБумаги)) КАК УсловияСделокРЕПОСрезПоследних";		
			
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Период",           ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Ссылка",           ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	Запрос.УстановитьПараметр("ЦенныеБумаги",     ЭтотОбъект.ЦенныеБумаги.ВыгрузитьКолонку("ЦеннаяБумага"));
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьНовыеУсловияСделки

Функция ПолучитьСторноПоВозвратномуКупону()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеУсловийСделки.Основание КАК Основание,
		|	ИзменениеУсловийСделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	-ИзменениеУсловийСделки.ВозвратныйКупонКЗачету КАК СуммаКупона,
		|	0 КАК Сумма,
		|	0 КАК Аванс,
		|	ИзменениеУсловийСделки.Организация КАК Организация,
		|	ИзменениеУсловийСделки.Основание.ВалютаСделки КАК Валюта,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийСделки.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода) КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийСделки.Основание.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ИзменениеУсловийСделки.Основание.Брокер.ЮрФизЛицо
		|		ИНАЧЕ ИзменениеУсловийСделки.Основание.Контрагент
		|	КОНЕЦ КАК Контрагент
		|ИЗ
		|	Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = ИзменениеУсловийСделки.Ссылка
		|ГДЕ
		|	ИзменениеУсловийСделки.Ссылка = &Ссылка
		|	И ИзменениеУсловийСделкиЦенныеБумаги.НомерСтроки = 1";
		
	Запрос.УстановитьПараметр("Ссылка",           ЭтотОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(ЭтотОбъект.Основание) = тип("ДокументСсылка.СделкаРЕПО") И ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2, ЭтотОбъект.Основание.ПерваяЧастьРЕПО, ЭтотОбъект.Основание));
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ИсполненныеПоставкиЦенныхБумагСоответствуютДвижениям(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ИзменениеУсловийСделкиЦенныеБумаги.Количество) КАК Количество
		|ПОМЕСТИТЬ _ИсполненныеУсловияСделкиИзДокумента
		|ИЗ
		|	Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеУсловийСделкиЦенныеБумаги
		|ГДЕ
		|	ИзменениеУсловийСделкиЦенныеБумаги.Ссылка = &Ссылка
		|	И ИзменениеУсловийСделкиЦенныеБумаги.Исполнено
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИзменениеУсловийСделкиЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага,
		|	СУММА(ЗадолженностиПоЦеннымБумагам.Количество) КАК Количество
		|ПОМЕСТИТЬ _ИсполненныеУсловияСделкиИзРегистра
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам КАК ЗадолженностиПоЦеннымБумагам
		|ГДЕ
		|	ЗадолженностиПоЦеннымБумагам.Период <= &Период
		|	И ЗадолженностиПоЦеннымБумагам.Основание = &Основание
		|	И ЗадолженностиПоЦеннымБумагам.ВидЗадолженности = &ВидЗадолженности
		|	И ЗадолженностиПоЦеннымБумагам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ЗадолженностиПоЦеннымБумагам.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗадолженностиПоЦеннымБумагам.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполненныеУсловия.ЦеннаяБумага,
		|	_ИсполненныеУсловияСделкиИзДокумента.Количество КАК КоличествоВДокументе,
		|	_ИсполненныеУсловияСделкиИзРегистра.Количество КАК КоличествоВРегистре
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ИсполненныеУсловияСделкиИзДокумента.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ИсполненныеУсловияСделкиИзДокумента.Количество КАК Количество
		|	ИЗ
		|		_ИсполненныеУсловияСделкиИзДокумента КАК _ИсполненныеУсловияСделкиИзДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ИсполненныеУсловияСделкиИзРегистра.ЦеннаяБумага,
		|		-_ИсполненныеУсловияСделкиИзРегистра.Количество
		|	ИЗ
		|		_ИсполненныеУсловияСделкиИзРегистра КАК _ИсполненныеУсловияСделкиИзРегистра) КАК ИсполненныеУсловия
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИсполненныеУсловияСделкиИзДокумента КАК _ИсполненныеУсловияСделкиИзДокумента
		|		ПО ИсполненныеУсловия.ЦеннаяБумага = _ИсполненныеУсловияСделкиИзДокумента.ЦеннаяБумага
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИсполненныеУсловияСделкиИзРегистра КАК _ИсполненныеУсловияСделкиИзРегистра
		|		ПО ИсполненныеУсловия.ЦеннаяБумага = _ИсполненныеУсловияСделкиИзРегистра.ЦеннаяБумага
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсполненныеУсловия.ЦеннаяБумага,
		|	_ИсполненныеУсловияСделкиИзДокумента.Количество,
		|	_ИсполненныеУсловияСделкиИзРегистра.Количество
		|
		|ИМЕЮЩИЕ
		|	СУММА(ИсполненныеУсловия.Количество) <> 0";
		
	Запрос.УстановитьПараметр("Период",           ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Ссылка",           ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Основание",        ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Исполненные условия сделки по ц/б " + Выборка.ЦеннаяБумага + " не соответствуют расходу задолженности. В документе количество " + Выборка.КоличествоВДокументе + ", в регистре " + Выборка.КоличествоВРегистре + ".",,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры // ИсполненныеПоставкиЦенныхБумагСоответствуютДвижениям

Процедура УстановитьБлокировки(ТипОснования)
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияСделок");
		ЭлементБлокировкиДанных.УстановитьЗначение("Сделка", ЭтотОбъект.Основание);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияСделокРЕПО");
		ЭлементБлокировкиДанных.УстановитьЗначение("СделкаРЕПО",      ЭтотОбъект.Основание);
		ЭлементБлокировкиДанных.УстановитьЗначение("ЧастьСделкиРЕПО", РаботаСЗадолженностямиКлиентСерверПовтИсп.ПолучитьЧастьСделкиРЕПОПоВидуЗадолженности(ЭтотОбъект.ВидЗадолженности));
	КонецЕсли;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоЦеннымБумагам");
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",        ЭтотОбъект.Основание);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",        ЭтотОбъект.Основание);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура СформироватьДвиженияПоОперациямСЦеннымиБумагами()
	
	Движения.ОперацииСЦеннымиБумагами.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзменениеСделки.Ссылка КАК Операция,
		|	ИзменениеСделки.Основание,
		|	ИзменениеСделки.Организация,
		|	ИзменениеСделки.СчетДоверительногоУправления,
		|	ИзменениеСделки.Рынок,
		|	ИзменениеСделкиЦенныеБумаги.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО) ТОГДА 1
		|		КОГДА ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО) ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧастьСделкиРЕПО,
		|	ВЫБОР
		|		КОГДА ИзменениеСделки.Основание.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеСделки.Основание.РаздельноеИсполнение
		|						ТОГДА ИзменениеСделки.ДатаПоставки
		|					ИНАЧЕ ИзменениеСделки.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаПоставкиПлановая,
		|	ВЫБОР
		|		КОГДА ИзменениеСделки.Основание.ОтложенноеИсполнение
		|			ТОГДА ВЫБОР
		|					КОГДА ИзменениеСделки.Основание.РаздельноеИсполнение
		|						ТОГДА ИзменениеСделки.ДатаОплаты
		|					ИНАЧЕ ИзменениеСделки.ДатаИсполнения
		|				КОНЕЦ
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаОплатыПлановая,
		|	ИзменениеСделки.Основание.ВалютаСделки КАК Валюта,
		|	ИзменениеСделкиЦенныеБумаги.Количество,
		|	ИзменениеСделкиЦенныеБумаги.Цена,
		|	ИзменениеСделкиЦенныеБумаги.ЦенаПроцент,
		|	ИзменениеСделкиЦенныеБумаги.ЦенаКупона,
		|	ИзменениеСделкиЦенныеБумаги.Сумма,
		|	ИзменениеСделкиЦенныеБумаги.СуммаКупона,				
		|	ИзменениеСделки.Дата КАК ДатаОперации
		|ИЗ
		|	Документ.ИзменениеУсловийСделки.ЦенныеБумаги КАК ИзменениеСделкиЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеСделки
		|			ПО ИзменениеСделкиЦенныеБумаги.Ссылка = ИзменениеСделки.Ссылка
		|ГДЕ
		|	ИзменениеСделки.Ссылка = &Ссылка";		
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Движения.ОперацииСЦеннымиБумагами.Загрузить(
		Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры // СформироватьДвиженияПоОперациямСЦеннымиБумагами

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	ТипОснования = ТипЗнч(ЭтотОбъект.Основание);
	
	УстановитьБлокировки(ТипОснования);
	
	// блокирующая проверка
	ИсполненныеПоставкиЦенныхБумагСоответствуютДвижениям(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// т.к. по регистрам сведений нет автоматической отмены движений при перепроведении,
	// выполним эту операцию вручную
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		Движения.УсловияСделок.Записать();
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Движения.УсловияСделокРЕПО.Записать();
	КонецЕсли;
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);

	Движения.ЗадолженностиПоДенежнымСредствам.Записывать   	= Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать 		= Истина;
	Движения.ЗадолженностиПоВторойЧастиРЕПО.Записывать 		= Истина;
	
	НовыеУсловияСделки = ПолучитьНовыеУсловияСделки();
	
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		Движения.УсловияСделок.Загрузить(НовыеУсловияСделки);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Движения.УсловияСделокРЕПО.Загрузить(НовыеУсловияСделки);
	КонецЕсли;
	
	Если ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") и ЭтотОбъект.ВозвратныйКупонКЗачету <> 0 Тогда
		РаботаСРегистрамиНакопления.СформироватьДвижения(Движения.ЗадолженностиПоДенежнымСредствам, ВидДвиженияНакопления.Приход,
		ЭтотОбъект.Дата, ПолучитьСторноПоВозвратномуКупону());
	КонецЕсли;
	
	Если ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") и ЭтотОбъект.Основание.ЧастьСделкиРЕПО <> 0 Тогда
		
		РаботаСРегистрамиНакопления.СформироватьДвижения(Движения.ЗадолженностиПоВторойЧастиРЕПО, ВидДвиженияНакопления.Приход,
		ЭтотОбъект.Дата, ПолучитьИзмененияЗадолженностиПоВторойЧастиРепо());
				
	Иначе	
		
		// воспользуемся НОВОЙ схемой проведения: сначала сформируем движения, а потом проверим остатки
		РаботаСРегистрамиНакопления.СформироватьДвижения(Движения.ЗадолженностиПоДенежнымСредствам, ВидДвиженияНакопления.Приход,
		ЭтотОбъект.Дата, ПолучитьИзмененияЗадолженностиПоДенежнымСредствамПоСделке());
		
		РаботаСРегистрамиНакопления.СформироватьДвижения(Движения.ЗадолженностиПоЦеннымБумагам, ВидДвиженияНакопления.Приход,
		ЭтотОбъект.Дата, ПолучитьИзмененияЗадолженностиПоЦеннымБумагам());
		
		//Для внебиржевых сделок при изменении условий сделки (после полной поставки) движения по регистру "Задолженности по ценным бумагам" не формируем.   
		
		//Для корректной работы проверки - движения должны быть записаны до проверки.
		Движения.ЗадолженностиПоЦеннымБумагам.Записать();
		Движения.ЗадолженностиПоДенежнымСредствам.Записать();
		
		Запрос = Новый Запрос;
#Область ТЕКСТ_ЗАПРОСА
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	""[Задолженности по ценным бумагам]"" КАК Регистр,
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток < 0
			|			ТОГДА "" суммы [%1 %3]""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток < 0
			|			ТОГДА "" суммы купона [%2 %3]""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток < 0
			|			ТОГДА "" количества [%4] ценных бумаг [%5]""
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Ресурс,
			|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК Парам1,
			|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток КАК Парам2,
			|	ЗадолженностиПоЦеннымБумагамОстатки.Валюта КАК Парам3,
			|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК Парам4,
			|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК Парам5
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
			|			&Период,
			|			Основание = &Основание
			|				И ВидЗадолженности = &ВидЗадолженности) КАК ЗадолженностиПоЦеннымБумагамОстатки
			|ГДЕ
			|	(ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток < 0
			|			ИЛИ ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток < 0
			|			ИЛИ ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток < 0)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	""[Задолженности по денежным средствам]"",
			|	ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток < 0
			|			ТОГДА "" суммы [%1 %3]""
			|		ИНАЧЕ """"
			|	КОНЕЦ + ВЫБОР
			|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток < 0
			|			ТОГДА "" суммы купона [%2 %3]""
			|		ИНАЧЕ """"
			|	КОНЕЦ,
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток,
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
			|	0,
			|	NULL
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&Период,
			|			Основание = &Основание
			|				И ВидЗадолженности = &ВидЗадолженности) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|ГДЕ
			|	(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток < 0
			|			ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток < 0)";
#КонецОбласти		
		Запрос.УстановитьПараметр("Период"          , Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Основание"       , ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("Документ не будет проведен, т.к. это приведет к отрицательному остатку" + Выборка.Ресурс + " на регистре " + Выборка.Регистр + ".", Выборка.Парам1, Выборка.Парам2, Выборка.Парам3, Выборка.Парам4, Выборка.Парам5),,,, Отказ);
		КонецЦикла;
					
	КонецЕсли; 
	
	// Зафиксируем новые условия
	Если Не Отказ Тогда
		Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
			Движения.УсловияСделок.Записывать     = Истина;
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
			Движения.УсловияСделокРЕПО.Записывать = Истина;
		КонецЕсли;
		
		СформироватьДвиженияПоОперациямСЦеннымиБумагами();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Сделка = ЭтотОбъект.Основание;
	//отражаем по главе Г сделку Т+
	Если Сделка.ОтложенноеИсполнение 
		И НачалоДня(Сделка.ДатаОплаты) 		> НачалоДня(Сделка.Дата)
		И НачалоДня(Сделка.ДатаПоставки) 	> НачалоДня(Сделка.Дата) Тогда
		
		Если Сделка.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			Контрагент 				= Сделка.Брокер.ЮрФизЛицо;
		Иначе
			Контрагент 				= Сделка.Контрагент;
		КонецЕсли;
		
		КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ЭтотОбъект.Организация);
		
		Если Сделка.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагКПолучению.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	СУММА(БухПартииЦенныхБумагКПолучению.Количество) КАК Количество,
				|	СУММА(БухПартииЦенныхБумагКПолучению.Стоимость) КАК Стоимость,
				|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупона) КАК СтоимостьКупона,
				|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
				|	СУММА(БухПартииЦенныхБумагКПолучению.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумагКПолучению КАК БухПартииЦенныхБумагКПолучению
				|ГДЕ
				|	БухПартииЦенныхБумагКПолучению.Регистратор = &Регистратор
				|	И БухПартииЦенныхБумагКПолучению.ВидУчета = &ВидУчета
				|
				|СГРУППИРОВАТЬ ПО
				|	БухПартииЦенныхБумагКПолучению.ЦеннаяБумага,
				|	БухПартииЦенныхБумагКПолучению.Рынок,
				|	БухПартииЦенныхБумагКПолучению.УчетныйАктивЕПС";
			
			Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СуммаЦБ = ВыборкаДетальныеЗаписи.Стоимость + ВыборкаДетальныеЗаписи.СтоимостьКупона;
				СуммаЦБВВалютеУчета = ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета + ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчета;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБВВалютеУчета, "Отражены требования по поставке ЦБ");
				
				// дебет
				Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
				
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
				
				ВалютаНоминала = ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СуммаЦБ;
				Проводка.КоличествоДт = ВыборкаДетальныеЗаписи.Количество;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаЦБ, "Отражены обязательства по поставке ДС");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				// кредит
				Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
				Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
				
				Проводка.ВалютаКт = Сделка.ВалютаСделки;
				Проводка.ВалютнаяСуммаКт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаЦБВВалютеУчета, ЭтотОбъект.Организация.ВалютаУчета, ЭтотОбъект.Дата, Сделка.ВалютаСделки, ЭтотОбъект.Дата);
			КонецЦикла;
			
		ИначеЕсли Сделка.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			
			//только одна строка без замены бумаги и количества!
			Если Сделка.ЦенныеБумаги.Количество()<>1 
				ИЛИ ЭтотОбъект.ЦенныеБумаги.Количество()<>1 
				ИЛИ Сделка.ЦенныеБумаги[0].ЦеннаяБумага<>ЭтотОбъект.ЦенныеБумаги[0].ЦеннаяБумага
				ИЛИ Сделка.ЦенныеБумаги[0].Количество<>ЭтотОбъект.ЦенныеБумаги[0].Количество Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение условий сделки с заменой бумаг или их количества не будут обработаны при расчете партий: "+ВыборкаДетальныеЗаписи.Регистратор,,,Отказ);
				Возврат;
				
			Иначе
				
				_ВалютаОплаты = ЭтотОбъект.ВалютаОплаты;
				Если _ВалютаОплаты.Пустая() Тогда
					_ВалютаОплаты = Сделка.ВалютаСделки;
				КонецЕсли;
				
				Для каждого СтрокаДокумента из ЭтотОбъект.ЦенныеБумаги Цикл
					
					СтрокаСделки 	= Сделка.ЦенныеБумаги[СтрокаДокумента.НомерСтроки-1];
					
					ИзменениеСуммы  = СтрокаДокумента.Сумма - СтрокаСделки.Сумма;
					ИзменениеКупона = СтрокаДокумента.СуммаКупона - СтрокаСделки.СуммаКупона;
					ИзменениеКоличества = СтрокаДокумента.Количество - СтрокаСделки.Количество;
					
					Если ИзменениеСуммы = 0 И ИзменениеКупона = 0 И ИзменениеКоличества = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СуммаВал = ИзменениеСуммы + ИзменениеКупона;
					
					ВалютаНоминала = СтрокаДокумента.ЦеннаяБумага.ВалютаНоминала;
					
					СуммаВалЦБ = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, Сделка.ВалютаСделки, ЭтотОбъект.Дата, ВалютаНоминала, ЭтотОбъект.Дата, Отказ);
					СуммаВалДС = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаВал, Сделка.ВалютаСделки, ЭтотОбъект.Дата, 
						_ВалютаОплаты, ?(ЭтотОбъект.СобственныйКурсОплаты, ЭтотОбъект.КурсОплаты, ЭтотОбъект.Дата), Отказ);
						
					СуммаРубДС = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалДС, _ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
					СуммаРубЦБ = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВалЦБ, ВалютаНоминала, ЭтотОбъект.Организация, ЭтотОбъект.Дата, Отказ);
					
					// проводка ДС
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубДС, "Отражены требования по поставке ДС");
					
					// дебет
					Проводка.СчетДт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
					
					Проводка.СубконтоДт.ОснованиеРасчетов = Сделка;
					
					Проводка.ВалютаДт = Сделка.ВалютаСделки;
					Проводка.ВалютнаяСуммаДт = СуммаВалДС;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					
					// проводка ЦБ
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаРубЦБ, "Отражены обязательства по поставке ЦБ");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// кредит
					Проводка.СчетКт = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01);
					Проводка.СубконтоКт.ОснованиеРасчетов = Сделка;
					Проводка.СубконтоКт.ЦенныеБумаги = СтрокаДокумента.ЦеннаяБумага;
					
					Проводка.ВалютаКт = ВалютаНоминала;
					Проводка.ВалютнаяСуммаКт = СуммаВалЦБ;
					Проводка.КоличествоКт = ИзменениеКоличества;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
			
	Если ИзменилисьДоговорныеУсловияСделкиРЕПО() Тогда
		ПереоценкаРЕПО(УчетныйРегистр, Отказ);
	КонецЕсли;
	
	Если ВозвратныйКупонКЗачету <> 0  Тогда
		ДвиженияБУПоВозвратномуКупону(УчетныйРегистр, Отказ);
	КонецЕсли;	
	
	НастройкиУчетаОбщие  = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
	
	БухгалтерскийУчет.ПереоценитьВалютныеАктивы(ЭтотОбъект, УчетныйРегистр, Перечисления.ВидыУчета[УчетныйРегистр], НастройкиУчетаОбщие, Отказ);
			
КонецПроцедуры

Процедура ПогашениеЗалоговогоКупонаНаЗабалансовомСчете(УчетныйРегистр)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.Организация КАК Организация,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.ЦеннаяБумага КАК ЦеннаяБумага,
	                      |	ВЫРАЗИТЬ(БухПартииЦенныхБумагКупленныеПоРЕПО.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала КАК ВалютаНоминала,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупона КАК СтоимостьКупона,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.Стоимость КАК Стоимость,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета
	                      |ИЗ
	                      |	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО КАК БухПартииЦенныхБумагКупленныеПоРЕПО
	                      |ГДЕ
	                      |	БухПартииЦенныхБумагКупленныеПоРЕПО.Регистратор = &Регистратор
	                      |	И НЕ(БухПартииЦенныхБумагКупленныеПоРЕПО.Количество = 0
	                      |				И БухПартииЦенныхБумагКупленныеПоРЕПО.Стоимость = 0
	                      |				И БухПартииЦенныхБумагКупленныеПоРЕПО.СтоимостьКупона = 0
	                      |				И БухПартииЦенныхБумагКупленныеПоРЕПО.Переоценка = 0
	                      |				И БухПартииЦенныхБумагКупленныеПоРЕПО.ПереоценкаКупона = 0)");
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
					
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.СтоимостьКупонаВВалютеУчета, "Изменение условий сделки");
		
		Проводка.СчетКт = ПланыСчетов.Основной.ПартииРЕПОПокупкаКупон;
		Проводка.СубконтоКт.ЦенныеБумаги = Выборка.ЦеннаяБумага;
		
		Проводка.ВалютнаяСуммаКт = Выборка.СтоимостьКупона; 
		Проводка.ВалютаКт = Выборка.ВалютаНоминала;
		
		Если Выборка.Стоимость > 0 Тогда
									
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.СтоимостьВВалютеУчета, "Изменение условий сделки");
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПартииРЕПОПокупкаТело;
			Проводка.СубконтоКт.ЦенныеБумаги = Выборка .ЦеннаяБумага;
		
			Проводка.ВалютнаяСуммаКт = Выборка.Стоимость; 
			Проводка.ВалютаКт = Выборка.ВалютаНоминала;
			
		КонецЕсли;   
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыСделкиРЕПО(Основание)
	
	ПараметрыСделки = Новый Структура("Ссылка, Дата, Организация, ВидСделки, Брокер, СчетДоверительногоУправления, ЦеннаяБумага, 
	 									|КонтрагентПоСделке, ВалютаУчетаОрганизации, ЧастьСделкиРЕПО, ВалютаСделки, МестоХранения");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СделкаРЕПО.Ссылка КАК Ссылка,
	                      |	СделкаРЕПО.Дата КАК Дата,
	                      |	СделкаРЕПО.ВидСделки КАК ВидСделки,
	                      |	СделкаРЕПО.Брокер КАК Брокер,
	                      |	СделкаРЕПО.Брокер.ЮрФизЛицо КАК КонтрагентПоСделке,
	                      |	СделкаРЕПО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	                      |	СделкаРЕПО.Организация КАК Организация,
	                      |	СделкаРЕПО.Организация.ВалютаУчета КАК ВалютаУчетаОрганизации,
						  |	СделкаРЕПО.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,						  
						  |	СделкаРЕПО.ВалютаСделки КАК ВалютаСделки,
						  |	СделкаРЕПО.МестоХранения КАК МестоХранения,						  
	                      |	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	                      |ИЗ
	                      |	Документ.СделкаРЕПО КАК СделкаРЕПО
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
	                      |		ПО СделкаРЕПО.Ссылка = СделкаРЕПОЦенныеБумаги.Ссылка
	                      |			И (1 = СделкаРЕПОЦенныеБумаги.НомерСтроки)
	                      |ГДЕ
	                      |	СделкаРЕПО.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСделки, Выборка);
	КонецЕсли; 
	
	Возврат ПараметрыСделки;
	
КонецФункции

Функция ЭтоПерваяЧастьСделкиРЕПО(ЧастьСделкиРЕПО, МестоХранения)
	
	Если МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ВнебиржевойРынок") Тогда
		Возврат ЧастьСделкиРЕПО = 0;
	Иначе
		Возврат ЧастьСделкиРЕПО = 1;
	КонецЕсли;
	
КонецФункции

Функция ИзменилисьДоговорныеУсловияСделкиРЕПО()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПОСрезПоследнихДоИзменения.ЦеннаяБумага КАК ЦеннаяБумага1,
		|	УсловияСделокРЕПОСрезПоследнихПослеИзменения.ЦеннаяБумага КАК ЦеннаяБумага2
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДоИзменения,
		|			Организация = &Организация
		|				И СделкаРЕПО = &Основание
		|				И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследнихДоИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&ПослеИзменения,
		|				Организация = &Организация
		|					И СделкаРЕПО = &Основание
		|					И ЧастьСделкиРЕПО = 2) КАК УсловияСделокРЕПОСрезПоследнихПослеИзменения
		|		ПО УсловияСделокРЕПОСрезПоследнихДоИзменения.ЦеннаяБумага = УсловияСделокРЕПОСрезПоследнихПослеИзменения.ЦеннаяБумага
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ДатаИзменения >= ДАТАВРЕМЯ(2022, 5, 1, 0, 0, 0)
		|				ТОГДА УсловияСделокРЕПОСрезПоследнихДоИзменения.ДатаВторойЧастиРЕПО <> УсловияСделокРЕПОСрезПоследнихПослеИзменения.ДатаВторойЧастиРЕПО
		|						И УсловияСделокРЕПОСрезПоследнихПослеИзменения.ДатаВторойЧастиРЕПО = &ДатаИзменения
		|			ИНАЧЕ УсловияСделокРЕПОСрезПоследнихДоИзменения.СтавкаРЕПО <> УсловияСделокРЕПОСрезПоследнихПослеИзменения.СтавкаРЕПО
		|					ИЛИ УсловияСделокРЕПОСрезПоследнихДоИзменения.ДатаВторойЧастиРЕПО <> УсловияСделокРЕПОСрезПоследнихПослеИзменения.ДатаВторойЧастиРЕПО
		|					ИЛИ НЕ УсловияСделокРЕПОСрезПоследнихПослеИзменения.Отменено
		|					ИЛИ УсловияСделокРЕПОСрезПоследнихДоИзменения.ДатаОплаты <> УсловияСделокРЕПОСрезПоследнихПослеИзменения.ДатаОплаты
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДоИзменения", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПослеИзменения", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("ДатаИзменения", НачалоДня(ЭтотОбъект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

//Для ПИФ УКПИ с апреля 2021 
Процедура НачислитьЗадолженностьКупонаДляОбратногоРЕПО(УчетныйРегистр, Отказ)
	
	Если ВозвратныйКупонКЗачету = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//проверим корзину бумаг
	Если ЭтотОбъект.ЦенныеБумаги.Количество()>1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для корзины бумаг отражение проводок возвратного купона не реализовано. Обратитесь к программистам!",ЭтотОбъект,,,Отказ);
		Возврат;
	КонецЕсли;
	
	//Если купон оплачен эмитентом, то начисление уже было
	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НачислениеПогашенияКупона.Регистратор КАК ПогашениеКупона,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона > 0
		|				ТОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КупонНачисленоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КупонОплачено,
		|	НачислениеПогашенияКупона.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _ПогашениеКупона
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК НачислениеПогашенияКупона
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствамПоПогашению
		|		ПО НачислениеПогашенияКупона.Регистратор = ЗадолженностиПоДенежнымСредствамПоПогашению.Основание
		|			И (ЗадолженностиПоДенежнымСредствамПоПогашению.МоментВремени < &МоментВремени)
		|			И (ЗадолженностиПоДенежнымСредствамПоПогашению.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеКупона КАК ПогашениеКупона
		|		ПО НачислениеПогашенияКупона.Регистратор = ПогашениеКупона.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|		ПО НачислениеПогашенияКупона.Регистратор = ПогашениеЦеннойБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (ПогашениеКупона.Облигация = Облигации.Ссылка
		|				ИЛИ ПогашениеЦеннойБумаги.ЦеннаяБумага = Облигации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (Облигации.Эмитент = Эмитенты.Ссылка)
		|			И (ЗадолженностиПоДенежнымСредствамПоПогашению.Контрагент = Эмитенты.ЮрФизЛицо)
		|ГДЕ
		|	НачислениеПогашенияКупона.Основание = &СделкаРЕПО
		|	И НачислениеПогашенияКупона.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	И НачислениеПогашенияКупона.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|	И НачислениеПогашенияКупона.СуммаКупона > 0
		|	И НачислениеПогашенияКупона.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ТИПЗНАЧЕНИЯ(НачислениеПогашенияКупона.Регистратор) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|	И НЕ Эмитенты.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПогашенияКупона.Регистратор,
		|	НачислениеПогашенияКупона.Контрагент
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона > 0
		|				ТОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона
		|			ИНАЧЕ 0
		|		КОНЕЦ) - СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамПоПогашению.СуммаКупона
		|			ИНАЧЕ 0
		|		КОНЕЦ) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПогашениеКупона УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПогашениеКупона.ПогашениеКупона КАК ПогашениеКупона,
		|	_ПогашениеКупона.КупонНачисленоВсего КАК КупонНачисленоВсего,
		|	_ПогашениеКупона.КупонОплачено КАК КупонОплачено,
		|	_ПогашениеКупона.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ВозвратныйКупонОбратногоРЕПОНачислено КАК ВозвратныйКупонОбратногоРЕПОНачислено
		|ИЗ
		|	_ПогашениеКупона КАК _ПогашениеКупона
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПогашениеКупона.ПогашениеКупона КАК ПогашениеКупона,
		|			СУММА(ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.СуммаКупона) КАК ВозвратныйКупонОбратногоРЕПОНачислено,
		|			ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.Контрагент КАК Контрагент
		|		ИЗ
		|			_ПогашениеКупона КАК _ПогашениеКупона
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО
		|				ПО _ПогашениеКупона.ПогашениеКупона = ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.Регистратор
		|					И (ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода))
		|					И (ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская))
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ПогашениеКупона.ПогашениеКупона,
		|			ЗадолженностиПоВозвратномуКупонуОбратногоРЕПО.Контрагент) КАК ВложенныйЗапрос
		|		ПО _ПогашениеКупона.ПогашениеКупона = ВложенныйЗапрос.ПогашениеКупона";
	Запрос.УстановитьПараметр("СделкаРЕПО", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("МоментВремени", ЭтотОбъект.МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено несколько неоплаченных погашений купона по ценной бумаге. Проверьте правильность проводок начисления",ЭтотОбъект.Ссылка,,,);
	КонецЕсли;
	
	//берем последний купон
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		КупонПоСобственнымБумагам = ВыборкаДетальныеЗаписи.КупонНачисленоВсего - ВыборкаДетальныеЗаписи.ВозвратныйКупонОбратногоРЕПОНачислено;
		ОплаченКупонПоСобственным = Мин(КупонПоСобственнымБумагам, ВыборкаДетальныеЗаписи.КупонОплачено);
		ОплаченКупонПоПолученнымПоРЕПО = Макс(ВыборкаДетальныеЗаписи.КупонОплачено - ОплаченКупонПоСобственным, 0);
		
		Если ОплаченКупонПоПолученнымПоРЕПО >= ВыборкаДетальныеЗаписи.ВозвратныйКупонОбратногоРЕПОНачислено Тогда
			//При оплате купона возвратный купон уже начислился
			Возврат;
		КонецЕсли;
		
		ВалютаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
		ВалютаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.ПогашениеКупона, "ВалютаОплаты");
		Если ВалютаОплаты <> ВалютаУчета Тогда
			СчетВозвратногоКупона = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
			СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации;
		Иначе
			СчетВозвратногоКупона = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
			СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупона;
		КонецЕсли;	
		
		ДоляНеоплаченногоКупона = (1 - ОплаченКупонПоПолученнымПоРЕПО / ВыборкаДетальныеЗаписи.ВозвратныйКупонОбратногоРЕПОНачислено);
		СуммаПроводкиВал = ВозвратныйКупонКЗачету * ДоляНеоплаченногоКупона;
		СуммаПроводки = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ВозвратныйКупонКЗачету,ВалютаЗадолженностиПоКупону,Организация,Дата,Отказ) * ДоляНеоплаченногоКупона;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаПроводки, "Начислена задолженность по возвратному купону");
		
		Проводка.СчетДт = СчетПогашениеКупона;
		Проводка.СубконтоДт.Облигации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.ПогашениеКупона, "Облигация");
		
		Если Проводка.СчетДт.Валютный Тогда
			Проводка.ВалютаДт = ВалютаЗадолженностиПоКупону;
			Проводка.ВалютнаяСуммаДт = СуммаПроводкиВал;
		КонецЕсли;
		
		Если СчетПогашениеКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
			Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.ПогашениеКупона;					
		КонецЕсли;	
	
		Проводка.СчетКт = СчетВозвратногоКупона;
		Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт = ВалютаЗадолженностиПоКупону;
			Проводка.ВалютнаяСуммаКт = СуммаПроводкиВал;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияБУПоВозвратномуКупону(УчетныйРегистр, Отказ)
	
	ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона");
		
	СделкаРЕПО = ПараметрыСделкиРЕПО(Основание);	
	ВалютаСделки = СделкаРЕПО.ВалютаСделки;	
	
	РасчетныеНастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Если РасчетныеНастройкиУчета.ОтражатьЗадолженностьПоПогашениюКупонаДляБумагКупленныхПоРЕПОПоФактуОплаты
		И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаРЕПО")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ВидСделки") = Перечисления.ВидыСделок.Покупка
	Тогда
		НачислитьЗадолженностьКупонаДляОбратногоРЕПО(УчетныйРегистр, Отказ);	
	КонецЕсли;
		
	СуммаВВалютеСделки = ?(ВалютаСделки = ВалютаЗадолженностиПоКупону, ВозвратныйКупонКЗачету, СуммаЗаймаКПогашениюВВалютеСделки);
	
	Если Организация.ВалютаУчета = ВалютаЗадолженностиПоКупону Тогда
		СуммаВВалютеУчета = ВозвратныйКупонКЗачету;
	ИначеЕсли Организация.ВалютаУчета = ВалютаСделки Тогда
		СуммаВВалютеУчета = СуммаЗаймаКПогашениюВВалютеСделки;
	Иначе
		СуммаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаВВалютеСделки, ВалютаСделки, Организация, Дата);
	КонецЕсли;
					
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаВВалютеУчета, "Изменение условий сделки");
	
	Если СделкаРепо.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Продажа")
		И ЭтоПерваяЧастьСделкиРЕПО(СделкаРЕПО.ЧастьСделкиРЕПО, СделкаРЕПО.МестоХранения) Тогда		
		
		// 66.1
		Проводка.СчетДт = ПланыСчетов.Основной.КраткосрочныеКредиты;
			
		Проводка.СубконтоДт.Контрагенты = СделкаРЕПО.КонтрагентПоСделке;
		Проводка.СубконтоДт.СделкаРЕПО = СделкаРЕПО.Ссылка;
			
		Проводка.ВалютаДт = ВалютаСделки;
		Проводка.ВалютнаяСуммаДт = СуммаВВалютеСделки;
		
		Если ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона Тогда
			
			Если ВалютаЗадолженностиПоКупону = СделкаРЕПО.ВалютаУчетаОрганизации Тогда
				// 76.51
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;				
			Иначе
				// 76.55
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;								
				Проводка.ВалютнаяСуммаКт = ВозвратныйКупонКЗачету; 
				Проводка.ВалютаКт = ВалютаЗадолженностиПоКупону;				
			КонецЕсли;					
			
			Проводка.СубконтоКт.Контрагенты = СделкаРЕПО.КонтрагентПоСделке;
						
		Иначе
			
			Если ВалютаЗадолженностиПоКупону = СделкаРЕПО.ВалютаУчетаОрганизации Тогда
				// 76.54
				Проводка.СчетКт = ПланыСчетов.Основной.ПогашениеКупона;
			Иначе
				//76.59
				Проводка.СчетКт = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации;								
				Проводка.ВалютнаяСуммаКт = ВозвратныйКупонКЗачету; 
				Проводка.ВалютаКт = ВалютаЗадолженностиПоКупону;	
				Проводка.СубконтоКт.ОснованиеРасчетов = СделкаРЕПО;
			КонецЕсли;
			
			Проводка.СубконтоКт.Облигации = СделкаРЕПО.ЦеннаяБумага;
						
		КонецЕсли;
				
	ИначеЕсли СделкаРепо.ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") 
		И ЭтоПерваяЧастьСделкиРЕПО(СделкаРЕПО.ЧастьСделкиРЕПО, СделкаРЕПО.МестоХранения) Тогда
		
		// 58.3
		Проводка.СчетКт = ПланыСчетов.Основной.ПредоставленныеЗаймы;
		Проводка.СубконтоКт.Контрагенты = СделкаРЕПО.КонтрагентПоСделке;
		Проводка.СубконтоКт.СделкаРЕПО = СделкаРЕПО.Ссылка;
				
		Проводка.ВалютнаяСуммаКт = СуммаВВалютеСделки; 
		Проводка.ВалютаКт = ВалютаСделки;
		
		Если ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона Тогда
			Если ВалютаЗадолженностиПоКупону = СделкаРЕПО.ВалютаУчетаОрганизации Тогда
				//76.54
				Проводка.СчетДт = ПланыСчетов.Основной.ПогашениеКупона;				
								
			Иначе
				//76.59
				Проводка.СчетДт 			= ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации;
				Проводка.ВалютнаяСуммаДт 	= ВозвратныйКупонКЗачету;
				Проводка.ВалютаДт 			= ВалютаЗадолженностиПоКупону;	
				Проводка.СубконтоДт.ОснованиеРасчетов = СделкаРЕПО;				
			КонецЕсли;									
			Проводка.СубконтоДт.Облигации = СделкаРЕПО.ЦеннаяБумага;
			
		Иначе
			Если ВалютаЗадолженностиПоКупону = СделкаРЕПО.ВалютаУчетаОрганизации Тогда
				//76.51
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;				
			Иначе
				//76.55
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;								
				Проводка.ВалютнаяСуммаДт = ВозвратныйКупонКЗачету; 
				Проводка.ВалютаДт = ВалютаЗадолженностиПоКупону;				
			КонецЕсли;
			
			Проводка.СубконтоДт.Контрагенты = СделкаРЕПО.КонтрагентПоСделке;
			
		КонецЕсли;
		
		ПогашениеЗалоговогоКупонаНаЗабалансовомСчете(УчетныйРегистр);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереоценкаРЕПО(УчетныйРегистр, Отказ)
	
	Если ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
		Возврат;
	КонецЕсли;
	
	Если Основание.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		ВидАктива = Справочники.УчетныеАктивы.РасчетыПоОбратномуРЕПО;
	Иначе
		ВидАктива = Справочники.УчетныеАктивы.РасчетыПоПрямомуРЕПО;
	КонецЕсли;
		
	ПереоцениватьВДеньОперации = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(Дата, Организация, СчетДоверительногоУправления, ВидАктива, УчетныйРегистр, "ПереоцениватьВДеньОперации");
	
	Если НЕ ПереоцениватьВДеньОперации Тогда
		Возврат;
	КонецЕсли;

	ЭтоПрямоеРЕПО = ВидАктива = Справочники.УчетныеАктивы.РасчетыПоПрямомуРЕПО;
	СчетПереоценкиРасчетовПоРЕПО = ?(ЭтоПрямоеРЕПО, ПланыСчетов.Основной.ПроцентыПоКраткосрочнымКредитам, ПланыСчетов.Основной.НалоговыеНачисленияПоРЕПО); 
	
	СправедливаяСтоимостьДоИзменения = ПолучитьСправедливуюСтоимостьСделкиРЕПО(Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая), Перечисления.ВидыУчета[УчетныйРегистр], Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПроцентовДоИзменения = СправедливаяСтоимостьДоИзменения[0].СуммаПроцентов;
	Контрагент = СправедливаяСтоимостьДоИзменения[0].Контрагент;
	
	СправедливаяСтоимостьПослеИзменения = ПолучитьСправедливуюСтоимостьСделкиРЕПО(Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая), Перечисления.ВидыУчета[УчетныйРегистр], Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПроцентовПослеИзменения = СправедливаяСтоимостьПослеИзменения[0].СуммаПроцентов;
	
	НастройкиРЕПО = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, ВидАктива,УчетныйРегистр);
	АналитикаПереоценки = НастройкиРЕПО.АналитикаДоходовОтПереоценки; 
	АналитикаПерекурсовки = НастройкиРЕПО.АналитикаПерекурсовки; 
	АналитикаПервоначальногоПризнания = НастройкиРЕПО.АналитикаПервоначальногоПризнания;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(НалоговыйУчетОстатки.СуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПОВВалютеУчета,
		|	ЕСТЬNULL(НалоговыйУчетОстатки.ВалютнаяСуммаОстаток, 0) КАК НачисленныеПроцентыПоРЕПО,
		|	НалоговыйУчетОстатки.Субконто1 КАК СделкаРЕПО
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
		|			&ВечерВчерашнегоДня,
		|			Счет = &СчетПереоценкиРасчетовПоРЕПО,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СделкаРЕПО),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &СделкаРЕПО) КАК НалоговыйУчетОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВечерВчерашнегоДня", НачалоДня(ЭтотОбъект.Дата)-1);//считаем что "включая" дложно сработать. Проценты начисляются со дня след. за днем исполнения первой части
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СделкаРЕПО", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("СчетПереоценкиРасчетовПоРЕПО", СчетПереоценкиРасчетовПоРЕПО);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", УчетныйРегистр);
	
	СуммаНачисленныхПроцентов = 0;
	СуммаНачисленныхПроцентовВВалютаУчета = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаНачисленныхПроцентов = Выборка.НачисленныеПроцентыПоРЕПО;
		СуммаНачисленныхПроцентовВВалютаУчета = Выборка.НачисленныеПроцентыПоРЕПОВВалютеУчета;
	КонецЕсли;
	
	ВалютаСделкиРЕПО = Основание.ВалютаСделки;
	
	// Перекурсовка Процентов
	СуммаПроцентовПоТекущемуКурсу = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
		СуммаНачисленныхПроцентов,
		ВалютаСделкиРЕПО,
		Организация,
		Дата);
	
	КурсоваяРазницаПроценты = СуммаПроцентовПоТекущемуКурсу - СуммаНачисленныхПроцентовВВалютаУчета;
	               
	Если КурсоваяРазницаПроценты > 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], КурсоваяРазницаПроценты, "Курсовая разница");
		
		Проводка.СчетДт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаДт = ВалютаСделкиРЕПО;
		
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПерекурсовки;
		
	ИначеЕсли КурсоваяРазницаПроценты > 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -КурсоваяРазницаПроценты, "Курсовая разница");
		
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы =  АналитикаПерекурсовки;
		
		Проводка.СчетКт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаКт = ВалютаСделкиРЕПО;
		
	КонецЕсли;
	
	//по старым условиям
	
	ПроцентыПоРЕПО = СуммаПроцентовДоИзменения - СуммаНачисленныхПроцентов;
		
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
		ПроцентыПоРЕПО,
		ВалютаСделкиРЕПО,
		ЭтотОбъект.Организация,
		ЭтотОбъект.Дата);
	
	ЦеннаяБумага = Основание.ЦенныеБумаги[0].ЦеннаяБумага;
	
	СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(
		ЭтотОбъект.Дата,
		Основание,
		УчетныйРегистр);
	
	ОбращаетсяНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
	
	Если ПроцентыПоРЕПО > 0 Тогда
			
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОперации, "% по РЕПО");
		
		// дебет
		Проводка.СчетДт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаДт = ВалютаСделкиРЕПО;
		Проводка.ВалютнаяСуммаДт = ПроцентыПоРЕПО;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПереоценки;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
	ИначеЕсли ПроцентыПоРЕПО < 0 Тогда
			
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -СуммаОперации, "% по РЕПО");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПереоценки;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
		// кредит
		Проводка.СчетКт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаКт = ВалютаСделкиРЕПО;
		Проводка.ВалютнаяСуммаКт = -ПроцентыПоРЕПО;
		
	КонецЕсли;
	
	//по новым условиям
		
	ПроцентыПоРЕПО = СуммаПроцентовПослеИзменения - СуммаПроцентовДоИзменения;
		
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
		ПроцентыПоРЕПО,
		ВалютаСделкиРЕПО,
		ЭтотОбъект.Организация,
		ЭтотОбъект.Дата);
	
	ЦеннаяБумага = Основание.ЦенныеБумаги[0].ЦеннаяБумага;
	
	СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(
		ЭтотОбъект.Дата,
		Основание,
		УчетныйРегистр);
	
	ОбращаетсяНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(ЦеннаяБумага, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
	
	Если ПроцентыПоРЕПО > 0 Тогда
			
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОперации, "% по РЕПО");
		
		// дебет
		Проводка.СчетДт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоДт.Контрагенты = Контрагент;
		Проводка.СубконтоДт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаДт = ВалютаСделкиРЕПО;
		Проводка.ВалютнаяСуммаДт = ПроцентыПоРЕПО;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаПервоначальногоПризнания;
		Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
	ИначеЕсли ПроцентыПоРЕПО < 0 Тогда
			
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -СуммаОперации, "% по РЕПО");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаПервоначальногоПризнания;
		Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
		// кредит
		Проводка.СчетКт = СчетПереоценкиРасчетовПоРЕПО;
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.СубконтоКт.СделкаРЕПО = Основание;
		
		Проводка.ВалютаКт = ВалютаСделкиРЕПО;
		Проводка.ВалютнаяСуммаКт = -ПроцентыПоРЕПО;
		
	КонецЕсли;
			
КонецПроцедуры

Функция ПолучитьСправедливуюСтоимостьСделкиРЕПО(Период, ВидУчета, Отказ)
	
	СуммыЗаймовПоПериодам = Документы.ПереоценкаЗадолженностиПоДенежнымСредствам.РассчитатьПроцентыПоРЕПО(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, Период, БухгалтерскийУчетПовтИсп.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета),Основание, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось рассчитать проценты по РЕПО",,,,Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Если БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ВидУчета, "ПроверятьСтавкуРЕПОнаРыночность") Тогда
		
		//#техдолг: Когда рыночность сможет рассчитываться по переданной границе, 
		//   вынести определение рыночной стоимости в процедуру и использовать ее в переоценке задолженности по ДС и здесь.
		ЗадолженностьПоСделкамРЕПО = Новый ТаблицаЗначений;
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("СделкаРЕПО");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("Задолженность");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("Ставка");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ДатаИсполнения");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ЗадолженностьПоСС");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("СуммаПроцентов");
		ЗадолженностьПоСделкамРЕПО.Колонки.Добавить("ДатаДенежногоПотока");
		
		Для каждого Займ из СуммыЗаймовПоПериодам Цикл
			//т.к. может быть несколько периодов по займу - берем последний, там текущая задолженность
			СтрокаСделкиРЕПО = ЗадолженностьПоСделкамРЕПО.Найти(Займ.Основание, "СделкаРЕПО");
			Если СтрокаСделкиРЕПО = Неопределено Тогда  
				СтрокаСделкиРЕПО 				= ЗадолженностьПоСделкамРЕПО.Добавить();
				СтрокаСделкиРЕПО.СделкаРЕПО 	= Займ.Основание;
				СтрокаСделкиРЕПО.Ставка 		= Займ.СтавкаРЕПО;
				СтрокаСделкиРЕПО.ДатаИсполнения = Займ.ДатаРЕПО;
				СтрокаСделкиРЕПО.СуммаПроцентов = 0;
			КонецЕсли;
			СтрокаСделкиРЕПО.Задолженность 			= Займ.СуммаВЗалоге;
			СтрокаСделкиРЕПО.ДатаДенежногоПотока 	= Займ.ДатаЗакрытияРЕПО;
			СтрокаСделкиРЕПО.СуммаПроцентов 		= Займ.СуммаЗакрытияРЕПО - Займ.СуммаВЗалоге;
		КонецЦикла;
		
		РаботаСоСтоимостьюПоРыночнойСтавке.ПолучитьСтоимостьРЕПОПоРыночнойСтавке(
			ЗадолженностьПоСделкамРЕПО, 
			ЭтотОбъект.СчетДоверительногоУправления, 
			ЭтотОбъект.Дата-1, 
			БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета),
			Неопределено,
			Неопределено,
			Отказ);
	
		СуммыЗаймовПоПериодам.Свернуть("Основание, ВалютаСделки, Контрагент","СуммаПроцентов");
		
		Для Каждого СтрокаСделкиРЕПО из ЗадолженностьПоСделкамРЕПО Цикл
			СтрокаЗайма = СуммыЗаймовПоПериодам.Найти(СтрокаСделкиРЕПО.СделкаРЕПО, "Основание");
			Если СтрокаЗайма <> Неопределено Тогда
				Если СтрокаЗайма.СуммаПроцентов <> СтрокаСделкиРЕПО.СуммаПроцентов Тогда
					СтрокаЗайма.СуммаПроцентов = СтрокаСделкиРЕПО.СуммаПроцентов;
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена сделка РЕПО " + СтрокаСделкиРЕПО.СделкаРЕПО + " при дисконтировании задолженности за " + Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy"), ЭтотОбъект.Ссылка,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	Иначе	
		СуммыЗаймовПоПериодам.Свернуть("Основание, ВалютаСделки, Контрагент","СуммаПроцентов");
	КонецЕсли;
	
	Если СуммыЗаймовПоПериодам.количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректно получены проценты РЕПО для " + Ссылка,,,,Отказ);
	КонецЕсли;
	
	Возврат СуммыЗаймовПоПериодам;
	
КонецФункции



#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтотОбъект.Метаданные().Реквизиты.Основание.Тип.СодержитТип(ТипДанныхЗаполнения) Тогда // ввод на основании
		// заполним "статичные" условия
		ЭтотОбъект.Основание = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.Основание, "Организация, СчетДоверительногоУправления, Рынок");
		
		Если      ТипДанныхЗаполнения = Тип("ДокументСсылка.Сделка") Тогда
			ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделке;
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.СделкаРЕПО") Тогда
			Если      ДанныеЗаполнения.ЧастьСделкиРЕПО = 1 Тогда
				ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО;
			ИначеЕсли ДанныеЗаполнения.ЧастьСделкиРЕПО = 2 Тогда
				ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВидЗадолженности) Тогда
			// общие условия сделки
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,
				ПолучитьОбщиеУсловияСделки(, ЭтотОбъект.Основание, ЭтотОбъект.ВидЗадолженности));			
			
			// корзина ценных бумаг
			ЭтотОбъект.ЦенныеБумаги.Загрузить(
				ПолучитьКорзинуЦенныхБумагСделкиДляИзменения(, ЭтотОбъект.Основание, ЭтотОбъект.ВидЗадолженности));
		КонецЕсли;		
		
	КонецЕсли;
			
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	Если      ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.Сделка") Тогда
		Если ЭтотОбъект.ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоСделке Тогда
			ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделке;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Если ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2 Тогда
			Если ЭтотОбъект.ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
				ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаРЕПО")
			И ЭтотОбъект.ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО
			И ЭтотОбъект.ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид задолженности " + ЭтотОбъект.ВидЗадолженности + " не соответствует виду сделки " + ЭтотОбъект.Основание, ЭтотОбъект, "ВидЗадолженности",, Отказ);
			
		ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.Сделка")
			И ЭтотОбъект.ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоСделке
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид задолженности " + ЭтотОбъект.ВидЗадолженности + " не соответствует виду сделки " + ЭтотОбъект.Основание, ЭтотОбъект, "ВидЗадолженности",, Отказ);
			
		КонецЕсли;
		
		ТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Для НомСтр = 0 По ЭтотОбъект.ЦенныеБумаги.Количество() - 1 Цикл
			
			СтрокаЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги[НомСтр];
			
			// проверим, что рынок соответствует типу ценной бумаги
			Если Не ТипЦеннойБумаги.СодержитТип(ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ценной бумаги в строке № " + (НомСтр + 1) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".",,,, Отказ);
			КонецЕсли;
			
			// для рынка векселей проверим количество
			Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя И СтрокаЦенныеБумаги.Количество <> 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество векселей в строке № " + (НомСтр + 1) + " отлично от 1. Обратитесь к разработчикам.",,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
