
Процедура СинхронизироватьРеквизитыПодчиненныхРазделов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|ГДЕ
		|	ДепозитарныеСчета.Родитель = &Родитель";

	Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТребуетсяСихронизация = Ложь;
		
		СвязанныеРеквизиты = Справочники.ДепозитарныеСчета.ПолучитьСвязанныеРеквизитыСчетаИРаздела();
		Для каждого СвязанныйРеквизит Из СвязанныеРеквизиты Цикл
			Если ЭтотОбъект[СвязанныйРеквизит] <> Выборка[СвязанныйРеквизит] Тогда
				ТребуетсяСихронизация = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ТребуетсяСихронизация Тогда
			РазделСчета = Выборка.Ссылка.ПолучитьОбъект();
			
			ЗаполнитьЗначенияСвойств(РазделСчета, ЭтотОбъект,
				РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(СвязанныеРеквизиты, ", "));
				
			Попытка	
				РазделСчета.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось синхронизировать общие реквизиты подчиненного раздела " + Выборка.Ссылка + ".",,,, Отказ);
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СинхронизироватьРеквизитыПодчиненныхРазделов

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);

	// родитель может быть задан только у раздела
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "Родитель")
		И ((ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "ТипСчета") И ДанныеЗаполнения.ТипСчета <> Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
			Или Не ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "ТипСчета"))
	Тогда
		ДанныеЗаполнения.Родитель = Неопределено;
	КонецЕсли;
	
	// в разделе торгового счета заполним поля, копируемые из родителя
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "ТипСчета")
		И ДанныеЗаполнения.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета
		И ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "Родитель")
		И ТипЗнч(ДанныеЗаполнения.Родитель) = Тип("СправочникСсылка.ДепозитарныеСчета")
	Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Родитель,
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Справочники.ДепозитарныеСчета.ПолучитьСвязанныеРеквизитыСчетаИРаздела(), ", "));
	КонецЕсли;
		
	Если ОбщегоНазначенияКлиентСервер.ПолеСуществует(ДанныеЗаполнения, "Эмитент") Тогда
		
		СчетДУ = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ДанныеЗаполнения.Эмитент);
		Если ЗначениеЗаполнено(СчетДУ) Тогда
			ЭтотОбъект.Депозитарий = СчетДУ.СпециализированныйДепозитарий;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "НомерСчета, Договор, ДоговорПопечения, ДатаЗакрытия, Брокер");
	
	// в разделе торгового счета заполним поля, копируемые из родителя
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.Родитель,
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Справочники.ДепозитарныеСчета.ПолучитьСвязанныеРеквизитыСчетаИРаздела(), ", "));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета Тогда
		ПроверяемыеРеквизиты.Добавить("Родитель");
	КонецЕсли;
	
	Если ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.ОтветственноеХранение Тогда
		Если ПроверяемыеРеквизиты.Найти("НомерСчета") Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерСчета"));
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Лицевой Тогда
		
		РеквизитДатаОткрытия = ПроверяемыеРеквизиты.Найти("ДатаОткрытия");
		
		Если ЗначениеЗаполнено(РеквизитДатаОткрытия) Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитДатаОткрытия);
		КонецЕсли;
		
		РеквизитДоговор = ПроверяемыеРеквизиты.Найти("Договор");
		
		Если ЗначениеЗаполнено(РеквизитДоговор) Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитДоговор);
		КонецЕсли;
		
	Иначе
		Если ПроверяемыеРеквизиты.Найти("Эмитент") Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Эмитент"));
		КонецЕсли;
	КонецЕсли;

	Если ЭтотОбъект.Попекаемый Тогда
		ПроверяемыеРеквизиты.Добавить("Попечитель");
	КонецЕсли;
	
	//Депозитарный счёт контрагента по сделке
	Если ЭтотОбъект.ВладелецСчета <> ЭтотОбъект.Организация.ЮрФизЛицо Тогда
		РеквизитДоговор = ПроверяемыеРеквизиты.Найти("Договор");
		Если ЗначениеЗаполнено(РеквизитДоговор) Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитДоговор);
		КонецЕсли;
		
		РеквизитДатаОткрытия = ПроверяемыеРеквизиты.Найти("ДатаОткрытия");
		Если ЗначениеЗаполнено(РеквизитДатаОткрытия) Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитДатаОткрытия);
		КонецЕсли;
		
	КонецЕсли;	
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	РаботаСоСправочниками.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		Если ЭтотОбъект.ТипСчета <> Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета И ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Родитель может быть задан только для раздела депозитарного счета.", ЭтотОбъект, "Родитель",, Отказ);
		КонецЕсли;
		
		// соответствие договора и счета ответ. хранения
		Если ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.ОтветственноеХранение
		   И НЕ РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ЭтотОбъект.Договор, "ОтветственноеХранение").ОтветственноеХранение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор " + ЭтотОбъект.Договор + " не позволяет открывать счета ответ. хранения",, ЭтотОбъект, "ТипСчета", Отказ);   
		КонецЕсли;
		
		Если ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета Тогда
			
			ПервыеЦифрыРаздела = Лев(ЭтотОбъект.НомерСчета, 2);
			
			Если ПервыеЦифрыРаздела <> "31" И ПервыеЦифрыРаздела <> "36" И ПервыеЦифрыРаздела <> "38"  И ПервыеЦифрыРаздела <> "00" И ПервыеЦифрыРаздела <> "83" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номер раздела должен начинаться с цифр 31, 36, 38, 83 или 00.", ЭтотОбъект, "НомерСчета",,);
			КонецЕсли;
			
			// вид счета и подчиненные разделы не могут быть заполнены
			Если ЗначениеЗаполнено(ЭтотОбъект.ВидСчета) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид счета не может быть заполнен в разделе депозитарного счета.", ЭтотОбъект, "ВидСчета",, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.ПодчиненныеРазделы Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел депозитарного счета не может иметь подчиненных разделов.", ЭтотОбъект, "ПодчиненныеРазделы",, Отказ);
			КонецЕсли;

			Если Не ЭтотОбъект.Родитель.ПодчиненныеРазделы Тогда // родитель должен иметь подчиненные разделы
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В родительском счете """ + ЭтотОбъект.Родитель + """ отключены подчиненные разделы.", ЭтотОбъект, "Родитель",, Отказ);
			Иначе
				// проверим дату закрытия счета
				Если ЗначениеЗаполнено(ЭтотОбъект.Родитель.ДатаЗакрытия) И (ЭтотОбъект.ДатаЗакрытия > ЭтотОбъект.Родитель.ДатаЗакрытия ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия)) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия раздела не должна быть позднее даты закрытия депозитарного счета.", ЭтотОбъект, "ДатаЗакрытия", , Отказ);
				КонецЕсли;
				
				// соответствие ревизитов раздела и счета	
				СвязанныеРеквизиты = Справочники.ДепозитарныеСчета.ПолучитьСвязанныеРеквизитыСчетаИРаздела();
				Для Каждого ИмяРеквизита Из СвязанныеРеквизиты Цикл
					Если ЭтотОбъект[ИмяРеквизита] <> ЭтотОбъект.Родитель[ИмяРеквизита] Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Значение поля """ + ИмяРеквизита + """ не совпадает со значением этого поля в родительском счете.", ЭтотОбъект, ИмяРеквизита,, Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// номер раздела должен быть уникален в рамках депозитарного счета
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДепозитарныеСчета.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
				|ГДЕ
				|	ДепозитарныеСчета.Родитель = &Родитель
				|	И НЕ ДепозитарныеСчета.ПометкаУдаления
				|	И ДепозитарныеСчета.НомерСчета = &НомерСчета
				|	И ДепозитарныеСчета.Ссылка <> &Ссылка";
				
			Запрос.УстановитьПараметр("Родитель",   ЭтотОбъект.Родитель);
			Запрос.УстановитьПараметр("НомерСчета", ЭтотОбъект.НомерСчета);
			Запрос.УстановитьПараметр("Ссылка",     ЭтотОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У депозитарного счета уже есть раздел с аналогичным номером.", ЭтотОбъект, "НомерСчета",, Отказ);
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.ОтветственноеХранение Тогда
			
			// одному договору ответ. хранения должен соотв. один депозитарный счет
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДепозитарныеСчета.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
				|ГДЕ
				|	ДепозитарныеСчета.Договор = &Договор
				|	И НЕ ДепозитарныеСчета.ПометкаУдаления
				|	И ДепозитарныеСчета.Ссылка <> &Ссылка
				|	И (ДепозитарныеСчета.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ОтветственногоХранения)
				|			ИЛИ ДепозитарныеСчета.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СпецДепозитарногоОбслуживания))
				|	И ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение)";
				
			Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);
			Запрос.УстановитьПараметр("Ссылка",  ЭтотОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У договора ответ. хранения может быть только один депозитарный счет ответ.хранения!", ЭтотОбъект, "Договор",, Отказ);
			КонецЕсли;
			
		Иначе
			// проверим уникальность номера в рамках депозитария
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДепозитарныеСчета.Ссылка
				|ИЗ
				|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
				|ГДЕ
				|	ДепозитарныеСчета.Депозитарий = &Депозитарий
				|	И НЕ ДепозитарныеСчета.ПометкаУдаления
				|	И ДепозитарныеСчета.НомерСчета = &НомерСчета
				|	И ДепозитарныеСчета.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("Депозитарий", ЭтотОбъект.Депозитарий);
			Запрос.УстановитьПараметр("НомерСчета",  ЭтотОбъект.НомерСчета);
			Запрос.УстановитьПараметр("Ссылка",      ЭтотОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В депозитарии уже есть счет с аналогичным номером.", ЭтотОбъект, "НомерСчета",, Отказ);
			КонецЕсли;
			
		КонецЕсли;		
		
		// проверим возможность изменения флажка "ПодчиненныеРазделы"
		Если Не ЭтотОбъект.ЭтоНовый() И ЭтотОбъект.ПодчиненныеРазделы <> ЭтотОбъект.Ссылка.ПодчиненныеРазделы Тогда
			Если ЭтотОбъект.ПодчиненныеРазделы Тогда
				// включить флажок можно только тогда, когда объект не использовался в базе данных
				Если ОбщегоНазначения.ОбъектИспользуетсяВБазеДанных(ЭтотОбъект.Ссылка) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный депозитарный счет используется в объектах базы данных. Посмотреть список таких объектов можно через меню Все Фукнции - Стандартные - Поиск ссылок на объекты.", ЭтотОбъект, "ПодчиненныеРазделы",, Отказ);
				КонецЕсли;
			Иначе
				// отключить флажок можно только тогда, когда у счета нет подчиненных разделов
				Если Справочники.ДепозитарныеСчета.ЕстьПодчиненныеРазделы(ЭтотОбъект.Ссылка) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный депозитарный счет используется в объектах базы данных. Посмотреть список таких объектов можно через меню Все Фукнции - Стандартные - Поиск ссылок на объекты.", ЭтотОбъект, "ПодчиненныеРазделы",, Отказ);
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
		
		// проверим дату расторжения договора
		Если ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
			РеквизитыДоговора = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ЭтотОбъект.Договор, "ДатаРасторжения");
			Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаРасторжения) И (ЭтотОбъект.ДатаЗакрытия > РеквизитыДоговора.ДатаРасторжения ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия " + ?(ЭтотОбъект.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета, "раздела", "счета") + " не должна быть позднее даты расторжения договора.", ЭтотОбъект, "ДатаЗакрытия",, Отказ);
			КонецЕсли;
		КонецЕсли;		
		
		// проверим даты закрытия разделов и исполнителей
		Если Не ЭтотОбъект.ЭтоНовый() И ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия) Тогда
			РаботаСИсполнителями.ПроверитьДатыЗакрытияДочернихЭлементов(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ПодчиненныеРазделы Тогда
		СинхронизироватьРеквизитыПодчиненныхРазделов(Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПриЗаписи
