
&НаКлиенте
Процедура КомментарийКВыполнениюПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		ЗапуститьПриложение(ДанныеСобытия.Href);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.Свойство("КомментарийКВыполнению") Тогда
			ЭтаФорма.КомментарийКВыполнению = ПредставлениеКомментария(ТекСтрока.КомментарийКВыполнению);
		Иначе
			ЭтаФорма.КомментарийКВыполнению = "";
		КонецЕсли;
	КонецЕсли; 		

КонецПроцедуры

&НаКлиенте
Функция ПредставлениеКомментария(Знач КомментарийКВыполнению)

	ПредставлениеКомментария = 
		"<HTML><HEAD>
		|<style type=""text/css"">
		|	body {
		|		overflow:    auto;
		|		margin-top:  6px;
		|		margin-left: 10px;
		|		margin-bottom: 0px;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|</style></HEAD>
		|<BODY>ТекстКомментария</BODY></HTML>";
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	
	RegExp.Global     = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.MultiLine  = Истина;

	RegExp.Pattern = "#\d{6}";
	Совпадения = RegExp.Execute(КомментарийКВыполнению);
	СоответствиеДляЗамены = Новый Соответствие;
	Ссылка = "<A href=""http://1f.g1.lan/MaintaskForm.aspx?TaskID=НомерЗадачи"">#НомерЗадачи</A>";
	Для Каждого Совпадение Из Совпадения Цикл	
		СоответствиеДляЗамены.Вставить(Совпадение.Value, СтрЗаменить(Ссылка, "НомерЗадачи", Сред(Совпадение.Value, 2)));
	КонецЦикла;
	
	КомментарийКВыполнению = СтрЗаменить(КомментарийКВыполнению, Символы.ПС, Символы.ПС + "<BR>");
	ПредставлениеКомментария = СтрЗаменить(ПредставлениеКомментария, "ТекстКомментария", КомментарийКВыполнению);
		
	Для каждого ЭлементДляЗамены Из СоответствиеДляЗамены Цикл
		ПредставлениеКомментария = СтрЗаменить(ПредставлениеКомментария, ЭлементДляЗамены.Ключ, ЭлементДляЗамены.Значение);
	КонецЦикла; 
	
	Возврат ПредставлениеКомментария;

КонецФункции