
&НаКлиентеНаСервереБезКонтекста
Функция УстановитьЗначениеБыстрогоОтбораНаФорме(Контейнер, ИмяПоляОтбора, ЗначениеОтбора)

	ПредставлениеОтбора = "БыстрыйОтборНаФорме" + ИмяПоляОтбора;
	РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	КлючОтбора = Новый Структура("ИмяПоля, Представление, РежимОтображения",
		ИмяПоляОтбора, ПредставлениеОтбора, РежимОтображения);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Контейнер, КлючОтбора, ПредставлениеОтбора, ВидСравненияКомпоновкиДанных.Равно, ЗначениеОтбора, ЗначениеЗаполнено(ЗначениеОтбора), РежимОтображения);
	
КонецФункции // УстановитьЗначениеБыстрогоОтбораНаФорме

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтруктураОтбора = Неопределено;
	
	ЭтаФорма.ОтборОрганизация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборОрганизацияПриИзменении(Неопределено);
	ОтборСчетДоверительногоУправленияПриИзменении(Неопределено);
	ОтборРасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры // ПриОткрытии

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	УстановитьЗначениеБыстрогоОтбораНаФорме(Список.Отбор, "Организация", ЭтаФорма.ОтборОрганизация);
	
	ЭтаФорма.ОтборСчетДоверительногоУправления = Неопределено;
	ОтборСчетДоверительногоУправленияПриИзменении(Неопределено);
	
КонецПроцедуры // ОтборОрганизацияПриИзменении

&НаКлиенте
Процедура ОтборСчетДоверительногоУправленияПриИзменении(Элемент)
	
	УстановитьЗначениеБыстрогоОтбораНаФорме(Список.Отбор, "СчетДоверительногоУправления", ЭтаФорма.ОтборСчетДоверительногоУправления);
	
	ЭтаФорма.ОтборРасчетныйСчет = Неопределено;
	ОтборРасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры // ОтборСчетДоверительногоУправленияПриИзменении

&НаКлиенте
Процедура ОтборРасчетныйСчетПриИзменении(Элемент)
	
	УстановитьЗначениеБыстрогоОтбораНаФорме(Список.Отбор, "РасчетныйСчет", ЭтаФорма.ОтборРасчетныйСчет);
	
КонецПроцедуры // ОтборРасчетныйСчетПриИзменении
