
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСделкаПриИзменении(Элемент)
	ЦенныеБумагиСделкаПриИзмененииНаСервере(Элементы.ЦенныеБумаги.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦенныеБумагиСделкаПриИзмененииНаСервере(ИдСтрокиЦБ)
	
	ТекСтрока = Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиЦБ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка.Рынок КАК Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОЦенныеБумаги.Ссылка.Рынок,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрока.Сделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСтрока.Рынок        = ВыборкаДетальныеЗаписи.Рынок;
		ТекСтрока.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(СуммаКупонаНа1Бумагу)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток * &СуммаКупонаНа1Бумагу КАК ПогашениеКупонаНеИсполненноеВСрок,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток * &СуммаКупонаНа1Бумагу КАК ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки";

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СуммаКупонаНа1Бумагу", СуммаКупонаНа1Бумагу);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);

	Объект.ПартииЦеннойБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	СуммаКупонаНа1Бумагу = 0;
	
	Если ВвестиЧисло(СуммаКупонаНа1Бумагу, "Введите сумму купона на 1 бумагу", 19, 2) Тогда
	
		ЗаполнитьНаСервере(СуммаКупонаНа1Бумагу);
	
	КонецЕсли;
	
КонецПроцедуры
