
&НаСервереБезКонтекста
Функция ПолучитьСчетаДУПоКоторымЕстьДвижения(ДатаСверки, Брокер, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОбороты.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
		|			&НачДата,
		|			&КонДата,
		|			Период,
		|			Организация = &Организация
		|				И Брокер = &Брокер) КАК ОстаткиДенежныхСредствОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОбороты.СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Обороты(
		|			&НачДата,
		|			&КонДата,
		|			Период,
		|			Организация = &Организация
		|				И ДепозитарныйСчет.Брокер = &Брокер) КАК ОстаткиЦенныхБумагОбороты";
		
	Запрос.УстановитьПараметр("Организация",	Организация);	
	Запрос.УстановитьПараметр("НачДата",		НачалоДня(ДатаСверки));
	Запрос.УстановитьПараметр("КонДата",		КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("Брокер",			Брокер);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьСчетДУ(ДатаСверки, Брокер, Организация, знач ИмяФайла, ФорматДанных)
	
	// В версии 1 Файл именуется по следующей схеме:
	//   <Код клиента>_<еще раз код клиента>-<и снова код клиента>_<ДДММГГ - торговый день >_<ЧЧСС - время формирования>.xls
	//   например, 39334_39334-39334_260314_2345.xls
	//
	// В версии 2 поменялся формат файла на xlsx и к имени добавился префикс "Stocks-report_"
	//   например, Stocks-report_39334-25.05.2015-101322.xlsx
	
	Если      ФорматДанных = 1 Тогда
		КодКлиента = Лев(ИмяФайла, 5);
	ИначеЕсли ФорматДанных = 2 Тогда
		КодКлиента = Сред(ИмяФайла, 15, 5);
	Иначе
		ВызватьИсключение "Неизвестная версия формата файла";
	КонецЕсли;
	
	// найдем клиента по коду
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Брокер = &Брокер
		|				И Код = &Код) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних";

	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Брокер", 		Брокер);
	Запрос.УстановитьПараметр("Код",    		КодКлиента);
	Запрос.УстановитьПараметр("Период", 		ДатаСверки);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.СчетДоверительногоУправления;
	Иначе		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ОпределитьСчетДУ

&НаСервере
Функция ЗаполнитьПротоколСверкиПоКлиентуНаСервере(СчетДУ, ДанныеБрокера, ТабДок)

	Возврат РеквизитФормыВЗначение("Объект").ЗаполнитьПротоколСверкиПоКлиенту(СчетДУ, ЭтотОбъект.Брокер, ДанныеБрокера, ТабДок);

КонецФункции // ЗаполнитьПротоколСверкиПоКлиентуНаСервере

&НаСервере
Процедура ЗагрузитьКомиссиюБрокераНаСервере(СчетДУ, ДанныеБрокера)
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьКомиссиюБрокераПоКлиенту(СчетДУ, ЭтаФорма.Брокер, ДанныеБрокера);
	
КонецПроцедуры

&НаКлиенте
Функция МодульЧисла(Ч)
	
	Возврат ?(Ч < 0, -Ч, Ч)
	
КонецФункции // МодульЧисла

&НаКлиенте
Функция ДатаИзСтроки(СтрокаДата)

	Возврат Дата(Число(Сред(СтрокаДата, 7, 4)), Число(Сред(СтрокаДата, 4, 2)), Число(Сред(СтрокаДата, 1, 2)));

КонецФункции

&НаКлиенте
Процедура ДобавитьОписаниеПозицииПоля(ПозицииПолей, ИмяПоля, ЗаголовокПоля, ПозицияПоля = 0)
	
	ПозицииПолей.Вставить(ЗаголовокПоля, Новый Структура("Имя, Позиция", ИмяПоля, ПозицияПоля));
	
КонецПроцедуры // ДобавитьОписаниеПозицииПоля

&НаКлиенте
Процедура ОпределитьПозицииПолейВТаблице(ПозицииПолей, Лист, НомерСтроки)
	
	ОбработаноПолей = 0;
	
	Для НомКол = 1 По 100 Цикл // 3-кратный запас от макс. количества
		ЗаголовокПоля = НРег(СокрЛП(Лист.Cells(НомерСтроки, НомКол).Value));
		ЗаголовокПоля = СтрЗаменить(ЗаголовокПоля, Символы.ПС, " ");
		
		Пока Найти(ЗаголовокПоля, "  ") > 0 Цикл
			ЗаголовокПоля = СтрЗаменить(ЗаголовокПоля, "  ", " ");
		КонецЦикла;
		
		ОписаниеПоля = ПозицииПолей.Получить(ЗаголовокПоля);
		Если ОписаниеПоля <> Неопределено Тогда
			ОписаниеПоля.Позиция = НомКол;
			ОбработаноПолей = ОбработаноПолей + 1;
		КонецЕсли;
		
		Если ОбработаноПолей = ПозицииПолей.Количество() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ОписаниеПоля Из ПозицииПолей Цикл
		Если ОписаниеПоля.Значение.Позиция = 0 Тогда
			ВызватьИсключение "Не удалось определить позицию поля " + ОписаниеПоля.Значение.Имя + " (" + ОписаниеПоля.Ключ + ")";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОпределитьПозицииПолейВТаблице

&НаКлиенте
Процедура ДобавитьДанныеВНабор(НаборДанных, ПозицииПолей, Лист, НомерСтроки)
	
	Данные = Новый Структура();
	
	Для каждого ОписаниеПоля Из ПозицииПолей Цикл
		Данные.Вставить(ОписаниеПоля.Значение.Имя, Лист.Cells(НомерСтроки, ОписаниеПоля.Значение.Позиция).Value);
	КонецЦикла;
	
	НаборДанных.Добавить(Данные);
	
КонецПроцедуры // ДобавитьДанныеВНабор


&НаКлиенте
Функция ПолучитьДанныеБрокераВФормате1(ИмяФайла)

	Excel = Новый COMОбъект("Excel.Application");
	Книга = Excel.Application.Workbooks.Open(ИмяФайла);
	Лист = Книга.Worksheets("OTCHET");
	
	ДанныеБрокера = Новый СписокЗначений;
	
	ЦенныеБумаги 	= Новый Массив;
	Сделки 			= Новый Массив;
	Исполнения		= Новый Массив;
	
	НачальныйОстаток = 0;
	КонечныйОстаток = 0;
	
	ТекСтрока = 1;
	Статус = 0; // 0 - ничё, 1 - остатки по ДС, 2 - остатки по ЦБ, 3 - сделки, 4 - незавершенные сделки
	ИспользоватьОсновнойРаздел = Ложь;
	
	Пока Найти(Лист.Cells(ТекСтрока, 1).Value, "Уполномоченное лицо") = 0 Цикл
		Если Лист.Cells(ТекСтрока, 1).Value = Неопределено Тогда
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
		КонецЕсли;
		
		Если СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Суммарное состояние денежных средств на счете" Тогда
			Статус = 1;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Состояние портфеля российских ценных бумаг" Тогда
			Статус = 2;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Сделки с ценными бумагами, кроме операций РЕПО и специальных сделок" Тогда
			Статус = 3;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Незавершенные (открытые) сделки с ЦБ, в том числе 2 части по сделкам РЕПО" Тогда
			Статус = 4;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Торговая система" Тогда
			Если СокрЛП(Лист.Cells(ТекСтрока, 4).Value) = "В/бирж" Тогда
				ИспользоватьОсновнойРаздел = Истина;
			КонецЕсли;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
		КонецЕсли;
		
		Если Статус = 1 Тогда
			Если СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Входящий остаток" Тогда
				Если НачальныйОстаток = 0 Тогда
					НачальныйОстаток = Окр(Число(Лист.Cells(ТекСтрока, 6).Value),2);
				КонецЕсли;
			ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 1).Value) = "Исходящий остаток" Тогда
				Если КонечныйОстаток = 0 Тогда
					КонечныйОстаток = Окр(Число(Лист.Cells(ТекСтрока, 6).Value),2);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Статус = 2 Тогда
			Если (СокрЛП(Лист.Cells(ТекСтрока, 1).Value) <> "Наименование")И(СокрЛП(СокрЛП(Лист.Cells(ТекСтрока, 1).Value) <> "ценной бумаги")) Тогда
				
				Если Лист.Cells(ТекСтрока, 2).Value = Неопределено Тогда
					Статус = 0;
					ТекСтрока = ТекСтрока + 1;
				    Продолжить;
				КонецЕсли;
				
				ЦенныеБумаги.Добавить(Новый Структура("КодЦБ, БрокНачальныйОстаток, БрокКонечныйОстаток", 
					Лист.Cells(ТекСтрока, 2).Value, 
					Окр(Число(Лист.Cells(ТекСтрока, 5).Value),2), 
					Окр(Число(Лист.Cells(ТекСтрока, 7).Value),2)));
			КонецЕсли;
			
		ИначеЕсли Статус = 3 Тогда
			Если СокрЛП(Лист.Cells(ТекСтрока, 1).Value) <> "Номер сделки" Тогда
				
				Если Лист.Cells(ТекСтрока, 2).Value = Неопределено Тогда
					Статус = 0;
					ТекСтрока = ТекСтрока + 1;
				    Продолжить;
				КонецЕсли;
				
				ДатаСделки = ДатаИзСтроки(Лист.Cells(ТекСтрока, 20).Value);
				
				//Начисление комиссии происходит в день сделки
				Если ДатаСделки = Объект.ДатаСверки Тогда
					КомиссияБрокераНачисленная 	= Число(Лист.Cells(ТекСтрока, 15).Value);
					КомиссияБиржиНачисленная	= Число(Лист.Cells(ТекСтрока, 17).Value);
				ИначеЕсли СокрЛП(Лист.Cells(ТекСтрока, 21).Text) = "В/бирж" Тогда
					КомиссияБрокераНачисленная 	= Число(Лист.Cells(ТекСтрока, 15).Value);
					КомиссияБиржиНачисленная	= 0;
				Иначе	
					КомиссияБрокераНачисленная 	= 0;
					КомиссияБиржиНачисленная	= 0;
				КонецЕсли;
				
				ДанныеСделки = Новый Структура("БрокДатаОплатыКомиссииБрокера, БрокНомСделки, КодЦБ, ТипОперации, БрокКоличество, БрокСумма, БрокНКД, КомБанка, КомБиржи, КомБанкаНачисл, КомБиржиНачисл", 
					?(Число(Лист.Cells(ТекСтрока, 15).Value)<>0, Объект.ДатаСверки, ДатаСделки),
					Лист.Cells(ТекСтрока, 1).Text, 
					Лист.Cells(ТекСтрока, 3).Value,
					Лист.Cells(ТекСтрока, 4).Value,
					Число(Лист.Cells(ТекСтрока, 7).Value),
					Число(Лист.Cells(ТекСтрока, 11).Value),
					Число(Лист.Cells(ТекСтрока, 10).Value),
					Число(Лист.Cells(ТекСтрока, 15).Value),
					Число(Лист.Cells(ТекСтрока, 17).Value),
					КомиссияБрокераНачисленная,
					КомиссияБиржиНачисленная);
														
				Если ДатаСделки < Объект.ДатаСверки Тогда
					Исполнения.Добавить(ДанныеСделки);
				Иначе
					Сделки.Добавить(ДанныеСделки);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Статус = 4 Тогда
			Если СокрЛП(Лист.Cells(ТекСтрока, 1).Value) <> "Номер сделки" Тогда
				
				Если Лист.Cells(ТекСтрока, 2).Value = Неопределено Тогда
					Статус = 0;
					ТекСтрока = ТекСтрока + 1;
				    Продолжить;
				КонецЕсли;
				
				ДатаКомиссииБрокера = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(Лист.Cells(ТекСтрока, 16).Value, 10));
				
				КомиссияБрокераНачисленная	= Число(Лист.Cells(ТекСтрока, 14).Value);
				
				Если ДатаКомиссииБрокера = Объект.ДатаСверки Тогда
					КомиссияБрокера = Число(Лист.Cells(ТекСтрока, 14).Value);
				Иначе
					КомиссияБрокера = 0;
				КонецЕсли;
				
				ДатаКомиссииБиржи = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Лев(Лист.Cells(ТекСтрока, 20).Value, 10));
				
				КомиссияБиржиНачисленная = Число(Лист.Cells(ТекСтрока, 17).Value);
				
				Если ДатаКомиссииБиржи = Объект.ДатаСверки Тогда
					КомиссияБиржи = Число(Лист.Cells(ТекСтрока, 17).Value);
				Иначе
					КомиссияБиржи = 0;
				КонецЕсли;
				
				ДанныеСделки = Новый Структура("БрокДатаОплатыКомиссииБрокера, БрокНомСделки, КодЦБ, ТипОперации, БрокКоличество, БрокСумма, БрокНКД, КомБанка, КомБиржи, КомБанкаНачисл, КомБиржиНачисл", 
					ДатаКомиссииБрокера,
					Лист.Cells(ТекСтрока, 1).Text, 
					Лист.Cells(ТекСтрока, 5).Value,
					Лист.Cells(ТекСтрока, 3).Value,
					Число(Лист.Cells(ТекСтрока, 8).Value),
					Число(Лист.Cells(ТекСтрока, 12).Value),
					Число(Лист.Cells(ТекСтрока, 11).Value),
					КомиссияБрокера,
					КомиссияБиржи,
					КомиссияБрокераНачисленная,
					КомиссияБиржиНачисленная);
														
				ДатаСделки = ДатаИзСтроки(Лист.Cells(ТекСтрока, 2).Value);
				Если ДатаСделки = Объект.ДатаСверки Тогда
					Сделки.Добавить(ДанныеСделки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
	Excel.Quit();
	
	Возврат
		Новый Структура("НачальныйОстаток, КонечныйОстаток, ЦенныеБумаги, Сделки, Исполнения, ИспользоватьОсновнойРаздел",
			НачальныйОстаток,
			КонечныйОстаток,
			ЦенныеБумаги,
			Сделки,
			Исполнения,
			ИспользоватьОсновнойРаздел);
	
КонецФункции // ПолучитьДанныеБрокераВФормате1

&НаКлиенте
Функция ПолучитьДанныеБрокераВФормате2(ИмяФайла)

	ИспользоватьОсновнойРаздел = Ложь;

	// т.к. положения колонок в таблицах отчета за разные даты может отличаться, придется искать их по заголовкам
	ПозицииПолейТаблицыЦБ = Новый Соответствие;
	ДобавитьОписаниеПозицииПоля(ПозицииПолейТаблицыЦБ, "КодЦБ",                "код гос. регистрации");
	ДобавитьОписаниеПозицииПоля(ПозицииПолейТаблицыЦБ, "БрокНачальныйОстаток", "входящий остаток, шт.");
	ДобавитьОписаниеПозицииПоля(ПозицииПолейТаблицыЦБ, "БрокКонечныйОстаток",  "исходящий остаток, шт.");
	
	// чтение данных
	Excel = Новый COMОбъект("Excel.Application");
	Книга = Excel.Application.Workbooks.Open(ИмяФайла);
	Лист  = Книга.Worksheets.Item(1);
	
	ДанныеБрокера = Новый СписокЗначений;
	
	ЦенныеБумаги = Новый Массив;
	Сделки       = Новый Массив;
	Исполнения   = Новый Массив;
	
	НачальныйОстаток = 0;
	КонечныйОстаток  = 0;
	
	ТекСтрока = 0;
	Статус    = 0; // 0 - ничё, 1 - остатки по ДС, 2 - остатки по ЦБ, 3 - сделки, 4 - незавершенные сделки
	
	МаксКолСтрок = 10000;
	
	Пока Найти(Лист.Cells(ТекСтрока + 1, 1).Value, "Уполномоченное лицо") = 0 Цикл
		
		ТекСтрока = ТекСтрока + 1;
		
		ПерваяЯчейкаСтроки = СокрЛП(Лист.Cells(ТекСтрока, 1).Value);
		
		Если ТекСтрока > МаксКолСтрок Тогда
			Excel.Quit();
			ВызватьИсключение "Превышено макс. количество поддерживаемых строк в документе Excel";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Лист.Cells(ТекСтрока, 1).Value) Тогда
			Статус = 0;
			Продолжить;
		КонецЕсли;
		
		// определим вид загружаемых данных
		Если      ПерваяЯчейкаСтроки = "Cостояние денежных средств на счете:" Тогда
			Статус = 1;
			ТекСтрока = ТекСтрока + 1; // пропускаем заголовок таблицы
			Продолжить;
			
		ИначеЕсли ПерваяЯчейкаСтроки = "Состояние портфеля ценных бумаг" Тогда
			Статус = 2;
			
			ОпределитьПозицииПолейВТаблице(ПозицииПолейТаблицыЦБ, Лист, ТекСтрока + 1);
			
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли ПерваяЯчейкаСтроки = "Заключенные сделки с ценными бумагами" Тогда
			Статус = 3;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		ИначеЕсли ПерваяЯчейкаСтроки = "Сделки с ценными бумагами, оплата и (или) поставка по которым исполнена" Тогда
			Статус = 4;
			ТекСтрока = ТекСтрока + 1;
			Продолжить;
			
		КонецЕсли;
		
		Если      Статус = 0 Тогда
			Продолжить;
		
		ИначеЕсли Статус = 1 Тогда // остатки д/с
			Если      ПерваяЯчейкаСтроки = "Входящий остаток" Тогда
				НачальныйОстаток = Лист.Cells(ТекСтрока, 7).Value;
			ИначеЕсли ПерваяЯчейкаСтроки = "Исходящий остаток" Тогда
				КонечныйОстаток  = Лист.Cells(ТекСтрока, 7).Value;
			КонецЕсли;
			
		ИначеЕсли Статус = 2 Тогда // остатки ц/б
			ДобавитьДанныеВНабор(ЦенныеБумаги, ПозицииПолейТаблицыЦБ, Лист, ТекСтрока);
			
		ИначеЕсли Статус = 3 Или Статус = 4 Тогда // сделки
			Если Статус = 4 // с недавнего времени в таблицу исполнений стали попадать и сделки Т0
				И Лист.Cells(ТекСтрока, 3).Value = Лист.Cells(ТекСтрока, 17).Value
				И Лист.Cells(ТекСтрока, 3).Value = Лист.Cells(ТекСтрока, 18).Value
			Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаСделки                = Лист.Cells(ТекСтрока, 3).Value;
			ДатаОплатыКомиссииБрокера = Лист.Cells(ТекСтрока, 21).Value;
			ДатаОплатыКомиссииБиржи   = Лист.Cells(ТекСтрока, 24).Value;
			
			Если ДатаСделки = Объект.ДатаСверки Тогда // комиссия всегда начисляется в дату сделки
				КомиссияБрокераНачисленная = МодульЧисла(Лист.Cells(ТекСтрока, 19).Value);
				КомиссияБиржиНачисленная   = МодульЧисла(Лист.Cells(ТекСтрока, 22).Value);
			Иначе
				КомиссияБрокераНачисленная = 0;
				КомиссияБиржиНачисленная   = 0;
			КонецЕсли;
			
			КомиссияБрокера = ?(ДатаОплатыКомиссииБрокера = Объект.ДатаСверки, МодульЧисла(Лист.Cells(ТекСтрока, 19).Value), 0);
			КомиссияБиржи   = ?(ДатаОплатыКомиссииБиржи   = Объект.ДатаСверки, МодульЧисла(Лист.Cells(ТекСтрока, 22).Value), 0);
			
			ДанныеСделки = Новый Структура("БрокНомСделки, КодЦБ, ТипОперации, БрокКоличество, БрокСумма, БрокНКД, КомБрокера, КомБиржи, КомБрокераНачисл, КомБиржиНачисл, БрокДатаОплатыКомиссииБрокера, БрокДатаОплатыКомиссииБиржи", 
				Формат(Лист.Cells(ТекСтрока, 1).Value, "ЧГ="), 
				Лист.Cells(ТекСтрока, 8).Value,
				Лист.Cells(ТекСтрока, 9).Value,
				МодульЧисла(Лист.Cells(ТекСтрока, 10).Value),
				МодульЧисла(Лист.Cells(ТекСтрока, 13).Value),
				МодульЧисла(Лист.Cells(ТекСтрока, 12).Value),
				КомиссияБрокера,
				КомиссияБиржи,
				КомиссияБрокераНачисленная,
				КомиссияБиржиНачисленная,
				ДатаОплатыКомиссииБрокера,
				ДатаОплатыКомиссииБиржи);
													
			Если ДатаСделки < Объект.ДатаСверки Тогда
				Исполнения.Добавить(ДанныеСделки);
			Иначе
				Сделки.Добавить(ДанныеСделки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Excel.Quit();
	
	Возврат
		Новый Структура("НачальныйОстаток, КонечныйОстаток, ЦенныеБумаги, Сделки, Исполнения, ИспользоватьОсновнойРаздел",
			НачальныйОстаток,
			КонечныйОстаток,
			ЦенныеБумаги,
			Сделки,
			Исполнения,
			ИспользоватьОсновнойРаздел);
			
КонецФункции // ПолучитьДанныеБрокераВФормате2


&НаКлиенте
Процедура ЗаполнитьКаталогДанных()
	
	Если ЭтаФорма.РежимСверки = 0 И ЗначениеЗаполнено(Объект.ДатаСверки) Тогда
		ЗаполнитьКаталогДанныхНаСервере();
		
		КомандаОбновитьСписокКлиентов(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКаталогДанныхНаСервере()
	
	Объект.КаталогДанных = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._СверкаСБрокеромКИТ.ШаблонКаталогаОтчетов", Объект.Организация, Объект.ДатаСверки, Объект.КаталогДанных);
	
КонецПроцедуры


&НаКлиенте
Процедура СверитьВыбранныхКлиентовНаДату(ПараметрыСессии)

	Для каждого СтрокаКлиенты Из ЭтаФорма.Клиенты Цикл
		
		Если Не СтрокаКлиенты.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКлиенты.ИмяФайла) Тогда
			ТекстОшибки = "По клиенту " + СтрокаКлиенты.СчетДУ
				+ " за выбранный период есть движения денег/бумаг, но нет отчета брокера";
			ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
			Предупреждение(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если      ЭтаФорма.ФорматДанных = 1 Тогда
			ДанныеБрокера = ПолучитьДанныеБрокераВФормате1(СтрокаКлиенты.ИмяФайла);
		ИначеЕсли ЭтаФорма.ФорматДанных = 2 Тогда
			ДанныеБрокера = ПолучитьДанныеБрокераВФормате2(СтрокаКлиенты.ИмяФайла);
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.ОтображатьСетку     = Ложь;
		ТабДок.Защита              = Истина;
		ТабДок.ТолькоПросмотр      = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;

		ЕстьРасхождения = ЗаполнитьПротоколСверкиПоКлиентуНаСервере(СтрокаКлиенты.СчетДУ, ДанныеБрокера, ТабДок);
		
		Если ЭтаФорма.ОтображатьПротоколыСверкиТолькоПриНаличииРасхождений Тогда
			Если ЕстьРасхождения Тогда
				ТабДок.Показать(СтрокаКлиенты.СчетДУ);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расхождения по клиенту " + СтрокаКлиенты.СчетДУ + " на " + Формат(Объект.ДатаСверки, "ДФ=dd.MM.yyyy") + " не обнаружено.");
			КонецЕсли;
		Иначе
			ТабДок.Показать(СтрокаКлиенты.СчетДУ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СверитьВыбранныхКлиентовНаДату

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ДатаСверки  = ТекущаяДата() - 86400;
	
	ЭтаФорма.КонДатаСверки = ТекущаяДата();
	ЭтаФорма.НачДатаСверки = НачалоНедели(ЭтаФорма.КонДатаСверки);

//	ЭтаФорма.ПутьНачальный = "\\g1\shares\UK\Client\РегионЭсМ\ОТДЕЛ_ ВНУТРЕННЕГО_ УЧЕТА\Брокеры\КИТ\Отчеты брокера\";
	ЭтаФорма.Брокер        = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_КИТ_Финанс");
	
	ЭтаФорма.ОтображатьПротоколыСверкиТолькоПриНаличииРасхождений = Истина;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.РежимСверки = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаСверки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКаталогДанных();
	
	РежимСверкиПриИзменении(Неопределено);
	
	ВерсияФорматаПриИзменении(Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСверкиПриИзменении(Элемент)
	
	ВерсияФорматаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСверкиПриИзменении(Элемент)
	
	Элементы.ГруппаСверкаЗаПериод.Видимость = (ЭтаФорма.РежимСверки = 1);
	Элементы.Клиенты.Видимость              = (ЭтаФорма.РежимСверки = 0);
	Элементы.ГруппаСверкаНаДату.Видимость   = (ЭтаФорма.РежимСверки = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияФорматаПриИзменении(Элемент)
	
	Если ЭтаФорма.ВерсияФормата = 0 Тогда
		ЭтаФорма.ФорматДанных = ?(Объект.ДатаСверки >= Дата(2015, 6, 9), 2, 1);
	Иначе
		ЭтаФорма.ФорматДанных = ЭтаФорма.ВерсияФормата;
	КонецЕсли;
	
	ЗаполнитьКаталогДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.КаталогДанных;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.КаталогДанных = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСверить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСверить");
	ВыполнитьСверку(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверку(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка заполнения");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.РежимСверки = 1 Тогда // сверка за период
		
		Объект.ДатаСверки = ЭтаФорма.НачДатаСверки;
		
		Если ЭтаФорма.ВерсияФормата = 0 Тогда
			ЭтаФорма.ФорматДанных = ?(Объект.ДатаСверки >= Дата(2015, 6, 9), 2, 1);
		Иначе
			ЭтаФорма.ФорматДанных = ЭтаФорма.ВерсияФормата;
		КонецЕсли;

		Пока Объект.ДатаСверки <= ЭтаФорма.КонДатаСверки Цикл
			ЗаполнитьКаталогДанных();
			КомандаОбновитьСписокКлиентов(Неопределено);
			
			СверитьВыбранныхКлиентовНаДату(ПараметрыСессии);
			
			Объект.ДатаСверки = Объект.ДатаСверки + 86400;
		КонецЦикла;
		
	Иначе
		СверитьВыбранныхКлиентовНаДату(ПараметрыСессии);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКомиссию(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаЗагрузитьКомиссию");
	ВыполнитьЗагрузкуКомиссии(ПараметрыСессии);
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуКомиссии(ПараметрыСессии)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, "Не пройдена проверка заполнения");
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаКлиенты Из ЭтаФорма.Клиенты Цикл
		
		Если Не СтрокаКлиенты.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКлиенты.ИмяФайла) Тогда
			ТекстОшибки = "По клиенту " + СтрокаКлиенты.СчетДУ
				+ " за выбранный период есть движения денег/бумаг, но нет отчета брокера";
			ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки);
			Предупреждение(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если      ЭтаФорма.ФорматДанных = 1 Тогда
			ДанныеБрокера = ПолучитьДанныеБрокераВФормате1(СтрокаКлиенты.ИмяФайла);
		ИначеЕсли ЭтаФорма.ФорматДанных = 2 Тогда
			ДанныеБрокера = ПолучитьДанныеБрокераВФормате2(СтрокаКлиенты.ИмяФайла);
		КонецЕсли;
		
		ЗагрузитьКомиссиюБрокераНаСервере(СтрокаКлиенты.СчетДУ, ДанныеБрокера);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокКлиентов(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновитьСписокКлиентов");
	ВыполнитьОбновлениеСпискаКлиентов();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеСпискаКлиентов()
	
	Этаформа.Клиенты.Очистить();
	
	Если      ЭтаФорма.ФорматДанных = 1 Тогда
		МаскаФайлов = "*.xls";
	ИначеЕсли ЭтаФорма.ФорматДанных = 2 Тогда
		МаскаФайлов = "*.xlsx";
	КонецЕсли;
	
	НайденыеФайлы = НайтиФайлы(Объект.КаталогДанных, МаскаФайлов);
	
	Для каждого НайденыйФайл Из НайденыеФайлы Цикл
		
		СчетДУ = ОпределитьСчетДУ(Объект.ДатаСверки, ЭтаФорма.Брокер, Объект.Организация, НайденыйФайл.ИмяБезРасширения, ЭтаФорма.ФорматДанных);
		
		Если Не СчетДУ = Неопределено Тогда
			НоваяСтрока = ЭтаФорма.Клиенты.Добавить();
			НоваяСтрока.Выбран   = Истина;
			НоваяСтрока.СчетДУ   = СчетДУ;
			НоваяСтрока.ИмяФайла = НайденыйФайл.ПолноеИмя;
		КонецЕсли;
		
	КонецЦикла;
	
	СчетаДУПоКоторымЕстьДвижения = ПолучитьСчетаДУПоКоторымЕстьДвижения(Объект.ДатаСверки, ЭтаФорма.Брокер, Объект.Организация);
	
	Для Каждого СчетДУ ИЗ СчетаДУПоКоторымЕстьДвижения Цикл
		Отбор = Новый Структура("СчетДУ", СчетДУ);
		Если ЭтаФорма.Клиенты.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяСтрока = ЭтаФорма.Клиенты.Добавить();
			НоваяСтрока.Выбран   = Истина;
			НоваяСтрока.СчетДУ   = СчетДУ;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьВсе(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВыделитьВсе");
	ВыполнитьВыделениеВсех();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыделениеВсех()
	
	Для каждого СтрокаКлиенты Из ЭтаФорма.Клиенты Цикл
		СтрокаКлиенты.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВыделение(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьВыделение");
	ВыполнитьСнятиеВыделения();
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСнятиеВыделения()
	
	Для каждого СтрокаКлиенты Из ЭтаФорма.Клиенты Цикл
		СтрокаКлиенты.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервереБезКонтекста
Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(
		РеквизитФормыВЗначение("Объект"), ИмяКоманды);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

#КонецОбласти
