
&НаСервереБезКонтекста
Функция ЕстьПравоПросмотраЖурнала()
	
	Возврат ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЖурналОперацийБэкОфиса);
	
КонецФункции // ЕстьПравоПросмотраЖурнала

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовОперацийЖурнала()
	
	СписокОпераций = Новый СписокЗначений;
	
	// выделим из видов документов упр. компании значения, исключающие те виды, которых нет в метаданных
	Для каждого ВидОперацииМД Из Метаданные.Перечисления.ВидыОперацийБэкОфиса.ЗначенияПеречисления Цикл
		ДокументМД = Метаданные.Документы.Найти(ВидОперацииМД.Имя);
		Если ДокументМД <> Неопределено Тогда
			СписокОпераций.Добавить(ДокументМД.Имя, ДокументМД.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокОпераций;
	
КонецФункции // ПолучитьСписокВидовОперацийЖурнала

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиПоДокументу(Документ)
	
	ОтборДляКлюча = Новый Структура("Организация, Дата, СчетДоверительногоУправления, Брокер, МестоХранения, Рынок, Документ, ВидОперации, Состояние", Документ);
	
	Возврат РегистрыСведений.ЖурналОперацийБэкОфиса.СоздатьКлючЗаписи(ОтборДляКлюча);
	
КонецФункции 

&НаСервереБезКонтекста
Функция СформироватьКлючСводнойФормы(ИмяФормы, ПараметрыФормы)
	
	Возврат РаботаСЖурналамиОпераций.СформироватьКлючСводнойФормы(ИмяФормы, ПараметрыФормы);
	
КонецФункции // СформироватьКлючСводнойФормы

&НаСервереБезКонтекста
Функция ПолучитьНачальныйПериодЖурнала()
	
	// по просьбе бэк-офиса, по умолчанию открывается период "вчера"
	НачальныйПериод = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	
	// получим соотв. настройки пользователя
	НастройкиПериодаЖурналаОпераций = Новый Структура(
		"СохранятьПериодЖурналаОпераций, ВариантПериодаПриОткрытииЖурналаОпераций, НачалоПериодаПриОткрытииЖурналаОпераций, ОкончаниеПериодаПриОткрытииЖурналаОпераций",
			Ложь, Неопределено, Дата(1, 1, 1), Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекПользователей.Настройка,
		|	ЗначенияНастроекПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекПользователей КАК ЗначенияНастроекПользователей
		|ГДЕ
		|	ЗначенияНастроекПользователей.Пользователь = &Пользователь";
		
	Запрос.УстановитьПараметр("Пользователь", РаботаСПользователями.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НастройкиПериодаЖурналаОпераций.Свойство(Выборка.Настройка.ИмяПредопределенныхДанных) Тогда
			НастройкиПериодаЖурналаОпераций[Выборка.Настройка.ИмяПредопределенныхДанных] = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если НастройкиПериодаЖурналаОпераций.СохранятьПериодЖурналаОпераций = Истина
		И ЗначениеЗаполнено(НастройкиПериодаЖурналаОпераций.ВариантПериодаПриОткрытииЖурналаОпераций)
	Тогда
		Попытка
			ВариантПериодаПриОткрытииЖурнала = ПредопределенноеЗначение(НастройкиПериодаЖурналаОпераций.ВариантПериодаПриОткрытииЖурналаОпераций);
		Исключение
			Возврат НачальныйПериод;
		КонецПопытки;
		
		Если ВариантПериодаПриОткрытииЖурнала = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
			НачальныйПериод = Новый СтандартныйПериод(
				НастройкиПериодаЖурналаОпераций.НачалоПериодаПриОткрытииЖурналаОпераций,
				НастройкиПериодаЖурналаОпераций.ОкончаниеПериодаПриОткрытииЖурналаОпераций);
		Иначе
			НачальныйПериод = Новый СтандартныйПериод(ВариантПериодаПриОткрытииЖурнала);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НачальныйПериод;
	
КонецФункции // ПолучитьНачальныйПериодЖурнала

&НаСервереБезКонтекста
Процедура СохранитьПериодЖурнала(Период)
	
	// проверим, установлена ли у пользователя настройка сохранения периода
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекПользователей.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекПользователей КАК ЗначенияНастроекПользователей
		|ГДЕ
		|	ЗначенияНастроекПользователей.Пользователь = &Пользователь
		|	И ЗначенияНастроекПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.СохранятьПериодЖурналаОпераций)";
		
	Запрос.УстановитьПараметр("Пользователь", РаботаСПользователями.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	ИначеЕсли Не Выборка.Значение Тогда
		Возврат;
	КонецЕсли;
	
	// зафиксируем настройку периода
	УстановитьПривилегированныйРежим(Истина);
	НастройкаПользователя = РегистрыСведений.ЗначенияНастроекПользователей.СоздатьМенеджерЗаписи();
	НастройкаПользователя.Пользователь = РаботаСПользователями.ТекущийПользователь();
	НастройкаПользователя.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ВариантПериодаПриОткрытииЖурналаОпераций;
	НастройкаПользователя.Значение     = ПолучитьПолноеИмяПредопределенногоЗначения(Период.Вариант);
	НастройкаПользователя.Записать();
	
	Если Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		НастройкаПользователя = РегистрыСведений.ЗначенияНастроекПользователей.СоздатьМенеджерЗаписи();
		НастройкаПользователя.Пользователь = РаботаСПользователями.ТекущийПользователь();
		НастройкаПользователя.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.НачалоПериодаПриОткрытииЖурналаОпераций;
		НастройкаПользователя.Значение     = Период.ДатаНачала;
		НастройкаПользователя.Записать();
		
		НастройкаПользователя = РегистрыСведений.ЗначенияНастроекПользователей.СоздатьМенеджерЗаписи();
		НастройкаПользователя.Пользователь = РаботаСПользователями.ТекущийПользователь();
		НастройкаПользователя.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.ОкончаниеПериодаПриОткрытииЖурналаОпераций;
		НастройкаПользователя.Значение     = Период.ДатаОкончания;
		НастройкаПользователя.Записать();
	КонецЕсли;
	
КонецПроцедуры // СохранитьПериодЖурнала

&НаКлиенте
Функция ПолучитьДокументыСводнойФормы(ДанныеСтрокиЖурнала)
	
	Если      ДанныеСтрокиЖурнала.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.СводнаяБиржеваяСделка") Тогда
		ИмяСводнойФормы = "ОбщаяФорма.СводнаяБиржеваяСделка";
	ИначеЕсли ДанныеСтрокиЖурнала.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.СводноеИсполнениеОбязательствПоБиржевымСделкам") Тогда
		ИмяСводнойФормы = "ОбщаяФорма.СводноеИсполнениеБиржевыхСделок";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Получение списка документов, входящих в набор «" + ДанныеСтрокиЖурнала.ВидОперации + "», не поддерживается. Документы обработаны не будут. Обратитесь к разработчикам.");
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСводнойФормы = ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(ДанныеСтрокиЖурнала,
		"Дата, Организация, СчетДоверительногоУправления, МестоХранения, Брокер, Рынок, Состояние");
		
	Возврат ПолучитьФорму(ИмяСводнойФормы, ПараметрыСводнойФормы, ЭтаФорма).ПолучитьДокументы();
	
КонецФункции // ПолучитьДокументыСводнойФормы

&НаКлиенте
Функция ПолучитьДанныеВыбранныхДокументов()
	
	ДанныеВыбранныхДокументов = Новый Массив;
	
	ВыделенныеСтрокиСписка = Элементы.ЖурналОперацийБэкОфиса.ВыделенныеСтроки;
	
	Если ВыделенныеСтрокиСписка = Неопределено Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;
	
	Если ВыделенныеСтрокиСписка.Количество() = 0 Тогда
		Возврат ДанныеВыбранныхДокументов;
	КонецЕсли;	
	
	Для каждого ВыделеннаяСтрокаСписка Из ВыделенныеСтрокиСписка Цикл
		
		ДанныеВыделеннойСтрокиСписка = Элементы.ЖурналОперацийБэкОфиса.ДанныеСтроки(ВыделеннаяСтрокаСписка);
		
		Если ДанныеВыделеннойСтрокиСписка.Свойство("ГруппировкаСтроки") Тогда	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Действие недоступно для строки группировки списка!");		
		
		ИначеЕсли ЗначениеЗаполнено(ДанныеВыделеннойСтрокиСписка.Документ) Тогда
			ДанныеВыбранныхДокументов.Добавить(
				Новый Структура("Документ, Состояние", ДанныеВыделеннойСтрокиСписка.Документ, ДанныеВыделеннойСтрокиСписка.Состояние));
				
		ИначеЕсли ДанныеВыделеннойСтрокиСписка.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.СводнаяБиржеваяСделка")
			Или ДанныеВыделеннойСтрокиСписка.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийБэкОфиса.СводноеИсполнениеОбязательствПоБиржевымСделкам")
		Тогда
			ДокументыСводнойСделки = ПолучитьДокументыСводнойФормы(ДанныеВыделеннойСтрокиСписка);
		
			Для каждого ДокументСводнойСделки Из ДокументыСводнойСделки Цикл
				ДанныеВыбранныхДокументов.Добавить(
					Новый Структура("Документ, Состояние", ДокументСводнойСделки, ДанныеВыделеннойСтрокиСписка.Состояние));
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат ДанныеВыбранныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоПериоду()
	
	ЭлементыОтбораСписка = ЭтаФорма.ЖурналОперацийБэкОфиса.Отбор.Элементы;
	
	Для Инд = 1 - ЭлементыОтбораСписка.Количество() По 0 Цикл
		
		ПредставлениеЭлементаОтбораСписка = ЭлементыОтбораСписка[-Инд].Представление;
		
		Если ПредставлениеЭлементаОтбораСписка = "Период.ДатаНачала" Или ПредставлениеЭлементаОтбораСписка = "Период.ДатаОкончания" Тогда
			ЭлементыОтбораСписка.Удалить(-Инд);
		КонецЕсли;
		
	КонецЦикла;
	
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(ЭтаФорма.ЖурналОперацийБэкОфиса.Отбор, "Дата", "Период.ДатаНачала",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Этаформа.Период.ДатаНачала, ЗначениеЗаполнено(Этаформа.Период.ДатаНачала), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(ЭтаФорма.ЖурналОперацийБэкОфиса.Отбор, "Дата", "Период.ДатаОкончания",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, Этаформа.Период.ДатаОкончания, ЗначениеЗаполнено(Этаформа.Период.ДатаОкончания), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры // УстановитьОтборПоПериоду

&НаКлиенте
Процедура ОбновитьЖурналыОпераций()
	
	Элементы.ЖурналОперацийБэкОфиса.Обновить();
	
КонецПроцедуры // ОбновитьЖурналыОпераций


#Область СОБЫТИЯ_ФОРМЫ_И_ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступнаРольПолныеПрава = РаботаСПользователями.РолиДоступны("ПолныеПрава");
	
	// настройка видимости журналов и спец. команд
		
	// подключим обработчики событий	
	Элементы.ЖурналОперацийБэкОфиса.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ЖурналОперацийПередНачаломДобавления");
	Элементы.ЖурналОперацийБэкОфиса.УстановитьДействие("ПередНачаломИзменения",  "Подключаемый_ЖурналОперацийПередНачаломИзменения");
	Элементы.ЖурналОперацийБэкОфиса.УстановитьДействие("ПередУдалением",         "Подключаемый_ЖурналОперацийПередУдалением");
	
	// настроим видимости
	Элементы.ЖурналОперацийБэкОфисаКомандаОткрытьТиповуюФормуСписка.Видимость = ДоступнаРольПолныеПрава;
	Элементы.ЖурналОперацийБэкОфисаКомандаОткрытьФормуВерификации.Видимость   = ДоступнаРольПолныеПрава;
	
	// определим виды операций, которые соответствуют документам, проведение которых запрещено
	ВидыОперацийСЗапрещеннымПроведением = Новый Массив;
	
	ИмяПеречисления = Метаданные.НайтиПоТипу(Метаданные.РегистрыСведений.ЖурналОперацийБэкОфиса.Измерения.ВидОперации.Тип.Типы()[0]).Имя;
	Для каждого ЗнчПеречисления Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
		Если Метаданные.Документы.Найти(ЗнчПеречисления.Имя) <> Неопределено
				И Метаданные.Документы[ЗнчПеречисления.Имя].Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить
		Тогда
			ВидыОперацийСЗапрещеннымПроведением.Добавить(Перечисления[ИмяПеречисления][ЗнчПеречисления.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ЖурналОперацийБэкОфиса.Параметры.УстановитьЗначениеПараметра("ВидыОперацийСЗапрещеннымПроведением", ВидыОперацийСЗапрещеннымПроведением);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// настройка периода
	ЭтаФорма.Период = ПолучитьНачальныйПериодЖурнала();
	
	УстановитьОтборПоПериоду();
	
	РаботаСФормамиКлиентСервер.УстановитьЗаголовокФормыСписка(ЭтаФорма, "Журнал операций", ЭтаФорма.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ЗначениеЗаполнено(Параметр) Тогда
		Элементы.ЖурналОперацийБэкОфиса.ТекущаяСтрока = ПолучитьКлючЗаписиПоДокументу(Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "Обработка.ЖурналыОпераций.Форма.Обновить" Тогда
		ОбновитьЖурналыОпераций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	

#Область ПОДКЛЮЧАЕМЫЕ_СОБЫТИЯ_ДИНАМИЧЕСКИХ_СПИСКОВ

&НаКлиенте
Процедура Подключаемый_ЖурналОперацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.Свойство("ВидОперации") Тогда
		ВидОперации = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(Элемент.ТекущиеДанные.ВидОперации);
	Иначе
		ВидОперации = Неопределено;
	КонецЕсли;
	
	Если Не Копирование Тогда
		ВидНовогоДокумента = ОткрытьФормуМодально("ОбщаяФорма.ВыборИзСпискаСФильтрацией",
			Новый Структура("Список, ТекущийЭлемент, Заголовок", ПолучитьСписокВидовОперацийЖурнала(), ВидОперации, "Выберите вид документа"), ЭтаФорма);
		
		Если ЗначениеЗаполнено(ВидНовогоДокумента) Тогда
			Открытьформу("Документ." + ВидНовогоДокумента + ".ФормаОбъекта");
		КонецЕсли;
		
	Иначе
		ДокументИсточник = Элемент.ТекущиеДанные.Документ;
		Если Не ЗначениеЗаполнено(ДокументИсточник) Тогда
			Возврат;
		КонецЕсли;
		
		Открытьформу("Документ." + ВидОперации + ".ФормаОбъекта", Новый Структура("ЗначениеКопирования", ДокументИсточник));
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ЖурналОперацийПередНачаломДобавления

&НаКлиенте
Процедура Подключаемый_ЖурналОперацийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда // не выбрана текущая строка 
		Возврат;
	ИначеЕсли Не ТекущиеДанные.Свойство("Документ") Тогда // это строка с группировкой
		Возврат;
	КонецЕсли;
	
	ДокументИсточник = ТекущиеДанные.Документ;
	ВидОперации      = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ТекущиеДанные.ВидОперации);
	
	// откроем форму документа
	Если      ЗначениеЗаполнено(ДокументИсточник) Тогда
		ОткрытьФорму("Документ." + ВидОперации + ".ФормаОбъекта", Новый Структура("Ключ", ДокументИсточник), ЭтаФорма);
		
	ИначеЕсли ВидОперации = "СводнаяБиржеваяСделка" Тогда
		
		ПараметрыФормы = Новый Структура("Дата, Организация, СчетДоверительногоУправления, МестоХранения, Брокер, Рынок, Состояние",
			ТекущиеДанные.Дата,
			ТекущиеДанные.Организация,
			ТекущиеДанные.СчетДоверительногоУправления,
			ТекущиеДанные.МестоХранения,
			ТекущиеДанные.Брокер,
			ТекущиеДанные.Рынок,
			ТекущиеДанные.Состояние);
			
		ОткрытьФорму("ОбщаяФорма.СводнаяБиржеваяСделка", ПараметрыФормы, ЭтаФорма, СформироватьКлючСводнойФормы(ИмяФормы, ПараметрыФормы));
		
	ИначеЕсли ВидОперации = "СводноеИсполнениеОбязательствПоБиржевымСделкам" Тогда
		
		ПараметрыФормы = Новый Структура("Дата, Организация, СчетДоверительногоУправления, МестоХранения, Брокер, Рынок, Состояние",
			ТекущиеДанные.Дата,
			ТекущиеДанные.Организация,
			ТекущиеДанные.СчетДоверительногоУправления,
			ТекущиеДанные.МестоХранения,
			ТекущиеДанные.Брокер,
			ТекущиеДанные.Рынок,
			ТекущиеДанные.Состояние);
			
		ОткрытьФорму("ОбщаяФорма.СводноеИсполнениеБиржевыхСделок", ПараметрыФормы, ЭтаФорма, СформироватьКлючСводнойФормы(ИмяФормы, ПараметрыФормы));
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ЖурналОперацийПередНачаломИзменения

&НаКлиенте
Процедура Подключаемый_ЖурналОперацийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда		
		
		Попытка
			РаботаСоСпискомДокументовКлиент.УстановитьСнятьПометкуУдаления(ДанныеВыбранныхДокументов);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Не удалось изменить пометку удаления документа из-за ошибки!
				|Ошибка:" + ОписаниеОшибки());
		КонецПопытки;
		
		ОбновитьЖурналыОпераций();
		
	КонецЕсли; 
		
КонецПроцедуры // Подключаемый_ЖурналОперацийПередУдалением

#КонецОбласти


&НаКлиенте
Процедура КомандаВыбратьПериод(Команда)
	
	ФормаВыбораПериода = ПолучитьФорму("ОбщаяФорма.ВыборПериода", Новый Структура("Период", ЭтаФорма.Период), ЭтаФорма);
	ВыбПериод          = ФормаВыбораПериода.ОткрытьМодально();
	
	Если ВыбПериод <> КодВозвратаДиалога.Отмена И ВыбПериод <> Неопределено Тогда
		ЭтаФорма.Период = ВыбПериод;
		
		УстановитьОтборПоПериоду();
			
		РаботаСФормамиКлиентСервер.УстановитьЗаголовокФормыСписка(ЭтаФорма, "Журнал документов управляющей компании", ЭтаФорма.Период);
		
		СохранитьПериодЖурнала(ЭтаФорма.Период);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНаОсновании(Команда)
	
	ТекущиеДанные = Элементы.ЖурналОперацийБэкОфиса.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("Документ") И ТекущиеДанные.Свойство("ВидОперации") 
		И ТекущиеДанные.Документ <> Неопределено И ТекущиеДанные.ВидОперации <> Неопределено Тогда

		РаботаСоСпискомДокументовКлиент.СоздатьНаОсновании(ТекущиеДанные.Документ, ТекущиеДанные.ВидОперации);
		
	ИначеЕсли ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Действие недоступно для строки группировки списка!");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровести(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
		
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		Попытка
			РаботаСоСпискомДокументовКлиент.Провести(ДанныеВыбранныхДокументов);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Не удалось провести документ из-за ошибки!
				|Ошибка:" + ОписаниеОшибки());
		КонецПопытки;
	
		ОбновитьЖурналыОпераций();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменаПроведения(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
	
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		Попытка
			РаботаСоСпискомДокументовКлиент.ОтменитьПроведение(ДанныеВыбранныхДокументов);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Не удалось отменить проведение документа из-за ошибки!
				|Ошибка:" + ОписаниеОшибки());
		КонецПопытки;
		
		ОбновитьЖурналыОпераций();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтруктураПодчиненности(Команда)
	
	ТекущиеДанные = Элементы.ЖурналОперацийБэкОфиса.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТекущиеДанные.Свойство("Документ") И ТекущиеДанные.Документ <> Неопределено Тогда

		ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ТекущиеДанные.Документ),
			ЭтаФорма,
			ТекущиеДанные.Документ);
			
	ИначеЕсли ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Действие недоступно для строки группировки списка!");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьТиповуюФормуСписка(Команда)
	
	ОткрытьФорму("РегистрСведений.ЖурналОперацийБэкОфиса.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьФормуВерификации(Команда)
	
	ОткрытьФорму("Обработка.ЖурналыОпераций.Форма.ВерификацияПолейЖурнала",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроводкиДокумента(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
		
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		ОткрытьФорму("ОбщаяФорма.ПроводкиДокумента", 
			Новый Структура("Регистратор", ДанныеВыбранныхДокументов[0].Документ), 
			ЭтаФорма, 
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДвиженияДокумента(Команда)
	
	ДанныеВыбранныхДокументов = ПолучитьДанныеВыбранныхДокументов();
		
	Если ДанныеВыбранныхДокументов.Количество() > 0 Тогда
		
		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма",
			Новый Структура("Документ", ДанныеВыбранныхДокументов[0].Документ), 
			ЭтаФорма, 
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры
