
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры


&НаСервере
Функция ДанныеДоговора()
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	СчетаДоверительногоУправления.НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения
		|ПОМЕСТИТЬ _КлиентДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_КлиентДУ.НомерДоговора,
		|	_КлиентДУ.ДатаЗаключения КАК ДатаДоговора,
		|	РеквизитыКлиентаСрезПоследних.СокращенноеНаименование КАК НаименованиеСчетаДУ,
		|	РеквизитыОрганизацийСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеОрганизации
		|ИЗ
		|	_КлиентДУ КАК _КлиентДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиентаСрезПоследних
		|		ПО _КлиентДУ.Клиент = РеквизитыКлиентаСрезПоследних.ЮрФизЛицо,
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицоОрганизации) КАК РеквизитыОрганизацийСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", Отчет.Период);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", Отчет.Организация.ЮрФизЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Данные = Новый Структура();
			Данные.Вставить("НомерДоговора", СтрЗаменить(СтрЗаменить(ВыборкаДетальныеЗаписи.НомерДоговора, "/", "_"), "\", "_"));
			Данные.Вставить("ДатаДоговора",  Формат(ВыборкаДетальныеЗаписи.ДатаДоговора, "ДФ=yyyy-MM-dd"));
			Данные.Вставить("Наименование", СтрЗаменить(ВыборкаДетальныеЗаписи.НаименованиеСчетаДУ, """", ""));
			
			Возврат Данные;
			
		КонецЕсли;

КонецФункции		

&НаКлиенте
Процедура КомандаСохранитьФайл(Команда)
	
	Если Результат.ВысотаТаблицы = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для сохранения");
		Возврат;		
	КонецЕсли;	

	Данные = ДанныеДоговора();
	
	ИмяФайла =  СокрЛП(Данные.Наименование) + "_" + Данные.НомерДоговора + " на " + Формат(Отчет.Период, "ДФ=yyyy-MM-dd") +  ".xlsx";

	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогСохраненияФайла.Фильтр             = "Лист Excel2007-... (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок          = "Укажите файл";
	
	Если НЕ ДиалогСохраненияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл успешно сохранен");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить файл!");
	КонецПопытки	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьНаСервере()

	РеквизитФормыВЗначение("Отчет").Сформировать(Результат);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();  
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокВариантов()
	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить("Основной",		"Основной");
	СписокВариантов.Добавить("Унифицированный",	"Унифицированная Форма");
	
	Возврат СписокВариантов; 
КонецФункции


&НаКлиенте
Процедура КомандаВыбратьВариант(Команда)
	СписокВыбора = ПолучитьСписокВариантов();
	
	ВыбранноеЗначение = СписокВыбора.ВыбратьЭлемент("Выбор варианта отчета", СписокВыбора.НайтиПоЗначению(Отчет.КлючТекущегоВарианта));
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Отчет.КлючТекущегоВарианта = ВыбранноеЗначение.Значение;
		ЭтаФорма.Заголовок = "Инвентаризационная ведомость " + " (" + ВыбранноеЗначение.Представление + ")";
		
	КонецЕсли;  
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СписокВыбора = ПолучитьСписокВариантов();
	
	Если НЕ ЗначениеЗаполнено(Отчет.КлючТекущегоВарианта) Тогда 
		Вариант = СписокВыбора.НайтиПоЗначению("Основной");    
		Отчет.КлючТекущегоВарианта = Вариант;
	Иначе 
		Вариант = СписокВыбора.НайтиПоЗначению(Отчет.КлючТекущегоВарианта);
	КонецЕсли; 
	ЭтаФорма.Заголовок = "Инвентаризационная ведомость " + " (" + Вариант.Представление + ")";  

КонецПроцедуры
