Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь) Экспорт
	
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
		Возврат Движения;
	КонецЕсли;
	
	МетодОпределенияДоходовИРасходов = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"МетодОпределенияДоходовИРасходов");
		
	Если Не ЗначениеЗаполнено(МетодОпределенияДоходовИРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета " + УчетныйРегистр + " не указан метод определения доходов и расходов. Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;
		
	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Рынок, ЦеннаяБумага, Дата, ДатаРеестра, ДатаПубликации, Сумма, ВалютаОплаты, СуммаОбъявленная");
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага);

	ДанныеУчетаДивидендов = БухгалтерскийУчет.ОпределитьДанныеУчетаДивидендов(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйРегистр, 
		УчетныйАктив);
	
	Если ДанныеУчетаДивидендов.СчетУчетаДивидендов = ПланыСчетов.Основной.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не указан счет учета дивидендов", ДокументСсылка, "СчетДоверительногоУправления",, Отказ);
		Возврат Движения;
	КонецЕсли;
	
	ЕстьСубконтоКонтрагенты = (ДанныеУчетаДивидендов.СчетУчетаДивидендов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);

	Если ЕстьСубконтоКонтрагенты Тогда
		Контрагент = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага, Дата);
	КонецЕсли;
	
	//Нельзя делать движения в дату отличную от даты документа
	Если ДанныеУчетаДивидендов.СпособОтраженияДивидендов = Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойСобрания Тогда
		Период = ЭтотОбъект.Дата;
	ИначеЕсли ДанныеУчетаДивидендов.СпособОтраженияДивидендов = Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойРеестра Тогда
		Если НачалоДня(ЭтотОбъект.Дата) = ЭтотОбъект.ДатаРеестра Тогда
			Период = ЭтотОбъект.Дата;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата реестра не совпадает с датой документа", ДокументСсылка, "СчетДоверительногоУправления",, Отказ);
		КонецЕсли; 
	ИначеЕсли ДанныеУчетаДивидендов.СпособОтраженияДивидендов = Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойПубликации Тогда
		Если НачалоДня(ЭтотОбъект.Дата) = ЭтотОбъект.ДатаПубликации Тогда
			Период = ЭтотОбъект.Дата;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата публикации не совпадает с датой документа", ДокументСсылка, "СчетДоверительногоУправления",, Отказ);
		КонецЕсли; 	
	ИначеЕсли ДанныеУчетаДивидендов.СпособОтраженияДивидендов = Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойОплаты Тогда
		Если ЭтоПроведениеНачисления Тогда
			Возврат Движения;
		Иначе
			Период = ЭтотОбъект.Дата;
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеУчетаДивидендов.СпособОтраженияДивидендов) Тогда 	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не определен способ определения даты отражения дивидендов", ДокументСсылка, "СчетДоверительногоУправления",, Отказ);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для способа определения даты отражения дивидендов не определена дата", ДокументСсылка, "СчетДоверительногоУправления",, Отказ);
	КонецЕсли;
	
	Если Не ЭтоПроведениеНачисления Тогда
		Период = Дата;			
	КонецЕсли;
	
	Если (Не ДанныеУчетаДивидендов.ВыделятьНалогПоДивидендам) И
		(ДанныеУчетаДивидендов.СпособОтраженияДивидендов = Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойОплаты) Тогда
		Возврат Движения;
	ИначеЕсли (ДанныеУчетаДивидендов.ВыделятьНалогПоДивидендам) И 
		(ДанныеУчетаДивидендов.СпособОтраженияДивидендов <> Перечисления.СпособыОтраженияДивидендов.ОтражатьДатойОплаты) 
		И (НЕ ЭтоПроведениеНачисления) Тогда 
		Возврат Движения;
	КонецЕсли;
	
	СодержаниеПроводки = "Начисление дивидендов";
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		СодержаниеПроводки = "Начисление дивидендов по ИСУ";
	КонецЕсли;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.ВалютаОплаты, Организация, Дата, Отказ), СодержаниеПроводки);
	
	Проводка.Период = Период;
	
	// дебет
	Проводка.СчетДт = ДанныеУчетаДивидендов.СчетУчетаДивидендов;
	
	Если ДанныеУчетаДивидендов.СчетУчетаДивидендов.Валютный Тогда
		Проводка.ВалютнаяСуммаДт 	= ЭтотОбъект.Сумма;
		Проводка.ВалютаДт 			= ЭтотОбъект.ВалютаОплаты;
	КонецЕсли;
	
	Если ЕстьСубконтоКонтрагенты Тогда
		Проводка.СубконтоДт.Контрагенты = Контрагент;
	КонецЕсли;
	
	// кредит
	Проводка.СчетКт 							= ПланыСчетов.Основной.ПрочиеДоходы;
	Проводка.СубконтоКт.ПрочиеДоходыИРасходы 	= ДанныеУчетаДивидендов.АналитикаДоходов;
	Проводка.СубконтоКт.ЦенныеБумаги         	= ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     	= БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(ЭтотОбъект.Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);

			
	Возврат Движения;
	
КонецФункции	