
&НаСервере
Процедура ВыполнитьНаСервере()
	
	РеквизитФормыВЗначение("Объект").ПровестиОтложенныеБиржевыеОперации();
	
КонецПроцедуры // ВыполнитьНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период      = ТекущаяДатаСеанса(); // Дата(2015, 3, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ВыполнитьНаСервере();
	
КонецПроцедуры
