
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");		
	Объект.ДатаСверки	= ТекущаяДата() - 86400;	
		
	ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений	= Ложь;
	ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях						= Ложь;	
	ЭтаФорма.ВремяСверки												= ТекущаяДата();	
	
	// Обработка параметров	
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаСверки") Тогда
		Объект.ДатаСверки = Параметры.ДатаСверки;
	КонецЕсли;	
	
	ЭтаФорма.БКРегион = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_БК_Регион");
		
	Объект.Депозитарий = ЭтаФорма.БКРегион;
	
	УстановитьСоответствиеДепозитариевИОтчетовНаСервере();
	
	Элементы.СтраницаОтчетОПодтвержденныхОперациях.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяСверки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ДатаСверкиПриИзменении(Элемент)

	СверенныеВручнуюДепозитарныеСчета.Очистить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхожденийПриИзменении(Элемент)

	ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях = ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений;
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ФиксироватьРезультатСверкиПриИзменении(Элемент)
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
		ЭтаФорма.ВремяСверки = ТекущаяДата();
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСверкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ВыбранноеЗначение = ВыбранноеЗначение + (ЭтаФорма.ВремяСверки - НачалоДня(ЭтаФорма.ВремяСверки));		
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	// Если найден деп.счет, то отображаем команду добавления в сверенные вручную

	НайденДепозитарныйСчет = Ложь;

	Для каждого Область Из Результат.ВыделенныеОбласти Цикл
		
		Для ИндексСтрока = Область.Верх По Область.Низ Цикл
			
			Для ИндексКолонка = Область.Лево По Область.Право Цикл
				
				Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка);
				
				Если Ячейка.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(Ячейка.Расшифровка) = Тип("СправочникСсылка.ДепозитарныеСчета") Тогда
					НайденДепозитарныйСчет = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Элементы.РезультатДобавитьВСверенныеВручную.Видимость = НайденДепозитарныйСчет;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	УстановитьСоответствиеДепозитариевИОтчетовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаОткрытьКарточку(Команда)

	Если ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.ДепозитарныеСчета")
		ИЛИ ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.Облигации")
		ИЛИ ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.Акции")
		ИЛИ ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.Паи")
		ИЛИ ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.ДепозитарныеРасписки")
		ИЛИ ТипЗнч(Результат.ТекущаяОбласть.Расшифровка) = Тип("СправочникСсылка.Векселя")
	Тогда
		ОткрытьЗначение(Результат.ТекущаяОбласть.Расшифровка);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВСверенныеВручную(Команда)

	ДепозитарныеСчета = Новый Массив;

	Для каждого Область Из Результат.ВыделенныеОбласти Цикл
		
		Для ИндексСтрока = Область.Верх По Область.Низ Цикл
			
			Для ИндексКолонка = Область.Лево По Область.Право Цикл
				
				Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка);
				
				Если Ячейка.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(Ячейка.Расшифровка) = Тип("СправочникСсылка.ДепозитарныеСчета") Тогда
					ДепозитарныеСчета.Добавить(Ячейка.Расшифровка);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ДепозитарныеСчета.Количество() > 0 Тогда
		ДобавитьВСверенныеВручную(ДепозитарныеСчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСверить(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	// Сверка должна быть на следующий рабочий день после сверяемой даты
	
	Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
	
		СледующийРабочийДень = ДобавитьКДатеРабочиеДни(КонецДня(Объект.ДатаСверки) + 1, 1);
		
		Если НачалоДня(ВремяСверки) <> СледующийРабочийДень Тогда
			
			Ответ = Вопрос("Сверка будет зафиксирована не на следующий рабочий день после сверяемой даты. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Очищаем результаты предыдущей сверки
	
	Результат						= Неопределено;
	ОтчетОПодтвержденныхОперациях	= Неопределено;
		
	ВывестиИнформациюНаКлиенте("Заголовок",		"");
	ВывестиИнформациюНаКлиенте("ПустаяСтрока",	"");	
	ВывестиИнформациюНаКлиенте("Отбор",			Новый Структура("ИмяОтбора, ЗначениеОтбора", "Организация", Объект.Организация));
	ВывестиИнформациюНаКлиенте("Отбор",			Новый Структура("ИмяОтбора, ЗначениеОтбора", "ДатаСверки", Формат(Объект.ДатаСверки,"ДФ=dd.MM.yyyy")));
	ВывестиИнформациюНаКлиенте("ПустаяСтрока",	"");	
	
	СписокДепозитарныхКомпаний = ПолучитьСписокДепозитарныхКомпаний(Объект.ДатаСверки, Объект.Организация, Объект.Депозитарий, ЭтоТраст);
	
	Для Каждого ЭлементСписка Из СписокДепозитарныхКомпаний Цикл
		
		СессияСбораСтатистики 	= "";
		ПолноеИмяОтчета 		= "";
		
		ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
	
		Объект.ЦенныеБумаги.Очистить();
		
		ВывестиИнформациюНаКлиенте("Депозитарий", ЭлементСписка.Значение, 1);
		
		ЗагрузитьДанныеИзФайлов(ЭлементСписка.Значение, ЭлементСписка.Представление);
		
		СверитьОстаткиЦенныхБумагНаСервере(ЭлементСписка.Значение);
		
		ВывестиИнформациюНаКлиенте("ПустаяСтрока", "", 2);
		
		ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
		
	КонецЦикла;
	
	ВывестиИнформацию("ПустаяСтрока", "");
	
	// Отображаем результаты сверки
	
	Элементы.СтраницаОтчетОПодтвержденныхОперациях.Видимость = ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_и_вспомогательные_функции

&НаСервере
Процедура УстановитьСоответствиеДепозитариевИОтчетовНаСервере()
		
	ЭтаФорма.ЭтоРЭМ   = Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
	
	// Заполним соответствие депозитарных компаний и их отчетов
	НСД 		= ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_НСД");
	ДК			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ДК_Регион");
	ВТБ 		= ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_ВТБ");
	Инфинитум	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум");
	РСД			= ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_Сбербанка");
	НРК			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Регистратор_НРК");
	ГПБ			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ГПБ");
		
	СоответствиеДепозитарныхКомпанийИОтчетов = Новый Соответствие;
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(ЭтаФорма.БКРегион,	Справочники.ВнешниеСистемы.ОтчетДепозитарияБКРегион);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(НСД,					Справочники.ВнешниеСистемы.ОтчетДепозитарияНСД);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(ДК,					Справочники.ВнешниеСистемы.ОтчетДепозитарияДКРегион);	
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(ВТБ,					Справочники.ВнешниеСистемы.ОтчетДепозитарияВТБ);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(Инфинитум,			Справочники.ВнешниеСистемы.ОтчетДепозитарияИнфинитум);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(РСД,					Справочники.ВнешниеСистемы.ОтчетДепозитарияСбербанка);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(НРК,					Справочники.ВнешниеСистемы.ОтчетРегистратораНРК);
	СоответствиеДепозитарныхКомпанийИОтчетов.Вставить(ГПБ,					Справочники.ВнешниеСистемы.ОтчетДепозитарияГПБ);
		
	ОтчетыДепозитарныхКомпаний = Новый ФиксированноеСоответствие(СоответствиеДепозитарныхКомпанийИОтчетов);
	
	// Видимость элементов по умолчанию
	МассивДепозитариев = Новый Массив;
	МассивДепозитариев.Добавить(ЭтаФорма.БКРегион);
	МассивДепозитариев.Добавить(ГПБ);
		
	Если ЭтоРЭМ Тогда		
		МассивДепозитариев.Добавить(ДК);		
		МассивДепозитариев.Добавить(Инфинитум);
		МассивДепозитариев.Добавить(ВТБ);	
		МассивДепозитариев.Добавить(РСД);
		МассивДепозитариев.Добавить(НСД);
	КонецЕсли;
	
	Элементы.Депозитарий.СписокВыбора.ЗагрузитьЗначения(МассивДепозитариев);			
	
КонецПроцедуры

&НаСервере
Функция СверитьОстаткиЦенныхБумагНаСервере(ДепозитарнаяКомпания)
	
	// Запрос сверяемых данных
	
	Запрос = Новый Запрос;
	
	ПоместитьДепозитарныеСчетаКлиентовВМенеджерВременныхТаблиц(Запрос, Объект.ДатаСверки, Объект.Организация, ЭтоТраст, ДепозитарнаяКомпания, Истина);
	
	ПоместитьЦенныеБумагиДепозитарияВМенеджерВременныхТаблиц(Запрос, Объект.ДатаСверки, Объект.Организация, ДепозитарнаяКомпания, Объект.ЦенныеБумаги.Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитарныеСчетаКлиентов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДепозитарныеСчетаКлиентов.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ДепозитарныеСчетаКлиентов.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	ЛОЖЬ КАК СверкаВыполнена,
		|	ЛОЖЬ КАК ЕстьРасхождения,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(1024)) КАК Примечание
		|ПОМЕСТИТЬ _СверяемыеДепозитарныеСчетаКлиентов
		|ИЗ
		|	_ДепозитарныеСчетаКлиентов КАК _ДепозитарныеСчетаКлиентов
		|ГДЕ
		|	(_ДепозитарныеСчетаКлиентов.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _ДепозитарныеСчетаКлиентов.ДатаРасторжения > &ДатаСверки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитарныеСчетаКлиентов.ДепозитарныйСчет КАК ДепозитарныйСчет
		|ПОМЕСТИТЬ _ДепозитарныеСчета
		|ИЗ
		|	_ДепозитарныеСчетаКлиентов КАК _ДепозитарныеСчетаКлиентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитарныеСчета.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага, НЕОПРЕДЕЛЕНО) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(СУММА(ОстаткиЦенныхБумагОстатки.КоличествоОстаток), 0) КАК Количество
		|ПОМЕСТИТЬ _ЦенныеБумаги1С
		|ИЗ
		|	_ДепозитарныеСчета КАК _ДепозитарныеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(&ДатаСверкиВключая, Организация = &Организация) КАК ОстаткиЦенныхБумагОстатки
		|		ПО (_ДепозитарныеСчета.ДепозитарныйСчет = ВЫБОР
		|				КОГДА ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|					ТОГДА ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет.Родитель
		|				ИНАЧЕ ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДепозитарныеСчета.ДепозитарныйСчет,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.ЦеннаяБумага, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъединенныеОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	ОбъединенныеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ОбъединенныеОстатки.КоличествоДепозитарий) КАК КоличествоДепозитарий,
		|	СУММА(ОбъединенныеОстатки.Количество1С) КАК Количество1С
		|ПОМЕСТИТЬ _СопоставленныеОстатки
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ЦенныеБумагиДепозитарий.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|		_ЦенныеБумагиДепозитарий.ЦеннаяБумага КАК ЦеннаяБумага,
		|		_ЦенныеБумагиДепозитарий.Количество КАК КоличествоДепозитарий,
		|		0 КАК Количество1С
		|	ИЗ
		|		_ЦенныеБумагиДепозитарий КАК _ЦенныеБумагиДепозитарий
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ЦенныеБумаги1С.ДепозитарныйСчет,
		|		_ЦенныеБумаги1С.ЦеннаяБумага,
		|		0,
		|		_ЦенныеБумаги1С.Количество
		|	ИЗ
		|		_ЦенныеБумаги1С КАК _ЦенныеБумаги1С) КАК ОбъединенныеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъединенныеОстатки.ДепозитарныйСчет,
		|	ОбъединенныеОстатки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЗаполненныеСсылки.ЦеннаяБумага) КАК Количество,
		|	_ЗаполненныеСсылки.КодБумаги КАК КодБумаги
		|ПОМЕСТИТЬ _ПроверкаДублейЦенныхБумаг
		|ИЗ
		|	_ЗаполненныеСсылки КАК _ЗаполненныеСсылки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗаполненныеСсылки.КодБумаги
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ЗаполненныеСсылки.ЦеннаяБумага) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СопоставленныеОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_СопоставленныеОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_СопоставленныеОстатки.КоличествоДепозитарий КАК КоличествоДепозитарий,
		|	_СопоставленныеОстатки.Количество1С КАК Количество1С,
		|	ВЫБОР
		|		КОГДА _СопоставленныеОстатки.ДепозитарныйСчет В (&СверенныеВручнуюДепозитарныеСчета)
		|			ТОГДА ""0_РасхожденийНетСвереноВручную""
		|		КОГДА СверкаДепозитарныхСчетов.НетВ1С
		|			ТОГДА ""4_НетСчетаВ1С""
		|		КОГДА СверкаДепозитарныхСчетов.НетВВыгрузке
		|				И &СверятьПриОтсутствииВВыгрузке
		|			ТОГДА ""1_РасхожденийНет""
		|		КОГДА СверкаДепозитарныхСчетов.НетВВыгрузке
		|			ТОГДА ""3_НетСчетаВВыгрузке""
		|		КОГДА _СопоставленныеОстатки.КоличествоДепозитарий = _СопоставленныеОстатки.Количество1С
		|			ТОГДА ""1_РасхожденийНет""
		|		ИНАЧЕ ""2_Расхождения""
		|	КОНЕЦ КАК ИмяОбласти,
		|	ВЫБОР
		|		КОГДА _СверяемыеДепозитарныеСчетаКлиентов.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|			ТОГДА ""ИИС""
		|		ИНАЧЕ _СверяемыеДепозитарныеСчетаКлиентов.СчетДоверительногоУправления
		|	КОНЕЦ КАК СчетДоверительногоУправления
		|ИЗ
		|	_СопоставленныеОстатки КАК _СопоставленныеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СопоставленныеОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|			МАКСИМУМ(_СопоставленныеОстатки.КоличествоДепозитарий) ЕСТЬ NULL КАК НетВВыгрузке,
		|			МАКСИМУМ(_СопоставленныеОстатки.Количество1С) ЕСТЬ NULL КАК НетВ1С
		|		ИЗ
		|			_СопоставленныеОстатки КАК _СопоставленныеОстатки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СопоставленныеОстатки.ДепозитарныйСчет) КАК СверкаДепозитарныхСчетов
		|		ПО (СверкаДепозитарныхСчетов.ДепозитарныйСчет = _СопоставленныеОстатки.ДепозитарныйСчет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СверяемыеДепозитарныеСчетаКлиентов КАК _СверяемыеДепозитарныеСчетаКлиентов
		|		ПО _СопоставленныеОстатки.ДепозитарныйСчет = _СверяемыеДепозитарныеСчетаКлиентов.ДепозитарныйСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДепозитарныйСчет,
		|	ЦеннаяБумага
		|ИТОГИ
		|	ПОДСТРОКА(МАКСИМУМ(ИмяОбласти), 3, 100) КАК ИмяОбласти
		|ПО
		|	ОБЩИЕ,
		|	ДепозитарныйСчет,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";		
	
	Запрос.УстановитьПараметр("Организация",						Объект.Организация);
	Запрос.УстановитьПараметр("ДатаСверки",							КонецДня(Объект.ДатаСверки));
	Запрос.УстановитьПараметр("ДатаСверкиВключая",					Новый Граница(КонецДня(Объект.ДатаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СверенныеВручнуюДепозитарныеСчета",	СверенныеВручнуюДепозитарныеСчета.Выгрузить().ВыгрузитьКолонку("ДепозитарныйСчет"));
	Запрос.УстановитьПараметр("СверятьПриОтсутствииВВыгрузке",
			ДепозитарнаяКомпания = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ГПБ") И Объект.ЦенныеБумаги.Количество() > 0);
	
	ВыборкаДепозитариев = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДепозитарныеСчетаКлиентов = Запрос.МенеджерВременныхТаблиц.Таблицы["_СверяемыеДепозитарныеСчетаКлиентов"].ПолучитьДанные().Выгрузить();
	ДепозитарныеСчетаКлиентов.Индексы.Добавить("ДепозитарныйСчет");
	ДепозитарныеСчетаКлиентов.Индексы.Добавить("СчетДоверительногоУправления");
	
	ДублиЦенныхБумаг = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПроверкаДублейЦенныхБумаг"].ПолучитьДанные().Выгрузить();	
	Для Каждого СтрокаДублей Из ДублиЦенныхБумаг Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено " + СтрокаДублей.Количество + " ценных бумаги с одинаковым государственным регистрационным номером " + СтрокаДублей.КодБумаги);
	КонецЦикла;
	
	// Формируем отчет о результатах сверки	
	
	НетСчетаВ1С = Ложь;
	
	Пока ВыборкаДепозитариев.Следующий() Цикл
		Если ВыборкаДепозитариев.ИмяОбласти = "НетСчетаВ1С" Тогда
			НетСчетаВ1С = Истина;
		КонецЕсли;
		
		ВыборкаСчетовДУ = ВыборкаДепозитариев.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчетовДУ.Следующий() Цикл
		
			ДанныеОтчетаОСверке = ВыборкаСчетовДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			
			Пока ДанныеОтчетаОСверке.Следующий() Цикл
				Если Не (Объект.ВыводитьТолькоРасхождения И ДанныеОтчетаОСверке.ИмяОбласти = "РасхожденийНет") Тогда
					ВывестиИнформацию(ДанныеОтчетаОСверке.ИмяОбласти, ДанныеОтчетаОСверке);
				КонецЕсли;
				
				Если ЭтаФорма.ФиксироватьРезультатСверки ИЛИ ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений Тогда
					ЗаполнитьРасхожденияПоДепозитарнымСчетамКлиентов(ДепозитарныеСчетаКлиентов, ДанныеОтчетаОСверке.ДепозитарныйСчет, ДанныеОтчетаОСверке);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;	
	
	Если ЭтаФорма.ФиксироватьРезультатСверки ИЛИ ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений Тогда
		ЗафиксироватьРезультатыСверки(ДепозитарныеСчетаКлиентов, ДепозитарнаяКомпания, НетСчетаВ1С);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ВыводитьОтчетОПодтвержденныхОперациях.Доступность	= Форма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений;
	Элементы.ВремяСверки.Доступность							= Форма.ФиксироватьРезультатСверки;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКаталогДанных(Организация, КодДепозитарнойКомпании, ДатаСверки, ТекущийКаталог)
	
	НовыйКаталог = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки._СверкаСДепозитарием." + КодДепозитарнойКомпании, Организация, ДатаСверки, ТекущийКаталог);
	
	Если ЗначениеЗаполнено(НовыйКаталог) Тогда
		Возврат НовыйКаталог;
	Иначе	
		Возврат ТекущийКаталог;
	КонецЕсли;
	
КонецФункции // ПолучитьКаталогДанных

&НаСервереБезКонтекста
Функция ПолучитьСписокДепозитарныхКомпаний(ДатаСверки, Организация, Депозитарий, ЭтоТраст)
	
	Запрос = Новый Запрос;
	
	ПоместитьДепозитарныеСчетаКлиентовВМенеджерВременныхТаблиц(Запрос, ДатаСверки, Организация, ЭтоТраст); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ДепозитарныеСчетаКлиентов.ДепозитарнаяКомпания КАК ДепозитарнаяКомпания,
		|	_ДепозитарныеСчетаКлиентов.КодДепозитарнойКомпании КАК КодДепозитарнойКомпании
		|ИЗ
		|	_ДепозитарныеСчетаКлиентов КАК _ДепозитарныеСчетаКлиентов
		|ГДЕ
		|	_ДепозитарныеСчетаКлиентов.ДепозитарнаяКомпания = &Депозитарий";
	
	Запрос.УстановитьПараметр("Депозитарий", Депозитарий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Заполняем список
	
	СписокДепозитарныхКомпаний = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокДепозитарныхКомпаний.Добавить(Выборка.ДепозитарнаяКомпания, Выборка.КодДепозитарнойКомпании);
	КонецЦикла;
	
	Возврат СписокДепозитарныхКомпаний;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоместитьДепозитарныеСчетаКлиентовВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, ДатаСверки, Организация, ЭтоТраст, ДепозитарнаяКомпания = Неопределено, ВключаяРасторгнутыеДоговорыДУ = Ложь)
	
	// Определяем источник временных таблиц		
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ИсточникВременныхТаблиц) = Тип("Запрос") Тогда
		Если ИсточникВременныхТаблиц.МенеджерВременныхТаблиц = Неопределено Тогда
			ИсточникВременныхТаблиц.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		КонецЕсли;
		Запрос.МенеджерВременныхТаблиц = ИсточникВременныхТаблиц.МенеджерВременныхТаблиц;
	ИначеЕсли ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		Запрос.МенеджерВременныхТаблиц = ИсточникВременныхТаблиц;
	КонецЕсли;	
	
	// Получаем депозитарные счета из исполнителей
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаПоЛицензииДУ
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
		|			&ДатаСверки,
		|			Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &ЭтоТраст
		|						ТОГДА Лицензия.ВидДеятельности В (ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами), ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ))
		|					ИНАЧЕ Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|				КОНЕЦ) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий КАК ДепозитарнаяКомпания,
		|	ВЫБОР
		|		КОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Родитель
		|		ИНАЧЕ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет
		|	КОНЕЦ КАК ДепозитарныйСчет,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодДепозитарнойКомпании
		|ПОМЕСТИТЬ _ДепозитарныеСчетаКлиентов
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаПоЛицензииДУ КАК _СчетаПоЛицензииДУ
		|		ПО СчетаДоверительногоУправления.Ссылка = _СчетаПоЛицензииДУ.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(&ДатаСверки, ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СверкаСДепозитарием)) КАК КодыВоВнешнихСистемахСрезПоследних
		|			ПО ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий = КодыВоВнешнихСистемахСрезПоследних.Объект
		|		ПО СчетаДоверительногоУправления.Организация = ИсполнителиПоЦеннымБумагам.Организация
		|			И СчетаДоверительногоУправления.Ссылка = ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаСверки, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ПометкаУдаления = ЛОЖЬ
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаСверки
		|	И НЕ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ПометкаУдаления
		|	И (&ВключаяРасторгнутыеДоговорыДУ
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &ДатаСверки)
		|	И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > &ДатаСверки)
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаЗакрытия > &ДатаСверки)
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.ДатаОткрытия <= &ДатаСверки)
		|	И (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.ДатаЗаключения ЕСТЬ NULL
		|			ИЛИ ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.ДатаЗаключения <= &ДатаСверки)
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ДатаСверки)
		|	И &ДепозитарнаяКомпания В (НЕОПРЕДЕЛЕНО, ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий)";
	
	Запрос.УстановитьПараметр("ДатаСверки",						КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ДепозитарнаяКомпания",			ДепозитарнаяКомпания);
	Запрос.УстановитьПараметр("ВключаяРасторгнутыеДоговорыДУ",	ВключаяРасторгнутыеДоговорыДУ);
	Запрос.УстановитьПараметр("ЭтоТраст", 						ЭтоТраст);
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьЦенныеБумагиДепозитарияВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, ДатаСверки, Организация, ДепозитарнаяКомпания, ЦенныеБумаги)
	
	// Определяем источник временных таблиц		
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ИсточникВременныхТаблиц) = Тип("Запрос") Тогда
		Если ИсточникВременныхТаблиц.МенеджерВременныхТаблиц = Неопределено Тогда
			ИсточникВременныхТаблиц.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		КонецЕсли;
		Запрос.МенеджерВременныхТаблиц = ИсточникВременныхТаблиц.МенеджерВременныхТаблиц;
	ИначеЕсли ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		Запрос.МенеджерВременныхТаблиц = ИсточникВременныхТаблиц;
	КонецЕсли;	
	
	// Заполняем ссылки
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенныеБумаги.Depo_Account_Number КАК НомерСчета,
		|	ЦенныеБумаги.Depo_Account_Division_Number КАК НомерРаздела,
		|	ЦенныеБумаги.Security_Type КАК ТипБумаги,
		|	ЦенныеБумаги.Security_Reg_No КАК КодБумаги,
		|	ЦенныеБумаги.Количество КАК Количество
		|ПОМЕСТИТЬ _ЗагруженныеДанные
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитарныеСчета.Ссылка КАК ДепозитарныйСчет,
		|	_ЗагруженныеДанные.НомерСчета КАК НомерСчета,
		|	_ЗагруженныеДанные.НомерРаздела КАК НомерРаздела,
		|	ВЫБОР
		|		КОГДА _ЗагруженныеДанные.КодБумаги В ("""", ""-"")
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЕСТЬNULL(Облигации.Ссылка, ЕСТЬNULL(Акции.Ссылка, ЕСТЬNULL(Векселя.Ссылка, ЕСТЬNULL(ДепозитарныеРасписки.Ссылка, ЕСТЬNULL(Паи.Ссылка, КодыISIN.Объект)))))
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	_ЗагруженныеДанные.ТипБумаги КАК ТипБумаги,
		|	_ЗагруженныеДанные.КодБумаги КАК КодБумаги,
		|	_ЗагруженныеДанные.Количество КАК Количество
		|ПОМЕСТИТЬ _ЗаполненныеСсылки
		|ИЗ
		|	_ЗагруженныеДанные КАК _ЗагруженныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|		ПО (ДепозитарныеСчета.Организация = &Организация)
		|			И (ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.Депозитарный))
		|			И (ДепозитарныеСчета.НомерСчета = _ЗагруженныеДанные.НомерСчета
		|				ИЛИ ДепозитарныеСчета.НомерСчета = ""00000000000000000_"" + _ЗагруженныеДанные.НомерСчета)
		|			И (НЕ ДепозитарныеСчета.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (_ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%облигаци%""
		|				ИЛИ _ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%государственные цб%""
		|				ИЛИ _ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%BOND%"")
		|			И (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И (_ЗагруженныеДанные.КодБумаги В (Облигации.ГосударственныйРегистрационныйНомер, Облигации.ГосударственныйРегистрационныйНомер + ""/"" + Облигации.НомерВыпуска))
		|			И (НЕ Облигации.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО (_ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%акция%""
		|				ИЛИ _ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%акции%""
		|				ИЛИ _ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%ORDN%"")
		|			И (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И _ЗагруженныеДанные.КодБумаги = Акции.ГосударственныйРегистрационныйНомер
		|			И (НЕ Акции.ПометкаУдаления)
		|			И (ВЫБОР
		|				КОГДА Акции.ГосударственныйРегистрационныйНомер = &ГРНАкция_ИнтерРАО
		|					ТОГДА Акции.Ссылка = &Акция_ИнтерРАО
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|		ПО (_ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%вексель%"")
		|			И (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И _ЗагруженныеДанные.КодБумаги = Векселя.Номер
		|			И (НЕ Векселя.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|		ПО (_ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%депозитарная расписка%"")
		|			И (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И _ЗагруженныеДанные.КодБумаги = ДепозитарныеРасписки.РегистрационныйНомер
		|			И (НЕ ДепозитарныеРасписки.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|		ПО (_ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%пай%""
		|				ИЛИ _ЗагруженныеДанные.ТипБумаги ПОДОБНО ""%паи%"")
		|			И (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И _ЗагруженныеДанные.КодБумаги = Паи.ГосударственныйРегистрационныйНомер
		|			И (НЕ Паи.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					И НЕ Объект.ПометкаУдаления) КАК КодыISIN
		|		ПО (НЕ _ЗагруженныеДанные.КодБумаги В ("""", ""-""))
		|			И _ЗагруженныеДанные.КодБумаги = КодыISIN.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ЗаполненныеСсылки.ДепозитарныйСчет ЕСТЬ NULL
		|			ТОГДА ""Депозитарный счет № "" + _ЗаполненныеСсылки.НомерСчета
		|		ИНАЧЕ _ЗаполненныеСсылки.ДепозитарныйСчет
		|	КОНЕЦ КАК ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА _ЗаполненныеСсылки.ЦеннаяБумага ЕСТЬ NULL
		|			ТОГДА ""Ценная бумага ("" + _ЗаполненныеСсылки.ТипБумаги + "" "" + _ЗаполненныеСсылки.КодБумаги + "")""
		|		ИНАЧЕ _ЗаполненныеСсылки.ЦеннаяБумага
		|	КОНЕЦ КАК ЦеннаяБумага,
		|	СУММА(_ЗаполненныеСсылки.Количество) КАК Количество
		|ПОМЕСТИТЬ _ЦенныеБумагиДепозитарий
		|ИЗ
		|	_ЗаполненныеСсылки КАК _ЗаполненныеСсылки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА _ЗаполненныеСсылки.ДепозитарныйСчет ЕСТЬ NULL
		|			ТОГДА ""Депозитарный счет № "" + _ЗаполненныеСсылки.НомерСчета
		|		ИНАЧЕ _ЗаполненныеСсылки.ДепозитарныйСчет
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ЗаполненныеСсылки.ЦеннаяБумага ЕСТЬ NULL
		|			ТОГДА ""Ценная бумага ("" + _ЗаполненныеСсылки.ТипБумаги + "" "" + _ЗаполненныеСсылки.КодБумаги + "")""
		|		ИНАЧЕ _ЗаполненныеСсылки.ЦеннаяБумага
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумагиДепозитарий.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	_ЦенныеБумагиДепозитарий.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ЦенныеБумагиДепозитарий КАК _ЦенныеБумагиДепозитарий
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(_ЦенныеБумагиДепозитарий.ДепозитарныйСчет) = ТИП(СТРОКА)
		|			ИЛИ ТИПЗНАЧЕНИЯ(_ЦенныеБумагиДепозитарий.ЦеннаяБумага) = ТИП(СТРОКА))
		|ИТОГИ ПО
		|	ДепозитарныйСчет";
	
	Запрос.УстановитьПараметр("Период",					КонецДня(ДатаСверки));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ДепозитарнаяКомпания",	ДепозитарнаяКомпания);
	Запрос.УстановитьПараметр("ЦенныеБумаги",			ЦенныеБумаги);
	
	АкцияИнтерРАО = ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАО");
	ГРН	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АкцияИнтерРАО, "ГосударственныйРегистрационныйНомер");
	
	Запрос.УстановитьПараметр("Акция_ИнтерРАО", АкцияИнтерРАО);
	Запрос.УстановитьПараметр("ГРНАкция_ИнтерРАО", ГРН);
	
	// Получим результаты и оповестим об ошибках сопоставления
	
	ВыборкаОшибокСчета = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОшибокСчета.Следующий() Цикл
		
		//Если ТипЗнч(ВыборкаОшибокСчета.ДепозитарныйСчет) = Тип("Строка") Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось получить депозитарный счет '%1'", ВыборкаОшибокСчета.ДепозитарныйСчет));
		//КонецЕсли;	
		
		ВыборкаОшибокБумаг = ВыборкаОшибокСчета.Выбрать();
		
		Пока ВыборкаОшибокБумаг.Следующий() Цикл
		
			Если ТипЗнч(ВыборкаОшибокБумаг.ЦеннаяБумага) = Тип("Строка") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1: не удалось получить ценную бумагу '%2'", ВыборкаОшибокСчета.ДепозитарныйСчет, ВыборкаОшибокБумаг.ЦеннаяБумага));
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуИзСтрокиДДММГГГГ(ДатаТекст)
	
	Возврат Дата(Число(Прав(ДатаТекст, 4)), Число(Сред(ДатаТекст, 4, 2)), Число(Лев(ДатаТекст, 2)));
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуИзСтрокиГГГГ_ММ_ДД(ДатаТекст)
	
	СтрДата = СтрЗаменить(ДатаТекст, "-", "");
	Возврат Дата(Число(Лев(СтрДата, 4)), Число(Сред(СтрДата, 5, 2)), Число(Прав(СтрДата, 2)));
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьТабличныйДокумент(ДанныеФайла, РасширениеФайла, Отказ = Ложь)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	ДанныеФайла.Записать(ИмяВременногоФайла);	
	
	Попытка
		Результат = Новый ТабличныйДокумент;
		Результат.Прочитать(ИмяВременногоФайла);	
	Исключение
		УдалитьФайлы(ИмяВременногоФайла);
		ВызватьИсключение;		
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНомерДепозитарногоСчетаИДатуСверки(Знач ЗаголовокОтчета, ПутьКФайлуОстатков)
	
	ПараметрыСверки = Новый Структура("НомерСчета, ДатаСверки");
	
	Строка1 = "ВЫПИСКА О СОСТОЯНИИ СЧЕТА/СЧЕТА ДЕПО № ";
	Строка2 = "на конец операционного дня ";
	
	Если Найти(ЗаголовокОтчета, Строка1) = 0 ИЛИ Найти(ЗаголовокОтчета, Строка2) = 0 Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Изменился формат заголовка отчёта, не возможно прочитать файл: " + ПутьКФайлуОстатков);
		Возврат ПараметрыСверки;
	КонецЕсли;
	
	ПараметрыСверки.НомерСчета = Сред(ЗаголовокОтчета, Найти(ЗаголовокОтчета, Строка1) + СтрДлина(Строка1), 10);
	ПараметрыСверки.ДатаСверки = ПолучитьДатуИзСтрокиДДММГГГГ(Сред(ЗаголовокОтчета, Найти(ЗаголовокОтчета, Строка2) + СтрДлина(Строка2), 10));
	
	Возврат ПараметрыСверки;	
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_БК_Регион(ПутьКФайлуОстатков)
	
	ДобавитьПустуюСтроку = Истина;
	
	Кэш = Новый Соответствие;
	ЖурналОшибок = Новый Массив;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ДополнительныеПараметры.Вставить("Кэш", Кэш);
	ДополнительныеПараметры.Вставить("ЖурналОшибок", ЖурналОшибок);	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	ИмяКорневогоУзла = "";
	Depo_Account_Number = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		Если ПустаяСтрока(ИмяКорневогоУзла) Тогда
			ИмяКорневогоУзла = ИмяУзла;
			
			Если ИмяКорневогоУзла <> "DEPO_ACC_STATEMENT" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Выбранный файл не содержит остатки ценных бумаг у депозитария");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяУзла = "Header" И ЧтениеXML.ЗначениеАтрибута("q_date") <> Неопределено Тогда
			
			// Если в одном файле несколько деп.счетов 
			Если ЗначениеЗаполнено(Depo_Account_Number) Тогда
				Если ДобавитьПустуюСтроку Тогда
					СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
					СтрокаЦБ.Depo_Account_Number = Depo_Account_Number;
				КонецЕсли;
				
				ДобавитьПустуюСтроку = Истина;
			КонецЕсли;
			
			Объект.ДатаСверки = ПолучитьДатуИзСтрокиДДММГГГГ(ЧтениеXML.ЗначениеАтрибута("q_date"));
			ДополнительныеПараметры.Вставить("ДатаСверки", Объект.ДатаСверки);
			
			Depo_Account_Number = ЧтениеXML.ЗначениеАтрибута("acc_no");
			
		ИначеЕсли ИмяУзла = "Detail" И ЧтениеXML.ЗначениеАтрибута("stock_qty") <> Неопределено Тогда
			
			ДобавитьПустуюСтроку = Ложь;
			
			СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
			
			СтрокаЦБ.Security_Type                      = ЧтениеXML.ЗначениеАтрибута("stock_type");
			СтрокаЦБ.Security_Reg_No                    = ЧтениеXML.ЗначениеАтрибута("statereg_no");
			СтрокаЦБ.Depo_Account_Number                = Depo_Account_Number;
			СтрокаЦБ.Количество                         = Число(ЧтениеXML.ЗначениеАтрибута("stock_qty"));
			
		КонецЕсли;

	КонецЦикла;
	
	Если ДобавитьПустуюСтроку Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = Depo_Account_Number;
	КонецЕсли;
	
	Для каждого ТекстОшибки Из ДополнительныеПараметры.ЖурналОшибок Цикл
		Сообщить(ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_СДК_Гарант(ПутьКФайлуОстатков)
	
	ДобавитьПустуюСтроку = Истина;
	
	Кэш = Новый Соответствие;
	ЖурналОшибок = Новый Массив;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ДополнительныеПараметры.Вставить("Кэш", Кэш);
	ДополнительныеПараметры.Вставить("ЖурналОшибок", ЖурналОшибок);	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	ИмяКорневогоУзла = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		Если ПустаяСтрока(ИмяКорневогоУзла) Тогда
			ИмяКорневогоУзла = ИмяУзла;
			
			Если ИмяКорневогоУзла <> "Report" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формата файла. Выбранный файл не содержит остатки ценных бумаг у депозитария");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяУзла = "TablixHeader" Тогда
			
			ПараметрыСверки = ПолучитьНомерДепозитарногоСчетаИДатуСверки(ЧтениеXML.ЗначениеАтрибута("Header"), ПутьКФайлуОстатков);
			
			Объект.ДатаСверки = ПараметрыСверки.ДатаСверки;
			ДополнительныеПараметры.Вставить("ДатаСверки", Объект.ДатаСверки);
			
			Depo_Account_Number = ПараметрыСверки.НомерСчета;
			
		ИначеЕсли ИмяУзла = "Information" И ЧтениеXML.ЗначениеАтрибута("FinToolCount") <> Неопределено И ЧтениеXML.ЗначениеАтрибута("FinToolCount") <> "0" Тогда
			
			ДобавитьПустуюСтроку = Ложь;
			
			СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
			
			СтрокаЦБ.Security_Type                      = ЧтениеXML.ЗначениеАтрибута("StockType");
			СтрокаЦБ.Security_Reg_No                    = ЧтениеXML.ЗначениеАтрибута("StockNumber");
			СтрокаЦБ.Depo_Account_Number                = Depo_Account_Number;
			СтрокаЦБ.Количество                         = Число(ЧтениеXML.ЗначениеАтрибута("FinToolCount"));
			
		КонецЕсли;

	КонецЦикла;
	
	Если ДобавитьПустуюСтроку Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = Depo_Account_Number;
	КонецЕсли;
	
	Для каждого ТекстОшибки Из ДополнительныеПараметры.ЖурналОшибок Цикл
		Сообщить(ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_РСД(ПутьКФайлуОстатков)
	
	Попытка
		ФайлДанных = ПрочитатьТабличныйДокумент(Новый ДвоичныеДанные(ПутьКФайлуОстатков), "xlsx");  
	Исключение
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла: " + ПутьКФайлуОстатков);
		Возврат;
	КонецПопытки;
	
	// Определяем дату выписки и депозитарный счет	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("по состоянию на ", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить дату выписки: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		ДатаВыписки = Дата(Сред(ОбластьПоЗначению.Текст, СтрДлина("по состоянию на ") + 1) + " 00:00:00");
		
		Если ДатаВыписки <> Объект.ДатаСверки Тогда
			ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Счет депо:", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить номер счета депо: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		НомерДепозитарногоСчета = ФайлДанных.Область(ОбластьПоЗначению.Верх, ОбластьПоЗначению.Право + 1, ОбластьПоЗначению.Верх, ОбластьПоЗначению.Право + 1).Текст;
		ДобавитьПустуюСтроку	= Истина;	
	КонецЕсли;
	
	// Ищем ключевые колонки таблицы ЦБ
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Вид/категория (тип) ценных бумаг", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Вид/категория (тип) ценных бумаг' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаКатегория	= ОбластьПоЗначению.Лево;
		НачалоТаблицыЦБ		= ОбластьПоЗначению.Низ + 1;
	КонецЕсли;	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Гос. рег. № выпуска", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Гос. рег. № выпуска' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаРегНомер	= ОбластьПоЗначению.Лево;
	КонецЕсли;	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("ISIN", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'ISIN' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаISIN		= ОбластьПоЗначению.Лево;
	КонецЕсли;
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Количество ЦБ, шт.", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Количество' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаКоличество = ОбластьПоЗначению.Лево;
	КонецЕсли;
	
	// Читаем таблицу ЦБ	
	
	ВысотаТаблицы = ФайлДанных.ВысотаТаблицы;
	
	Пока НачалоТаблицыЦБ < ВысотаТаблицы Цикл		
		Категория	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаКатегория).Текст;
		РегНомер	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаРегНомер).Текст;
		ISIN		= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаISIN).Текст;
		Количество	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаКоличество).Текст;
		
		Если ПустаяСтрока(Категория) Тогда
			Прервать;
		КонецЕсли;
		
		ДобавитьПустуюСтроку = Ложь;
		
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Security_Type			= Категория;
		СтрокаЦБ.Security_Reg_No		= ?(ПустаяСтрока(РегНомер), ISIN, РегНомер);
		СтрокаЦБ.Depo_Account_Number	= НомерДепозитарногоСчета;
		СтрокаЦБ.Количество				= Число(Количество);
		
		НачалоТаблицыЦБ = НачалоТаблицыЦБ + 1;	
	КонецЦикла;
	
	// Если на счету нет бумаг, фиксируем, что по нему была выписка	
	
	Если ДобавитьПустуюСтроку Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_НСД(ПутьКФайлуОстатков)
	
	Попытка
		ФайлДанных = ПрочитатьТабличныйДокумент(Новый ДвоичныеДанные(ПутьКФайлуОстатков), "xlsx");  
	Исключение
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла: " + ПутьКФайлуОстатков);
		Возврат;
	КонецПопытки;
	
	// Определяем дату выписки и депозитарный счет	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("по состоянию на ", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить дату выписки: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		ДатаВыписки = Дата(Сред(ОбластьПоЗначению.Текст, СтрДлина("по состоянию на ") + 1) + " 00:00:00");
		
		Если ДатаВыписки <> Объект.ДатаСверки Тогда
			ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Счет депо:", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить номер счета депо: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		НомерДепозитарногоСчета = ФайлДанных.Область(ОбластьПоЗначению.Верх, ОбластьПоЗначению.Право + 1, ОбластьПоЗначению.Верх, ОбластьПоЗначению.Право + 1).Текст;
		ДобавитьПустуюСтроку	= Истина;	
	КонецЕсли;
	
	// Ищем ключевые колонки таблицы ЦБ
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Вид/категория (тип) ценных бумаг", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Вид/категория (тип) ценных бумаг' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаКатегория	= ОбластьПоЗначению.Лево;
		НачалоТаблицыЦБ		= ОбластьПоЗначению.Низ + 1;
	КонецЕсли;	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Гос. рег. № выпуска", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Гос. рег. № выпуска' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаРегНомер	= ОбластьПоЗначению.Лево;
	КонецЕсли;	
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("ISIN", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'ISIN' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаISIN		= ОбластьПоЗначению.Лево;
	КонецЕсли;
	
	ОбластьПоЗначению = ФайлДанных.НайтиТекст("Количество ЦБ, шт.", , , Истина, Ложь, Истина, Истина);
	Если ОбластьПоЗначению = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить столбец 'Количество' таблицы ценных бумаг: " + ПутьКФайлуОстатков);
		Возврат;
	Иначе
		КолонкаКоличество = ОбластьПоЗначению.Лево;
	КонецЕсли;
	
	// Читаем таблицу ЦБ	
	
	ВысотаТаблицы = ФайлДанных.ВысотаТаблицы;
	
	Пока НачалоТаблицыЦБ < ВысотаТаблицы Цикл		
		Категория	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаКатегория).Текст;
		РегНомер	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаРегНомер).Текст;
		ISIN		= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаISIN).Текст;
		Количество	= ФайлДанных.Область(НачалоТаблицыЦБ, КолонкаКоличество).Текст;
		
		Если ПустаяСтрока(Категория) Тогда
			Прервать;
		КонецЕсли;
		
		ДобавитьПустуюСтроку = Ложь;
		
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Security_Type			= Категория;
		СтрокаЦБ.Security_Reg_No		= ?(ПустаяСтрока(РегНомер), ISIN, РегНомер);
		СтрокаЦБ.Depo_Account_Number	= НомерДепозитарногоСчета;
		СтрокаЦБ.Количество				= Число(Количество);
		
		НачалоТаблицыЦБ = НачалоТаблицыЦБ + 1;	
	КонецЦикла;
	
	// Если на счету нет бумаг, фиксируем, что по нему была выписка	
	
	Если ДобавитьПустуюСтроку Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_ВТБ(ПутьКФайлуОстатков)
	
	ИмяКорневогоУзла		= Неопределено;
	НомерДепозитарногоСчета	= Неопределено;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		// Проверяем корневой узел
		
		Если ИмяКорневогоУзла = Неопределено Тогда
			ИмяКорневогоУзла = ИмяУзла;
			
			Если ИмяКорневогоУзла <> "EDO_ODKF750" Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Неверный заголовок файла: " + ПутьКФайлуОстатков);				
				Возврат;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Читаем остальные узлы
		
		Если ИмяУзла = "ReportOnDate" Тогда
			
			// Дата выписки
			
			ЧтениеXML.Прочитать();
			
			ДатаВыписки = ПолучитьДатуИзСтрокиДДММГГГГ(Лев(ЧтениеXML.Значение, 10));
			
			Если ДатаВыписки <> Объект.ДатаСверки Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
				Возврат;
			КонецЕсли;			
			
		ИначеЕсли ИмяУзла = "AccountCode" Тогда
			
			// Депозитарный счет	
			
			ДобавитьПустуюСтроку = Истина;
			
			ЧтениеXML.Прочитать();
			
			НомерДепозитарногоСчета = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "Details" И НомерДепозитарногоСчета <> Неопределено  Тогда
			
			// Фиксируем начало таблицы ЦБ	
			
			ДобавитьПустуюСтроку = Ложь;
			
			СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
			СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
			
		ИначеЕсли ИмяУзла = "CBName" И СтрокаЦБ <> Неопределено И НомерДепозитарногоСчета <> Неопределено Тогда
			
			// Категория ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Type = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "GRN" И СтрокаЦБ <> Неопределено Тогда
			
			// Рег. номер ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Reg_No = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "TotalQty" И СтрокаЦБ <> Неопределено Тогда
			
			// Количество ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Количество = ЧтениеXML.Значение;
			
		КонецЕсли;

	КонецЦикла;
	
	// Если на счету нет бумаг, фиксируем, что по нему была выписка	
	
	Если ДобавитьПустуюСтроку = Истина Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_ДК_Регион(ПутьКФайлуОстатков)
	
	ИмяКорневогоУзла		= Неопределено;
	НомерДепозитарногоСчета	= Неопределено;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	СекцияНомераДепо = Ложь;

	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		// Проверяем корневой узел
		
		Если ИмяКорневогоУзла = Неопределено Тогда
			ИмяКорневогоУзла = ИмяУзла;
			
			Если ИмяКорневогоУзла <> "DEPOACCOUNT_BALANCE_REPORT" Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Неверный заголовок файла: " + ПутьКФайлуОстатков);				
				Возврат;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Читаем остальные узлы
		
		Если ИмяУзла = "ReportDate" Тогда
			
			// Дата выписки
			
			ЧтениеXML.Прочитать();
			
			ДатаВыписки = ПолучитьДатуИзСтрокиГГГГ_ММ_ДД(ЧтениеXML.Значение);
			
			Если ДатаВыписки <> Объект.ДатаСверки Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
				Возврат;
			КонецЕсли;			
			
		ИначеЕсли ИмяУзла = "DepoAccount" И Не СекцияНомераДепо Тогда
			
			// Депозитарный счет
			СекцияНомераДепо = Истина;
			Продолжить;
			
		ИначеЕсли ИмяУзла = "DepoAccount" И СекцияНомераДепо Тогда	
			
			ДобавитьПустуюСтроку = Истина;
			
			ЧтениеXML.Прочитать();
					
			НомерДепозитарногоСчета = ЧтениеXML.Значение;
						
		ИначеЕсли ИмяУзла = "Position" И НомерДепозитарногоСчета <> Неопределено  Тогда
			
			// Фиксируем начало таблицы ЦБ	
			
			ДобавитьПустуюСтроку = Ложь;
			
			СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
			СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
			
		ИначеЕсли ИмяУзла = "TypeSecurity" И СтрокаЦБ <> Неопределено И НомерДепозитарногоСчета <> Неопределено Тогда
			
			// Категория ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Type = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "RegistrationNumber" И СтрокаЦБ <> Неопределено Тогда
			
			// Рег. номер ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Reg_No = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "QuantityTotal" И СтрокаЦБ <> Неопределено Тогда
			
			// Количество ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Количество = ЧтениеXML.Значение;
			
		КонецЕсли;

	КонецЦикла;
	
	// Если на счету нет бумаг, фиксируем, что по нему была выписка	
	
	Если ДобавитьПустуюСтроку = Истина Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_Инфинитум(ПутьКФайлуОстатков)
	
	ИмяКорневогоУзла		= Неопределено;
	НомерДепозитарногоСчета	= Неопределено;
	ЭтоСекцияРаздела = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла = ЧтениеXML.Имя;
		
		// Проверяем корневой узел
		
		Если ИмяКорневогоУзла = Неопределено Тогда
			ИмяКорневогоУзла = ИмяУзла;
			
			Если ИмяКорневогоУзла <> "STATEMENT_OF_ACCOUNT" Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Неверный заголовок файла: " + ПутьКФайлуОстатков);				
				Возврат;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Читаем остальные узлы
		
		Если ИмяУзла = "datetime" Тогда
			
			// Дата выписки
			
			ЧтениеXML.Прочитать();
			
			ДатаВыписки = ПолучитьДатуИзСтрокиГГГГ_ММ_ДД(Лев(ЧтениеXML.Значение, 10));
			
			Если ДатаВыписки <> Объект.ДатаСверки Тогда
				ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
				Возврат;
			КонецЕсли;			
			
		ИначеЕсли ИмяУзла = "id" И НомерДепозитарногоСчета = Неопределено Тогда
			
			// Депозитарный счет	
			
			ДобавитьПустуюСтроку = Истина;
			
			ЧтениеXML.Прочитать();
			
			НомерДепозитарногоСчета = ЧтениеXML.Значение;
							
		ИначеЕсли ИмяУзла = "security" И НомерДепозитарногоСчета <> Неопределено  Тогда
			
			// Фиксируем начало таблицы ЦБ	
			
			ДобавитьПустуюСтроку = Ложь;
			
			СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
			СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;
						
		ИначеЕсли ИмяУзла = "account_section_storage_id" Тогда	
			
			ЭтоСекцияРаздела = Истина;
			Продолжить;
			
		ИначеЕсли ИмяУзла = "id" И НомерДепозитарногоСчета <> Неопределено И ЭтоСекцияРаздела Тогда	
			
			// Номер раздела
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Depo_Account_Division_Number = ЧтениеXML.Значение;
			ЭтоСекцияРаздела = Ложь;
			
		ИначеЕсли ИмяУзла = "financial_instrument_type" И СтрокаЦБ <> Неопределено И НомерДепозитарногоСчета <> Неопределено Тогда
			
			// Категория ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Type = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "state_reg_num" И СтрокаЦБ <> Неопределено Тогда
			
			// Рег. номер ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Security_Reg_No = ЧтениеXML.Значение;
			
		ИначеЕсли ИмяУзла = "units" И СтрокаЦБ <> Неопределено Тогда
			
			// Количество ЦБ	
			
			ЧтениеXML.Прочитать();
			СтрокаЦБ.Количество = ЧтениеXML.Значение;
			
		КонецЕсли;

	КонецЦикла;
	
	// Если на счету нет бумаг, фиксируем, что по нему была выписка	
	
	Если ДобавитьПустуюСтроку = Истина Тогда
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Depo_Account_Number = НомерДепозитарногоСчета;		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПрочитатьОстаткиИзФайлов_ГПБ(ПутьКФайлуОстатков)
	
	Попытка
		ФайлДанных = Новый ТекстовыйДокумент;
		ФайлДанных.Прочитать(ПутьКФайлуОстатков);
	Исключение
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла: " + ПутьКФайлуОстатков);
		Возврат;
	КонецПопытки;
	             	
	СтрокаКлиента = ФайлДанных.ПолучитьСтроку(1);
	
	МассивПодстрок = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаКлиента, ";", Истина, Истина);
	Если МассивПодстрок.Количество() = 0 Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. В первой строке отсутствуют данные: " + ПутьКФайлуОстатков);
		Возврат;                                                                                                                              
	КонецЕсли;	
		
	ПозицияКодаКлиента = СтрНайти(МассивПодстрок[0], "ClientID:");
	
	Если ПозицияКодаКлиента = Неопределено Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеВажнойОшибки", "Ошибка формата файла. Не удалось определить клиента: " + ПутьКФайлуОстатков);
		Возврат;
	КонецЕсли;
	
	КодКлиента = Сред(МассивПодстрок[0], ПозицияКодаКлиента);
	       
	// Определяем дату выписки                               
	СтрокаДатыВыписки = ФайлДанных.ПолучитьСтроку(7);
	
	ДатаВыписки = РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Сред(СтрокаДатыВыписки, СтрДлина("ReportDate:") + 1, 10));
			
	Если ДатаВыписки <> Объект.ДатаСверки Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Дата выписки не соответствует дате сверки: " + ПутьКФайлуОстатков);
		Возврат;
	КонецЕсли;
	
	СтрокаЗаголовка		= ФайлДанных.ПолучитьСтроку(9);
	МассивКолонок		= РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЗаголовка, ";", Ложь, Истина); 
    КоличествоКолонок	= МассивКолонок.Количество();
		
	Для НомерСтроки = 10 По ФайлДанных.КоличествоСтрок() Цикл
		
		ДанныеСтроки = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФайлДанных.ПолучитьСтроку(НомерСтроки), ";");
		
		СтруктураДанныхОбОстаткахЦБ = Новый Структура();
		
		Для ИндексКолонки = 0 По КоличествоКолонок - 1 Цикл
			ИмяПоля = МассивКолонок[ИндексКолонки];
									
			Если ИмяПоля = "ISIN" Или ИмяПоля = "Счет" Тогда
				СтруктураДанныхОбОстаткахЦБ.Вставить(ИмяПоля, СокрЛП(ДанныеСтроки[ИндексКолонки]));
			ИначеЕсли ИмяПоля = "Тип/вид/категория" Тогда
				СтруктураДанныхОбОстаткахЦБ.Вставить("Категория", СокрЛП(ДанныеСтроки[ИндексКолонки]));
			ИначеЕсли ИмяПоля = "Количество" Тогда
				Попытка
					СтруктураДанныхОбОстаткахЦБ.Вставить(ИмяПоля, Число(СокрЛП(ДанныеСтроки[ИндексКолонки])));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
				
		СтрокаЦБ = Объект.ЦенныеБумаги.Добавить();
		СтрокаЦБ.Security_Type			= СтруктураДанныхОбОстаткахЦБ.Категория;
		СтрокаЦБ.Security_Reg_No		= СтруктураДанныхОбОстаткахЦБ.ISIN;
		СтрокаЦБ.Depo_Account_Number	= СтруктураДанныхОбОстаткахЦБ.Счет;
		СтрокаЦБ.Количество				= СтруктураДанныхОбОстаткахЦБ.Количество;
				
	КонецЦикла;
			 	
КонецПроцедуры

&НаКлиенте
Функция Контроль_ФорматаФайла(ПутьКФайлуОстатков, ДепозитарнаяКомпания, КодДепозитарнойКомпании)
	
	СтруктураПроверки = Новый Структура;
	
	Если КодДепозитарнойКомпании = "БК_Регион" Тогда
		
		СтруктураПроверки.Вставить("DEPO_ACC_STATEMENT");
		СтруктураПроверки.Вставить("Header", "q_date");
		
	ИначеЕсли КодДепозитарнойКомпании = "СДК_Гарант" Тогда
		
		СтруктураПроверки.Вставить("Report");
		СтруктураПроверки.Вставить("TablixHeader", "Header");
		
	ИначеЕсли КодДепозитарнойКомпании = "ВТБ_СпецДеп" Тогда
		
		СтруктураПроверки.Вставить("EDO_ODKF750");
		СтруктураПроверки.Вставить("ReportOnDate");
		СтруктураПроверки.Вставить("AccountCode");
		
	ИначеЕсли КодДепозитарнойКомпании = "ДК_Регион" Тогда
		
		СтруктураПроверки.Вставить("DEPOACCOUNT_BALANCE_REPORT");	
		
	ИначеЕсли КодДепозитарнойКомпании = "Инфинитум_СпецДеп" Тогда	
		
		СтруктураПроверки.Вставить("datetime");	
		
	ИначеЕсли (КодДепозитарнойКомпании = "РСД" Или КодДепозитарнойКомпании = "НСД")
		И НРег(Прав(ПутьКФайлуОстатков, 4)) = "xlsx"	
		
	Тогда
	
	ИначеЕсли КодДепозитарнойКомпании = "ГПБ"
		И НРег(Прав(ПутьКФайлуОстатков, 3)) = "csv"		
				
	Тогда
	
		Возврат Истина; // контроль формата XLSX и csv не выполняем
		
	Иначе
		
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Не описана схема загрузки: " + ПутьКФайлуОстатков);
		Возврат Ложь;
		
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуОстатков);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяУзла		= ЧтениеXML.Имя;
		ИмяАтрибута = "";
		Если СтруктураПроверки.Свойство(ИмяУзла, ИмяАтрибута) Тогда
			Если ЗначениеЗаполнено(ИмяАтрибута) Тогда
				Если ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута) <> Неопределено Тогда
					СтруктураПроверки.Удалить(ИмяУзла);
				КонецЕсли;
			Иначе
				СтруктураПроверки.Удалить(ИмяУзла);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	ПрошелПроверку =  СтруктураПроверки.Количество() = 0;
	
	Если НЕ ПрошелПроверку Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Обнаружен файл с неизвестным форматом: " + ПутьКФайлуОстатков);
	КонецЕсли;
	
	Возврат ПрошелПроверку;
	
КонецФункции

&НаКлиенте
Функция Контроль_КодаДепозитарнойКомпании(ДепозитарнаяКомпания, КодДепозитарнойКомпании)
	
	Если НЕ ЗначениеЗаполнено(КодДепозитарнойКомпании) Тогда
		 ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Не заполнен код во внешней системе!");
	КонецЕсли;
	 
	Возврат ЗначениеЗаполнено(КодДепозитарнойКомпании);
	
КонецФункции	

&НаКлиенте
Функция Контроль_СуществованияКаталога(ДепозитарнаяКомпания, КаталогДанных)
	
	Если Не ЗначениеЗаполнено(КаталогДанных) Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "В дополнительных сведениях организации не указан каталог выгрузки!");
		Возврат Ложь;
	КонецЕсли;
	
	Каталог = Новый Файл(КаталогДанных);
	КаталогСуществует = Каталог.Существует();
	
	Если НЕ КаталогСуществует Тогда
		ВывестиИнформациюНаКлиенте("ОписаниеОшибки", "Не найден каталог: '" + КаталогДанных + "'");
	КонецЕсли;
	
	Возврат КаталогСуществует;
	
КонецФункции	

&НаКлиенте
Функция НайтиФайлыВыписок(КаталогДанных, КодДепозитарнойКомпании)
	
	Если КодДепозитарнойКомпании = "РСД" Или КодДепозитарнойКомпании = "НСД" Тогда
		НайденныеФайлы = НайтиФайлы(КаталогДанных, "*.xlsx", Ложь);
	ИначеЕсли КодДепозитарнойКомпании = "ГПБ" Тогда
		НайденныеФайлы = НайтиФайлы(КаталогДанных, "*.csv", Ложь);
	Иначе
		НайденныеФайлы = НайтиФайлы(КаталогДанных, "*.xml", Ложь);
	КонецЕсли;
	
	Возврат НайденныеФайлы;	
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьДанныеИзФайлов(ДепозитарнаяКомпания, КодДепозитарнойКомпании)
	
	ДанныеЗагружены = Ложь;
	
	Если Контроль_КодаДепозитарнойКомпании(ДепозитарнаяКомпания, КодДепозитарнойКомпании) Тогда
		КаталогДанных = ПолучитьКаталогДанных(Объект.Организация, КодДепозитарнойКомпании, Объект.ДатаСверки, КаталогДанных);
		
		Если Контроль_СуществованияКаталога(ДепозитарнаяКомпания, КаталогДанных) Тогда
			ВывестиИнформациюНаКлиенте("КаталогДанных", КаталогДанных);
			
			НайденныеФайлы = НайтиФайлыВыписок(КаталогДанных, КодДепозитарнойКомпании);
			
			Для Каждого Файл Из НайденныеФайлы Цикл
				
				Если Контроль_ФорматаФайла(Файл.ПолноеИмя, ДепозитарнаяКомпания, КодДепозитарнойКомпании) Тогда
					
					Если КодДепозитарнойКомпании = "БК_Регион" Тогда
						
						ПрочитатьОстаткиИзФайлов_БК_Регион(Файл.ПолноеИмя);
						
					ИначеЕсли КодДепозитарнойКомпании = "СДК_Гарант" Тогда
						
						ПрочитатьОстаткиИзФайлов_СДК_Гарант(Файл.ПолноеИмя);
						
					ИначеЕсли КодДепозитарнойКомпании = "РСД" Тогда
						
						ПрочитатьОстаткиИзФайлов_РСД(Файл.ПолноеИмя);
						
					ИначеЕсли КодДепозитарнойКомпании = "НСД" Тогда
						
						ПрочитатьОстаткиИзФайлов_НСД(Файл.ПолноеИмя);						
						
					ИначеЕсли КодДепозитарнойКомпании = "ДК_Регион" Тогда
						
						ПрочитатьОстаткиИзФайлов_ДК_Регион(Файл.ПолноеИмя);
												
					ИначеЕсли КодДепозитарнойКомпании = "ВТБ_СпецДеп" Тогда
						
						ПрочитатьОстаткиИзФайлов_ВТБ(Файл.ПолноеИмя);
						
					ИначеЕсли КодДепозитарнойКомпании = "Инфинитум_СпецДеп" Тогда
						
						ПрочитатьОстаткиИзФайлов_Инфинитум(Файл.ПолноеИмя); 
						
					ИначеЕсли КодДепозитарнойКомпании = "ГПБ" Тогда
						
						ПрочитатьОстаткиИзФайлов_ГПБ(Файл.ПолноеИмя);	
						
					КонецЕсли;
					
					ДанныеЗагружены = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

&НаКлиенте
Процедура ВывестиИнформациюНаКлиенте(Ключ, Источник = "", ГруппировкаСтрок = 0)
	
	НоваяСтрока = ИнформацияДляВывода.Добавить();
	НоваяСтрока.Ключ				= Ключ;
	НоваяСтрока.Источник			= Источник;
	НоваяСтрока.ГруппировкаСтрок	= ГруппировкаСтрок;
	
КонецПроцедуры	

&НаСервере
Процедура ВывестиИнформацию(Ключ, Источник, ГруппировкаСтрок = 0, ВыводИзТаблицы = Ложь)
	
	Если НЕ ВыводИзТаблицы Тогда
		Для Каждого СтрокаИнформацииДляВывода Из ИнформацияДляВывода Цикл
			ВывестиИнформацию(СтрокаИнформацииДляВывода.Ключ, СтрокаИнформацииДляВывода.Источник, СтрокаИнформацииДляВывода.ГруппировкаСтрок, Истина)
		КонецЦикла;	
		ИнформацияДляВывода.Очистить();
	КонецЕсли;
	
	Макет	= РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть(Ключ);
	
	Если Ключ = "ОписаниеОшибки"
		ИЛИ Ключ = "ОписаниеВажнойОшибки"	
		ИЛИ Ключ = "Депозитарий"
		ИЛИ Ключ = "КаталогДанных"
	Тогда
		Область.Параметры.Параметр = Источник;
	ИначеЕсли Ключ = "Заголовок" Тогда
		Результат.Очистить();
	ИначеЕсли Ключ <> "ПустаяСтрока" И Ключ <> "РасхожденияПодвал" Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, Источник);
	КонецЕсли;
	
	Результат.Вывести(Область);		
	
	Если Ключ = "Расхождения" Тогда
		ВыборкаЦенныеБумаги = Источник.Выбрать();
		Пока ВыборкаЦенныеБумаги.Следующий() Цикл
			Если ВыборкаЦенныеБумаги.ИмяОбласти <> "1_РасхожденийНет" Тогда
				ВывестиИнформацию("Строка", ВыборкаЦенныеБумаги)
			КонецЕсли;
		КонецЦикла;
		ВывестиИнформацию("РасхожденияПодвал", "");
	КонецЕсли;
	
	Если ГруппировкаСтрок = 1 Тогда
		Результат.НачатьГруппуСтрок();
	ИначеЕсли ГруппировкаСтрок = 2 Тогда
		Результат.ЗакончитьГруппуСтрок();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасхожденияПоДепозитарнымСчетамКлиентов(ДепозитарныеСчетаКлиентов, ДепозитарныйСчет, ДанныеОтчетаОСверке)
	
	// СТРОКА или НЕОПРЕДЕЛЕНО
	Если Не (ТипЗнч(ДепозитарныйСчет) = Тип("СправочникСсылка.ДепозитарныеСчета") И ЗначениеЗаполнено(ДепозитарныйСчет)) Тогда
		Возврат;
	КонецЕсли;
	
	КлиентыСДепозитарнымСчетом = ДепозитарныеСчетаКлиентов.НайтиСтроки(Новый Структура("ДепозитарныйСчет", ДанныеОтчетаОСверке.ДепозитарныйСчет));
	
	Для Каждого ДанныеКлиента Из КлиентыСДепозитарнымСчетом Цикл
		
		ДанныеКлиента.СверкаВыполнена = Истина;
		
		Если ДанныеОтчетаОСверке.ИмяОбласти <> "РасхожденийНет" Тогда
			
			ПредставлениеРасхождений = "";
			
			Если ДанныеОтчетаОСверке.ИмяОбласти = "РасхожденийНетСвереноВручную" Тогда
				
				ПредставлениеРасхождений = "сверен вручную";
				
			Иначе	
				
				ДанныеКлиента.ЕстьРасхождения = Истина;
				
				Если ДанныеОтчетаОСверке.ИмяОбласти = "НетСчетаВВыгрузке" Тогда
					ПредставлениеРасхождений = "не обнаружен в выгрузке депозитария";
				ИначеЕсли ДанныеОтчетаОСверке.ИмяОбласти = "Расхождения" Тогда
					ПредставлениеРасхождений = "расхождения по остаткам ";		
					
					ВыборкаЦенныеБумаги = ДанныеОтчетаОСверке.Выбрать();
					Пока ВыборкаЦенныеБумаги.Следующий() Цикл
						Если ВыборкаЦенныеБумаги.ИмяОбласти <> "1_РасхожденийНет" Тогда
							ПредставлениеРасхождений = ПредставлениеРасхождений + Строка(ВыборкаЦенныеБумаги.ЦеннаяБумага);
							
							Если ВыборкаЦенныеБумаги.Следующий() Тогда
								ПредставлениеРасхождений = ПредставлениеРасхождений + " и др."		
							КонецЕсли;
							
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					ПредставлениеРасхождений = ДанныеОтчетаОСверке.ИмяОбласти;
				КонецЕсли;
				
			КонецЕсли;
			
			ДанныеКлиента.Примечание = Строка(ДанныеОтчетаОСверке.ДепозитарныйСчет) + ": " + ПредставлениеРасхождений;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьРезультатыСверки(ДепозитарныеСчетаКлиентов, ДепозитарнаяКомпания, НетСчетаВ1С)
	
	// Считаем клиента сверенным по депозитарию,
	// если все его депозитарные счета сверены и ни по одному из них нет расхождений.
	// Но если в отчете депозитария есть депозитарные счета не найденные в 1С,
	// сверка не будет пройдена ни по кому.
		
	ПараметрыОтчетаОПодтвержденныхОперациях = Неопределено;
	
	Если ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений И ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях Тогда 
		
		ПараметрыОтчетаОПодтвержденныхОперациях = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(ДепозитарнаяКомпания, , , ЭтаФорма.ОтчетОПодтвержденныхОперациях);
		
		ЭтаФорма.ОтчетОПодтвержденныхОперациях.НачатьГруппуСтрок();
		
	КонецЕсли;	
	
	ДепозитарныеСчетаКлиентов.Сортировать("СчетДоверительногоУправления, ЕстьРасхождения УБЫВ", Новый СравнениеЗначений);
	
	Клиенты = ДепозитарныеСчетаКлиентов.Скопировать(Неопределено, "СчетДоверительногоУправления");
	Клиенты.Свернуть("СчетДоверительногоУправления");

	Для Каждого Клиент Из Клиенты Цикл
		
		СверкаПройденаУспешно	= Истина;
		Примечание				= "";
		
		Если НетСчетаВ1С Тогда
			СверкаПройденаУспешно	= Ложь;
			Примечание				= "Ошибка сверки: не все депозитарные счета из отчета депозитария найдены в 1С";
		Иначе
			ДепозитарныеСчетаКлиента = ДепозитарныеСчетаКлиентов.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", Клиент.СчетДоверительногоУправления));
			Для Каждого ДанныеКлиента Из ДепозитарныеСчетаКлиента Цикл
				Если ДанныеКлиента.ЕстьРасхождения Тогда 
					СверкаПройденаУспешно = Ложь;
				КонецЕсли;
				Если ЗначениеЗаполнено(ДанныеКлиента.Примечание) Тогда
					Примечание = ?(ПустаяСтрока(Примечание), "", Примечание + "; ") + ДанныеКлиента.Примечание;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ОснованиеСверки = ОтчетыДепозитарныхКомпаний.Получить(ДепозитарнаяКомпания);
		Если ОснованиеСверки = Неопределено Тогда
			ОснованиеСверки = ДепозитарнаяКомпания;
		КонецЕсли;
		
		// Результат сверки
		
		Если ЭтаФорма.ФиксироватьРезультатСверки Тогда
			РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ЗафиксироватьРезультатСверки(
				Объект.Организация,
				Клиент.СчетДоверительногоУправления,
				Объект.ДатаСверки,
				ОснованиеСверки,
				СверкаПройденаУспешно,
				Ложь,
				ЭтаФорма.ВремяСверки,
				Примечание
			);
		КонецЕсли;
		
		// Подтверждение операций депозитария
		
		Если СверкаПройденаУспешно И ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений Тогда
			ПодтвердитьОперацииСДепозитарием(
				Объект.Организация,
				Клиент.СчетДоверительногоУправления,
				ДепозитарнаяКомпания,
				Объект.ДатаСверки,
				ПараметрыОтчетаОПодтвержденныхОперациях
			);		
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ЭтаФорма.ПодтвердитьОперацииСДепозитариямиПриОтсутствииРасхождений И ЭтаФорма.ВыводитьОтчетОПодтвержденныхОперациях Тогда 
		ЭтаФорма.ОтчетОПодтвержденныхОперациях.ЗакончитьГруппуСтрок();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодтвердитьОперацииСДепозитарием(Организация, СчетДоверительногоУправления, ДепозитарнаяКомпания, ДатаОпераций, ПараметрыОтчета = Неопределено)
	
	ПодтвержденныеОперации = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПодтвердитьОперацииСДепозитарием(Организация, СчетДоверительногоУправления, ДепозитарнаяКомпания, ДатаОпераций, КонецДня(ДатаОпераций));  	
	
	Если ПараметрыОтчета = Неопределено ИЛИ ПодтвержденныеОперации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТаблицы = Новый Структура("ПредставлениеОперации, ДатаПодтверждения, Примечание", "Операция", "Время подтверждения", "Примечание");
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(
			"Отчет о подтвержденных операциях",,, ПараметрыОтчета.ДокументРезультат);
			
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(
		ПараметрыВывода,
		ПодтвержденныеОперации,
		СтруктураТаблицы,
		Строка(СчетДоверительногоУправления),
		Ложь,
		Истина
	);
	
	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьКДатеРабочиеДни(Дата, РабочиеДни)
	
	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Дата, РабочиеДни);
	
КонецФункции

&НаСервере
Процедура ДобавитьВСверенныеВручную(ДепозитарныеСчета)
	
	МассивСчетов = Новый Массив;
	
	РаботаСКоллекциями.ДополнитьМассив(МассивСчетов, ДепозитарныеСчета, Истина);
	
	Для каждого ДепозитарныйСчет Из МассивСчетов Цикл
		Если СверенныеВручнуюДепозитарныеСчета.НайтиСтроки(Новый Структура("ДепозитарныйСчет", ДепозитарныйСчет)).Количество() = 0 Тогда 	
			СверенныеВручнуюДепозитарныеСчета.Добавить().ДепозитарныйСчет = ДепозитарныйСчет;	
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	ПолноеИмяОтчета = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	СессияСбораСтатистики   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "ДатаСверки,Организация,Депозитарий";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Объект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

#КонецОбласти