
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.ЦеннаяБумага);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать  = Истина;
	Движения.ОстаткиЦенныхБумагЗаблокированные.Записывать = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать          = Истина;

	// остатки ц/б заблокированные
	Если ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение
		Или ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.Оферта
	Тогда
		// После даты фиксации бумага, у которой прошло полное погашение, не покупается и не продается =>
		// количество бумаг на дату фиксации должно соотв. количеству бумаг, за которые получаем деньги
		// при погашении
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ПериодДата КАК Период,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение) КАК ВидБлокировкиАктива,
			|	ОстаткиЦенныхБумагОстатки.Организация КАК Организация,
			|	ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОстаткиЦенныхБумагОстатки.ДепозитарныйСчет КАК ДепозитарныйСчет,
			|	ОстаткиЦенныхБумагОстатки.Рынок КАК Рынок,
			|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА &КоличествоИзДокумента < ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток, 0)
			|			ТОГДА &КоличествоИзДокумента
			|		ИНАЧЕ ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиЦенныхБумагЗаблокированныеОстатки.КоличествоОстаток, 0)
			|	КОНЕЦ КАК Количество
			|ИЗ
			|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумагЗаблокированные.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ЦеннаяБумага = &ЦеннаяБумага) КАК ОстаткиЦенныхБумагЗаблокированныеОстатки
			|		ПО ОстаткиЦенныхБумагОстатки.Организация = ОстаткиЦенныхБумагЗаблокированныеОстатки.Организация
			|			И ОстаткиЦенныхБумагОстатки.СчетДоверительногоУправления = ОстаткиЦенныхБумагЗаблокированныеОстатки.СчетДоверительногоУправления
			|			И ОстаткиЦенныхБумагОстатки.ЦеннаяБумага = ОстаткиЦенныхБумагЗаблокированныеОстатки.ЦеннаяБумага";
		
		Запрос.УстановитьПараметр("Период",                       Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ПериодДата",                   ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ЦеннаяБумага",                 ЭтотОбъект.ЦеннаяБумага);
		Запрос.УстановитьПараметр("КоличествоИзДокумента",        ЭтотОбъект.Количество);
				
		Выборка = Запрос.Выполнить().Выбрать();		
		
		ДоступноеКоличество = 0;
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Движения.ОстаткиЦенныхБумагЗаблокированные.ДобавитьПриход(), Выборка);
			ДоступноеКоличество = ДоступноеКоличество + Выборка.Количество;
		КонецЦикла;

		Если ДоступноеКоличество <> ЭтотОбъект.Количество Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество ценных бумаг в документе, " + ЭтотОбъект.Количество + ", не соответствует доступному количеству " + ДоступноеКоличество + ".", ЭтотОбъект, "Количество",, Отказ);
		КонецЕсли;
			
	КонецЕсли; 
	
	// задолженности по д/с
	Если      ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		ВидЗадолженности = ?((ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение
				Или ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.Оферта),
			Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации,
			Справочники.ВидыЗадолженности.ПоПогашениюОблигации);
			
		Контрагент = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
			
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюПая;
		УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ЭтотОбъект.Дата, ЭтотОбъект.ЦеннаяБумага); 
		Контрагент       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюВекселя;
		Контрагент       = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
		
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия;
		Контрагент       = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
		
	КонецЕсли;		
	
	Если ЭтотОбъект.Сумма > 0 Тогда
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.ВидЗадолженности             = ВидЗадолженности;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = Контрагент;
		Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
		Движение.Сумма                        = ЭтотОбъект.Сумма;
	КонецЕсли;
	
	Если ЭтотОбъект.СуммаКупона > 0 Тогда
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
		Движение.ВидЗадолженности             = ?((ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение 
													или ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.Оферта),
													Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона, Справочники.ВидыЗадолженности.ПоПогашениюКупона);
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Контрагент                   = Контрагент;
		Движение.Валюта                       = ЭтотОбъект.ВалютаОплаты;
		Движение.СуммаКупона                  = ЭтотОбъект.СуммаКупона;
	КонецЕсли;
		
	// операции с ц/б
	Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
	
	Движение.Операция                     = ЭтотОбъект.Ссылка;
	Движение.ВидДвижения                  = Перечисления.ВидыДвижений.Расход;
	Движение.Организация                  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.Рынок                        = ЭтотОбъект.Рынок;
	Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
	Движение.Количество                   = ЭтотОбъект.Количество;
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	Движение.СуммаКупона                  = ЭтотОбъект.СуммаКупона;
	Движение.ДатаОперации                 = ЭтотОбъект.Дата;
	Движение.Валюта						  = ЭтотОбъект.ВалютаОплаты;	
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура СформироватьПроводкуСписанияТелаЕПС(ОбъектДокумента, УчетныйРегистр, ПараметрыПроводки)

	Если ПараметрыПроводки.Сумма = 0 И ПараметрыПроводки.СуммаВВалютеУчета = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ОбъектДокумента, ОбъектДокумента.Движения[УчетныйРегистр], ПараметрыПроводки.СуммаВВалютеУчета, ПараметрыПроводки.Содержание);
	
	// дебет
	Если ПараметрыПроводки.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
		
		Проводка.СчетДт = ПараметрыПроводки.УчетныйАктив.СчетУчетаКупона;
		
		Проводка.СубконтоДт.ЦенныеБумаги = ПараметрыПроводки.Облигация;
		
		Проводка.ВалютаДт = ПараметрыПроводки.ВалютаОплаты;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаОплаты;
		
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
		
	Иначе
		
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
		
		Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыПроводки.Ссылка;
		
		Проводка.ВалютаДт  = ПараметрыПроводки.ВалютаОплаты;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаОплаты;
					
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
	КонецЕсли;
	
	// кредит
	Проводка.СчетКт = ПараметрыПроводки.УчетныйАктив.СчетУчетаКупона;
	
	Проводка.СубконтоКт.ЦенныеБумаги = ПараметрыПроводки.Облигация;
	
	Проводка.ВалютаКт = ПараметрыПроводки.ВалютаНоминала;
	Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.Сумма;
	
	Проводка.ДополнительнаяАналитикаКт = ПараметрыПроводки.Аналитика;

	Проводка.Партия = ПараметрыПроводки.Партия;
	Проводка.СтрокаПартии = ПараметрыПроводки.СтрокаПартии;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПСЧастичноеПогашениеСПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ)

	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Погашение.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Погашение.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	Погашение.Партия КАК Партия,
		|	Погашение.СтрокаПартии КАК СтрокаПартии,
		|	Погашение.Стоимость КАК СтоимостьПартииРасход,
		|	Погашение.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчетаПартииРасход,
		|	Погашение.ДисконтПремияНачисленный КАК ДисконтПремияНачисленныйПартииРасход,
		|	Погашение.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчетаПартииРасход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупона, 0) КАК ПереоценкаКупонаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленный, 0) КАК ДисконтПремияНачисленныйПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСП, 0) КАК КорректировкаЭСППартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСПВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход,
		|	ЕСТЬNULL(ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьВВалютеУчета, 0) КАК СтоимостьПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьКупонаВВалютеУчета, 0) КАК СтоимостьКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаВВалютеУчета, 0) КАК ПереоценкаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСППерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка,
		|	Остатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	Остатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	Остатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Остатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	Остатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	Остатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК Погашение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК ПереоценкаНачисление
		|		ПО Погашение.Регистратор = ПереоценкаНачисление.Регистратор
		|			И Погашение.ВидУчета = ПереоценкаНачисление.ВидУчета
		|			И Погашение.ЦеннаяБумага = ПереоценкаНачисление.ЦеннаяБумага
		|			И Погашение.Партия = ПереоценкаНачисление.Партия
		|			И Погашение.СтрокаПартии = ПереоценкаНачисление.СтрокаПартии
		|			И (ПереоценкаНачисление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (ПереоценкаНачисление.ПереоценкаКупона <> 0
		|				ИЛИ ПереоценкаНачисление.ДисконтПремияНачисленный <> 0
		|				ИЛИ ПереоценкаНачисление.КорректировкаЭСП <> 0
		|				ИЛИ ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК Перекурсовка
		|		ПО Погашение.Регистратор = Перекурсовка.Регистратор
		|			И Погашение.ВидУчета = Перекурсовка.ВидУчета
		|			И Погашение.ЦеннаяБумага = Перекурсовка.ЦеннаяБумага
		|			И Погашение.Партия = Перекурсовка.Партия
		|			И Погашение.СтрокаПартии = Перекурсовка.СтрокаПартии
		|			И (Перекурсовка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (Перекурсовка.ПереоценкаКупона = 0)
		|			И (Перекурсовка.ДисконтПремияНачисленный = 0)
		|			И (Перекурсовка.КорректировкаЭСП = 0)
		|			И (Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК Остатки
		|		ПО Погашение.Партия = Остатки.Партия
		|			И Погашение.СтрокаПартии = Остатки.СтрокаПартии
		|ГДЕ
		|	Погашение.Регистратор = &Ссылка
		|	И Погашение.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И Погашение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	
	
	ПараметрыНачисления = Новый Структура;
	
	ПараметрыНачисления.Вставить("НастройкиУчета",	НастройкиУчета);
	
	ПараметрыНачисления.Вставить("ЦеннаяБумага",	ЭтотОбъект.ЦеннаяБумага);
	ПараметрыНачисления.Вставить("ВалютаНоминала",	ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	
	ПараметрыСписания = Новый Структура;
	ПараметрыСписания.Вставить("Облигация",			ЭтотОбъект.ЦеннаяБумага);
	ПараметрыСписания.Вставить("Контрагент",		ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо);
	ПараметрыСписания.Вставить("Ссылка",			ЭтотОбъект.Ссылка);
	ПараметрыСписания.Вставить("ВалютаОплаты",		ЭтотОбъект.ВалютаОплаты);
	ПараметрыСписания.Вставить("ВалютаНоминала",	ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	ПараметрыСписания.Вставить("ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов",	НастройкиУчета.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// 3 Спишем Тело и Дисконт
		ПараметрыСписания.Вставить("УчетныйАктив",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
		ПараметрыСписания.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыСписания.Вставить("СтрокаПартии",		ВыборкаДетальныеЗаписи.СтрокаПартии);
		// УНКД
		ПараметрыСписания.Вставить("Аналитика",			АналитикаТела);
		ПараметрыСписания.Вставить("Содержание",		"Погашение облигации (тело)");
		ПараметрыСписания.Вставить("Сумма",				ВыборкаДетальныеЗаписи.СтоимостьПартииРасход);
		ПараметрыСписания.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчетаПартииРасход);
		ПараметрыСписания.Вставить("СуммаОплаты",		ВыборкаДетальныеЗаписи.СтоимостьПартииРасход);
		
		СформироватьПроводкуСписанияТелаЕПС(ЭтотОбъект, УчетныйРегистр, ПараметрыСписания);
		
		// ННКД
		ПараметрыСписания.Вставить("Аналитика",			АналитикаДисконта);
		ПараметрыСписания.Вставить("Содержание",		"Погашение облигации (дисконт)");
		ПараметрыСписания.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииРасход);
		ПараметрыСписания.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииРасход);
		ПараметрыСписания.Вставить("СуммаОплаты",		ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииРасход);
		
		СформироватьПроводкуСписанияТелаЕПС(ЭтотОбъект, УчетныйРегистр, ПараметрыСписания);
		
		
		// 1 Начислим %ные доходы
		ПараметрыНачисления.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыНачисления.Вставить("СтрокаПартии",	ВыборкаДетальныеЗаписи.СтрокаПартии);
		ПараметрыНачисления.Вставить("Количество",		0);
		ПараметрыНачисления.Вставить("ПроверитьПарные",	"");
		
		// дисконт-премия	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Списание премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаСписанияПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Начисление дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы01);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаПроцентныхДоходов);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Переоценка купона");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы01);
		ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаПроцентныхДоходов);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// корректировка ЭСП
		БалансоваяКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСПОстаток;
		БалансоваяКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток;
		
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток);
		ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяКорректировкаЭСП);
		ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяКорректировкаЭСПВВалютеУчета);
		
		ПараметрыНачисления.Вставить("Содержание",			"КорректировкаЭСП");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		ПараметрыНачисления.Вставить("ПроверитьПарные",		"КорректировкаЭСП");
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток + ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		ПараметрыНачисления.Удалить("ПроверитьПарныеДоходыРасходы");
		
		// разница п/п
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("Содержание",			"Разница первоначального признания");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияСНачалаГодаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовПервоначальногоПризнания);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовПервоначальногоПризнания);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		
		// 2 Начислим курсовую разницу
		СчетДоходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
		ГФУДоходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		СчетРасходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
		ГФУРасходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетРасходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		
		ПараметрыНачисления.Вставить("Сумма",				0);
		
		// тело
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница стоимость");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаТела);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// УНКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон приобретенный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонПриобретенный);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// переоценка
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
		КонецЕсли;
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница переоценка");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаПереоценкиТела);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон начисленный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// дисконт-премия
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// корректировка ЭСП
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		КонецЕсли;
		
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница корректировка ЭСП");
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// разница п/п
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница п/п");
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
	КонецЦикла;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПСЧастичноеПогашение(УчетныйРегистр, Отказ)

	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаДебиторкиПоТелу = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюТела;
	
	Облигация = ЭтотОбъект.ЦеннаяБумага;
	ВалютаНоминала = Облигация.ВалютаНоминала;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
	
	Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
	
		ПроведениеПоРегиструЕПСЧастичноеПогашениеСПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ);
		Возврат;
	
	КонецЕсли;
	
	// читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|		И БухПартииЦенныхБумаг.КорректировкаЭСП = 0
		|		И БухПартииЦенныхБумаг.ДисконтПремияНачисленный = 0
		|		И БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0 КАК Перекурсовка,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток < 0 КАК Дисконт
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДоДокумента,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И ВидУчета = &ВидУчета
		|				И (ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии) В
		|					(ВЫБРАТЬ
		|						_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|						_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|						_ДвиженияПартий.Партия КАК Партия,
		|						_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии
		|					ИЗ
		|						_ДвиженияПартий КАК _ДвиженияПартий)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.Дисконт КАК Дисконт,
		|	_ДвиженияПартий.Перекурсовка КАК Перекурсовка,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленный) КАК ДисконтПремияНачисленный,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(_ДвиженияПартий.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(_ДвиженияПартий.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчета) КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(_ОстаткиПартий.ПереоценкаОстаток) КАК ПереоценкаОстаток,
		|	СУММА(_ОстаткиПартий.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленныйОстаток,
		|	СУММА(_ОстаткиПартий.КорректировкаЭСПОстаток) КАК КорректировкаЭСПОстаток,
		|	СУММА(_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
		|		ПО _ДвиженияПартий.УчетныйАктивЕПС = _ОстаткиПартий.УчетныйАктивЕПС
		|			И _ДвиженияПартий.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага
		|			И _ДвиженияПартий.Партия = _ОстаткиПартий.Партия
		|			И _ДвиженияПартий.СтрокаПартии = _ОстаткиПартий.СтрокаПартии
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДвиженияПартий.УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага,
		|	_ОстаткиПартий.Дисконт,
		|	_ДвиженияПартий.Перекурсовка";

	Запрос.УстановитьПараметр("ВидУчета",						Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Регистратор",					ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДоДокумента",    Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",    ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",    ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	БухПартииЦенныхБумаг = РезультатЗапроса.Выгрузить();
	
	МассивУчетныхАктивов = Новый Массив;
	
	Для Каждого СтрокаПартии Из БухПартииЦенныхБумаг Цикл
		УчетныйАктив = СтрокаПартии.УчетныйАктивЕПС;
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктив) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктив);
		КонецЕсли;
		
		Если  СтрокаПартии.Перекурсовка Тогда
			
			ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
				+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
				+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, "
				+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
				СтрокаПартии.ЦеннаяБумага, УчетныйАктив,
				СтрокаПартии.СтоимостьВВалютеУчета, СтрокаПартии.СтоимостьКупонаВВалютеУчета, СтрокаПартии.ПереоценкаВВалютеУчета, СтрокаПартии.ПереоценкаКупонаВВалютеУчета,
				СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПартии.КорректировкаЭСПВВалютеУчета, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
				СтрокаПартии.ДисконтПремияНачисленныйОстаток,СтрокаПартии.ПереоценкаОстаток,СтрокаПартии.КорректировкаЭСПОстаток,СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток);
				
			БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);	
			
		Иначе
			
			// Дооцениваем купон
			Если СтрокаПартии.ПереоценкаКупона<>0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Аналитика",
					СтрокаПартии.ПереоценкаКупона, СтрокаПартии.ПереоценкаКупонаВВалютеУчета, ВалютаУчета, УчетныйАктив, Облигация, ВалютаНоминала, АналитикаКупонНачисленный);
				БухгалтерскийУчетЕПС.НачислитьНКД(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			//дооценки перед расходом купона, дисконта и т.п.
			Если СтрокаПартии.ДисконтПремияНачисленный<>0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала",
					СтрокаПартии.ДисконтПремияНачисленный, СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, ВалютаУчета, УчетныйАктив, Облигация, ВалютаНоминала);
				ПараметрыНачисления.Вставить("Аналитика", ?(СтрокаПартии.ДисконтПремияНачисленный<0, АналитикаПремии, АналитикаДисконта));
				БухгалтерскийУчетЕПС.НачислитьДисконтПремию(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			
			Если СтрокаПартии.КорректировкаЭСП<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"КорректировкаЭСП", СтрокаПартии.КорректировкаЭСП, СтрокаПартии.КорректировкаЭСПвВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, Облигация, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);

			КонецЕсли;
			
			Если СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"РазницаПервоначальногоПризнания", СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, Облигация, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Ложь, Истина, Облигация, Отказ);
	
	СуммаНаОднуОблигацию = ЭтотОбъект.Сумма / ЭтотОбъект.Количество;
	
	// читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.ДисконтПремияНачисленный) КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета) КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
		|ПОМЕСТИТЬ ДвиженияСписанияПоВидуАктивов
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумагОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстаткиКоличествоПоВидуАктивов
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДвиженияСписанияПоВидуАктивов.Стоимость КАК Стоимость,
		|	ДвиженияСписанияПоВидуАктивов.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	ДвиженияСписанияПоВидуАктивов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ОстаткиКоличествоПоВидуАктивов.КоличествоОстаток КАК КоличествоОстаток,
		|	ДвиженияСписанияПоВидуАктивов.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	ДвиженияСписанияПоВидуАктивов.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	ДвиженияСписанияПоВидуАктивов.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	ДвиженияСписанияПоВидуАктивов.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета
		|ИЗ
		|	ДвиженияСписанияПоВидуАктивов КАК ДвиженияСписанияПоВидуАктивов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиКоличествоПоВидуАктивов КАК ОстаткиКоличествоПоВидуАктивов
		|		ПО ДвиженияСписанияПоВидуАктивов.УчетныйАктивЕПС = ОстаткиКоличествоПоВидуАктивов.УчетныйАктивЕПС";

	Запрос.УстановитьПараметр("ВидУчета",						Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",							Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор",					ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ЦеннаяБумага",					Облигация);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ЭтотОбъект.Ссылка,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Стоимость				= Выборка.Стоимость;
		СтоимостьВВалютеУчета	= Выборка.СтоимостьвВалютеУчета;
		Дисконт					= Выборка.ДисконтПремияНачисленный;
		ДисконтВВалютеУчета		= Выборка.ДисконтПремияНачисленныйВВалютеУчета;
		
		ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
		
		УчетныйАктив	= Выборка.УчетныйАктивЕПС;
		
		// ***** СТОИМОСТЬ *****			
		Если Стоимость > 0 Тогда 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СтоимостьВВалютеУчета, "Погашение облигации");
			
			// дебет
			Если НастройкиУчета.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
				
				Проводка.СчетДт = УчетныйАктив.СчетУчета;
				
				Проводка.СубконтоДт.ЦенныеБумаги = Облигация;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = Стоимость;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоТелу;

			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Проводка.ВалютаДт  = Облигация.ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = Стоимость;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоТелу;
				
			КонецЕсли;
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчета;
			
			Проводка.СубконтоКт.ЦенныеБумаги = Облигация;
			
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = Стоимость;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаТела;
		
		КонецЕсли;
		
		// ***** ПРЕМИЯ *****
		Если Дисконт > 0 Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ДисконтВВалютеУчета, "Погашение облигации");
			
			// дебет
			Если НастройкиУчета.ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
				
				Проводка.СчетДт = УчетныйАктив.СчетУчета;
				
				Проводка.СубконтоДт.ЦенныеБумаги = Облигация;
				
				Проводка.ВалютаДт = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = Дисконт;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоТелу;

			Иначе	
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Проводка.ВалютаДт  = Облигация.ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = Дисконт;
							
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоТелу;
				
			КонецЕсли;

			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчета;
			
			Проводка.СубконтоКт.ЦенныеБумаги = Облигация;
			
			Проводка.ВалютаКт = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = Дисконт;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаДисконта;
		
		КонецЕсли;
		
		Если Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные<>0 Тогда
			ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
				"РазницаПервоначальногоПризнания", -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные, -Выборка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныевВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, Облигация, ВалютаНоминала, Ссылка);
			БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
		КонецЕсли;
		
	КонецЦикла;

	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПСПогашениеСПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ)

	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;
	
	// проверяем было ли списание с счета ДЕПО и оплата долга за погашение
	НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности =  БухгалтерскийУчетЕПС.НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности(ЭтотОбъект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереоценкаНачисление.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПереоценкаНачисление.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ПереоценкаНачисление.УчетныйАктивЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценкиА,
		|	ПереоценкаНачисление.УчетныйАктивЕПС.СчетУчетаПереоценкиП КАК СчетУчетаПереоценкиП,
		|	ПереоценкаНачисление.УчетныйАктивЕПС.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки,
		|	ПереоценкаНачисление.УчетныйАктивЕПС.АналитикаРасходовОтПереоценки КАК АналитикаРасходовОтПереоценки,
		|	ПереоценкаНачисление.Партия КАК Партия,
		|	ПереоценкаНачисление.СтрокаПартии КАК СтрокаПартии,
		|	ПереоценкаНачисление.Переоценка КАК Переоценка,
		|	ПереоценкаНачисление.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	ПереоценкаНачисление.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода,
		|	ПереоценкаНачисление.ПереоценкаКупона КАК ПереоценкаКупонаПартииПриход,
		|	ПереоценкаНачисление.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчетаПартииПриход,
		|	ПереоценкаНачисление.ДисконтПремияНачисленный КАК ДисконтПремияНачисленныйПартииПриход,
		|	ПереоценкаНачисление.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчетаПартииПриход,
		|	ПереоценкаНачисление.КорректировкаЭСП КАК КорректировкаЭСППартииПриход,
		|	ПереоценкаНачисление.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчетаПартииПриход,
		|	ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход,
		|	ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьВВалютеУчета, 0) КАК СтоимостьПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.СтоимостьКупонаВВалютеУчета, 0) КАК СтоимостьКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаВВалютеУчета, 0) КАК ПереоценкаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ПереоценкаКупонаВВалютеУчета, 0) КАК ПереоценкаКупонаПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.ДисконтПремияНачисленныйВВалютеУчета, 0) КАК ДисконтПремияНачисленныйПерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.КорректировкаЭСПВВалютеУчета, 0) КАК КорректировкаЭСППерекурсовка,
		|	ЕСТЬNULL(Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, 0) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка,
		|	Остатки.ДисконтПремияПокупкиОстаток КАК ДисконтПремияПокупки,
		|	Остатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	Остатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчетаОстаток,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Остатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	Остатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГодаОстаток,
		|	Остатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	Остатки.ПереоценкаВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчетаОстаток,
		|	Остатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток,
		|	Остатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	Остатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	Остатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
		|	Остатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК ПереоценкаНачисление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК Перекурсовка
		|		ПО ПереоценкаНачисление.Регистратор = Перекурсовка.Регистратор
		|			И ПереоценкаНачисление.ВидУчета = Перекурсовка.ВидУчета
		|			И ПереоценкаНачисление.ЦеннаяБумага = Перекурсовка.ЦеннаяБумага
		|			И ПереоценкаНачисление.Партия = Перекурсовка.Партия
		|			И ПереоценкаНачисление.СтрокаПартии = Перекурсовка.СтрокаПартии
		|			И (Перекурсовка.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И (Перекурсовка.ПереоценкаКупона = 0)
		|			И (Перекурсовка.ДисконтПремияНачисленный = 0)
		|			И (Перекурсовка.КорректировкаЭСП = 0)
		|			И (Перекурсовка.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|					И Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК Остатки
		|		ПО ПереоценкаНачисление.Партия = Остатки.Партия
		|			И ПереоценкаНачисление.СтрокаПартии = Остатки.СтрокаПартии
		|ГДЕ
		|	ПереоценкаНачисление.Регистратор = &Ссылка
		|	И ПереоценкаНачисление.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ПереоценкаНачисление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (ПереоценкаНачисление.ПереоценкаКупона <> 0
		|			ИЛИ ПереоценкаНачисление.ДисконтПремияНачисленный <> 0
		|			ИЛИ ПереоценкаНачисление.КорректировкаЭСП <> 0
		|			ИЛИ ПереоценкаНачисление.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные <> 0)";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.ЦеннаяБумага);
	
	ПараметрыНачисления = Новый Структура;
	
	ПараметрыНачисления.Вставить("НастройкиУчета",	НастройкиУчета);
	
	ПараметрыНачисления.Вставить("ЦеннаяБумага",	ЭтотОбъект.ЦеннаяБумага);
	ПараметрыНачисления.Вставить("ВалютаНоминала",	ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// 1 Начислим %ные доходы
		ПараметрыНачисления.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
		ПараметрыНачисления.Вставить("СтрокаПартии",	ВыборкаДетальныеЗаписи.СтрокаПартии);
		ПараметрыНачисления.Вставить("Количество",		0);
		ПараметрыНачисления.Вставить("ПроверитьПарные",	"");
		
		// дисконт-премия	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Списание премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы04);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаСписанияПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Начисление дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы01);
			ПараметрыНачисления.Вставить("ГФУ",					ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаПроцентныхДоходов);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД	
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Переоценка купона");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы01);
		ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаПроцентныхДоходов);
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		Если НастройкиУчета.ПереоцениватьОблигацииПриПолномПогашении Тогда
		
			// переоценка
			БалансоваяПереоценка = ВыборкаДетальныеЗаписи.ПереоценкаОстаток;
			БалансоваяПереоценкаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаОстаток;
			
			ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.Переоценка);
			ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета);
			ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаОстаток + ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета);
			ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяПереоценка);
			ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяПереоценкаВВалютеУчета);
			
			ПараметрыНачисления.Вставить("Содержание",			"Переоценка");
			ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
			
			ПараметрыНачисления.Вставить("ПроверитьПарные",		"Переоценка");
			
			Если (БалансоваяПереоценкаВВалютеУчета > 0)ИЛИ(БалансоваяПереоценкаВВалютеУчета = 0 И ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0) Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.СчетУчетаПереоценкиА);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.СчетУчетаПереоценкиП);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.СчетУчетаПереоценкиП);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.СчетУчетаПереоценкиА);
			КонецЕсли;
			
			Если (ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаОстаток > 0)ИЛИ(ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГодаОстаток = 0 И ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0) Тогда
				ПараметрыНачисления.Вставить("СчетДоходовРасходов", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.АналитикаДоходовОтПереоценки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.АналитикаРасходовОтПереоценки);
			Иначе
				ПараметрыНачисления.Вставить("СчетДоходовРасходов",	БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС, Ложь));
				ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.АналитикаРасходовОтПереоценки);
				
				ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", БухгалтерскийУчетЕПС.ОпределитьСчетУчетаДоходовРасходовОтПереоценки(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС));
				ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.АналитикаДоходовОтПереоценки);
			КонецЕсли;
				
			БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		КонецЕсли; 
			
		// корректировка ЭСП
		БалансоваяКорректировкаЭСП = ВыборкаДетальныеЗаписи.КорректировкаЭСПОстаток;
		БалансоваяКорректировкаЭСПВВалютеУчета = ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток;
		
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаСНачалаГода",	ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток + ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаПартииПриход);
		ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяКорректировкаЭСП);
		ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяКорректировкаЭСПВВалютеУчета);
		
		ПараметрыНачисления.Вставить("Содержание",			"КорректировкаЭСП");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		ПараметрыНачисления.Вставить("ПроверитьПарные",		"КорректировкаЭСП");
		
		Если БалансоваяКорректировкаЭСПВВалютеУчета > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		ИначеЕсли БалансоваяКорректировкаЭСПВВалютеУчета < 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
			ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
		Иначе
			Если ВыборкаДетальныеЗаписи.КорректировкаЭСППартииПриход > 0 Тогда
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
			Иначе
				ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
				ПараметрыНачисления.Вставить("СчетУчетаПарный",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПСНачалаГодаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ПланыСчетов.Единый.ПроцентныеДоходы06);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовОтКорректировки);
			
			ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", ПланыСчетов.Единый.ПроцентныеДоходы05);
			ПараметрыНачисления.Вставить("ГФУПарный",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовОтКорректировки);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		ПараметрыНачисления.Удалить("ПроверитьПарныеДоходыРасходы");
		
		// разница п/п
		ПараметрыНачисления.Вставить("Сумма",				ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПартииПриход);
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаПартииПриход);
		
		ПараметрыНачисления.Вставить("Содержание",			"Разница первоначального признания");
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияСНачалаГодаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов", ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаДоходовПервоначальногоПризнания);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций);
			ПараметрыНачисления.Вставить("ГФУ",				ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовПервоначальногоПризнания);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		
		// 2 Начислим курсовую разницу
		СчетДоходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
		ГФУДоходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетДоходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		СчетРасходовПерекурсовка = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
		ГФУРасходовПерекурсовка = БухгалтерскийУчетЕПС.ПолучитьГФУПоВалюте(СчетРасходовПерекурсовка, ВыборкаДетальныеЗаписи.ЦеннаяБумага.ВалютаНоминала);
		
		ПараметрыНачисления.Вставить("Сумма",				0);
		
		// тело
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница стоимость");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаТела);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// УНКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон приобретенный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонПриобретенный);
		
		Если ВыборкаДетальныеЗаписи.СтоимостьКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// переоценка
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаПереоценкиП);
		КонецЕсли;
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница переоценка");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаПереоценкиТела);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// ННКД
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница купон начисленный");
		ПараметрыНачисления.Вставить("Аналитика",			АналитикаКупонНачисленный);
		
		Если ВыборкаДетальныеЗаписи.ПереоценкаКупонаПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// дисконт-премия
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка);
		
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияПокупки > 0 Тогда
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница премии");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаПремии);
		Иначе
			ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница дисконта");
			ПараметрыНачисления.Вставить("Аналитика",			АналитикаДисконта);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДисконтПремияНачисленныйПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// корректировка ЭСП
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка());
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСПВВалютеУчетаОстаток > 0 Тогда
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокА);
		Иначе
			ПараметрыНачисления.Вставить("СчетУчета",		ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаКорректировокП);
		КонецЕсли;
		
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница корректировка ЭСП");
		
		Если ВыборкаДетальныеЗаписи.КорректировкаЭСППерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		// разница п/п
		ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка);
		
		ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.РазницаПервоначальногоПризнания);
		ПараметрыНачисления.Вставить("СчетУчета",			ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета);
		ПараметрыНачисления.Вставить("Содержание",			"Курсовая разница п/п");
		
		Если ВыборкаДетальныеЗаписи.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеПерекурсовка > 0 Тогда
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетДоходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУДоходовПерекурсовка);
		Иначе
			ПараметрыНачисления.Вставить("СчетДоходовРасходов",	СчетРасходовПерекурсовка);
			ПараметрыНачисления.Вставить("ГФУ",					ГФУРасходовПерекурсовка);
		КонецЕсли;
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
		
		Если НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности Тогда
			// Бумаги и не списаны и не оплачены - перенесем НКД на аналитику по задолженности
			
			ПереоценкаКупонаОстаток = ВыборкаДетальныеЗаписи.ПереоценкаКупонаОстаток + ВыборкаДетальныеЗаписи.ПереоценкаКупонаПартииПриход;
			ПереоценкаКупонаВВалютеУчетаОстаток = ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаОстаток + ВыборкаДетальныеЗаписи.ПереоценкаКупонаВВалютеУчетаПартииПриход;
			СтоимостьКупонаОстаток = ВыборкаДетальныеЗаписи.СтоимостьКупонаОстаток;
			СтоимостьКупонаВВалютеУчетаОстаток = ВыборкаДетальныеЗаписи.СтоимостьКупонаВВалютеУчетаОстаток;
			
			Если ЗначениеЗаполнено(ПереоценкаКупонаОстаток) Или ЗначениеЗаполнено(ПереоценкаКупонаВВалютеУчетаОстаток) Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ПереоценкаКупонаВВалютеУчетаОстаток, "Задолженность по погашению купона");
				
				// дебет
				Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
				
				Проводка.ВалютаДт  = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ПереоценкаКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
				// кредит
				Проводка.СчетКт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
				
				Проводка.ВалютаКт  = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = ПереоценкаКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
				
				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтоимостьКупонаОстаток) Или ЗначениеЗаполнено(СтоимостьКупонаВВалютеУчетаОстаток) Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СтоимостьКупонаВВалютеУчетаОстаток, "Задолженность по погашению купона");
				
				// дебет
				Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
				
				Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
				
				Проводка.ВалютаДт  = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СтоимостьКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
				// кредит
				Проводка.СчетКт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчета;
				
				Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.ЦеннаяБумага;
				
				Проводка.ВалютаКт  = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
				Проводка.ВалютнаяСуммаКт = СтоимостьКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
				
				Проводка.Партия = ВыборкаДетальныеЗаписи.Партия;
				Проводка.СтрокаПартии = ВыборкаДетальныеЗаписи.СтрокаПартии;
				
			КонецЕсли;
			
			
		КонецЕсли;	
		
	КонецЦикла;

	Если НастройкиУчета.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу Тогда // доводим до номинала, если сегодня не было ни 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
			|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
			|	БухПартииЦенныхБумаг.Партия КАК Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
			|	БухПартииЦенныхБумаг.Рынок КАК Рынок,
			|	СУММА(БухПартииЦенныхБумаг.ПереоценкаСНачалаГода) КАК ПереоценкаСНачалаГода
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумаг.ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
			|	БухПартииЦенныхБумаг.Партия,
			|	БухПартииЦенныхБумаг.СтрокаПартии,
			|	БухПартииЦенныхБумаг.Рынок";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета <> 0 Тогда 
				
				УчетныйАктив = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС;
				
				ПараметрыНачисления = Новый Структура;
				
				Если НастройкиУчета.НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки Тогда
					ПараметрыНачисления.Вставить("НеСворачиватьПоПарнымСчетамДоходыРасходыОтПереоценки", Истина);	
				КонецЕсли;
				
				ПараметрыНачисления.Вставить("ЦеннаяБумага",	ЭтотОбъект.ЦеннаяБумага);
				ПараметрыНачисления.Вставить("ВалютаНоминала",	ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала);
				ПараметрыНачисления.Вставить("Партия",			ВыборкаДетальныеЗаписи.Партия);
				ПараметрыНачисления.Вставить("СтрокаПартии",	ВыборкаДетальныеЗаписи.СтрокаПартии);
				ПараметрыНачисления.Вставить("Количество",		0);
				
				// переоценка
				БалансоваяПереоценка = ВыборкаДетальныеЗаписи.Переоценка;
				БалансоваяПереоценкаВВалютеУчета = ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета;
				
				ПараметрыНачисления.Вставить("Сумма",				-ВыборкаДетальныеЗаписи.Переоценка);
				ПараметрыНачисления.Вставить("СуммаВВалютеУчета",	-ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета);
				ПараметрыНачисления.Вставить("СуммаСНачалаГода",	-ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода);
				ПараметрыНачисления.Вставить("СуммаБалансовая",		БалансоваяПереоценка);
				ПараметрыНачисления.Вставить("СуммаБалансоваяВВалютеУчета",		БалансоваяПереоценкаВВалютеУчета);
				
				ПараметрыНачисления.Вставить("СуммаСНачалаГодаНачальная",	-ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода);
				ПараметрыНачисления.Вставить("СуммаСНачалаГодаКонечная",	ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета-ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода);
				
				ПараметрыНачисления.Вставить("Содержание",			"Переоценка");
				ПараметрыНачисления.Вставить("Аналитика",			Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги);
				
				ПараметрыНачисления.Вставить("ПроверитьПарные",		"Переоценка");
				
				Если (БалансоваяПереоценкаВВалютеУчета > 0)ИЛИ(БалансоваяПереоценкаВВалютеУчета = 0 И ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0) Тогда
					ПараметрыНачисления.Вставить("СчетУчета",		УчетныйАктив.СчетУчетаПереоценкиА);
					ПараметрыНачисления.Вставить("СчетУчетаПарный",	УчетныйАктив.СчетУчетаПереоценкиП);
				Иначе
					ПараметрыНачисления.Вставить("СчетУчета",		УчетныйАктив.СчетУчетаПереоценкиП);
					ПараметрыНачисления.Вставить("СчетУчетаПарный",	УчетныйАктив.СчетУчетаПереоценкиА);
				КонецЕсли;
				
				Если (ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода > 0)ИЛИ(ВыборкаДетальныеЗаписи.ПереоценкаСНачалаГода = 0 И ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета > 0) Тогда
					ПараметрыНачисления.Вставить("СчетДоходовРасходов", УчетныйАктив.СчетУчетаДоходовОтОпераций);
					ПараметрыНачисления.Вставить("ГФУ",				УчетныйАктив.АналитикаДоходовОтПереоценки);
					
					ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный",	УчетныйАктив.СчетУчетаРасходовОтОпераций);
					ПараметрыНачисления.Вставить("ГФУПарный",		УчетныйАктив.АналитикаРасходовОтПереоценки);
				Иначе
					ПараметрыНачисления.Вставить("СчетДоходовРасходов",	УчетныйАктив.СчетУчетаРасходовОтОпераций);
					ПараметрыНачисления.Вставить("ГФУ",				УчетныйАктив.АналитикаРасходовОтПереоценки);
					
					ПараметрыНачисления.Вставить("СчетДоходовРасходовПарный", УчетныйАктив.СчетУчетаДоходовОтОпераций);
					ПараметрыНачисления.Вставить("ГФУПарный",		УчетныйАктив.АналитикаДоходовОтПереоценки);
				КонецЕсли;
					
				БухгалтерскийУчетЕПС.СформироватьПроводкиНачисленияПроцентовПереоценкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыНачисления);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли НастройкиУчета.СписыватьПриПолномПогашенииВМоментПогашения Тогда // спишем, раз такая настройка
		БухгалтерскийУчетЕПС.СформироватьПроводкиСписанияЦеннойБумагиСПартиямиНаЛицевыхСчетах(УчетныйРегистр, ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПСПогашение(УчетныйРегистр, Отказ)

	// Только начисляем, ничего не гасим. Такое вот погашение!
	
	АналитикаТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта = Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаДебиторкиПоКупону = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона;

	ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов");
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления);	
	
	Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
	
		ПроведениеПоРегиструЕПСПогашениеСПартиямиНаЛицевыхСчетах(УчетныйРегистр, НастройкиУчета, Отказ);
		Возврат;
	
	КонецЕсли;
	
	
	//читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.Переоценка = 0
		|		И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|		И БухПартииЦенныхБумаг.КорректировкаЭСП = 0
		|		И БухПартииЦенныхБумаг.ДисконтПремияНачисленный = 0
		|		И БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные = 0 КАК Перекурсовка,
		|	БухПартииЦенныхБумаг.ПереоценкаКупона КАК ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.Переоценка КАК Переоценка,
		|	БухПартииЦенныхБумаг.КорректировкаЭСП КАК КорректировкаЭСП,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленный КАК ДисконтПремияНачисленный,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета КАК СтоимостьВВалютеУчета,
		|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета КАК ПереоценкаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета КАК ПереоценкаКупонаВВалютеУчета,
		|	БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета КАК КорректировкаЭСПВВалютеУчета,
		|	БухПартииЦенныхБумаг.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	БухПартииЦенныхБумаг.ИндексацияНоминала КАК ИндексацияНоминала
		|ПОМЕСТИТЬ _ДвиженияПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияПокупкиОстаток < 0 КАК Дисконт,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК ИндексацияНоминалаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДоДокумента,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И ВидУчета = &ВидУчета
		|				И (ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии) В
		|					(ВЫБРАТЬ
		|						_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|						_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|						_ДвиженияПартий.Партия КАК Партия,
		|						_ДвиженияПартий.СтрокаПартии КАК СтрокаПартии
		|					ИЗ
		|						_ДвиженияПартий КАК _ДвиженияПартий)) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДвиженияПартий.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.Дисконт КАК Дисконт,
		|	_ДвиженияПартий.Перекурсовка КАК Перекурсовка,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСП) КАК КорректировкаЭСП,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленный) КАК ДисконтПремияНачисленный,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,
		|	СУММА(_ДвиженияПартий.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(_ДвиженияПартий.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	СУММА(_ДвиженияПартий.ДисконтПремияНачисленныйВВалютеУчета) КАК ДисконтПремияНачисленныйВВалютеУчета,
		|	СУММА(_ДвиженияПартий.КорректировкаЭСПВВалютеУчета) КАК КорректировкаЭСПВВалютеУчета,
		|	СУММА(_ДвиженияПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
		|	СУММА(_ОстаткиПартий.ПереоценкаОстаток) КАК ПереоценкаОстаток,
		|	СУММА(_ОстаткиПартий.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленныйОстаток,
		|	СУММА(_ОстаткиПартий.КорректировкаЭСПОстаток) КАК КорректировкаЭСПОстаток,
		|	СУММА(_ОстаткиПартий.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток) КАК РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток,
		|	СУММА(_ДвиженияПартий.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(_ДвиженияПартий.Переоценка) КАК Переоценка,
		|	СУММА(_ДвиженияПартий.ИндексацияНоминала) КАК ИндексацияНоминала,
		|	СУММА(_ОстаткиПартий.ИндексацияНоминалаОстаток) КАК ИндексацияНоминалаОстаток,
		|	СУММА(_ОстаткиПартий.ПереоценкаКупонаОстаток) КАК ПереоценкаКупонаОстаток,
		|	СУММА(_ОстаткиПартий.ПереоценкаКупонаВВалютеУчетаОстаток) КАК ПереоценкаКупонаВВалютеУчетаОстаток,
		|	СУММА(_ОстаткиПартий.СтоимостьКупонаОстаток) КАК СтоимостьКупонаОстаток,
		|	СУММА(_ОстаткиПартий.СтоимостьКупонаВВалютеУчетаОстаток) КАК СтоимостьКупонаВВалютеУчетаОстаток
		|ИЗ
		|	_ДвиженияПартий КАК _ДвиженияПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПартий КАК _ОстаткиПартий
		|		ПО _ДвиженияПартий.УчетныйАктивЕПС = _ОстаткиПартий.УчетныйАктивЕПС
		|			И _ДвиженияПартий.ЦеннаяБумага = _ОстаткиПартий.ЦеннаяБумага
		|			И _ДвиженияПартий.Партия = _ОстаткиПартий.Партия
		|			И _ДвиженияПартий.СтрокаПартии = _ОстаткиПартий.СтрокаПартии
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДвиженияПартий.УчетныйАктивЕПС,
		|	_ДвиженияПартий.ЦеннаяБумага,
		|	_ОстаткиПартий.Дисконт,
		|	_ДвиженияПартий.Перекурсовка";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("ДоДокумента",    Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",    ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",    ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() 
		И НЕ НастройкиУчета.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу 
		И НЕ НастройкиУчета.СписыватьПриПолномПогашенииВМоментПогашения Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
	БухПартииЦенныхБумаг = РезультатЗапроса.Выгрузить();
	
	МассивУчетныхАктивов = Новый Массив;
	
	ПереоценкаКупонаОстаток = 0;
	ПереоценкаКупонаВВалютеУчетаОстаток = 0;
	СтоимостьКупонаОстаток = 0;
	СтоимостьКупонаВВалютеУчетаОстаток = 0;
	
	Для Каждого СтрокаПартии Из БухПартииЦенныхБумаг Цикл
		УчетныйАктив = СтрокаПартии.УчетныйАктивЕПС;
		
		Если МассивУчетныхАктивов.Найти(УчетныйАктив) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(УчетныйАктив);
		КонецЕсли;
		
		Если СтрокаПартии.Перекурсовка Тогда
			
			ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС, "
				+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета, "
				+ "ДисконтПремияНачисленныйВВалютеУчета, КорректировкаЭСПВВалютеУчета, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, "
				+ "ДисконтПремияНачисленныйОстаток, ПереоценкаОстаток, КорректировкаЭСПОстаток, РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток",
				СтрокаПартии.ЦеннаяБумага, УчетныйАктив,
				СтрокаПартии.СтоимостьВВалютеУчета, СтрокаПартии.СтоимостьКупонаВВалютеУчета, СтрокаПартии.ПереоценкаВВалютеУчета, СтрокаПартии.ПереоценкаКупонаВВалютеУчета,
				СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПартии.КорректировкаЭСПВВалютеУчета, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета,
				СтрокаПартии.ДисконтПремияНачисленныйОстаток,СтрокаПартии.ПереоценкаОстаток,СтрокаПартии.КорректировкаЭСПОстаток,СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеОстаток);
				
			БухгалтерскийУчетЕПС.ДвижениеПерекурсовки(ЭтотОбъект, ПараметрыПерекурсовки, Отказ);	
			
		Иначе
			
			Если НастройкиУчета.ПереоцениватьОблигацииПриПолномПогашении И СтрокаПартии.Переоценка<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"Переоценка", СтрокаПартии.Переоценка, СтрокаПартии.ПереоценкаВВалютеУчета,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, СтрокаПартии.ЦеннаяБумага, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
			
			// Дооцениваем купон
			Если СтрокаПартии.ПереоценкаКупона <> 0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Аналитика",
					СтрокаПартии.ПереоценкаКупонаВВалютеУчета, СтрокаПартии.ПереоценкаКупона, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, АналитикаКупонНачисленный);
				БухгалтерскийУчетЕПС.НачислитьНКД(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			//дооценки перед расходом купона, дисконта и т.п.
			Если СтрокаПартии.ДисконтПремияНачисленный<>0 Тогда
				ПараметрыНачисления = Новый Структура("СуммаУчета, СуммаВал, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала",
					СтрокаПартии.ДисконтПремияНачисленныйВВалютеУчета, СтрокаПартии.ДисконтПремияНачисленный, ВалютаУчета, УчетныйАктив, ЦеннаяБумага, ВалютаНоминала);
				ПараметрыНачисления.Вставить("Аналитика", ?(СтрокаПартии.ДисконтПремияНачисленный<0, АналитикаПремии, АналитикаДисконта));
				БухгалтерскийУчетЕПС.НачислитьДисконтПремию(ЭтотОбъект, ПараметрыНачисления, Отказ);
			КонецЕсли;
			
			Если СтрокаПартии.КорректировкаЭСП<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"КорректировкаЭСП", СтрокаПартии.КорректировкаЭСПВВалютеУчета, СтрокаПартии.КорректировкаЭСП,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
				
			КонецЕсли;
			
			Если СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"РазницаПервоначальногоПризнания", СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчета, СтрокаПартии.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанные,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
			
			Если СтрокаПартии.ИндексацияНоминала<>0 Тогда
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
					"ИндексацияНоминала", СтрокаПартии.ИндексацияНоминала, СтрокаПартии.ИндексацияНоминала,ЭтотОбъект.Организация.ВалютаУчета,  УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Неопределено);
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
			КонецЕсли;
			
			ПереоценкаКупонаОстаток = ПереоценкаКупонаОстаток + СтрокаПартии.ПереоценкаКупонаОстаток + СтрокаПартии.ПереоценкаКупона;
			ПереоценкаКупонаВВалютеУчетаОстаток = ПереоценкаКупонаВВалютеУчетаОстаток + СтрокаПартии.ПереоценкаКупонаВВалютеУчетаОстаток + СтрокаПартии.ПереоценкаКупонаВВалютеУчета;
			СтоимостьКупонаОстаток = СтоимостьКупонаОстаток + СтрокаПартии.СтоимостьКупонаОстаток;
			СтоимостьКупонаВВалютеУчетаОстаток = СтоимостьКупонаВВалютеУчетаОстаток + СтрокаПартии.СтоимостьКупонаВВалютеУчетаОстаток;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	ЗакрыватьПереоценки = Ложь;
	Если НастройкиУчета.УчитыватьПогашенныеОблигацииДоПрекращенияПризнанияПоНоминалу Тогда // доводим до номинала, если сегодня не было ни 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
			|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
			|ГДЕ
			|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
			|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|
			|СГРУППИРОВАТЬ ПО
			|	БухПартииЦенныхБумаг.ЦеннаяБумага,
			|	БухПартииЦенныхБумаг.УчетныйАктивЕПС";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета <> 0 Тогда 
				
				ПараметрыСписания = Новый Структура("Показатель, СуммаВал, СуммаУчета, ВалютаУчета,	УчетныйАктив, ЦеннаяБумага, ВалютаНоминала, Сделка",
						"Переоценка",
						-ВыборкаДетальныеЗаписи.Переоценка,
						-ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета,
						ЭтотОбъект.Организация.ВалютаУчета,
						ВыборкаДетальныеЗаписи.УчетныйАктивЕПС,
						ЦеннаяБумага,
						ЦеннаяБумага.ВалютаНоминала,
						Неопределено);
						
				БухгалтерскийУчетЕПС.ДвижениеКорректировки(ЭтотОбъект, ПараметрыСписания, Отказ);
				
				Если МассивУчетныхАктивов.Найти(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС) = Неопределено Тогда
					МассивУчетныхАктивов.Добавить(ВыборкаДетальныеЗаписи.УчетныйАктивЕПС);
				КонецЕсли;
				
				ЗакрыватьПереоценки = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли НастройкиУчета.СписыватьПриПолномПогашенииВМоментПогашения Тогда // спишем, раз такая настройка
		БухгалтерскийУчетЕПС.СформироватьПроводкиСписанияЦеннойБумаги(УчетныйРегистр, ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// проверяем было ли списание с счета ДЕПО и оплата долга за погашение, если, конечно, это не клиент со списанием при погашении
	Если НЕ НастройкиУчета.СписыватьПриПолномПогашенииВМоментПогашения
		И БухгалтерскийУчетЕПС.НеобходимоФормироватьПроводкуПереносаНКДНаАналитикуЗадолженности(ЭтотОбъект.Ссылка) Тогда
		// Бумаги и не списаны и не оплачены - перенесем НКД на аналитику по задолженности
		
		Контрагент = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЦеннаяБумага, Дата);
		
		Если ЗначениеЗаполнено(ПереоценкаКупонаОстаток) Или ЗначениеЗаполнено(ПереоценкаКупонаВВалютеУчетаОстаток) Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, ПереоценкаКупонаВВалютеУчетаОстаток, "Задолженность по погашению купона");
			
			// дебет
			Если ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
			
				Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
				Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
				
				Проводка.ВалютаДт  = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ПереоценкаКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Проводка.ВалютаДт  = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = ПереоценкаКупонаОстаток;
								
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
			КонецЕсли;
			
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаКт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = ПереоценкаКупонаОстаток;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаКупонНачисленный;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтоимостьКупонаОстаток) Или ЗначениеЗаполнено(СтоимостьКупонаВВалютеУчетаОстаток) Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СтоимостьКупонаВВалютеУчетаОстаток, "Задолженность по погашению купона");
			
			// дебет
			Если ОтражатьПроцентныеДоходыНаСчетахУчетаАктивов Тогда
			
				Проводка.СчетДт = УчетныйАктив.СчетУчетаКупона;
				Проводка.СубконтоДт.ЦенныеБумаги = ЦеннаяБумага;
				
				Проводка.ВалютаДт  = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СтоимостьКупонаОстаток;
				
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Ссылка;
				
				Проводка.ВалютаДт  = ВалютаНоминала;
				Проводка.ВалютнаяСуммаДт = СтоимостьКупонаОстаток;
								
				Проводка.ДополнительнаяАналитикаДт = АналитикаДебиторкиПоКупону;
				
			КонецЕсли;
			
			// кредит
			Проводка.СчетКт = УчетныйАктив.СчетУчетаКупона;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦеннаяБумага;
			
			Проводка.ВалютаКт  = ВалютаНоминала;
			Проводка.ВалютнаяСуммаКт = СтоимостьКупонаОстаток;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаКупонПриобретенный;
			
		КонецЕсли;
		
		
	КонецЕсли;	
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, ЗакрыватьПереоценки, Истина, ЭтотОбъект.ЦеннаяБумага, Отказ);
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
	
		ПроведениеПоРегиструЕПСЧастичноеПогашение(УчетныйРегистр, Отказ);
		
	Иначе
		
		ПроведениеПоРегиструЕПСПогашение(УчетныйРегистр, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.ПогашениеЦеннойБумаги.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		,
		УчетныйРегистр, 
		Отказ, Истина);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Количество, Сумма, СуммаКупона");

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		ПроверяемыеРеквизиты.Добавить("ВидПогашения");
		ПроверяемыеРеквизиты.Добавить("ДатаФиксации");
	КонецЕсли;
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Облигации и ВидПогашения = Перечисления.ВидыПогашения.Оферта Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияОферт.Облигация
			|ИЗ
			|	РегистрСведений.УсловияОферт КАК УсловияОферт
			|ГДЕ
			|	УсловияОферт.Облигация = &Облигация
			|	И УсловияОферт.ДатаВыкупа = &ДатаВыкупа";
		
		Запрос.УстановитьПараметр("ДатаВыкупа", НачалоДня(Дата));
		Запрос.УстановитьПараметр("Облигация", ЦеннаяБумага);
		
		РезультатЗапроса = Запрос.Выполнить();
			
		Если РезультатЗапроса.Пустой() Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru=""На дату документа " + Ссылка
			// пока у нас не все оферты
			//	+ " остутствуют условия оферт по облигации " + ЦеннаяБумага + """"),,,, Отказ);  
				+ " остутствуют условия оферт по облигации " + ЦеннаяБумага + """"), Ссылка,,, );
				
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		
			Если ЭтотОбъект.Дата < ЭтотОбъект.ДатаФиксации Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа не может быть меньше даты фиксации!'"), ЭтотОбъект, "ДатаФиксации",, Отказ);
			КонецЕсли;
			
			Если ЭтотОбъект.СуммаКупона > 0 И ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Сумма купона не может быть задана при частичном погашении облигации!'"), ЭтотОбъект, "ВидПогашения",, Отказ);
			КонецЕсли;

			ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(ЭтотОбъект);
			
			Если ДетализацияПоРасчетномуСчету Тогда
				Если НЕ ЗначениеЗаполнено(РасчетныйСчет) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Расчетный счёт"" не заполнено'"), ЭтотОбъект, "РасчетныйСчет",, Отказ);			
				Иначе
					Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.ВалютаОплаты Тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта расчетного счета отличается от валюты оплаты!'"), ЭтотОбъект, "РасчетныйСчет",, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение И  НЕ ЭтотОбъект.ЦеннаяБумага.Амортизационная Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При частичном погашении должна быть выбрана амортизационная облигация!'"), ЭтотОбъект, "ВидПогашения",, Отказ);
			КонецЕсли;
			
		ИначеЕсли ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Паи И ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Векселя И ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Недопустимое значение рынка ценных бумаг!'"), ЭтотОбъект, "Рынок",, Отказ);
			
		КонецЕсли;
		
		Если РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага) <> ЭтотОбъект.Рынок Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Рынок не соответствует ценной бумаге!'"), ЭтотОбъект, "Рынок",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// неблокирующие проверки
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) И ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ПолноеПогашение И НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.ЦеннаяБумага.ДатаПогашения Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа отличается от даты погашения облигации!'"), ЭтотОбъект, "Дата",,);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти 
