
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Сверка с брокером КИТ", "0.10", "", Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция ОпределитьЦБПоРегНомеру(РегНомЦБ, ТаблРегНомеров)

	Если      РегНомЦБ = "1-01-00077A" Тогда
		РегНомЦБ = "1-01-00077-A";
	ИначеЕсли РегНомЦБ = "4-11-30166F" Тогда
		РегНомЦБ = "4-11-30166-F";
	ИначеЕсли РегНомЦБ = "4-02-55090E" Тогда
		РегНомЦБ = "4-02-55090-E";
	ИначеЕсли РегНомЦБ = "1-01-55192E" Тогда
		РегНомЦБ = "1-01-55192-E";
	ИначеЕсли РегНомЦБ = "4-1000175-A" Тогда
		РегНомЦБ = "4-10-00175-A";
	ИначеЕсли РегНомЦБ = "4-0206005-A" Тогда
		РегНомЦБ = "4-02-06005-A";
	ИначеЕсли РегНомЦБ = "4B02–01-00010-A" Тогда
		РегНомЦБ = "4B02-01-00010-A";
	КонецЕсли;
	
	Если Лев(РегНомЦБ, 2) = "SU" Тогда
	    РегНомЦБ = Сред(РегНомЦБ, 3, СтрДлина(РегНомЦБ) - 3);
	КонецЕсли;
	
	НайденнаяСтрока = ТаблРегНомеров.Найти(РегНомЦБ, "ГосударственныйРегистрационныйНомер");
	Если Не НайденнаяСтрока = Неопределено Тогда
		Возврат НайденнаяСтрока.Ссылка;
	Иначе
		НайденнаяСтрока = ТаблРегНомеров.Найти(СтрЗаменить(РегНомЦБ, "-", ""), "ГосударственныйРегистрационныйНомер");
		Если Не НайденнаяСтрока = Неопределено Тогда
			Возврат НайденнаяСтрока.Ссылка;
		Иначе
			НайденнаяСтрока = ТаблРегНомеров.Найти(Сред(РегНомЦБ, 3), "ГосударственныйРегистрационныйНомер");
			Если Не НайденнаяСтрока = Неопределено Тогда
				Возврат НайденнаяСтрока.Ссылка;
			Иначе
				НайденнаяСтрока = ТаблРегНомеров.Найти("SU" + РегНомЦБ + "S", "ГосударственныйРегистрационныйНомер");
				Если Не НайденнаяСтрока = Неопределено Тогда
					Возврат НайденнаяСтрока.Ссылка;
				Иначе
					Возврат Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Процедура ОпределитьНаличиеРасхождений(ЕстьРасхождения, ИсточникДанных, ИмяПоказателя1 = "", ИмяПоказателя2 = "", ИмяПоказателя3 = "", ИмяПоказателя4 = "", ИмяПоказателя5 = "")
	
	Если Не ЕстьРасхождения Тогда
		Если ИмяПоказателя1 <> "" И ИсточникДанных[ИмяПоказателя1] <> 0 Тогда
			ЕстьРасхождения = Истина;
			Возврат;
		ИначеЕсли ИмяПоказателя2 <> "" И ИсточникДанных[ИмяПоказателя2] <> 0 Тогда
			ЕстьРасхождения = Истина;
			Возврат;
		ИначеЕсли ИмяПоказателя3 <> "" И ИсточникДанных[ИмяПоказателя3] <> 0 Тогда
			ЕстьРасхождения = Истина;
			Возврат;
		ИначеЕсли ИмяПоказателя4 <> "" И ИсточникДанных[ИмяПоказателя4] <> 0 Тогда
			ЕстьРасхождения = Истина;
			Возврат;
		ИначеЕсли ИмяПоказателя5 <> "" И ИсточникДанных[ИмяПоказателя5] <> 0 Тогда
			ЕстьРасхождения = Истина;
			Возврат;	
		КонецЕсли;				
	КонецЕсли;
	
КонецПРоцедуры // ОпределитьНаличиеРасхождений

Функция ПолучитьДанныеПоДС(СчетДУ, Брокер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			Брокер = &Брокер
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация) КАК ОстаткиДенежныхСредствОстаткиИОбороты";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("НачалоПериода",                Новый Граница(НачалоДня(ЭтотОбъект.ДатаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",                 Новый Граница(КонецДня(ЭтотОбъект.ДатаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Брокер",                       Брокер);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеПоДС

Функция ПолучитьДанныеПоЦБ(СчетДУ, Брокер, ТаблЦБ, ИспользоватьОсновнойРаздел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблЦБ.ЦеннаяБумага,
		|	ТаблЦБ.БрокНачальныйОстаток,
		|	ТаблЦБ.БрокКонечныйОстаток
		|ПОМЕСТИТЬ БрокОстаткиЦБ
		|ИЗ
		|	&ТаблЦБ КАК ТаблЦБ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОборотыБрокер.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОборотыБрокер.КоличествоНачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиЦенныхБумагОстаткиИОборотыБрокер.КоличествоКонечныйОстаток КАК КонечныйОстаток
		|ПОМЕСТИТЬ ОстаткиЦБ
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ДепозитарныйСчет.Брокер = &Брокер) КАК ОстаткиЦенныхБумагОстаткиИОборотыБрокер
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК НачальныйОстаток,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток КАК КонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ДепозитарныйСчет.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|				И ДепозитарныйСчет.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ОстаткиЦБ.ЦеннаяБумага, БрокОстаткиЦБ.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ОстаткиЦБ.НачальныйОстаток,0) КАК НачальныйОстаток,
		|	ЕСТЬNULL(ОстаткиЦБ.КонечныйОстаток,0) КАК КонечныйОстаток,
		|	ЕСТЬNULL(БрокОстаткиЦБ.БрокНачальныйОстаток,0) КАК БрокНачальныйОстаток,
		|	ЕСТЬNULL(БрокОстаткиЦБ.БрокКонечныйОстаток,0) КАК БрокКонечныйОстаток
		|ИЗ
		|	ОстаткиЦБ КАК ОстаткиЦБ
		|		ПОЛНОЕ СОЕДИНЕНИЕ БрокОстаткиЦБ КАК БрокОстаткиЦБ
		|		ПО ОстаткиЦБ.ЦеннаяБумага = БрокОстаткиЦБ.ЦеннаяБумага";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.ДатаСверки);
	Запрос.УстановитьПараметр("НачалоПериода",                Новый Граница(НачалоДня(ЭтотОбъект.ДатаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",                 Новый Граница(КонецДня(ЭтотОбъект.ДатаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Брокер",                       Брокер);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("ТаблЦБ",                       ТаблЦБ);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеПоЦБ

Функция ПолучитьДанныеПоСделкам(СчетДУ, Брокер, Сделки)

	// при выборке сделок учитывается следующие особенности:
	//  1. у КИТ и в сделке и в исполнении указывается общая комиссия (торговая+брокерская)
	//	2. у нас торговая комиссия может быть или в сделке, или в её исполнении
	//  3. у нас брокерская комиссия может быть или в сделке, или в её исполнении, или в отдельном начислении, привязанном к 1-й части
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиВнеш.БрокНомСделки,
		|	СделкиВнеш.БрокКоличество,
		|	СделкиВнеш.БрокСумма,
		|	СделкиВнеш.БрокНКД,
		|	СделкиВнеш.КомБрокера,
		|	СделкиВнеш.КомБрокераНачисл,
		|	СделкиВнеш.БрокДатаОплатыКомиссииБрокера,
		|	СделкиВнеш.КомБиржи,
		|	СделкиВнеш.КомБиржиНачисл
		|ПОМЕСТИТЬ _СделкиВнеш
		|ИЗ
		|	&СделкиВнеш КАК СделкиВнеш
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаНачисленная,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаОплаченная
		|ПОМЕСТИТЬ _КомиссияБрокераПоСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			День,
		|			Основание ССЫЛКА Документ.Сделка
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Брокер = &Брокер
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = СделкаЦенныеБумаги.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаНачисленная,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаОплаченная
		|ПОМЕСТИТЬ _КомиссияБиржиПоСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			День,
		|			Основание ССЫЛКА Документ.Сделка
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Брокер = &Брокер
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = СделкаЦенныеБумаги.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ДокСделка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ДокСделка.Договор.НомерДоговора
		|		ИНАЧЕ ДокСделка.НомерСделки
		|	КОНЕЦ КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА ДокСделка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ДокСделка.Договор.ДатаЗаключения
		|		ИНАЧЕ ДокСделка.ВремяСделки
		|	КОНЕЦ КАК ВремяСделки,
		|	ДокСделка.ВидСделки,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Цена,
		|	СделкаЦенныеБумаги.Количество,
		|	СделкаЦенныеБумаги.Сумма,
		|	СделкаЦенныеБумаги.СуммаКупона,
		|	ЕСТЬNULL(УсловияСделокСрезПоследних.ДатаОплатыКомиссииБрокера, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаОплаченная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаОплаченная, 0) КАК Комиссия,
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаНачисленная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаНачисленная, 0) КАК КомиссияНачисленная
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК ДокСделка
		|		ПО СделкаЦенныеБумаги.Ссылка = ДокСделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И НЕ Отменено) КАК УсловияСделокСрезПоследних
		|		ПО СделкаЦенныеБумаги.Ссылка = УсловияСделокСрезПоследних.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБрокераПоСделкам КАК _КомиссияБрокераПоСделкам
		|		ПО СделкаЦенныеБумаги.Ссылка = _КомиссияБрокераПоСделкам.Основание
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = _КомиссияБрокераПоСделкам.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБиржиПоСделкам КАК _КомиссияБиржиПоСделкам
		|		ПО СделкаЦенныеБумаги.Ссылка = _КомиссияБиржиПоСделкам.Основание
		|			И СделкаЦенныеБумаги.ЦеннаяБумага = _КомиссияБиржиПоСделкам.ЦеннаяБумага
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И СделкаЦенныеБумаги.Ссылка.Брокер = &Брокер
		|	И СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.ЦеннаяБумага,
		|	_Сделки.ВремяСделки,
		|	_Сделки.ВидСделки,
		|	_Сделки.ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_СделкиВнеш.БрокДатаОплатыКомиссииБрокера, 0) КАК БрокДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_Сделки.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(_Сделки.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(_Сделки.СуммаКупона, 0) КАК СуммаКупона,
		|	ЕСТЬNULL(_Сделки.Комиссия, 0) КАК Комиссия,
		|	ЕСТЬNULL(_Сделки.КомиссияНачисленная, 0) КАК КомиссияНачисленная,
		|	ЕСТЬNULL(_СделкиВнеш.БрокКоличество, 0) КАК БрокКоличество,
		|	ЕСТЬNULL(_СделкиВнеш.БрокСумма, 0) КАК БрокСумма,
		|	ЕСТЬNULL(_СделкиВнеш.БрокНКД, 0) КАК БрокНКД,
		|	ЕСТЬNULL(_СделкиВнеш.КомБрокера, 0) + ЕСТЬNULL(_СделкиВнеш.КомБиржи, 0) КАК БрокКомиссия,
		|	ЕСТЬNULL(_СделкиВнеш.КомБрокераНачисл, 0) + ЕСТЬNULL(_СделкиВнеш.КомБиржиНачисл, 0) КАК БрокКомиссияНачисленная
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СделкиВнеш КАК _СделкиВнеш
		|		ПО _Сделки.НомерСделки = _СделкиВнеш.БрокНомСделки";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",                       КонецДня(ЭтотОбъект.ДатаСверки));
	Запрос.УстановитьПараметр("Брокер",                       Брокер);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("СделкиВнеш",                   Сделки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеПоСделкам

Функция ПолучитьДанныеПоИсполнениямСделок(СчетДУ, Брокер, ТаблИсполнений)
	
	// при выборке исполений сделок учитываются следующие особенности:
	//  1. у КИТа комиссия указывается там где ее платили - платили при сделке - в сделке, платили при исполнении (это было 1 раз!) - в исполнении
	//	2. у нас торговая комиссия может быть или в сделке, или в её исполнении
	//  3. у нас брокерская комиссия может быть или в сделке, или в её исполнении, или в отдельном начислении, привязанном к 1-й части
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиВнеш.БрокНомСделки,
		|	СделкиВнеш.БрокДатаОплатыКомиссииБрокера,
		|	СделкиВнеш.БрокКоличество,
		|	СделкиВнеш.БрокСумма,
		|	СделкиВнеш.БрокНКД,
		|	СделкиВнеш.КомБрокера,
		|	СделкиВнеш.КомБрокераНачисл,
		|	СделкиВнеш.КомБиржи,
		|	СделкиВнеш.КомБиржиНачисл
		|ПОМЕСТИТЬ _СделкиВнеш
		|ИЗ
		|	&СделкиВнеш КАК СделкиВнеш
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаНачисленная,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаОплаченная
		|ПОМЕСТИТЬ _КомиссияБрокераПоСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			День,
		|			Основание ССЫЛКА Документ.Сделка
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Брокер = &Брокер
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = СделкаЦенныеБумаги.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаНачисленная,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК СуммаОплаченная
		|ПОМЕСТИТЬ _КомиссияБиржиПоСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			День,
		|			Основание ССЫЛКА Документ.Сделка
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Брокер = &Брокер
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Основание = СделкаЦенныеБумаги.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	СделкаЦенныеБумаги.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Исполнение.Основание.НомерСделки КАК НомерСделки,
		|	Исполнение.Основание.ВремяСделки КАК ВремяСделки,
		|	Исполнение.ВидСделки,
		|	ИсполнениеЦенныеБумаги.ЦеннаяБумага,
		|	ИсполнениеЦенныеБумаги.Количество,
		|	ИсполнениеЦенныеБумаги.Цена,
		|	ИсполнениеЦенныеБумаги.Сумма,
		|	ИсполнениеЦенныеБумаги.СуммаКупона,
		|	ЕСТЬNULL(УсловияСделокСрезПоследних.ДатаОплатыКомиссииБрокера, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаОплаченная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаОплаченная, 0) КАК Комиссия,
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаНачисленная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаНачисленная, 0) КАК КомиссияНачисленная
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК Исполнение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеЦенныеБумаги
		|		ПО Исполнение.Ссылка = ИсполнениеЦенныеБумаги.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И НЕ Отменено) КАК УсловияСделокСрезПоследних
		|		ПО (Исполнение.Основание = УсловияСделокСрезПоследних.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБрокераПоСделкам КАК _КомиссияБрокераПоСделкам
		|		ПО Исполнение.Основание = _КомиссияБрокераПоСделкам.Основание
		|			И ИсполнениеЦенныеБумаги.ЦеннаяБумага = _КомиссияБрокераПоСделкам.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБиржиПоСделкам КАК _КомиссияБиржиПоСделкам
		|		ПО Исполнение.Основание = _КомиссияБиржиПоСделкам.Основание
		|			И ИсполнениеЦенныеБумаги.ЦеннаяБумага = _КомиссияБиржиПоСделкам.ЦеннаяБумага
		|ГДЕ
		|	Исполнение.ПометкаУдаления = ЛОЖЬ
		|	И Исполнение.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И Исполнение.Брокер = &Брокер
		|	И Исполнение.Организация = &Организация
		|	И Исполнение.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоставкаЦенныхБумаг.Основание.НомерДоговора,
		|	ПоставкаЦенныхБумаг.Основание,
		|	ПоставкаЦенныхБумаг.Основание.ВидСделки,
		|	ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага,
		|	ПоставкаЦенныхБумагЦенныеБумаги.Количество,
		|	0,
		|	ПоставкаЦенныхБумагЦенныеБумаги.Сумма,
		|	ПоставкаЦенныхБумагЦенныеБумаги.СуммаКупона,
		|	ЕСТЬNULL(УсловияСделокСрезПоследних.ДатаОплатыКомиссииБрокера, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаОплаченная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаОплаченная, 0),
		|	ЕСТЬNULL(_КомиссияБиржиПоСделкам.СуммаНачисленная, 0) + ЕСТЬNULL(_КомиссияБрокераПоСделкам.СуммаНачисленная, 0)
		|ИЗ
		|	Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО ПоставкаЦенныхБумагЦенныеБумаги.Ссылка = ПоставкаЦенныхБумаг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И НЕ Отменено) КАК УсловияСделокСрезПоследних
		|		ПО (ПоставкаЦенныхБумаг.Основание = УсловияСделокСрезПоследних.Сделка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБрокераПоСделкам КАК _КомиссияБрокераПоСделкам
		|		ПО (ПоставкаЦенныхБумаг.Основание = _КомиссияБрокераПоСделкам.Основание)
		|			И ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага = _КомиссияБрокераПоСделкам.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБиржиПоСделкам КАК _КомиссияБиржиПоСделкам
		|		ПО (ПоставкаЦенныхБумаг.Основание = _КомиссияБиржиПоСделкам.Основание)
		|			И ПоставкаЦенныхБумагЦенныеБумаги.ЦеннаяБумага = _КомиссияБиржиПоСделкам.ЦеннаяБумага
		|ГДЕ
		|	ПоставкаЦенныхБумаг.ПометкаУдаления = ЛОЖЬ
		|	И ПоставкаЦенныхБумаг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
		|	И ПоставкаЦенныхБумаг.Основание.Брокер = &Брокер
		|	И ПоставкаЦенныхБумаг.Организация = &Организация
		|	И ПоставкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.ЦеннаяБумага,
		|	_Сделки.ВремяСделки,
		|	_Сделки.ВидСделки,
		|	_Сделки.ДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_Сделки.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(_Сделки.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(_Сделки.СуммаКупона, 0) КАК СуммаКупона,
		|	ЕСТЬNULL(_Сделки.Комиссия, 0) КАК Комиссия,
		|	ЕСТЬNULL(_Сделки.КомиссияНачисленная, 0) КАК КомиссияНачисленная,
		|	ЕСТЬNULL(_СделкиВнеш.БрокДатаОплатыКомиссииБрокера, 0) КАК БрокДатаОплатыКомиссииБрокера,
		|	ЕСТЬNULL(_СделкиВнеш.БрокКоличество, 0) КАК БрокКоличество,
		|	ЕСТЬNULL(_СделкиВнеш.БрокСумма, 0) КАК БрокСумма,
		|	ЕСТЬNULL(_СделкиВнеш.БрокНКД, 0) КАК БрокНКД,
		|	ЕСТЬNULL(_СделкиВнеш.КомБрокера, 0) + ЕСТЬNULL(_СделкиВнеш.КомБиржи, 0) КАК БрокКомиссия,
		|	ЕСТЬNULL(_СделкиВнеш.КомБрокераНачисл, 0) + ЕСТЬNULL(_СделкиВнеш.КомБиржиНачисл, 0) КАК БрокКомиссияНачисленная
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СделкиВнеш КАК _СделкиВнеш
		|		ПО _Сделки.НомерСделки = _СделкиВнеш.БрокНомСделки";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",                       КонецДня(ЭтотОбъект.ДатаСверки));
	Запрос.УстановитьПараметр("Брокер",                       Брокер);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("СделкиВнеш",                   ТаблИсполнений);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеПоИсполнениямСделок

Функция ПолучитьКодКлиентаУБрокера(СчетДУ, Брокер)
	
	КодКлиента = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ДатаСверки,
		|			Организация = &Организация
		|				И Брокер = &Брокер
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);		
	Запрос.УстановитьПараметр("Брокер",                       Брокер);
	Запрос.УстановитьПараметр("ДатаСверки",                   ЭтотОбъект.ДатаСверки);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		КодКлиента = Выборка.Код;
	КонецЕсли;
	
	Возврат КодКлиента;
	
КонецФункции // ПолучитьКодКлиентаУБрокера

Функция ЗаполнитьПротоколСверкиПоКлиенту(СчетДУ, Брокер, ДанныеБрокера, ТабДок) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Акции.Ссылка,
		|	Акции.ГосударственныйРегистрационныйНомер
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.ДатаАннулирования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Облигации.Ссылка,
		|	Облигации.ГосударственныйРегистрационныйНомер
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Паи.Ссылка,
		|	Паи.ГосударственныйРегистрационныйНомер
		|ИЗ
		|	Справочник.Паи КАК Паи
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	КодыВоВнешнихСистемахСрезПоследних.Код
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(&Период, ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ФайлСверкиГПБ)) КАК КодыВоВнешнихСистемахСрезПоследних";

	Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаСверки);
	ТаблРегНомеров = Запрос.Выполнить().Выгрузить();
	
	ЕстьРасхождения = Ложь;
	
	БрокНачальныйОстаток 		= ДанныеБрокера.НачальныйОстаток;
	БрокКонечныйОстаток 		= ДанныеБрокера.КонечныйОстаток;
	ИспользоватьОсновнойРаздел 	= ДанныеБрокера.ИспользоватьОсновнойРаздел;
	
	ТаблЦБ = Новый ТаблицаЗначений;
	ТаблЦБ.Колонки.Добавить("КодЦБ",				Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(48)));
	ТаблЦБ.Колонки.Добавить("БрокНачальныйОстаток",	Новый ОписаниеТипов("Число"));
	ТаблЦБ.Колонки.Добавить("БрокКонечныйОстаток",	Новый ОписаниеТипов("Число"));
	ТаблЦБ.Колонки.Добавить("ЦеннаяБумага", 		Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип);

	Для каждого ДанныеБрокераСтрокаЦБ Из ДанныеБрокера.ЦенныеБумаги Цикл
		СтрокаЦБ = ТаблЦБ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЦБ, ДанныеБрокераСтрокаЦБ);
		СтрокаЦБ.ЦеннаяБумага = ОпределитьЦБПоРегНомеру(СтрокаЦБ.КодЦБ, ТаблРегНомеров);
	КонецЦикла;
	
	//Есть случаи, когда сборка цб происходит по 2-м разделам (20.11.14)
	ТаблЦБ.Свернуть("КодЦБ, ЦеннаяБумага", "БрокНачальныйОстаток, БрокКонечныйОстаток");
	
	Сделки = Новый ТаблицаЗначений;
	
	Сделки.Колонки.Добавить("БрокНомСделки",  				 Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	Сделки.Колонки.Добавить("БрокДатаОплатыКомиссииБрокера", Новый ОписаниеТипов("Дата"),  Новый КвалификаторыДаты(ЧастиДаты.Дата));
	Сделки.Колонки.Добавить("БрокКоличество",				 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("БрокСумма",	  				 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("БрокНКД",		  				 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБрокера",		  			 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБиржи",		  				 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБрокераНачисл", 			 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБиржиНачисл", 				 Новый ОписаниеТипов("Число"));
	
	Для каждого ДанныеБрокераСтрокаСделки Из ДанныеБрокера.Сделки Цикл
		СтрокаСделки = Сделки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ДанныеБрокераСтрокаСделки);
	КонецЦикла;
	
	ТаблИсполнений = Новый ТаблицаЗначений;
	
	ТаблИсполнений.Колонки.Добавить("БрокНомСделки",  				 Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТаблИсполнений.Колонки.Добавить("БрокДатаОплатыКомиссииБрокера", Новый ОписаниеТипов("Дата"),  Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТаблИсполнений.Колонки.Добавить("БрокКоличество", 				 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("БрокСумма",	  				 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("БрокНКД",		  				 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("КомБрокера",		  			 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("КомБиржи",		  				 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("КомБрокераНачисл", 			 Новый ОписаниеТипов("Число"));
	ТаблИсполнений.Колонки.Добавить("КомБиржиНачисл", 				 Новый ОписаниеТипов("Число"));
	
	Для каждого ДанныеБрокераСтрокаИсполнения Из ДанныеБрокера.Исполнения Цикл
		СтрокаИсполнения = ТаблИсполнений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИсполнения, ДанныеБрокераСтрокаИсполнения);
	КонецЦикла;
	
	// получим данные из БД
	ТаблДС         	= ПолучитьДанныеПоДС(СчетДУ, Брокер);
	ТаблЦБ         	= ПолучитьДанныеПоЦБ(СчетДУ, Брокер, ТаблЦБ, ИспользоватьОсновнойРаздел);
	Сделки			= ПолучитьДанныеПоСделкам(СчетДУ, Брокер, Сделки);
	ТаблИсполнений 	= ПолучитьДанныеПоИсполнениямСделок(СчетДУ, Брокер, ТаблИсполнений);
	
	// заполним протокол сверки
	ТабДок.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет("ПротоколСверки");
	
	// шапка
	МакетШапка = Макет.ПолучитьОбласть("Шапка");
	
	МакетШапка.Параметры.Брокер      = Брокер;
	МакетШапка.Параметры.Организация = ЭтотОбъект.Организация;
	МакетШапка.Параметры.СчетДУ      = СчетДУ;
	МакетШапка.Параметры.ДатаСверки  = Формат(ЭтотОбъект.ДатаСверки, "ДФ=dd.MM.yyyy");
	МакетШапка.Параметры.КодКлиента  = ПолучитьКодКлиентаУБрокера(СчетДУ, Брокер);
	
	ТабДок.Вывести(МакетШапка);
	
	// д/с
	МакетДС = Макет.ПолучитьОбласть("ДС");
	
	МакетДС.Параметры.Брокер      = Брокер;
	МакетДС.Параметры.Организация = ЭтотОбъект.Организация;
	
	Если ТаблДС.Количество() = 0 Тогда
		МакетДС.Параметры.НачальныйОстаток = 0;
		МакетДС.Параметры.КонечныйОстаток  = 0;
	Иначе
		МакетДС.Параметры.НачальныйОстаток = ТаблДС[0].НачальныйОстаток;
		МакетДС.Параметры.КонечныйОстаток  = ТаблДС[0].КонечныйОстаток;
	КонецЕсли;
	
	МакетДС.Параметры.БрокНачальныйОстаток = БрокНачальныйОстаток;
	МакетДС.Параметры.БрокКонечныйОстаток  = БрокКонечныйОстаток;
	
	МакетДС.Параметры.НачальныйОстатокРасхождение = МакетДС.Параметры.НачальныйОстаток - МакетДС.Параметры.БрокНачальныйОстаток;
	МакетДС.Параметры.КонечныйОстатокРасхождение  = МакетДС.Параметры.КонечныйОстаток - МакетДС.Параметры.БрокКонечныйОстаток;
	
	ОпределитьНаличиеРасхождений(ЕстьРасхождения, МакетДС.Параметры, "НачальныйОстатокРасхождение", "КонечныйОстатокРасхождение");
	
	ТабДок.Вывести(МакетДС);
	
	// ц/б
	МакетШапкаЦБ  = Макет.ПолучитьОбласть("ШапкаЦБ");
	
	МакетШапкаЦБ.Параметры.Брокер      = Брокер;
	МакетШапкаЦБ.Параметры.Организация = ЭтотОбъект.Организация;

	ТабДок.Вывести(МакетШапкаЦБ);
	
	МакетСтрокаЦБ = Макет.ПолучитьОбласть("СтрокаЦБ");
	
	Для каждого СтрокаЦБ Из ТаблЦБ Цикл
		ЗаполнитьЗначенияСвойств(МакетСтрокаЦБ.Параметры, СтрокаЦБ);
		
		МакетСтрокаЦБ.Параметры.НачальныйОстатокРасхождение = СтрокаЦБ.БрокНачальныйОстаток - СтрокаЦБ.НачальныйОстаток;
		МакетСтрокаЦБ.Параметры.КонечныйОстатокРасхождение  = СтрокаЦБ.БрокКонечныйОстаток - СтрокаЦБ.КонечныйОстаток;
		
		ОпределитьНаличиеРасхождений(ЕстьРасхождения, МакетСтрокаЦБ.Параметры, "НачальныйОстатокРасхождение", "КонечныйОстатокРасхождение");
		
		ТабДок.Вывести(МакетСтрокаЦБ);
	КонецЦикла;
	
	// сделки
	МакетШапкаСделки  = Макет.ПолучитьОбласть("ШапкаСделки");
	
	МакетШапкаСделки.Параметры.Брокер      = Брокер;
	МакетШапкаСделки.Параметры.Организация = ЭтотОбъект.Организация;
	МакетШапкаСделки.Параметры.ВидСделок   = "Сделки";
	
	ТабДок.Вывести(МакетШапкаСделки);
	
	МакетСтрокаСделки = Макет.ПолучитьОбласть("СтрокаСделки");
	
	Для каждого СтрокаСделки Из Сделки Цикл
		
		Если СтрокаСделки.Комиссия = -1 Тогда
			СтрокаСделки.Комиссия     = 0;
			СтрокаСделки.БрокКомиссия = 0;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МакетСтрокаСделки.Параметры, СтрокаСделки);
		
		МакетСтрокаСделки.Параметры.ВремяОперация         				 = Формат(СтрокаСделки.ВремяСделки, "ДЛФ=T") + " / " + Строка(СтрокаСделки.ВидСделки);
		МакетСтрокаСделки.Параметры.КоличествоРасхождение 				 = СтрокаСделки.БрокКоличество - СтрокаСделки.Количество;
		МакетСтрокаСделки.Параметры.ДатаОплатыКомиссииБрокераРасхождение = ?(СтрокаСделки.БрокДатаОплатыКомиссииБрокера = СтрокаСделки.ДатаОплатыКомиссииБрокера, 0, "Расхождение");
		МакетСтрокаСделки.Параметры.СуммаРасхождение      				 = СтрокаСделки.БрокСумма - СтрокаСделки.Сумма;
		МакетСтрокаСделки.Параметры.КомиссияРасхождение   				 = СтрокаСделки.БрокКомиссия - СтрокаСделки.Комиссия;
		МакетСтрокаСделки.Параметры.КомиссияНачисленнаяРасхождение		 = СтрокаСделки.БрокКомиссияНачисленная - СтрокаСделки.КомиссияНачисленная;
		
		ОпределитьНаличиеРасхождений(ЕстьРасхождения, МакетСтрокаСделки.Параметры, "ДатаОплатыКомиссииБрокераРасхождение","КоличествоРасхождение", "СуммаРасхождение", "КомиссияРасхождение", "КомиссияНачисленнаяРасхождение");
		
		ТабДок.Вывести(МакетСтрокаСделки);
		
	КонецЦикла;
	
	// исполнения
	МакетШапкаСделки.Параметры.ВидСделок = "Исполнения";
	ТабДок.Вывести(МакетШапкаСделки);
	
	Для каждого СтрокаСделки Из ТаблИсполнений Цикл
		
		ЗаполнитьЗначенияСвойств(МакетСтрокаСделки.Параметры, СтрокаСделки);
		
		МакетСтрокаСделки.Параметры.ВремяОперация         				 = Формат(СтрокаСделки.ВремяСделки, "ДЛФ=T") + " / " + Строка(СтрокаСделки.ВидСделки);
		МакетСтрокаСделки.Параметры.ДатаОплатыКомиссииБрокераРасхождение = ?(СтрокаСделки.БрокДатаОплатыКомиссииБрокера = СтрокаСделки.ДатаОплатыКомиссииБрокера, 0, "Расхождение");
		МакетСтрокаСделки.Параметры.КоличествоРасхождение 				 = СтрокаСделки.БрокКоличество - СтрокаСделки.Количество;
		МакетСтрокаСделки.Параметры.СуммаРасхождение      				 = СтрокаСделки.БрокСумма - СтрокаСделки.Сумма;
		МакетСтрокаСделки.Параметры.КомиссияРасхождение   				 = СтрокаСделки.БрокКомиссия - СтрокаСделки.Комиссия;
		МакетСтрокаСделки.Параметры.КомиссияНачисленнаяРасхождение		 = СтрокаСделки.БрокКомиссияНачисленная - СтрокаСделки.КомиссияНачисленная;
		
		ОпределитьНаличиеРасхождений(ЕстьРасхождения, МакетСтрокаСделки.Параметры, "ДатаОплатыКомиссииБрокераРасхождение", "КоличествоРасхождение", "СуммаРасхождение", "КомиссияРасхождение", "КомиссияНачисленнаяРасхождение");
		
		ТабДок.Вывести(МакетСтрокаСделки);
		
	КонецЦикла;
	
	Возврат ЕстьРасхождения;
	
КонецФункции // ЗаполнитьПротоколСверкиПоКлиенту

Процедура ЗагрузитьКомиссиюБрокераПоКлиенту(СчетДоверительногоУправления, Брокер, ДанныеБрокера) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Сделки = Новый ТаблицаЗначений;
	Сделки.Колонки.Добавить("БрокДатаОплатыКомиссииБрокера", Новый ОписаниеТипов("Дата"));
	Сделки.Колонки.Добавить("БрокНомСделки",  				 Метаданные.Документы.Сделка.Реквизиты.НомерСделки.Тип);
	Сделки.Колонки.Добавить("КомБрокера",		  			 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБиржи",		  				 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБрокераНачисл", 			 Новый ОписаниеТипов("Число"));
	Сделки.Колонки.Добавить("КомБиржиНачисл", 				 Новый ОписаниеТипов("Число"));
	
	Для каждого ДанныеБрокераСтрокаСделки Из ДанныеБрокера.Сделки Цикл
		ЗаполнитьЗначенияСвойств(Сделки.Добавить(), ДанныеБрокераСтрокаСделки);
	КонецЦикла;
	
	Для каждого ДанныеБрокераСтрокаИсполнения Из ДанныеБрокера.Исполнения Цикл
		ЗаполнитьЗначенияСвойств(Сделки.Добавить(), ДанныеБрокераСтрокаИсполнения);
	КонецЦикла;

	// удалим ранее созданные начисления и оплаты
	Запрос = Новый Запрос;
	Запрос.Текст =		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженности.Ссылка,
		|	МАКСИМУМ(НачислениеЗадолженностиОснования.НомерСтроки) КАК ВсегоСтроки,
		|	СУММА(ВЫБОР
		|			КОГДА НачислениеЗадолженностиОснования.Основание ССЫЛКА Документ.Сделка
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК УдаляемыеСтроки
		|ИЗ
		|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО НачислениеЗадолженностиОснования.Ссылка = НачислениеЗадолженности.Ссылка
		|ГДЕ
		|	НачислениеЗадолженности.Организация = &Организация
		|	И НачислениеЗадолженности.ВидЗадолженности = &ВидЗадолженности
		|	И НачислениеЗадолженности.Брокер = &Брокер
		|	И НачислениеЗадолженности.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НачислениеЗадолженности.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗадолженности.Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ОплатаОснования.Ссылка,
		|	МАКСИМУМ(ОплатаОснования.НомерСтроки),
		|	СУММА(ВЫБОР
		|			КОГДА ОплатаОснования.Основание ССЫЛКА Документ.Сделка
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ)
		|ИЗ
		|	Документ.Оплата.Основания КАК ОплатаОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|		ПО ОплатаОснования.Ссылка = Оплата.Ссылка
		|ГДЕ
		|	Оплата.Организация = &Организация
		|	И Оплата.ВидЗадолженности = &ВидЗадолженности
		|	И Оплата.Брокер = &Брокер
		|	И Оплата.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И Оплата.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатаОснования.Ссылка";
		
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Дата",                         ЭтотОбъект.ДатаСверки);
	Запрос.УстановитьПараметр("Брокер",                       Брокер);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидЗадолженности",             Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВсегоСтроки = Выборка.УдаляемыеСтроки Тогда
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		ИначеЕсли  Выборка.УдаляемыеСтроки <> 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Выборка.Ссылка + " не может быть удален, так как в нем присутствуют данные, не участвующие в автоматической загрузке", Выборка.ССылка,,);
		КонецЕсли;
	КонецЦикла;		
	
	// по сделкам должны быть созданы начисления в дату сделок
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиВнеш.БрокДатаОплатыКомиссииБрокера,
		|	СделкиВнеш.БрокНомСделки,
		|	СделкиВнеш.КомБрокераНачисл
		|ПОМЕСТИТЬ _СделкиВнеш
		|ИЗ
		|	&СделкиВнеш КАК СделкиВнеш
		|ГДЕ СделкиВнеш.КомБрокераНачисл <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.МестоХранения КАК МестоХранения,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	_СделкиВнеш.БрокДатаОплатыКомиссииБрокера КАК ДатаОплаты,
		|	_СделкиВнеш.БрокНомСделки КАК НомерСделки,
		|	_СделкиВнеш.КомБрокераНачисл КАК Сумма
		|ИЗ
		|	_СделкиВнеш КАК _СделкиВнеш
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _СделкиВнеш.БрокНомСделки = Сделка.НомерСделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО (СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка)
		|			И (СделкаЦенныеБумаги.НомерСтроки = 1)
		|ГДЕ
		|	Сделка.ПометкаУдаления = ЛОЖЬ
		|	И Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И Сделка.Брокер = &Брокер
		|	И Сделка.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	МестоХранения,
		|	СчетДоверительногоУправления";

	Запрос.УстановитьПараметр("СделкиВнеш",  					Сделки);
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер",                       	Брокер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекМестоХранения                = Неопределено;
	ТекСчетДоверительногоУправления = Неопределено;
	НачислениеЗадолженности                = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТекМестоХранения <> Выборка.МестоХранения
			Или ТекСчетДоверительногоУправления <> Выборка.СчетДоверительногоУправления
		Тогда
		
			Если Не ЗначениеЗаполнено(Выборка.Сделка) Тогда
				Сообщить("Пропущена комиссия по отсутствущей сделке № " + Выборка.НомерСделки);
				Продолжить;
			КонецЕсли;
		
			ТекМестоХранения                = Выборка.МестоХранения;
			ТекСчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			
			// запишем ранее созданные документы, если таковые были
			Если НачислениеЗадолженности <> Неопределено Тогда
				Если НачислениеЗадолженности.ПроверитьЗаполнение() Тогда
					Попытка
						НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
				Иначе
					НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЕсли;
			
			// создадим новое поступление
			НачислениеЗадолженности = Документы.НачислениеЗадолженности.СоздатьДокумент();
			
			НачислениеЗадолженности.Дата                         = ЭтотОбъект.ДатаСверки + 20*60*60;
			НачислениеЗадолженности.Организация                  = ЭтотОбъект.Организация;
			НачислениеЗадолженности.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии;
			НачислениеЗадолженности.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			НачислениеЗадолженности.МестоХранения                = Выборка.МестоХранения;
			НачислениеЗадолженности.Валюта                       = ЭтотОбъект.Организация.ВалютаУчета;
			НачислениеЗадолженности.Брокер                       = Брокер;
			НачислениеЗадолженности.Контрагент                   = Брокер.ЮрФизЛицо;
			НачислениеЗадолженности.Ответственный                = РаботаСПользователями.ТекущийПользователь();
			НачислениеЗадолженности.Комментарий                  = "Создан аппаратно-техническими средствами " + ТекущаяДата();
			
			НачислениеЗадолженности.ДатаПолученияДокумента		= НачислениеЗадолженности.Дата;

		КонецЕсли;
		
		// добавим строку в начисление
		НоваяСтрокаОснования = НачислениеЗадолженности.Основания.Добавить();
		
		НоваяСтрокаОснования.Основание    = Выборка.Сделка;
		НоваяСтрокаОснования.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		НоваяСтрокаОснования.ДатаОплаты   = Выборка.ДатаОплаты;
		НоваяСтрокаОснования.Сумма        = Выборка.Сумма;
		
	КонецЦикла;
	
	// запишем ранее созданные документы, если таковые были
	Если НачислениеЗадолженности <> Неопределено Тогда
		Если НачислениеЗадолженности.ПроверитьЗаполнение() Тогда
			Попытка
				НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		Иначе
			НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	// оплаты должны быть созданы по сделкам без отложенного исполнения в дату сделки
	// и по исполнениям в дату исполнения
	// по сделкам должны быть созданы начисления в дату сделок
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиВнеш.БрокНомСделки,
		|	СделкиВнеш.КомБрокера
		|ПОМЕСТИТЬ _СделкиВнеш
		|ИЗ
		|	&СделкиВнеш КАК СделкиВнеш
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.МестоХранения КАК МестоХранения,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	_СделкиВнеш.БрокНомСделки КАК НомерСделки,
		|	_СделкиВнеш.КомБрокера КАК Сумма
		|ПОМЕСТИТЬ _ОплатыКомиссииБрокера
		|ИЗ
		|	_СделкиВнеш КАК _СделкиВнеш
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ПО Сделка.Ссылка = СделкаЦенныеБумаги.Ссылка
		|		ПО _СделкиВнеш.БрокНомСделки = Сделка.НомерСделки
		|ГДЕ
		|	Сделка.ПометкаУдаления = ЛОЖЬ
		|	И _СделкиВнеш.КомБрокера <> 0
		|	И Сделка.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОплатыКомиссииБрокера.Сделка,
		|	_ОплатыКомиссииБрокера.МестоХранения,
		|	_ОплатыКомиссииБрокера.СчетДоверительногоУправления,
		|	_ОплатыКомиссииБрокера.ЦеннаяБумага,
		|	_ОплатыКомиссииБрокера.НомерСделки,
		|	_ОплатыКомиссииБрокера.Сумма
		|ИЗ
		|	_ОплатыКомиссииБрокера КАК _ОплатыКомиссииБрокера
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОплатыКомиссииБрокера.МестоХранения,
		|	_ОплатыКомиссииБрокера.СчетДоверительногоУправления";

	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);		
	Запрос.УстановитьПараметр("СделкиВнеш",		Сделки);

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекМестоХранения                = Неопределено;
	ТекСчетДоверительногоУправления = Неопределено;
	Оплата                          = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТекМестоХранения <> Выборка.МестоХранения
			Или ТекСчетДоверительногоУправления <> Выборка.СчетДоверительногоУправления
		Тогда
		
			Если Не ЗначениеЗаполнено(Выборка.Сделка) Тогда
				Сообщить("Пропущена оплата по отсутствущей сделке № " + Выборка.НомерСделки);
				Продолжить;
			КонецЕсли;
		
			ТекМестоХранения                = Выборка.МестоХранения;
			ТекСчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			
			// запишем ранее созданные документы, если таковые были
			Если Оплата <> Неопределено Тогда
				Если Оплата.ПроверитьЗаполнение() Тогда
					Попытка
						Оплата.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Оплата.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
				Иначе
					Оплата.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЕсли;
			
			// создадим новое поступление
			Оплата = Документы.Оплата.СоздатьДокумент();
			
			Оплата.Дата                         = ЭтотОбъект.ДатаСверки + 20*60*60 + 1;
			Оплата.Организация                  = ЭтотОбъект.Организация;
			Оплата.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии;
			Оплата.ВидДвижения                  = Перечисления.ВидыДвижений.Расход;
			Оплата.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
			Оплата.МестоХранения                = Выборка.МестоХранения;
			Оплата.ВалютаОплаты                 = ЭтотОбъект.Организация.ВалютаУчета;
			Оплата.Брокер                       = Брокер;
			Оплата.Контрагент 					= Брокер.ЮрФизЛицо;
			Оплата.Ответственный                = РаботаСПользователями.ТекущийПользователь();
			Оплата.Комментарий                  = "Создан аппаратно-техническими средствами " + ТекущаяДата();

		КонецЕсли;
		
		// добавим строку в начисление
		НоваяСтрокаОснования = Оплата.Основания.Добавить();
		
		НоваяСтрокаОснования.Основание  = Выборка.Сделка;
		НоваяСтрокаОснования.Валюта     = Оплата.ВалютаОплаты;
		НоваяСтрокаОснования.Сумма      = Выборка.Сумма;
		
	КонецЦикла;
	
	// запишем ранее созданные документы, если таковые были
	Если Оплата <> Неопределено Тогда
		Если Оплата.ПроверитьЗаполнение() Тогда
			Попытка
				Оплата.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Оплата.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		Иначе
			Оплата.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
