#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НеПрочитыватьДвижения", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(РезультатВыбора, ФормаВыбора)
	
	Если РезультатВыбора <> Неопределено Тогда 
		
		УдалитьДвиженияДокументаНаСервере();
		
		ОтобранныеРегистры = ПолучитьРегистрыСДвижениями(РезультатВыбора, ЭтаФорма.ДелатьСторно);
		Если ОтобранныеРегистры.Количество() > 1 Тогда
			ОтобранныеРегистры.ОтметитьЭлементы("Укажите регистры для заполнения документа");
		КонецЕсли; //если регистр один - глупые вопросы задавать не будем	
		
		ЗаполнитьИзДокументаНаСервере(РезультатВыбора, ОтобранныеРегистры);		
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьНадоПроверятьПериод(ЭтаФорма);
	
	Если Не ТребуетсяИзменениеДатДвиженийНаСервере() Тогда
		Возврат;
	КонецЕсли;
	
	// Установка нового периода для движений
	РезультатВопроса = Вопрос("Установить новую дату для всех движений?",
		?(ЭтаФорма.НадоПроверятьПериод, РежимДиалогаВопрос.ОКОтмена, РежимДиалогаВопрос.ДаНет));
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Или РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		УстановитьДатуДокументаВДвиженияхНаСервере();
	ИначеЕсли ЭтаФорма.НадоПроверятьПериод Тогда
		Объект.Дата = ЭтаФорма.ДатаПоследнееЗначение;
	КонецЕсли;
	
	ЭтаФорма.ДатаПоследнееЗначение = Объект.Дата;
	
	// Необходимо при повторном изменении даты
	ОбновитьНадоПроверятьПериод(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхОстатковПриИзменении(Элемент)
	// Изменение необходимости проверки периода
	ОбновитьНадоПроверятьПериод(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
// Подключаемый обработчик события "ПриНачалеРедактирования" таблицы формы
Процедура Подключаемый_ТаблицаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период                       = Объект.Дата;
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, Объект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаНастройкаСоставаРегистров(Команда)

	СписокИспользуемыхРегистров = Новый СписокЗначений;

	Для Каждого Строка Из Объект.ТаблицаРегистров Цикл
		СписокИспользуемыхРегистров.Добавить(Строка.Имя);
	КонецЦикла;

	Результат = ОткрытьФормуМодально("Документ.КорректировкаРегистров.Форма.ФормаВыбораРегистра",
				Новый Структура("СписокИспользуемыхРегистров", СписокИспользуемыхРегистров));

	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда

		ОбработатьИзменениеРегистровНаСервере(Результат);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьУсреднениеПартий(Команда)
	
	ПараметрыФормы = Новый Структура("Организация,Дата", Объект.Организация, Объект.Дата);
	
	УсредненныеПартии = ОткрытьФормуМодально("Документ.КорректировкаРегистров.Форма.ФормаУсредненияПартий", ПараметрыФормы, ЭтаФорма);
	
	Если УсредненныеПартии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаУсредненныеПартии Из УсредненныеПартии Цикл
		
		СтрокаДвижений = Объект.Движения.БухПартииЦенныхБумаг.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаУсредненныеПартии);
		
		СтрокаДвижений.Активность = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзДокумента(Команда)

	ЭтаФорма.ДелатьСторно = Ложь;
	
	ЗаполнитьИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзДокументаСоСторно(Команда)
	
	ЭтаФорма.ДелатьСторно = Истина;
	
	ЗаполнитьИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаменаБухгалтерскогоСчета(Команда)
	
	ДанныеЗамены = ОткрытьФормуМодально("Документ.КорректировкаРегистров.Форма.ФормаЗаменыСчета", , ЭтаФорма);
	Если ТипЗнч(ДанныеЗамены) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ЗаменаБухгалтерскогоСчетаНаСервере(ДанныеЗамены);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРезервПодОбесценение(Команда)
	
	ПараметрыФормы = Новый Структура("Организация,Дата,СчетДоверительногоУправления", Объект.Организация, Объект.Дата, Объект.СчетДоверительногоУправления);
		
	СтруктураОтбор = ОткрытьФормуМодально("Документ.КорректировкаРегистров.Форма.ФормаРезерваПодОбесценение", ПараметрыФормы, ЭтаФорма);
	Если ТипЗнч(СтруктураОтбор) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьОбесценениеНаСервере(СтруктураОтбор);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьОстаткиПоБумаге(Команда)
	
	ПараметрыФормы = Новый Структура("Организация, Период, СчетДоверительногоУправления", Объект.Организация, Объект.Дата, Объект.СчетДоверительногоУправления);
	
	Партии = ОткрытьФормуМодально("Документ.КорректировкаРегистров.Форма.ФормаОстаткиПартий", ПараметрыФормы, ЭтаФорма);
	
	Если Партии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаПартии Из Партии Цикл
		ЗаполнитьЗначенияСвойств(Объект.Движения.БухПартииЦенныхБумаг.Добавить(), СтрокаПартии);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьРегистрыСДвижениями(ДокументДонор, ДелатьСторно)
	
	ОтобранныеРегистры = Новый СписокЗначений;
	
	Движения = ДокументДонор.ПолучитьОбъект().Движения;
	
	Для Каждого НаборЗаписейРегистра Из Движения Цикл
		
		НаборЗаписейРегистра.Прочитать();
		Для Каждого ЗаписьНабора Из НаборЗаписейРегистра Цикл 
			МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(ЗаписьНабора)); 
			
			Если Метаданные.РегистрыНакопления.Найти(МетаданныеРегистра.Имя) <> Неопределено Тогда				
				ЗаписиРегистра = РегистрыНакопления[МетаданныеРегистра.Имя].ВыбратьПоРегистратору(ДокументДонор);					
			ИначеЕсли Метаданные.РегистрыСведений.Найти(МетаданныеРегистра.Имя) <> Неопределено Тогда	
				Если Не ДелатьСторно Тогда 
					ЗаписиРегистра = РегистрыСведений[МетаданныеРегистра.Имя].ВыбратьПоРегистратору(ДокументДонор);		
				Иначе
					ЗаписиРегистра = Неопределено; // для регистра сведений сторно не имеет смысла
				КонецЕсли;	
			ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(МетаданныеРегистра.Имя) <> Неопределено Тогда	
				ЗаписиРегистра = РегистрыБухгалтерии[МетаданныеРегистра.Имя].ВыбратьПоРегистратору(ДокументДонор);	
			КонецЕсли;		
		
			Если ЗаписиРегистра = Неопределено Тогда 
				Продолжить;
			КонецЕсли;	
		
			Пока ЗаписиРегистра.Следующий() Цикл 
				ОтобранныеРегистры.Добавить(МетаданныеРегистра.Имя, МетаданныеРегистра.Представление(), Истина);
				Прервать;
			КонецЦикла;
			Прервать;
			
		КонецЦикла;
	КонецЦикла;	
	
	Возврат ОтобранныеРегистры;
	
КонецФункции	

&НаСервереБезКонтекста
Функция СписокВидовДокументов()
	
	//возвращаем список документов, у которых есть движения
	
	Рез = Новый СписокЗначений;
	
	Для Каждого МетаДок из Метаданные.Документы Цикл 
		
		ДвиженияДокумента = МетаДок.Движения;
		Если ДвиженияДокумента.Количество() > 0 Тогда 		
			Рез.Добавить(МетаДок.Имя, МетаДок.ПредставлениеСписка);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Рез;
	
КонецФункции	

&НаСервереБезКонтекста
Функция РегистрСведенийИмеетПолеПериод(РегистрМД)
	
	Возврат (РегистрМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
	
КонецФункции // РегистрСведенийИмеетПолеПериод

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтаФорма.ДатаНачалаНеобходимостиПроверкиПериода) Тогда
		ЭтаФорма.ДатаНачалаНеобходимостиПроверкиПериода = Документы.КорректировкаРегистров.ПолучитьДатуНачалаНеобходимостиПроверкиПериода();
	КонецЕсли;
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	НастроитьВидимостьИДоступность(ЭтаФорма);
	ПоказатьРегистрыНаСервере();
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ДатаПоследнееЗначение = Объект.Дата;
	ЭтаФорма.Параметры.Свойство("ЗначениеКопирования", ЭтаФорма.ЗначениеКопирования);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	ОбновитьНадоПроверятьПериод(Форма);
КонецПроцедуры

&НаСервере
Функция СоздатьСтраницуНаСервере(ИмяСтраницы, Заголовок, Родитель)

	НовыйЭлемент = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Родитель);
	НовыйЭлемент.Вид                      = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок                = Заголовок;
	НовыйЭлемент.РастягиватьПоВертикали   = Истина;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;

	Возврат НовыйЭлемент;

КонецФункции

&НаСервере
Функция ПолучитьИмяСтраницыРегистраНаСервере(ИмяРегистра)
	Возврат "Страница" + ИмяРегистра;
КонецФункции

&НаСервере
Процедура УдалитьСтраницуРегистраНаСервере(ИмяРегистра)
	НайденныйЭлемент = Элементы.Найти(ПолучитьИмяСтраницыРегистраНаСервере(ИмяРегистра));
	Если НайденныйЭлемент <> Неопределено Тогда
		Элементы.Удалить(НайденныйЭлемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьСвязиПараметровВыбораНаСервере(ИсходныйМассив, ПутьКДанным)

	НовыйМассив = Новый Массив;
	
	Для Каждого Элемент Из ИсходныйМассив Цикл
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора(Элемент.Имя, ПутьКДанным + "." + Элемент.ПутьКДанным, Элемент.ИзменениеЗначения));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(НовыйМассив);

КонецФункции

&НаСервере
Функция СоздатьТаблицуФормыРегистраНаСервере(ИмяРегистра, КолонкиТаблицы, Родитель)
	ТаблицаФормы = Элементы.Добавить("ТаблицаДвижений" + ИмяРегистра, Тип("ТаблицаФормы"), Родитель);
	ТаблицаФормы.ПутьКДанным = "Объект.Движения." + ИмяРегистра;
	Родитель.ПутьКДаннымЗаголовка = ТаблицаФормы.ПутьКДанным + ".КоличествоСтрок";
	// Добавление полей колонок таблицы
	МассивДобавленныхПолей = Новый Массив;
	Для Каждого Колонка Из КолонкиТаблицы Цикл
		ПолеФормы = Элементы.Добавить(ТаблицаФормы.Имя + Колонка.Имя, Тип("ПолеФормы"), ТаблицаФормы);
		ПолеФормы.ПутьКДанным = ТаблицаФормы.ПутьКДанным + "." + Колонка.Имя;
		ПолеФормы.Заголовок   = Колонка.Заголовок;
		ПолеФормы.Вид         = ВидПоляФормы.ПолеВвода;
		Если ЭтаФорма.НадоПроверятьПериод И Колонка.Имя = "Период" Тогда
			ПолеФормы.ТолькоПросмотр = Истина;
		КонецЕсли;
		МассивДобавленныхПолей.Добавить(ПолеФормы);
	КонецЦикла;
	Счетчик = 0;
	Для Каждого ПолеФормы Из МассивДобавленныхПолей Цикл
		Если КолонкиТаблицы[Счетчик].СвязиПараметровВыбора <> Неопределено И КолонкиТаблицы[Счетчик].СвязиПараметровВыбора.Количество() > 0 Тогда
			ПолеФормы.СвязиПараметровВыбора = СоздатьСвязиПараметровВыбораНаСервере(
				КолонкиТаблицы[Счетчик].СвязиПараметровВыбора,
				"Элементы." + ТаблицаФормы.Имя + ".ТекущиеДанные");
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат ТаблицаФормы;
КонецФункции

&НаСервере
Функция СоздатьМассивПолейРегистраНаСервере(МенеджерРегистра, МетаданныеРегистра)

	ТаблицаРегистра = МенеджерРегистра.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	ТаблицаРегистра.Колонки.Удалить("Регистратор");
	
	Если ТаблицаРегистра.Колонки.Найти("МоментВремени") <> Неопределено Тогда
		ТаблицаРегистра.Колонки.Удалить("МоментВремени");
	КонецЕсли;

	Если Найти(МетаданныеРегистра.ПолноеИмя(), "РегистрБухгалтерии") = 1 Тогда
		Для Инд = 1 По МетаданныеРегистра.ПланСчетов.МаксКоличествоСубконто Цикл
			ТаблицаРегистра.Колонки.Удалить("ВидСубконтоДт" + Инд);
			ТаблицаРегистра.Колонки.Удалить("ВидСубконтоКт" + Инд);
		КонецЦикла;
	КонецЕсли;
	
	МассивКолонок = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаРегистра.Колонки Цикл
		ИнформацияОКолонке = Новый Структура("Имя, Заголовок, СвязиПараметровВыбора", Колонка.Имя);
		МассивКолонок.Добавить(ИнформацияОКолонке);
	КонецЦикла;

	// Обновление заголовков колонок таблицы по синонимам полей регистра.
	МассивПолейРегистра = Новый Массив;
	МассивПолейРегистра.Добавить("Измерения");
	МассивПолейРегистра.Добавить("Ресурсы");
	МассивПолейРегистра.Добавить("Реквизиты");

	Для Каждого ВидПоля Из МассивПолейРегистра Цикл
		Для Каждого Поле Из МетаданныеРегистра[ВидПоля] Цикл
			Для Каждого ЭлементМассива Из МассивКолонок Цикл
				Если ЭлементМассива.Имя = Поле.Имя Тогда
					ЭлементМассива.Заголовок             = Поле.Синоним;
					ЭлементМассива.СвязиПараметровВыбора = Поле.СвязиПараметровВыбора;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Возврат МассивКолонок;

КонецФункции

&НаСервере
Процедура ПоказатьТаблицуРегистраНаСтраницеНаСервере(Знач СтрокаТЧ)
	Если СтрокаТЧ.ТипРегистра = "РегистрНакопления" Тогда
		СтраницаРегистра       = Элементы.НастройкаРегистровНакопления;
		МенеджерРегистра       = РегистрыНакопления[СтрокаТЧ.Имя];
		МетаданныеРегистра     = Метаданные.РегистрыНакопления[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод = Истина;
	ИначеЕсли СтрокаТЧ.ТипРегистра = "РегистрСведений" Тогда
		СтраницаРегистра       = Элементы.НастройкаРегистровСведений;
		МенеджерРегистра       = РегистрыСведений[СтрокаТЧ.Имя];
		МетаданныеРегистра     = Метаданные.РегистрыСведений[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод = РегистрСведенийИмеетПолеПериод(МетаданныеРегистра);
	ИначеЕсли СтрокаТЧ.ТипРегистра = "РегистрБухгалтерии" Тогда
		СтраницаРегистра       = Элементы.НастройкаРегистровБухгалтерии;
		МенеджерРегистра       = РегистрыБухгалтерии[СтрокаТЧ.Имя];
		МетаданныеРегистра     = Метаданные.РегистрыБухгалтерии[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	СтраницаДляРегистра = СоздатьСтраницуНаСервере(ПолучитьИмяСтраницыРегистраНаСервере(СтрокаТЧ.Имя), МетаданныеРегистра.Синоним, СтраницаРегистра);
	МассивКолонок = СоздатьМассивПолейРегистраНаСервере(МенеджерРегистра, МетаданныеРегистра);
	ТаблицаФормы = СоздатьТаблицуФормыРегистраНаСервере(СтрокаТЧ.Имя, МассивКолонок, СтраницаДляРегистра);
	Если РегистрИмеетПолеПериод Тогда
		ТаблицаФормы.УстановитьДействие("ПриНачалеРедактирования", "Подключаемый_ТаблицаПриНачалеРедактирования");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьРегистрыНаСервере()
	// Заполнение типов регистров по данным движений
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	Для Каждого НаборДвижений Из ОбъектЗначение.Движения Цикл
		Если НаборДвижений.Количество() > 0 Тогда
			ИмяРегистра = НаборДвижений.Метаданные().Имя;
			НайденныеСтроки = Объект.ТаблицаРегистров.НайтиСтроки(Новый Структура("Имя", ИмяРегистра));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ТипРегистра = ПолучитьТипРегистраПоИмениНаСервере(НайденнаяСтрока.Имя);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение типов регистров по именам используемых регистров
	Для Каждого СтрокаТаблицыРегистров Из Объект.ТаблицаРегистров Цикл
		Если ПустаяСтрока(СтрокаТаблицыРегистров.ТипРегистра) Тогда
			СтрокаТаблицыРегистров.ТипРегистра = ПолучитьТипРегистраПоИмениНаСервере(СтрокаТаблицыРегистров.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Вывод регистра на страницу формы
	Для Каждого СтрокаТаблицыРегистров Из Объект.ТаблицаРегистров Цикл
		Если Элементы.Найти(ПолучитьИмяСтраницыРегистраНаСервере(СтрокаТаблицыРегистров.Имя)) <> Неопределено Тогда // Страница уже была создана и всё ещё актуальна
			Продолжить;
		КонецЕсли;
		ПоказатьТаблицуРегистраНаСтраницеНаСервере(СтрокаТаблицыРегистров);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРегистровНаСервере(СписокРегистров)
	Для Каждого Элемент Из СписокРегистров Цикл
		Если Элемент.Пометка Тогда
			СтрокаТЧ = Объект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя = Элемент.Значение;
			СтрокаТЧ.ТипРегистра = ПолучитьТипРегистраПоИмениНаСервере(СтрокаТЧ.Имя);
			ПоказатьТаблицуРегистраНаСтраницеНаСервере(СтрокаТЧ);
		Иначе
			Для Каждого Строка Из Объект.ТаблицаРегистров.НайтиСтроки(Новый Структура("Имя", Элемент.Значение)) Цикл
				Объект.ТаблицаРегистров.Удалить(Строка);
			КонецЦикла;
			Объект.Движения[Элемент.Значение].Очистить();
			УдалитьСтраницуРегистраНаСервере(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзДокументаНаСервере(ДокументДонор, ОтобранныеРегистры)
	Для Каждого ТекущийРегистр из ОтобранныеРегистры Цикл
		Если ТекущийРегистр.Пометка Тогда
			РегистрИмя = ТекущийРегистр.Значение;
			НовыйРегистр = Объект.ТаблицаРегистров.Добавить();
			НовыйРегистр.Имя = РегистрИмя;
			НовыйРегистр.ТипРегистра = ПолучитьТипРегистраПоИмениНаСервере(НовыйРегистр.Имя);
			ЭтоБухРегистр = Ложь; ЕстьПериод = Истина; ЕстьРегистратор = Истина;
			// Поиск метаданных
			Если Метаданные.РегистрыСведений.Найти(РегистрИмя) <> Неопределено Тогда
				ЗаписиРегистра = РегистрыСведений[РегистрИмя].ВыбратьПоРегистратору(ДокументДонор);
				Ресурсы = Неопределено;
				Если Метаданные.РегистрыСведений[РегистрИмя].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
					ЕстьПериод = Ложь;
				КонецЕсли;
				Если Метаданные.РегистрыСведений[РегистрИмя].РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
					ЕстьРегистратор = Ложь;
				КонецЕсли;
			ИначеЕсли Метаданные.РегистрыНакопления.Найти(РегистрИмя) <> Неопределено Тогда
				ЗаписиРегистра = РегистрыНакопления[РегистрИмя].ВыбратьПоРегистратору(ДокументДонор);
				Ресурсы = Метаданные.РегистрыНакопления.Найти(РегистрИмя).Ресурсы;
			ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(РегистрИмя) <> Неопределено Тогда
				ЗаписиРегистра = РегистрыБухгалтерии[РегистрИмя].ВыбратьПоРегистратору(ДокументДонор);
				Ресурсы = Метаданные.РегистрыБухгалтерии.Найти(РегистрИмя).Ресурсы;
				ЭтоБухРегистр = Истина;
			КонецЕсли;
			// Локальное исправление записей
			Пока ЗаписиРегистра.Следующий() Цикл
				СтрокаДвижений = Объект.Движения[РегистрИмя].Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений, ЗаписиРегистра);
				СтрокаДвижений.Активность = Истина;
				Если ЕстьПериод Тогда
					СтрокаДвижений.Период = Объект.Дата;
				КонецЕсли;
				Если ЕстьРегистратор Тогда
					СтрокаДвижений.Регистратор = Объект.Ссылка;
				КонецЕсли;
				Если ЭтоБухРегистр Тогда
					Для Индекс = 0 По ЗаписиРегистра.СчетДт.ВидыСубконто.Количество() - 1 Цикл
						СтрокаДвижений["СубконтоДт" + (Индекс + 1)] = ЗаписиРегистра.СубконтоДт[ЗаписиРегистра.СчетДт.ВидыСубконто[Индекс].ВидСубконто];
					КонецЦикла;
					Для Индекс = 0 По ЗаписиРегистра.СчетКт.ВидыСубконто.Количество() - 1 Цикл
						СтрокаДвижений["СубконтоКт" + (Индекс + 1)] = ЗаписиРегистра.СубконтоКт[ЗаписиРегистра.СчетКт.ВидыСубконто[Индекс].ВидСубконто];
					КонецЦикла;
				КонецЕсли;
				Если ЭтаФорма.ДелатьСторно Тогда
					Если Ресурсы <> Неопределено Тогда
						Для Каждого Ресурс из Ресурсы Цикл
							Если ЭтоБухРегистр Тогда
								Если Ресурс.Балансовый = 1 Тогда
									СтрокаДвижений[Ресурс.Имя] = -СтрокаДвижений[Ресурс.Имя];
								Иначе
									// Ресурс.Имя = "Количество"; Ресурс.ПризнакУчета.Имя = "Количественный"
									// Если по счету ведется учет по данному ресурсу, тогда...
									Если СтрокаДвижений.СчетДт[Ресурс.ПризнакУчета.Имя] Тогда
										СтрокаДвижений[Ресурс.Имя + "Дт"] = -СтрокаДвижений[Ресурс.Имя + "Дт"];
									КонецЕсли;
									Если СтрокаДвижений.СчетКт[Ресурс.ПризнакУчета.Имя] Тогда
										СтрокаДвижений[Ресурс.Имя + "Кт"] = -СтрокаДвижений[Ресурс.Имя + "Кт"];
									КонецЕсли;
								КонецЕсли;
							Иначе
								СтрокаДвижений[Ресурс.Имя] = -СтрокаДвижений[Ресурс.Имя];
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		 КонецЕсли;
	КонецЦикла;
	ПоказатьРегистрыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьДвиженияДокументаНаСервере()
	
	
	Движения = Объект.Движения;
	
	Для Каждого СтрокаТЧ из Объект.ТаблицаРегистров Цикл 
		
		Данные = Объект.Движения[СтрокаТЧ.Имя];
		Данные.Очистить();
		
	КонецЦикла;	
		
	Объект.ТаблицаРегистров.Очистить();	
	ПоказатьРегистрыНаСервере();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОбесценениеНаСервере(СтруктураОтбор)

	Запрос = Новый Запрос();
	Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупона
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаЗапроса,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = &ВидУчета
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК БухПартииЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("ДатаЗапроса",СтруктураОтбор.Дата);
	Запрос.УстановитьПараметр("Организация",СтруктураОтбор.Организация);
	Запрос.УстановитьПараметр("ВидУчета",СтруктураОтбор.ВидУчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",СтруктураОтбор.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", СтруктураОтбор.ЦеннаяБумага);
	
	ТаблицаПартий = Запрос.Выполнить().Выгрузить();
	ОбщееКоличество = ТаблицаПартий.Итог("Количество");
	ЦенаНаОднуЦб = СтруктураОтбор.Сумма/ОбщееКоличество;     
	КупонНаОднуЦб = СтруктураОтбор.СуммаКупона/ОбщееКоличество;
	
	Погрешность = 0; ПогрешностьКупон = 0;  //погрешности округления быть не должно, т.к. сумма кратна количеству. Но на всякий случай
	Для Каждого СтрокаТаблицыПартий из ТаблицаПартий Цикл 
		ТекСумма = ЦенаНаОднуЦб*СтрокаТаблицыПартий.Количество + Погрешность;
		ТекСуммаКупона = КупонНаОднуЦб*СтрокаТаблицыПартий.Количество + ПогрешностьКупон;
		
		СтрокаТаблицыПартий.СуммаРезервовПодОбесценение = Окр(ТекСумма, 2);
		СтрокаТаблицыПартий.СуммаРезервовПодОбесценениеКупона = Окр(ТекСуммаКупона, 2);
		СтрокаТаблицыПартий.Количество = 0;
		
		Погрешность = ТекСумма - Окр(ТекСумма, 2);
		ПогрешностьКупон = ТекСуммаКупона - Окр(ТекСуммаКупона, 2);
		
	КонецЦикла;	
	
	Для Каждого СтрокаТаблицыПартий ИЗ ТаблицаПартий Цикл 
	 	СтрокаДвижений = Объект.Движения.БухПартииЦенныхБумаг.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаТаблицыПартий);
		СтрокаДвижений.Период = СтруктураОтбор.Дата;		
		СтрокаДвижений.Активность = Истина;
	КонецЦикла;	
		
КонецПроцедуры	

&НаСервере
Процедура ЗаменаБухгалтерскогоСчетаНаСервере(ДанныеЗамены)
	
	Для каждого СтрокаДвижения Из Объект.Движения.ЕдиныйБухгалтерскийУчет Цикл
	
		Если СтрокаДвижения.СчетДт = ДанныеЗамены.СчетЗаменить Тогда
		
			СтрокаДвижения.СчетДт = ДанныеЗамены.СчетЗаменитьНа;
			
			Для Инд = 1 По ДанныеЗамены.Количество() - 2 Цикл
				СтрокаДвижения["СубконтоДт" + Строка(Инд)] = ДанныеЗамены["Субконто" + Строка(Инд)];
			КонецЦикла;
			
			Если СтрокаДвижения.СчетДт.Валютный Тогда
				Если (СтрокаДвижения.ВалютнаяСуммаДт = 0) ИЛИ (СтрокаДвижения.ВалютнаяСуммаДт = NULL) Тогда
					СтрокаДвижения.ВалютаДт = СтрокаДвижения.ВалютаКт;
					СтрокаДвижения.ВалютнаяСуммаДт = СтрокаДвижения.ВалютнаяСуммаКт;
				КонецЕсли;
			Иначе
				Если СтрокаДвижения.ВалютнаяСуммаДт <> 0 Тогда
					СтрокаДвижения.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
					СтрокаДвижения.ВалютнаяСуммаДт = 0;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
		
		Если СтрокаДвижения.СчетКт = ДанныеЗамены.СчетЗаменить Тогда
		
			СтрокаДвижения.СчетКт = ДанныеЗамены.СчетЗаменитьНа;
			
			Для Инд = 1 По ДанныеЗамены.Количество() - 2 Цикл
				СтрокаДвижения["СубконтоКт" + Строка(Инд)] = ДанныеЗамены["Субконто" + Строка(Инд)];
			КонецЦикла;
			
			Если СтрокаДвижения.СчетКт.Валютный Тогда
				Если (СтрокаДвижения.ВалютнаяСуммаКт = 0) ИЛИ (СтрокаДвижения.ВалютнаяСуммаКт = NULL) Тогда
					СтрокаДвижения.ВалютаКт = СтрокаДвижения.ВалютаДт;
					СтрокаДвижения.ВалютнаяСуммаКт = СтрокаДвижения.ВалютнаяСуммаДт;
				КонецЕсли;
			Иначе
				Если СтрокаДвижения.ВалютнаяСуммаКт <> 0 Тогда
					СтрокаДвижения.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
					СтрокаДвижения.ВалютнаяСуммаКт = 0;
				КонецЕсли;
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуДокументаВДвиженияхНаСервере()
	Для Каждого СтрокаТаблицаРегистров Из Объект.ТаблицаРегистров Цикл
		// Для регистров сведений необходимо проверить, что периодичность — дата
		МетаданныеРегистра = Метаданные.РегистрыСведений.Найти(СтрокаТаблицаРегистров.Имя);
		Если МетаданныеРегистра <> Неопределено И Не РегистрСведенийИмеетПолеПериод(МетаданныеРегистра) Тогда
			Продолжить;
		КонецЕсли;
		// Заполнение периода в регистре
		Для Каждого Движение Из Объект.Движения[СтрокаТаблицаРегистров.Имя] Цикл
			Движение.Период = Объект.Дата;
		КонецЦикла;
		ЭтаФорма.Модифицированность = Истина;
	КонецЦикла;
КонецПроцедуры // УстановитьДатуДокументаВДвиженияхНаСервере

&НаСервере
Функция ТребуетсяИзменениеДатДвиженийНаСервере()
	
	Если Объект.ТаблицаРегистров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого СтрокаТаблицаРегистров Из Объект.ТаблицаРегистров Цикл
		
		НоваяДатаДвижений = Объект.Дата;
		
		// для регистров сведений период может быть переопределен, в зависимости от настроек периодичности
		РегистрСведенийМД = Метаданные.РегистрыСведений.Найти(СтрокаТаблицаРегистров.Имя);
		
		Если РегистрСведенийМД <> Неопределено Тогда
			Если      Не РегистрСведенийИмеетПолеПериод(РегистрСведенийМД) Тогда
				Продолжить;
			ИначеЕсли РегистрСведенийМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Год Тогда
				НоваяДатаДвижений = НачалоГода(НоваяДатаДвижений);
			ИначеЕсли РегистрСведенийМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Квартал Тогда
				НоваяДатаДвижений = НачалоКвартала(НоваяДатаДвижений);
			ИначеЕсли РегистрСведенийМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Месяц Тогда
				НоваяДатаДвижений = НачалоМесяца(НоваяДатаДвижений);
			ИначеЕсли РегистрСведенийМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.День Тогда
				НоваяДатаДвижений = НачалоДня(НоваяДатаДвижений);
			КонецЕсли;
		КонецЕсли;		
		
		// одного предента вполне достаточно
		Для каждого Движение Из Объект.Движения[СтрокаТаблицаРегистров.Имя] Цикл
			Если Движение.Период <> НоваяДатаДвижений Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ТребуетсяИзменениеДатДвиженийНаСервере

&НаКлиенте
Процедура ЗаполнитьИзДокумента()
	
	Ответ = Вопрос("Существующие движения документа будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет, 30);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
    	Возврат;
	КонецЕсли;
	
	СписокВидов = СписокВидовДокументов();
	
	ВыбранныйВид = СписокВидов.ВыбратьЭлемент("Укажите вид документа");
	Если ВыбранныйВид <> Неопределено Тогда 
		
		ПараметрыЖурнала = Новый Структура;
		Отбор = Новый Структура;
		
		Отбор.Вставить("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
		ПараметрыЖурнала.Вставить("Отбор", Отбор);		
		
		ФормаЖурнала = ПолучитьФорму("Документ." + ВыбранныйВид.Значение + ".ФормаВыбора", ПараметрыЖурнала, ЭтаФорма);
		ФормаЖурнала.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ФормаЖурнала.Открыть();
	КонецЕСли;			
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадоПроверятьПериод(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	// Изменение необходимости проверки периода
	Форма.НадоПроверятьПериод = НачалоДня(Объект.Дата) >= Форма.ДатаНачалаНеобходимостиПроверкиПериода И Не Объект.ВводНачальныхОстатков;
	
	Если НачалоДня(Объект.Дата) >= Форма.ДатаНачалаНеобходимостиПроверкиПериода Тогда
		Элементы.ВводНачальныхОстатков.ТолькоПросмотр = Ложь;
		Элементы.ВводНачальныхОстатков.Подсказка = "";
	Иначе // "Форма.НадоПроверятьПериод" здесь Ложь
		Объект.ВводНачальныхОстатков = Истина;
		Элементы.ВводНачальныхОстатков.ТолькоПросмотр = Истина;
		Элементы.ВводНачальныхОстатков.Подсказка =
			"Изменение значения недоступно из-за давней даты документа.
			|Проверка периода записей регистров сведений отключена.";
	КонецЕсли;
	
	Для Каждого СтрокаРегистров Из Объект.ТаблицаРегистров Цикл
		ЭлементКолонкиПериод = Элементы.Найти("ТаблицаДвижений" + СтрокаРегистров.Имя + "Период");
		Если ЭлементКолонкиПериод = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементКолонкиПериод.ТолькоПросмотр = СтрокаРегистров.ТипРегистра <> "РегистрСведений" Или Форма.НадоПроверятьПериод;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипРегистраПоИмениНаСервере(ИмяРегистра)
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра) <> Неопределено Тогда
		Возврат "РегистрСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Найти(ИмяРегистра) <> Неопределено Тогда
		Возврат "РегистрНакопления";
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(ИмяРегистра) <> Неопределено Тогда
		Возврат "РегистрБухгалтерии";
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(ЭтаФорма.ЗначениеКопирования) Тогда
		Если Вопрос("Перенести движения?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
			ОтобранныеРегистры = ПолучитьРегистрыСДвижениями(ЭтаФорма.ЗначениеКопирования, ЭтаФорма.ДелатьСторно);
			ОтобранныеРегистры.ЗаполнитьПометки(Истина);
			ЗаполнитьИзДокументаНаСервере(ЭтаФорма.ЗначениеКопирования, ОтобранныеРегистры);		
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти