
Функция ПолучитьУправляющуюКомпаниюПоЮрФизЛицу(ЮрФизЛицо) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЮрФизЛица.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ _ЮрФизЛица
	|ИЗ
	|	Справочник.ЮрФизЛица КАК ЮрФизЛица
	|ГДЕ
	|	ЮрФизЛица.Ссылка = &ЮрФизЛицо
	|	И НЕ ЮрФизЛица.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо
	|ИЗ
	|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
	|			&Период,
	|			ЮридическоеЛицо = &ЮрФизЛицо
	|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
	|ГДЕ
	|	СвязанныеЮридическиеЛицаСрезПоследних.Действует
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УправляющиеКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УправляющиеКомпании КАК УправляющиеКомпании
	|ГДЕ
	|	УправляющиеКомпании.ЮрФизЛицо В
	|			(ВЫБРАТЬ
	|				_ЮрФизЛица.Ссылка
	|			ИЗ
	|				_ЮрФизЛица КАК _ЮрФизЛица)
	|	И НЕ УправляющиеКомпании.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ЮрФизЛицо",	ЮрФизЛицо);
	Запрос.УстановитьПараметр("Период",		ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивРезультата = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивРезультата.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Если МассивРезультата.Количество() = 0 Тогда
		МассивРезультата.Добавить(Справочники.УправляющиеКомпании.ПустаяСсылка());
	КонецЕсли;
	
	Возврат МассивРезультата; 	

КонецФункции

Функция ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Период, ЮрФизЛицо, ТолькоСформированныеПИФ = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЮрФизЛица.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ _ЮрФизЛица
	|ИЗ
	|	Справочник.ЮрФизЛица КАК ЮрФизЛица
	|ГДЕ
	|	ЮрФизЛица.Ссылка = &ЮрФизЛицо
	|	И НЕ ЮрФизЛица.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо
	|ИЗ
	|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
	|			&Период,
	|			ЮридическоеЛицо = &ЮрФизЛицо
	|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
	|ГДЕ
	|	СвязанныеЮридическиеЛицаСрезПоследних.Действует
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд КАК Ссылка,
	|	ЗначенияДополнительныхСведений.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.РеквизитыПИФ.СрезПоследних(
	|			&Период,
	|			ПаевойИнвестиционныйФонд.ДатаПрекращения = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ПаевойИнвестиционныйФонд.ДатаПрекращения >= &Период) КАК РеквизитыПИФСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	|		ПО РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд = ЗначенияДополнительныхСведений.Объект
	|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ДатаОкончанияФормированияПИФ"")
	|ГДЕ
	|	РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо В
	|			(ВЫБРАТЬ
	|				_ЮрФизЛица.Ссылка
	|			ИЗ
	|				_ЮрФизЛица КАК _ЮрФизЛица)
	|	И (ЗначенияДополнительныхСведений.Значение ЕСТЬ НЕ NULL 
	|				И ЗначенияДополнительныхСведений.Значение <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЗначенияДополнительныхСведений.Значение <= &Период
	|			ИЛИ НЕ &ТолькоСФормированныеПИФ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд.Наименование");
		
	Запрос.УстановитьПараметр("ЮрФизЛицо",	ЮрФизЛицо);
	Запрос.УстановитьПараметр("Период", 	Период);
	Запрос.УстановитьПараметр("ТолькоСФормированныеПИФ", 	ТолькоСформированныеПИФ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивРезультата = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивРезультата.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Если МассивРезультата.Количество() = 0 Тогда
		МассивРезультата.Добавить(Справочники.ПаевыеИнвестиционныеФонды.ПустаяСсылка());
	КонецЕсли;
	
	Возврат МассивРезультата; 	

КонецФункции

Функция ПолучитьУправляющуюКомпаниюПИФНаДату(Период, ПаевойИнвестиционныйФонд) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыПИФСрезПоследних.УправляющаяКомпания КАК УправляющаяКомпания
	|ИЗ
	|	РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК РеквизитыПИФСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 					Период);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", 	ПаевойИнвестиционныйФонд);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УправляющаяКомпания;
	КонецЕсли;
	
	Возврат Справочники.УправляющиеКомпании.ПустаяСсылка();  	
	
КонецФункции

Функция ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(Период, Пай) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Паи.ПаевойИнвестиционныйФонд КАК Ссылка
	|ПОМЕСТИТЬ _ПИФ
	|ИЗ
	|	Справочник.Паи КАК Паи
	|ГДЕ
	|	Паи.Ссылка = &Пай
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыПИФСрезПоследних.УправляющаяКомпания КАК УправляющаяКомпания
	|ИЗ
	|	РегистрСведений.РеквизитыПИФ.СрезПоследних(
	|			&Период,
	|			ПаевойИнвестиционныйФонд В
	|				(ВЫБРАТЬ
	|					_ПИФ.Ссылка
	|				ИЗ
	|					_ПИФ)) КАК РеквизитыПИФСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",	Период);
	Запрос.УстановитьПараметр("Пай", 	Пай);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УправляющаяКомпания;
	КонецЕсли;
	
	Возврат Справочники.УправляющиеКомпании.ПустаяСсылка();  	
	
КонецФункции