
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПредставленияОрганизаций();
	
	Список.Параметры.УстановитьЗначениеПараметра("Organization", Строка(ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация").УникальныйИдентификатор()));
	Список.Параметры.УстановитьЗначениеПараметра("ПолныеПрава", РольДоступна(Метаданные.Роли.ПолныеПрава));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияОрганизаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЭлементФормления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементФормления.Оформление.УстановитьЗначениеПараметра("Текст", Выборка.Наименование);
		ЭлементФормления.Использование = Истина;
		
		ЭлементОтбора = ЭлементФормления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.Organization.Имя);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементОтбора.Использование = Истина;
		
		ПолеФормления = ЭлементФормления.Поля.Элементы.Добавить();
		ПолеФормления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Organization.Имя);
		ПолеФормления.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры
