
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Дата = ТекущаяДата();
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Брокер = ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион");

	ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиПоУмолчанию());
	
КонецПроцедуры //ПриСозданииНаСервере

&НаСервере
Процедура ЗаполнитьТаблицуДанныхФормыНаСервере(Управляющий = Неопределено);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Управляющий"             , Управляющий);
	ПараметрыОтчета.Вставить("УпорядочитьПо"           , ЭтотОбъект.УпорядочитьПо);
	ПараметрыОтчета.Вставить("ПорядокВозрУбыв"         , ЭтотОбъект.ПорядокВозрУбыв);
	ПараметрыОтчета.Вставить("ОтобразитьБиржевойРаздел", ЭтотОбъект.ОтобразитьБиржевойРаздел);
	ПараметрыОтчета.Вставить("НижняяГраницаОстатка"	   , ЭтаФорма.НижняяГраницаОстатка);
	ПараметрыОтчета.Вставить("ВерхняяГраницаОстатка"   , ЭтаФорма.ВерхняяГраницаОстатка);
	ПараметрыОтчета.Вставить("ПроцентОтСЧА"            , ЭтаФорма.ПроцентОтСЧА);
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	//Открываем сессию
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектНаСервере,,ПараметрыОтчета); 
	Механизм = ОбъектНаСервере.Метаданные().ПолноеИмя() + ".ФормаОтчета.ЗаполнитьТаблицуДанныхФормыНаСервере()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ТаблицаДанныхДляОтчета = ОбъектНаСервере.СформироватьДанныеДляОтчета(ПараметрыОтчета);
	
	//Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

	Если (ТаблицаДанныхДляОтчета = Неопределено Или ТаблицаДанныхДляОтчета.Количество() = 0) И Не ЗначениеЗаполнено(Управляющий) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТаблицаДанных.Загрузить(ТаблицаДанныхДляОтчета);
	
КонецПроцедуры //ЗаполнитьТаблицуДанныхНаФорме

&НаСервере
Функция СформироватьТабличныйДокументДляСохранения()
	
	ТабДок = Новый ТабличныйДокумент;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетОтчета");
	
	Если Не ЭтаФорма.ОтобразитьВнебиржевойРаздел Тогда
		Макет.УдалитьОбласть(Макет.Область("БрокерВнебиржа"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Если Не ЭтаФорма.ОтобразитьДанныеРасчетногоСчета Тогда
		Макет.УдалитьОбласть(Макет.Область("РасчетныйСчет"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Если Не ЭтаФорма.ОтобразитьРазделТПлюс Тогда
		Макет.УдалитьОбласть(Макет.Область("Тплюс"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Если ЭтаФорма.ОтобразитьБиржевойРаздел Тогда
		Макет.УдалитьОбласть(Макет.Область("БрокерОбщий"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	Иначе
		Макет.УдалитьОбласть(Макет.Область("БрокерБиржа"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	Для Каждого СтрокаТЗОстатки Из ЭтотОбъект.ТаблицаДанных Цикл
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(СтрокаТЗОстатки);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции //СформироватьТабличныйДокументДляСохранения

&НаСервере
Функция ПолучитьПереченьУправляющихНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УправляющиеСчетовДоверительногоУправленияСрезПоследних.Управляющий КАК Управляющий
		|ИЗ
		|	РегистрСведений.УправляющиеСчетовДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И (СубъектАналитики ССЫЛКА Справочник.СтратегииИндивидуальногоИнвестирования
		|					ИЛИ ВЫРАЗИТЬ(СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица))) КАК УправляющиеСчетовДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	(ВЫРАЗИТЬ(УправляющиеСчетовДоверительногоУправленияСрезПоследних.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ДатаРасторжения >= &Период
		|			ИЛИ ВЫРАЗИТЬ(УправляющиеСчетовДоверительногоУправленияСрезПоследних.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Период"     , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Управляющий");

КонецФункции //ПолучитьПереченьУправляющихНаСервере	

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПоУмолчанию()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ОтобразитьБиржевойРаздел"	, Ложь);
	Настройки.Вставить("УпорядочитьПо"				, 3);
	Настройки.Вставить("ПорядокВозрУбыв"			, 2);
	Настройки.Вставить("НижняяГраницаОстатка"		, 1000);
	Настройки.Вставить("ПроцентОтСЧА"				, 0.5);
	Настройки.Вставить("ВерхняяГраницаОстатка"		, 50000);
	
	Возврат Настройки;
	
КонецФункции

//==================================== НА КЛИЕНТЕ ============================

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТаблицаДанныхНастроитьВидимость(Неопределено);
	
КонецПроцедуры //ПриОткрытии

&НаКлиенте
Процедура Обновить(Команда)
	
	ЭтотОбъект.ТаблицаДанных.Очистить();
	ЗаполнитьТаблицуДанныхФормыНаСервере();
	
КонецПроцедуры //Обновить

&НаКлиенте
Процедура СохранитьДанныеВФайл(Команда)
	
	ТЗ = ЭтотОбъект.ТаблицаДанных;
	
	Если ТЗ.Количество() = 0 Тогда
		Сообщить("Отсутствуют данные для сохранения в файл.");
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьТабличныйДокументДляСохранения();
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Укажите путь к файлу";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл MS Excel *.xlsx)| *.xlsx";
	Если Диалог.Выбрать() Тогда
		ФайлДанных = Диалог.ПолноеИмяФайла;
		Попытка
			ТабличныйДокумент.Записать(ФайлДанных, ТипФайлаТабличногоДокумента.XLSX);
			Сообщить("Файл " + ФайлДанных + " успешно сохранен.");
		Исключение
			Сообщить("Файл не сохранен! " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //СохранитьОстаткиВФайл

&НаКлиенте
Процедура ТаблицаДанныхНастроитьВидимость(Элемент)
	
	ЭтаФорма.Элементы.ТаблицаДанныхГруппаВнебиржа.Видимость  = ЭтотОбъект.ОтобразитьВнебиржевойРаздел;
	ЭтаФорма.Элементы.ТаблицаДанныхГруппаРасчетный.Видимость = ЭтотОбъект.ОтобразитьДанныеРасчетногоСчета;
	ЭтаФорма.Элементы.ТаблицаДанныхГруппаТПлюс.Видимость     = ЭтотОбъект.ОтобразитьРазделТПлюс;
	ЭтаФорма.Элементы.ТаблицаДанныхГруппаБиржа.Видимость     = ЭтотОбъект.ОтобразитьБиржевойРаздел;
	ЭтаФорма.Элементы.ТаблицаДанныхБрокерОбщие.Видимость     = Не ЭтотОбъект.ОтобразитьБиржевойРаздел;
	
	Если Элемент <> Неопределено И Элемент.Имя = "ОтобразитьБиржевойРаздел" Тогда
		ЭтотОбъект.СкрытьСтрокиНеНарушенОстаток = 1;
		УпорядочитьДанныеНаФорме();
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимость

&НаКлиенте
Процедура УпорядочитьДанныеНаФорме()
	
	ВозрУбыв = "";
	Если ЭтотОбъект.ПорядокВозрУбыв = 1 Тогда
		ВозрУбыв = "ВОЗР";
	ИначеЕсли ЭтотОбъект.ПорядокВозрУбыв = 2 Тогда
		ВозрУбыв = "УБЫВ";
	КонецЕсли;
	
	Если ЭтотОбъект.УпорядочитьПо = 1 Тогда
		//--
	ИначеЕсли ЭтотОбъект.УпорядочитьПо = 2 Тогда
		ЭтотОбъект.ТаблицаДанных.Сортировать("КодУБрокера " + ВозрУбыв);		
	ИначеЕсли ЭтотОбъект.УпорядочитьПо = 3 Тогда
		
		Если ЭтотОбъект.ОтобразитьБиржевойРаздел = Истина Тогда
			ЭтотОбъект.ТаблицаДанных.Сортировать("СуммаНаБиржеПроцентОтСЧА " + ВозрУбыв);
		Иначе
			ЭтотОбъект.ТаблицаДанных.Сортировать("СуммаУБрокераОбщаяПроцентОтСЧА " + ВозрУбыв);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры //УпорядочитьДанныеНаФорме

&НаКлиенте
Процедура УправляющийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Управляющие = ПолучитьПереченьУправляющихНаСервере();
	
	Если Управляющие <> Неопределено Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Управляющие);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправляющийПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДанныхФормыНаСервере(ЭтотОбъект.Управляющий);	
	
КонецПроцедуры //УправляющийПриИзменении()

&НаКлиенте
Процедура УправляющийОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуДанныхФормыНаСервере();
	
КонецПроцедуры //УправляющийОчистка()

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Для Каждого Настройка Из НастройкиПоУмолчанию() Цикл
		Если Настройка.Значение <> ЭтаФорма[Настройка.Ключ] Тогда
			Если ЭтаФорма.ПроверитьЗаполнение() Тогда	
				ЗаполнитьТаблицуДанныхФормыНаСервере();
			КонецЕсли;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НижняяГраницаОстаткаПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДанныхФормыНаСервере(ЭтотОбъект.Управляющий);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОтСЧАПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДанныхФормыНаСервере(ЭтотОбъект.Управляющий);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаОстаткаПриИзменении(Элемент)
	
	ЗаполнитьТаблицуДанныхФормыНаСервере(ЭтотОбъект.Управляющий);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчанию(Команда)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиПоУмолчанию());
	
КонецПроцедуры
