
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьДанныеРегистра();
	ЭтаФорма.ТекущийСписокШкал = ЭтаФорма.СписокШкал;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность И ЗавершениеРаботы Тогда
	
		Отказ = Истина;
		ТекстПредупреждения = 
			"Данные были изменены.
			|Перед завершением работы рекомендуется записать изменения,
			|иначе измененные данные будут утеряны.";
			
		Возврат;
	
	КонецЕсли; 
	
	ПроверитьМодифицированностьЗаписатьИзменения();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокШкалПриИзменении(Элемент)
	
	ПроверитьМодифицированностьЗаписатьИзменения();
	ПрочитатьДанныеРегистра();
	ЭтаФорма.ТекущийСписокШкал = ЭтаФорма.СписокШкал;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПроверитьМодифицированностьЗаписатьИзменения();
	ПрочитатьДанныеРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствПриИзменении(Элемент)

	ЭтаФорма.Модифицированность = Истина;
	Элементы.ФормаПеречитатьДанные.Заголовок = "Отменить изменения";
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ТекЭлемент Из ВыбранноеЗначение Цикл
	
		Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.ШкалыРейтинговыхАгентств") Тогда
		
			НоваяСтрока = ЭтаФорма.ШкалыРейтинговыхАгентств.Добавить();
			НоваяСтрока.ШкалаРейтингаЭталонная 	= ТекЭлемент;
			НоваяСтрока.СтрокаСопоставления 	= Элементы.СтрокиСопоставления.ТекущиеДанные.Значение;
			
		Иначе
			
			ДобавитьШкалыПоШаблону(ТекЭлемент, Элементы.СтрокиСопоставления.ТекущиеДанные.Значение);
		
		КонецЕсли; 		
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.СтрокиСопоставления.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать строку сопоставления", , "СтрокиСопоставления", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.СтрокаСопоставления = Элементы.СтрокиСопоставления.ТекущиеДанные.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствПриАктивизацииЯчейки(Элемент)
	
	КнопкаЗаполнитьПоНаименованию = Элементы.Найти("ШкалыРейтинговыхАгентствЗаполнитьПоНаименованию");
	КнопкаЗаполнитьПоЗначению = Элементы.Найти("ШкалыРейтинговыхАгентствЗаполнитьПоЗначению");
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗначениеМинимальное" ИЛИ 
		Элемент.ТекущийЭлемент.Имя = "ЗначениеМаксимальное" Тогда
		ДоступностьКнопок = Истина;
	Иначе
		ДоступностьКнопок = Ложь;		
	КонецЕсли; 
	
	Если Не КнопкаЗаполнитьПоНаименованию = Неопределено Тогда
		КнопкаЗаполнитьПоНаименованию.Доступность = ДоступностьКнопок;
	КонецЕсли; 
	
	Если Не КнопкаЗаполнитьПоЗначению = Неопределено Тогда
		КнопкаЗаполнитьПоЗначению.Доступность = ДоступностьКнопок;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиСопоставленияПриИзменении(Элемент)
	УстановитьОтборПоСтроке(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СтрокиСопоставленияПередУдалением(Элемент, Отказ)
	
	ПараметрыОтбора = Новый Структура("СтрокаСопоставления", Элементы.СтрокиСопоставления.ТекущиеДанные.Значение);
	НайденныеСтроки = ЭтаФорма.ШкалыРейтинговыхАгентств.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда 
		
		Если Вопрос("Для данной строки сопоставления существуют записи.
			|Существующие записи будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
		
			Для каждого СтрокаСопоставления Из НайденныеСтроки Цикл
			
				ЭтаФорма.ШкалыРейтинговыхАгентств.Удалить(СтрокаСопоставления);
			
			КонецЦикла;
			
		Иначе
			
			Отказ = Истина;
		
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СтрокиСопоставленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.СписокШкал) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать список шкал", , "СписокШкал", , Отказ);
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Отказ = Истина;
	
	ОтсортированныйСписок = ЭтаФорма.СтрокиСопоставления.Скопировать();
	ОтсортированныйСписок.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Если ОтсортированныйСписок.Количество() = 0 Тогда
		НомерНовойСтроки = 1;
	Иначе
		НомерНовойСтроки = ОтсортированныйСписок[0].Значение + 1;
	КонецЕсли; 
	
	Если Копирование Тогда
			
		ПараметрыОтбора = Новый Структура("СтрокаСопоставления", Элементы.СтрокиСопоставления.ТекущиеДанные.Значение);
		НайденныеСтроки = ЭтаФорма.ШкалыРейтинговыхАгентств.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если Вопрос("Скопировать состав шкал из текущей строки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
			
				Для каждого СтрокаСопоставления Из НайденныеСтроки Цикл
					
					НоваяСтрока = ЭтаФорма.ШкалыРейтинговыхАгентств.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСопоставления, , "СтрокаСопоставления, ЗначениеМинимальное, ОценкаМин, ЗначениеМаксимальное, ОценкаМакс");
					НоваяСтрока.СтрокаСопоставления = НомерНовойСтроки;
									
				КонецЦикла;
			
			КонецЕсли; 
			
		КонецЕсли;
			
	КонецЕсли; 
	
	НоваяСтрока = ЭтаФорма.СтрокиСопоставления.Добавить(НомерНовойСтроки);
	Элементы.СтрокиСопоставления.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиСопоставленияПриАктивизацииСтроки(Элемент)
	УстановитьОтборПоСтроке(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СтрокиСопоставленияЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	КоличествоНайденных = 0;
	Для каждого СтрокаСопоставления Из ЭтаФорма.СтрокиСопоставления Цикл
	
		Если СтрокаСопоставления.Значение = Число(Текст) Тогда
		
			КоличествоНайденных = КоличествоНайденных + 1;
		
		КонецЕсли; 
	
	КонецЦикла;
	
	Если КоличествоНайденных > 0 Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка с номером " + Текст + " уже существует.", , "СтрокиСопоставления");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(0);
		СтандартнаяОбработка = Ложь;
		Возврат;
	
	КонецЕсли; 
	
	ПараметрыОтбора = Новый Структура("СтрокаСопоставления", Элементы.СтрокиСопоставления.ТекущиеДанные.Значение);
	НайденныеСтроки = ЭтаФорма.ШкалыРейтинговыхАгентств.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(1, "Удалить");
		Кнопки.Добавить(2, "Изменить");
		Кнопки.Добавить(3, "Отмена");
		Ответ = Вопрос("Для данной строки сопоставления существуют записи. 
			|Удалить существующие записи или изменить номер строки на новый?", Кнопки, , 1);
		Если Ответ = 1 Тогда
		
			 Для каждого СтрокаСопоставления Из НайденныеСтроки Цикл
			
				ЭтаФорма.ШкалыРейтинговыхАгентств.Удалить(СтрокаСопоставления);
			
			КонецЦикла;
			
		ИначеЕсли Ответ = 2 Тогда 
			
			Для каждого СтрокаСопоставления Из НайденныеСтроки Цикл
			
				СтрокаСопоставления.СтрокаСопоставления = Текст;
			
			КонецЦикла;
			
		Иначе
			
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(Элементы.СтрокиСопоставления.ТекущиеДанные.Значение);
			СтандартнаяОбработка = Ложь;
		
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеМинимальноеПриИзменении(Элемент)
	
	ЗаполнитьОценкуЗначенияРейтинга("ЗначениеМинимальное", "ОценкаМин");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеМаксимальноеПриИзменении(Элемент)
	
	ЗаполнитьОценкуЗначенияРейтинга("ЗначениеМаксимальное", "ОценкаМакс");
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы
	
&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	ЗаписатьИзмененияСПроверкойКорректностиЗначенийРейтингов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНаДату(Команда)
	
	Дата = ЭтаФорма.Период;
	Если ВвестиДату(Дата, "Перенести настройки, действующие с " + Формат(ЭтаФорма.Период, "ДФ=dd.MM.yyyy") + " на следующую дату:", ЧастиДаты.Дата) Тогда
		ЗаписатьИзмененияСПроверкойКорректностиЗначенийРейтингов(Дата, ЭтаФорма.Период);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьДанные(Команда)

	ПрочитатьДанныеРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	Владелец = Элементы.ШкалыРейтинговыхАгентств;
	
	ОткрытьФорму("Справочник.ШкалыРейтинговыхАгентств.ФормаВыбора", ПараметрыФормы, Владелец,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоШаблону(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.СтрокиСопоставления.Количество() = 0 Тогда
		ЭтаФорма.СтрокиСопоставления.Добавить(1);
	КонецЕсли; 
	
	Форма = ПолучитьФорму("Справочник.ВнешниеСистемы.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ШкалыРейтинговыхАгентств);
	Форма.Заголовок = "Списки шкал для контроля инвестиционных деклараций";
	Форма.Автозаголовок = Ложь;
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Отбор = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ВнешниеСистемы.КонтрольИнвестиционныхДеклараций");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	
	Форма.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗначению(Команда)
	
	ЗаполнитьЗначения(Элементы.ШкалыРейтинговыхАгентств.ТекущиеДанные.ПолучитьИдентификатор(), "Оценка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНаименованию(Команда)
	
	ЗаполнитьЗначения(Элементы.ШкалыРейтинговыхАгентств.ТекущиеДанные.ПолучитьИдентификатор(), "Наименование");
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура ПрочитатьДанныеРегистра()

	ЭтаФорма.ШкалыРейтинговыхАгентств.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления КАК СтрокаСопоставления,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка КАК ОценкаМин,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное КАК ЗначениеМаксимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное.Оценка КАК ОценкаМакс,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ОтборПоЭталоннойШкале КАК ОтборПоЭталоннойШкале,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.Период КАК ДействуетС
		|ИЗ
		|	РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&Период, Источник = &Источник) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|ГДЕ
		|	СопоставлениеРейтинговыхШкалСрезПоследних.Активно
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаСопоставления,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная.Владелец,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная.Наименование";
	
	Запрос.УстановитьПараметр("Источник", ЭтаФорма.СписокШкал);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(ЭтаФорма.Период), ЭтаФорма.Период, Неопределено));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ШкалыРейтинговыхАгентств.Добавить(), Выборка);
	КонецЦикла;
	
	ТаблицаЗначений = ЭтаФорма.ШкалыРейтинговыхАгентств.Выгрузить(, "СтрокаСопоставления");
	ТаблицаЗначений.Свернуть("СтрокаСопоставления");
	ТаблицаЗначений.Сортировать("СтрокаСопоставления");
	
	ЭтаФорма.СтрокиСопоставления.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СтрокаСопоставления"));
	Элементы.СтрокиСопоставления.ТекущаяСтрока = 0;
	
	ЭтаФорма.Модифицированность = Ложь;
	Элементы.ФормаПеречитатьДанные.Заголовок = "Перечитать данные";

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодифицированностьЗаписатьИзменения()

	Если ЭтаФорма.Модифицированность И Вопрос("Данные изменены. Сохранить внесенные изменения", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьИзмененияСПроверкойКорректностиЗначенийРейтингов();
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияСПроверкойКорректностиЗначенийРейтингов(Дата = Неопределено, ДатаОчистки = Неопределено)

	Результат = ВыполнитьПроверкуКорректностиЗначенийРейтингов();
	
	Если Результат.ЕстьОшибкиЗаполненияЗначений Тогда
		
		ЗаписатьИзменения = Ложь;
		
	ИначеЕсли Результат.ЕстьОшибкиСравненияЗначений Тогда
		
		ЗаписатьИзменения = Вопрос("Поменять местами минимальные и максимальные значения в указанных строках?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да;
		
		Если ЗаписатьИзменения Тогда
		
			Для каждого СтрокаНастройки Из ЭтаФорма.ШкалыРейтинговыхАгентств Цикл
			
				Если СтрокаНастройки.ОценкаМакс > СтрокаНастройки.ОценкаМин Тогда
					
					ЗначениеМин = СтрокаНастройки.ЗначениеМаксимальное;
					СтрокаНастройки.ЗначениеМаксимальное = СтрокаНастройки.ЗначениеМинимальное;
					СтрокаНастройки.ЗначениеМинимальное = ЗначениеМин;
					
					ОценкаМин = СтрокаНастройки.ОценкаМакс;
					СтрокаНастройки.ОценкаМакс = СтрокаНастройки.ОценкаМин;
					СтрокаНастройки.ОценкаМин = ОценкаМин;
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЕсли;
		
	Иначе
		
		ЗаписатьИзменения = Истина;
		
	КонецЕсли;
	
	ЗадатьВопрос = (Дата = Неопределено);
	
	Если ЗаписатьИзменения Тогда
		Если Не ЗадатьВопрос Или ВвестиДату(ЭтаФорма.Период, "Введите дату начала действия настроек", ЧастиДаты.Дата) Тогда
			ЗаписатьИзмененияНаСервере(Дата, ДатаОчистки);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПроверкуКорректностиЗначенийРейтингов()

	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибкиЗаполненияЗначений", Ложь);
	Результат.Вставить("ЕстьОшибкиСравненияЗначений", Ложь);
	
	ШаблонОбщий = "В строке сопоставления %1 для шкалы %2 %3";
	
	Для каждого СтрокаНастройки Из ЭтаФорма.ШкалыРейтинговыхАгентств Цикл
		
		ТекстСообщения = "";
		
		Если СтрокаНастройки.ОценкаМакс = 0 Или СтрокаНастройки.ОценкаМин = 0 Тогда
			
			ТекстОшибки = СтрШаблон("не определена оценка %1 значения",
				?(СтрокаНастройки.ОценкаМакс = 0, "максимального", "минимального"));
			
			ТекстСообщения = СтрШаблон(ШаблонОбщий, 
				СтрокаНастройки.СтрокаСопоставления,
				СтрокаНастройки.ШкалаРейтингаЭталонная,
				ТекстОшибки);
				
			Результат.ЕстьОшибкиЗаполненияЗначений = Истина;
						
		ИначеЕсли СтрокаНастройки.ОценкаМакс > СтрокаНастройки.ОценкаМин Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонОбщий, 
				СтрокаНастройки.СтрокаСопоставления,
				СтрокаНастройки.ШкалаРейтингаЭталонная,
				"минимальное значение рейтинга выше максимального");
				
			Результат.ЕстьОшибкиСравненияЗначений = Истина;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	
	КонецЦикла;	
	
	Возврат Результат;

КонецФункции

&НаСервере 
Процедура ЗаписатьИзмененияНаСервере(Дата = Неопределено, ДатаОчистки = Неопределено)

	Дата = ?(Дата = Неопределено, ЭтаФорма.Период, Дата);
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДляЗагрузки.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	ДанныеДляЗагрузки.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	ДанныеДляЗагрузки.ЗначениеМаксимальное КАК ЗначениеМаксимальное,
		|	ДанныеДляЗагрузки.СтрокаСопоставления КАК СтрокаСопоставления
		|ПОМЕСТИТЬ _ДанныеДляЗагрузки
		|ИЗ
		|	&ДанныеДляЗагрузки КАК ДанныеДляЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.Активно КАК Активно,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное КАК ЗначениеМаксимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ОтборПоЭталоннойШкале КАК ОтборПоЭталоннойШкале,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления КАК СтрокаСопоставления,
		|	ШкалыРейтинговыхАгентств.Агрегатор КАК Агрегатор,
		|	ШкалыРейтинговыхАгентств.ТипШкалы КАК ТипШкалы,
		|	ШкалыРейтинговыхАгентств.Срок КАК Срок,
		|	ШкалыРейтинговыхАгентств.ВидРейтинга КАК ВидРейтинга,
		|	ШкалыРейтинговыхАгентств.Владелец КАК РейтинговоеАгенство
		|ПОМЕСТИТЬ _ТекущиеЗначения
		|ИЗ
		|	РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&Период, Источник = &Источник) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|		ПО СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная = ШкалыРейтинговыхАгентств.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДляЗагрузки.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	_ДанныеДляЗагрузки.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	_ДанныеДляЗагрузки.ЗначениеМаксимальное КАК ЗначениеМаксимальное,
		|	_ДанныеДляЗагрузки.СтрокаСопоставления КАК СтрокаСопоставления,
		|	ШкалыРейтинговыхАгентств.Агрегатор КАК Агрегатор,
		|	ШкалыРейтинговыхАгентств.ТипШкалы КАК ТипШкалы,
		|	ШкалыРейтинговыхАгентств.Срок КАК Срок,
		|	ШкалыРейтинговыхАгентств.ВидРейтинга КАК ВидРейтинга,
		|	ШкалыРейтинговыхАгентств.Владелец КАК РейтинговоеАгенство
		|ПОМЕСТИТЬ _НовыеЗначения
		|ИЗ
		|	_ДанныеДляЗагрузки КАК _ДанныеДляЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|		ПО _ДанныеДляЗагрузки.ШкалаРейтингаЭталонная = ШкалыРейтинговыхАгентств.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Период,
		|	&Источник КАК Источник,
		|	_ТекущиеЗначения.СтрокаСопоставления КАК СтрокаСопоставления,
		|	_ТекущиеЗначения.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	ЛОЖЬ КАК Активно,
		|	_ТекущиеЗначения.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	_ТекущиеЗначения.ЗначениеМаксимальное КАК ЗначениеМаксимальное,
		|	_ТекущиеЗначения.ОтборПоЭталоннойШкале КАК ОтборПоЭталоннойШкале,
		|	_ТекущиеЗначения.Агрегатор КАК Агрегатор,
		|	_ТекущиеЗначения.ТипШкалы КАК ТипШкалы,
		|	_ТекущиеЗначения.Срок КАК Срок,
		|	_ТекущиеЗначения.ВидРейтинга КАК ВидРейтинга,
		|	_ТекущиеЗначения.РейтинговоеАгенство КАК РейтинговоеАгенство
		|ИЗ
		|	_ТекущиеЗначения КАК _ТекущиеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НовыеЗначения КАК _НовыеЗначения
		|		ПО (_НовыеЗначения.СтрокаСопоставления = _ТекущиеЗначения.СтрокаСопоставления)
		|			И (_НовыеЗначения.ШкалаРейтингаЭталонная = _ТекущиеЗначения.ШкалаРейтингаЭталонная)
		|ГДЕ
		|	_НовыеЗначения.СтрокаСопоставления ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Источник,
		|	_НовыеЗначения.СтрокаСопоставления,
		|	_НовыеЗначения.ШкалаРейтингаЭталонная,
		|	ИСТИНА,
		|	_НовыеЗначения.ЗначениеМинимальное,
		|	_НовыеЗначения.ЗначениеМаксимальное,
		|	ИСТИНА,
		|	_НовыеЗначения.Агрегатор,
		|	_НовыеЗначения.ТипШкалы,
		|	_НовыеЗначения.Срок,
		|	_НовыеЗначения.ВидРейтинга,
		|	_НовыеЗначения.РейтинговоеАгенство
		|ИЗ
		|	_ТекущиеЗначения КАК _ТекущиеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НовыеЗначения КАК _НовыеЗначения
		|		ПО (_НовыеЗначения.СтрокаСопоставления = _ТекущиеЗначения.СтрокаСопоставления)
		|			И (_НовыеЗначения.ШкалаРейтингаЭталонная = _ТекущиеЗначения.ШкалаРейтингаЭталонная)
		|ГДЕ
		|	(НЕ _ТекущиеЗначения.Активно
		|			ИЛИ _ТекущиеЗначения.ЗначениеМинимальное <> _НовыеЗначения.ЗначениеМинимальное
		|			ИЛИ _ТекущиеЗначения.ЗначениеМаксимальное <> _НовыеЗначения.ЗначениеМаксимальное
		|			ИЛИ НЕ _ТекущиеЗначения.ОтборПоЭталоннойШкале)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Источник,
		|	_НовыеЗначения.СтрокаСопоставления,
		|	_НовыеЗначения.ШкалаРейтингаЭталонная,
		|	ИСТИНА,
		|	_НовыеЗначения.ЗначениеМинимальное,
		|	_НовыеЗначения.ЗначениеМаксимальное,
		|	ИСТИНА,
		|	_НовыеЗначения.Агрегатор,
		|	_НовыеЗначения.ТипШкалы,
		|	_НовыеЗначения.Срок,
		|	_НовыеЗначения.ВидРейтинга,
		|	_НовыеЗначения.РейтинговоеАгенство
		|ИЗ
		|	_НовыеЗначения КАК _НовыеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ТекущиеЗначения КАК _ТекущиеЗначения
		|		ПО _НовыеЗначения.СтрокаСопоставления = _ТекущиеЗначения.СтрокаСопоставления
		|			И _НовыеЗначения.ШкалаРейтингаЭталонная = _ТекущиеЗначения.ШкалаРейтингаЭталонная
		|ГДЕ
		|	_ТекущиеЗначения.СтрокаСопоставления ЕСТЬ NULL";
	#КонецОбласти
	
	Колонки = "ШкалаРейтингаЭталонная, ЗначениеМинимальное, ЗначениеМаксимальное, СтрокаСопоставления";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДанныеДляЗагрузки", ЭтаФорма.ШкалыРейтинговыхАгентств.Выгрузить(, Колонки));
	Запрос.УстановитьПараметр("Источник", ЭтаФорма.ТекущийСписокШкал);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ДатаОчистки", ДатаОчистки);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СопоставлениеРейтинговыхШкал");
	ЭлементБлокировки.УстановитьЗначение("Источник", ЭтаФорма.ТекущийСписокШкал);
	
	НачатьТранзакцию();
	
	Блокировка.Заблокировать();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Запись = РегистрыСведений.СопоставлениеРейтинговыхШкал.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();
	
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ДатаОчистки) Тогда
	
		Набор = РегистрыСведений.СопоставлениеРейтинговыхШкал.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ДатаОчистки);
		Набор.Отбор.Источник.Установить(ЭтаФорма.ТекущийСписокШкал);
		Набор.Записать();
		
	КонецЕсли; 
	
	ЗафиксироватьТранзакцию();
	
	ПрочитатьДанныеРегистра();
	
	ЭтаФорма.Модифицированность = Ложь;
	Элементы.ФормаПеречитатьДанные.Заголовок = "Перечитать данные";

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСтроке(ТекущиеДанные)

	Если Не ТекущиеДанные = Неопределено Тогда
	
		Элементы.ШкалыРейтинговыхАгентств.ОтборСтрок = Новый ФиксированнаяСтруктура("СтрокаСопоставления", ТекущиеДанные.Значение);
	
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ДобавитьШкалыПоШаблону(Шаблон, ТекСтрокаСопоставления)

	// Получим данные из первой строки шаблона для заполнения состава
	// Если мы добавляем строки из шаблона в первую строку сопоставления - минимальные значения получим из шаблона, Максимальные - с оценкой = 1
	// Для заполнения последующих строк получим данные предыдущей строки, при этом:
	// 	 Максимальные значения заполним с оценкой на 1 меньше предыдущих минимальных значений
	//   Минимальные значения возьмем из шблона, если их оценка выше (т.е. сами значения ниже) максимальных
	
	ПредыдущаяСтрока = ТекСтрокаСопоставления - 1;
		
	Запрос = Новый Запрос;
	#Область Текст_запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка КАК ОценкаМин,
		|	МАКСИМУМ(ЗначенияРейтингов.Ссылка) КАК ЗначениеМаксимальное,
		|	1 КАК ОценкаМакс
		|ПОМЕСТИТЬ _СоставШаблона
		|ИЗ
		|	РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(
		|			&Период,
		|			Источник = &Источник
		|				И СтрокаСопоставления = 1) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРейтингов КАК ЗначенияРейтингов
		|		ПО СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная = ЗначенияРейтингов.Владелец
		|			И (ЗначенияРейтингов.Оценка = 1)
		|ГДЕ
		|	СопоставлениеРейтинговыхШкалСрезПоследних.Активно
		|
		|СГРУППИРОВАТЬ ПО
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное,
		|	СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШкалыРейтинговыхАгентств.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	ШкалыРейтинговыхАгентств.ЗначениеМинимальное КАК ЗначениеМинимальное,
		|	ШкалыРейтинговыхАгентств.ОценкаМин КАК ОценкаМин
		|ПОМЕСТИТЬ _ДанныеПредыдущейСтроки
		|ИЗ
		|	&ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|ГДЕ
		|	ШкалыРейтинговыхАгентств.СтрокаСопоставления = &ПредыдущаяСтрока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПредыдущейСтроки.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	МАКСИМУМ(ЗначенияРейтинговТек.Ссылка) КАК ЗначениеМаксимальное,
		|	МАКСИМУМ(ЗначенияРейтинговТек.Оценка) КАК ОценкаМакс
		|ПОМЕСТИТЬ _НовыеМаксимальныеЗначения
		|ИЗ
		|	_ДанныеПредыдущейСтроки КАК _ДанныеПредыдущейСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРейтингов КАК ЗначенияРейтинговТек
		|		ПО _ДанныеПредыдущейСтроки.ШкалаРейтингаЭталонная = ЗначенияРейтинговТек.Владелец
		|			И (_ДанныеПредыдущейСтроки.ОценкаМин + 1 = ЗначенияРейтинговТек.Оценка)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПредыдущейСтроки.ШкалаРейтингаЭталонная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ТекСтрокаСопоставления КАК СтрокаСопоставления,
		|	_СоставШаблона.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная,
		|	ВЫБОР
		|		КОГДА _СоставШаблона.ОценкаМин > ЕСТЬNULL(_НовыеМаксимальныеЗначения.ОценкаМакс, _СоставШаблона.ОценкаМакс)
		|			ТОГДА _СоставШаблона.ЗначениеМинимальное
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЗначениеМинимальное,
		|	ВЫБОР
		|		КОГДА _СоставШаблона.ОценкаМин > ЕСТЬNULL(_НовыеМаксимальныеЗначения.ОценкаМакс, _СоставШаблона.ОценкаМакс)
		|			ТОГДА _СоставШаблона.ОценкаМин
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ОценкаМин,
		|	ЕСТЬNULL(_НовыеМаксимальныеЗначения.ЗначениеМаксимальное, _СоставШаблона.ЗначениеМаксимальное) КАК ЗначениеМаксимальное,
		|	ЕСТЬNULL(_НовыеМаксимальныеЗначения.ОценкаМакс, _СоставШаблона.ОценкаМакс) КАК ОценкаМакс
		|ИЗ
		|	_СоставШаблона КАК _СоставШаблона
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НовыеМаксимальныеЗначения КАК _НовыеМаксимальныеЗначения
		|		ПО _СоставШаблона.ШкалаРейтингаЭталонная = _НовыеМаксимальныеЗначения.ШкалаРейтингаЭталонная";		
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТекСтрокаСопоставления", ТекСтрокаСопоставления);
	Запрос.УстановитьПараметр("ПредыдущаяСтрока", ПредыдущаяСтрока);
	Запрос.УстановитьПараметр("ШкалыРейтинговыхАгентств", ЭтаФорма.ШкалыРейтинговыхАгентств.Выгрузить());
	Запрос.УстановитьПараметр("Период", ЭтаФорма.Период);
	Запрос.УстановитьПараметр("Источник", Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма.ШкалыРейтинговыхАгентств.Добавить(), Выборка);
	КонецЦикла; 
	
	Если Выборка.Количество() > 0 Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначения(Идентификатор, РежимЗаполнения)

	ТекущиеДанные = ЭтаФорма.ШкалыРейтинговыхАгентств.НайтиПоИдентификатору(Идентификатор);
	ТекущееАгентство = ТекущиеДанные.ШкалаРейтингаЭталонная.Владелец;
	ИмяПоля = Элементы.ШкалыРейтинговыхАгентств.ТекущийЭлемент.Имя;
	
	ЗначениеЗаполнения = ТекущиеДанные[ИмяПоля][РежимЗаполнения];
	СтрокаСопоставления = ТекущиеДанные.СтрокаСопоставления;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШкалыРейтинговыхАгентств.ШкалаРейтингаЭталонная КАК ШкалаРейтингаЭталонная
		|ПОМЕСТИТЬ _ШкалыСопоставления
		|ИЗ
		|	&ШкалыРейтинговыхАгентств КАК ШкалыРейтинговыхАгентств
		|ГДЕ
		|	ШкалыРейтинговыхАгентств.СтрокаСопоставления = &СтрокаСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ШкалыСопоставления.ШкалаРейтингаЭталонная КАК Шкала,
		|	ЗначенияРейтингов.Ссылка КАК Значение,
		|	ЗначенияРейтингов.Оценка КАК Оценка
		|ИЗ
		|	_ШкалыСопоставления КАК _ШкалыСопоставления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияРейтингов КАК ЗначенияРейтингов
		|		ПО _ШкалыСопоставления.ШкалаРейтингаЭталонная = ЗначенияРейтингов.Владелец
		|			И (&РежимЗаполнения)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РежимЗаполнения", "ЗначенияРейтингов." + РежимЗаполнения + " = &" + РежимЗаполнения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр(РежимЗаполнения, ЗначениеЗаполнения);
	Запрос.УстановитьПараметр("РейтинговоеАгентство", ТекущееАгентство);
	Запрос.УстановитьПараметр("ШкалыРейтинговыхАгентств", ЭтаФорма.ШкалыРейтинговыхАгентств.Выгрузить(, "ШкалаРейтингаЭталонная, СтрокаСопоставления"));
	Запрос.УстановитьПараметр("СтрокаСопоставления", СтрокаСопоставления);
	
	СоответствиеРеквизитовОценки = Новый Соответствие;
	СоответствиеРеквизитовОценки.Вставить("ЗначениеМинимальное", "ОценкаМин");
	СоответствиеРеквизитовОценки.Вставить("ЗначениеМаксимальное", "ОценкаМакс");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НайденныеСтроки = ЭтаФорма.ШкалыРейтинговыхАгентств.НайтиСтроки(Новый Структура("СтрокаСопоставления, ШкалаРейтингаЭталонная", СтрокаСопоставления, Выборка.Шкала));
		
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
		
			ТекСтрока[ИмяПоля] = Выборка.Значение;
			ТекСтрока[СоответствиеРеквизитовОценки[ИмяПоля]] = Выборка.Оценка;
		
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОценкуЗначенияРейтинга(ИмяПоляЗначения, ИмяПоляОценки)

	ТекущаяСтрока = Элементы.ШкалыРейтинговыхАгентств.ТекущиеДанные;
	ТекущаяСтрока[ИмяПоляОценки] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока[ИмяПоляЗначения], "Оценка");

КонецПроцедуры

&НаКлиенте
Процедура ШкалыРейтинговыхАгентствШкалаРейтингаЭталоннаяПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ШкалыРейтинговыхАгентств.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
	
		Если Не ЗначениеЗаполнено(ТекСтрока.ЗначениеМинимальное) Тогда
			ТекСтрока.ОценкаМин = 0;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекСтрока.ЗначениеМаксимальное) Тогда
			ТекСтрока.ОценкаМакс = 0;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 