
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьОрганизацию();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ИмпортЛимитныхВедомостей") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, ТипИнвестиционнойДекларации, Комментарий, Наименование");
		
		ЭтотОбъект.СчетаДоверительногоУправления.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.СчетаДоверительногоУправления));
		ЭтотОбъект.ГруппыЭмитентов.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.ГруппыЭмитентов));
		ЭтотОбъект.Эмитенты.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.Эмитенты));
		ЭтотОбъект.Показатели.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.Показатели));
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЗаполнитьОрганизацию();
КонецПроцедуры

Процедура ЗаполнитьОрганизацию()
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		
		Для каждого СтрокаПоказатели Из ЭтотОбъект.Показатели Цикл
		
			Если Не ЗначениеЗаполнено(СтрокаПоказатели.ИдентификаторСтрокиПоказателей) Тогда
			
				СтрокаПоказатели.ИдентификаторСтрокиПоказателей = Новый УникальныйИдентификатор;
			
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если ЭтотОбъект.Консолидирующая Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ИнвестиционныеДекларацииПоказатели.НомерСтроки КАК НомерСтроки,
				|	ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация
				|ПОМЕСТИТЬ _Показатели
				|ИЗ
				|	&Показатели КАК ИнвестиционныеДекларацииПоказатели
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_Показатели.НомерСтроки КАК НомерСтроки,
				|	ИСТИНА КАК Консолидирующая
				|ИЗ
				|	_Показатели КАК _Показатели
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
				|		ПО _Показатели.ИнвестиционнаяДекларация = ИнвестиционныеДекларации.Ссылка
				|			И (ИнвестиционныеДекларации.Консолидирующая)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	_Показатели.НомерСтроки,
				|	ЛОЖЬ
				|ИЗ
				|	_Показатели КАК _Показатели
				|ГДЕ
				|	_Показатели.ИнвестиционнаяДекларация = ЗНАЧЕНИЕ(Справочник.ИнвестиционныеДекларации.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("Показатели", Показатели.Выгрузить(, "НомерСтроки, ИнвестиционнаяДекларация"));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.Консолидирующая Тогда
					ТекстОшибки = "Выбрана консолидирующая декларация в колонке ""Инвестиционная декларация"" в строке " + Выборка.НомерСтроки + " списка ""Показатели""";
				Иначе				
					ТекстОшибки = "Не запонена колонка ""Инвестиционная декларация"" в строке " + Выборка.НомерСтроки + " списка ""Показатели""";
				КонецЕсли; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Показатели[" + (Выборка.НомерСтроки - 1) + "].ИнвестиционнаяДекларация", , Отказ);
			КонецЦикла;			
		
		КонецЕсли; 
		
		Если ЭтотОбъект.ТипИнвестиционнойДекларации <> Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость 
			И ЭтотОбъект.СчетаДоверительногоУправления.Количество() > 0 Тогда
		
			ЭтотОбъект.СчетаДоверительногоУправления.Очистить();
		
		КонецЕсли;
		
		Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
			ЭтотОбъект.СовокупныйКонтроль = Истина;
		ИначеЕсли ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
			ЭтотОбъект.СовокупныйКонтроль = Ложь;
		КонецЕсли;
	
	КонецЕсли; 
	
	Если Не ЭтотОбъект.Ссылка.Пустая() И РедактированиеЗапрещено() Тогда
		// Это не новый объект и инвестдекларация назначена клиенту. Сравниваем версии
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ВерсияПередЗаписью", ПолучитьВерсиюОбъекта());
	
	КонецЕсли; 
	
	Если Не СтрНачинаетсяС(ЭтотОбъект.Наименование, "limits") Тогда
	
		ПроверитьУникальностьНаименования(Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

Функция РедактированиеЗапрещено() Экспорт
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПрограммноеОбновление") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИнвестиционныеДекларацииПоказатели.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
			|		ПО ИнвестиционныеДекларацииПоказатели.Ссылка = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация
			|			И (ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация = &ИнвестиционнаяДекларация
			|				ИЛИ ИнвестиционныеДекларацииПоказатели.Ссылка = &ИнвестиционнаяДекларация)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|		ПО (НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка = ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации)
			|			И (ИнвестиционныеДекларации.Активность)";
		
		Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		РедактированиеЗапрещено = Не РезультатЗапроса.Пустой();
		
	Иначе
		
		РедактированиеЗапрещено = Ложь;
		
	КонецЕсли;
	
	Возврат РедактированиеЗапрещено;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	// Получаем структуру результатов проверки
	РазличияВерсийОбъекта = УниверсальныеМеханизмы.ПолучитьРазличияВерсийОбъекта(ЭтотОбъект);
	
	Если Не РазличияВерсийОбъекта = Неопределено Тогда
	
		ЕстьОшибки = Ложь;
		
		Для каждого ЭлементСтруктуры Из РазличияВерсийОбъекта Цикл
		
			Если ЭлементСтруктуры.Значение.Количество() > 0 Тогда
			    // Есть отличия в ключевых реквизитах объекта
				ЕстьОшибки = Истина;
				Прервать;		
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если ЕстьОшибки Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Инвестиционная декларация назначена клиенту", ЭтотОбъект, , , Отказ);
		
		КонецЕсли;
	
	КонецЕсли; 
		
КонецПроцедуры

// Возвращает структуру: 
// Ключ - идентификатор набора контролируемых реквизитов
// Значение - Таблица значений. Колонки таблицы - проверяемые реквизиты
Функция ПолучитьВерсиюОбъекта() Экспорт

	ВерсияОбъекта = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларации.ПометкаУдаления КАК ПометкаУдаления,
		|	ИнвестиционныеДекларации.Организация КАК Организация,
		|	ИнвестиционныеДекларации.Консолидирующая КАК Консолидирующая,
		|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	ИнвестиционныеДекларации.СовокупныйКонтроль КАК СовокупныйКонтроль
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|ГДЕ
		|	ИнвестиционныеДекларации.Ссылка = &Ссылка";
	ВерсияОбъекта.Вставить("Реквизиты", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	ИнвестиционныеДекларацииПоказатели.КонтролируемыйПоказатель КАК КонтролируемыйПоказатель,
		|	ИнвестиционныеДекларацииПоказатели.МинимальноеЗначение КАК МинимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.МаксимальноеЗначение КАК МаксимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМин КАК АбсолютнаяВеличинаМин,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМакс КАК АбсолютнаяВеличинаМакс,
		|	ИнвестиционныеДекларацииПоказатели.ОбъединятьОтборы КАК ОбъединятьОтборы,
		|	ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации КАК НаборИнвестиционнойДекларации,
		|	ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	ИнвестиционныеДекларацииПоказатели.ВнутреннийНабор КАК ВнутреннийНабор,
		|	ИнвестиционныеДекларацииПоказатели.ОпределяетСоставИСтруктуру КАК ОпределяетСоставИСтруктуру,
		|	ИнвестиционныеДекларацииПоказатели.Эмитент КАК Эмитент,
		|	ИнвестиционныеДекларацииПоказатели.ГруппаЭмитентов КАК ГруппаЭмитентов,
		|	ИнвестиционныеДекларацииПоказатели.ВключаяФилиалы КАК ВключаяФилиалы,
		|	ИнвестиционныеДекларацииПоказатели.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИнвестиционныеДекларацииПоказатели.ГруппаЦенныхБумаг КАК ГруппаЦенныхБумаг,
		|	ИнвестиционныеДекларацииПоказатели.ДатаЗапретаПокупки КАК ДатаЗапретаПокупки
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("Показатели", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЭмитенты.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЭмитенты.Эмитент КАК Эмитент
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Эмитенты КАК ИнвестиционныеДекларацииЭмитенты
		|ГДЕ
		|	ИнвестиционныеДекларацииЭмитенты.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("Эмитенты", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.ЦенныеБумаги КАК ИнвестиционныеДекларацииЦенныеБумаги
		|ГДЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("ЦенныеБумаги", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.СчетаДоверительногоУправления КАК ИнвестиционныеДекларацииСчетаДоверительногоУправления
		|ГДЕ
		|	ИнвестиционныеДекларацииСчетаДоверительногоУправления.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("СчетаДоверительногоУправления", Запрос.Выполнить().Выгрузить());
	
	Возврат ВерсияОбъекта;

КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
		ПроверяемыеРеквизиты.Добавить("СчетаДоверительногоУправления");
	ИначеЕсли ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
		ПроверяемыеРеквизиты.Добавить("УчастиеВГолосовании");
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПроверитьУникальностьНаименования(Отказ)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|ГДЕ
		|	ИнвестиционныеДекларации.Ссылка <> &Ссылка
		|	И ИнвестиционныеДекларации.Наименование = &Наименование
		|	И ИнвестиционныеДекларации.Организация = &Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование инвестиционной декларации неуникально", ЭтотОбъект, "Наименование",, Отказ);
	
	КонецЕсли;

КонецПроцедуры

