// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Печать тикетов РПИ",
		"0.12",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период"); 
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	МакетДопОформление = ПолучитьМакет("Макет"); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Ссылка,
		|	Сделка.Номер КАК Номер,
		|	Сделка.Дата КАК Дата,
		|	Сделка.ДатаОплаты КАК ДатаОплаты,
		|	Сделка.ДатаПоставки КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент <> Сделка.Организация.ЮрФизЛицо
		|			ТОГДА ""ДУ""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СделкаДУ,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент = Сделка.Организация.ЮрФизЛицо
		|			ТОГДА ""Собственная""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СделкаСобственная,
		|	Сделка.ВидСделки КАК ВидСделки,
		|	"""" КАК ЭтоРЕПО,
		|	Сделка.МестоХранения КАК МестоХранения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, """") <> """"
		|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу
		|		КОГДА ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу, """") <> """"
		|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НаименованиеПоУставу,
		|	Сделка.СчетДоверительногоУправления.НомерДоговора КАК СчетДоверительногоУправленияНомерДоговора,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА Сделка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигации""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЭтоОблигации,
		|	ВЫБОР
		|		КОГДА Сделка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Привилегированная)
		|						ТОГДА ""Акции прив.""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЭтоАкцииПрив,
		|	ВЫБОР
		|		КОГДА Сделка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Обыкновенная)
		|						ТОГДА ""Акции обыкн.""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА Сделка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА """"
		|		ИНАЧЕ Сделка.Рынок
		|	КОНЕЦ КАК ЭтоАкцииОбыкн,
		|	СделкаЦенныеБумаги.ЦеннаяБумага.Эмитент КАК ЦеннаяБумагаЭмитент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, """") = """"
		|			ТОГДА КодыВТорговыхСистемахСрезПоследних.Код
		|		ИНАЧЕ СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	СделкаЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	Сделка.ВалютаСделки КАК ВалютаСделки,
		|	Сделка.ВалютаОплаты КАК ВалютаОплаты,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Цена КАК Цена,
		|	СделкаЦенныеБумаги.СуммаКупона КАК СуммаКупона,
		|	СделкаЦенныеБумаги.Сумма + СделкаЦенныеБумаги.СуммаКупона КАК СуммаСделки,
		|	0 КАК СтавкаРЕПО,
		|	0 КАК Дата2Части,
		|	ВЫБОР
		|		КОГДА НЕ Сделка.ОтложенноеИсполнение
		|			ТОГДА ""ппп""
		|		КОГДА Сделка.ДатаОплаты = Сделка.ДатаПоставки
		|			ТОГДА ""ппп""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УсловияПлатежаППП,
		|	ВЫБОР
		|		КОГДА Сделка.ДатаОплаты < Сделка.ДатаПоставки
		|			ТОГДА ""предоплата""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УсловияПлатежаПредоплата,
		|	ВЫБОР
		|		КОГДА Сделка.ДатаОплаты > Сделка.ДатаПоставки
		|			ТОГДА ""предпоставка""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УсловияПлатежаПредпоставка,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделка.Организация КАК Организация
		|ПОМЕСТИТЬ Сделки
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаПо, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&ДатаПо, ) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|				И (РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация)
		|				И (РеквизитыЮридическихЛицАнкетныеСрезПоследних.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ПО Сделка.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаПо, ) КАК КодыВТорговыхСистемахСрезПоследних
		|			ПО СделкаЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|				И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|		ПО (СделкаЦенныеБумаги.Ссылка = Сделка.Ссылка)
		|			И (СделкаЦенныеБумаги.НомерСтроки = 1)
		|ГДЕ
		|	Сделка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И Сделка.Дата МЕЖДУ &ДатаC И &ДатаПо
		|	И Сделка.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПО.Ссылка,
		|	СделкаРЕПО.Номер,
		|	СделкаРЕПО.Дата,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.ОтложенноеИсполнение
		|			ТОГДА СделкаРЕПО.ДатаОплаты
		|		ИНАЧЕ СделкаРЕПО.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.ОтложенноеИсполнение
		|			ТОГДА СделкаРЕПО.ДатаПоставки
		|		ИНАЧЕ СделкаРЕПО.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент <> СделкаРЕПО.Организация.ЮрФизЛицо
		|			ТОГДА ""ДУ""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент = СделкаРЕПО.Организация.ЮрФизЛицо
		|			ТОГДА ""Собственная""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	СделкаРЕПО.ВидСделки,
		|	""РЕПО"",
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА СделкаРЕПО.МестоХранения
		|		ИНАЧЕ СделкаРЕПО.МестоХранения.Биржа
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, """") <> """"
		|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу
		|		КОГДА ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу, """") <> """"
		|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	СделкаРЕПО.СчетДоверительногоУправления.НомерДоговора,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ""Облигации""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Привилегированная)
		|						ТОГДА ""Акции прив.""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыАкций.Обыкновенная)
		|						ТОГДА ""Акции обыкн.""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА СделкаРЕПО.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА """"
		|		ИНАЧЕ СделкаРЕПО.Рынок
		|	КОНЕЦ,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага.Эмитент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, """") = """"
		|			ТОГДА КодыВТорговыхСистемахСрезПоследних.Код
		|		ИНАЧЕ СделкаРЕПОЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага.ВалютаНоминала,
		|	СделкаРЕПО.ВалютаСделки,
		|	СделкаРЕПО.ВалютаОплаты,
		|	СделкаРЕПОЦенныеБумаги.Количество,
		|	СделкаРЕПОЦенныеБумаги.Цена,
		|	СделкаРЕПОЦенныеБумаги.СуммаКупона,
		|	СделкаРЕПОЦенныеБумаги.Сумма + СделкаРЕПОЦенныеБумаги.СуммаКупона,
		|	СделкаРЕПО.СтавкаРЕПО,
		|	ВЫБОР
		|		КОГДА СделкаРЕПО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА СделкаРЕПО.ДатаОплатыВторойЧасти
		|		ИНАЧЕ СделкаРЕПО.ДатаВторойЧастиРЕПО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ СделкаРЕПО.ОтложенноеИсполнение
		|			ТОГДА ""ппп""
		|		КОГДА СделкаРЕПО.ДатаОплаты = СделкаРЕПО.ДатаПоставки
		|			ТОГДА ""ппп""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ СделкаРЕПО.ОтложенноеИсполнение
		|			ТОГДА """"
		|		КОГДА СделкаРЕПО.ДатаОплаты < СделкаРЕПО.ДатаПоставки
		|			ТОГДА ""предоплата""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ СделкаРЕПО.ОтложенноеИсполнение
		|			ТОГДА """"
		|		КОГДА СделкаРЕПО.ДатаОплаты > СделкаРЕПО.ДатаПоставки
		|			ТОГДА ""предпоставка""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	СделкаРЕПО.СчетДоверительногоУправления,
		|	СделкаРЕПО.Организация
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаПо, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&ДатаПо, ) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|				И (РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Организация)
		|				И (РеквизитыЮридическихЛицАнкетныеСрезПоследних.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ПО СделкаРЕПО.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаПо, ) КАК КодыВТорговыхСистемахСрезПоследних
		|			ПО СделкаРЕПОЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|				И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|		ПО (СделкаРЕПОЦенныеБумаги.Ссылка = СделкаРЕПО.Ссылка)
		|			И (СделкаРЕПОЦенныеБумаги.НомерСтроки = 1)
		|ГДЕ
		|	СделкаРЕПО.Дата МЕЖДУ &ДатаC И &ДатаПо
		|	И СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.ЧастьСделкиРЕПО <> 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Ссылка КАК Ссылка,
		|	МИНИМУМ(УправляющиеСчетовДоверительногоУправления.Период) КАК Период,
		|	Сделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ УправляющиеПоСделкам
		|ИЗ
		|	Сделки КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УправляющиеСчетовДоверительногоУправления КАК УправляющиеСчетовДоверительногоУправления
		|		ПО Сделки.Дата >= УправляющиеСчетовДоверительногоУправления.Период
		|			И Сделки.СчетДоверительногоУправления = УправляющиеСчетовДоверительногоУправления.СубъектАналитики
		|
		|СГРУППИРОВАТЬ ПО
		|	Сделки.Ссылка,
		|	Сделки.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Ссылка КАК Ссылка,
		|	МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК Период,
		|	Сделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Сделки.ЦеннаяБумага.Эмитент.ЮрФизЛицо КАК ЭмитентЮрФизЛицо
		|ПОМЕСТИТЬ ЭмитентыПоСделкам
		|ИЗ
		|	Сделки КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО Сделки.Дата >= РеквизитыЮридическихЛиц.Период
		|			И Сделки.ЦеннаяБумага.Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|
		|СГРУППИРОВАТЬ ПО
		|	Сделки.Ссылка,
		|	Сделки.СчетДоверительногоУправления,
		|	Сделки.ЦеннаяБумага,
		|	Сделки.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделки.Ссылка КАК Ссылка,
		|	Сделки.Номер КАК Номер,
		|	Сделки.Дата КАК Дата,
		|	Сделки.ДатаОплаты КАК ДатаОплаты,
		|	Сделки.ДатаПоставки КАК ДатаПоставки,
		|	Сделки.СделкаДУ КАК СделкаДУ,
		|	Сделки.СделкаСобственная КАК СделкаСобственная,
		|	Сделки.ВидСделки КАК ВидСделки,
		|	Сделки.ЭтоРЕПО КАК ЭтоРЕПО,
		|	Сделки.МестоХранения КАК МестоХранения,
		|	Сделки.НаименованиеПоУставу КАК НаименованиеПоУставу,
		|	Сделки.СчетДоверительногоУправленияНомерДоговора КАК СчетДоверительногоУправленияНомерДоговора,
		|	Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Сделки.ЭтоОблигации КАК ЭтоОблигации,
		|	Сделки.ЭтоАкцииПрив КАК ЭтоАкцииПрив,
		|	Сделки.ЭтоАкцииОбыкн КАК ЭтоАкцииОбыкн,
		|	Сделки.ЦеннаяБумагаЭмитент КАК ЦеннаяБумагаЭмитент,
		|	Сделки.ЦеннаяБумагаГосударственныйРегистрационныйНомер КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	Сделки.ВалютаНоминала КАК ВалютаНоминала,
		|	Сделки.ВалютаСделки КАК ВалютаСделки,
		|	Сделки.ВалютаОплаты КАК ВалютаОплаты,
		|	Сделки.Количество КАК Количество,
		|	Сделки.Цена КАК Цена,
		|	Сделки.СуммаКупона КАК СуммаКупона,
		|	Сделки.СуммаСделки КАК СуммаСделки,
		|	Сделки.СтавкаРЕПО КАК СтавкаРЕПО,
		|	Сделки.Дата2Части КАК Дата2Части,
		|	Сделки.УсловияПлатежаППП КАК УсловияПлатежаППП,
		|	Сделки.УсловияПлатежаПредоплата КАК УсловияПлатежаПредоплата,
		|	Сделки.УсловияПлатежаПредпоставка КАК УсловияПлатежаПредпоставка,
		|	Сделки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УправляющиеСчетовДоверительногоУправления.Управляющий КАК Управляющий,
		|	Сделки.Организация КАК Организация,
		|	РеквизитыЮридическихЛиц.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеЭмитентаПоУставу
		|ИЗ
		|	Сделки КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ УправляющиеПоСделкам КАК УправляющиеПоСделкам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УправляющиеСчетовДоверительногоУправления КАК УправляющиеСчетовДоверительногоУправления
		|			ПО УправляющиеПоСделкам.Период = УправляющиеСчетовДоверительногоУправления.Период
		|				И УправляющиеПоСделкам.СчетДоверительногоУправления = УправляющиеСчетовДоверительногоУправления.СубъектАналитики
		|		ПО Сделки.Ссылка = УправляющиеПоСделкам.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЭмитентыПоСделкам КАК ЭмитентыПоСделкам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|			ПО ЭмитентыПоСделкам.Период = РеквизитыЮридическихЛиц.Период
		|				И ЭмитентыПоСделкам.ЭмитентЮрФизЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|				И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|				И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|		ПО Сделки.Ссылка = ЭмитентыПоСделкам.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ДатаC", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОтветственныеПоДатам = Новый ТаблицаЗначений;
	ОтветственныеПоДатам.Колонки.Добавить("Дата");
	ОтветственныеПоДатам.Колонки.Добавить("ФИО");
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Тикет = МакетДопОформление.ПолучитьОбласть("Тикет"); 
		
		Тикет.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		
		//скорректировать дату и время составления тикета с 9.45 по 10.25
		ДатаТикета = Тикет.Параметры.Дата - 2*60;
		ЧасТикета = Час(ДатаТикета);
		МинутаТикета = Минута(ДатаТикета);
		Если МинутаТикета > 25 И МинутаТикета < 45  Тогда
			//добавим 25 минут, чобы минуты попали в интервал от 45 до 25.
			МинутаТикета = МинутаТикета + 25;
			Если МинутаТикета >=60 Тогда
				МинутаТикета = МинутаТикета - 60;
			КонецЕсли;
		КонецЕсли;
		Если МинутаТикета >= 45 Тогда
			ЧасТикета = 9;
		ИначеЕсли МинутаТикета >= 0 И МинутаТикета <= 25  Тогда
			ЧасТикета = 10;
		КонецЕсли;
		
		РасчетнаяДатаТикета = Дата(Год(ДатаТикета), Месяц(ДатаТикета), День(ДатаТикета), ЧасТикета, МинутаТикета, 0);
		Тикет.Параметры.ДатаТикета = РасчетнаяДатаТикета;
		Если РасчетнаяДатаТикета > Тикет.Параметры.Дата Тогда
			Тикет.Параметры.ДатаТикета = ДатаТикета;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Тикет.Параметры.Дата2Части) Тогда
			Тикет.Параметры.Дата2Части = "";
		Иначе
			Тикет.Параметры.Дата2Части = "Срок исполнения " + Формат(Тикет.Параметры.Дата2Части, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Тикет.Параметры.СтавкаРЕПО) Тогда
			Тикет.Параметры.СтавкаРЕПО = "";
		Иначе
			Тикет.Параметры.СтавкаРЕПО = "Ставка " + Тикет.Параметры.СтавкаРЕПО + "%";
		КонецЕсли;
		
		Ответственный = ОтветственныеПоДатам.Найти(НачалоДня(ВыборкаДетальныеЗаписи.Дата), "Дата");
		Если Ответственный = Неопределено Тогда
			Ответственный = ДобавитьОтветственного(ОтветственныеПоДатам, ВыборкаДетальныеЗаписи.Организация, НачалоДня(ВыборкаДетальныеЗаписи.Дата),	ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
		Тикет.Параметры.Ответственный = Ответственный.ФИО;
		
		Если ЭтотОбъект.СохранитьВExcel Тогда 
			ДокументРезультат1 = новый ТабличныйДокумент;
			ДокументРезультат1.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ДокументРезультат1.АвтоМасштаб = Истина;
			ДокументРезультат1.Вывести(Тикет);
			ДокументРезультат1.Записать(ЭтотОбъект.Каталог + "\" + РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(ВыборкаДетальныеЗаписи.Номер) + ".xls", ТипФайлаТабличногоДокумента.XLS);
		КонецЕсли;
		
		ДокументРезультат.Вывести(Тикет);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОтветственного(ТаблицаОтветственных, Организация,  Дата, Документ)
	
	Ответственный = ТаблицаОтветственных.Добавить();
	Ответственный.Дата 	= НачалоДня(Дата);
	ОтветственныйПользовательИБ = РегистрыСведений.ОтветственныеЗаОперации.ОпределитьОтветственного(Организация, РаботаСДокументами.ПолучитьИмя(Документ), Неопределено, Дата, Справочники.Сотрудники.ПустаяСсылка());
	Если ЗначениеЗаполнено(ОтветственныйПользовательИБ) Тогда
		Ответственный.ФИО = ?(ЗначениеЗаполнено(ОтветственныйПользовательИБ.ЮрФизЛицо), ОтветственныйПользовательИБ.ЮрФизЛицо, ОтветственныйПользовательИБ);
	Иначе
		Ответственный.ФИО = "";
	КонецЕсли;
	
	Возврат Ответственный;
	
КонецФункции