
Процедура ПолучитьТаблицуПлановыхОпераций(Параметры, МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("грКонецПериода", 				Новый Граница(КонецДня(Параметры.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", 					КонецДня(Параметры.Период));
	Запрос.УстановитьПараметр("ТекущаяДата", 					НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачДатаСФиксациями", 			ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.УстановитьПараметр("Организация", 					Параметры.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Параметры.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ТипыОферт", 						Параметры.ТипыОферт);
	Запрос.УстановитьПараметр("ВсеТипыОферт", 					Параметры.ТипыОферт = Неопределено);
	
	Запрос.УстановитьПараметр("БрокерЦенныеБумаги", 			Параметры.БрокерЦенныеБумаги);
	Запрос.УстановитьПараметр("РасчетныйСчетЦенныеБумаги", 		Параметры.РасчетныйСчетЦенныеБумаги);
	
	ПолучитьПлановыеСделки(Запрос);
	ПолучитьПлановыеКупоныОфертыИПогашения(Запрос, Параметры);
	ПолучитьЗадолженностиПоДСКПогашению(Запрос);
	ПолучитьЗакрытыеДепозиты(Запрос);
	ПолучитьЗакрытыеМНО(Запрос);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Валюта КАК Валюта,
		|	НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.Брокер КАК Брокер,
		|	НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних.РасчетныйСчет КАК РасчетныйСчет
		|ПОМЕСТИТЬ _НастройкиУчетаДоходовПоЦБ
		|ИЗ
		|	РегистрСведений.НастройкиУчетаДоходовПоЦеннымБумагам.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаДоходовПоЦеннымБумагамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА ВЫБОР
		|					КОГДА _ПлановыеСделки.ЧастьСделкиРЕПО = НЕОПРЕДЕЛЕНО
		|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеСделки.Период, ДЕНЬ), МИНУТА, -9)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеСделки.Период, ДЕНЬ), МИНУТА, -8)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ПлановыеСделки.ЧастьСделкиРЕПО = НЕОПРЕДЕЛЕНО
		|					ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеСделки.Период, ДЕНЬ), МИНУТА, -7)
		|				ИНАЧЕ ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеСделки.Период, ДЕНЬ), МИНУТА, -6)
		|			КОНЕЦ
		|	КОНЕЦ КАК Период,
		|	_ПлановыеСделки.Регистратор КАК Регистратор,
		|	_ПлановыеСделки.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_ПлановыеСделки.ВидДвижения КАК ВидДвижения,
		|	_ПлановыеСделки.Рынок КАК Рынок,
		|	_ПлановыеСделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПлановыеСделки.ВалютаСделки КАК ВалютаСделки,
		|	_ПлановыеСделки.Основание КАК Основание,
		|	_ПлановыеСделки.Количество КАК Количество,
		|	_ПлановыеСделки.ДатаПоставки КАК ДатаПоставки,
		|	_ПлановыеСделки.ДатаОплаты КАК ДатаОплаты,
		|	НЕОПРЕДЕЛЕНО КАК СуммаНаОднуОблигацию,
		|	НЕОПРЕДЕЛЕНО КАК ДатаФиксации,
		|	НЕОПРЕДЕЛЕНО КАК ВидПогашения,
		|	_ПлановыеСделки.СуммаОстаток КАК Сумма,
		|	_ПлановыеСделки.СуммаКупонаОстаток КАК СуммаКупона,
		|	НЕОПРЕДЕЛЕНО КАК КоличествоВРЕПОКупон,
		|	НЕОПРЕДЕЛЕНО КАК КоличествоПоРЕПОКупон,
		|	НЕОПРЕДЕЛЕНО КАК ВалютаНоминала,
		|	НЕОПРЕДЕЛЕНО КАК ТипОферты,
		|	ИСТИНА КАК ПлановыеДанные,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МоментВремени,
		|	_ПлановыеСделки.ТипЗадолженности КАК ТипЗадолженности,
		|	_ПлановыеСделки.ВидЗадолженности КАК ВидЗадолженности,
		|	_ПлановыеСделки.Контрагент КАК Контрагент,
		|	_ПлановыеСделки.МестоХранения КАК МестоХранения,
		|	_ПлановыеСделки.Брокер КАК Брокер,
		|	_ПлановыеСделки.РасчетныйСчет КАК РасчетныйСчет,
		|	0 КАК СтрокаПартии,
		|	_ПлановыеСделки.РаздельноеИсполнение КАК РаздельноеИсполнение,
		|	_ПлановыеСделки.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	_ПлановыеСделки.Регистратор КАК Партия
		|ПОМЕСТИТЬ _ПлановыеДанные_Операции
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеКупоны.Период, ДЕНЬ), МИНУТА, -5),
		|	_ПлановыеКупоны.Регистратор,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеКупоны.ВидДвижения,
		|	_ПлановыеКупоны.Рынок,
		|	_ПлановыеКупоны.ЦеннаяБумага,
		|	NULL,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(_ПлановыеКупоны.Количество),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеКупоны.СуммаНаОднуОблигацию,
		|	_ПлановыеКупоны.ДатаФиксации,
		|	НЕОПРЕДЕЛЕНО,
		|	NULL,
		|	СУММА(_ПлановыеКупоны.СуммаНаОднуОблигацию * _ПлановыеКупоны.Количество),
		|	СУММА(_ПлановыеКупоны.КоличествоВРЕПОКупон),
		|	СУММА(_ПлановыеКупоны.КоличествоПоРЕПОКупон),
		|	_ПлановыеКупоны.ВалютаНоминала,
		|	НЕОПРЕДЕЛЕНО,
		|	ИСТИНА,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона),
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	NULL,
		|	NULL,
		|	_ПлановыеКупоны.Регистратор
		|ИЗ
		|	_ПлановыеКупоны КАК _ПлановыеКупоны
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПлановыеКупоны.СуммаНаОднуОблигацию,
		|	_ПлановыеКупоны.ДатаФиксации,
		|	_ПлановыеКупоны.ВидДвижения,
		|	_ПлановыеКупоны.Рынок,
		|	_ПлановыеКупоны.ЦеннаяБумага,
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеКупоны.Период, ДЕНЬ), МИНУТА, -5),
		|	_ПлановыеКупоны.ВалютаНоминала,
		|	_ПлановыеКупоны.Регистратор,
		|	_ПлановыеКупоны.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеОферты.Период, ДЕНЬ), МИНУТА, -4),
		|	_ПлановыеОферты.Регистратор,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеОферты.ВидДвижения,
		|	_ПлановыеОферты.Рынок,
		|	_ПлановыеОферты.Облигация,
		|	NULL,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеОферты.КоличествоОстаток,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеОферты.Цена,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеОферты.ВидПогашения,
		|	NULL,
		|	NULL,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеОферты.ВалютаНоминала,
		|	_ПлановыеОферты.ТипОферты,
		|	ИСТИНА,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ВЫБОР
		|		КОГДА _ПлановыеОферты.Регистратор = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|	КОНЕЦ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	NULL,
		|	NULL,
		|	_ПлановыеОферты.Регистратор
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(_ПлановыеПогашения.Период, ДЕНЬ), МИНУТА, -3),
		|	_ПлановыеПогашения.Регистратор,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеПогашения.ВидДвижения,
		|	_ПлановыеПогашения.Рынок,
		|	_ПлановыеПогашения.ЦеннаяБумага,
		|	NULL,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеПогашения.КоличествоОстатокОблигации,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеПогашения.СуммаИзмененияНоминалаОблигации,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеПогашения.ВидПогашения,
		|	_ПлановыеПогашения.ОжидаемаяСуммаОблигации,
		|	NULL,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	_ПлановыеПогашения.ВалютаНоминала,
		|	НЕОПРЕДЕЛЕНО,
		|	ИСТИНА,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации),
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	NULL,
		|	NULL,
		|	_ПлановыеПогашения.Регистратор
		|ИЗ
		|	_ПлановыеПогашения КАК _ПлановыеПогашения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоДСКПогашению.Основание КАК Основание,
		|	_ЗадолженностиПоДСКПогашению.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностиПоДСКПогашению.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗадолженностиПоДСКПогашению.ВалютаСделки КАК Валюта,
		|	_ЗадолженностиПоДСКПогашению.Контрагент КАК Контрагент,
		|	ЛОЖЬ КАК Аванс,
		|	-_ЗадолженностиПоДСКПогашению.Сумма КАК Сумма,
		|	-_ЗадолженностиПоДСКПогашению.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ПлановыеДанные_ЗадолженностиПоДС
		|ИЗ
		|	_ЗадолженностиПоДСКПогашению КАК _ЗадолженностиПоДСКПогашению
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПлановыеСделки.Регистратор,
		|	_ПлановыеСделки.ТипЗадолженности,
		|	_ПлановыеСделки.ВидЗадолженности,
		|	_ПлановыеСделки.ВалютаСделки,
		|	_ПлановыеСделки.Контрагент,
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * _ПлановыеСделки.СуммаОстаток,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * _ПлановыеСделки.СуммаКупонаОстаток
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|ГДЕ
		|	_ПлановыеСделки.ЧастьСделкиРЕПО = 2
		|	И НЕ(_ПлановыеСделки.ДатаОплаты МЕЖДУ &ТекущаяДата И &КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер, ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК Брокер,
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка) КАК МестоХранения,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) КАК РасчетныйСчет,
		|	_ПлановыеОферты.ВалютаНоминала КАК Валюта,
		|	_ПлановыеОферты.КоличествоОстаток * (_ПлановыеОферты.Цена + ЕСТЬNULL(_Купоны.Купон, 0)) КАК Сумма
		|ПОМЕСТИТЬ _ПлановыеДанные_ОстаткиДС
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|			ПО Облигации.Эмитент = Эмитенты.Ссылка
		|		ПО _ПлановыеОферты.Облигация = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер)
		|			И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &КонецПериода)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Купоны КАК _Купоны
		|		ПО _ПлановыеОферты.Облигация = _Купоны.Облигация
		|ГДЕ
		|	(_ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа)
		|			ИЛИ _ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностиПоДСКПогашению.Основание) = ТИП(Документ.Сделка)
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.Сделка).Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|							ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.Сделка).Брокер
		|					КОНЕЦ
		|			КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностиПоДСКПогашению.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.СделкаРЕПО).Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|							ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.СделкаРЕПО).Брокер
		|					КОНЕЦ
		|		КОНЕЦ, ЕСТЬNULL(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер, ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка))),
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка),
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностиПоДСКПогашению.Основание) = ТИП(Документ.Сделка)
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.Сделка).Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|							ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.Сделка).РасчетныйСчет
		|					КОНЕЦ
		|			КОГДА ТИПЗНАЧЕНИЯ(_ЗадолженностиПоДСКПогашению.Основание) = ТИП(Документ.СделкаРЕПО)
		|				ТОГДА ВЫБОР
		|						КОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.СделкаРЕПО).Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|							ТОГДА ВЫРАЗИТЬ(_ЗадолженностиПоДСКПогашению.Основание КАК Документ.СделкаРЕПО).РасчетныйСчет
		|					КОНЕЦ
		|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)),
		|	_ЗадолженностиПоДСКПогашению.ВалютаСделки,
		|	ВЫБОР
		|		КОГДА _ЗадолженностиПоДСКПогашению.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * (_ЗадолженностиПоДСКПогашению.Сумма + _ЗадолженностиПоДСКПогашению.СуммаКупона)
		|ИЗ
		|	_ЗадолженностиПоДСКПогашению КАК _ЗадолженностиПоДСКПогашению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер)
		|			И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &КонецПериода)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПлановыеСделки.Брокер,
		|	_ПлановыеСделки.МестоХранения,
		|	_ПлановыеСделки.РасчетныйСчет,
		|	_ПлановыеСделки.ВалютаСделки,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * (_ПлановыеСделки.СуммаОстаток + _ПлановыеСделки.СуммаКупонаОстаток)
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|ГДЕ
		|	_ПлановыеСделки.ЧастьСделкиРЕПО = 2
		|	И _ПлановыеСделки.ДатаОплаты МЕЖДУ &ТекущаяДата И &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка),
		|	_ПлановыеДепозиты.МестоХранения,
		|	_ПлановыеДепозиты.РасчетныйСчет,
		|	_ПлановыеДепозиты.Валюта,
		|	_ПлановыеДепозиты.Сумма
		|ИЗ
		|	_ПлановыеДепозиты КАК _ПлановыеДепозиты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	_ПлановыеМНО.РасчетныйСчет,
		|	_ПлановыеМНО.Валюта,
		|	_ПлановыеМНО.Сумма
		|ИЗ
		|	_ПлановыеМНО КАК _ПлановыеМНО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.Брокер, &БрокерЦенныеБумаги),
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.РасчетныйСчет, &РасчетныйСчетЦенныеБумаги),
		|	_ПлановыеКупоны.ВалютаНоминала,
		|	_ПлановыеКупоны.СуммаНаОднуОблигацию * (_ПлановыеКупоны.Количество - _ПлановыеКупоны.КоличествоПоРЕПОКупон)
		|ИЗ
		|	_ПлановыеКупоны КАК _ПлановыеКупоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|			ПО Облигации.Эмитент = Эмитенты.Ссылка
		|		ПО _ПлановыеКупоны.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиУчетаДоходовПоЦБ КАК _НастройкиУчетаДоходовПоЦБ
		|		ПО _ПлановыеКупоны.ВалютаНоминала = _НастройкиУчетаДоходовПоЦБ.Валюта
		|ГДЕ
		|	_ПлановыеКупоны.Количество - _ПлановыеКупоны.КоличествоПоРЕПОКупон > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.Брокер, &БрокерЦенныеБумаги),
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.РасчетныйСчет, &РасчетныйСчетЦенныеБумаги),
		|	_ПлановыеПогашения.ВалютаНоминала,
		|	_ПлановыеПогашения.ОжидаемаяСуммаОблигации
		|ИЗ
		|	_ПлановыеПогашения КАК _ПлановыеПогашения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|			ПО Облигации.Эмитент = Эмитенты.Ссылка
		|		ПО _ПлановыеПогашения.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиУчетаДоходовПоЦБ КАК _НастройкиУчетаДоходовПоЦБ
		|		ПО _ПлановыеПогашения.ВалютаНоминала = _НастройкиУчетаДоходовПоЦБ.Валюта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.Брокер, &БрокерЦенныеБумаги),
		|	ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок),
		|	ЕСТЬNULL(_НастройкиУчетаДоходовПоЦБ.РасчетныйСчет, &РасчетныйСчетЦенныеБумаги),
		|	_ПлановыеОферты.ВалютаНоминала,
		|	_ПлановыеОферты.КоличествоОстаток * _ПлановыеОферты.Цена
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|			ПО Облигации.Эмитент = Эмитенты.Ссылка
		|		ПО _ПлановыеОферты.Облигация = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиУчетаДоходовПоЦБ КАК _НастройкиУчетаДоходовПоЦБ
		|		ПО _ПлановыеОферты.ВалютаНоминала = _НастройкиУчетаДоходовПоЦБ.Валюта
		|ГДЕ
		|	(_ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПокупка)
		|			ИЛИ _ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение) КАК ВидБлокировкиАктива,
		|	_ПлановыеПогашения.Рынок КАК Рынок,
		|	_ПлановыеПогашения.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПлановыеПогашения.КоличествоОстатокОблигации КАК Количество
		|ПОМЕСТИТЬ _ПлановыеДанные_ОстаткиЦБЗаблокированные
		|ИЗ
		|	_ПлановыеПогашения КАК _ПлановыеПогашения
		|ГДЕ
		|	_ПлановыеПогашения.ВидПогашения = ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПолноеПогашение)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыБлокировокАктивов.Погашение),
		|	_ПлановыеОферты.Рынок,
		|	_ПлановыеОферты.Облигация,
		|	_ПлановыеОферты.КоличествоОстаток
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|ГДЕ
		|	(_ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПокупка)
		|			ИЛИ _ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПлановыеСделки.Основание КАК Основание,
		|	_ПлановыеСделки.ТипЗадолженности КАК ТипЗадолженности,
		|	_ПлановыеСделки.ВидЗадолженности КАК ВидЗадолженности,
		|	_ПлановыеСделки.Рынок КАК Рынок,
		|	_ПлановыеСделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПлановыеСделки.ВалютаСделки КАК Валюта,
		|	-_ПлановыеСделки.Количество КАК Количество,
		|	-_ПлановыеСделки.СуммаОстаток КАК Сумма,
		|	-_ПлановыеСделки.СуммаКупонаОстаток КАК СуммаКупона
		|ПОМЕСТИТЬ _ПлановыеДанные_ЗадолженностиПоЦБ
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|ГДЕ
		|	_ПлановыеСделки.ОтложенноеИсполнение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПлановыеОферты.Рынок КАК Рынок,
		|	_ПлановыеОферты.Облигация КАК ЦеннаяБумага,
		|	-_ПлановыеОферты.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ _ПлановыеДанные_ОстаткиЦенныхБумаг
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПлановыеСделки.Рынок,
		|	_ПлановыеСделки.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА _ПлановыеСделки.Количество
		|		ИНАЧЕ -_ПлановыеСделки.Количество
		|	КОНЕЦ
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПлановыеСделки.Основание КАК СделкаРЕПО,
		|	_ПлановыеСделки.ТипЗадолженности КАК ТипЗадолженности,
		|	_ПлановыеСделки.Рынок КАК Рынок,
		|	_ПлановыеСделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПлановыеСделки.ВалютаСделки КАК Валюта,
		|	-_ПлановыеСделки.Количество КАК Количество,
		|	-_ПлановыеСделки.СуммаОстаток КАК Сумма,
		|	-_ПлановыеСделки.СуммаКупонаОстаток КАК СуммаКупона
		|ПОМЕСТИТЬ _ПлановыеДанные_ЗадолженностиПоВторойЧастиРЕПО
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|ГДЕ
		|	_ПлановыеСделки.ЧастьСделкиРЕПО = 2";
	
#КонецОбласти 

	Запрос.Выполнить();
	
	Запрос.Текст = 
		"УНИЧТОЖИТЬ _НастройкиУчетаДоходовПоЦБ
		|;
		|УНИЧТОЖИТЬ _ЗадолженностиПоСедлкам
		|;
		|УНИЧТОЖИТЬ _ЗадолженностиПоСедлкамРЕПО
		|;
		|УНИЧТОЖИТЬ _ПлановыеСделки
		|;
		|УНИЧТОЖИТЬ _КупонныйДуходПоОблигациям
		|;
		|УНИЧТОЖИТЬ _ОстаткиЦенныхБумагНаДатуФиксации
		|;
		|УНИЧТОЖИТЬ _ОстаткиРЕПОПоБиржевымСделкам
		|;
		|УНИЧТОЖИТЬ _ОстаткиРЕПОПоВнебиржевымСделкам
		|;
		|УНИЧТОЖИТЬ _ПлановыеКупоны
		|;
		|УНИЧТОЖИТЬ _ОстаткиНаДатуФиксации
		|;
		|УНИЧТОЖИТЬ _ОстаткиОблигаций
		|;
		|УНИЧТОЖИТЬ _ПлановыеПогашения
		|;
		|УНИЧТОЖИТЬ _ПлановыеОферты
		|;
		|УНИЧТОЖИТЬ _ЗадолженностиПоДС
		|;
		|УНИЧТОЖИТЬ _ЗадолженностиПоДСКПогашению
		|;
		|УНИЧТОЖИТЬ _ПлановыеДепозиты
		|;
		|УНИЧТОЖИТЬ _ПлановыеМНО";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьОписаниеТаблицыПлановыхОпераций() Экспорт

	ТаблицаПлановыхОпераций = Новый ТаблицаЗначений;
	МетаданныеОпераций = Метаданные.РегистрыСведений.ОперацииСЦеннымиБумагами;
	
	ТаблицаПлановыхОпераций.Колонки.Добавить("Период", 			Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаПлановыхОпераций.Колонки.Добавить("МоментВремени", 	Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаПлановыхОпераций.Колонки.Добавить("УчетныйАктивЕПС", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ТаблицаПлановыхОпераций.Колонки.Добавить("Регистратор", 	МетаданныеОпераций.СтандартныеРеквизиты.Регистратор.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("Партия",		 	Метаданные.ОпределяемыеТипы.Партия.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("СтрокаПартии", 	МетаданныеОпераций.Измерения.СтрокаПартии.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ЧастьСделкиРЕПО",	МетаданныеОпераций.Измерения.ЧастьСделкиРЕПО.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ВидДвижения",		МетаданныеОпераций.Измерения.ВидДвижения.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("Рынок", 			МетаданныеОпераций.Измерения.Рынок.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ЦеннаяБумага", 	МетаданныеОпераций.Измерения.ЦеннаяБумага.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ВалютаСделки",	МетаданныеОпераций.Измерения.Валюта.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("Основание",		МетаданныеОпераций.Измерения.Основание.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("Количество", 		МетаданныеОпераций.Ресурсы.Количество.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ДатаПоставки", 	МетаданныеОпераций.Ресурсы.ДатаПоставки.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ДатаОплаты", 		МетаданныеОпераций.Ресурсы.ДатаОплаты.Тип);
	
	ТаблицаПлановыхОпераций.Колонки.Добавить("СуммаНаОднуОблигацию", 	МетаданныеОпераций.Ресурсы.Сумма.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("ДатаФиксации", 			Новый ОписаниеТипов("Дата"));
	ТаблицаПлановыхОпераций.Колонки.Добавить("ВидПогашения", 			Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПогашения"));
	ТаблицаПлановыхОпераций.Колонки.Добавить("Сумма", 					МетаданныеОпераций.Ресурсы.Сумма.Тип);
	ТаблицаПлановыхОпераций.Колонки.Добавить("СуммаКупона", 			МетаданныеОпераций.Ресурсы.СуммаКупона.Тип);
		
	Возврат ТаблицаПлановыхОпераций;

КонецФункции
 
Процедура ПолучитьПлановыеСделки(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.Основание.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ПоставкаЦенныхБумаг.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ИсполнениеОбязательствПоСделке.ПустаяСсылка)
		|	КОНЕЦ КАК Регистратор,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Рынок КАК Рынок,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток КАК СуммаКупонаОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоСедлкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&грКонецПериода,
		|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Документ.СделкаРепо.ПустаяСсылка) КАК Регистратор,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СделкаРЕПО КАК Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.Рынок КАК Рынок,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.Валюта КАК Валюта,
		|	2 КАК ЧастьСделкиРЕПО,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоВторойЧастиРЕПООстатки.СуммаКупонаОстаток КАК СуммаКупонаОстаток,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО) КАК ВидЗадолженности
		|ПОМЕСТИТЬ _ЗадолженностиПоСедлкамРЕПО
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|			&грКонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоВторойЧастиРЕПООстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Документ.ПоставкаЦенныхБумаг.ПустаяСсылка),
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Рынок,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Валюта,
		|	0,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&грКонецПериода,
		|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.Основание.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ПоставкаЦенныхБумаг.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ИсполнениеОбязательствПоСделке.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Рынок,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ЦеннаяБумага,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.Валюта,
		|	1,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.СуммаКупонаОстаток,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&грКонецПериода,
		|			ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК Период,
		|	_ЗадолженностиПоСедлкам.Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ЧастьСделкиРЕПО,
		|	_ЗадолженностиПоСедлкам.ВидДвижения КАК ВидДвижения,
		|	_ЗадолженностиПоСедлкам.Рынок КАК Рынок,
		|	_ЗадолженностиПоСедлкам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЗадолженностиПоСедлкам.Валюта КАК ВалютаСделки,
		|	_ЗадолженностиПоСедлкам.Основание КАК Основание,
		|	_ЗадолженностиПоСедлкам.КоличествоОстаток КАК Количество,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	_ЗадолженностиПоСедлкам.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностиПоСедлкам.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗадолженностиПоСедлкам.СуммаОстаток КАК СуммаОстаток,
		|	_ЗадолженностиПоСедлкам.СуммаКупонаОстаток КАК СуммаКупонаОстаток,
		|	СделкаДокумент.Контрагент КАК Контрагент,
		|	СделкаДокумент.МестоХранения КАК МестоХранения,
		|	СделкаДокумент.Брокер КАК Брокер,
		|	СделкаДокумент.РасчетныйСчет КАК РасчетныйСчет,
		|	УсловияСделокСрезПоследних.РаздельноеИсполнение КАК РаздельноеИсполнение,
		|	УсловияСделокСрезПоследних.ОтложенноеИсполнение КАК ОтложенноеИсполнение
		|ПОМЕСТИТЬ _ПлановыеСделки
		|ИЗ
		|	_ЗадолженностиПоСедлкам КАК _ЗадолженностиПоСедлкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И Сделка В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЗадолженностиПоСедлкам.Основание
		|						ИЗ
		|							_ЗадолженностиПоСедлкам)) КАК УсловияСделокСрезПоследних
		|		ПО _ЗадолженностиПоСедлкам.Основание = УсловияСделокСрезПоследних.Сделка
		|			И _ЗадолженностиПоСедлкам.Рынок = УсловияСделокСрезПоследних.Рынок
		|			И _ЗадолженностиПоСедлкам.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК СделкаДокумент
		|		ПО _ЗадолженностиПоСедлкам.Основание = СделкаДокумент.Ссылка
		|ГДЕ
		|	УсловияСделокСрезПоследних.ДатаПоставки < &КонецПериода
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	УсловияСделокСрезПоследних.ДатаПоставки,
		|	_ЗадолженностиПоСедлкамРЕПО.Регистратор,
		|	_ЗадолженностиПоСедлкамРЕПО.ЧастьСделкиРЕПО,
		|	_ЗадолженностиПоСедлкамРЕПО.ВидДвижения,
		|	_ЗадолженностиПоСедлкамРЕПО.Рынок,
		|	_ЗадолженностиПоСедлкамРЕПО.ЦеннаяБумага,
		|	_ЗадолженностиПоСедлкамРЕПО.Валюта,
		|	_ЗадолженностиПоСедлкамРЕПО.Основание,
		|	_ЗадолженностиПоСедлкамРЕПО.КоличествоОстаток,
		|	УсловияСделокСрезПоследних.ДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты,
		|	_ЗадолженностиПоСедлкамРЕПО.ТипЗадолженности,
		|	_ЗадолженностиПоСедлкамРЕПО.ВидЗадолженности,
		|	_ЗадолженностиПоСедлкамРЕПО.СуммаОстаток,
		|	_ЗадолженностиПоСедлкамРЕПО.СуммаКупонаОстаток,
		|	СделкаРЕПОДокумент.Контрагент,
		|	СделкаРЕПОДокумент.МестоХранения,
		|	СделкаРЕПОДокумент.Брокер,
		|	СделкаРЕПОДокумент.РасчетныйСчет,
		|	УсловияСделокСрезПоследних.РаздельноеИсполнение,
		|	УсловияСделокСрезПоследних.ОтложенноеИсполнение
		|ИЗ
		|	_ЗадолженностиПоСедлкамРЕПО КАК _ЗадолженностиПоСедлкамРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 2
		|					И СделкаРЕПО В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЗадолженностиПоСедлкамРЕПО.Основание
		|						ИЗ
		|							_ЗадолженностиПоСедлкамРЕПО)) КАК УсловияСделокСрезПоследних
		|		ПО (_ЗадолженностиПоСедлкамРЕПО.ЧастьСделкиРЕПО = 2)
		|			И _ЗадолженностиПоСедлкамРЕПО.Основание = УсловияСделокСрезПоследних.СделкаРЕПО
		|			И _ЗадолженностиПоСедлкамРЕПО.Рынок = УсловияСделокСрезПоследних.Рынок
		|			И _ЗадолженностиПоСедлкамРЕПО.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|		ПО _ЗадолженностиПоСедлкамРЕПО.Основание = СделкаРЕПОДокумент.Ссылка
		|ГДЕ
		|	УсловияСделокСрезПоследних.ДатаПоставки < &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УсловияСделокСрезПоследних.ДатаПоставки,
		|	_ЗадолженностиПоСедлкамРЕПО.Регистратор,
		|	_ЗадолженностиПоСедлкамРЕПО.ЧастьСделкиРЕПО,
		|	_ЗадолженностиПоСедлкамРЕПО.ВидДвижения,
		|	_ЗадолженностиПоСедлкамРЕПО.Рынок,
		|	_ЗадолженностиПоСедлкамРЕПО.ЦеннаяБумага,
		|	_ЗадолженностиПоСедлкамРЕПО.Валюта,
		|	_ЗадолженностиПоСедлкамРЕПО.Основание,
		|	_ЗадолженностиПоСедлкамРЕПО.КоличествоОстаток,
		|	УсловияСделокСрезПоследних.ДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты,
		|	_ЗадолженностиПоСедлкамРЕПО.ТипЗадолженности,
		|	_ЗадолженностиПоСедлкамРЕПО.ВидЗадолженности,
		|	_ЗадолженностиПоСедлкамРЕПО.СуммаОстаток,
		|	_ЗадолженностиПоСедлкамРЕПО.СуммаКупонаОстаток,
		|	СделкаРЕПОДокумент.Контрагент,
		|	СделкаРЕПОДокумент.МестоХранения,
		|	СделкаРЕПОДокумент.Брокер,
		|	СделкаРЕПОДокумент.РасчетныйСчет,
		|	УсловияСделокСрезПоследних.РаздельноеИсполнение,
		|	УсловияСделокСрезПоследних.ОтложенноеИсполнение
		|ИЗ
		|	_ЗадолженностиПоСедлкамРЕПО КАК _ЗадолженностиПоСедлкамРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 1
		|					И СделкаРЕПО В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ЗадолженностиПоСедлкамРЕПО.Основание
		|						ИЗ
		|							_ЗадолженностиПоСедлкамРЕПО)) КАК УсловияСделокСрезПоследних
		|		ПО (_ЗадолженностиПоСедлкамРЕПО.ЧастьСделкиРЕПО = 1)
		|			И _ЗадолженностиПоСедлкамРЕПО.Основание = УсловияСделокСрезПоследних.СделкаРЕПО
		|			И _ЗадолженностиПоСедлкамРЕПО.Рынок = УсловияСделокСрезПоследних.Рынок
		|			И _ЗадолженностиПоСедлкамРЕПО.ЦеннаяБумага = УсловияСделокСрезПоследних.ЦеннаяБумага
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПОДокумент
		|		ПО _ЗадолженностиПоСедлкамРЕПО.Основание = СделкаРЕПОДокумент.Ссылка
		|ГДЕ
		|	УсловияСделокСрезПоследних.ДатаПоставки < &КонецПериода";
	Запрос.Выполнить();

КонецПроцедуры
 
Процедура ПолучитьПлановыеКупоныОфертыИПогашения(Запрос, Параметры)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.Облигация КАК Облигация,
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаПогашенияКупона,
		|	ВЫБОР
		|		КОГДА КупонныйДоходПоОблигациям.ДатаФиксации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА КупонныйДоходПоОблигациям.ДатаОкончанияКупона
		|		ИНАЧЕ КупонныйДоходПоОблигациям.ДатаФиксации
		|	КОНЕЦ КАК ДатаФиксации,
		|	КупонныйДоходПоОблигациям.СуммаКупона КАК СуммаКупона,
		|	Облигации.ДатаПогашения КАК ДатаПогашенияОблигации,
		|	Облигации.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _КупонныйДуходПоОблигациям
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО КупонныйДоходПоОблигациям.Облигация = Облигации.Ссылка
		|ГДЕ
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона МЕЖДУ &ТекущаяДата И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КупонныйДуходПоОблигациям.Облигация КАК Облигация,
		|	_КупонныйДуходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.Период КАК ДатаОстатков,
		|	ВЫБОР
		|		КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ОстаткиЦенныхБумагОстаткиИОбороты.Период
		|			ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток
		|		ИНАЧЕ ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток
		|	КОНЕЦ КАК КоличествоКонечныйОстаток,
		|	_КупонныйДуходПоОблигациям.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумагНаДатуФиксации
		|ИЗ
		|	_КупонныйДуходПоОблигациям КАК _КупонныйДуходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|				&НачДатаСФиксациями,
		|				&КонецПериода,
		|				День,
		|				ДвиженияИГраницыПериода,
		|				Организация = &Организация
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|		ПО _КупонныйДуходПоОблигациям.Облигация = ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага
		|			И _КупонныйДуходПоОблигациям.ДатаФиксации <= ОстаткиЦенныхБумагОстаткиИОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КупонныйДуходПоОблигациям.Облигация КАК Облигация,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|	_КупонныйДуходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период КАК ДатаОстатков,
		|	ВЫБОР
		|		КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период
		|			ТОГДА ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоКонечныйОстаток
		|		ИНАЧЕ ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.КоличествоНачальныйОстаток
		|	КОНЕЦ КАК КоличествоКонечныйОстаток,
		|	_КупонныйДуходПоОблигациям.СуммаКупона КАК СуммаКупона,
		|	ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.СделкаРЕПО КАК СделкаРЕПО
		|ПОМЕСТИТЬ _ОстаткиРЕПОПоБиржевымСделкам
		|ИЗ
		|	_КупонныйДуходПоОблигациям КАК _КупонныйДуходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.ОстаткиИОбороты(
		|				&НачДатаСФиксациями,
		|				&КонецПериода,
		|				День,
		|				ДвиженияИГраницыПериода,
		|				Организация = &Организация
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты
		|		ПО _КупонныйДуходПоОблигациям.Облигация = ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.ЦеннаяБумага
		|			И _КупонныйДуходПоОблигациям.ДатаФиксации <= ЗадолженностиПоВторойЧастиРЕПООстаткиИОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КупонныйДуходПоОблигациям.Облигация КАК Облигация,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|	_КупонныйДуходПоОблигациям.ДатаФиксации КАК ДатаФиксации,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период КАК ДатаОстатков,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА ВЫБОР
		|						КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|							ТОГДА ВЫБОР
		|									КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|										ТОГДА -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|									ИНАЧЕ -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоНачальныйОстаток
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|									ТОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|								ИНАЧЕ ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоНачальныйОстаток
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоВРЕПО,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА ВЫБОР
		|						КОГДА ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|							ТОГДА ВЫБОР
		|									КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|										ТОГДА -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|									ИНАЧЕ -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоНачальныйОстаток
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА _КупонныйДуходПоОблигациям.ДатаФиксации = ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|									ТОГДА -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток
		|								ИНАЧЕ -ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоНачальныйОстаток
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПОРЕПО,
		|	_КупонныйДуходПоОблигациям.СуммаКупона КАК СуммаКупона,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _ОстаткиРЕПОПоВнебиржевымСделкам
		|ИЗ
		|	_КупонныйДуходПоОблигациям КАК _КупонныйДуходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|				&НачДатаСФиксациями,
		|				&КонецПериода,
		|				День,
		|				ДвиженияИГраницыПериода,
		|				Организация = &Организация
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И (ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|						ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|		ПО _КупонныйДуходПоОблигациям.Облигация = ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага
		|			И _КупонныйДуходПоОблигациям.ДатаФиксации <= ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_КупонныйДуходПоОблигациям.Облигация,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияКупона,
		|	_КупонныйДуходПоОблигациям.ДатаФиксации,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.СчетДоверительногоУправления,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Период,
		|	_КупонныйДуходПоОблигациям.СуммаКупона,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Облигация КАК Облигация,
		|	_ОстаткиЦенныхБумагНаДатуФиксации.КоличествоКонечныйОстаток КАК КоличествоОблигацийКупон,
		|	ВложенныйЗапрос.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|	ВложенныйЗапрос.Облигация.ДатаПогашения КАК ДатаПогашенияОблигацииКупон,
		|	ВложенныйЗапрос.ДатаФиксации КАК ДатаФиксацииКупона,
		|	0 КАК КоличествоОблигацийВРЕПОКупон,
		|	0 КАК КоличествоОблигацийПоРЕПОКупон,
		|	_ОстаткиЦенныхБумагНаДатуФиксации.СуммаКупона КАК СуммаНаОднуОблигацию,
		|	NULL КАК Основание
		|ПОМЕСТИТЬ _ОстаткиНаДатуФиксации
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОстаткиЦенныхБумагНаДатуФиксации.Облигация КАК Облигация,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.ДатаФиксации КАК ДатаФиксации,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(_ОстаткиЦенныхБумагНаДатуФиксации.ДатаОстатков) КАК ДатаОстатков
		|	ИЗ
		|		_ОстаткиЦенныхБумагНаДатуФиксации КАК _ОстаткиЦенныхБумагНаДатуФиксации
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОстаткиЦенныхБумагНаДатуФиксации.ДатаФиксации,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.СчетДоверительногоУправления,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.Облигация,
		|		_ОстаткиЦенныхБумагНаДатуФиксации.ДатаПогашенияКупона) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиЦенныхБумагНаДатуФиксации КАК _ОстаткиЦенныхБумагНаДатуФиксации
		|		ПО ВложенныйЗапрос.Облигация = _ОстаткиЦенныхБумагНаДатуФиксации.Облигация
		|			И ВложенныйЗапрос.ДатаФиксации = _ОстаткиЦенныхБумагНаДатуФиксации.ДатаФиксации
		|			И ВложенныйЗапрос.ДатаПогашенияКупона = _ОстаткиЦенныхБумагНаДатуФиксации.ДатаПогашенияКупона
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиЦенныхБумагНаДатуФиксации.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ДатаОстатков = _ОстаткиЦенныхБумагНаДатуФиксации.ДатаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Облигация,
		|	0,
		|	ВложенныйЗапрос.ДатаПогашенияКупона,
		|	ВложенныйЗапрос.Облигация.ДатаПогашения,
		|	ВложенныйЗапрос.ДатаФиксации,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА _ОстаткиРЕПОПоБиржевымСделкам.КоличествоКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА _ОстаткиРЕПОПоБиржевымСделкам.КоличествоКонечныйОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	_ОстаткиРЕПОПоБиржевымСделкам.СуммаКупона,
		|	_ОстаткиРЕПОПоБиржевымСделкам.СделкаРЕПО
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОстаткиРЕПОПоБиржевымСделкам.Облигация КАК Облигация,
		|		_ОстаткиРЕПОПоБиржевымСделкам.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|		_ОстаткиРЕПОПоБиржевымСделкам.ДатаФиксации КАК ДатаФиксации,
		|		_ОстаткиРЕПОПоБиржевымСделкам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ОстаткиРЕПОПоБиржевымСделкам.ТипЗадолженности КАК ТипЗадолженности,
		|		МИНИМУМ(_ОстаткиРЕПОПоБиржевымСделкам.ДатаОстатков) КАК ДатаОстатков
		|	ИЗ
		|		_ОстаткиРЕПОПоБиржевымСделкам КАК _ОстаткиРЕПОПоБиржевымСделкам
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОстаткиРЕПОПоБиржевымСделкам.ДатаПогашенияКупона,
		|		_ОстаткиРЕПОПоБиржевымСделкам.Облигация,
		|		_ОстаткиРЕПОПоБиржевымСделкам.ДатаФиксации,
		|		_ОстаткиРЕПОПоБиржевымСделкам.СчетДоверительногоУправления,
		|		_ОстаткиРЕПОПоБиржевымСделкам.ТипЗадолженности) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиРЕПОПоБиржевымСделкам КАК _ОстаткиРЕПОПоБиржевымСделкам
		|		ПО ВложенныйЗапрос.Облигация = _ОстаткиРЕПОПоБиржевымСделкам.Облигация
		|			И ВложенныйЗапрос.ДатаПогашенияКупона = _ОстаткиРЕПОПоБиржевымСделкам.ДатаПогашенияКупона
		|			И ВложенныйЗапрос.ДатаФиксации = _ОстаткиРЕПОПоБиржевымСделкам.ДатаФиксации
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиРЕПОПоБиржевымСделкам.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ТипЗадолженности = _ОстаткиРЕПОПоБиржевымСделкам.ТипЗадолженности
		|			И ВложенныйЗапрос.ДатаОстатков = _ОстаткиРЕПОПоБиржевымСделкам.ДатаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Облигация,
		|	0,
		|	ВложенныйЗапрос.ДатаПогашенияКупона,
		|	ВложенныйЗапрос.Облигация.ДатаПогашения,
		|	ВложенныйЗапрос.ДатаФиксации,
		|	_ОстаткиРЕПОПоВнебиржевымСделкам.КоличествоВРЕПО,
		|	_ОстаткиРЕПОПоВнебиржевымСделкам.КоличествоПОРЕПО,
		|	_ОстаткиРЕПОПоВнебиржевымСделкам.СуммаКупона,
		|	_ОстаткиРЕПОПоВнебиржевымСделкам.Основание
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.Облигация КАК Облигация,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.ДатаПогашенияКупона КАК ДатаПогашенияКупона,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.ДатаФиксации КАК ДатаФиксации,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(_ОстаткиРЕПОПоВнебиржевымСделкам.ДатаОстатков) КАК ДатаОстатков
		|	ИЗ
		|		_ОстаткиРЕПОПоВнебиржевымСделкам КАК _ОстаткиРЕПОПоВнебиржевымСделкам
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.СчетДоверительногоУправления,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.Облигация,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.ДатаПогашенияКупона,
		|		_ОстаткиРЕПОПоВнебиржевымСделкам.ДатаФиксации) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиРЕПОПоВнебиржевымСделкам КАК _ОстаткиРЕПОПоВнебиржевымСделкам
		|		ПО ВложенныйЗапрос.Облигация = _ОстаткиРЕПОПоВнебиржевымСделкам.Облигация
		|			И ВложенныйЗапрос.ДатаПогашенияКупона = _ОстаткиРЕПОПоВнебиржевымСделкам.ДатаПогашенияКупона
		|			И ВложенныйЗапрос.ДатаФиксации = _ОстаткиРЕПОПоВнебиржевымСделкам.ДатаФиксации
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = _ОстаткиРЕПОПоВнебиржевымСделкам.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.ДатаОстатков = _ОстаткиРЕПОПоВнебиржевымСделкам.ДатаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПлановыеСделки.ЦеннаяБумага,
		|	_ПлановыеСделки.Количество,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияКупона,
		|	_КупонныйДуходПоОблигациям.ДатаПогашенияОблигации,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА _ПлановыеСделки.Количество
		|		ИНАЧЕ -_ПлановыеСделки.Количество
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ЧастьСделкиРЕПО = 2
		|				И _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -_ПлановыеСделки.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _ПлановыеСделки.ЧастьСделкиРЕПО = 2
		|				И _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА -_ПлановыеСделки.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	_КупонныйДуходПоОблигациям.СуммаКупона,
		|	NULL
		|ИЗ
		|	_ПлановыеСделки КАК _ПлановыеСделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КупонныйДуходПоОблигациям КАК _КупонныйДуходПоОблигациям
		|		ПО _ПлановыеСделки.ЦеннаяБумага = _КупонныйДуходПоОблигациям.Облигация
		|			И (_ПлановыеСделки.Период <= КОНЕЦПЕРИОДА(_КупонныйДуходПоОблигациям.ДатаФиксации, ДЕНЬ))
		|			И (_КупонныйДуходПоОблигациям.ДатаФиксации >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиНаДатуФиксации.ДатаПогашенияКупона КАК Период,
		|	ЗНАЧЕНИЕ(Документ.ПогашениеКупона.ПустаяСсылка) КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК Рынок,
		|	_ОстаткиНаДатуФиксации.Облигация КАК ЦеннаяБумага,
		|	_ОстаткиНаДатуФиксации.ДатаФиксацииКупона КАК ДатаФиксации,
		|	СУММА(_ОстаткиНаДатуФиксации.КоличествоОблигацийКупон) КАК Количество,
		|	СУММА(_ОстаткиНаДатуФиксации.КоличествоОблигацийВРЕПОКупон) КАК КоличествоВРЕПОКупон,
		|	СУММА(_ОстаткиНаДатуФиксации.КоличествоОблигацийПоРЕПОКупон) КАК КоличествоПоРЕПОКупон,
		|	_ОстаткиНаДатуФиксации.СуммаНаОднуОблигацию КАК СуммаНаОднуОблигацию,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход) КАК ВидДвижения,
		|	Облигации.ВалютаНоминала КАК ВалютаНоминала,
		|	_ОстаткиНаДатуФиксации.Основание КАК Основание
		|ПОМЕСТИТЬ _ПлановыеКупоны
		|ИЗ
		|	_ОстаткиНаДатуФиксации КАК _ОстаткиНаДатуФиксации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ОстаткиНаДатуФиксации.Облигация = Облигации.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиНаДатуФиксации.Облигация,
		|	_ОстаткиНаДатуФиксации.ДатаПогашенияКупона,
		|	_ОстаткиНаДатуФиксации.ДатаФиксацииКупона,
		|	_ОстаткиНаДатуФиксации.СуммаНаОднуОблигацию,
		|	Облигации.ВалютаНоминала,
		|	_ОстаткиНаДатуФиксации.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Облигация КАК Облигация,
		|	ВложенныйЗапрос.ДатаПогашения КАК ДатаПогашения,
		|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
		|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
		|	ВложенныйЗапрос.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ОстаткиОблигаций
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК Облигация,
		|		Облигации.ДатаПогашения КАК ДатаПогашения,
		|		ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|		ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|		Облигации.ВалютаНоминала КАК ВалютаНоминала
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|				&грКонецПериода,
		|				Организация = &Организация
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиЦенныхБумагОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ПО (Облигации.Ссылка = ОстаткиЦенныхБумагОстатки.ЦеннаяБумага)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ПлановыеСделки.ЦеннаяБумага,
		|		Облигации.ДатаПогашения,
		|		ВЫБОР
		|			КОГДА _ПлановыеСделки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ТОГДА _ПлановыеСделки.Количество
		|			ИНАЧЕ -_ПлановыеСделки.Количество
		|		КОНЕЦ,
		|		_ПлановыеСделки.Период,
		|		Облигации.ВалютаНоминала
		|	ИЗ
		|		_ПлановыеСделки КАК _ПлановыеСделки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ПО _ПлановыеСделки.ЦеннаяБумага = Облигации.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Облигация,
		|	ВложенныйЗапрос.ДатаПогашения,
		|	ВложенныйЗапрос.ВалютаНоминала
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.Период КАК Период,
		|	ЗНАЧЕНИЕ(Документ.ПогашениеЦеннойБумаги.ПустаяСсылка) КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК Рынок,
		|	_ОстаткиОблигаций.Облигация КАК ЦеннаяБумага,
		|	СУММА(_ОстаткиОблигаций.КоличествоОстаток) КАК КоличествоОстатокОблигации,
		|	НоминалыЦенныхБумаг.СуммаИзменения КАК СуммаИзмененияНоминалаОблигации,
		|	СУММА(_ОстаткиОблигаций.КоличествоОстаток * НоминалыЦенныхБумаг.СуммаИзменения) КАК ОжидаемаяСуммаОблигации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ЧастичноеПогашение) КАК ВидПогашения,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход) КАК ВидДвижения,
		|	_ОстаткиОблигаций.ВалютаНоминала КАК ВалютаНоминала
		|ПОМЕСТИТЬ _ПлановыеПогашения
		|ИЗ
		|	_ОстаткиОблигаций КАК _ОстаткиОблигаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|		ПО _ОстаткиОблигаций.Облигация = НоминалыЦенныхБумаг.ЦеннаяБумага
		|			И (НоминалыЦенныхБумаг.Период МЕЖДУ &ТекущаяДата И &КонецПериода)
		|			И (НЕ _ОстаткиОблигаций.Облигация.ИндексируемыйНоминал)
		|			И _ОстаткиОблигаций.Период <= НоминалыЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиОблигаций.Облигация,
		|	НоминалыЦенныхБумаг.Период,
		|	НоминалыЦенныхБумаг.СуммаИзменения,
		|	_ОстаткиОблигаций.ВалютаНоминала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиОблигаций.ДатаПогашения,
		|	ЗНАЧЕНИЕ(Документ.ПогашениеЦеннойБумаги.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации),
		|	_ОстаткиОблигаций.Облигация,
		|	СУММА(_ОстаткиОблигаций.КоличествоОстаток),
		|	ВложенныйЗапрос.Номинал,
		|	СУММА(_ОстаткиОблигаций.КоличествоОстаток * ВложенныйЗапрос.Номинал),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.ПолноеПогашение),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	_ОстаткиОблигаций.ВалютаНоминала
		|ИЗ
		|	_ОстаткиОблигаций КАК _ОстаткиОблигаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НоминалыЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|			НоминалыЦенныхБумаг.Номинал КАК Номинал
		|		ИЗ
		|			(ВЫБРАТЬ
		|				НоминалыЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК Период
		|			ИЗ
		|				_ОстаткиОблигаций КАК _ОстаткиОблигаций
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО _ОстаткиОблигаций.Облигация = НоминалыЦенныхБумаг.ЦеннаяБумага
		|						И _ОстаткиОблигаций.ДатаПогашения >= НоминалыЦенныхБумаг.Период
		|			
		|			СГРУППИРОВАТЬ ПО
		|				НоминалыЦенныхБумаг.ЦеннаяБумага) КАК ВложенныйЗапрос
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|				ПО ВложенныйЗапрос.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|					И ВложенныйЗапрос.Период = НоминалыЦенныхБумаг.Период) КАК ВложенныйЗапрос
		|		ПО _ОстаткиОблигаций.Облигация = ВложенныйЗапрос.ЦеннаяБумага
		|			И (_ОстаткиОблигаций.Период <= _ОстаткиОблигаций.ДатаПогашения)
		|ГДЕ
		|	_ОстаткиОблигаций.ДатаПогашения МЕЖДУ &ТекущаяДата И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиОблигаций.Облигация,
		|	ВложенныйЗапрос.Номинал,
		|	_ОстаткиОблигаций.ДатаПогашения,
		|	_ОстаткиОблигаций.ВалютаНоминала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияОферт.ДатаВыкупа КАК Период,
		|	ВЫБОР
		|		КОГДА УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПокупка)
		|				ИЛИ УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно)
		|			ТОГДА ЗНАЧЕНИЕ(Документ.ПогашениеЦеннойБумаги.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|	КОНЕЦ КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК Рынок,
		|	_ОстаткиОблигаций.Облигация КАК Облигация,
		|	_ОстаткиОблигаций.КоличествоОстаток КАК КоличествоОстаток,
		|	УсловияОферт.ТипОферты КАК ТипОферты,
		|	УсловияОферт.Цена КАК Цена,
		|	_ОстаткиОблигаций.ВалютаНоминала КАК ВалютаНоминала,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход) КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПокупка)
		|				ИЛИ УсловияОферт.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.Досрочно)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПогашения.Оферта)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидПогашения
		|ПОМЕСТИТЬ _ПлановыеОферты
		|ИЗ
		|	_ОстаткиОблигаций КАК _ОстаткиОблигаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО _ОстаткиОблигаций.Облигация = УсловияОферт.Облигация
		|			И (НЕ УсловияОферт.ТолькоДляФизическихЛиц)
		|			И (УсловияОферт.ДатаВыкупа МЕЖДУ &ТекущаяДата И &КонецПериода)
		|			И (_ОстаткиОблигаций.Период <= КОНЕЦПЕРИОДА(УсловияОферт.ДатаВыкупа, ДЕНЬ))
		|			И (&ВсеТипыОферт
		|				ИЛИ УсловияОферт.ТипОферты В (&ТипыОферт))";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПлановыеОферты.Облигация КАК Облигация
		|ИЗ
		|	_ПлановыеОферты КАК _ПлановыеОферты
		|ГДЕ
		|	(_ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ОфертаПродажа)
		|			ИЛИ _ПлановыеОферты.ТипОферты = ЗНАЧЕНИЕ(Перечисление.ТипыОфертПоОблигациям.ДопОферта))";
	
	Облигации = Запрос.Выполнить().Выгрузить();
	Облигации.Колонки.Добавить("Купон", Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.ACCINT.Тип);
	
	Для каждого СтрокаОблигаций Из Облигации Цикл
		СтрокаОблигаций.Купон = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(
			СтрокаОблигаций.Облигация, 
			НачалоДня(Параметры.Период), 
			Параметры.СчетДоверительногоУправления);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Купоны", Облигации);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Купоны.Облигация КАК Облигация,
		|	Купоны.Купон КАК Купон
		|ПОМЕСТИТЬ _Купоны
		|ИЗ
		|	&Купоны КАК Купоны";
	
	Запрос.Выполнить();

КонецПроцедуры
 
Процедура ПолучитьЗадолженностиПоДСКПогашению(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупонаОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоДС
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&грКонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НЕ Аванс) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоДС.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта КАК ВалютаСделки,
		|	_ЗадолженностиПоДС.Основание КАК Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток КАК Сумма,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток КАК СуммаКупона,
		|	_ЗадолженностиПоДС.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _ЗадолженностиПоДСКПогашению
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
		|		ПО _ЗадолженностиПоДС.Основание = НачислениеЗадолженности.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыОплат КАК ПлановыеДатыОплат
		|		ПО (ПлановыеДатыОплат.Организация = &Организация)
		|			И (ПлановыеДатыОплат.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И _ЗадолженностиПоДС.Основание = ПлановыеДатыОплат.Основание
		|			И _ЗадолженностиПоДС.ВидЗадолженности = ПлановыеДатыОплат.ВидЗадолженности
		|			И (ПлановыеДатыОплат.ДатаОплаты МЕЖДУ &ТекущаяДата И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоДС.ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта,
		|	_ЗадолженностиПоДС.Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток,
		|	_ЗадолженностиПоДС.Контрагент
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаСВалютой КАК СделкаСВалютой
		|		ПО _ЗадолженностиПоДС.Основание = СделкаСВалютой.Ссылка
		|			И (СделкаСВалютой.ОтложенноеИсполнение
		|				И (СделкаСВалютой.ДатаИсполнения МЕЖДУ &ТекущаяДата И &КонецПериода))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоДС.ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта,
		|	_ЗадолженностиПоДС.Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток,
		|	_ЗадолженностиПоДС.Контрагент
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО _ЗадолженностиПоДС.Основание = УсловияСделокСрезПоследних.Сделка
		|			И (_ЗадолженностиПоДС.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))
		|			И (УсловияСделокСрезПоследних.ДатаОплаты МЕЖДУ &ТекущаяДата И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоДС.ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта,
		|	_ЗадолженностиПоДС.Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток,
		|	_ЗадолженностиПоДС.Контрагент
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО _ЗадолженностиПоДС.Основание = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|			И _ЗадолженностиПоДС.ВидЗадолженности = УсловияСделокРЕПОСрезПоследних.ВидЗадолженности
		|			И (УсловияСделокРЕПОСрезПоследних.ДатаОплаты МЕЖДУ &ТекущаяДата И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоДС.ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта,
		|	_ЗадолженностиПоДС.Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток,
		|	_ЗадолженностиПоДС.Контрагент
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
		|		ПО _ЗадолженностиПоДС.Основание = НачислениеДивидендов.Ссылка
		|			И (НачислениеДивидендов.ДатаОплатыПлановая МЕЖДУ &ТекущаяДата И &КонецПериода)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗадолженностиПоДС.ТипЗадолженности,
		|	_ЗадолженностиПоДС.ВидЗадолженности,
		|	_ЗадолженностиПоДС.Валюта,
		|	_ЗадолженностиПоДС.Основание,
		|	_ЗадолженностиПоДС.СуммаОстаток,
		|	_ЗадолженностиПоДС.СуммаКупонаОстаток,
		|	_ЗадолженностиПоДС.Контрагент
		|ИЗ
		|	_ЗадолженностиПоДС КАК _ЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|		ПО _ЗадолженностиПоДС.Основание = ПогашениеЦеннойБумаги.Ссылка
		|			И (ПогашениеЦеннойБумаги.ДатаОплатыПлановая МЕЖДУ &ТекущаяДата И &КонецПериода)";
	Запрос.Выполнить();

КонецПроцедуры
 
Процедура ПолучитьЗакрытыеДепозиты(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент КАК ДепозитныйВклад,
		|	0 КАК Сумма,
		|	БанковскиеСчета.Валюта КАК Валюта,
		|	УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчет,
		|	ВЫБОР
		|		КОГДА ДепозитныеВклады.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|		ИНАЧЕ ДепозитныеВклады.МестоХранения
		|	КОНЕЦ КАК МестоХранения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
		|			&грКонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&грКонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&грКонецПериода, ) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ПО ДепозитныеВклады.БанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент = ДепозитныеВклады.Ссылка
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения МЕЖДУ &ТекущаяДата И &КонецПериода";
	
	Депозиты = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из Депозиты Цикл
		ТекСтрока.Сумма = РаботаСКредитнымиИнструментами.ПолучитьСтоимостьКредитногоИнструмента(ТекСтрока.ДепозитныйВклад, ТекСтрока.ДатаПогашения, ТекСтрока.СчетДоверительногоУправления);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ПлановыеДепозиты", Депозиты);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеДепозиты.МестоХранения КАК МестоХранения,
		|	ПлановыеДепозиты.РасчетныйСчет КАК РасчетныйСчет,
		|	ПлановыеДепозиты.Валюта КАК Валюта,
		|	ПлановыеДепозиты.Сумма КАК Сумма
		|ПОМЕСТИТЬ _ПлановыеДепозиты
		|ИЗ
		|	&ПлановыеДепозиты КАК ПлановыеДепозиты";
	
	Запрос.Выполнить();

КонецПроцедуры
 
Процедура ПолучитьЗакрытыеМНО(Запрос)

	Запрос.УстановитьПараметр("грКонецТекущегоДня", Новый Граница(КонецДня(Запрос.Параметры.ТекущаяДата), ВидГраницы.Включая));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстатки.МНО КАК МНО,
		|	ДенежныеСредстваМНООстатки.РасчетныйСчет КАК РасчетныйСчет,
		|	БанковскиеСчета.Валюта КАК Валюта,
		|	0 КАК СуммаПроцентов,
		|	ДокументМНО.ДатаВозврата КАК ДатаВозврата,
		|	ДокументМНО.Дата КАК Дата,
		|	ДокументМНО.Сумма КАК Сумма,
		|	ДокументМНО.Процент КАК Процент
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|			&грКонецТекущегоДня,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ДенежныеСредстваМНООстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МНО КАК ДокументМНО
		|		ПО ДенежныеСредстваМНООстатки.МНО = ДокументМНО.Ссылка
		|			И (ДокументМНО.ДатаВозврата МЕЖДУ &ТекущаяДата И &КонецПериода)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО ДенежныеСредстваМНООстатки.РасчетныйСчет = БанковскиеСчета.Ссылка";
	
	МНО = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из МНО Цикл
		ТекСтрока.СуммаПроцентов = РаботаСМНО.РасчетСуммыМНО(ТекСтрока, ТекСтрока.ДатаВозврата);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ПлановыеМНО", МНО);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеМНО.РасчетныйСчет КАК РасчетныйСчет,
		|	ПлановыеМНО.Валюта КАК Валюта,
		|	ПлановыеМНО.СуммаПроцентов КАК Сумма
		|ПОМЕСТИТЬ _ПлановыеМНО
		|ИЗ
		|	&ПлановыеМНО КАК ПлановыеМНО";
	
	Запрос.Выполнить();

КонецПроцедуры
 
