
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Период") И ЗначениеЗаполнено(Параметры.Период) Тогда
		ЭтаФорма.Период = Параметры.Период;
	Иначе
		ЭтаФорма.Период = ТекущаяДата();
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Период",				ЭтаФорма.Период);
	Список.Параметры.УстановитьЗначениеПараметра("ОтбражатьАктуальные", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСкрытьАктуальных(Команда)
	
	Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка = Не Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтбражатьАктуальные",
		Элементы.ФормаКомандаПоказатьСкрытьАктуальных.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	
КонецПроцедуры
