// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка, "Формирование регистраций сведений о бумагах на новую оферту", "0.00", "", Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Возвращает параметры выполняемой по регламентному заданию команды для подключения к механизму регистрации работы
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды  
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(ИдентификаторКоманды, ПараметрыКоманды)
	
	ПараметрыОтчета = Новый Соответствие();
	ПараметрыОтчета.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ПараметрыОтчета.Вставить("Период", ЭтотОбъект.Период);

	Если ПараметрыКоманды.Свойство("Организация") Тогда
		ПараметрыОтчета.Вставить("Организация", ПараметрыКоманды.Организация);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("ПолучателиОповещения") Тогда
		ПараметрыОтчета.Вставить("ПолучателиОповещения", ПараметрыКоманды.ПолучателиОповещения);
	КонецЕсли;
	
	Описание = "";
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Описание = Описание + ПараметрОтчета.Ключ + ": " + ПараметрОтчета.Значение + Символы.ПС;		
	КонецЦикла;
	Описание = Лев(Описание, СтрДлина(Описание) - СтрДлина(Символы.ПС));	
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета);
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод = "СформироватьРегистрацийСведенийОБумагахНаНовуюОферту" Тогда
		Для Каждого ТекЭкземпляр Из Экземпляры Цикл
			СформироватьРегистрацийСведенийОБумагахНаНовуюОферту(ТекЭкземпляр.Параметры);
		КонецЦикла;	
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьРегистрацийСведенийОБумагахНаНовуюОферту(Параметры)

	Период = Параметры.Период;
	Организация = Параметры.Организация;

	Результат = НайтиСлучаиОферт(Организация, Период);

	Для каждого СтрокаРегистрации Из Результат.Регистрации Цикл
		Если СтрокаРегистрации.Соответствует Тогда
			Продолжить;
		КонецЕсли;
		СформироватьОбновитьДокументСведений(Организация, Период, СтрокаРегистрации.Облигация, СтрокаРегистрации.Клиент, СтрокаРегистрации.ДокументСведений, Результат.Партии);
		// прикрутить оповещение
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСлучаиОферт(Организация, Период) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КупонныйДоходПоОблигациям.Облигация КАК Облигация
		|ПОМЕСТИТЬ _Облигации
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОферт КАК УсловияОферт
		|		ПО КупонныйДоходПоОблигациям.Облигация = УсловияОферт.Облигация
		|			И КупонныйДоходПоОблигациям.Период < УсловияОферт.ДатаОбъявления
		|			И КупонныйДоходПоОблигациям.ДатаОкончанияКупона >= УсловияОферт.ДатаОбъявления
		|ГДЕ
		|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВложенныйЗапрос.Партия КАК Партия,
		|	ВложенныйЗапрос.СтрокаПартии КАК СтрокаПартии,
		|	ВложенныйЗапрос.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	РешенияКлиентовПоЗначениямЭСП.ЭСП КАК ЭСП,
		|	РешенияКлиентовПоЗначениямЭСП.Используется КАК Используется
		|ПОМЕСТИТЬ _РешенияЭСП
		|ИЗ
		|	(ВЫБРАТЬ
		|		РешенияКлиентовПоЗначениямЭСП.ЦеннаяБумага КАК ЦеннаяБумага,
		|		РешенияКлиентовПоЗначениямЭСП.Партия КАК Партия,
		|		РешенияКлиентовПоЗначениямЭСП.СтрокаПартии КАК СтрокаПартии,
		|		МАКСИМУМ(РешенияКлиентовПоЗначениямЭСП.ДатаНачалаДействия) КАК ДатаНачалаДействия
		|	ИЗ
		|		РегистрСведений.РешенияКлиентовПоЗначениямЭСП КАК РешенияКлиентовПоЗначениямЭСП
		|	ГДЕ
		|		РешенияКлиентовПоЗначениямЭСП.ЦеннаяБумага В
		|				(ВЫБРАТЬ
		|					_Облигации.Облигация
		|				ИЗ
		|					_Облигации КАК _Облигации)
		|		И РешенияКлиентовПоЗначениямЭСП.Период < &Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РешенияКлиентовПоЗначениямЭСП.Партия,
		|		РешенияКлиентовПоЗначениямЭСП.СтрокаПартии,
		|		РешенияКлиентовПоЗначениямЭСП.ЦеннаяБумага) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РешенияКлиентовПоЗначениямЭСП КАК РешенияКлиентовПоЗначениямЭСП
		|		ПО ВложенныйЗапрос.ЦеннаяБумага = РешенияКлиентовПоЗначениямЭСП.ЦеннаяБумага
		|			И ВложенныйЗапрос.Партия = РешенияКлиентовПоЗначениямЭСП.Партия
		|			И ВложенныйЗапрос.СтрокаПартии = РешенияКлиентовПоЗначениямЭСП.СтрокаПартии
		|			И ВложенныйЗапрос.ДатаНачалаДействия = РешенияКлиентовПоЗначениямЭСП.ДатаНачалаДействия
		|ГДЕ
		|	РешенияКлиентовПоЗначениямЭСП.Используется
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК Облигация,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	_РешенияЭСП.ЭСП КАК ЭСП,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ИСТИНА КАК Используется
		|ПОМЕСТИТЬ _ОблигацииКлиентыПартии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|				И ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_Облигации.Облигация
		|					ИЗ
		|						_Облигации КАК _Облигации)) КАК БухПартииЦенныхБумагОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РешенияЭСП КАК _РешенияЭСП
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = _РешенияЭСП.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстатки.Партия = _РешенияЭСП.Партия
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = _РешенияЭСП.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОблигацииКлиенты.Облигация КАК Облигация,
		|	_ОблигацииКлиенты.Клиент КАК Клиент,
		|	ЕСТЬNULL(РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Ссылка, ЗНАЧЕНИЕ(Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПустаяСсылка)) КАК ДокументСведений,
		|	ЛОЖЬ КАК Пометка,
		|	ЛОЖЬ КАК Соответствует
		|ПОМЕСТИТЬ _ОблигацииКлиентыДокументы
		|ИЗ
		|	_ОблигацииКлиентыПартии КАК _ОблигацииКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах КАК РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах
		|		ПО _ОблигацииКлиенты.Облигация = РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ЦеннаяБумага
		|			И _ОблигацииКлиенты.Клиент = РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Клиент
		|			И (НАЧАЛОПЕРИОДА(РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Дата, ДЕНЬ) = &Период)
		|			И (РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.Проведен)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Регистрации = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОблигацииКлиентыДокументы"].ПолучитьДанные().Выгрузить();
	Партии = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОблигацииКлиентыПартии"].ПолучитьДанные().Выгрузить();

	Для каждого СтрокаРегистрации Из Регистрации Цикл
		
		#Область Рассчитаем_новые_ЭСП_и_потоки
		
		СтрокиПартий = Партии.НайтиСтроки(Новый Структура("Облигация, Клиент", СтрокаРегистрации.Облигация, СтрокаРегистрации.Клиент));
		
		УчетныйАктивЕПС = СтрокиПартий[0].УчетныйАктивЕПС; // предполагается, что он может быть только один
		СчетДоверительногоУправления = СтрокиПартий[0].СчетДоверительногоУправления; // берем 1го - настройки должны быть идентичны
		
		НастройкиУчетаОбщие			= БухгалтерскийУчет.ОпределитьНастройкиУчета(Период, Организация, СчетДоверительногоУправления);
		НастройкиУчетаЦеннойБумаги	= БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(НастройкиУчетаОбщие, СтрокаРегистрации.Облигация, УчетныйАктивЕПС);
		
		ДенежныйПотокПослеОбъявленияОферты = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
			Организация, СтрокаРегистрации.Клиент, СтрокаРегистрации.Облигация, Период, Ложь, УчетныйАктивЕПС);
			
		// на вчера, пока еще не была объявлана оферта
		ДенежныйПотокДоОбъявленияОферты = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(
			Организация, СтрокаРегистрации.Клиент, СтрокаРегистрации.Облигация, Период, Истина, УчетныйАктивЕПС,,, НачалоДня(Период) - 1);
		
		Если ДенежныйПотокДоОбъявленияОферты.Количество() > 0 // если, вдруг, при взятии потока за вчера, попадет приход денег за сегодня (а он нам не нужен) - уберем
			И НачалоДня(ДенежныйПотокДоОбъявленияОферты[0].ДатаПотока) = НачалоДня(Период) Тогда
		
			ДенежныйПотокДоОбъявленияОферты.Удалить(0);
		
		КонецЕсли;

		ДенежныйПотокДоОбъявленияОферты.Колонки.Добавить("РазностьДат", Новый ОписаниеТипов("Число"));
		Для каждого СтрокаДенежныйПоток Из ДенежныйПотокДоОбъявленияОферты Цикл
			СтрокаДенежныйПоток.РазностьДат = (НачалоДня(СтрокаДенежныйПоток.ДатаПотока) - НачалоДня(Период)) / 86400;
		КонецЦикла;
		
		Для каждого СтрокаПартий Из СтрокиПартий Цикл
		
			// 1. считаем АС исходя из старой ЭСП и денежного потока ДО объявления оферты
			СтоимостьПоЭСП = 0;
			Для каждого СтрокаДенежныйПоток Из ДенежныйПотокДоОбъявленияОферты Цикл
				СтоимостьПоЭСП = СтоимостьПоЭСП + СтрокаДенежныйПоток.СуммаПотока / Pow(1 + СтрокаПартий.ЭСП / 100, СтрокаДенежныйПоток.РазностьДат / 365);
			КонецЦикла;
			Если НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияАС <> 0 Тогда
				СтоимостьПоЭСП = Окр(СтоимостьПоЭСП, НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияАС);
			КонецЕсли;
			
			// 2. берем АС из п.1 за цену покупки и считаем новую ЭСП и денежного потока ПОСЛЕ объявления оферты
			НоваяЭСП = БухгалтерскийУчет.РассчитатьДоходностьИДюрациюПоПотоку(ДенежныйПотокПослеОбъявленияОферты, НачалоДня(Период), -СтоимостьПоЭСП).Доходность;
			Если НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП <> 0 Тогда
				НоваяЭСП = Окр(НоваяЭСП, НастройкиУчетаЦеннойБумаги.РазрядностьОкругленияЭСП);
			КонецЕсли;
			СтрокаПартий.ЭСП = НоваяЭСП;
			
		КонецЦикла;

		#КонецОбласти
		
		#Область Сверим_с_документом
		
		Если СтрокаРегистрации.ДокументСведений <> Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПустаяСсылка() Тогда
			
			ДокументОбъект = СтрокаРегистрации.ДокументСведений.ПолучитьОбъект();	
			
			Если ДенежныйПотокПослеОбъявленияОферты.Количество() = ДокументОбъект.Потоки.Количество()
				И ДокументОбъект.ЭСП.Количество() = СтрокиПартий.Количество() Тогда
			
				ЕстьНесовпадение = Ложь;
				Для каждого СтрокаПотокиРасчетные Из ДенежныйПотокПослеОбъявленияОферты Цикл
					Для каждого СтрокаПотокиДокумент Из ДокументОбъект.Потоки Цикл
						Если СтрокаПотокиДокумент.ДатаПотока = СтрокаПотокиРасчетные.ДатаПотока
							И СтрокаПотокиДокумент.СуммаПотока <> СтрокаПотокиРасчетные.СуммаПотока Тогда
						
							ЕстьНесовпадение = Истина;
							Прервать;
						
						КонецЕсли;
					КонецЦикла;
					Если ЕстьНесовпадение Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ЕстьНесовпадение Тогда
				
					Для каждого СтрокаПартий Из СтрокиПартий Цикл
						Для каждого СтрокаЭСП Из ДокументОбъект.ЭСП Цикл
							Если СтрокаПартий.Партия = СтрокаЭСП.Партия
								И СтрокаПартий.СтрокаПартии = СтрокаЭСП.СтрокаПартии
								И СтрокаПартий.ЭСП <> СтрокаЭСП.ЭСП Тогда
								
								ЕстьНесовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ЕстьНесовпадение Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					СтрокаРегистрации.Соответствует = НЕ ЕстьНесовпадение;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЦикла;
	
	Возврат Новый Структура("Регистрации, Партии", Регистрации, Партии);
	
КонецФункции

Процедура СформироватьОбновитьДокументСведений(Организация, Период, Облигация, Клиент, ДокументСведений, Партии) Экспорт

	Если ДокументСведений = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПустаяСсылка() Тогда
		ДокументОбъект = Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.СоздатьДокумент();
		ДокументОбъект.Дата = Период;
		ДокументОбъект.ДатаНачалаДействия = Период + 24 * 60 * 60;
		ДокументОбъект.Клиент = Клиент;
		ДокументОбъект.Организация = Организация;
		ДокументОбъект.ЦеннаяБумага = Облигация;
		ДокументОбъект.ТипСведений = "ЭСП, Потоки";
		ДокументОбъект.Ответственный = РегистрыСведений.ОтветственныеЗаОперации.ОпределитьОтветственного(
											Организация,
											"РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах",
											Неопределено,
											Период,
											Справочники.Сотрудники.ПустаяСсылка()).Пользователь;
	Иначе
		ДокументОбъект = ДокументСведений.Получитьобъект();
	КонецЕсли;

	ДокументОбъект.Потоки.Очистить();
	ДокументОбъект.ЭСП.Очистить();
	
	СтрокиПартий = Партии.НайтиСтроки(Новый Структура("Облигация, Клиент", Облигация, Клиент));
	
	УчетныйАктивЕПС = СтрокиПартий[0].УчетныйАктивЕПС; // предполагается, что он может быть только один
	
	ДокументОбъект.Потоки.Загрузить(Документы.РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.ПолучитьДенежныйПоток(Организация, Клиент, Облигация, Период, Ложь, УчетныйАктивЕПС));
	
	Для каждого СтрокаПартий Из СтрокиПартий Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.ЭСП.Добавить(), СтрокаПартий);
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
