      
Функция СформироватьДанныеДляЭкспорта(ПараметрыФормирования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
		
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВнешнихСистем.Объект КАК Объект,
		|	КодыВнешнихСистем.ВнешняяСистема КАК ВнешняяСистема,
		|	КодыВнешнихСистем.Код КАК Код
		|ПОМЕСТИТЬ _КодыВнешнихСистем
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема В (ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра), ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс))
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Банки), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыВнешнихСистем
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыПИФ.Клиент КАК Актив,
		|	КлиентыПИФ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаПиф
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &КонецПериода)) КАК КлиентыПИФ
		|ГДЕ
		|	ВЫРАЗИТЬ(КлиентыПИФ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.ДатаЗаявки КАК ДатаЗаявки,
		|	ВложенныйЗапрос.НомерЗаявки КАК НомерЗаявки,
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.Тип КАК Тип,
		|	ВложенныйЗапрос.Актив КАК Актив,
		|	ВложенныйЗапрос.АктивДляОбмена КАК АктивДляОбмена,
		|	ВложенныйЗапрос.Основная КАК Основная,
		|	ВложенныйЗапрос.ВидЗаявки КАК ВидЗаявки,
		|	ВложенныйЗапрос.Статус КАК Статус,
		|	КодыЗаявокПервойФормы.Код КАК КодЗаявки1Ф,
		|	_КодыПервойФормыПифов.Код КАК КодАктива1Ф,
		|	_КодыПервойФормыПифовДляОбмена.Код КАК КодАктиваДляОбмена1Ф,
		|	_КодыКлиентовПервойФормы.Код КАК КодКлиента1Ф
		|ПОМЕСТИТЬ _ЗаявкиКлиентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДокЗаявкаПайщика.Ссылка КАК Ссылка,
		|		ДокЗаявкаПайщика.НомерЗаявки КАК НомерЗаявки,
		|		ДокЗаявкаПайщика.Дата КАК ДатаЗаявки,
		|		ДокЗаявкаПайщика.Пайщик КАК Клиент,
		|		ДокЗаявкаПайщика.Сумма КАК Сумма,
		|		ДокЗаявкаПайщика.Количество КАК Количество,
		|		ДокЗаявкаПайщика.ВидЗаявки КАК ВидЗаявки,
		|		ВЫБОР
		|			КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление)
		|				ТОГДА ""Приобретение паев""
		|			КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Погашение)
		|				ТОГДА ""Погашение паев""
		|			КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА ""Обмен паев""
		|		КОНЕЦ КАК Тип,
		|		ДокЗаявкаПайщика.ПаевойИнвестиционныйФонд КАК Актив,
		|		ДокЗаявкаПайщика.ПаевойИнвестиционныйФондДляОбменаПаев КАК АктивДляОбмена,
		|		ДокЗаявкаПайщика.ВыгружатьОперацииВЕСИАФинанс КАК Основная,
		|		СтатусыЗаявокПайщиковСрезПоследних.Статус КАК Статус
		|	ИЗ
		|		Документ.ЗаявкаПайщика КАК ДокЗаявкаПайщика
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаПиф КАК _СчетаПиф
		|			ПО ДокЗаявкаПайщика.ПаевойИнвестиционныйФонд = _СчетаПиф.Актив
		|				И (ДокЗаявкаПайщика.Организация = &Организация)
		|				И (ДокЗаявкаПайщика.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|				И (ВЫРАЗИТЬ(ДокЗаявкаПайщика.Пайщик КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|				И (НЕОПРЕДЕЛЕНО В (&Клиенты)
		|					ИЛИ ДокЗаявкаПайщика.Пайщик В (&Клиенты))
		|				И (ДокЗаявкаПайщика.ВыгружатьОперацииВЕСИАФинанс)
		|				И (НЕ ДокЗаявкаПайщика.ПометкаУдаления)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПайщиков.СрезПоследних(, Организация = &Организация) КАК СтатусыЗаявокПайщиковСрезПоследних
		|			ПО ДокЗаявкаПайщика.Ссылка = СтатусыЗаявокПайщиковСрезПоследних.ЗаявкаПайщика) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК КодыЗаявокПервойФормы
		|		ПО ВложенныйЗапрос.Ссылка = КодыЗаявокПервойФормы.Объект
		|			И (КодыЗаявокПервойФормы.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормыПифов
		|		ПО ВложенныйЗапрос.Актив = _КодыПервойФормыПифов.Объект
		|			И (_КодыПервойФормыПифов.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормыПифовДляОбмена
		|		ПО ВложенныйЗапрос.АктивДляОбмена = _КодыПервойФормыПифовДляОбмена.Объект
		|			И (_КодыПервойФормыПифовДляОбмена.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыКлиентовПервойФормы
		|		ПО ВложенныйЗапрос.Клиент = _КодыКлиентовПервойФормы.Объект
		|			И (_КодыКлиентовПервойФормы.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыПервойФормы.Код КАК Код1Ф,
		|	РеквизитыФизическихЛицАнкетные.Регистратор КАК Анкета,
		|	РеквизитыФизическихЛицАнкетные.ЮрФизЛицо КАК Ссылка,
		|	РеквизитыФизическихЛицАнкетные.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетные.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетные.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетные.Пол КАК Пол,
		|	РеквизитыФизическихЛицАнкетные.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетные.СерияУдостоверенияЛичности КАК СерияДокумента,
		|	РеквизитыФизическихЛицАнкетные.НомерУдостоверенияЛичности КАК НомерДокумента,
		|	РеквизитыФизическихЛицАнкетные.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиДокумента,
		|	РеквизитыФизическихЛицАнкетные.ДатаОкончанияДействияУдостоверенияЛичности КАК ДатаОкончанияДействияДокумента,
		|	РеквизитыФизическихЛицАнкетные.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийДокумент,
		|	РеквизитыФизическихЛицАнкетные.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодПодразделения,
		|	РеквизитыФизическихЛицАнкетные.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетные.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетные.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетные.Телефоны КАК Телефоны,
		|	НЕ _КодыПользователейЕсиаФинанс.Код ЕСТЬ NULL КАК АктивированЛичныйКабинетЕсиа
		|ПОМЕСТИТЬ _АнкетныеДанныеКлиентов
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЗаявкиКлиентов.Клиент
		|					ИЗ
		|						_ЗаявкиКлиентов КАК _ЗаявкиКлиентов)) КАК РеквизитыФизическихЛицАнкетные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормы
		|		ПО РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = _КодыПервойФормы.Объект
		|			И (_КодыПервойФормы.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПользователейЕсиаФинанс
		|		ПО РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = _КодыПользователейЕсиаФинанс.Объект
		|			И (_КодыПользователейЕсиаФинанс.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет КАК Ссылка,
		|	_АнкетныеДанныеКлиентов.Ссылка КАК Клиент,
		|	_АнкетныеДанныеКлиентов.Код1Ф КАК КодКлиента1Ф,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.БИК КАК Бик,
		|	Банки.Ссылка КАК Банк,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСчета КАК НомерСчета,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.КоррСчет КАК КоррСчет,
		|	_КодыПервойФормы.Код КАК КодБанка1Ф
		|ПОМЕСТИТЬ _БанковскиеРеквизиты
		|ИЗ
		|	Документ.АнкетаФизическогоЛица.БанковскиеРеквизиты КАК АнкетаФизическогоЛицаБанковскиеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _АнкетныеДанныеКлиентов КАК _АнкетныеДанныеКлиентов
		|		ПО АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка = _АнкетныеДанныеКлиентов.Анкета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормы
		|			ПО Банки.Ссылка = _КодыПервойФормы.Объект
		|				И (_КодыПервойФормы.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра))
		|		ПО АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк = Банки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаявкиКлиентов.Ссылка КАК ЗаявкаСсылка,
		|	_ЗаявкиКлиентов.Клиент КАК Клиент,
		|	_ЗаявкиКлиентов.НомерЗаявки КАК НомерЗаявки,
		|	_ЗаявкиКлиентов.ДатаЗаявки КАК ДатаЗаявки,
		|	_ЗаявкиКлиентов.Статус КАК Статус,
		|	_ЗаявкиКлиентов.Актив КАК Актив,
		|	""Ввод денежных средств"" КАК Тип,
		|	ДокВводДенежныхСредств.Ссылка КАК Ссылка,
		|	ДокВводДенежныхСредств.Дата КАК Дата,
		|	ДокВводДенежныхСредств.Сумма КАК Сумма,
		|	0 КАК СуммаНДФЛ
		|ПОМЕСТИТЬ _ВводыВыводыДенежныхСредств
		|ИЗ
		|	_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводДенежныхСредств КАК ДокВводДенежныхСредств
		|		ПО _ЗаявкиКлиентов.Ссылка = ДокВводДенежныхСредств.Основание
		|			И (НЕ ДокВводДенежныхСредств.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗаявкиКлиентов.Ссылка,
		|	_ЗаявкиКлиентов.Клиент,
		|	_ЗаявкиКлиентов.НомерЗаявки,
		|	_ЗаявкиКлиентов.ДатаЗаявки,
		|	_ЗаявкиКлиентов.Статус,
		|	_ЗаявкиКлиентов.Актив,
		|	""Вывод денежных средств"",
		|	ДокВыводДенежныхСредств.Ссылка,
		|	ДокВыводДенежныхСредств.Дата,
		|	ДокВыводДенежныхСредств.Сумма,
		|	ДокВыводДенежныхСредств.СуммаНДФЛ
		|ИЗ
		|	_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыводДенежныхСредств КАК ДокВыводДенежныхСредств
		|		ПО _ЗаявкиКлиентов.Ссылка = ДокВыводДенежныхСредств.Основание
		|			И (НЕ ДокВыводДенежныхСредств.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗаявкиКлиентов.Ссылка КАК ЗаявкаСсылка,
		|	_ЗаявкиКлиентов.Клиент КАК Клиент,
		|	_ЗаявкиКлиентов.НомерЗаявки КАК НомерЗаявки,
		|	_ЗаявкиКлиентов.ДатаЗаявки КАК ДатаЗаявки,
		|	_ЗаявкиКлиентов.Статус КАК Статус,
		|	ДокЗачислениеПаев.ПаевойИнвестиционныйФонд КАК Актив,
		|	ДокЗачислениеПаев.Ссылка КАК Ссылка,
		|	ДокЗачислениеПаев.Дата КАК Дата,
		|	ДокЗачислениеПаев.Количество КАК Количество,
		|	ДокЗачислениеПаев.Сумма КАК Сумма,
		|	ДокЗачислениеПаев.СуммаНадбавки КАК СуммаНадбавки
		|ПОМЕСТИТЬ _ЗачисленияПаев
		|ИЗ
		|	_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ДокЗачислениеПаев
		|		ПО _ЗаявкиКлиентов.Ссылка = ДокЗачислениеПаев.Заявка
		|			И (НЕ ДокЗачислениеПаев.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗачисленияПаев.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ЗачисленияПаев.Клиент КАК Клиент,
		|	_ЗачисленияПаев.НомерЗаявки КАК НомерЗаявки,
		|	_ЗачисленияПаев.ДатаЗаявки КАК ДатаЗаявки,
		|	_ЗачисленияПаев.Статус КАК Статус,
		|	_ЗачисленияПаев.Актив КАК Актив,
		|	NULL КАК АктивДляОбмена,
		|	""Приобретение паев"" КАК Тип,
		|	_ЗачисленияПаев.Ссылка КАК Ссылка,
		|	_ЗачисленияПаев.Дата КАК Дата,
		|	_ЗачисленияПаев.Количество КАК Количество,
		|	_ЗачисленияПаев.Сумма КАК Сумма,
		|	_ЗачисленияПаев.СуммаНадбавки КАК СуммаНадбавки
		|ПОМЕСТИТЬ _ЗачисленияПогашенияПаев
		|ИЗ
		|	_ЗачисленияПаев КАК _ЗачисленияПаев
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗаявкиКлиентов.Ссылка,
		|	_ЗаявкиКлиентов.Клиент,
		|	_ЗаявкиКлиентов.НомерЗаявки,
		|	_ЗаявкиКлиентов.ДатаЗаявки,
		|	_ЗачисленияПаев.Статус,
		|	_ЗаявкиКлиентов.Актив,
		|	_ЗаявкиКлиентов.АктивДляОбмена,
		|	_ЗаявкиКлиентов.Тип,
		|	ДокПогашениеПаев.Ссылка,
		|	ДокПогашениеПаев.Дата,
		|	ДокПогашениеПаев.Количество,
		|	ДокПогашениеПаев.Сумма,
		|	0
		|ИЗ
		|	_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ДокПогашениеПаев
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев.Партии КАК ДокПогашениеПаевПартии
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗачисленияПаев КАК _ЗачисленияПаев
		|				ПО ДокПогашениеПаевПартии.ЗачислениеПаев = _ЗачисленияПаев.Ссылка
		|			ПО ДокПогашениеПаев.Ссылка = ДокПогашениеПаевПартии.Ссылка
		|		ПО _ЗаявкиКлиентов.Ссылка = ДокПогашениеПаев.Заявка
		|			И (НЕ ДокПогашениеПаев.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПогашенияПаев.Ссылка КАК ПогашениеПаев,
		|	ВЫРАЗИТЬ(ОплатаОснования.Сумма КАК ЧИСЛО(19, 4)) КАК Сумма
		|ПОМЕСТИТЬ _ОплатыНДФЛ
		|ИЗ
		|	Документ.Оплата КАК ДокОплата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛПайщиков КАК ДокРасчетНДФЛ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛПайщиков.НалоговаяБаза КАК НалоговаяБазаРасчетаНДФЛ
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗачисленияПогашенияПаев КАК _ПогашенияПаев
		|					ПО НалоговаяБазаРасчетаНДФЛ.Основание = _ПогашенияПаев.Ссылка
		|						И (_ПогашенияПаев.Тип = ""Погашение паев"")
		|				ПО ДокРасчетНДФЛ.Ссылка = НалоговаяБазаРасчетаНДФЛ.Ссылка
		|			ПО ОплатаОснования.Основание = ДокРасчетНДФЛ.Ссылка
		|				И (ДокРасчетНДФЛ.Проведен)
		|		ПО ДокОплата.Ссылка = ОплатаОснования.Ссылка
		|			И (ДокОплата.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводыДенежныхСредств.Ссылка КАК Ссылка,
		|	_ВводыВыводыДенежныхСредств.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ВводыВыводыДенежныхСредств.Клиент КАК Клиент,
		|	_ВводыВыводыДенежныхСредств.Дата КАК Дата,
		|	_ВводыВыводыДенежныхСредств.Тип КАК Тип,
		|	_ВводыВыводыДенежныхСредств.ДатаЗаявки КАК ДатаЗаявки,
		|	_ВводыВыводыДенежныхСредств.НомерЗаявки КАК НомерЗаявки,
		|	_ВводыВыводыДенежныхСредств.Статус КАК Статус,
		|	_ВводыВыводыДенежныхСредств.Актив КАК Актив,
		|	NULL КАК АктивДляОбмена,
		|	0 КАК Количество,
		|	0 КАК Цена,
		|	ВЫРАЗИТЬ(_ВводыВыводыДенежныхСредств.Сумма КАК ЧИСЛО(19, 4)) КАК Сумма,
		|	ВЫРАЗИТЬ(_ВводыВыводыДенежныхСредств.СуммаНДФЛ КАК ЧИСЛО(19, 4)) КАК СуммаНДФЛ,
		|	0 КАК СкидкаНадбавка
		|ПОМЕСТИТЬ _ОперацииКлиентов
		|ИЗ
		|	_ВводыВыводыДенежныхСредств КАК _ВводыВыводыДенежныхСредств
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗачисленияПогашенияПаев.Ссылка,
		|	_ЗачисленияПогашенияПаев.ЗаявкаСсылка,
		|	_ЗачисленияПогашенияПаев.Клиент,
		|	_ЗачисленияПогашенияПаев.Дата,
		|	_ЗачисленияПогашенияПаев.Тип,
		|	_ЗачисленияПогашенияПаев.ДатаЗаявки,
		|	_ЗачисленияПогашенияПаев.НомерЗаявки,
		|	_ЗачисленияПогашенияПаев.Статус,
		|	_ЗачисленияПогашенияПаев.Актив,
		|	_ЗачисленияПогашенияПаев.АктивДляОбмена,
		|	ВЫРАЗИТЬ(_ЗачисленияПогашенияПаев.Количество КАК ЧИСЛО(19, 7)),
		|	ВЫБОР
		|		КОГДА _ЗачисленияПогашенияПаев.Количество > 0
		|			ТОГДА ВЫРАЗИТЬ(_ЗачисленияПогашенияПаев.Сумма / _ЗачисленияПогашенияПаев.Количество КАК ЧИСЛО(19, 4))
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(_ЗачисленияПогашенияПаев.Сумма КАК ЧИСЛО(19, 4)),
		|	ЕСТЬNULL(_ОплатыНДФЛ.Сумма, 0),
		|	_ЗачисленияПогашенияПаев.СуммаНадбавки
		|ИЗ
		|	_ЗачисленияПогашенияПаев КАК _ЗачисленияПогашенияПаев
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыНДФЛ КАК _ОплатыНДФЛ
		|		ПО _ЗачисленияПогашенияПаев.Ссылка = _ОплатыНДФЛ.ПогашениеПаев
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ЗаявкиКлиентов.Ссылка,
		|	_ЗаявкиКлиентов.Ссылка,
		|	_ЗаявкиКлиентов.Клиент,
		|	NULL,
		|	_ЗаявкиКлиентов.Тип,
		|	_ЗаявкиКлиентов.ДатаЗаявки,
		|	_ЗаявкиКлиентов.НомерЗаявки,
		|	_ЗаявкиКлиентов.Статус,
		|	_ЗаявкиКлиентов.Актив,
		|	_ЗаявкиКлиентов.АктивДляОбмена,
		|	ВЫРАЗИТЬ(_ЗаявкиКлиентов.Количество КАК ЧИСЛО(19, 7)),
		|	ВЫБОР
		|		КОГДА _ЗаявкиКлиентов.Количество > 0
		|			ТОГДА _ЗаявкиКлиентов.Сумма / _ЗаявкиКлиентов.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	_ЗаявкиКлиентов.Сумма,
		|	0,
		|	0
		|ИЗ
		|	_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗачисленияПогашенияПаев КАК _ЗачисленияПогашенияПаев
		|		ПО _ЗаявкиКлиентов.Ссылка = _ЗачисленияПогашенияПаев.ЗаявкаСсылка
		|ГДЕ
		|	_ЗачисленияПогашенияПаев.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Актив КАК Актив,
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.ДатаЗаявки КАК ДатаЗаявки,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.Ссылка, _ЗаявкиНаОбмен.Ссылка) КАК ЗаявкаСсылка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.НомерЗаявки, _ЗаявкиНаОбмен.НомерЗаявки) КАК НомерЗаявки,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.Основная, _ЗаявкиНаОбмен.Основная) КАК ОсновнаяЗаявка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодЗаявки1Ф, _ЗаявкиНаОбмен.КодЗаявки1Ф) КАК КодПродукта1Ф,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодАктива1Ф, _ЗаявкиНаОбмен.КодАктиваДляОбмена1Ф) КАК КодАктива1Ф,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодКлиента1Ф, _ЗаявкиНаОбмен.КодКлиента1Ф) КАК КодКлиента1Ф
		|ПОМЕСТИТЬ _ПродуктыКлиентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА _ЗаявкиКлиентов.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ЗаявкиКлиентов.АктивДляОбмена
		|			ИНАЧЕ _ЗаявкиКлиентов.Актив
		|		КОНЕЦ КАК Актив,
		|		_ЗаявкиКлиентов.Клиент КАК Клиент,
		|		МИНИМУМ(_ЗаявкиКлиентов.ДатаЗаявки) КАК ДатаЗаявки
		|	ИЗ
		|		_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|	ГДЕ
		|		_ЗаявкиКлиентов.ВидЗаявки В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление), ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА _ЗаявкиКлиентов.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ЗаявкиКлиентов.АктивДляОбмена
		|			ИНАЧЕ _ЗаявкиКлиентов.Актив
		|		КОНЕЦ,
		|		_ЗаявкиКлиентов.Клиент) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаявкиКлиентов КАК _ЗаявкиНаПриобретение
		|		ПО ВложенныйЗапрос.Актив = _ЗаявкиНаПриобретение.Актив
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаПриобретение.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаПриобретение.ДатаЗаявки
		|			И (_ЗаявкиНаПриобретение.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаявкиКлиентов КАК _ЗаявкиНаОбмен
		|		ПО ВложенныйЗапрос.Актив = _ЗаявкиНаОбмен.АктивДляОбмена
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаОбмен.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаОбмен.ДатаЗаявки
		|			И (_ЗаявкиНаОбмен.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииКлиентов.Ссылка КАК Ссылка,
		|	_ОперацииКлиентов.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ОперацииКлиентов.Клиент КАК Клиент,
		|	_ОперацииКлиентов.Дата КАК Дата,
		|	_ОперацииКлиентов.Тип КАК Тип,
		|	_ОперацииКлиентов.ДатаЗаявки КАК ДатаЗаявки,
		|	_ОперацииКлиентов.НомерЗаявки КАК НомерЗаявки,
		|	_ОперацииКлиентов.Статус КАК Статус,
		|	_ОперацииКлиентов.Актив КАК Актив,
		|	_ОперацииКлиентов.АктивДляОбмена КАК АктивДляОбмена,
		|	_ОперацииКлиентов.Количество КАК Количество,
		|	_ОперацииКлиентов.Цена КАК Цена,
		|	_ОперацииКлиентов.Сумма КАК Сумма,
		|	_ОперацииКлиентов.СуммаНДФЛ КАК СуммаНДФЛ,
		|	_ОперацииКлиентов.СкидкаНадбавка КАК СкидкаНадбавка,
		|	_ПродуктыКлиентов.КодКлиента1Ф КАК КодКлиента1Ф,
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК СсылкаЗаявкиАктива,
		|	_ПродуктыДляОбмена.ЗаявкаСсылка КАК СсылкаЗаявкиАктиваДляОбмена,
		|	_ПродуктыКлиентов.КодПродукта1Ф КАК КодПродукта1Ф,
		|	_ПродуктыДляОбмена.КодПродукта1Ф КАК КодПродуктаДляОбмена1Ф
		|ПОМЕСТИТЬ _Операции
		|ИЗ
		|	_ОперацииКлиентов КАК _ОперацииКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПродуктыКлиентов КАК _ПродуктыКлиентов
		|		ПО _ОперацииКлиентов.Актив = _ПродуктыКлиентов.Актив
		|			И _ОперацииКлиентов.Клиент = _ПродуктыКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПродуктыКлиентов КАК _ПродуктыДляОбмена
		|		ПО _ОперацииКлиентов.АктивДляОбмена = _ПродуктыДляОбмена.Актив
		|			И _ОперацииКлиентов.Клиент = _ПродуктыДляОбмена.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК Клиент,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд КАК Актив,
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	СУММА(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток) КАК Количество,
		|	СУММА(ДолиПайщиковВИнвестиционномФондеОстатки.СтоимостьОстаток) КАК Стоимость
		|ПОМЕСТИТЬ _ОстаткиПаев
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Пайщик В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЗаявкиКлиентов.Клиент
		|					ИЗ
		|						_ЗаявкиКлиентов)
		|				И ПаевойИнвестиционныйФонд В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЗаявкиКлиентов.Актив
		|					ИЗ
		|						_ЗаявкиКлиентов
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_ЗаявкиКлиентов.АктивДляОбмена
		|					ИЗ
		|						_ЗаявкиКлиентов
		|					ГДЕ
		|						_ЗаявкиКлиентов.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|				И Партия В
		|					(ВЫБРАТЬ
		|						_ЗачисленияПогашенияПаев.Ссылка
		|					ИЗ
		|						_ЗачисленияПогашенияПаев КАК _ЗачисленияПогашенияПаев
		|					ГДЕ
		|						_ЗачисленияПогашенияПаев.Тип = ""Приобретение паев"")) КАК ДолиПайщиковВИнвестиционномФондеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПродуктыКлиентов КАК _ПродуктыКлиентов
		|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд = _ПродуктыКлиентов.Актив
		|			И ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик = _ПродуктыКлиентов.Клиент
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд,
		|	_ПродуктыКлиентов.ЗаявкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПродуктыКлиентов.Актив КАК Актив,
		|	_ПродуктыКлиентов.Клиент КАК Клиент,
		|	_ПродуктыКлиентов.ДатаЗаявки КАК ДатаЗаявки,
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ПродуктыКлиентов.НомерЗаявки КАК НомерЗаявки,
		|	_ПродуктыКлиентов.ОсновнаяЗаявка КАК ОсновнаяЗаявка,
		|	_ПродуктыКлиентов.КодПродукта1Ф КАК КодПродукта1Ф,
		|	_ПродуктыКлиентов.КодАктива1Ф КАК КодАктива1Ф,
		|	_ПродуктыКлиентов.КодКлиента1Ф КАК КодКлиента1Ф,
		|	ЕСТЬNULL(_ОстаткиПаев.Количество, 0) КАК Количество
		|ИЗ
		|	_ПродуктыКлиентов КАК _ПродуктыКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПаев КАК _ОстаткиПаев
		|		ПО _ПродуктыКлиентов.ЗаявкаСсылка = _ОстаткиПаев.ЗаявкаСсылка
		|			И _ПродуктыКлиентов.Клиент = _ОстаткиПаев.Клиент
		|			И _ПродуктыКлиентов.Актив = _ОстаткиПаев.Актив";	
#КонецОбласти 
	
    Запрос.УстановитьПараметр("НачалоПериода", ПараметрыФормирования.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыФормирования.КонецПериода));
	Запрос.УстановитьПараметр("Организация", ПараметрыФормирования.Организация);
	Запрос.УстановитьПараметр("Клиенты", ?(ПараметрыФормирования.Свойство("Клиенты"), ПараметрыФормирования.Клиенты, Неопределено));
	Запрос.УстановитьПараметр("Пиф", ?(ПараметрыФормирования.Свойство("Пиф"), ПараметрыФормирования.Пиф, Неопределено));
	
	ВыборкаПортфелей = Запрос.Выполнить().Выбрать();
	
	ВыборкаАнкетныхДанных = Запрос.МенеджерВременныхТаблиц.Таблицы["_АнкетныеДанныеКлиентов"].ПолучитьДанные().Выбрать();
	
	Если ВыборкаАнкетныхДанных.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ДанныеДляЭкспорта = СформироватьСтруктуруДанных();
		
	Пока ВыборкаАнкетныхДанных.Следующий() Цикл
				
		НоваяСтрока = ДанныеДляЭкспорта.ТаблицаКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаАнкетныхДанных);
		
		Если ЗначениеЗаполнено(ВыборкаАнкетныхДанных.EMail) Тогда 	
			НоваяСтрока.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", "Email", ВыборкаАнкетныхДанных.EMail)); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаАнкетныхДанных.Телефоны) Тогда
			НоваяСтрока.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", "Телефон", ВыборкаАнкетныхДанных.Телефоны)); 
		КонецЕсли;
			
	КонецЦикла; 
	
	ВыборкаБанковскихРеквизитов = Запрос.МенеджерВременныхТаблиц.Таблицы["_БанковскиеРеквизиты"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаБанковскихРеквизитов.Следующий() Цикл
				
		СтрокаРеквизитов = ДанныеДляЭкспорта.БанковскиеРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, ВыборкаБанковскихРеквизитов);
		
	КонецЦикла;
				
	ВыборкаОпераций = Запрос.МенеджерВременныхТаблиц.Таблицы["_Операции"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОпераций.Следующий() Цикл
				
		СтрокаОпераций = ДанныеДляЭкспорта.Операции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОпераций, ВыборкаОпераций);
					
	КонецЦикла;
	
	ВыборкаЗаявок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ЗаявкиКлиентов"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаЗаявок.Следующий() Цикл
				
		СтрокаЗаявок = ДанныеДляЭкспорта.Заявки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаявок, ВыборкаЗаявок);
					
	КонецЦикла; 
		
	Пока ВыборкаПортфелей.Следующий() Цикл 
		
		СтрокаПродуктов = ДанныеДляЭкспорта.Продукты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПродуктов, ВыборкаПортфелей);
		
		Если ВыборкаПортфелей.Количество() > 0 Тогда
			СтрокаПортфеля = ДанныеДляЭкспорта.Портфель.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПортфеля, ВыборкаПортфелей);
		КонецЕсли;
					
	КонецЦикла;
	
	Возврат ДанныеДляЭкспорта;
	
КонецФункции 

Процедура Экспортировать(ДанныеДляЭкспорта) Экспорт 
					
	НовыеКодыБанков = Неопределено;
		
	Если ДанныеДляЭкспорта.Свойство("ТаблицаКлиентов") И ДанныеДляЭкспорта.ТаблицаКлиентов.Количество() <> 0 Тогда
			
		ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения("uk1f");
		
		Если ПараметрыПодключения = Неопределено Тогда
			ЗарегистрироватьОшибку("Ошибка подключения к первой форме колл центра.");
			Возврат;
		КонецЕсли;
					
		Если ДанныеДляЭкспорта.Свойство("БанковскиеРеквизиты") И ДанныеДляЭкспорта.БанковскиеРеквизиты.Количество() > 0 Тогда
			НовыеКодыБанков = ПолучитьКодыБанковИзПервойФормы(ДанныеДляЭкспорта.БанковскиеРеквизиты, ПараметрыПодключения);		
		КонецЕсли;
		
		Для Каждого ТекКлиент Из ДанныеДляЭкспорта.ТаблицаКлиентов Цикл 
			
			ФлагЗаполнитьКодКлиента = Не ЗначениеЗаполнено(ТекКлиент.Код1Ф);
						
			Если Не ЭкспортироватьАнкетныеДанныеКлиента(ТекКлиент, ПараметрыПодключения) Тогда
				Продолжить;
			КонецЕсли;
						
			ТаблицаПродуктов = Неопределено;
			
			Если Не ЗначениеЗаполнено(ТекКлиент.Код1Ф) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДанныеДляЭкспорта.Свойство("БанковскиеРеквизиты") Тогда
				
				РеквизитыКлиента = ДанныеДляЭкспорта.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("Клиент", ТекКлиент.Ссылка));
				ЗаполнитьКодКлиента(ТекКлиент.Код1Ф, РеквизитыКлиента, ФлагЗаполнитьКодКлиента);
				ЭкспортироватьБанковскиеРеквизитыКлиентов(РеквизитыКлиента, ПараметрыПодключения, НовыеКодыБанков);
			
			КонецЕсли;
						
			Если ДанныеДляЭкспорта.Свойство("Продукты") Тогда
				
				ТаблицаПродуктов = ДанныеДляЭкспорта.Продукты.Скопировать(Новый Структура("Клиент", ТекКлиент.Ссылка));
				ЗаполнитьКодКлиента(ТекКлиент.Код1Ф, ТаблицаПродуктов, ФлагЗаполнитьКодКлиента);
				ЭкспортироватьПродуктыКлиентов(ТаблицаПродуктов, ПараметрыПодключения);
					
			КонецЕсли;
            //В таблицу "Операции" экспортируются и активные заявки, по которым еще не было поступлений/погашений паев. 
			Если ДанныеДляЭкспорта.Свойство("Операции") Тогда
										
				ОперацииПользователя = ДанныеДляЭкспорта.Операции.НайтиСтроки(Новый Структура("Клиент", ТекКлиент.Ссылка));
				ЗаполнитьКодКлиента(ТекКлиент.Код1Ф, ОперацииПользователя, ФлагЗаполнитьКодКлиента);
				ЭкспортироватьОперацииКлиентов(ОперацииПользователя, ПараметрыПодключения, ТаблицаПродуктов);
									
			КонецЕсли; 
						
			Если ДанныеДляЭкспорта.Свойство("Портфель") Тогда

				ПортфельПользователя = ДанныеДляЭкспорта.Портфель.НайтиСтроки(Новый Структура("Клиент", ТекКлиент.Ссылка));
				ЗаполнитьКодКлиента(ТекКлиент.Код1Ф, ПортфельПользователя, ФлагЗаполнитьКодКлиента);
				ЭкспортироватьПортфелиКлиентов(ПортфельПользователя, ПараметрыПодключения, ТаблицаПродуктов);
									
			КонецЕсли; 
																		
		КонецЦикла;
		
	КонецЕсли;
	
	ОповеститьОбОшибках();
				
КонецПроцедуры  

Функция ЭкспортироватьАнкетныеДанныеКлиента(ДанныеКлиента, ПараметрыПодключения)
	
	//если есть код первой формы проверим и обновим анкетные данные
	//доработать сверку контактных данных
	Если ЗначениеЗаполнено(ДанныеКлиента.Код1Ф) Тогда 
				
		ОбновитьДанныеПервойФормы(ДанныеКлиента.Код1Ф, ДанныеКлиента, ПараметрыПодключения,, "201"); //параметр GUID исключил из сверки
				
	Иначе
				
		GUID = Строка(ДанныеКлиента.Ссылка.УникальныйИдентификатор()); 
		
		//проверяем наличие клиента по GUID
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("startRow", 0);
		СтруктураЗапроса.Вставить("endRow", 10);
		СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
		СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201", Новый Структура("filterType, type, filter", "text", "equals", GUID)));
				
		ТекстСообщения = "Не удалось получить данные клиента [" + ДанныеКлиента.Ссылка + "] из первой формы по GUID 1С [" + GUID + "]."; 
		
		ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
							
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/23/data", ТелоЗапроса, ТекстСообщения);
					
		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьОшибку(ТекстСообщения);   
			Возврат Ложь;
		КонецЕсли;
		
		КодКлиента1Ф = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
			
		Если КодКлиента1Ф = 0 Тогда
			
			МассивПараметров = Новый Массив();
			
			МассивПараметров.Добавить(Новый Структура("id, value", 78, ДанныеКлиента.ИНН)); //ИНН (Text)  
			МассивПараметров.Добавить(Новый Структура("id, value", 165, "Открытый")); //Статус клиента (Select Открытый/Закрытый/Нет)
			МассивПараметров.Добавить(Новый Структура("id, value", 201, GUID)); //GUID (Text) 
			МассивПараметров.Добавить(Новый Структура("id, value", 76, ДанныеКлиента.Фамилия)); //Фамилия (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 75, ДанныеКлиента.Имя)); //Имя (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 74, ДанныеКлиента.Отчество)); //Отчество (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 168, ?(ДанныеКлиента.Пол = Перечисления.ПолФизическогоЛица.Мужской, "М", "Ж"))); //Пол (Select М/Ж)
			МассивПараметров.Добавить(Новый Структура("id, value", 77, Формат(ДанныеКлиента.ДатаРождения, "ДФ=гггг-ММ-дд"))); //Дата рождения (Date)
			МассивПараметров.Добавить(Новый Структура("id, value", 169, ДанныеКлиента.СНИЛС)); //СНИЛС (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 84, ДанныеКлиента.СерияДокумента)); //Серия паспорта (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 85, ДанныеКлиента.НомерДокумента)); //Номер паспорта (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 86, Формат(ДанныеКлиента.ДатаВыдачиДокумента, "ДФ=гггг-ММ-дд"))); //Дата выдачи (Date)
			МассивПараметров.Добавить(Новый Структура("id, value", 87, ДанныеКлиента.ОрганВыдавшийДокумент)); //Кем выдан (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 88, ДанныеКлиента.КодПодразделения)); //Код подразделения (Text)
			МассивПараметров.Добавить(Новый Структура("id, value", 221, Формат(ДанныеКлиента.АктивированЛичныйКабинетЕсиа, "БЛ=false; БИ=true")));

			Если ЗначениеЗаполнено(ДанныеКлиента.ДатаОкончанияДействияДокумента) Тогда 
				МассивПараметров.Добавить(Новый Структура("id, value", 167, Формат(ДанныеКлиента.ДатаОкончанияДействияДокумента, "ДФ=гггг-ММ-дд"))); //Действует до (Date)
			КонецЕсли;
			
			Если ДанныеКлиента.Контакты.Количество() > 0 Тогда									
	            МассивПараметров.Добавить(СформироватьПараметрКонтактов(ДанныеКлиента.Контакты));	
			КонецЕсли;
						
			ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 23, МассивПараметров));
			
			ТекстСообщения = "Ошибка экспорта данных физ лица [" + ДанныеКлиента.Ссылка + "].";
			
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);   
				Возврат Ложь;
			КонецЕсли;
			
			КодКлиента1Ф = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data");
			
			Если ЗначениеЗаполнено(КодКлиента1Ф) Тогда  
				
				ДанныеКлиента.Код1Ф = КодКлиента1Ф; 
						
				РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(
					ДанныеКлиента.Ссылка, 
					Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра, 
					Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица,
					КодКлиента1Ф);
				
			КонецЕсли;
				
		ИначеЕсли ЗначениеЗаполнено(КодКлиента1Ф) Тогда
			ДанныеКлиента.Код1Ф = КодКлиента1Ф;
			
			РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(
				ДанныеКлиента.Ссылка, 
				Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра, 
				Справочники.ГруппыИмпортируемыхОбъектов.ФизическиеЛица,
				КодКлиента1Ф);

			ЗарегистрироватьОшибку("В первой форме присутствуеют данные клиента [" + ДанныеКлиента.Ссылка + "] задача [" + КодКлиента1Ф + "]. В регистре [Коды во внешних системах] отсутствует код задачи.");	
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции 

Процедура ЭкспортироватьБанковскиеРеквизитыКлиентов(Реквизиты, ПараметрыПодключения, НовыеКодыБанков = Неопределено)
	
	ТекстСообщения = "Ошибка экспорта банковских реквизитов клиента ID [%1].";
	СчетчикОшибок = 3;
	
	//доработать обновление реквизитов
	Для Каждого ТекРеквизиты Из Реквизиты Цикл 
		
		Если Не ЗначениеЗаполнено(ТекРеквизиты.Клиент) Тогда
			ЗарегистрироватьОшибку("Ошибка экспорта данных расчетного счета [" + ТекРеквизиты.Ссылка + "]. Отсутствует ID клиента в первой форме.");
			
			Если СчетчикОшибок = 0 Тогда
				Возврат;
			Иначе
				СчетчикОшибок = СчетчикОшибок - 1;
			КонецЕсли;

			Продолжить;
		КонецЕсли;
	
		GUID = Строка(ТекРеквизиты.Ссылка.УникальныйИдентификатор()); 
		
		//Ищем счет по GUID. Выгружаем если ничего не нашли. 
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("startRow", 0);
		СтруктураЗапроса.Вставить("endRow", 10);
		СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
		СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201", Новый Структура("filterType, type, filter", "text", "equals", GUID)));
		
		ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
							
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/40/data", ТелоЗапроса, ТекстСообщения);
					
		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ТекРеквизиты.Клиент)); 
			
			Если СчетчикОшибок = 0 Тогда
				Возврат;
			Иначе
				СчетчикОшибок = СчетчикОшибок - 1;
			КонецЕсли;

			Продолжить;
		КонецЕсли;
		
		НомерЗадачи = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
			
		Если НомерЗадачи = 0 Тогда
			
			МассивПараметров = Новый Массив;
			
			МассивПараметров.Добавить(Новый Структура("id, value", 98, ТекРеквизиты.КодКлиента1Ф)); 
			МассивПараметров.Добавить(Новый Структура("id, value", 172, ТекРеквизиты.НомерСчета));
			МассивПараметров.Добавить(Новый Структура("id, value", 201, GUID));
			МассивПараметров.Добавить(Новый Структура("id, value", 202, "Российский рубль"));
					
			Если ЗначениеЗаполнено(ТекРеквизиты.КодБанка1Ф) Тогда 
				
				МассивПараметров.Добавить(Новый Структура("id, value", 171, ТекРеквизиты.КодБанка1Ф));

			ИначеЕсли НовыеКодыБанков <> Неопределено Тогда
				
				МассивСтрок = НовыеКодыБанков.НайтиСтроки(Новый Структура("Банк", ТекРеквизиты.Банк));
				
				Если МассивСтрок.Количество() > 0 Тогда
					МассивПараметров.Добавить(Новый Структура("id, value", 171, МассивСтрок[0].КодБанка1Ф));	
				КонецЕсли;
				
			Иначе
				
				ЗарегистрироватьОшибку("Не удалось экспортировать банковские реквизиты клиента [" + ТекРеквизиты.Клиент + "]. Не найден код банка [" + ТекРеквизиты.Банк + "] в первой форме.");
				
				Если СчетчикОшибок = 0 Тогда
					Возврат;
				Иначе
					СчетчикОшибок = СчетчикОшибок - 1;
				КонецЕсли;

				Продолжить;
				
			КонецЕсли;  
			
			ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 40, МассивПараметров));
		
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
						
			Если HTTPОтвет = Неопределено Или Не ЗначениеЗаполнено(ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data")) Тогда
				
				ЗарегистрироватьОшибку(ТекстСообщения);
				
				Если СчетчикОшибок = 0 Тогда
					Возврат;
				Иначе
					СчетчикОшибок = СчетчикОшибок - 1;
				КонецЕсли;

				Продолжить;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла; 
		
КонецПроцедуры

Процедура ЭкспортироватьОперацииКлиентов(ТаблицаОпераций, ПараметрыПодключения, Продукты = Неопределено)
		
	//Заявки и операции выгружаются в одну таблицу
	//Выгружаем только активные заявки, на онсновании которых еще не созданы зачисления/погашения паев.
	//После того как на основании заявки создали зачисление/погашение паев - в первой форме меняем GUID заявки на GUID операции.	
	
	ТекстСообщения = "Ошибка экспорта операции [%1] клиента ID [%2].";
	
	СчетчикОшибок = 3;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 10);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201", Новый Структура("filterType, type, filter", "text", "equals")));
	
	Для Каждого ТекОперация Из ТаблицаОпераций Цикл 
		
		Если Не ЗначениеЗаполнено(ТекОперация.КодКлиента1Ф) Тогда
			ЗарегистрироватьОшибку("Ошибка экспорта операции [" + ТекОперация.Ссылка + "]. Отсутствует ID клиента в первой форме.", СчетчикОшибок);
			
			Если СчетчикОшибок = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		//1. Ищем запись (задачу) в 1Ф по GUID операции.
		Если ЗначениеЗаполнено(ТекОперация.Дата) Тогда // дату заполняем только для операции
			
			СтруктураЗапроса.filterModel.ExtParam201.filter = Строка(ТекОперация.Ссылка.УникальныйИдентификатор());
			ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
								
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/42/data", ТелоЗапроса, ТекстСообщения);
					
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ТекОперация.Ссылка, ТекОперация.КодКлиента1Ф), СчетчикОшибок); 
				
				Если СчетчикОшибок = 0 Тогда
					Возврат;
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
		
			НомерЗадачиОперации = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
			
			//2. Если не нашли задачу по GUID операции, ищем по GUID заявки  
			Если НомерЗадачиОперации = 0 Тогда 
				
				Если ТекОперация.Тип = "Приобретение паев" Или ТекОперация.Тип = "Погашение паев" Тогда 
				
					СтруктураЗапроса.filterModel.ExtParam201.filter = Строка(ТекОперация.ЗаявкаСсылка.УникальныйИдентификатор());
					ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
										
					HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/42/data", ТелоЗапроса, ТекстСообщения);
							
					Если HTTPОтвет = Неопределено Тогда
						ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ТекОперация.Ссылка, ТекОперация.КодКлиента1Ф), СчетчикОшибок);
						
						Если СчетчикОшибок = 0 Тогда
							Возврат;
						КонецЕсли;
						
						Продолжить;
					КонецЕсли;
				
					НомерЗадачиОперации = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount"); 
					
					//3. Если нашли задачу по GUID заявки - обновляем GUID заявки на GUID операции
					Если ЗначениеЗаполнено(НомерЗадачиОперации) Тогда
						
						//обновление данных							
						ОбновитьДанныеПервойФормы(НомерЗадачиОперации, ТекОперация, ПараметрыПодключения, "187,183,184,200,201");
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе				
				Продолжить;				
			КонецЕсли;
			
		Иначе //это заявка, ищем запись по GUID заявки
			
			СтруктураЗапроса.filterModel.ExtParam201.filter = Строка(ТекОперация.ЗаявкаСсылка.УникальныйИдентификатор());
			ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
								
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/42/data", ТелоЗапроса, ТекстСообщения);
					
			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ТекОперация.Ссылка, ТекОперация.КодКлиента1Ф), СчетчикОшибок); 
				
				Если СчетчикОшибок = 0 Тогда
					Возврат;
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
		
			НомерЗадачиОперации = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
			 
			Если ЗначениеЗаполнено(НомерЗадачиОперации) Тогда
				//обновляем статус.					
				ОбновитьДанныеПервойФормы(НомерЗадачиОперации, ТекОперация, ПараметрыПодключения, "200");
				Продолжить;				
			КонецЕсли;
	
		КонецЕсли; 
		
		КодПродукта = ?(ЗначениеЗаполнено(ТекОперация.КодПродукта1Ф), ТекОперация.КодПродукта1Ф, ПолучитьКодПродукта(ТекОперация.СсылкаЗаявкиАктива, ПараметрыПодключения, Продукты));
		
		Если Не ЗначениеЗаполнено(КодПродукта) Тогда 
			ЗарегистрироватьОшибку("Не удалось получить код продукта по GUID заявки [" + ТекОперация.СсылкаЗаявкиАктива + "].", СчетчикОшибок); 
			
			Если СчетчикОшибок = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		КодПродуктаДляОбмена = Неопределено;
		
		Если ЗначениеЗаполнено(ТекОперация.СсылкаЗаявкиАктиваДляОбмена) Тогда
			
			КодПродуктаДляОбмена = ?(ЗначениеЗаполнено(ТекОперация.КодПродуктаДляОбмена1Ф), ТекОперация.КодПродуктаДляОбмена1Ф, ПолучитьКодПродукта(ТекОперация.СсылкаЗаявкиАктиваДляОбмена, ПараметрыПодключения, Продукты));
		
			Если Не ЗначениеЗаполнено(КодПродуктаДляОбмена) Тогда 
				ЗарегистрироватьОшибку("Не удалось получить код продукта по GUID заявки [" + ТекОперация.СсылкаЗаявкиАктиваДляОбмена + "].", СчетчикОшибок); 
				
				Если СчетчикОшибок = 0 Тогда
					Возврат;
				КонецЕсли;
			
				Продолжить;
			КонецЕсли; 
				
		КонецЕсли;

		МассивПараметров = Новый Массив;
		
		МассивПараметров.Добавить(Новый Структура("id, value", 98, ТекОперация.КодКлиента1Ф)); 
		МассивПараметров.Добавить(Новый Структура("id, value", 179, ТекОперация.Тип));
		МассивПараметров.Добавить(Новый Структура("id, value", 180, ТекОперация.НомерЗаявки));	
		МассивПараметров.Добавить(Новый Структура("id, value", 201, Строка(ТекОперация.Ссылка.УникальныйИдентификатор())));
		МассивПараметров.Добавить(Новый Структура("id, value", 207, КодПродукта));		
		МассивПараметров.Добавить(Новый Структура("id, value", 209, Формат(ТекОперация.ДатаЗаявки, "ДФ=гггг-ММ-дд"))); //ДатаЗаявки
		МассивПараметров.Добавить(Новый Структура("id, value", 208, Формат(ТекОперация.Цена, "ЧН=0; ЧГ=0"))); //цена ед.
		МассивПараметров.Добавить(Новый Структура("id, value", 184, Формат(ТекОперация.Сумма, "ЧН=0; ЧГ=0")));
		МассивПараметров.Добавить(Новый Структура("id, value", 183, Формат(ТекОперация.Количество, "ЧН=0; ЧГ=0")));
		МассивПараметров.Добавить(Новый Структура("id, value", 185, Формат(ТекОперация.СкидкаНадбавка, "ЧН=0; ЧГ=0"))); 
		МассивПараметров.Добавить(Новый Структура("id, value", 186, Формат(ТекОперация.СуммаНДФЛ, "ЧН=0; ЧГ=0")));

		Если ЗначениеЗаполнено(КодПродуктаДляОбмена) Тогда
			МассивПараметров.Добавить(Новый Структура("id, value", 219, КодПродуктаДляОбмена));	
		КонецЕсли;

		Если ЗначениеЗаполнено(ТекОперация.Дата) Тогда
			МассивПараметров.Добавить(Новый Структура("id, value", 187, Формат(ТекОперация.Дата, "ДФ=гггг-ММ-ддTЧЧ:mm:ss"))); //ДатаОперации	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекОперация.Статус) Тогда
			МассивПараметров.Добавить(Новый Структура("id, value", 200, Строка(ТекОперация.Статус)));
		КонецЕсли;
		
		ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 42, МассивПараметров));
	
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Или Не ЗначениеЗаполнено(ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data")) Тогда
			
			ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ТекОперация.Ссылка, ТекОперация.КодКлиента1Ф), СчетчикОшибок); 
			
			Если СчетчикОшибок = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЭкспортироватьПортфелиКлиентов(Портфели, ПараметрыПодключения, Продукты = Неопределено)
	
	ТекстСообщения = "Ошибка экспорта портфелей. Заявка [%1]."; 
	МассивДанных = Новый Массив;
	Обновленные = 0;
	
	Для Каждого СтрокаАктивПортфеля Из Портфели Цикл 
									
		КодПортфеля = ПолучитьКодПортфеля(СтрокаАктивПортфеля.ЗаявкаСсылка, ПараметрыПодключения);
		
		Если ЗначениеЗаполнено(КодПортфеля) Тогда //обновляем данные по 100 записей 
			
			МассивДанных.Добавить(Новый Структура("taskId, extParamStr", КодПортфеля, "#n183#v" + Формат(СтрокаАктивПортфеля.Количество, "ЧН=0; ЧГ=0")));
			
			Если МассивДанных.Количество() = 100 Тогда 
			
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/extparams/update", ПолучитьСтрокуJSON(МассивДанных), ТекстСообщения);
								
				Если HTTPОтвет = Неопределено Тогда
					ЗарегистрироватьОшибку(ТекстСообщения);
				Иначе
					Обновленные = Обновленные + 100;
				КонецЕсли;
				
				МассивДанных.Очистить();
				
			КонецЕсли;
			
		ИначеЕсли КодПортфеля = 0 Тогда // добавляем запись
						
			КодПродукта = ?(ЗначениеЗаполнено(СтрокаАктивПортфеля.КодПродукта1Ф), СтрокаАктивПортфеля.КодПродукта1Ф, ПолучитьКодПродукта(СтрокаАктивПортфеля.ЗаявкаСсылка, ПараметрыПодключения, Продукты));
		
			Если Не ЗначениеЗаполнено(КодПродукта) Тогда
				ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, СтрокаАктивПортфеля.ЗаявкаСсылка) + " Не удалось определить код продукта.");   
				Продолжить;
			КонецЕсли;

			МассивПараметров = Новый Массив;
			
			МассивПараметров.Добавить(Новый Структура("id, value", 183, Формат(СтрокаАктивПортфеля.Количество, "ЧН=0; ЧГ=0")));
			МассивПараметров.Добавить(Новый Структура("id, value", 207, КодПродукта));
			МассивПараметров.Добавить(Новый Структура("id, value", 201, Строка(СтрокаАктивПортфеля.ЗаявкаСсылка.УникальныйИдентификатор()))); 

			ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 43, МассивПараметров));
		
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
			
			Если HTTPОтвет = Неопределено Или Не ЗначениеЗаполнено(ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data")) Тогда
				ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, СтрокаАктивПортфеля.ЗаявкаСсылка));   
				Возврат;
			КонецЕсли;
						
		КонецЕсли;
							
	КонецЦикла; 
	
	Если МассивДанных.Количество() > 0 Тогда 

		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/extparams/update", ПолучитьСтрокуJSON(МассивДанных), ТекстСообщения);
						
		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьОшибку(ТекстСообщения); 
		Иначе
			Обновленные = Обновленные + МассивДанных.Количество();
		КонецЕсли;
		
		МассивДанных.Очистить();
	
	КонецЕсли;
	
	ОповеститьОбОшибках();
 	
КонецПроцедуры

Процедура ЭкспортироватьПродуктыКлиентов(ТаблицаДанных, ПараметрыПодключения)
								
	ТекстСообщения = "Ошибка экспорта продукта клиента [%1].";
	
	Для Каждого ЭтаСтрока Из ТаблицаДанных Цикл 
		
		Если ЗначениеЗаполнено(ЭтаСтрока.КодПродукта1Ф) Тогда
			Продолжить; 
		КонецЕсли;
			
		//1. Пробуем найти продукт по GUID заявки
		КодПродукта = ПолучитьКодПродукта(ЭтаСтрока.ЗаявкаСсылка, ПараметрыПодключения);
		
		Если КодПродукта <> 0 Тогда 
			//нужно записать код в регистр коды во внешних системах.
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтаСтрока.КодКлиента1Ф) Тогда
			ЗарегистрироватьОшибку("Ошибка экспорта продукта по заявке [" + ЭтаСтрока.ЗаявкаСсылка + "]. Отсутствует код клиента.");
			Продолжить;	
		КонецЕсли;
		
		КодАктива1Ф = ?(ЗначениеЗаполнено(ЭтаСтрока.КодАктива1Ф), ЭтаСтрока.КодАктива1Ф, ПолучитьКодАктива(ЭтаСтрока.Актив, ПараметрыПодключения));
		
		Если Не ЗначениеЗаполнено(КодАктива1Ф) Тогда
			ЗарегистрироватьОшибку(СтрШаблон(ТекстСообщения, ЭтаСтрока.КодКлиента1Ф) + " Не удалось получить код актива [" + ЭтаСтрока.Актив + "].");
			Продолжить;
		КонецЕсли;
		
		МассивПараметров = Новый Массив;

		МассивПараметров.Добавить(Новый Структура("id, value", 98, ЭтаСтрока.КодКлиента1Ф));
		МассивПараметров.Добавить(Новый Структура("id, value", 197, "Заявка")); //для ИИС должно быть значение "Договор"
		МассивПараметров.Добавить(Новый Структура("id, value", 206, КодАктива1Ф));
		МассивПараметров.Добавить(Новый Структура("id, value", 218, Формат(ЭтаСтрока.ОсновнаяЗаявка, "БЛ=false; БИ=true"))); //признак булево 1,0
		МассивПараметров.Добавить(Новый Структура("id, value", 193, ЭтаСтрока.НомерЗаявки));
		МассивПараметров.Добавить(Новый Структура("id, value", 196, Формат(ЭтаСтрока.ДатаЗаявки, "ДФ=гггг-ММ-дд"))); // или дата заключения договора (для ИИС)
		МассивПараметров.Добавить(Новый Структура("id, value", 201, Строка(ЭтаСтрока.ЗаявкаСсылка.УникальныйИдентификатор()))); //GUID заявки

		//Если ЗначениеЗаполнено(ТекПродукт.ДатаПогашения) Тогда
		//	МассивПараметров.Добавить(Новый Структура("id, value", 195, Формат(ТекПродукт.ДатаПогашения, "ДФ=гггг-ММ-дд"))); //дата закрытия, дата договора ИИС
		//КонецЕсли;
		
		ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 41, МассивПараметров));

		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
		
		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьОшибку(ТекстСообщения); 
			Продолжить;
		КонецЕсли; 
		
		КодПродукта = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data"); 
		
		Если ЗначениеЗаполнено(КодПродукта) Тогда
		
			ЭтаСтрока.КодПродукта1Ф = КодПродукта; 
			
			РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(
			ЭтаСтрока.ЗаявкаСсылка, 
			Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра,
			Справочники.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков,
			КодПродукта);
			
		КонецЕсли;
					
	КонецЦикла;
										
КонецПроцедуры

Функция ПолучитьКодАктива(АктивСсылка, ПараметрыПодключения)
	
	//1. Если в регистре "Коды во внешних системах" не нашли код актива, пробуем найти (задачу) в первой форме по GUID.
	ТекстСообщения = "Не удалось получить код первой формы для актива [" + АктивСсылка + "] по уникальному идентификатору.";
	
	GUID = Строка(АктивСсылка.УникальныйИдентификатор()); 
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 10);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201", Новый Структура("filterType, type, filter", "text", "equals", GUID)));
	
	ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
		
	ТекстСообщения = "Не удалось получить данные актива из первой формы.";
		
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/47/data", ТелоЗапроса, ТекстСообщения); 
			
	Если HTTPОтвет = Неопределено Тогда 
		ЗарегистрироватьОшибку(ТекстСообщения);
		Возврат Неопределено;		
	КонецЕсли;
	
	КодПервойФормы = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount"); 
	
	Если КодПервойФормы <> 0 Тогда
		Возврат КодПервойФормы;	
	КонецЕсли;
				
	//2. Если ничего не нашли по GUID, создаем объект в первой форме.				
	МассивПараметров = Новый Массив;
	
	Если ТипЗнч(АктивСсылка) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда 
					
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыПИФ.КраткоеНаименованиеФонда КАК Наименование
			|ИЗ
			|	РегистрСведений.РеквизитыПИФ.СрезПоследних(, ПаевойИнвестиционныйФонд = &АктивСсылка) КАК РеквизитыПИФ";
		Запрос.УстановитьПараметр("АктивСсылка", АктивСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			МассивПараметров.Добавить(Новый Структура("id, value", 122, Выборка.Наименование));
		Иначе
			ЗарегистрироватьОшибку("Не удалось создать актив в первой форме колл центра. У актива [" + АктивСсылка + "] отсутствует наименование.");
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(АктивСсылка) = Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования") Тогда
		
		МассивПараметров.Добавить(Новый Структура("id, value", 122, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АктивСсылка, "Наименование")));
			
	Иначе
		ЗарегистрироватьОшибку("Не удалось создать актив в первой форме колл центра. Для актива [" + АктивСсылка + "] не настроены правила импорта в первую форму.");
		Возврат Неопределено;			
	КонецЕсли;
	
	МассивПараметров.Добавить(Новый Структура("id, value", 201, GUID));
	МассивПараметров.Добавить(Новый Структура("id, value", 189, 0)); // при первом создании не заполняем стоимость
	
	ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("subcatId, extParams", 47, МассивПараметров));

	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks/create", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗарегистрироватьОшибку(ТекстСообщения);   
		Возврат Неопределено;
	КонецЕсли;
	 
	КодПервойФормы = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "data"); 
	
	Если Не ЗначениеЗаполнено(КодПервойФормы) Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Если ТипЗнч(АктивСсылка) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды;
	ИначеЕсли ТипЗнч(АктивСсылка) = Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования") Тогда
		ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.СтратегииИндивидуальногоИнвестирования;
	Иначе
		ЗарегистрироватьОшибку("Не удалось определить группу объектогв для актива [" + АктивСсылка + "] при записи данных в регистр [Коды во внешних системах");
		Возврат Неопределено;			
	КонецЕсли;

	//3. Фиксируем в регистре "Коды во внешних системах" код (задачи) из первой формы.
	РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(
		АктивСсылка, 
		Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра,
		ГруппаОбъектов,
		КодПервойФормы);

	Возврат КодПервойФормы; 
			
КонецФункции

Процедура ОбновитьСтоимостиАктивов(ТекПараметры) Экспорт 
			
	Если ТекПараметры.Свойство("ТаблицаПоказателей") Тогда 
				
		ТаблицаПоказателей = ТекПараметры.ТаблицаПоказателей;
		
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ФинансовыеПоказатели.Период, &ПараметрДата) КАК Дата,
			|	КлиентыОПИФ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	КлиентыОПИФ.Клиент КАК ПИФ,
			|	КодыПервойФормыКоллЦентра.Код КАК КодПервойФормыКоллЦентра,
			|	ЕСТЬNULL(ФинансовыеПоказатели.Значение, 0) КАК СтоимостьПая,
			|	ЛОЖЬ КАК ПройденаПроверкаПриостановкиРасчетСЧА
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
			|			&ПараметрДата,
			|			Организация = &Организация
			|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
			|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &ПараметрДата)
			|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)) КАК КлиентыОПИФ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
			|				&ПараметрДата,
			|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
			|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)) КАК КодыПервойФормыКоллЦентра
			|		ПО КлиентыОПИФ.Клиент = КодыПервойФормыКоллЦентра.Объект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|		ПО КлиентыОПИФ.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
			|			И (ФинансовыеПоказатели.Организация = &Организация)
			|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
			|			И (ФинансовыеПоказатели.Период = &ПараметрДата)
			|ГДЕ
			|	ВЫРАЗИТЬ(КлиентыОПИФ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
			|	И НЕ КодыПервойФормыКоллЦентра.Код ЕСТЬ NULL";

		Запрос.УстановитьПараметр("ПараметрДата", ТекПараметры.Дата);
		Запрос.УстановитьПараметр("Организация", ТекПараметры.Организация);
		
		ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ТаблицаПоказателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	
	Для Каждого ЭтаСтрока Из ТаблицаПоказателей Цикл 
		
		Если ЭтаСтрока.Дата < Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДатаСеанса(), -2) Тогда
			ЗарегистрироватьОшибку("Ошибка выгрузки стоимости паев в первую форму колл центра. Дата значения стоимости [" + Формат(ЭтаСтрока.Дата, "ДФ=dd.MM.yyyy") + "] не должна быть позже даты проведения регламентных операций");
			Прервать;
		Конецесли;
				
		ПриостановленРасчетСЧА = ?(ЭтаСтрока.ПройденаПроверкаПриостановкиРасчетСЧА, 
									Ложь, 
									БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтаСтрока.Дата, ТекПараметры.Организация, ЭтаСтрока.СчетДоверительногоУправления, "ПриостановленРасчетСЧА"));						
		
		Если Не (ЗначениеЗаполнено(ЭтаСтрока.СтоимостьПая) И ПриостановленРасчетСЧА) Тогда //значит ещё нет цены на дату 
			Продолжить;
		КонецЕсли;
						
		СтрокаОбновления = "#n220#v" + Формат(ПриостановленРасчетСЧА, "БЛ=false; БИ=true");
		СтрокаОбновления = СтрокаОбновления + "::#n189#v" + Формат(ЭтаСтрока.СтоимостьПая, "ЧН=0; ЧГ=0");
		
		МассивДанных.Добавить(Новый Структура("taskId, extParamStr", ЭтаСтрока.КодПервойФормыКоллЦентра, СтрокаОбновления));
						
	КонецЦикла;
		
	Если МассивДанных.Количество() > 0 Тогда
	
		ТекстСообщения = "Не удалось обновить стоимости паев.";

		ЗапросОбновления = ПолучитьСтрокуJSON(МассивДанных);
				
		Если ЗначениеЗаполнено(ЗапросОбновления) Тогда
			
			ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения("uk1f"); 
		
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/extparams/update", ЗапросОбновления, ТекстСообщения);

			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ТекПараметры.Свойство("ТаблицаПоказателей") Тогда 
		ОповеститьОбОшибках();	
	КонецЕсли;
			
КонецПроцедуры

Процедура ПроверитьПриостановкуРасчетаСЧА(Организация) Экспорт
	
	Если Не АктивированМеханизмЭкспортаДанных(Организация) Тогда
		Возврат;	
	КонецЕсли;
	
	ДатаПроверки = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДатаСеанса(), -2);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыОПИФ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыОПИФ.Клиент КАК ПИФ,
		|	КодыПервойФормыКоллЦентра.Код КАК КодПервойФормыКоллЦентра
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаПроверки,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &ДатаПроверки)
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)) КАК КлиентыОПИФ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&ДатаПроверки,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды)) КАК КодыПервойФормыКоллЦентра
		|		ПО КлиентыОПИФ.Клиент = КодыПервойФормыКоллЦентра.Объект
		|			И ВЫРАЗИТЬ(КлиентыОПИФ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)";

	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("Организация", Организация);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
						
		ПриостановленРасчетСЧА = БухгалтерскийУчет.ОпределитьНастройкуУчета(ДатаПроверки, Организация, Выборка.СчетДоверительногоУправления, "ПриостановленРасчетСЧА");						
						
		СтрокаОбновления = "#n220#v" + Формат(ПриостановленРасчетСЧА, "БЛ=false; БИ=true");
				
		МассивДанных.Добавить(Новый Структура("taskId, extParamStr", Выборка.КодПервойФормыКоллЦентра, СтрокаОбновления));
						
	КонецЦикла;
		
	Если МассивДанных.Количество() > 0 Тогда
	
		ТекстСообщения = "Не удалось обновить параметр [Приостановлен расчет СЧА].";

		ЗапросОбновления = ПолучитьСтрокуJSON(МассивДанных);
				
		Если ЗначениеЗаполнено(ЗапросОбновления) Тогда
			
			ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения("uk1f"); 
		
			HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/extparams/update", ЗапросОбновления, ТекстСообщения);

			Если HTTPОтвет = Неопределено Тогда
				ЗарегистрироватьОшибку(ТекстСообщения);
			КонецЕсли; 
						
		КонецЕсли;
		
	КонецЕсли;
	
	ОповеститьОбОшибках();
	
КонецПроцедуры

Функция ПолучитьКодПродукта(ЗаявкаСсылка, ПараметрыПодключения, Продукты = Неопределено)
			
	Если Продукты <> Неопределено Тогда
			
		МассивСтрок = Продукты.НайтиСтроки(Новый Структура("ЗаявкаСсылка", ЗаявкаСсылка));
			
		Если МассивСтрок.Количество() = 1 Тогда
			
			Если ЗначениеЗаполнено(МассивСтрок[0].КодПродукта1Ф) Тогда
				Возврат МассивСтрок[0].КодПродукта1Ф;	
			КонецЕсли;
			
		Иначе
			Возврат Неопределено;		
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекстСообщения = "Не удалось получить продукт по идентификатору заявки [" + ЗаявкаСсылка + "].";
	
	//Ищем продукт по GUID(заявки, договора)		
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 100); 
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначенияВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить(РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type, extParamType", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201"));
	СтруктураЗапроса.filterModel.ExtParam201 = Новый Структура("filterType, type, filter", "text", "equals", Строка(ЗаявкаСсылка.УникальныйИдентификатор())); 

	ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/Subcat/41/data", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗарегистрироватьОшибку(ТекстСообщения);   
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
	
КонецФункции

Функция ПолучитьКодПортфеля(ЗаявкаСсылка, ПараметрыПодключения) 
	
	ТекстСообщения = "Не удалось получить продукт по идентификатору заявки [" + ЗаявкаСсылка + "]";
	
	//Ищем портфель по GUID заявки.	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 100);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam201", Новый Структура("filterType, type, filter", "text", "equals", Строка(ЗаявкаСсылка.УникальныйИдентификатор()))));
	
	ТелоЗапроса = ПолучитьСтрокуJSON(СтруктураЗапроса);
	
	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/Subcat/43/data", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗарегистрироватьОшибку(ТекстСообщения);   
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount");
				
КонецФункции 

Процедура ЗарегистрироватьОшибку(ТекстОшибки, СчетчикОшибок = Неопределено)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	// дополним текст ошибки сообщениями пользователю
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстОшибки = ТекстОшибки + Символы.ПС + "Сообщения пользователю:";
		Для Каждого ТекСообщение Из МассивСообщений Цикл
			
			Если ТекСообщение.Текст = "" Тогда
				Продолжить;
			Иначе
				Текст = ТекСообщение.Текст + ". " + Строка(ТекСообщение.КлючДанных);
				ТекстОшибки = ТекстОшибки + Символы.ПС + Текст; 
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ТекстОшибки = ТекстОшибки;                                  
	КонецЕсли;
	
    Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда    	
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли; 
	
	Если СчетчикОшибок <> Неопределено Тогда
		СчетчикОшибок = СчетчикОшибок - 1;	
	КонецЕсли;
			
КонецПроцедуры

Процедура ОповеститьОбОшибках() Экспорт
		
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда	
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	
КонецПроцедуры 

Процедура ОбновитьДанныеПервойФормы(КодЗадачи, НовыеДанные, ПараметрыПодключения, ПараметрыДляСверки = Неопределено, ПараметрыИсключеныИзСверки = Неопределено, КодОбновленного = Неопределено)
	
	ТекстСообщения = "Не удалось обновить данные в первой форме. Задача [" + КодЗадачи + "]";
	
	ТелоЗапроса = ПолучитьСтрокуJSON(Новый Структура("taskId, selectedInfoParts", КодЗадачи, РаботаСКоллекциями.ЗначениеВМассив("ExtParams")));

	HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/tasks", ТелоЗапроса, ТекстСообщения);
	
	Если HTTPОтвет = Неопределено Тогда
		ЗарегистрироватьОшибку(ТекстСообщения);
	Иначе
		
		ЗадачаОбъект = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"));
	
		Если ТипЗнч(ЗадачаОбъект) = Тип("Структура") И ЗадачаОбъект.Свойство("ExtParams") Тогда
			
			ЗапросОбновления = СформироватьЗапросОбновления(КодЗадачи, НовыеДанные, ЗадачаОбъект.extParams, ПараметрыДляСверки, ПараметрыИсключеныИзСверки); 
			
			Если ЗначениеЗаполнено(ЗапросОбновления) Тогда
					
				HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api/extparams/update", ЗапросОбновления, ТекстСообщения);
		
				Если HTTPОтвет = Неопределено Тогда
					ЗарегистрироватьОшибку(ТекстСообщения);   
				КонецЕсли;
				
				КодОбновленного = КодЗадачи;
				
			КонецЕсли;
						
		Иначе
			ЗарегистрироватьОшибку(ТекстСообщения);	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьЗапросОбновления(КодЗадачи, НовыеДанные, ДанныеПервойФормы, ПараметрыДляСверки = Неопределено, ПараметрыИсключеныИзСверки = Неопределено)
	
	СтрокаОбновления = ""; 
	
	Если ЗначениеЗаполнено(ПараметрыДляСверки) Тогда
		МассивПараметров = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыДляСверки, ",");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыИсключеныИзСверки) Тогда
		МассивИсключенныхПараметров = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыИсключеныИзСверки, ",");	
	КонецЕсли;

	Для Каждого Параметр Из ДанныеПервойФормы Цикл 
		
		Если ЗначениеЗаполнено(ПараметрыДляСверки) И МассивПараметров.Найти(Строка(Параметр.id)) = Неопределено
			Или ЗначениеЗаполнено(ПараметрыИсключеныИзСверки) И МассивИсключенныхПараметров.Найти(Строка(Параметр.id)) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		Если Параметр.id = 74 И Параметр.value <> СокрЛП(НовыеДанные.Отчество) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Отчество)); 
			
		ИначеЕсли Параметр.id = 75 И Параметр.value <> СокрЛП(НовыеДанные.Имя) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Имя)); 
			
		ИначеЕсли Параметр.id = 76 И Параметр.value <> СокрЛП(НовыеДанные.Фамилия) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Фамилия));
			
		ИначеЕсли Параметр.id = 77 И Параметр.value <> Формат(НовыеДанные.ДатаРождения, "ДФ=гггг-ММ-дд") Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.ДатаРождения, "ДФ=гггг-ММ-дд"));
			
		ИначеЕсли Параметр.id = 78 И Параметр.value <> СокрЛП(НовыеДанные.ИНН) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.ИНН)); 
			
		ИначеЕсли Параметр.id = 84 И Параметр.value <> СокрЛП(НовыеДанные.СерияДокумента) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.СерияДокумента)); 	
			
		ИначеЕсли Параметр.id = 85 И Параметр.value <> СокрЛП(НовыеДанные.НомерДокумента) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.НомерДокумента));	
			
		ИначеЕсли Параметр.id = 86 И Параметр.value <> Формат(НовыеДанные.ДатаВыдачиДокумента, "ДФ=гггг-ММ-дд") Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.ДатаВыдачиДокумента, "ДФ=гггг-ММ-дд"));
			
		ИначеЕсли Параметр.id = 87 И Параметр.value <> СокрЛП(НовыеДанные.ОрганВыдавшийДокумент) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.ОрганВыдавшийДокумент)); 
			
		ИначеЕсли Параметр.id = 88 И Параметр.value <> СокрЛП(НовыеДанные.КодПодразделения) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.КодПодразделения)); 
			
		ИначеЕсли Параметр.id = 165 И Параметр.value.value <> "Открытый" Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), "Открытый");	
				
		ИначеЕсли Параметр.id = 167 И ЗначениеЗаполнено(НовыеДанные.ДатаОкончанияДействияДокумента) И Параметр.value <> Формат(НовыеДанные.ДатаОкончанияДействияДокумента, "ДФ=гггг-ММ-дд") Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.ДатаОкончанияДействияДокумента, "ДФ=гггг-ММ-дд"));

		ИначеЕсли Параметр.id = 169 И ЗначениеЗаполнено(Параметр.value) И Параметр.value <> СокрЛП(НовыеДанные.СНИЛС) Тогда

			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.СНИЛС));
        
		ИначеЕсли Параметр.id = 122 И Параметр.value <> СокрЛП(НовыеДанные.Наименование) Тогда 
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Наименование));
			
		ИначеЕсли Параметр.id = 179 И Параметр.value.value <> НовыеДанные.Тип Тогда
			
        	СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), НовыеДанные.Тип); 
			
		ИначеЕсли Параметр.id = 180 И Параметр.value <> СокрЛП(НовыеДанные.Номер) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Номер)); 
			
		ИначеЕсли Параметр.id = 183 И Параметр.nativeValue <> Формат(НовыеДанные.Количество, "ЧН=0; ЧГ=0") Тогда 
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.Количество, "ЧН=0; ЧГ=0"));
			
		ИначеЕсли Параметр.id = 184 И Параметр.nativeValue <> Формат(НовыеДанные.Сумма, "ЧН=0; ЧГ=0") Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.Сумма, "ЧН=0; ЧГ=0"));
			
		ИначеЕсли Параметр.id = 187 И Лев(Параметр.Value, 10) <> Формат(НовыеДанные.Дата, "ДФ=гггг-ММ-дд") Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.Дата, "ДФ=гггг-ММ-дд'T'ЧЧ:мм:сс"));

		ИначеЕсли Параметр.id = 189 И Параметр.nativeValue <> Формат(НовыеДанные.Цена, "ЧН=0; ЧГ=0") Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.Цена, "ЧН=0; ЧГ=0"));
							
		ИначеЕсли Параметр.id = 200 И ЗначениеЗаполнено(НовыеДанные.Статус) И Параметр.value.value <> СокрЛП(НовыеДанные.Статус) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Статус));
			
		ИначеЕсли Параметр.id = 201 И Параметр.value <> СокрЛП(НовыеДанные.Ссылка.УникальныйИдентификатор()) Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), СокрЛП(НовыеДанные.Ссылка.УникальныйИдентификатор()));
						
		ИначеЕсли Параметр.id = 221 И Параметр.value <> НовыеДанные.АктивированЛичныйКабинетЕсиа Тогда
			
			СтрокаОбновления = СтрокаОбновления + СтрШаблон("::#n%1#v%2", Строка(Параметр.id), Формат(НовыеДанные.АктивированЛичныйКабинетЕсиа, "БЛ=false; БИ=true"));
 				
		КонецЕсли;					
		
	КонецЦикла;
	
	СтрокаОбновления = ?(СтрНачинаетсяС(СтрокаОбновления, "::"), Сред(СтрокаОбновления, 3), СтрокаОбновления); 
		
	Если ЗначениеЗаполнено(СтрокаОбновления) Тогда
		Возврат ПолучитьСтрокуJSON(РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("taskId, extParamStr", КодЗадачи, СтрокаОбновления)));
	Иначе
		Возврат Неопределено;
	КонецЕсли;  	
					
КонецФункции

Функция СформироватьСтруктуруДанных(СтрокаСвойствСтруктуры = Неопределено) Экспорт
	
	Если СтрокаСвойствСтруктуры = Неопределено Тогда	
		СтрокаСвойствСтруктуры = "ТаблицаКлиентов,БанковскиеРеквизиты,Продукты,Операции,Заявки,Портфель";
	КонецЕсли;

	ДанныеДляВыгрузки = Новый Структура(СтрокаСвойствСтруктуры);
	
	Если ДанныеДляВыгрузки.Свойство("ТаблицаКлиентов") Тогда  //+ контакты

		ТаблицаКлиентов = Новый ТаблицаЗначений; 
		ТаблицаКлиентов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ЮрфизЛица"));
		ТаблицаКлиентов.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТаблицаКлиентов.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТаблицаКлиентов.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТаблицаКлиентов.Колонки.Добавить("Пол", Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
		ТаблицаКлиентов.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
		ТаблицаКлиентов.Колонки.Добавить("СерияДокумента", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТаблицаКлиентов.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТаблицаКлиентов.Колонки.Добавить("ДатаВыдачиДокумента", Новый ОписаниеТипов("Дата"));
		ТаблицаКлиентов.Колонки.Добавить("ДатаОкончанияДействияДокумента", Новый ОписаниеТипов("Дата"));
		ТаблицаКлиентов.Колонки.Добавить("ОрганВыдавшийДокумент", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
		ТаблицаКлиентов.Колонки.Добавить("КодПодразделения", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
		ТаблицаКлиентов.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(14)));
		ТаблицаКлиентов.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));
		ТаблицаКлиентов.Колонки.Добавить("Код1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		ТаблицаКлиентов.Колонки.Добавить("Контакты", Новый ОписаниеТипов("Массив"));
		ТаблицаКлиентов.Колонки.Добавить("АктивированЛичныйКабинетЕсиа", Новый ОписаниеТипов("Булево")); 

		//ТаблицаКлиентов.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12)));
		
		ДанныеДляВыгрузки.ТаблицаКлиентов = ТаблицаКлиентов;
							
	КонецЕсли;
		
	Если ДанныеДляВыгрузки.Свойство("БанковскиеРеквизиты") Тогда 
		
		БанковскиеРеквизиты = Новый ТаблицаЗначений; 
		БанковскиеРеквизиты.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
		БанковскиеРеквизиты.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		БанковскиеРеквизиты.Колонки.Добавить("Бик", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(9)));
		БанковскиеРеквизиты.Колонки.Добавить("Банк", Новый ОписаниеТипов("СправочникСсылка.Банки"));
		БанковскиеРеквизиты.Колонки.Добавить("НомерСчета", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
		БанковскиеРеквизиты.Колонки.Добавить("КоррСчет", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
		БанковскиеРеквизиты.Колонки.Добавить("КодБанка1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		БанковскиеРеквизиты.Колонки.Добавить("КодКлиента1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55))); 
		
		ДанныеДляВыгрузки.БанковскиеРеквизиты = БанковскиеРеквизиты;
	
	КонецЕсли;
	
	МассивТипов = РаботаСКоллекциями.ЗначенияВМассив(Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды"), Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования"));

	Если ДанныеДляВыгрузки.Свойство("Операции") Тогда
		
		МассивТиповОпераций = Новый Массив;
		МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ВводДенежныхСредств"));
		МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ВыводДенежныхСредств"));
		МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ЗачислениеПаев"));
		МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ПогашениеПаев"));
		МассивТиповОпераций.Добавить(Тип("ДокументСсылка.ЗаявкаПайщика"));
		
		Операции = Новый ТаблицаЗначений;
		Операции.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		Операции.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(МассивТиповОпераций)); 
		Операции.Колонки.Добавить("ЗаявкаСсылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Операции.Колонки.Добавить("СсылкаЗаявкиАктива", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Операции.Колонки.Добавить("СсылкаЗаявкиАктиваДляОбмена", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Операции.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата")); 
		Операции.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
		Операции.Колонки.Добавить("ДатаЗаявки", Новый ОписаниеТипов("Дата"));
		Операции.Колонки.Добавить("НомерЗаявки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(70)));
		Операции.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		Операции.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		Операции.Колонки.Добавить("Цена", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);   
		Операции.Колонки.Добавить("СкидкаНадбавка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,4)));
		Операции.Колонки.Добавить("СуммаНДФЛ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,4)));
		Операции.Колонки.Добавить("Актив", Новый ОписаниеТипов(МассивТипов));
		Операции.Колонки.Добавить("АктивДляОбмена", Новый ОписаниеТипов(МассивТипов));
		Операции.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗаявокПайщиков"));
		Операции.Колонки.Добавить("КодПродукта1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
        Операции.Колонки.Добавить("КодПродуктаДляОбмена1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Операции.Колонки.Добавить("КодКлиента1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));

		ДанныеДляВыгрузки.Операции = Операции;
		
	КонецЕсли;
		
	Если ДанныеДляВыгрузки.Свойство("Продукты") Тогда
		
		Продукты = Новый ТаблицаЗначений;
		Продукты.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		Продукты.Колонки.Добавить("Актив", Новый ОписаниеТипов(МассивТипов));
		Продукты.Колонки.Добавить("ЗаявкаСсылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Продукты.Колонки.Добавить("ДатаЗаявки", Новый ОписаниеТипов("Дата"));
		Продукты.Колонки.Добавить("НомерЗаявки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
		Продукты.Колонки.Добавить("ОсновнаяЗаявка", Новый ОписаниеТипов("Булево"));
		Продукты.Колонки.Добавить("КодАктива1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Продукты.Колонки.Добавить("КодПродукта1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Продукты.Колонки.Добавить("КодКлиента1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		
	    ДанныеДляВыгрузки.Продукты = Продукты; 

	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("Заявки") Тогда 
		
		Заявки = Новый ТаблицаЗначений;
		Заявки.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		Заявки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Заявки.Колонки.Добавить("ОсновнаяЗаявка", Новый ОписаниеТипов("Булево"));
		Заявки.Колонки.Добавить("Актив", Новый ОписаниеТипов(МассивТипов));
		Заявки.Колонки.Добавить("Цена", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		Заявки.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.ЦенныеБумагиСумма.Тип);
		Заявки.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		Заявки.Колонки.Добавить("КодАктива1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Заявки.Колонки.Добавить("ДатаЗаявки", Новый ОписаниеТипов("Дата"));
		Заявки.Колонки.Добавить("НомерЗаявки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(70)));
		Заявки.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
		
		ДанныеДляВыгрузки.Заявки = Заявки;
		
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("Портфель") Тогда
		
		Портфель = Новый ТаблицаЗначений;
		Портфель.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
		Портфель.Колонки.Добавить("Актив", Новый ОписаниеТипов(МассивТипов));
		Портфель.Колонки.Добавить("КодПродукта1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Портфель.Колонки.Добавить("Цена", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
		Портфель.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.ЦенныеБумагиКоличество.Тип);
		Портфель.Колонки.Добавить("КодАктива1Ф",  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
		Портфель.Колонки.Добавить("ЗаявкаСсылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаПайщика"));
		Портфель.Колонки.Добавить("КодКлиента1Ф", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));

		ДанныеДляВыгрузки.Портфель = Портфель; 
		
	КонецЕсли;

	Возврат ДанныеДляВыгрузки;
	
КонецФункции

Функция СформироватьПараметрКонтактов(КонтактыКлиента)
	
	ПараметрКонтактов = Новый Структура("id, value", 164, Новый Структура("rows", Новый Массив));
		
	Для Инд = 0 По КонтактыКлиента.Количество() - 1 Цикл
		
		СтруктураСтрокиКонтактов = Новый Структура("cols",
									РаботаСКоллекциями.ЗначенияВМассив(
										Новый Структура("id, value", 1, КонтактыКлиента[Инд].АдресНомер),
										Новый Структура("id, value, dataSourceItemId", 2, КонтактыКлиента[Инд].ТипСвязи, КонтактыКлиента[Инд].ТипСвязи)));
													
		СтруктураСтрокиКонтактов.Вставить("id", Инд + 1);
		СтруктураСтрокиКонтактов.Вставить("modifyType", "create");
						
		ПараметрКонтактов.value.rows.Добавить(СтруктураСтрокиКонтактов);		
								
	КонецЦикла;
	
	Возврат ПараметрКонтактов;
		
КонецФункции

Функция ПолучитьКодыБанковИзПервойФормы(БанковскиеРеквизиты, ПараметрыПодключения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеРеквизиты.БИК КАК БИК,
		|	БанковскиеРеквизиты.Банк КАК Банк,
		|	БанковскиеРеквизиты.КодБанка1Ф КАК КодБанка1Ф
		|ПОМЕСТИТЬ _БанковскиеРеквизиты
		|ИЗ
		|	&БанковскиеРеквизиты КАК БанковскиеРеквизиты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_БанковскиеРеквизиты.БИК КАК БИК,
		|	_БанковскиеРеквизиты.Банк КАК Банк,
		|	_БанковскиеРеквизиты.КодБанка1Ф КАК КодБанка1Ф
		|ИЗ
		|	_БанковскиеРеквизиты КАК _БанковскиеРеквизиты
		|ГДЕ
		|	_БанковскиеРеквизиты.КодБанка1Ф = """"";
	Запрос.УстановитьПараметр("БанковскиеРеквизиты", БанковскиеРеквизиты); 
	
	ТаблицаБанков = Запрос.Выполнить().Выгрузить();
				
	Если ТаблицаБанков.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("startRow", 0);
	СтруктураЗапроса.Вставить("endRow", 10);
	СтруктураЗапроса.Вставить("select", РаботаСКоллекциями.ЗначениеВМассив(Новый Структура("field, type", "taskId", "numberValue")));
	СтруктураЗапроса.Вставить("filterModel", Новый Структура("ExtParam174", Новый Структура("filterType, type, filter", "text", "equals")));
	
	Для Инд = 1 - ТаблицаБанков.Количество() По 0 Цикл 
		
		ТекСтрока = ТаблицаБанков[-Инд];

		ТекстСообщения = "Не удалось получить данные первой формы для юр. лица [" + ТекСтрока.Банк + "] по коду БИК [" + ТекСтрока.БИК + "]";
		
		СтруктураЗапроса.filterModel.ExtParam174.filter = ТекСтрока.БИК; 
		
		ТелоЗапроса =  ПолучитьСтрокуJSON(СтруктураЗапроса);
		
		HTTPОтвет = РаботаСВнешнимиСистемами.HTTP_ВыполнитьЗапрос("POST", ПараметрыПодключения, "/api-core/datasource/subcat/44/data", ТелоЗапроса, ТекстСообщения);

		Если HTTPОтвет = Неопределено Тогда
			ЗарегистрироватьОшибку(ТекстСообщения);
			ТаблицаБанков.Удалить(-Инд);
			Продолжить;
		КонецЕсли;
		
		КодПервойФормы = ДесериализоватьСтрокуJSON(HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"), "totalCount"); 
		
		Если Не ЗначениеЗаполнено(КодПервойФормы) Тогда 
			ЗарегистрироватьОшибку("Не удалось получить код первой формы для юр. лица [" + ТекСтрока.Банк + "].");
			ТаблицаБанков.Удалить(-Инд);
			Продолжить;
		Конецесли;
				
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(
			ТекСтрока.Банк, 
			Справочники.ВнешниеСистемы.ПерваяФормаКоллЦентра, 
			Справочники.ГруппыИмпортируемыхОбъектов.Банки,
			КодПервойФормы);
			
		ТекСтрока.КодБанка1Ф = КодПервойФормы;	
			
	КонецЦикла;
	
	Возврат ТаблицаБанков; 
		
КонецФункции

Функция ПолучитьСтрокуJSON(СтруктураДанных)
	
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ДесериализоватьСтрокуJSON(СтрокаJSON, ИмяСвойства = Неопределено)
	
	ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    ТекОбъект = ПрочитатьJSON(ЧтениеJSON);
	
	Если ИмяСвойства = Неопределено Тогда
		Возврат ТекОбъект;
	ИначеЕсли ТипЗнч(ТекОбъект) = Тип("Структура") И ТекОбъект.Свойство(ИмяСвойства) Тогда 
		
		Если ИмяСвойства = "totalCount" Тогда 
			
			Если ТекОбъект.totalCount = 1 И ТекОбъект.Свойство("tasksDataSourceResponse") Тогда
				Возврат Формат(ТекОбъект.tasksDataSourceResponse[0].taskId, "ЧГ=0");
			ИначеЕсли ТекОбъект.totalCount > 1 Тогда 
				
				ЗадачиСтр = "";
				Для Каждого ТекЗадача Из ТекОбъект.tasksDataSourceResponse Цикл
					ЗадачиСтр = ЗадачиСтр + ?(ЗначениеЗаполнено(ЗадачиСтр), ",", "") + Формат(ТекЗадача.taskId, "ЧГ=0");	
				КонецЦикла;
				
				ЗарегистрироватьОшибку("Обнаружено несколько задач [" + ЗадачиСтр + "] с одинаковым идентификатором GUID");
				
			ИначеЕсли ТекОбъект.totalCount = 0 Тогда
				Возврат 0;
			КонецЕсли
			
		ИначеЕсли ИмяСвойства = "data" Тогда 
			
			Если ТекОбъект.data.Свойство("value") Тогда
				Возврат Формат(ТекОбъект.data.value, "ЧГ=0");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекОбъект) = Тип("Структура") И ТекОбъект.Свойство("errors") Тогда
		
		Для Каждого ТекОшибка Из ТекОбъект.errors Цикл
			//ЗарегистрироватьОшибку(СтрШаблон(    ТекОшибка.errorType, ТекОшибка.message));		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Процедура ЗаполнитьКодКлиента(КодКлиента, ТекДанные, ФлагЗаполнитьКодКлиента = Истина)
	
	Если Не ФлагЗаполнитьКодКлиента Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементДанных Из ТекДанные Цикл 
		
		Если ЗначениеЗаполнено(ЭлементДанных.КодКлиента1Ф) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементДанных.КодКлиента1Ф = КодКлиента;
		
	КонецЦикла;
		
КонецПроцедуры

//бизнес процесс
Функция АктивированМеханизмЭкспортаДанных(Организация) Экспорт 
		
	Если Не ПараметрыСеанса.ЭтоРабочаяИнформационнаяБаза Тогда
		Возврат Ложь;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияДополнительныхСведений.Значение КАК ФлагАктивирован
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|ГДЕ
		|	ЗначенияДополнительныхСведений.Объект = &Организация
		|	И ЗначенияДополнительныхСведений.Свойство.Ключ = ""АктивированМеханизмЭкспортаДанныхВПервуюФормуКоллЦентра""";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФлагАктивирован;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ЭкспортироватьДанныеЗаявки(ЗаявкаСсылка, Отказ) Экспорт
	
	ЗначениеРеквизитовЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаСсылка, "Дата, Организация");
	
	Если Не АктивированМеханизмЭкспортаДанных(ЗначениеРеквизитовЗаявки.Организация) Тогда
		Возврат;	
	КонецЕсли;
	
	Механизм = Метаданные.Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Имя + ".ЭкспортироватьДанныеЗаявки()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура("Организация, Заявка", ЗначениеРеквизитовЗаявки.Организация, ЗаявкаСсылка));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание); 
		
	ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения("uk1f");
	
	Если ПараметрыПодключения = Неопределено Тогда		
		ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, "Ошибка подключения к первой форме колл центра.", Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокЗаявкаПайщика.Ссылка КАК Ссылка,
		|	ДокЗаявкаПайщика.НомерЗаявки КАК НомерЗаявки,
		|	ДокЗаявкаПайщика.Дата КАК ДатаЗаявки,
		|	ДокЗаявкаПайщика.Пайщик КАК Клиент,
		|	ДокЗаявкаПайщика.ВидЗаявки КАК ВидЗаявки,
		|	ВЫБОР
		|		КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление)
		|			ТОГДА ""Приобретение паев""
		|		КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Погашение)
		|			ТОГДА ""Погашение паев""
		|		КОГДА ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|			ТОГДА ""Обмен паев""
		|	КОНЕЦ КАК Тип,
		|	ДокЗаявкаПайщика.ПаевойИнвестиционныйФонд КАК Актив,
		|	ДокЗаявкаПайщика.ПаевойИнвестиционныйФондДляОбменаПаев КАК АктивДляОбмена,
		|	ДокЗаявкаПайщика.Сумма КАК Сумма,
		|	ДокЗаявкаПайщика.Количество КАК Количество,
		|	ДокЗаявкаПайщика.ВыгружатьОперацииВЕСИАФинанс КАК ОсновнаяЗаявка,
		|	ДокЗаявкаПайщика.ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена КАК ОткрытьСчетДляОбмена,
		|	СтатусыЗаявокПайщиковСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ _ДанныеЗаявки
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ДокЗаявкаПайщика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПайщиков.СрезПоследних(, Организация = &Организация) КАК СтатусыЗаявокПайщиковСрезПоследних
		|		ПО ДокЗаявкаПайщика.Ссылка = СтатусыЗаявокПайщиковСрезПоследних.ЗаявкаПайщика
		|ГДЕ
		|	ДокЗаявкаПайщика.Ссылка = &ЗаявкаСсылка
		|	И ДокЗаявкаПайщика.ВыгружатьОперацииВЕСИАФинанс
		|	И НЕ ДокЗаявкаПайщика.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыПервойФормы.Объект КАК Объект,
		|	КодыПервойФормы.Код КАК Код
		|ПОМЕСТИТЬ _КодыПервойФормыКоллЦентра
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
		|				И Объект В
		|					(ВЫБРАТЬ
		|						_ДанныеЗаявки.Клиент
		|					ИЗ
		|						_ДанныеЗаявки КАК _ДанныеЗаявки
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_ДанныеЗаявки.Актив
		|					ИЗ
		|						_ДанныеЗаявки КАК _ДанныеЗаявки
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_ДанныеЗаявки.АктивДляОбмена
		|					ИЗ
		|						_ДанныеЗаявки КАК _ДанныеЗаявки
		|					ГДЕ
		|						_ДанныеЗаявки.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыПервойФормы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокЗаявкаПайщика.Ссылка КАК Ссылка,
		|	ДокЗаявкаПайщика.ВидЗаявки КАК ВидЗаявки,
		|	ДокЗаявкаПайщика.ПаевойИнвестиционныйФонд КАК Актив,
		|	ДокЗаявкаПайщика.ПаевойИнвестиционныйФондДляОбменаПаев КАК АктивДляОбмена,
		|	ДокЗаявкаПайщика.Пайщик КАК Клиент,
		|	ДокЗаявкаПайщика.Дата КАК ДатаЗаявки,
		|	ДокЗаявкаПайщика.НомерЗаявки КАК НомерЗаявки,
		|	ДокЗаявкаПайщика.ВыгружатьОперацииВЕСИАФинанс КАК ОсновнаяЗаявка,
		|	КодыКлиентов.Код КАК КодКлиента1Ф,
		|	КодыАктивов.Код КАК КодАктива1Ф,
		|	КодыАктивовДляОбмена.Код КАК КодАктиваДляОбмена1Ф,
		|	КодыПродуктов.Код КАК КодПродукта1Ф
		|ПОМЕСТИТЬ _ВсеЗаявкиКлиента
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ДокЗаявкаПайщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеЗаявки КАК _ДанныеЗаявки
		|		ПО ДокЗаявкаПайщика.Пайщик = _ДанныеЗаявки.Клиент
		|			И (ДокЗаявкаПайщика.ВидЗаявки В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление), ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)))
		|			И (ДокЗаявкаПайщика.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыПервойФормыКоллЦентра КАК КодыКлиентов
		|		ПО ДокЗаявкаПайщика.Пайщик = КодыКлиентов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыПервойФормыКоллЦентра КАК КодыАктивов
		|		ПО ДокЗаявкаПайщика.ПаевойИнвестиционныйФонд = КодыАктивов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыПервойФормыКоллЦентра КАК КодыАктивовДляОбмена
		|		ПО (ДокЗаявкаПайщика.ПаевойИнвестиционныйФондДляОбменаПаев = КодыАктивов.Объект)
		|			И (ДокЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков)) КАК КодыПродуктов
		|		ПО ДокЗаявкаПайщика.Ссылка = КодыПродуктов.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Актив КАК Актив,
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.ДатаЗаявки КАК ДатаЗаявки,
		|	ВложенныйЗапрос.КодКлиента1Ф КАК КодКлиента1Ф,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.Ссылка, _ЗаявкиНаОбмен.Ссылка) КАК ЗаявкаСсылка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.НомерЗаявки, _ЗаявкиНаОбмен.НомерЗаявки) КАК НомерЗаявки,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.ОсновнаяЗаявка, _ЗаявкиНаОбмен.ОсновнаяЗаявка) КАК ОсновнаяЗаявка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодАктива1Ф, _ЗаявкиНаОбмен.КодАктиваДляОбмена1Ф) КАК КодАктива1Ф,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодПродукта1Ф, _ЗаявкиНаОбмен.КодПродукта1Ф) КАК КодПродукта1Ф
		|ПОМЕСТИТЬ _ПродуктыКлиента
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА _ВсеЗаявкиКлиента.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ВсеЗаявкиКлиента.АктивДляОбмена
		|			ИНАЧЕ _ВсеЗаявкиКлиента.Актив
		|		КОНЕЦ КАК Актив,
		|		_ВсеЗаявкиКлиента.Клиент КАК Клиент,
		|		_ВсеЗаявкиКлиента.КодКлиента1Ф КАК КодКлиента1Ф,
		|		МИНИМУМ(_ВсеЗаявкиКлиента.ДатаЗаявки) КАК ДатаЗаявки
		|	ИЗ
		|		_ВсеЗаявкиКлиента КАК _ВсеЗаявкиКлиента
		|	ГДЕ
		|		_ВсеЗаявкиКлиента.ВидЗаявки В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление), ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА _ВсеЗаявкиКлиента.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ВсеЗаявкиКлиента.АктивДляОбмена
		|			ИНАЧЕ _ВсеЗаявкиКлиента.Актив
		|		КОНЕЦ,
		|		_ВсеЗаявкиКлиента.Клиент,
		|		_ВсеЗаявкиКлиента.КодКлиента1Ф) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеЗаявкиКлиента КАК _ЗаявкиНаПриобретение
		|		ПО ВложенныйЗапрос.Актив = _ЗаявкиНаПриобретение.Актив
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаПриобретение.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаПриобретение.ДатаЗаявки
		|			И (_ЗаявкиНаПриобретение.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВсеЗаявкиКлиента КАК _ЗаявкиНаОбмен
		|		ПО ВложенныйЗапрос.Актив = _ЗаявкиНаОбмен.АктивДляОбмена
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаОбмен.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаОбмен.ДатаЗаявки
		|			И (_ЗаявкиНаОбмен.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявки.Ссылка КАК Ссылка,
		|	_ДанныеЗаявки.Ссылка КАК ЗаявкаСсылка,
		|	_ДанныеЗаявки.Клиент КАК Клиент,
		|	NULL КАК Дата,
		|	_ДанныеЗаявки.Тип КАК Тип,
		|	_ДанныеЗаявки.ДатаЗаявки КАК ДатаЗаявки,
		|	_ДанныеЗаявки.НомерЗаявки КАК НомерЗаявки,
		|	_ДанныеЗаявки.ОсновнаяЗаявка КАК ОсновнаяЗаявка,
		|	_ДанныеЗаявки.Статус КАК Статус,
		|	_ДанныеЗаявки.Актив КАК Актив,
		|	_ДанныеЗаявки.АктивДляОбмена КАК АктивДляОбмена,
		|	ВЫБОР
		|		КОГДА _ДанныеЗаявки.Количество > 0
		|			ТОГДА ВЫРАЗИТЬ(_ДанныеЗаявки.Сумма / _ДанныеЗаявки.Количество КАК ЧИСЛО(19, 4))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена,
		|	ВЫРАЗИТЬ(_ДанныеЗаявки.Сумма КАК ЧИСЛО(19, 4)) КАК Сумма,
		|	ВЫРАЗИТЬ(_ДанныеЗаявки.Количество КАК ЧИСЛО(19, 7)) КАК Количество,
		|	0 КАК СуммаНДФЛ,
		|	0 КАК СкидкаНадбавка,
		|	_ДанныеПродукта.КодКлиента1Ф КАК КодКлиента1Ф,
		|	_ДанныеПродукта.ЗаявкаСсылка КАК СсылкаЗаявкиАктива,
		|	_ДанныеПродуктаДляОбмена.ЗаявкаСсылка КАК СсылкаЗаявкиАктиваДляОбмена,
		|	_ДанныеПродукта.КодПродукта1Ф КАК КодПродукта1Ф,
		|	_ДанныеПродуктаДляОбмена.КодПродукта1Ф КАК КодПродуктаДляОбмена1Ф
		|ПОМЕСТИТЬ _ДанныеЗаявкиКлиента
		|ИЗ
		|	_ДанныеЗаявки КАК _ДанныеЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПродуктыКлиента КАК _ДанныеПродукта
		|		ПО _ДанныеЗаявки.Актив = _ДанныеПродукта.Актив
		|			И _ДанныеЗаявки.Клиент = _ДанныеПродукта.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПродуктыКлиента КАК _ДанныеПродуктаДляОбмена
		|		ПО _ДанныеЗаявки.АктивДляОбмена = _ДанныеПродуктаДляОбмена.Актив
		|			И _ДанныеЗаявки.Клиент = _ДанныеПродуктаДляОбмена.Клиент
		|			И (_ДанныеЗаявки.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявкиКлиента.Клиент КАК Клиент,
		|	_ДанныеЗаявкиКлиента.НомерЗаявки КАК Номер,
		|	_ДанныеЗаявкиКлиента.Тип КАК Тип,
		|	_ДанныеЗаявкиКлиента.ОсновнаяЗаявка КАК Основная,
		|	""Ошибка экспорта заявки клиента [%1], номер [%2], тип заявки [%3]. Не удалось определить завку на приобретение паев со значением реквизита ВыгружатьОперацииВЕСИАФинанс [%4]."" КАК Текст
		|ПОМЕСТИТЬ _ОшибкиЗаявок
		|ИЗ
		|	_ДанныеЗаявкиКлиента КАК _ДанныеЗаявкиКлиента
		|ГДЕ
		|	(_ДанныеЗаявкиКлиента.СсылкаЗаявкиАктива ЕСТЬ NULL
		|			ИЛИ _ДанныеЗаявкиКлиента.Тип = ""Обмен паев""
		|				И _ДанныеЗаявкиКлиента.СсылкаЗаявкиАктиваДляОбмена ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Звездочка КАК Звездочка
		|ИЗ
		|	_ДанныеЗаявкиКлиента КАК _ДанныеЗаявкиКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиЗаявок КАК _ОшибкиЗаявок
		|		ПО _ДанныеЗаявкиКлиента.НомерЗаявки = _ОшибкиЗаявок.Номер
		|			И _ДанныеЗаявкиКлиента.Клиент = _ОшибкиЗаявок.Клиент
		|ГДЕ
		|	_ОшибкиЗаявок.Номер ЕСТЬ NULL
		|	И НЕ _ДанныеЗаявкиКлиента.КодКлиента1Ф ЕСТЬ NULL";
#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Звездочка КАК Звездочка", "*");

	Запрос.УстановитьПараметр("ЗаявкаСсылка", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("Организация", ЗначениеРеквизитовЗаявки.Организация);

	ДанныеЗаявки = Запрос.Выполнить().Выгрузить();
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиЗаявок"].ПолучитьДанные().Выбрать();
	
	Если ВыборкаОшибок.Количество() > 0 Тогда
		
		Если ВыборкаОшибок.Следующий() Тогда 	
			ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, СтрШаблон(ВыборкаОшибок.Текст, ВыборкаОшибок.Клиент, ВыборкаОшибок.Номер, ВыборкаОшибок.Тип, ВыборкаОшибок.Основная), Отказ);
			Возврат;	
		КонецЕсли;
				
	КонецЕсли;
		
	Если ДанныеЗаявки.Количество() > 0 Тогда
		
		ПродуктыКлиента = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПродуктыКлиента"].ПолучитьДанные().Выгрузить();	
		
		ЭкспортироватьПродуктыКлиентов(ПродуктыКлиента, ПараметрыПодключения);	
		ЭкспортироватьОперацииКлиентов(ДанныеЗаявки, ПараметрыПодключения, ПродуктыКлиента);
		
		ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Отказ);
		Возврат;
		
	КонецЕсли;
	
    //Если заявка (на приобретение паев) нового клиента - сначала выгрузим анкетные данные
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаявкиКлиента.КодКлиента1Ф КАК Код1Ф,
		|	РеквизитыФизическихЛицАнкетные.Регистратор КАК Анкета,
		|	РеквизитыФизическихЛицАнкетные.ЮрФизЛицо КАК Ссылка,
		|	РеквизитыФизическихЛицАнкетные.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетные.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетные.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетные.Пол КАК Пол,
		|	РеквизитыФизическихЛицАнкетные.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетные.СерияУдостоверенияЛичности КАК СерияДокумента,
		|	РеквизитыФизическихЛицАнкетные.НомерУдостоверенияЛичности КАК НомерДокумента,
		|	РеквизитыФизическихЛицАнкетные.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиДокумента,
		|	РеквизитыФизическихЛицАнкетные.ДатаОкончанияДействияУдостоверенияЛичности КАК ДатаОкончанияДействияДокумента,
		|	РеквизитыФизическихЛицАнкетные.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийДокумент,
		|	РеквизитыФизическихЛицАнкетные.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодПодразделения,
		|	РеквизитыФизическихЛицАнкетные.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетные.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетные.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетные.Телефоны КАК Телефоны,
		|	НЕ КодыПользователейЕсиаФинанс.Код ЕСТЬ NULL КАК АктивированЛичныйКабинетЕсиа
		|ПОМЕСТИТЬ _АнкетныеДанные
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&ДатаЗаявки,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ДанныеЗаявкиКлиента.Клиент КАК Клиент
		|					ИЗ
		|						_ДанныеЗаявкиКлиента КАК _ДанныеЗаявкиКлиента
		|					ГДЕ
		|						_ДанныеЗаявкиКлиента.Тип = ""Приобретение паев"")) КАК РеквизитыФизическихЛицАнкетные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеЗаявкиКлиента КАК _ДанныеЗаявкиКлиента
		|		ПО РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = _ДанныеЗаявкиКлиента.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ЕсиаФинанс)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)) КАК КодыПользователейЕсиаФинанс
		|		ПО РеквизитыФизическихЛицАнкетные.ЮрФизЛицо = КодыПользователейЕсиаФинанс.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет КАК Ссылка,
		|	_АнкетныеДанные.Ссылка КАК Клиент,
		|	_АнкетныеДанные.Код1Ф КАК КодКлиента1Ф,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.БИК КАК Бик,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк КАК Банк,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСчета КАК НомерСчета,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.КоррСчет КАК КоррСчет,
		|	ЕСТЬNULL(КодыПервойФормы.Код, """") КАК КодБанка1Ф
		|ИЗ
		|	Документ.АнкетаФизическогоЛица.БанковскиеРеквизиты КАК АнкетаФизическогоЛицаБанковскиеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _АнкетныеДанные КАК _АнкетныеДанные
		|		ПО АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка = _АнкетныеДанные.Анкета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Банки)) КАК КодыПервойФормы
		|		ПО АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк = КодыПервойФормы.Объект"; 
#КонецОбласти

	Запрос.УстановитьПараметр("ДатаЗаявки", ЗначениеРеквизитовЗаявки.Дата);
	
	БанковскиеРеквизиты = Запрос.Выполнить().Выгрузить();
			
	НовыеКодыБанков = ?(БанковскиеРеквизиты.Количество() = 0, Неопределено, ПолучитьКодыБанковИзПервойФормы(БанковскиеРеквизиты, ПараметрыПодключения));

	ТаблицаАнкетныхДанных = Запрос.МенеджерВременныхТаблиц.Таблицы["_АнкетныеДанные"].ПолучитьДанные().Выгрузить();
	ТаблицаАнкетныхДанных.Колонки.Добавить("Контакты", Новый ОписаниеТипов("Массив"));
	
	Для Каждого ДанныеКлиента Из ТаблицаАнкетныхДанных Цикл
						
		Если ЗначениеЗаполнено(ДанныеКлиента.EMail) Тогда 	
			ДанныеКлиента.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", "Email", ДанныеКлиента.EMail)); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеКлиента.Телефоны) Тогда
			ДанныеКлиента.Контакты.Добавить(Новый Структура("ТипСвязи, АдресНомер", "Телефон", ДанныеКлиента.Телефоны)); 
		КонецЕсли;
		
		Если Не ЭкспортироватьАнкетныеДанныеКлиента(ДанныеКлиента, ПараметрыПодключения) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеКлиента.Код1Ф) Тогда
			ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Отказ);
			Возврат;	
		КонецЕсли;
		
		БанковскиеРеквизитыКлиента = БанковскиеРеквизиты.Скопировать(Новый Структура("Клиент", ДанныеКлиента.Ссылка));
		
		Если БанковскиеРеквизитыКлиента.Количество() > 0 Тогда
			ЭкспортироватьБанковскиеРеквизитыКлиентов(БанковскиеРеквизитыКлиента, ПараметрыПодключения, НовыеКодыБанков);
		КонецЕсли;

		ЗаявкиКлиента = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеЗаявкиКлиента"].ПолучитьДанные().Выгрузить();
		
		Если ЗаявкиКлиента.Количество() > 0 Тогда 
			
			ПродуктыКлиента = Запрос.МенеджерВременныхТаблиц.Таблицы["_ПродуктыКлиента"].ПолучитьДанные().Выгрузить();
			
			ЗаполнитьКодКлиента(ДанныеКлиента.Код1Ф, ПродуктыКлиента);
			ЭкспортироватьПродуктыКлиентов(ПродуктыКлиента, ПараметрыПодключения);
			
			ЗаполнитьКодКлиента(ДанныеКлиента.Код1Ф, ЗаявкиКлиента);
			ЭкспортироватьОперацииКлиентов(ЗаявкиКлиента, ПараметрыПодключения, ПродуктыКлиента);
			
		КонецЕсли;
			
	КонецЦикла;
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Отказ);
		
КонецПроцедуры

Процедура ЭкспортироватьДвижениеАктивов(Организация, ЗаявкаСсылка, Отказ) Экспорт 
			
	Если Не АктивированМеханизмЭкспортаДанных(Организация) Тогда
		Возврат;	
	КонецЕсли;

	Механизм = Метаданные.Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Имя + ".ЭкспортироватьДвижениеАктивов()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура("Организация, Заявка", Организация, ЗаявкаСсылка));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание); 
			
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаСсылка, "Пайщик, ПаевойИнвестиционныйФонд"); 	
			
	ПараметрыФормирования = Новый Структура();
	ПараметрыФормирования.Вставить("Организация", Организация); 
	ПараметрыФормирования.Вставить("НачалоПериода", Дата(1, 1, 1));
	ПараметрыФормирования.Вставить("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	ПараметрыФормирования.Вставить("Клиенты", РаботаСКоллекциями.ЗначениеВМассив(РеквизитыЗаявки.Пайщик));
	ПараметрыФормирования.Вставить("Пиф", РеквизитыЗаявки.ПаевойИнвестиционныйФонд);

	ДанныеДляЭкспорта = СформироватьДанныеДляЭкспорта(ПараметрыФормирования);
	
	Экспортировать(ДанныеДляЭкспорта);
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Отказ);
		
КонецПроцедуры 

Процедура ЭкспортироватьДанныеКлиентовПослеАктивацииЛКК(Организация, МассивКлиентов) Экспорт 
	
	Если Не АктивированМеханизмЭкспортаДанных(Организация) Тогда
		Возврат;	
	КонецЕсли; 
	
	КлиентыСтр = "";
	Для Каждого ЭтотКлиент Из МассивКлиентов Цикл
		КлиентыСтр = КлиентыСтр + ?(ЗначениеЗаполнено(КлиентыСтр), ", ", "") + Строка(ЭтотКлиент);  	
	КонецЦикла;
	
	Механизм = Метаданные.Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Имя + ".ЭкспортироватьДанныеКлиентовПослеАктивацииЛКК()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура("Организация, НовыеКлиенты", Организация, КлиентыСтр));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание); 	
			
	ПараметрыФормирования = Новый Структура();
	ПараметрыФормирования.Вставить("Организация", Организация); 
	ПараметрыФормирования.Вставить("НачалоПериода", Дата(1, 1, 1));
	ПараметрыФормирования.Вставить("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	ПараметрыФормирования.Вставить("Клиенты", МассивКлиентов);

	ДанныеДляЭкспорта = СформироватьДанныеДляЭкспорта(ПараметрыФормирования);
	
	Экспортировать(ДанныеДляЭкспорта);
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры
	
Процедура ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, ТекстОшибки = Неопределено, Отказ = Неопределено, ДопПараметры = Неопределено);
		
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда	
		ЗарегистрироватьОшибку(ТекстОшибки);	
	КонецЕсли;
	
	ОшибкиСессии = "";
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда 
		
		ОшибкиСессии = РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС);
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		
			Отказ = Истина;	
			
			ПараметрыЗадания = Новый Структура("Механизм, Ошибки", Механизм, ЭтотОбъект.ДополнительныеСвойства.Ошибки);
			РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(Сессия, "РаботаСБизнесПроцессамиИЗадачами.ЗарегистрироватьОшибкуВФоне", ПараметрыЗадания);
			
		Иначе 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиСессии,,,, Отказ);
	
		КонецЕсли;
			
	КонецЕсли;
				
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДопПараметры, ОшибкиСессии);
	
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
					
КонецПроцедуры 

//экспорт всех данных
Процедура СформироватьИЭкспортироватьДанные(ТекПараметры) Экспорт
	
	Механизм = Метаданные.Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Имя + ".СформироватьИЭкспортироватьДанные()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ТекПараметры);
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДанныеДляЭкспорта = СформироватьДанныеДляЭкспорта(ТекПараметры);
	
	Экспортировать(ДанныеДляЭкспорта);
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры 

Процедура ДополнитьДанныеПотока(ДанныеДляЭкспорта, ДанныеПотока, ИмяТаблицы, УидФизЛица);
	
	Если ДанныеПотока.Свойство(ИмяТаблицы) Тогда
				
		ТекПродуктыПользователя = ДанныеДляЭкспорта[ИмяТаблицы].Скопировать(Новый Структура("УидФизЛица", УидФизЛица));
		
		Если ДанныеПотока[ИмяТаблицы] = Неопределено Тогда
			ДанныеПотока[ИмяТаблицы] = ТекПродуктыПользователя;
		Иначе
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТекПродуктыПользователя, ДанныеПотока[ИмяТаблицы]); 	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭкспортироватьВсеПортфели(ТекПараметры) Экспорт 
	
	Механизм = Метаданные.Обработки.ЭкспортДанныхВПервуюФормуКоллЦентра.Имя + ".ЭкспортироватьВсеПортфели()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ТекПараметры);
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание); 	
						
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыОПИФ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыОПИФ.Клиент КАК Опиф
		|ПОМЕСТИТЬ _СчетаДуОпиф
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения > &КонецПериода)
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)) КАК КлиентыОПИФ
		|ГДЕ
		|	ВЫРАЗИТЬ(КлиентыОПИФ.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Открытый)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВнешнихСистем.Объект КАК Объект,
		|	КодыВнешнихСистем.Код КАК Код
		|ПОМЕСТИТЬ _КодыВнешнихСистем
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&КонецПериода,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПерваяФормаКоллЦентра)
		|				И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЗаявкиПайщиков), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыВнешнихСистем
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокЗаявка.Ссылка КАК Ссылка,
		|	ДокЗаявка.Дата КАК ДатаЗаявки,
		|	ДокЗаявка.НомерЗаявки КАК НомерЗаявки,
		|	ДокЗаявка.Пайщик КАК Клиент,
		|	ДокЗаявка.ПаевойИнвестиционныйФонд КАК АктивСсылка,
		|	ДокЗаявка.ПаевойИнвестиционныйФондДляОбменаПаев КАК АктивДляОбмена,
		|	ДокЗаявка.ВидЗаявки КАК ВидЗаявки,
		|	ДокЗаявка.ВыгружатьОперацииВЕСИАФинанс КАК ОсновнаяЗаявка,
		|	_КодыПервойФормыПифов.Код КАК КодАктива,
		|	_КодыПервойФормыПифовДляОбмена.Код КАК КодАктиваДляОбмена,
		|	_КодыКлиентовПервойФормы.Код КАК КодКлиента
		|ПОМЕСТИТЬ _ЗаявкиКлиентов
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ДокЗаявка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДуОпиф КАК _СчетаДуОпиф
		|		ПО ДокЗаявка.ПаевойИнвестиционныйФонд = _СчетаДуОпиф.Опиф
		|			И (ВЫРАЗИТЬ(ДокЗаявка.Пайщик КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
		|			И (ДокЗаявка.Организация = &Организация)
		|			И (НЕОПРЕДЕЛЕНО В (&Клиенты)
		|				ИЛИ ДокЗаявка.Пайщик В (&Клиенты))
		|			И (ДокЗаявка.Дата < &КонецПериода)
		|			И (НЕ ДокЗаявка.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормыПифов
		|		ПО ДокЗаявка.ПаевойИнвестиционныйФонд = _КодыПервойФормыПифов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПервойФормыПифовДляОбмена
		|		ПО ДокЗаявка.ПаевойИнвестиционныйФондДляОбменаПаев = _КодыПервойФормыПифовДляОбмена.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыКлиентовПервойФормы
		|		ПО ДокЗаявка.Пайщик = _КодыКлиентовПервойФормы.Объект
		|ГДЕ
		|	НЕ _КодыКлиентовПервойФормы.Код ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК Клиент,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд КАК АктивСсылка,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Партия.Заявка КАК ЗаявкаСсылка,
		|	СУММА(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ _ОстаткиПаев
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Пайщик В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЗаявкиКлиентов.Клиент
		|					ИЗ
		|						_ЗаявкиКлиентов)) КАК ДолиПайщиковВИнвестиционномФондеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Партия.Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.АктивСсылка КАК АктивСсылка,
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.КодКлиента1Ф КАК КодКлиента1Ф,
		|	ВложенныйЗапрос.ДатаЗаявки КАК ДатаЗаявки,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.Ссылка, _ЗаявкиНаОбмен.Ссылка) КАК ЗаявкаСсылка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.НомерЗаявки, _ЗаявкиНаОбмен.НомерЗаявки) КАК НомерЗаявки,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.ОсновнаяЗаявка, _ЗаявкиНаОбмен.ОсновнаяЗаявка) КАК ОсновнаяЗаявка,
		|	ЕСТЬNULL(_ЗаявкиНаПриобретение.КодАктива, _ЗаявкиНаОбмен.КодАктиваДляОбмена) КАК КодАктива1Ф
		|ПОМЕСТИТЬ _ПродуктыКлиентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА _ЗаявкиКлиентов.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ЗаявкиКлиентов.АктивДляОбмена
		|			ИНАЧЕ _ЗаявкиКлиентов.АктивСсылка
		|		КОНЕЦ КАК АктивСсылка,
		|		_ЗаявкиКлиентов.Клиент КАК Клиент,
		|		_ЗаявкиКлиентов.КодКлиента КАК КодКлиента1Ф,
		|		МИНИМУМ(_ЗаявкиКлиентов.ДатаЗаявки) КАК ДатаЗаявки
		|	ИЗ
		|		_ЗаявкиКлиентов КАК _ЗаявкиКлиентов
		|	ГДЕ
		|		_ЗаявкиКлиентов.ВидЗаявки В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление), ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА _ЗаявкиКлиентов.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
		|				ТОГДА _ЗаявкиКлиентов.АктивДляОбмена
		|			ИНАЧЕ _ЗаявкиКлиентов.АктивСсылка
		|		КОНЕЦ,
		|		_ЗаявкиКлиентов.Клиент,
		|		_ЗаявкиКлиентов.КодКлиента) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаявкиКлиентов КАК _ЗаявкиНаПриобретение
		|		ПО ВложенныйЗапрос.АктивСсылка = _ЗаявкиНаПриобретение.АктивСсылка
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаПриобретение.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаПриобретение.ДатаЗаявки
		|			И (_ЗаявкиНаПриобретение.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Зачисление))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗаявкиКлиентов КАК _ЗаявкиНаОбмен
		|		ПО ВложенныйЗапрос.АктивСсылка = _ЗаявкиНаОбмен.АктивДляОбмена
		|			И ВложенныйЗапрос.Клиент = _ЗаявкиНаОбмен.Клиент
		|			И ВложенныйЗапрос.ДатаЗаявки = _ЗаявкиНаОбмен.ДатаЗаявки
		|			И (_ЗаявкиНаОбмен.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК ПараметрОшибки,
		|	""По заявке %1 обнаружено несколько клиентов/пайщиков"" КАК ТекстОшибки
		|ПОМЕСТИТЬ _Ошибки
		|ИЗ
		|	_ПродуктыКлиентов КАК _ПродуктыКлиентов
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПродуктыКлиентов.ЗаявкаСсылка,
		|	_ПродуктыКлиентов.ЗаявкаСсылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПродуктыКлиентов.Клиент) > 1
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ПродуктыКлиентов.АктивСсылка,
		|	_ПродуктыКлиентов.Клиент,
		|	""Не удалось найти код первой формы колл центра для клиента/пайщика %1. Проверьте наличие данных в первой форме, при необходимоти выгрузите данные клиента/пайщика в 1Ф""
		|ИЗ
		|	_ПродуктыКлиентов КАК _ПродуктыКлиентов
		|ГДЕ
		|	_ПродуктыКлиентов.КодКлиента1Ф ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПродуктыКлиентов.АктивСсылка КАК АктивСсылка,
		|	_ПродуктыКлиентов.Клиент КАК Клиент,
		|	_ПродуктыКлиентов.КодКлиента1Ф КАК КодКлиента1Ф,
		|	_ПродуктыКлиентов.ДатаЗаявки КАК ДатаЗаявки,
		|	_ПродуктыКлиентов.ЗаявкаСсылка КАК ЗаявкаСсылка,
		|	_ПродуктыКлиентов.НомерЗаявки КАК НомерЗаявки,
		|	_ПродуктыКлиентов.ОсновнаяЗаявка КАК ОсновнаяЗаявка,
		|	_ПродуктыКлиентов.КодАктива1Ф КАК КодАктива1Ф,
		|	_КодыПродуктов.Код КАК КодПродукта1Ф,
		|	_ОстаткиПаев.Количество КАК Количество
		|ИЗ
		|	_ПродуктыКлиентов КАК _ПродуктыКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиПаев КАК _ОстаткиПаев
		|		ПО _ПродуктыКлиентов.ЗаявкаСсылка = _ОстаткиПаев.ЗаявкаСсылка
		|			И _ПродуктыКлиентов.Клиент = _ОстаткиПаев.Клиент
		|			И _ПродуктыКлиентов.АктивСсылка = _ОстаткиПаев.АктивСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КодыВнешнихСистем КАК _КодыПродуктов
		|		ПО _ПродуктыКлиентов.ЗаявкаСсылка = _КодыПродуктов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Ошибки КАК _Ошибки
		|		ПО _ПродуктыКлиентов.ЗаявкаСсылка = _Ошибки.ЗаявкаСсылка
		|ГДЕ
		|	_Ошибки.ЗаявкаСсылка ЕСТЬ NULL
		|	И ЕСТЬNULL(_ОстаткиПаев.Количество, 0) > 0";
#КонецОбласти

    Запрос.УстановитьПараметр("Организация", ТекПараметры.Организация);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекПараметры.Дата));
	Запрос.УстановитьПараметр("ДатаФинПоказателя", НачалоДня(ТекПараметры.Дата));
	Запрос.УстановитьПараметр("Клиенты", ?(ТекПараметры.Свойство("Клиенты"), ТекПараметры.Клиенты, Неопределено));
	
	ПортфелиКлиентов = Запрос.Выполнить().Выгрузить(); 
	
	Если ПортфелиКлиентов.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПодключения = РаботаСВнешнимиСистемами.ПерваяФорма_ПолучитьПараметрыПодключения("uk1f");
	
	Если ПараметрыПодключения = Неопределено Тогда
		ЗарегистрироватьОшибку("Ошибка подключения к первой форме колл центра.");
		Возврат;
	КонецЕсли;

	ЭкспортироватьПортфелиКлиентов(ПортфелиКлиентов, ПараметрыПодключения);
	
	ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

ЭтотОбъект.ДополнительныеСвойства = Новый Структура();
   
