
&НаСервере
Процедура СконвертироватьНаСервере(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").СконвертироватьФайлы(ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.КонвертироватьTXT, ЭтаФорма.КонвертироватьXLSX, ПараметрыСессии);
КонецПроцедуры

&НаКлиенте
Процедура Сконвертировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Сконвертировать",
		Новый Структура("Дата, Организация, КонвертироватьTXT, КонвертироватьXLSX", 
			ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.КонвертироватьTXT, ЭтаФорма.КонвертироватьXLSX));
	Попытка
		СконвертироватьНаСервере(ПараметрыСессии);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закончено");
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЭтаФорма.Дата = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата() - 24*60*60));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
		
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьTXTПриИзменении(Элемент)
    Если КонвертироватьTXT Тогда
        КонвертироватьXLSX = Ложь; // Включен TXT, выключаем XLSX
    Иначе
        КонвертироватьXLSX = Истина; // Выключен TXT, включаем XLSX
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьXLSXПриИзменении(Элемент)
    Если КонвертироватьXLSX Тогда
        КонвертироватьTXT = Ложь; // Включен XLSX, выключаем TXT
    Иначе
        КонвертироватьTXT = Истина; // Выключен XLSX, включаем TXT
    КонецЕсли;
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)
	РеквизитФормыВЗначение("Объект").ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды, ПараметрыВыполнения)
	Возврат РеквизитФормыВЗначение("Объект").ЗарегистрироватьНовуюСессию(ИмяКоманды, ПараметрыВыполнения);
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	РеквизитФормыВЗначение("Объект").ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
КонецПроцедуры

#КонецОбласти
