
&НаСервере
Процедура РасчетНаСервере(Отчет)
	
	РасшифровкаРасчета = Новый Структура();
	РасшифровкаРасчета.Вставить("КБД", "КБД");
	РасшифровкаРасчета.Вставить("Операции",	Новый Массив);
	
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ДанныеРасчета", Новый Структура("Дата,Дней", Дата, Дней), "Данные расчета", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыКривойБескупоннойДоходности.beta0 КАК beta0,
		|	ПараметрыКривойБескупоннойДоходности.beta1 КАК beta1,
		|	ПараметрыКривойБескупоннойДоходности.beta2 КАК beta2,
		|	ПараметрыКривойБескупоннойДоходности.tau КАК tau,
		|	ПараметрыКривойБескупоннойДоходности.g1 КАК g1,
		|	ПараметрыКривойБескупоннойДоходности.g2 КАК g2,
		|	ПараметрыКривойБескупоннойДоходности.g3 КАК g3,
		|	ПараметрыКривойБескупоннойДоходности.g4 КАК g4,
		|	ПараметрыКривойБескупоннойДоходности.g5 КАК g5,
		|	ПараметрыКривойБескупоннойДоходности.g6 КАК g6,
		|	ПараметрыКривойБескупоннойДоходности.g7 КАК g7,
		|	ПараметрыКривойБескупоннойДоходности.g8 КАК g8,
		|	ПараметрыКривойБескупоннойДоходности.g9 КАК g9,
		|	ПараметрыКривойБескупоннойДоходности.ВидПараметра КАК ВидПараметра
		|ИЗ
		|	РегистрСведений.ПараметрыКривойБескупоннойДоходности КАК ПараметрыКривойБескупоннойДоходности
		|ГДЕ
		|	ПараметрыКривойБескупоннойДоходности.Период = &Период
		|	И ПараметрыКривойБескупоннойДоходности.ВидПараметра = &ВидКривой";
	
	Запрос.УстановитьПараметр("ВидКривой", Перечисления.ВидыКривойБескупоннойДоходности.Текущее2017);
	Запрос.УстановитьПараметр("Период", Дата);
	
	СрокДоПогашения = Дней / 365;
	Если ТочностьСрокаДоПогашения <> 0 Тогда
		СрокДоПогашения = Окр(СрокДоПогашения, ТочностьСрокаДоПогашения);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		beta0 	= ВыборкаДетальныеЗаписи.beta0;
		beta1 	= ВыборкаДетальныеЗаписи.beta1;
		beta2 	= ВыборкаДетальныеЗаписи.beta2;
		tau 	= ВыборкаДетальныеЗаписи.tau;
		
		g		= Новый Массив(10);
		g[1]	= ВыборкаДетальныеЗаписи.g1;
		g[2]	= ВыборкаДетальныеЗаписи.g2;
		g[3]	= ВыборкаДетальныеЗаписи.g3;
		g[4]	= ВыборкаДетальныеЗаписи.g4;
		g[5]	= ВыборкаДетальныеЗаписи.g5;
		g[6]	= ВыборкаДетальныеЗаписи.g6;
		g[7]	= ВыборкаДетальныеЗаписи.g7;
		g[8]	= ВыборкаДетальныеЗаписи.g8;
		g[9]	= ВыборкаДетальныеЗаписи.g9;
		
		ПараметрыКБД = Новый Структура("beta0,beta1,beta2,tau,g1,g2,g3,g4,g5,g6,g7,g8,g9");
		ЗаполнитьЗначенияСвойств(ПараметрыКБД, ВыборкаДетальныеЗаписи);
		
		
		РасчетКБД = Новый Структура("ПервыеСлагаемые,ИтогСуммы,КБД,КБДПроценты");
		РасчетСуммы = Новый Структура("С1,С2,С3,С4,С5,С6,С7,С8,С9");
		
		ЗначениеКривой = beta0 + (beta1 + beta2) * tau / СрокДоПогашения * (1 - Exp( - СрокДоПогашения / tau)) - beta2 * Exp( - СрокДоПогашения / tau);
		
		РасчетКБД.ПервыеСлагаемые = ЗначениеКривой;
		РасчетКБД.ИтогСуммы = 0;
		
		к = 1.6;
		а2 = 0.6;
		
		Для сц = 1 по 9 Цикл
			
			а = ?(сц = 1, 0, ?(сц = 2, а2, а + а2 * Pow(к,сц-2)));
			б = ?(сц = 1, а2, б * к);
			
			ЗначениеКривой = ЗначениеКривой + g[сц] * Exp( - Pow(СрокДоПогашения - а, 2) / Pow(б, 2));
			
			РасчетСуммы["С" + СокрЛП(сц)] = g[сц] * Exp( - Pow(СрокДоПогашения - а, 2) / Pow(б, 2));
			РасчетКБД.ИтогСуммы = РасчетКБД.ИтогСуммы + РасчетСуммы["С" + СокрЛП(сц)];
			
		КонецЦикла;	
		
		ЗначениеКривойВПроцентах = 100 * (Exp(ЗначениеКривой / 10000) - 1);

		РасчетКБД.КБД = ЗначениеКривой;
		РасчетКБД.КБДПроценты = ЗначениеКривойВПроцентах;
		
	КонецЦикла;
	
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "ПараметрыКБД", ПараметрыКБД, "Параметры КБД", Истина);
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РасчетСуммы", РасчетСуммы, "Расчет суммы", Истина);
	РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(РасшифровкаРасчета, "РасчетКБД", РасчетКБД, "Расчет КБД", Истина);

	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(СтрШаблон("Расшифровка расчета КБД на дату: %1 и срок: %2 дней", Дата, Дней),,, Отчет);
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
	
КонецПроцедуры

&НаКлиенте
Процедура Расчет(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Расчет");
	Попытка
		ВыполнитьРасчет();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчет()
	
	Отчет = Неопределено;
	РасчетНаСервере(Отчет);
	Если Отчет <> Неопределено Тогда
		Отчет.Показать(СтрШаблон("Расшифровка расчета КБД на дату: %1 и срок: %2 дней", Дата, Дней));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);	

КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",      Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
