Функция ПолучитьПлатежныеДокументы(СчетФактураСсылка) Экспорт
	
	Результат = "";
	
	РезультатЗапроса = ВыбратьПлатежныеДокументы(СчетФактураСсылка);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Результат <> "" Тогда
			Результат = Результат + ", ";
		КонецЕсли;
		Результат = Результат + ВыборкаДетальныеЗаписи.НомерПлатежногоДокумента + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВыбратьПлатежныеДокументы(СчетФактураСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оплата.СтрокаБанковскойВыписки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|	Оплата.СтрокаБанковскойВыписки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|		ПО СчетФактураОснования.Основание = Оплата.Ссылка
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СчетФактураСсылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

