Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Основание КАК Основание,
		|	СУММА(СчетФактураОснования.СуммаНДС) КАК СуммаНДС,
		|	СчетФактураОснования.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураОснования.Ссылка.Контрагент,
		|	СчетФактураОснования.Основание";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЭтотОбъект.ТипСчетаФактуры = Перечисления.ТипыСчетовФактур.Выданный Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС, "НДС по авансу");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДСПоАвансамПолученным;
			
			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
			Проводка.СубконтоДт.СчетаФактуры = ЭтотОбъект.Ссылка;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
		Иначе
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС, "НДС по авансу");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.НДСПоАвансамВыданным;
			
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ЭтотОбъект.Ссылка;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	//проверим наличие аванса на момент документа
	//Для сделки с недвижимостью авансом будет оплата по сделке без признака аванса.
	//При проверке суммы аванса по недвижимости в секции "ГДЕ" проверяется не равенство, а превышение, т.к. авансов м.б. несколько
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Основание КАК Основание,
		|	ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) КАК СуммаСНДССчетаФактуры,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0) КАК СуммаОстатокПоДС,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) КАК СуммаОстатокПоставкиНеджвижимости,
		|	ВЫБОР
		|		КОГДА ОплатаОснования.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) - ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|	КОНЕЦ КАК СуммаОстаток,
		|	СчетФактураОснования.Ссылка.Представление КАК Представление
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Основание,
		|				СУММА(УсловияСделокСНедвижимостьюСрезПоследних.Сумма) КАК Сумма
		|			ИЗ
		|				РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|						&ДоДокумента,
		|						Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|			ГДЕ
		|				НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|				И УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияСделокСНедвижимостьюСрезПоследних.Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|			ПО ОплатаОснования.Основание = УсловияСделокСНедвижимостьюСрезПоследних.Основание
		|		ПО СчетФактураОснования.Основание = ОплатаОснования.Ссылка
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)))
		|			И (НЕ УсловияСделокСНедвижимостьюСрезПоследних.Основание ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДоДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И (Аванс
		|							И Основание В
		|								(ВЫБРАТЬ
		|									СчетФактураОснования.Основание КАК Основание
		|								ИЗ
		|									Документ.СчетФактура.Основания КАК СчетФактураОснования
		|								ГДЕ
		|									СчетФактураОснования.Ссылка = &Ссылка)
		|						ИЛИ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|							И Основание В
		|								(ВЫБРАТЬ
		|									ОплатаОснования.Основание КАК Основание
		|								ИЗ
		|									Документ.СчетФактура.Основания КАК СчетФактураОснования
		|										ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|										ПО
		|											СчетФактураОснования.Основание = ОплатаОснования.Ссылка
		|												И ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|												И СчетФактураОснования.Ссылка = &Ссылка))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО (СчетФактураОснования.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание
		|				ИЛИ ОплатаОснования.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОплатаОснования.Ссылка ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) <> ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|			ИНАЧЕ ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) > ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) - ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|		КОНЕЦ
		|	И СчетФактураОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Остаток суммы аванса " + Формат(ВыборкаДетальныеЗаписи.СуммаОстаток, "ЧДЦ=2; ЧН=0")
			+ " по основанию " + ВыборкаДетальныеЗаписи.Представление
			+ " на момент оформления счета-фактуры не соответствует документу", ЭтотОбъект.Ссылка,,, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	СчетФактураОснования.Ссылка КАК Основание,
		|	СчетФактураОснования.Ссылка.Организация КАК Организация,
		|	СчетФактураОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СчетФактураОснования.Ссылка.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам) КАК ВидЗадолженности,
		|	СчетФактураОснования.СуммаНДС КАК Сумма,
		|	&ИФНС КАК Контрагент,
		|	&ВалютаРубли КАК Валюта
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураОснования.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СчетФактураОснования.Ссылка,
		|	СчетФактураОснования.Ссылка.Организация,
		|	СчетФактураОснования.Ссылка.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СчетФактураОснования.Ссылка.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода),
		|	СчетФактураОснования.СуммаНДС,
		|	&ИФНС,
		|	&ВалютаРубли
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("ИФНС", РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
	
	Движения.ЗадолженностиПоДенежнымСредствам.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Оплата") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОплатаОснования.Ссылка КАК Ссылка,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОплатаОснования.Ссылка.ВидДвижения КАК ВидДвижения,
			|	ВЫБОР
			|		КОГДА ОплатаОснования.Ссылка.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Полученный)
			|	КОНЕЦ КАК ТипСчетаФактуры,
			|	ОплатаОснования.Ссылка.Аванс КАК Аванс,
			|	ОплатаОснования.Основание КАК Основание,
			|	ОплатаОснования.Ссылка.Контрагент КАК Контрагент,
			|	ОплатаОснования.Ссылка.Договор КАК Договор,
			|	ОплатаОснования.Сумма КАК Сумма,
			|	ОплатаОснования.Валюта КАК Валюта,
			|	ОплатаОснования.СтавкаНДС КАК СтавкаНДС,
			|	ОплатаОснования.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.Оплата.Основания КАК ОплатаОснования
			|ГДЕ
			|	ОплатаОснования.Ссылка = &Ссылка
			|	И (ОплатаОснования.Ссылка.Аванс
			|			ИЛИ ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)))";

		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда 
				//первая строка
				ЭтотОбъект.СчетДоверительногоУправления = ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
				ЭтотОбъект.ТипСчетаФактуры = ВыборкаДетальныеЗаписи.ТипСчетаФактуры;
				ЭтотОбъект.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				ЭтотОбъект.Договор = ВыборкаДетальныеЗаписи.Договор;
			КонецЕсли;
			
			СтрокаОснования = ЭтотОбъект.Основания.Добавить();
			СтрокаОснования.Основание = ДанныеЗаполнения;
			СтрокаОснования.СуммаСНДС = ВыборкаДетальныеЗаписи.Сумма;
			СтрокаОснования.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			СтрокаОснования.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС;
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект,
		"НомерСчетаФактуры, ДатаСчетаФактурыПолученного");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.Основания.Итог("СуммаНДС") = 0 Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма НДС документа = 0!", ЭтотОбъект.Ссылка, ,, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.НомерСчетаФактуры) Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен номера счета-фактуры!", ЭтотОбъект.Ссылка, "НомерСчетаФактуры",, Отказ);
		ИначеЕсли ЭтотОбъект.ТипСчетаФактуры = Перечисления.ТипыСчетовФактур.Выданный 
			И Не РаботаСНДС.НомерСчетаФактурыУникален(ЭтотОбъект.Ссылка, ЭтотОбъект.НомерСчетаФактуры, ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Организация) Тогда
		    Отказ = Истина;
		КонецЕсли;
		
		//проверим основание и сумму (не более, чем в оплате)
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетФактураОснования.Основание КАК Основание,
			|	СчетФактураОснования.СуммаСНДС КАК СуммаСНДС,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.Аванс КАК Аванс,
			|	ВложенныйЗапрос.ВидЗадолженности КАК ВидЗадолженности,
			|	СчетФактураОснования.НомерСтроки КАК НомерСтроки,
			|	СчетФактураОснования.Основание.Представление КАК ОснованиеПредставление,
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.СчетФактура.Основания КАК СчетФактураОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|			ОплатаОснования.Ссылка.Аванс КАК Аванс,
			|			СУММА(ОплатаОснования.Сумма) КАК Сумма,
			|			ОплатаОснования.Ссылка КАК Ссылка,
			|			СУММА(ОплатаОснования.СуммаНДС) КАК СуммаНДС
			|		ИЗ
			|			Документ.СчетФактура.Основания КАК СчетФактураОснования
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
			|				ПО СчетФактураОснования.Основание = ОплатаОснования.Ссылка
			|		ГДЕ
			|			СчетФактураОснования.Ссылка = &Ссылка
			|			И НЕ(ОплатаОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью)
			|						ИЛИ ОплатаОснования.Ссылка.Аванс)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОплатаОснования.Ссылка.ВидЗадолженности,
			|			ОплатаОснования.Ссылка.Аванс,
			|			ОплатаОснования.Ссылка) КАК ВложенныйЗапрос
			|		ПО СчетФактураОснования.Основание = ВложенныйЗапрос.Ссылка
			|			И (СчетФактураОснования.Ссылка = &Ссылка)
			|			И (ВложенныйЗапрос.Сумма < СчетФактураОснования.СуммаСНДС
			|				ИЛИ ВложенныйЗапрос.СуммаНДС = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Не (ВыборкаДетальныеЗаписи.Аванс 
				ИЛИ ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделкеСНедвижимостью
				ИЛИ ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоИнвестконтракту) Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В основании можно указывать только авансы!", ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				КонецЕсли;
				Если (ВыборкаДетальныеЗаписи.СуммаНДС = 0) Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки 
						+ " сумма НДС в документе-основании " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + " нулевая!", 
						ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				ИначеЕсли (ВыборкаДетальныеЗаписи.Сумма < ВыборкаДетальныеЗаписи.СуммаСНДС)Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки 
						+ " сумма основания " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + " меньше суммы счета-фактуры!", 
						ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
