
Функция СформироватьНаименование(РеквизитыСчета, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "НомерСчета, Валюта, Банк, БанкДляРасчетов";
	
	Если РеквизитыСчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(РеквизитыСчета.НомерСчета) И ЗначениеЗаполнено(РеквизитыСчета.Валюта) И ЗначениеЗаполнено(РеквизитыСчета.Банк) Тогда
		Наименование = СокрЛП(РеквизитыСчета.НомерСчета) + " (" + РеквизитыСчета.Валюта + ") в " + РеквизитыСчета.Банк;
	
		Если ЗначениеЗаполнено(РеквизитыСчета.БанкДляРасчетов) Тогда
			Наименование = Наименование +  " / " + Строка(РеквизитыСчета.БанкДляРасчетов);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименование

// Функция получает валюту, соответствующую номеру банковского счета.
// 6-8 разряды номера банковского счета соответствуют коду валюты.
// Для рублей используется код 810.
//
// Параметры:
//	НомерСчета - Число - Номер банковского счета
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты - Валюта банковского счета
//
Функция ПолучитьВалютуПоНомеруСчета(НомерСчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодВалюты = Сред(НомерСчета, 6, 3);
	
	Если КодВалюты = "810" Тогда // это "старые" рубли, которые тем не менее, всё еще активно используются
		КодВалюты = "643";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код = &КодВалюты";
	
	Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Валюта;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции // ПолучитьВалютуПоНомеруСчета()

// Функция возвращает закрыт на нужную дату счет или нет .
//
// Параметры:
//	СчетСсылка - Справочники.БанковскиеСчета.Ссылка - счет
//	НаДату - Дата - нужная дата
//
// Возвращаемое значение:
//	Булево - закрыт или нет
//
Функция СчетЗакрыт(СчетСсылка, НаДату = Неопределено) Экспорт
	
	ДатаПроверки = ?(НаДату = Неопределено, ТекущаяДата(), НаДату);
	
	Если (СчетСсылка.ДатаЗакрытия <> '00010101')И(СчетСсылка.ДатаЗакрытия <= ДатаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // СчетЗакрыт()

// Процедрура проверяет свопадает ли владаелец р/счета с юр.лицом (или банком, если есть лицевой счёт). Если счёт не наёден по номеру, то он создаётся
Процедура СоздатьПолучитьРасчетныйСчет(РасчетныйСчет, Организация, БИК, НомерСчета, ЮрФизЛицо, ВедетсяПоЛицевымСчетам, КонтролироватьСоответствиеВладельцаСчета = Истина, Отказ = Ложь) Экспорт
	
	Банк = Справочники.Банки.НайтиПоКоду(БИК);
	Если Не ЗначениеЗаполнено(Банк) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден банк по БИК: " + БИК,,,, Отказ);	
		Возврат;
	КонецЕсли;
	
	Если ВедетсяПоЛицевымСчетам Тогда
		ОжидаемыйВладелецСчета  = Банк.ЮрФизЛицо;
		Если Не ЗначениеЗаполнено(Банк.ЮрФизЛицо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано юр. лицо банка: " + БИК + " (" + Банк + ")",,,, Отказ);	
			Возврат;
		КонецЕсли;
	Иначе
		ОжидаемыйВладелецСчета = ЮрФизЛицо;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.Банк КАК Банк,
		|	БанковскиеСчета.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &РасчетныйСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.)
		|				ТОГДА БанковскиеСчета.Организация = &Организация
		|						И БанковскиеСчета.НомерСчета = &НомерСчета
		|						И БанковскиеСчета.Банк = &Банк
		|			ИНАЧЕ БанковскиеСчета.Ссылка = &РасчетныйСчет
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("НомерСчета"		, НомерСчета);
	Запрос.УстановитьПараметр("Банк"			, Банк);
	Запрос.УстановитьПараметр("РасчетныйСчет"	, РасчетныйСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если КонтролироватьСоответствиеВладельцаСчета И Выборка.ЮрФизЛицо <> ОжидаемыйВладелецСчета Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("""" + Выборка.Ссылка + """ Владелец счета """ + Выборка.ЮрФизЛицо + """ не совпадает с ожидаемым """ + ОжидаемыйВладелецСчета + """",,,, Отказ);
		Иначе
			РасчетныйСчет = Выборка.Ссылка;
		КонецЕсли;
	Иначе
		
		БанковскийСчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
		БанковскийСчетОбъект.Организация = Организация;
		БанковскийСчетОбъект.УстановитьНовыйКод();
			
		БанковскийСчетОбъект.ЮрФизЛицо   = ОжидаемыйВладелецСчета;
		БанковскийСчетОбъект.Банк        = Банк;
		БанковскийСчетОбъект.НомерСчета  = НомерСчета;
		БанковскийСчетОбъект.Валюта      = ПолучитьВалютуПоНомеруСчета(НомерСчета);
		
		Если Не ЗначениеЗаполнено(БанковскийСчетОбъект.Валюта) Тогда // такое бывает, когда клиент ошибается в номере счета
			БанковскийСчетОбъект.Валюта = Организация.ВалютаУчета;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить валюту из № счета '" + НомерСчета + "'. Использована валюта '" + БанковскийСчетОбъект.Валюта + "'", БанковскийСчетОбъект);
		КонецЕсли;
		
		БанковскийСчетОбъект.Наименование = СформироватьНаименование(БанковскийСчетОбъект);
		
		БанковскийСчетОбъект.Записать();
		
		РасчетныйСчет     = БанковскийСчетОбъект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает последние реквизиты платежа
Функция ПолучитьРеквизитыПлатежа(Организация, ЮрФизЛицо, РасчетныйСчет = Неопределено, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаявкаПайщика.МоментВремени КАК МоментВремени,
		|	NULL КАК НомерСтроки,
		|	ЗаявкаПайщика.РасчетныйСчет КАК РасчетныйСчет,
		|	ЗаявкаПайщика.РасчетныйСчет.Банк.Код КАК БИК,
		|	ЗаявкаПайщика.РасчетныйСчет.Банк.Наименование КАК НаименованиеБанка,
		|	ЗаявкаПайщика.РасчетныйСчет.Банк.КоррСчет КАК КоррСчет,
		|	ЗаявкаПайщика.НомерСчета КАК НомерСчета,
		|	ЗаявкаПайщика.ЛицевойСчет КАК ЛицевойСчет,
		|	ЗаявкаПайщика.ПолучательПлатежа КАК ПолучательПлатежа,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННПолучателя,
		|	ЗаявкаПайщика.НазначениеПлатежа КАК НазначениеПлатежа
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Дата,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЗаявкаПайщика.РасчетныйСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	НЕ ЗаявкаПайщика.ПометкаУдаления
		|	И ЗаявкаПайщика.Организация = &Организация
		|	И ЗаявкаПайщика.Владелец = &ЮрФизЛицо
		|	И ЗаявкаПайщика.Дата < &Дата
		|	И ЗаявкаПайщика.РасчетныйСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	И &РасчетныйСчет В (ЗаявкаПайщика.РасчетныйСчет, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка.МоментВремени,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСтроки,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.Код,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.Наименование,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.КоррСчет,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСчета,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.ЛицевойСчет,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.ПолучательПлатежа,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.ИННПолучателя,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НазначениеПлатежа
		|ИЗ
		|	Документ.АнкетаФизическогоЛица.БанковскиеРеквизиты КАК АнкетаФизическогоЛицаБанковскиеРеквизиты
		|ГДЕ
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка.Проведен
		|	И АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка.Организация = &Организация
		|	И АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|	И АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка.Дата <= &Дата
		|	И &РасчетныйСчет В (АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.Ссылка.МоментВремени,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.НомерСтроки,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.РасчетныйСчет,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.Код,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.Наименование,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Банк.КоррСчет,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.НомерСчета,
		|	NULL,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.ПолучательПлатежа,
		|	NULL,
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.НазначениеПлатежа
		|ИЗ
		|	Документ.АнкетаЮридическогоЛица.БанковскиеРеквизиты КАК АнкетаЮридическогоЛицаБанковскиеРеквизиты
		|ГДЕ
		|	АнкетаЮридическогоЛицаБанковскиеРеквизиты.Ссылка.Проведен
		|	И АнкетаЮридическогоЛицаБанковскиеРеквизиты.Ссылка.Организация = &Организация
		|	И АнкетаЮридическогоЛицаБанковскиеРеквизиты.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|	И АнкетаЮридическогоЛицаБанковскиеРеквизиты.Ссылка.Дата <= &Дата
		|	И &РасчетныйСчет В (АнкетаЮридическогоЛицаБанковскиеРеквизиты.РасчетныйСчет, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	NULL,
		|	1,
		|	БанковскиеСчета.Ссылка,
		|	БанковскиеСчета.Банк.Код,
		|	БанковскиеСчета.Банк.Наименование,
		|	БанковскиеСчета.Банк.КоррСчет,
		|	БанковскиеСчета.НомерСчета,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Ссылка = &РасчетныйСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	МоментВремени УБЫВ,
		|	НомерСтроки");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",   ЮрФизЛицо);
	Запрос.УстановитьПараметр("Дата",        ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	Запрос.УстановитьПараметр("РасчетныйСчет", ?(РасчетныйСчет = Неопределено, ПустаяСсылка(), РасчетныйСчет));
	
	Результат = Новый Структура("РасчетныйСчет, БИК, НаименованиеБанка, КоррСчет, НомерСчета, ПолучательПлатежа, ИННПолучателя, ЛицевойСчет, НазначениеПлатежа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


#Область ИдентификацияСчетовПоНомеру

Функция БанковскийСчетДепозитногоВклада(БанковскийСчет) Экспорт
	
	НомерБалансовогоСчетаПервогоПорядка = Лев(БанковскийСчет.НомерСчета, 3);
	
	//с 411 по 419 — вклады, открытые государственными структурами;
	//с 420 по 422 — хранение средств юридических лиц;
	//423 — вклад открыт физическим лицом-резидентом;
	//424 — средства иностранных компаний;
	//425 — средства на вкладе принадлежат физическому лицу-нерезиденту;
	
	Если НомерБалансовогоСчетаПервогоПорядка >= "411" И НомерБалансовогоСчетаПервогоПорядка <= "425" Тогда
		Возврат Истина;
	КонецЕсли;
	
	//Исключения
	//47426 "Обязательства по уплате процентов", учет процентов, начисленных по привлеченным средствам (кроме средств, привлеченных от физических лиц) и подлежащих уплате.
	Если Лев(БанковскийСчет.НомерСчета, 5) = "47426" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

#КонецОбласти