
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не (РольДоступна("ПолныеПрава") Или РольДоступна("КонтрольУправляющихКомпаний")) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	
КонецПроцедуры

&НаКлиенте
Процедура Импортировать(Команда)
	ИмпортироватьНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере(ИмпортироватьТолькоРасторгнутые)
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	
	ДатаСведений = ЭтаФорма.Период.ДатаНачала;
	Пока ДатаСведений <= ЭтаФорма.Период.ДатаОкончания Цикл
	
		ОбработкаНаСервере.ИмпортироватьОбязательстваМаркетМейкеров(ДатаСведений, ИмпортироватьТолькоРасторгнутые, ЭтаФорма.МаркетМейкер, ЭтаФорма.ЦеннаяБумага);
		ДатаСведений = ДатаСведений + 3600 * 24;
		
		Если ИмпортироватьТолькоРасторгнутые Тогда
			Прервать;
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьТолькоРасторгнутыеДоговоры(Команда)
	
	ТекстВопроса = "Используется при импорте самого первого файла." + Символы.ПС + "Данные будут загружены только за " 
		+ Формат(ЭтаФорма.Период.ДатаНачала, "ДФ=dd.MM.yyyy")  + Символы.ПС + "Продолжить?";
	
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
	
		ИмпортироватьНаСервере(Истина);
	
	КонецЕсли; 
	
КонецПроцедуры
