
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не (РольДоступна("ПолныеПрава") Или РольДоступна("КонтрольУправляющихКомпаний")) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	
КонецПроцедуры

&НаКлиенте
Процедура Импортировать(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("Импортировать");
	Попытка
		ИмпортироватьНаСервере(Ложь);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНаСервере(ИмпортироватьТолькоРасторгнутые)
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	
	ДатаСведений = ЭтаФорма.Период.ДатаНачала;
	Пока ДатаСведений <= ЭтаФорма.Период.ДатаОкончания Цикл
	
		ОбработкаНаСервере.ИмпортироватьОбязательстваМаркетМейкеров(ДатаСведений, ИмпортироватьТолькоРасторгнутые, ЭтаФорма.МаркетМейкер, ЭтаФорма.ЦеннаяБумага);
		ДатаСведений = ДатаСведений + 3600 * 24;
		
		Если ИмпортироватьТолькоРасторгнутые Тогда
			Прервать;
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьТолькоРасторгнутыеДоговоры(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ИмпортироватьТолькоРасторгнутыеДоговоры");
	Попытка
		ВыполнитьИмпортТолькоРасторгнутыхДоговоров(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИмпортТолькоРасторгнутыхДоговоров(ПараметрыСессии)
	
	ТекстВопроса = "Используется при импорте самого первого файла." + Символы.ПС + "Данные будут загружены только за " 
		+ Формат(ЭтаФорма.Период.ДатаНачала, "ДФ=dd.MM.yyyy")  + Символы.ПС + "Продолжить?";
	
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
	
		ИмпортироватьНаСервере(Истина);
	
	КонецЕсли; 
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
