#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПереоценкаЦенныхБумаг") Тогда
		
		Основание = Параметры.Основание;
		ЗаполнитьЗначенияСвойств(Объект, Основание, "Организация, СчетДоверительногоУправления, ВидУчета");
		Объект.Дата = Основание.Дата;
	
	КонецЕсли; 
	
	ПриЧтенииСозданииНаСервере();
	
	Если Параметры.Свойство("ЦеннаяБумага") И ЗначениеЗаполнено(Параметры.ЦеннаяБумага) Тогда 	
		НайденныеСтроки = Объект.СтоимостиПереоценки.НайтиСтроки(Новый Структура("ЦеннаяБумага", Параметры.ЦеннаяБумага)); 
		Если НайденныеСтроки.Количество() > 0 Тогда 
			Элементы.СтоимостиПереоценки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПереоценки");
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПрочихЦенныхБумаг");
	
	Если Объект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении Тогда
		
		Элементы.СтоимостиПереоценкиРучнойВвод.Видимость = Ложь;
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		ЭлементСостояниеДокумента = Элементы.Найти("СостояниеДокумента");
		Если ЭлементСостояниеДокумента = Неопределено Тогда
			ЭлементСостояниеДокумента = Элементы.Вставить("СостояниеДокумента", Тип("ДекорацияФормы"), , ЭтаФорма.ПодчиненныеЭлементы[0]);
			ЭлементСостояниеДокумента.Шрифт						= ШрифтыСтиля.ВажнаяИнформацияНаФормеШрифт;
			ЭлементСостояниеДокумента.АвтоМаксимальнаяШирина	= Ложь;
			ЭлементСостояниеДокумента.Видимость					= Истина;
		КонецЕсли;
		ЭлементСостояниеДокумента.Заголовок	= Новый ФорматированнаяСтрока("Интерактивное изменение документа разрешено только из формы документа 'Регистрация стоимости активов'");
		
	Иначе
		
		Элементы.СтраницаПрочиеЦенныеБумаги.Видимость = Ложь;
		
	КонецЕсли; 

КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Основание.Пустая() Тогда
	
		Заполнить();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// после записи теряются значения реквизитов, добавленных к т.ч. объекта
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПереоценки");
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПрочихЦенныхБумаг");
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Вопрос("Перезаполнить документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.ВидУчета = ПолучитьВидУчета(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчета, Объект.Дата);
		Заполнить();		
	КонецЕсли;
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтоимостиПереоценки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.РучнойВвод = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦельРасчетаПриИзменении(Элемент)
	Объект.ВидУчета = ПолучитьВидУчета(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчета, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦеннаяБумагаПриИзменении(Элемент)
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПереоценки", Элементы.СтоимостиПереоценки.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПрочихЦенныхБумагЦеннаяБумагаПриИзменении(Элемент)
	ЗаполнитьВалютыЦенныхБумаг("СтоимостиПрочихЦенныхБумаг", Элементы.СтоимостиПрочихЦенныхБумаг.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиКоличествоПриИзменении(Элемент)
	ПересчетТабличнойЧасти("Количество");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСтоимостьПриИзменении(Элемент)
	ПересчетТабличнойЧасти("Цена");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиЦенаКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти("ЦенаКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаПриИзменении(Элемент)
	ПересчетТабличнойЧасти("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиСуммаКупонаПриИзменении(Элемент)
	ПересчетТабличнойЧасти("СуммаКупона");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиКурсВалютыНоминалаПриИзменении(Элемент)
	ПересчетТабличнойЧасти("КурсВалютыНоминала");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПереоценкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборСтрокиТаблицы("СтоимостиПереоценки");
		
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПрочихЦенныхБумагВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборСтрокиТаблицы("СтоимостиПрочихЦенныхБумаг");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиПрочихЦенныхБумагРынокПриИзменении(Элемент)
	ТекСтрока = Элементы.СтоимостиПрочихЦенныхБумаг.ТекущиеДанные;
	Элементы.СтоимостиПрочихЦенныхБумагЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекСтрока.Рынок);
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗагрузитьИзФайлаExcel(Команда)
	
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Если Объект.СтоимостиПереоценки.Количество() > 0 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииОтветаНаВопросОбОчисткеТЧПриЗагрузке", ЭтотОбъект);
		 	ПоказатьВопрос(ОписаниеОповещения, "При загрузке из файла табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПриПолученииОтветаНаВопросОбОчисткеТЧПриЗагрузке(КодВозвратаДиалога.Да, Неопределено);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед загрузкой из файла необходимо указать счет доверительного управления!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьРасчет(Команда)
	
	ТекущиеДанные = Элементы.СтоимостиПереоценки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , , "Объект.СтоимостиПереоценки");
		Возврат;
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	Отказ						= Ложь;
 	ДанныеЕПС					= (Объект.ЦельРасчета = ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов"));	
	НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчета, Истина);
	ВыполнятьРасчетПоУказаниюЦБ	= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
	АдресТаблицыСтоимостей		= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + Объект.ЦельРасчета + "'", , , , Отказ);
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ПоместитьФайлОценочнойСтоимостиПредоставленнойКлиентомВоВременноеХранилище(
			Объект.СчетДоверительногоУправления, Объект.Дата, ДанныеЕПС, ЭтаФорма.УникальныйИдентификатор, Отказ);
		Отказ = Отказ И Не ВыполнятьРасчетПоУказаниюЦБ; // Если оценка "заморожена", то актуальные цены от клиента не нужны
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	Ошибки				= Неопределено;
	РасшифровкаРасчета	= Неопределено;
	
	ПараметрыПереоценки	= Новый Структура("Организация, СчетДоверительногоУправления, ЦельРасчета, ВидУчета, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыПереоценки, Объект);
	
	Если РаботаСДокументами.СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(РасшифровкаРасчета, ПараметрыПереоценки, ТекущиеДанные.ЦеннаяБумага, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, АдресТаблицыСтоимостей, Ошибки) Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(ТекущиеДанные.ЦеннаяБумага) + "'");		
	ИначеЕсли Ошибки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + НастройкиОценки.ВариантРасчетаОценочнойСтоимости + "' не реализована");	
	Иначе
		ТекстОшибки = "Ошибка получения расшифровки расчета:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)

	Заполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКонтроль(Команда)

	// Проверка модифицированности
	
	Если ЭтаФорма.Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		Если Вопрос("Перед выполнением контроля расхождений необходимо сохранить внесенные изменения. Сохранить?", РежимДиалогаВопрос.ОКОтмена) <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСФормамиКлиентСервер.ЗаписатьФорму(ЭтаФорма) Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	// Контроль расхождений

	Заполнить(Истина);

КонецПроцедуры

#КонецОбласти

#Область Служебные_функции

&НаКлиенте
Процедура Заполнить(ТолькоПроверитьРасхождения = Ложь)

	Если Не ЗначениеЗаполнено(Объект.ЦельРасчета) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВидУчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана цель расчета", , , "Объект.ЦельРасчета");
			Возврат;
		КонецЕсли;
		
		Объект.ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(Объект.ВидУчета);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ВидУчета) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид учета для цели расчета '" + Объект.ЦельРасчета + "' для клиента " + Объект.СчетДоверительногоУправления);
		Возврат;
		
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	Отказ			= Ложь;
	ДанныеЕПС		= (Объект.ЦельРасчета = ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов"));
	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчета, Истина);
	АдресФайлаXML	= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + Объект.ЦельРасчета + "'", , , , Отказ);
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		
		АдресФайлаXML = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлОценочнойСтоимостиПредоставленнойКлиентом(
			Объект.СчетДоверительногоУправления, Объект.Дата, ДанныеЕПС, ЭтаФорма.УникальныйИдентификатор);

		Если Не ЭтоАдресВременногоХранилища(АдресФайлаXML) Тогда

			ТекстВопроса = СтрШаблон(
				"Файл с оценочной стоимостью не выбран.
				|Продолжить %1?", ?(ТолькоПроверитьРасхождения, "проверку", "заполнение"));
			
			РезультатВопроса = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			
			Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск расхождений и заполнение 	
	
	ТабличныйДокументОтличий = Новый ТабличныйДокумент;
		
	ЗаполнилиБезПерезатирания = ЗаполнитьСтоимостьПереоценки(ТолькоПроверитьРасхождения, ТабличныйДокументОтличий, Ложь, Отказ);
	
	Если Отказ Тогда
		Предупреждение("Не удалось заполнить документ");
		Возврат;
	КонецЕсли;	
	
	Если ЗаполнилиБезПерезатирания Тогда
		
		Если ТолькоПроверитьРасхождения	Тогда
			Предупреждение("Расхождений не обнаружено", , "Контроль");
		КонецЕсли;
	
	Иначе
		
		ОтобразитьРазличия = Истина;
		
		Если Не ТолькоПроверитьРасхождения Тогда
			Если Вопрос("Изменилась стоимость переоценки некоторых ЦБ. Обновить данные?",РежимДиалогаВопрос.ДаНет,,,"Расчет стоимостей переоценки") = КодВозвратаДиалога.Да Тогда
				ЗаполнитьСтоимостьПереоценки(Ложь, , Истина);
				ОтобразитьРазличия = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ОтобразитьРазличия Тогда
			ТабличныйДокументОтличий.Показать("Отличия стоимостей переоценки");
		КонецЕсли;
		
	КонецЕсли;
	
	// Таблица стоимости в хранилище уже не нужна
	
	Если ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
		УдалитьИзВременногоХранилища(АдресТаблицыСтоимостей);
		АдресТаблицыСтоимостей = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтоимостьПереоценки(ТолькоПроверитьРасхождения, ТабличныйДокументОтчета = Неопределено, ПолучитьТаблицуСтоимостейИзДопСвойства = Ложь, Отказ = Ложь)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ПолучитьТаблицуСтоимостейИзДопСвойства Тогда
		
		ТаблицаСтоимостиПереоценки = ПолучитьИзВременногоХранилища(АдресТаблицыСтоимостей);
		ТекущийОбъект.СтоимостиПереоценки.Загрузить(ТаблицаСтоимостиПереоценки);
				
	Иначе
			
		ТекущийОбъект.ЗаполнитьСтоимостьПереоценки(Истина, Истина, Отказ, Строка(АдресФайлаXML));
		
		Если Отказ Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТаблицаСтоимостиПереоценки = Неопределено;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ТаблицаСтоимостиПереоценки", ТаблицаСтоимостиПереоценки) Тогда
			АдресТаблицыСтоимостей = ПоместитьВоВременноеХранилище(ТаблицаСтоимостиПереоценки, ЭтаФорма.УникальныйИдентификатор);			
		КонецЕсли; 
		
		// Если есть отличия, выведем отчет и выйдем
		
		ЕстьОтличияСтоимостиПереоценки = Ложь;
		
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЕстьОтличияСтоимостиПереоценки", ЕстьОтличияСтоимостиПереоценки) Тогда
			
			Если ЕстьОтличияСтоимостиПереоценки И ТабличныйДокументОтчета <> Неопределено Тогда
				ТаблицаРазличийСтоимостиПереоценки = Неопределено;
				Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ТаблицаРазличийСтоимостиПереоценки", ТаблицаРазличийСтоимостиПереоценки) Тогда
					РегистрыСведений.СтоимостьПереоценки.ПечатьРазличияСтоимостиПереоценки(ТаблицаРазличийСтоимостиПереоценки, ТабличныйДокументОтчета);
				КонецЕсли;
			КонецЕсли;
				
			Возврат Не ЕстьОтличияСтоимостиПереоценки;
			
		КонецЕсли;
	
	КонецЕсли; 

	Если Не ТолькоПроверитьРасхождения Тогда
		
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
		ЗаполнитьВалютыЦенныхБумаг("СтоимостиПереоценки");
		
		ЭтаФорма.Модифицированность = Истина;	
		
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидУчета(Организация, СчетДоверительногоУправления, ЦельРасчета, НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦелейРасчетаСрезПоследних.ВидУчетаДляОстатковПартий КАК ВидУчетаДляОстатковПартий
		|ИЗ
		|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|			&НаДату,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЦельРасчета = &ЦельРасчета) КАК НастройкиЦелейРасчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦельРасчета", ЦельРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВидУчетаДляОстатковПартий;
	КонецЦикла;
	
	Возврат Перечисления.ВидыУчета.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ПересчетТабличнойЧасти(ИзмененныйРеквизит)
	СуммыВВалютеУчета = Новый Структура;	
	
	СтрокаТабличнойЧасти = Элементы.СтоимостиПереоценки.ТекущиеДанные;
	
	Если ИзмененныйРеквизит = "Количество" Тогда
		СтрокаТабличнойЧасти.Сумма			= СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
		СтрокаТабличнойЧасти.СуммаКупона	= СтрокаТабличнойЧасти.ЦенаКупона * СтрокаТабличнойЧасти.Количество;
		
		СуммыВВалютеУчета.Вставить("СуммаВВалютеУчета", СтрокаТабличнойЧасти.Сумма);
		СуммыВВалютеУчета.Вставить("СуммаКупонаВВалютеУчета", СтрокаТабличнойЧасти.СуммаКупона);
		
	ИначеЕсли ИзмененныйРеквизит = "Цена" Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
		СуммыВВалютеУчета.Вставить("СуммаВВалютеУчета", СтрокаТабличнойЧасти.Сумма);
		
	ИначеЕсли ИзмененныйРеквизит = "ЦенаКупона" Тогда
		СтрокаТабличнойЧасти.СуммаКупона = СтрокаТабличнойЧасти.ЦенаКупона * СтрокаТабличнойЧасти.Количество;
		СуммыВВалютеУчета.Вставить("СуммаКупонаВВалютеУчета", СтрокаТабличнойЧасти.СуммаКупона);
		
	ИначеЕсли ИзмененныйРеквизит = "Сумма" Тогда
		СуммыВВалютеУчета.Вставить("СуммаВВалютеУчета", СтрокаТабличнойЧасти.Сумма);
		
	ИначеЕсли ИзмененныйРеквизит = "СуммаКупона" Тогда
		СуммыВВалютеУчета.Вставить("СуммаКупонаВВалютеУчета", СтрокаТабличнойЧасти.СуммаКупона);		
		
	ИначеЕсли ИзмененныйРеквизит = "КурсВалютыНоминала" Тогда
		СуммыВВалютеУчета.Вставить("СуммаВВалютеУчета", СтрокаТабличнойЧасти.Сумма);
		СуммыВВалютеУчета.Вставить("СуммаКупонаВВалютеУчета", СтрокаТабличнойЧасти.СуммаКупона);
		
	КонецЕсли;
	
	// Пересчет сумм в валюте учета при необходимости
	Если ЗначениеЗаполнено(СуммыВВалютеУчета) Тогда
		Если СтрокаТабличнойЧасти.ВалютаНоминала <> СтрокаТабличнойЧасти.ВалютаУчета Тогда 
			Отказ = Ложь;
			
			СуммыВВалютеУчета = РаботаСВалютами.ПолучитьСуммыВВалютеУчета(
				СуммыВВалютеУчета,
				СтрокаТабличнойЧасти.ВалютаНоминала,
				Объект.Организация,
				Объект.Дата,
				?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.КурсВалютыНоминала), СтрокаТабличнойЧасти.КурсВалютыНоминала, Неопределено),
				Отказ			
			);
			
			Если Отказ Тогда 
				Возврат; 
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СуммыВВалютеУчета); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютыЦенныхБумаг(ИмяТаблицы, ТекущаяСтрока = Неопределено)
	Строки = Неопределено;
	Если ТекущаяСтрока <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(Объект[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока));
	КонецЕсли;
	
	ИсходнаяТаблица		= Объект[ИмяТаблицы].Выгрузить(Строки);
	ВыгружаемыеКолонки	= РаботаСКоллекциями.ПолучитьПоляТаблицыДляЗапроса(ИсходнаяТаблица, "_ИсходнаяТаблица", "ВалютаНоминала, ВалютаУчета"); 	
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ
		|	_ИсходнаяТаблица
		|ИЗ
		|	&ИсходнаяТаблица КАК _ИсходнаяТаблица
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИсходнаяТаблица.*,
		|	ЕСТЬNULL(Акции.ВалютаНоминала,
		|		ЕСТЬNULL(Облигации.ВалютаНоминала,
		|			ЕСТЬNULL(Паи.ВалютаНоминала,
		|				ЕСТЬNULL(Векселя.ВалютаНоминала,
		|					ЕСТЬNULL(ПроизводныеФинансовыеИнструменты.Валюта,
		|						ЕСТЬNULL(ДепозитарныеРасписки.ВалютаНоминала,
		|							ЕСТЬNULL(ИпотечныеСертификатыУчастия.ВалютаНоминала,
		|								ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))))))) КАК ВалютаНоминала,
		|	&ВалютаУчета КАК ВалютаУчета		
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|			ПО Акции.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|			ПО Облигации.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|			ПО Паи.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|			ПО Векселя.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизводныеФинансовыеИнструменты КАК ПроизводныеФинансовыеИнструменты
		|			ПО ПроизводныеФинансовыеИнструменты.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага			
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|			ПО ДепозитарныеРасписки.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|			ПО ИпотечныеСертификатыУчастия.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага		
		|УПОРЯДОЧИТЬ ПО
		|	_ИсходнаяТаблица.НомерСтроки
		|;
		|");
	Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблица);
	Запрос.УстановитьПараметр("ВалютаУчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета"));	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИсходнаяТаблица.*", ВыгружаемыеКолонки);	
	
	ДополненнаяТаблица = Запрос.Выполнить().Выгрузить();		
	Если Строки = Неопределено Тогда
		Объект[ИмяТаблицы].Загрузить(ДополненнаяТаблица);
	ИначеЕсли Строки.Количество() = ДополненнаяТаблица.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Строки[0], ДополненнаяТаблица[0]);   
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьВалютыЦенныхБумаг

&НаКлиенте
Процедура ВыборСтрокиТаблицы(ИмяТаблицы)

	Если Не ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элементы[ИмяТаблицы].ТекущийЭлемент; 
	ИмяКолонки = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТаблицы, "");
	
	// Требуются значения только отдельных колонок
	Если Не (ИмяКолонки = "Партия" Или ИмяКолонки = "ЦеннаяБумага") Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекущиеДанные[ИмяКолонки]);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеФайлаExcel(ДанныеФайла)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Код",				Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("ISIN",				Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Количество",		Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("КатегорияЦены",	Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Уровень",			Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Цена",				Новый ОписаниеТипов("Число"));
	
	КодДДУ = Объект.СчетДоверительногоУправления.НомерДоговора;
	ДатаЦены = ДанныеФайла.Дата;
	
	Для Каждого ТекСтрока Из ДанныеФайла.Строки Цикл
		Если ТекСтрока.НомерДДУ = КодДДУ Тогда
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В файле обнаружен номер ДДУ, несоответствующий СДУ, указанному в шапке документа ('"
				+ ТекСтрока.НомерДДУ + "'). Строка пропущена.");
		КонецЕсли;
	КонецЦикла;
	
	Если ТЗ.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		#Область ТекстЗапроса
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(ТЗ.Код КАК СТРОКА(100)) КАК Код,
			|	ВЫРАЗИТЬ(ТЗ.ISIN КАК СТРОКА(100)) КАК ISIN,
			|	ТЗ.Количество КАК Количество,
			|	ВЫРАЗИТЬ(ТЗ.КатегорияЦены КАК СТРОКА(100)) КАК КатегорияЦены,
			|	ТЗ.Уровень КАК Уровень,
			|	ТЗ.Цена КАК Цена,
			|	&ДатаЦены КАК ДатаЦены
			|ПОМЕСТИТЬ _ДанныеФайла
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыВТорговыхСистемахСрезПоследних.Объект КАК Объект,
			|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код
			|ПОМЕСТИТЬ _ЦБ
			|ИЗ
			|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаЦены, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
			|ГДЕ
			|	КодыВТорговыхСистемахСрезПоследних.Код В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				_ДанныеФайла.ISIN КАК ISIN
			|			ИЗ
			|				_ДанныеФайла КАК _ДанныеФайла)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦБ.Объект КАК ЦеннаяБумага,
			|	КотировкиТорговыхПлощадок.Период КАК Период,
			|	КотировкиТорговыхПлощадок.Рынок КАК Рынок,
			|	КотировкиТорговыхПлощадок.РежимТоргов КАК РежимТоргов,
			|	КотировкиТорговыхПлощадок.Валюта КАК Валюта,
			|	ВЫБОР
			|		КОГДА КотировкиТорговыхПлощадок.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
			|			ТОГДА КотировкиТорговыхПлощадок.ЦеннаяБумага.Валюта
			|		КОГДА КотировкиТорговыхПлощадок.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
			|			ТОГДА КотировкиТорговыхПлощадок.ЦеннаяБумага.ВалютаНоминала
			|		КОГДА КотировкиТорговыхПлощадок.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
			|			ТОГДА КотировкиТорговыхПлощадок.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
			|	КОНЕЦ КАК ВалютаНоминала,
			|	КотировкиТорговыхПлощадок.ACCINT КАК ACCINT
			|ПОМЕСТИТЬ _ПоследниеКотировки
			|ИЗ
			|	_ЦБ КАК _ЦБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
			|		ПО (КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим)
			|			И (КотировкиТорговыхПлощадок.Период = &ДатаЦены)
			|			И (КотировкиТорговыхПлощадок.ЦеннаяБумага = _ЦБ.Объект)
			|			И (КотировкиТорговыхПлощадок.Биржа = &БиржаММВБ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	_ЦБ.Объект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПоследниеКотировки.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА МАКСИМУМ(_ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала)
			|			ТОГДА МАКСИМУМ(ВЫБОР
			|						КОГДА _ПоследниеКотировки.Валюта = _ПоследниеКотировки.ВалютаНоминала
			|							ТОГДА _ПоследниеКотировки.РежимТоргов
			|					КОНЕЦ)
			|		ИНАЧЕ МАКСИМУМ(_ПоследниеКотировки.РежимТоргов)
			|	КОНЕЦ КАК РежимТорговДляACCINT
			|ПОМЕСТИТЬ _РежимыТорговПоследнихКотировок
			|ИЗ
			|	_ПоследниеКотировки КАК _ПоследниеКотировки
			|
			|СГРУППИРОВАТЬ ПО
			|	_ПоследниеКотировки.ЦеннаяБумага
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	_ПоследниеКотировки.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦБ.Объект КАК ЦеннаяБумага,
			|	ЕСТЬNULL(ПоследниеКотировкиДляACCINT.ВалютаНоминала, КупоныВыходногоДня.Облигация.ВалютаНоминала) КАК Валюта,
			|	ВЫБОР
			|		КОГДА НЕ КупоныВыходногоДня.Период ЕСТЬ NULL
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ПоследниеКотировкиДляACCINT.РежимТоргов
			|	КОНЕЦ КАК РежимТорговДляACCINT,
			|	ЕСТЬNULL(КупоныВыходногоДня.ACCINT, ПоследниеКотировкиДляACCINT.ACCINT) КАК ACCINT
			|ПОМЕСТИТЬ _КотировкиКупонов
			|ИЗ
			|	_ЦБ КАК _ЦБ
			|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоследнихКотировок КАК _РежимыТорговПоследнихКотировок
			|		ПО _ЦБ.Объект = _РежимыТорговПоследнихКотировок.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеКотировки КАК ПоследниеКотировкиДляACCINT
			|		ПО (_РежимыТорговПоследнихКотировок.ЦеннаяБумага = ПоследниеКотировкиДляACCINT.ЦеннаяБумага)
			|			И (_РежимыТорговПоследнихКотировок.РежимТорговДляACCINT = ПоследниеКотировкиДляACCINT.РежимТоргов)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупоныВыходногоДня КАК КупоныВыходногоДня
			|		ПО (КупоныВыходногоДня.Период = &ДатаЦены)
			|			И (_ЦБ.Объект ССЫЛКА Справочник.Облигации)
			|			И _ЦБ.Объект = КупоныВыходногоДня.Облигация
			|			И (КупоныВыходногоДня.Биржа = &БиржаММВБ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	_ЦБ.Объект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦБ.Объект КАК ЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.Акции
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.ВалютныеПары
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.Облигации
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.Паи
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(_ЦБ.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
			|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы)
			|					КОГДА ВЫРАЗИТЬ(_ЦБ.Объект КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
			|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы)
			|				КОНЕЦ
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Рынок,
			|	_ДанныеФайла.Цена КАК ЦенаКотировки,
			|	_ДанныеФайла.Цена КАК Цена,
			|	&ВалютаУчета КАК ВалютаКотировки,
			|	ВЫБОР
			|		КОГДА _ДанныеФайла.КатегорияЦены = ""Оценка по модели""
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.РасчетнаяЦена)
			|		КОГДА _ДанныеФайла.КатегорияЦены = ""Bid""
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиЦеныДляПереоценки.ЦенаСпроса)
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК ВидЦены,
			|	_ДанныеФайла.Уровень КАК УровеньОценки,
			|	_ДанныеФайла.ДатаЦены КАК ДатаЦены,
			|	ИСТИНА КАК РучнойВвод,
			|	_ДанныеФайла.Количество КАК Количество,
			|	_ДанныеФайла.Количество * _ДанныеФайла.Цена КАК Сумма,
			|	_КотировкиКупонов.ACCINT КАК ЦенаКотировкиКупона,
			|	_КотировкиКупонов.ACCINT КАК ЦенаКупона,
			|	_КотировкиКупонов.ACCINT * _ДанныеФайла.Количество КАК СуммаКупона,
			|	_КотировкиКупонов.Валюта КАК ВалютаКотировкиКупона,
			|	_ДанныеФайла.Количество * _ДанныеФайла.Цена КАК СуммаВВалютеУчета,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(КурсыВалют.Кратность, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ _КотировкиКупонов.ACCINT * _ДанныеФайла.Количество * ЕСТЬNULL(КурсыВалют.Курс, 0) / КурсыВалют.Кратность
			|	КОНЕЦ КАК СуммаКупонаВВалютеУчета,
			|	&ВалютаУчета КАК ВалютаУчета,
			|	ВЫБОР
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.Акции
			|				ИЛИ _ЦБ.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
			|				ИЛИ _ЦБ.Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
			|				ИЛИ _ЦБ.Объект ССЫЛКА Справочник.Облигации
			|				ИЛИ _ЦБ.Объект ССЫЛКА Справочник.Паи
			|			ТОГДА _ЦБ.Объект.ВалютаНоминала
			|		КОГДА _ЦБ.Объект ССЫЛКА Справочник.ВалютныеПары
			|			ТОГДА _ЦБ.Объект.БазоваяВалюта
			|		ИНАЧЕ _ЦБ.Объект.Валюта
			|	КОНЕЦ КАК ВалютаНоминала,
			|	_ДанныеФайла.ISIN КАК ISIN,
			|	_ДанныеФайла.КатегорияЦены КАК КатегорияЦены
			|ИЗ
			|	_ДанныеФайла КАК _ДанныеФайла
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦБ КАК _ЦБ
			|		ПО _ДанныеФайла.ISIN = _ЦБ.Код
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиКупонов КАК _КотировкиКупонов
			|		ПО (_ЦБ.Объект = _КотировкиКупонов.ЦеннаяБумага)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			|		ПО (КурсыВалют.Период = &ДатаЦены)
			|			И (КурсыВалют.Валюта = _КотировкиКупонов.Валюта)";
		#КонецОбласти
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("ВалютаУчета", Объект.Организация.ВалютаУчета);
		Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
		Запрос.УстановитьПараметр("БиржаММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из Выгрузка Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ЦеннаяБумага) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить ценную бумагу по ISIN '" + СокрЛП(ТекСтрока.ISIN) + "'.");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ВидЦены) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить вид цены для категории цены '"
					+ СокрЛП(ТекСтрока.КатегорияЦены) + "'." + Символы.ПС + "Вид цены необходимо указать вручную.");
			КонецЕсли;
		КонецЦикла;
		
		Объект.СтоимостиПереоценки.Загрузить(Выгрузка);
		
		Если Не ЗначениеЗаполнено(Объект.ЦельРасчета) Тогда
			Объект.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ВидУчета) Тогда
			Объект.ВидУчета = ПолучитьВидУчета(Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ЦельРасчета, Объект.Дата);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для загрузки.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВыбораФайлаExcel(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
		
		Попытка
			Excel = Новый COMОбъект("Excel.Application");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось запустить MS Excel:" + Символы.ПС + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Попытка
			Excel.Workbooks.Open(Результат[0]);
		Исключение
			Excel.Quit();
			Excel = 0;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть файл:" + Символы.ПС + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Для Каждого Лист Из Excel.WorkSheets Цикл
			
			ДанныеЛиста = Новый Структура;
			
			ДанныеЛиста.Вставить("Дата", Лист.Cells(1, 2).Value);
			ДанныеЛиста.Вставить("Строки", Новый Массив);
			
			ТекущаяСтрока = 4;
			КоличествоПустыхСтрок = 0;
			
			Пока КоличествоПустыхСтрок < 50 Цикл
				
				ДанныеСтроки = Новый Структура;
				
				Если НЕ ЗначениеЗаполнено(Лист.Cells(ТекущаяСтрока, 1).Value) Тогда
					КоличествоПустыхСтрок = КоличествоПустыхСтрок + 1;
					ТекущаяСтрока = ТекущаяСтрока + 1;
					Продолжить;
				Иначе
					КоличествоПустыхСтрок = 0;
				КонецЕсли;
				
				ПортфельСтрока = Лист.Cells(ТекущаяСтрока, 1).Value;
				
				Если СтрНайти(ПортфельСтрока, "№") <> 0 Тогда
					ДанныеСтроки.Вставить("НомерДДУ", Сред(ПортфельСтрока, СтрНайти(ПортфельСтрока, "№") + 1));
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить код СДУ из строки '" + ПортфельСтрока + "'." + Символы.ПС + "Строка пропущена.");
					Продолжить;
				КонецЕсли;
				
				ДанныеСтроки.Вставить("Наименование",	СокрЛП(Лист.Cells(ТекущаяСтрока, 2).Value));
				ДанныеСтроки.Вставить("Код",			СокрЛП(Лист.Cells(ТекущаяСтрока, 3).Value));
				ДанныеСтроки.Вставить("ISIN",			СокрЛП(Лист.Cells(ТекущаяСтрока, 4).Value));
				ДанныеСтроки.Вставить("Количество",		Лист.Cells(ТекущаяСтрока, 5).Value);
				ДанныеСтроки.Вставить("Номинал",		Лист.Cells(ТекущаяСтрока, 6).Value);
				ДанныеСтроки.Вставить("КатегорияЦены",	СокрЛП(Лист.Cells(ТекущаяСтрока, 7).Value));
				ДанныеСтроки.Вставить("Коэффициент",	Лист.Cells(ТекущаяСтрока, 8).Value);
				ДанныеСтроки.Вставить("Уровень",		Число(СокрЛП(СтрЗаменить(Лист.Cells(ТекущаяСтрока, 9).Value, "уровень", ""))));
				ДанныеСтроки.Вставить("Цена",			Лист.Cells(ТекущаяСтрока, 10).Value);
				
				ДанныеЛиста.Строки.Добавить(ДанныеСтроки);
				
				ТекущаяСтрока = ТекущаяСтрока + 1;
				
			КонецЦикла;
			
			Если ДанныеЛиста.Строки.Количество() > 0 Тогда
				ЗагрузитьДанныеФайлаExcel(ДанныеЛиста);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для загрузки.");
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
		Excel.DisplayAlerts = 0;
		Excel.ActiveWorkbook.Close(-1,);
		Excel.Quit();
		Excel = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииОтветаНаВопросОбОчисткеТЧПриЗагрузке(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриОкончанииВыбораФайлаExcel", ЭтотОбъект);
		
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбора.МножественныйВыбор = Ложь;
		ДиалогВыбора.Фильтр = "Файлы excel (*.xlsx)|*.xlsx|Файлы excel (*.xls)|*.xls";
		
		ДиалогВыбора.Показать(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти