&НаСервере
Процедура ЗаполнитьНаименование()
	
	Объект.Наименование = "Корзина ОФЗ-ПК на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " для " + СокрЛП(Объект.Клиент);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.Дата = '00010101' Тогда
			Объект.Дата = ТекущаяДата();
		КонецЕсли;
		
		Если Объект.Организация = Справочники.Организации.ПустаяСсылка() Тогда
			Объект.Организация = ПараметрыСеанса.ТекущаяОрганизация;	
		КонецЕсли;
		
		Если Объект.Наименование = "" Тогда
			ЗаполнитьНаименование();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорзину()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Облигации.Ссылка КАК ОФЗПК
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|ГДЕ
		|	Облигации.Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОФЗ)
		|	И Облигации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОблигаций.КупоннаяПК)
		|	И Облигации.ДатаРегистрации <= &Период
		|	И Облигации.ДатаПогашения > &Период
		|	И НЕ Облигации.Амортизационная
		|
		|УПОРЯДОЧИТЬ ПО
		|	Облигации.Наименование");
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	Объект.Корзина.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	ЗаполнитьКорзину();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры

