Перем URIПространстваИменСервиса;

////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка", 
		"Экспорт данных в CRM", 
		"1.12", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ПередачаДанныхПоОрганизацииЗаВчера",  "Передача данных по организации за вчера",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции // СведенияОВнешнейОбработке

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	Перем ПриИмпортеВозниклиОшибки;
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКоманды, "Организация, МестоположениеWSDL");
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
	// проверим корректность полноту и корректность заполнения полей
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ЗарегистрироватьОшибку("Не заполнено поле 'Организация'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.МестоположениеWSDL) Тогда
		ЗарегистрироватьОшибку("Не заполнено поле 'МестоположениеWSDL'");
	КонецЕсли;
	
	ОповеститьОбОшибках(ПриИмпортеВозниклиОшибки);
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
	
	Если ПриИмпортеВозниклиОшибки Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ПолучитьТекстОшибок());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецЕсли;
	
	// основной функционал
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	Если ИдентификаторКоманды = "ПередачаДанныхПоОрганизацииЗаВчера" Тогда
		ЭтотОбъект.Период = НачалоДня(НачалоДня(ТекущаяДата() - 1));
		ПередатьДанныхВCRM();
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ПолучитьТекстОшибок());
	КонецЕсли;
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры // ВыполнитьКоманду

////////////////////////////////////////////////////////////////////////////////

Функция ПередатьДанныхВCRM(ПакетДанных1С = Неопределено) Экспорт
	Перем ПриИмпортеВозниклиОшибки;
	
	Определение = Новый WSОпределения(ЭтотОбъект.МестоположениеWSDL, "AdminChange", "");
	
	СервисCRM = Новый WSПрокси(Определение, URIПространстваИменСервиса, "rk_ExchangeDU", "rk_ExchangeDUSoap"); 
	СервисCRM.Пользователь = "AdminChange";
	СервисCRM.Пароль       = "";
	
	Если ПакетДанных1С = Неопределено Тогда
		ПакетДанных1С = ПолучитьПакетДанных1С();
	КонецЕсли;
	
	ТипКлиенты = СервисCRM.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "Клиенты");
	Клиенты = СервисCRM.ФабрикаXDTO.Создать(ТипКлиенты);
	
	ПодготовитьДанныеДляСервисаCRM(ПакетДанных1С, СервисCRM, Клиенты);
	
	ОтветСервиса = СервисCRM.GetData(Клиенты);
	Если ОтветСервиса = "0" Тогда
		ЗарегистрироватьОшибку("Ошибка вызова функции GetData() web-сервиса '" + ЭтотОбъект.МестоположениеWSDL + "'; организация: " + ЭтотОбъект.Организация + ", период: " + ЭтотОбъект.Период);
	КонецЕсли;
	
	ОповеститьОбОшибках(ПриИмпортеВозниклиОшибки);
	
	Возврат ОтветСервиса;
	
КонецФункции // ПередатьДанныхВCRM_Тест

Функция ПолучитьПакетДанных1С() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ КлиентыИСчета
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыИСчета.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	КлиентыИСчета.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия.Наименование КАК Стратегия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя КАК Имя,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидДокумента,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаОкончанияДействияУдостоверенияЛичности КАК ДатаОкончанияДействияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.РезидентРФ КАК РезидентРФ,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СНИЛС КАК СНИЛС,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресМестаЖительства КАК АдресМестаЖительства,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК EMail,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны,
		|	КлиентыИСчета.Клиент КАК Клиент
		|ИЗ
		|	КлиентыИСчета КАК КлиентыИСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО (СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления = КлиентыИСчета.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ЮрФизЛицо.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыИСчета.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фамилия,
		|	Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыИСчета.Клиент КАК Клиент1,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот КАК Сумма,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот КАК РыночнаяСтоимость,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК ДатаПлатежа,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			,
		|			&Период,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						КлиентыИСчета.СчетДоверительногоУправления
		|					ИЗ
		|						КлиентыИСчета)
		|				И ВидОперацииВводаВыводаДС = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлиентыИСчета КАК КлиентыИСчета
		|		ПО ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = КлиентыИСчета.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК Клиент2,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НомерСчета КАК НомерСчета,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.БИК КАК БИК,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.НаименованиеБанка КАК Банк,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.КоррСчет КАК КоррСчет,
		|	АнкетаФизическогоЛицаБанковскиеРеквизиты.РасчетныйСчет.Валюта.Код КАК ВалютаКод
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо В
		|					(ВЫБРАТЬ
		|						КлиентыИСчета.Клиент
		|					ИЗ
		|						КлиентыИСчета)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.БанковскиеРеквизиты КАК АнкетаФизическогоЛицаБанковскиеРеквизиты
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаБанковскиеРеквизиты.Ссылка";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат МассивРезультатовЗапроса;	
	
КонецФункции	

Процедура ПодготовитьДанныеДляСервисаCRM(ПакетДанных1С, Сервис, Клиенты)
	
	ДанныеПоФЗ               = ПакетДанных1С[1].Выгрузить();
	ДанныеПоРеестрамПлатежей = ПакетДанных1С[2].Выгрузить();
	ДанныеПоБС               = ПакетДанных1С[3].Выгрузить();
	
	СтранаРОССИЯ = Справочники.СтраныМира.Россия;	
	
	ТипДанныеКлиента       = Сервис.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "ДанныеКлиента");
	ТипФИО                 = Сервис.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "ФИО");
	ТипПаспорт             = Сервис.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "Паспорт");
	ТипБанковскиеРеквизиты = Сервис.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "БанковскиеРеквизиты");
	ТипОплата              = Сервис.ФабрикаXDTO.Тип(URIПространстваИменСервиса, "Оплата");
	
	Для каждого СтрокаФЗ Из ДанныеПоФЗ Цикл
		
		ДанныеКлиента       = Сервис.ФабрикаXDTO.Создать(ТипДанныеКлиента);
		ФИО                 = Сервис.ФабрикаXDTO.Создать(ТипФИО);
		Паспорт             = Сервис.ФабрикаXDTO.Создать(ТипПаспорт);
		
		СтрокиРеестровПлатежей = ДанныеПоРеестрамПлатежей.НайтиСтроки(Новый Структура("Клиент1", СтрокаФЗ.Клиент));
		СтрокиБС               = ДанныеПоБС.НайтиСтроки(Новый Структура("Клиент2", СтрокаФЗ.Клиент));
		
		Телефон = "";
		ЭлПочта = "";
		АдресПроживания = "";
		МестоЖительства = "";
		ПочтовыйАдрес   = "";		
		
		// контактная информация
		ДанныеКлиента.Телефон         = СтрокаФЗ.Телефоны;
		ДанныеКлиента.ЭлПочта         = СтрокаФЗ.EMail;
		ДанныеКлиента.АдресПроживания = СтрокаФЗ.АдресРегистрации;
		ДанныеКлиента.МестоЖительства = СтрокаФЗ.АдресМестаЖительства;
		ДанныеКлиента.ПочтовыйАдрес   = СтрокаФЗ.ПочтовыйАдрес;
		
		// ФИО
		ФИО.Фамилия       = СтрокаФЗ.Фамилия;
		ФИО.Имя           = СтрокаФЗ.Имя;
		ФИО.Отчество      = СтрокаФЗ.Отчество;
		ДанныеКлиента.ФИО = ФИО;
		
		ДанныеКлиента.ДатаРождения  = СтрокаФЗ.ДатаРождения;
		ДанныеКлиента.МестоРождения = СтрокаФЗ.МестоРождения;
		
		// Паспорт
		Паспорт.ВидДокумента     = Справочники.ВидыДокументовФизическихЛиц.ПолучитьИмяПредопределенного(СтрокаФЗ.ВидДокумента);
		Паспорт.Серия            = СтрокаФЗ.СерияУдостоверенияЛичности;
		Паспорт.Номер            = СтрокаФЗ.НомерУдостоверенияЛичности;
		Паспорт.ДатаВыдачи       = СтрокаФЗ.ДатаВыдачиУдостоверенияЛичности;
		Паспорт.КемВыдан         = СтрокаФЗ.ОрганВыдавшийУдостоверениеЛичности;
		Паспорт.КодПодразделения = СтрокаФЗ.КодОрганаВыдавшегоУдостоверениеЛичности;
		ДанныеКлиента.Паспорт    = Паспорт;
		
		ДанныеКлиента.ИНН                = СтрокаФЗ.ИНН;
		ДанныеКлиента.СНИЛС              = СтрокаФЗ.СНИЛС;
		ДанныеКлиента.Идентификация      = "";
		ДанныеКлиента.МетодИдентификации = "";
		ДанныеКлиента.ДатыИдентификации  = "";
		
		// Банковские счета
		Для каждого СтрокаБС Из СтрокиБС Цикл
			
			БанковскиеРеквизиты = Сервис.ФабрикаXDTO.Создать(ТипБанковскиеРеквизиты);
			БанковскиеРеквизиты.НаименованиеБанка = СтрокаБС.Банк;
			БанковскиеРеквизиты.БИК               = СтрокаБС.БИК;
			БанковскиеРеквизиты.КС                = СтрокаБС.КоррСчет;
			БанковскиеРеквизиты.РС                = СтрокаБС.НомерСчета;
			БанковскиеРеквизиты.Валюта            = СтрокаБС.ВалютаКод;
			
			ДанныеКлиента.БанковскиеРеквизиты.Добавить(БанковскиеРеквизиты);
		КонецЦикла;
		
		// Счета ДУ
		ДанныеКлиента.КодовоеСлово = "";
		ДанныеКлиента.ПромоКод     = "";
		
		ДанныеКлиента.Стратегия     = СтрокаФЗ.Стратегия;
		ДанныеКлиента.ДатаДоговора  = СтрокаФЗ.ДатаЗаключения;
		ДанныеКлиента.НомерДоговора = СтрокаФЗ.НомерДоговора;
		
		ДанныеКлиента.СтатусЗаявки       = "";
		ДанныеКлиента.СтатусОплаты       = СтрокиРеестровПлатежей.Количество() > 0;
		ДанныеКлиента.НаименованиеАгента = "";  
		ДанныеКлиента.Гражданство        = СтрокаФЗ.Гражданство.Наименование;
		ДанныеКлиента.ГражданствоРФ      = СтрокаФЗ.Гражданство = СтранаРОССИЯ;
		ДанныеКлиента.Резидент173ФЗ      = Ложь;
		ДанныеКлиента.ДругиеДоговораИИС  = Ложь;
		
		// Оплаты
		Для каждого СтрокаРеестровПлатежей Из СтрокиРеестровПлатежей Цикл
			Оплата = Сервис.ФабрикаXDTO.Создать(ТипОплата);
			
			Оплата.ДатаОплаты = СтрокаРеестровПлатежей.ДатаПлатежа;
			Оплата.СуммаОплат = СтрокаРеестровПлатежей.Сумма;
			Оплата.ГУИД       = Строка(СтрокаРеестровПлатежей.Регистратор.УникальныйИдентификатор());
			
			ДанныеКлиента.Оплата.Добавить(Оплата); 
		КонецЦикла;
		
		Клиенты.ДанныеКлиента.Добавить(ДанныеКлиента);
		
	КонецЦикла;	
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	
КонецПроцедуры // ЗарегистрироватьОшибкуИмпорта

Процедура ОповеститьОбОшибках(ЕстьОшибки)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДополнитьПараметрыВыполненияСессии(ПараметрыСессии, ТекстОшибки) Экспорт
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ДополнитьПараметрыВыполненияСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия, Новый Структура("ТекстОшибки", ТекстОшибки));
	
КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	Возврат РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюОбъекта(ЭтотОбъект, ИмяКоманды);
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);
	
КонецПроцедуры

Функция ПолучитьТекстОшибок()
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС);
	
КонецФункции

#КонецОбласти

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
URIПространстваИменСервиса = "http://www.region.ru/DU";
