
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма, "Отчет.Организация");
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТекстОшибки = "";
	Если НЕ ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период, Ложь, Ложь, ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Период");
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры
	
#КонецОбласти

#Область ДополнительныеФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
		РеквизитФормыОтчет = РеквизитФормыВЗначение("Отчет");
		РеквизитФормыОтчет.СформироватьОтчет(ЭтаФорма.Результат, ЭтаФорма.Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


