
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Функция СтрТрансляцияСимволов(Строка, СимволыПоиска, СимволыЗамены)

	врСтрока = Строка;
	Для Инд = 1 По СтрДлина(СимволыПоиска) Цикл
		СимволПоиска = Сред(СимволыПоиска, Инд, 1);
		Если Инд > СтрДлина(СимволыЗамены) Тогда
		    СимволЗамены = "";
		Иначе
			СимволЗамены = Сред(СимволыЗамены, Инд, 1);
		КонецЕсли;
		врСтрока = СтрЗаменить(врСтрока, СимволПоиска, СимволЗамены);
	КонецЦикла;
	Возврат врСтрока;
	
КонецФункции

Функция СравнитьСтрокиБезУчетаЯзыкаИРегистра(Строка1, Строка2)

	// все символы вниз
	врСтрока1 = НРег(Строка1);
	врСтрока2 = НРег(Строка2);

	// удалим пробелы
	врСтрока1 = СтрЗаменить(врСтрока1, " ", "");
	врСтрока2 = СтрЗаменить(врСтрока2, " ", "");
	
	// англ буквы -> русские буквы
	врСтрока1 = СтрТрансляцияСимволов(врСтрока1, "abcdegkmnopruy", "авсдедкмпоргиу");
	врСтрока2 = СтрТрансляцияСимволов(врСтрока2, "abcdegkmnopruy", "авсдедкмпоргиу");
	
	Возврат (врСтрока1 = врСтрока2);
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеДоходыИРасходы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
		|ГДЕ
		|	ПрочиеДоходыИРасходы.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СравнитьСтрокиБезУчетаЯзыкаИРегистра(ЭтотОбъект.Наименование, ВыборкаДетальныеЗаписи.Наименование) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уже существует элемент с таким названием!",,,,Отказ);	
		КонецЕсли;
	КонецЦикла;
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	КонецЕсли;
		
КонецПроцедуры
