
&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть(Новый Структура("ПартииЗаДату, ИспользоватьЭСП, ЭСП", ЭтотОбъект.ПартииЗаДату, ЭтотОбъект.ИспользоватьЭСП, ЭтотОбъект.ЭСП));
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭСППриИзменении(Элемент)
	
	Если Не ЭтаФорма.ИспользоватьЭСП Тогда
		ЭтаФорма.ЭСП = 0;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДатеПриИзменении(Элемент)
	
	Если НЕ ЭтаФорма.ОтборПоДате Тогда
		ЭтаФорма.ПартииЗаДату = '00010101';
	Иначе
		ЭтаФорма.ПартииЗаДату = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()
	
	ЭтаФорма.Элементы.ПартииЗаДату.Видимость = ЭтаФорма.ОтборПоДате;
	ЭтаФорма.Элементы.ПартииЗаДату.Доступность = ЭтаФорма.ОтборПоДате;
	
	ЭтаФорма.Элементы.ЭСП.Видимость = ЭтаФорма.ИспользоватьЭСП;
	ЭтаФорма.Элементы.ЭСП.Доступность = ЭтаФорма.ИспользоватьЭСП;
	
КонецПроцедуры
