&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтотОбъект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтотОбъект.Дата = НачалоДня(КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	
КонецПроцедуры

&НаСервере
Процедура Обновить(Уровень) // Уровень: 1-изменили клиента, 2-выбрали счета ДУ, 3-выбрали активы ЕПС
	
	Если Уровень = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Клиент = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
			|ГДЕ
			|	(КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &ПериодДата
			|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
			|
			|УПОРЯДОЧИТЬ ПО
			|	СчетДоверительногоУправления";
		
		Запрос.УстановитьПараметр("ПериодДата", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Клиент);
		
		ЭтотОбъект.СчетаДоверительногоУправления.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления"));
		ЭтотОбъект.СчетаДоверительногоУправления.ЗаполнитьПометки(Истина);
		
		Уровень = 2;
	
	КонецЕсли;
	
	Если Уровень = 2 Тогда
		
		СчетаДУ = Новый Массив;
		Для каждого СчетДоверительногоУправления Из ЭтотОбъект.СчетаДоверительногоУправления Цикл
			Если СчетДоверительногоУправления.Пометка Тогда
				СчетаДУ.Добавить(СчетДоверительногоУправления.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель КАК УчетныйАктив
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&Период,
			|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость) КАК БухПартииЦенныхБумагОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	УчетныйАктив";
		
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДУ);
		
		ЭтотОбъект.УчетныеАктивы.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйАктив"));
		ЭтотОбъект.УчетныеАктивы.ЗаполнитьПометки(Истина);
		
		Уровень = 3;
	
	КонецЕсли;
	
	Если Уровень = 3 Тогда
	
		СчетаДУ = Новый Массив;
		Для каждого СчетДоверительногоУправления Из ЭтотОбъект.СчетаДоверительногоУправления Цикл
			Если СчетДоверительногоУправления.Пометка Тогда
				СчетаДУ.Добавить(СчетДоверительногоУправления.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Активы = Новый Массив;
		Для каждого УчетныйАктив Из ЭтотОбъект.УчетныеАктивы Цикл
			Если УчетныйАктив.Пометка Тогда
				Активы.Добавить(УчетныйАктив.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага
			|ИЗ
			|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
			|			&Период,
			|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления В (&СчетаДоверительногоУправления)
			|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
			|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
			|				И УчетныйАктивЕПС.Родитель В (&Активы)) КАК БухПартииЦенныхБумагОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЦеннаяБумага
			|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДУ);
		Запрос.УстановитьПараметр("Активы", Активы);
		
		ЭтотОбъект.Облигации.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага"));
		ЭтотОбъект.Облигации.ЗаполнитьПометки(Истина);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНачалоОкончаниеСессииНаСервере(ПараметрыСессии)
	
	Если ПараметрыСессии = Неопределено Тогда
		
		Механизм = "ВнешнийОтчет._СформироватьРасшифровкуРасчетаАСПоПортфелю.СформироватьРасшифровкуРасчетаАС()";
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма.Отчет, "", Новый Структура("Дата,Организация,Клиент", ЭтаФорма.Дата, ЭтаФорма.Организация, ЭтаФорма.Клиент));
		
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
				
		ПараметрыСессии = Новый Структура("Сессия, Механизм", Сессия, Механизм);
	
	Иначе
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессии.Механизм, ПараметрыСессии.Сессия);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Обновить(1);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСчетаДУНажатие(Элемент)
	ЭтаФорма.СчетаДоверительногоУправления.ОтметитьЭлементы("Выбор счетов ДУ");
	Обновить(2);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУчетныеАктивыНажатие(Элемент)
	ЭтаФорма.УчетныеАктивы.ОтметитьЭлементы("Выбор категорий");
	Обновить(3);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОблигацииНажатие(Элемент)
	ЭтаФорма.Облигации.ОтметитьЭлементы("Выбор облигаций");
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивБумаг(СчетДУ, Активы, ЦБ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Дата,
		|			ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость
		|				И УчетныйАктивЕПС.Родитель В (&Активы)
		|				И ЦеннаяБумага В (&ЦБ)) КАК БухПартииЦенныхБумагОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеннаяБумага
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Активы", Активы);
	Запрос.УстановитьПараметр("ЦБ", ЦБ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага");

КонецФункции

&НаКлиенте
Процедура СформироватьРасшифровкуРасчетаАС(Команда)
		
	ПараметрыСессии = Неопределено;
	
	ЗарегистрироватьНачалоОкончаниеСессииНаСервере(ПараметрыСессии);
		
	Для каждого СчетДоверительногоУправления Из ЭтотОбъект.СчетаДоверительногоУправления Цикл
		
		Если НЕ СчетДоверительногоУправления.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СчетДУ = СчетДоверительногоУправления.Значение;
		
		Активы = Новый Массив;
		Для каждого УчетныйАктив Из ЭтотОбъект.УчетныеАктивы Цикл
			Если УчетныйАктив.Пометка Тогда
				Активы.Добавить(УчетныйАктив.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЦБ = Новый Массив;
		Для каждого Облигация Из ЭтотОбъект.Облигации Цикл
			Если Облигация.Пометка Тогда
				ЦБ.Добавить(Облигация.Значение);
			КонецЕсли;
		КонецЦикла;
		
		МассивБумаг = ПолучитьМассивБумаг(СчетДУ, Активы, ЦБ);
		
		Если МассивБумаг.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Книга = Новый ПакетОтображаемыхДокументов;
		
		ПараметрыПереоценки	= Новый Структура;
		ПараметрыПереоценки.Вставить("Организация", ЭтотОбъект.Организация);
		ПараметрыПереоценки.Вставить("СчетДоверительногоУправления", СчетДУ);
		ПараметрыПереоценки.Вставить("ЦельРасчета", ПредопределенноеЗначение("Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении"));
		ПараметрыПереоценки.Вставить("ВидУчета", ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет"));
		ПараметрыПереоценки.Вставить("Дата", ЭтотОбъект.Дата);
		
		Отказ						= Ложь;
		НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыПереоценки.Дата, ПараметрыПереоценки.Организация, ПараметрыПереоценки.СчетДоверительногоУправления, ПараметрыПереоценки.ЦельРасчета, Истина);
		АдресТаблицыСтоимостей		= Неопределено;
		
		Для каждого ЦеннаяБумага Из МассивБумаг Цикл
			
			Ошибки				= Неопределено;
			РасшифровкаРасчета	= Неопределено;
			
			Если РаботаСДокументами.СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(РасшифровкаРасчета, ПараметрыПереоценки, ЦеннаяБумага, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, АдресТаблицыСтоимостей, Ошибки) Тогда
				Страница = Книга.Состав.Добавить(ПоместитьВоВременноеХранилище(РасшифровкаРасчета, Новый УникальныйИдентификатор));		
				Страница.Наименование = Строка(ЦеннаяБумага);
			ИначеЕсли Ошибки.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + НастройкиОценки.ВариантРасчетаОценочнойСтоимости + "' не реализована");	
			Иначе
				ТекстОшибки = "Ошибка получения расшифровки расчета:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		
		КонецЦикла;
		
		Каталог = КаталогВременныхФайлов();
		ИмяФайла = Строка(СчетДУ) + "_" + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + ".xlsx";
		ПолноеИмяФайла = Каталог + ИмяФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПолноеИмяФайла);
		//ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
		Книга.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		ЗапуститьПриложение(ПолноеИмяФайла);
		
	КонецЦикла;
	
	ЗарегистрироватьНачалоОкончаниеСессииНаСервере(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДУУстановитьНажатие(Элемент)
	ЭтотОбъект.СчетаДоверительногоУправления.ЗаполнитьПометки(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДУСнятьНажатие(Элемент)
	ЭтотОбъект.СчетаДоверительногоУправления.ЗаполнитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УчетныеАктивыУстановитьНажатие(Элемент)
	ЭтотОбъект.УчетныеАктивы.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УчетныеАктивыСнятьНажатие(Элемент)
	ЭтотОбъект.УчетныеАктивы.ЗаполнитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОблигацииУстановитьНажатие(Элемент)
	ЭтотОбъект.Облигации.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОблигацииСнятьНажатие(Элемент)
	ЭтотОбъект.Облигации.ЗаполнитьПометки(Ложь);
КонецПроцедуры
