Функция ПолучитьОстатокЗадолженности(Ссылка, Период)
	
	Результат = Новый Структура("Сумма, ЭтоЗадолженностьПоОплате", 0, Неопределено);
	
	ДанныеСделкиСНедвижимостью = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВидПраваНаНедвижимость, ВидСделки, Организация, СчетДоверительногоУправления");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", 				  	  	Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка",							Ссылка);
	
	ЭтоСделкаКуплиПродажи = ДанныеСделкиСНедвижимостью.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность;
	
	Если ЭтоСделкаКуплиПродажи Тогда
		
		Запрос.УстановитьПараметр("Организация", 					ДанныеСделкиСНедвижимостью.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ДанныеСделкиСНедвижимостью.СчетДоверительногоУправления);
		
	#Область ТекстЗапроса
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Сумма > 0
			|			ТОГДА ВложенныйЗапрос.ТипЗадолженности
			|		КОГДА ВложенныйЗапрос.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|	КОНЕЦ КАК ТипЗадолженности,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Сумма > 0
			|			ТОГДА ВложенныйЗапрос.Сумма
			|		ИНАЧЕ -ВложенныйЗапрос.Сумма
			|	КОНЕЦ КАК СуммаОстаток
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности,
			|		ВложенныйЗапрос.ОснованиеЗадолженности КАК ОснованиеЗадолженности,
			|		СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
			|			ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК ОснованиеЗадолженности,
			|			ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК Сумма
			|		ИЗ
			|			РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|					&Период,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью)
			|						И Основание = &Ссылка) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ВЫБОР
			|				КОГДА ВЫРАЗИТЬ(УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Документ.СделкаСНедвижимостью).ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|			КОНЕЦ,
			|			УсловияСделокСНедвижимостьюСрезПоследних.Основание,
			|			-УсловияСделокСНедвижимостьюСрезПоследних.Сумма
			|		ИЗ
			|			РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|					&Период,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И Основание = &Ссылка) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|		ГДЕ
			|			НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|			И УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
			|			И УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)) КАК ВложенныйЗапрос
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ВложенныйЗапрос.ОснованиеЗадолженности,
			|		ВложенныйЗапрос.ТипЗадолженности) КАК ВложенныйЗапрос";
		
	#КонецОбласти	
	
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&Период, Основание = &Ссылка) КАК ЗадолженностиПоДенежнымСредствамОстатки";
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Результат.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
		Если ЭтоСделкаКуплиПродажи Тогда
			Результат.ЭтоЗадолженностьПоОплате = ДанныеСделкиСНедвижимостью.ВидСделки = Перечисления.ВидыСделок.Продажа 
												И ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская
												ИЛИ ДанныеСделкиСНедвижимостью.ВидСделки = Перечисления.ВидыСделок.Покупка 
												И ВыборкаДетальныеЗаписи.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
		Иначе
			Результат.ЭтоЗадолженностьПоОплате = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПлановыеВыплатыПоСделкеСНедвижимостью(Ссылка, Период) Экспорт
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ОснованиеЗадолженности", Новый ОписаниеТипов("ДокументСсылка.СделкаСНедвижимостью"));
	ТаблицаРезультат.Колонки.Добавить("ДатаРегистрации", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаРезультат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаРезультат.Колонки.Добавить("ЭтоДенежныйПоток", Новый ОписаниеТипов("Булево"));
	
	ОстатокСтруктура = ПолучитьОстатокЗадолженности(Ссылка, Период);
	ОстатокЗадолженности = ОстатокСтруктура.Сумма;
	
	Рубли = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
	ДатаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Дата");
	
	Запрос = Новый Запрос;
	
	Если ОстатокСтруктура.ЭтоЗадолженностьПоОплате Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ГрафикиПлатежейСрезПоследних.ДатаПлатежа КАК Дата,
			|	ГрафикиПлатежейСрезПоследних.Сумма КАК Сумма,
			|	ГрафикиПлатежейСрезПоследних.Основание.ВидПраваНаНедвижимость = ЗНАЧЕНИЕ(Перечисление.ВидыПравНаНедвижимость.Аренда)
			|		И ГрафикиПлатежейСрезПоследних.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка) КАК ЭтоПолучениеВДолгосрочнуюАренду
			|ИЗ
			|	РегистрСведений.ГрафикиПлатежей.СрезПоследних(&Период, Основание = &Ссылка) КАК ГрафикиПлатежейСрезПоследних
			|ГДЕ
			|	ГрафикиПлатежейСрезПоследних.Действует
			|
			|УПОРЯДОЧИТЬ ПО
			|	ГрафикиПлатежейСрезПоследних.ДатаПлатежа УБЫВ";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК Дата,
			|	УсловияСделокСНедвижимостьюСрезПоследних.Сумма КАК Сумма
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|			&Период,
			|			(Организация, СчетДоверительногоУправления, Основание) В
			|				(ВЫБРАТЬ
			|					СделкаСНедвижимостью.Организация КАК Организация,
			|					СделкаСНедвижимостью.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|					СделкаСНедвижимостью.Ссылка КАК Ссылка
			|				ИЗ
			|					Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
			|				ГДЕ
			|					СделкаСНедвижимостью.Ссылка = &Ссылка)) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|
			|УПОРЯДОЧИТЬ ПО
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи УБЫВ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ОстатокЗадолженности = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если ОстатокЗадолженности > ВыборкаДетальныеЗаписи.Сумма Тогда
			СуммаПотока = ВыборкаДетальныеЗаписи.Сумма
		Иначе
			СуммаПотока = ОстатокЗадолженности;
		КонецЕсли;
		
		СтрокаПотока = ТаблицаРезультат.Добавить();
		СтрокаПотока.ОснованиеЗадолженности = Ссылка;
		СтрокаПотока.ДатаРегистрации = ДатаРегистрации;
		//для сделки долгосрочной аренды рабочие дни учтены в графике платежей
		Если ВыборкаДетальныеЗаписи.ЭтоПолучениеВДолгосрочнуюАренду Тогда
			СтрокаПотока.Период = ВыборкаДетальныеЗаписи.Дата;
		Иначе
			СтрокаПотока.Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ВыборкаДетальныеЗаписи.Дата, 1);
		КонецЕсли;
		//хардкод - постановление о переносе выходных на 2022 год действует с 25.09.21
		Если Период < Дата(2021,9,25) И СтрокаПотока.Период = Дата(2022,5,4) Тогда
			СтрокаПотока.Период = Дата(2022,5,3);
		КонецЕсли;
		СтрокаПотока.Сумма = СуммаПотока;
		СтрокаПотока.Валюта = Рубли;
		СтрокаПотока.ЭтоДенежныйПоток = Истина;
		
		ОстатокЗадолженности = ОстатокЗадолженности - СуммаПотока;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьВидАктива(ВидПраваНаНедвижимость)
	
КонецФункции

Функция ПолучитьВидЗадолженности(ВидПраваНаНедвижимость, ВидСделки, Отказ) Экспорт
	
	Если ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность Тогда
		Возврат Справочники.ВидыЗадолженности.ПоСделкеСНедвижимостью;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт Тогда
		Возврат Справочники.ВидыЗадолженности.ПоИнвестконтракту;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
		Возврат Справочники.ВидыЗадолженности.ПоДДУ;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
		И ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Возврат Справочники.ВидыЗадолженности.ПоПолучениюВАренду;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для  " + ВидПраваНаНедвижимость + " не удалось определить вид задолженности по сделке с недвижимостью",,,,Отказ);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУчетныйАктив(ВидПраваНаНедвижимость, ВидСделки, Отказ) Экспорт
	
	Если ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт Тогда
		Возврат Справочники.УчетныеАктивы.Инвестконтракты;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
		Возврат Справочники.УчетныеАктивы.ДДУ;
	ИначеЕсли ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Аренда
		И ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		Возврат Справочники.УчетныеАктивы.ПраваАренды;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для  " + ВидПраваНаНедвижимость + " не удалось определить вид учетного актива по сделке с недвижимостью",,,,Отказ);
	КонецЕсли;
	
КонецФункции