
&НаСервере
Функция ОтправитьНаСервере()
	
	Результат = Истина;
	
	ДанныеПакета = Новый Структура;
	
	ДанныеПакета.Вставить("Организация", ЭтотОбъект.Организация);
	
	// Отправитель
	Попытка
		МассивАдресов = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭтотОбъект.Отправитель);
	Исключение
		ВызватьИсключение СтрШаблон("Некорректный адрес электронной почты у текущего пользователя: ""%1""", ЭтотОбъект.Отправитель);
	КонецПопытки;
	
	Если МассивАдресов.Количество() <> 1 Тогда
		ВызватьИсключение СтрШаблон("Некорректный адрес электронной почты у текущего пользователя: ""%1""", ЭтотОбъект.Отправитель);
	Иначе
		СтруктураАдреса = МассивАдресов[0];
	КонецЕсли; 
	
	ДанныеПакета.Вставить("АдресОтправителя",			СтруктураАдреса.Адрес);
	ДанныеПакета.Вставить("ПредставлениеОтправителя",	СтруктураАдреса.Представление);
	ДанныеПакета.Вставить("ОбратныеАдреса",				Новый Массив);
	
	ДанныеПакета.ОбратныеАдреса.Добавить(Новый Структура("Адрес, Представление", СтруктураАдреса.Адрес, СтруктураАдреса.Представление));
	
	Попытка
		МассивАдресовПолучателей = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(НРег(ЭтотОбъект.Получатели));
		РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивАдресовПолучателей);
	Исключение
		ВызватьИсключение СтрШаблон("Некорректный список адресов получателей письма: ""%1""", ЭтотОбъект.Получатели);
	КонецПопытки;
	
	// Получатели
	ДанныеПакета.Вставить("Получатели", Новый Массив);
	
	Для Каждого Получатель Из МассивАдресовПолучателей Цикл
		
		НовыйПолучатель = Новый Структура;
		
		НовыйПолучатель.Вставить("Адрес",			Получатель.Адрес);
		НовыйПолучатель.Вставить("Представление",	Получатель.Представление);
		
		ДанныеПакета.Получатели.Добавить(НовыйПолучатель);
		
	КонецЦикла;
	
	ДанныеПакета.Вставить("Тема",		ЭтотОбъект.Тема);
	ДанныеПакета.Вставить("Текст",		ЭтотОбъект.Текст);
	ДанныеПакета.Вставить("ТипТекста",	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	
	Файлы = Новый Массив;
	
	Для Каждого Вложение Из ЭтотОбъект.Вложения Цикл
		Файлы.Добавить(Новый Структура("ИдентификаторВерсии, Имя", Вложение.Идентификатор, Вложение.Имя));
	КонецЦикла;
	
	ДанныеПакета.Вставить("Файлы",	Файлы);
	
	Попытка
		ПакетДанных = РаботаСПакетамиДанныхКОбработке.СоздатьПакетДанных(Перечисления.ВидыПакетовДанныхКОбработке.ЭлектронноеПисьмо, ДанныеПакета);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось отправить отчеты из-за ошибки:%1", Символы.ПС + ОписаниеОшибки()));
		Результат = Ложь;
	КонецПопытки;
	
	Если Результат Тогда
		
		Для Каждого Вложение Из ЭтотОбъект.Вложения Цикл
			РаботаСОтчетами.ЗафиксироватьСобытиеСОтчетом(Перечисления.СобытияСОтчетами.СозданиеПисьмаПоПросьбе, Вложение.Экземпляр, Вложение.Идентификатор, ПакетДанных);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПроверитьЗаполнение() И ОтправитьНаСервере() Тогда
		Вопрос("Отчеты отправлены!", РежимДиалогаВопрос.ОК);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Вложения")
		ИЛИ ТипЗнч(Параметры.Вложения) <> Тип("Массив")
		ИЛИ Параметры.Вложения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректные параметры для отправки отчетов письмом!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Организация = Параметры.Организация;
	
	Элементы.Отправитель.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период",			ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СоставИНастройкиОтчетовСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Настройка.Код = ""АдресОтправителя"") КАК СоставИНастройкиОтчетовСрезПоследних
		|ГДЕ
		|	СоставИНастройкиОтчетовСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ВидыЗначенияНастроекОтчетов.Собственное)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановленоЗначение = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ УстановленоЗначение Тогда
			ЭтотОбъект.Отправитель = Выборка.Значение;
		КонецЕсли;
		
		Элементы.Отправитель.СписокВыбора.Добавить(Выборка.Значение, Выборка.Значение);
		
	КонецЦикла;
	
	Для Каждого Вложение Из Параметры.Вложения Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Вложения.Добавить(), Вложение);
	КонецЦикла;
	
КонецПроцедуры
