
Процедура ЗаполнитьВидСделки()
	
	Если      ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПустаяСсылка() Тогда
	    ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.ПустаяСсылка();
		
	ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.Сделка") Тогда
		ЭтотОбъект.ВидСделки = ЭтотОбъект.Основание.ВидСделки;
		
	ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		Если ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 0 Тогда
			Если      ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО Тогда
				ЭтотОбъект.ВидСделки = ЭтотОбъект.Основание.ВидСделки;
			ИначеЕсли ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
				Если      ЭтотОбъект.Основание.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
					ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа;
				ИначеЕсли ЭтотОбъект.Основание.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
					ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЭтотОбъект.ВидСделки = ЭтотОбъект.Основание.ВидСделки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВидСделки

Функция ЗаполнитьНаОсновании(_Основание, _ВидЗадолженности = Неопределено) Экспорт

	СтатусВыполнения = РаботаСДокументами.ЗаполнитьИсполнениеПоЦеннымБумагамНаОсновании(ЭтотОбъект, _Основание, _ВидЗадолженности);
	
	// дозаполним поля, связанные с оплатой
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, _Основание, "МестоХранения, Брокер, РасчетныйСчет");
	
	Возврат СтатусВыполнения;

КонецФункции // ЗаполнитьНаОсновании


Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда
	
		БлокировкаДанных = Новый БлокировкаДанных;
		
		// остатки ценных бумаг
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
			ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
			
			ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДепозитарныйСчет", "ДепозитарныйСчет");
			ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ЦеннаяБумага",     "ЦеннаяБумага");
		КонецЕсли;
		
		// задолженность по ц/б
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоЦеннымБумагам");
		ЭлементБлокировкиДанных.УстановитьЗначение("Основание",        ЭтотОбъект.Основание);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
		
		// задолженность по д/с
		Если ЭтотОбъект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы") Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
			ЭлементБлокировкиДанных.УстановитьЗначение("Основание",        ЭтотОбъект.Основание);
			ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности", ЭтотОбъект.ВидЗадолженности);
		КонецЕсли;
		
		БлокировкаДанных.Заблокировать();
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДвиженияПоДенежнымСредствам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ИсполнениеОбязательствПоСделке.Дата КАК Период,
		|	ИсполнениеОбязательствПоСделке.Организация КАК Организация,
		|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнениеОбязательствПоСделке.Брокер КАК Брокер,
		|	ИсполнениеОбязательствПоСделке.МестоХранения КАК МестоХранения,
		|	ИсполнениеОбязательствПоСделке.РасчетныйСчет КАК РасчетныйСчет,
		|	ИсполнениеОбязательствПоСделке.Рынок КАК Рынок,
		|	ИсполнениеОбязательствПоСделке.ВалютаСделки КАК Валюта,
		|	ИсполнениеОбязательствПоСделкеСуммы.Сумма КАК Сумма,
		|	ИсполнениеОбязательствПоСделкеСуммы.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
		|	ИсполнениеОбязательствПоСделке.ВидЗадолженности КАК ВариантДвиженияДенежныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка КАК Ссылка,
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма) КАК Сумма,
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.Оплата) КАК ВидДвиженияДенежныхСредств
		|	ИЗ
		|		Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|	ГДЕ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма) > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка,
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона),
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ОплатаКупона)
		|	ИЗ
		|		Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|	ГДЕ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона) > 0) КАК ИсполнениеОбязательствПоСделкеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО ИсполнениеОбязательствПоСделкеСуммы.Ссылка = ИсполнениеОбязательствПоСделке.Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиДенежныхСредств.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияПоДенежнымСредствам

Процедура СформироватьДвиженияПоЗадолженностиДенежнымСредствам()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеОбязательствПоСделке.Дата КАК Период,
		|	ИсполнениеОбязательствПоСделке.Основание КАК Основание,
		|	ВЫБОР
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		КОГДА ИсполнениеОбязательствПоСделке.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ИсполнениеОбязательствПоСделке.ВидЗадолженности КАК ВидЗадолженности,
		|	ИсполнениеОбязательствПоСделке.Организация КАК Организация,
		|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ИсполнениеОбязательствПоСделке.Основание.Контрагент КАК Контрагент,
		|	ИсполнениеОбязательствПоСделке.ВалютаСделки КАК Валюта,
		|	СуммыЗадолженностиПоДС.Сумма КАК Сумма,
		|	СуммыЗадолженностиПоДС.СуммаКупона КАК СуммаКупона
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка КАК Ссылка,
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма) КАК Сумма,
		|		СУММА(ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона) КАК СуммаКупона
		|	ИЗ
		|		Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|	ГДЕ
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка) КАК СуммыЗадолженностиПоДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО СуммыЗадолженностиПоДС.Ссылка = ИсполнениеОбязательствПоСделке.Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияПоЗадолженностиДенежнымСредствам


Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	ЭтоРынокФьючерсов = (ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Фьючерсы"));

	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиЦенныхБумаг.Записывать               = Истина;
	Движения.ОстаткиДенежныхСредств.Записывать           = Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать     = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;
	
	Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		ВидДвиженияЦБ      = ВидДвиженияНакопления.Приход;
		ВидОперацииСЦБ     = Перечисления.ВидыДвижений.Приход;
		ТипЗадолженностиЦБ = Перечисления.ТипыЗадолженности.Дебиторская;
	ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
		ВидДвиженияЦБ      = ВидДвиженияНакопления.Расход;
		ВидОперацииСЦБ     = Перечисления.ВидыДвижений.Расход;
		ТипЗадолженностиЦБ = Перечисления.ТипыЗадолженности.Кредиторская;
	КонецЕсли;
	
	Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		// остатки ц/б
		Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
		Движение.ВидДвижения                  = ВидДвиженияЦБ;
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		
		// задолженность по ц/б
		Движение = Движения.ЗадолженностиПоЦеннымБумагам.ДобавитьРасход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Основание;
		Движение.ТипЗадолженности             = ТипЗадолженностиЦБ;
		Движение.ВидЗадолженности             = ЭтотОбъект.ВидЗадолженности;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.Валюта                       = ЭтотОбъект.ВалютаСделки;
		Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		Движение.Сумма                        = СтрокаЦенныеБумаги.Сумма;
		Движение.СуммаКупона                  = СтрокаЦенныеБумаги.СуммаКупона;
		
		// операции с ц/б
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
				
		Если      ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО Тогда
			Движение.ЧастьСделкиРЕПО = 1;
		ИначеЕсли ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
			Движение.ЧастьСделкиРЕПО = 2;
		КонецЕсли;
		
		Движение.Операция                     = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения                  = ВидОперацииСЦБ;
		Движение.Основание                    = ЭтотОбъект.Основание;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = СтрокаЦенныеБумаги.ЦеннаяБумага;
		Движение.ДатаПоставки                 = ЭтотОбъект.Дата;
		Движение.ДатаОплаты                   = ЭтотОбъект.Дата;
		Движение.ДатаОперации                 = ЭтотОбъект.Дата;
		Движение.Валюта		                  = ЭтотОбъект.ВалютаСделки;
		Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
		Движение.Цена                         = СтрокаЦенныеБумаги.Цена;
		Движение.ЦенаПроцент                  = СтрокаЦенныеБумаги.ЦенаПроцент;
		Движение.ЦенаКупона                   = СтрокаЦенныеБумаги.ЦенаКупона;
		Движение.Сумма                        = СтрокаЦенныеБумаги.Сумма;
		Движение.СуммаКупона                  = СтрокаЦенныеБумаги.СуммаКупона;
	КонецЦикла;
	
	Если НЕ ЭтоРынокФьючерсов Тогда
		СформироватьДвиженияПоЗадолженностиДенежнымСредствам();
		СформироватьДвиженияПоДенежнымСредствам();
	КонецЕсли;
	
	Если ЭтотОбъект.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок Тогда // по аналоги со сделками
	
		// проверим отрицательные остатки
		Движения.Записать();
		
		Если      ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			//РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
		ИначеЕсли ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
		КонецЕсли;
		
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагам(ЭтотОбъект, Отказ);
		
		Если НЕ ЭтоРынокФьючерсов Тогда
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ)

	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	МассивУчетныхАктивов = Новый Массив;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		АналитикаКомиссии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
		АналитикаСделки = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
	Иначе
		АналитикаКомиссии = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПродажи;
		АналитикаСделки = Справочники.ДополнительныеАналитикиЛицевыхСчетов.СделкаПокупки;
	КонецЕсли;
	
	БиржаКонтрагент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ").ЮрФизЛицо;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.ПереоценкаСНачалаГода) КАК ПереоценкаСНачалаГода
		|ПОМЕСТИТЬ ЗакрытияКонтрактов
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Цена КАК Цена,
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗакрытияКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ЗакрытияКонтрактов.Количество КАК Количество,
		|	ЗакрытияКонтрактов.Стоимость КАК Стоимость,
		|	ЗакрытияКонтрактов.Переоценка КАК Переоценка,
		|	ЗакрытияКонтрактов.ПереоценкаСНачалаГода КАК ПереоценкаСНачалаГода
		|ИЗ
		|	ЗакрытияКонтрактов КАК ЗакрытияКонтрактов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО ЗакрытияКонтрактов.ЦеннаяБумага = ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага
		|ГДЕ
		|	ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	
	Списания = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСписания Из Списания Цикл
	
		СебестоимостьФьючерса = СтрокаСписания.Стоимость + СтрокаСписания.Переоценка;
		СтоимостьСписания = СтрокаСписания.Количество * СтрокаСписания.Цена;
		Прибыль = СтоимостьСписания - СебестоимостьФьючерса;
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда // списывали продажи, а для продаж рост бэд, а падение гуд
			Прибыль = - Прибыль;
		КонецЕсли;
		
		Если МассивУчетныхАктивов.Найти(СтрокаСписания.УчетныйАктивЕПС) = Неопределено Тогда
			МассивУчетныхАктивов.Добавить(СтрокаСписания.УчетныйАктивЕПС);
		КонецЕсли;
		
		Если Прибыль > 0 Тогда
		
			// проводка 1: прибыль на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
				
			// дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			Проводка.ДополнительнаяАналитикаКт = АналитикаСделки;
			
			
			// проводка 2: фьючерс на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Прибыль от закрытия контракта");
				
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
			
			// кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиА;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			
			// проводка 3: вспомогательный на дебиторку
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, Прибыль, "Задолженность по вар.марже");
				
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
			Проводка.СубконтоДт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаДт = ЭтотОбъект.Организация.ВалютаУчета;
			Проводка.ВалютнаяСуммаДт = Прибыль;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
			
		ИначеЕсли Прибыль < 0 Тогда
			
			// проводка 1: фьючерс на прибыль
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
				
			// дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			Проводка.ДополнительнаяАналитикаДт = АналитикаСделки;
			
			// кредит
			Проводка.СчетКт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоКт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			
			// проводка 2: вспомогательный на фьючерс
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Убыток от закрытия контракта");
				
			// дебет
			Проводка.СчетДт = СтрокаСписания.УчетныйАктивЕПС.СчетУчетаПереоценкиП;
			Проводка.СубконтоДт.ЦенныеБумаги = СтрокаСписания.ЦеннаяБумага;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
			
			
			// проводка 3: кредиторку на вспомогательный
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -Прибыль, "Задолженность по вар.марже");
				
			// дебет
			Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
			Проводка.СубконтоКт.Контрагенты = БиржаКонтрагент;
			Проводка.ВалютаКт = ЭтотОбъект.Организация.ВалютаУчета;
			Проводка.ВалютнаяСуммаКт = -Прибыль;
			
		КонецЕсли;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			// т.к. закрывали партии фьючерсов то закроем 7ой раздел
			СуммаЗакрытия7гоРаздела = Прибыль;
			Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела - СтрокаСписания.ПереоценкаСНачалаГода;
			Иначе
				СуммаЗакрытия7гоРаздела = СуммаЗакрытия7гоРаздела + СтрокаСписания.ПереоценкаСНачалаГода;
			КонецЕсли;
			
			Если СуммаЗакрытия7гоРаздела > 0 Тогда
				
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаДоходовОтОпераций,
					ЭтотОбъект.Организация.ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); //приходится передавать наоборот ибо вот так вот сделана процедура
					
			ИначеЕсли СуммаЗакрытия7гоРаздела < 0 Тогда
				
				БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
					ЭтотОбъект,
					СтрокаСписания.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
					СтрокаСписания.ЦеннаяБумага,
					СтрокаСписания.УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
					ЭтотОбъект.Организация.ВалютаУчета,
					"Закрытие доначисления по переоценке фьючерса",
					АналитикаСделки,
					-СуммаЗакрытия7гоРаздела); //приходится передавать наоборот ибо вот так вот сделана процедура
					
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	// если мы этим исполнением только закрываем чужие сделки и не открываем новых
	// то мы закроем 7ой раздел в части комиссии, начисленной при сделке
	// ибо других прибылей/убытков по сделке не предполагается
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество
		|ПОМЕСТИТЬ ОткрытияКонтрактов
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК КоличествоСделка,
		|	СделкаЦенныеБумаги.ТорговаяКомиссия КАК ТорговаяКомиссия,
		|	ЕСТЬNULL(ОткрытияКонтрактов.Количество, 0) КАК Количество
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОткрытияКонтрактов КАК ОткрытияКонтрактов
		|		ПО (ОткрытияКонтрактов.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага)
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Сделка";
	
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	
	Создания = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаСоздания Из Создания Цикл
		
		Если СтрокаСоздания.Количество = 0 Тогда // мы не создавали новых партий
			
			// для фьючей не передаем СчетДоверительногоУправления - ибо не переопределяются
			УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(, Перечисления.РынкиЦенныхБумаг.Фьючерсы, СтрокаСоздания.ЦеннаяБумага);
			
			Если МассивУчетныхАктивов.Найти(УчетныйАктивЕПС) = Неопределено Тогда
				МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
			КонецЕсли;
			
			// По просьбе Светы Мищенко не делаем закрытия по комиссии - ждем конца года ибо методика неопределена
			Продолжить;
			
			// закроем 7ой раздел в части начисленной комиссии
			БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУПоФиксированнойСумме(
				ЭтотОбъект,
				УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций,
				СтрокаСоздания.ЦеннаяБумага,
				УчетныйАктивЕПС.АналитикаРасходовОтОпераций,
				ЭтотОбъект.Основание.ВалютаТорговойКомиссии,
				"Закрытие доначисления по переоценке фьючерса",
				АналитикаКомиссии,
				СтрокаСоздания.ТорговаяКомиссия);
		
		КонецЕсли;
		
	КонецЦикла;
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Истина, Неопределено, Отказ);
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
	// Глава Г
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииСрочныхКонтрактов.ВидДвижения КАК ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки КАК ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия КАК Партия,
		|	СУММА(БухПартииСрочныхКонтрактов.Количество) КАК Количество,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьПокупки) КАК Стоимость,
		|	СУММА(БухПартииСрочныхКонтрактов.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииСрочныхКонтрактов.СтоимостьБазовогоАктиваВВалютеУчета) КАК СтоимостьБазовогоАктиваВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииСрочныхКонтрактов КАК БухПартииСрочныхКонтрактов
		|ГДЕ
		|	БухПартииСрочныхКонтрактов.Регистратор = &Регистратор
		|	И БухПартииСрочныхКонтрактов.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииСрочныхКонтрактов.ВидДвижения,
		|	БухПартииСрочныхКонтрактов.УчетныйАктивЕПС,
		|	БухПартииСрочныхКонтрактов.ЦеннаяБумага,
		|	БухПартииСрочныхКонтрактов.ВидСделки,
		|	БухПартииСрочныхКонтрактов.Партия";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	
	ДвиженияПартий = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаДвиженияПартий Из ДвиженияПартий Цикл
		
		БазовыйАктив = СтрокаДвиженияПартий.ЦеннаяБумага.БазовыйАктив;
		
		Если ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.ВалютныеПары") Тогда
			ВалютаАктива = БазовыйАктив.Валюта;
		ИначеЕсли ТипЗнч(БазовыйАктив) = Тип("СправочникСсылка.Акции") Тогда
			ВалютаАктива = БазовыйАктив.ВалютаНоминала;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учет по главе Г не проведен! Учет реализован только для валютных пар и акций!", ЭтотОбъект, "Основание");	
			Продолжить;
		КонецЕсли;
		
		ОснованиеРасчетов = СтрокаДвиженияПартий.Партия;
		
		Если ТипЗнч(ОснованиеРасчетов) = Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке") Тогда
			ОснованиеРасчетов = ОснованиеРасчетов.Основание;
		КонецЕсли;
		
		
		Если СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				
				// кредиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Обязательство по поставке");
						
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				
				КонецЕсли;
				
				// дебиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
				
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Требование по поставке");
						
					// дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				КонецЕсли;
				
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда
				
				// дебиторка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Требование по поставке");
						
					// дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
				
				КонецЕсли;
				
				// кредиторка
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
				
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Обязательство по поставке");
						
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
					
					// кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;

				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаДвиженияПартий.ВидДвижения = ВидДвиженияНакопления.Расход Тогда // закрываем требования и обязательства
			
			Если СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда 
				
				// закрытие кредиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие обязательства по поставке");
						
					// дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				КонецЕсли;
				// закрытие кредиторки переоценка
				Если СтрокаДвиженияПартий.Переоценка <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие обязательства по поставке");
						
					// дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаДт = СтрокаДвиженияПартий.Переоценка;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
				
				КонецЕсли;
				
				// закрытие дебиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
				
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие требования по поставке");
						
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ВалютаАктива;
					Проводка.ВалютнаяСуммаКт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;

				КонецЕсли;
				
			ИначеЕсли СтрокаДвиженияПартий.ВидСделки = Перечисления.ВидыСделок.Продажа Тогда 
				
				// закрытие дебиторки стоимость
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Стоимость, "Закрытие требования по поставке");
						
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Стоимость;
					
					Проводка.КоличествоКт = СтрокаДвиженияПартий.Количество;
				
				КонецЕсли;
				// закрытие дебиторки переоценка
				Если СтрокаДвиженияПартий.Стоимость <> 0 Тогда
				
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.Переоценка, "Закрытие требования по поставке");
						
					// дебет
					Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
					
					// кредит
					Проводка.СчетКт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
					
					Проводка.СубконтоКт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоКт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаКт = ЭтотОбъект.Организация.ВалютаУчета;
					Проводка.ВалютнаяСуммаКт = СтрокаДвиженияПартий.Переоценка;
				
				КонецЕсли;
				
				// закрытие кредиторки
				Если СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета <> 0 Тогда
				
					СтоимостьБазовогоАктиваВВалюте = СтрокаДвиженияПартий.Количество * СтрокаДвиженияПартий.ЦеннаяБумага.Лот;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СтрокаДвиженияПартий.СтоимостьБазовогоАктиваВВалютеУчета, "Закрытие обязательства по поставке");
						
					// дебет
					Проводка.СчетДт = СтрокаДвиженияПартий.УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
					
					Проводка.СубконтоДт.ОснованиеРасчетов = ОснованиеРасчетов;
					Проводка.СубконтоДт.ЦенныеБумаги = БазовыйАктив;
					
					Проводка.ВалютаДт = ВалютаАктива;
					Проводка.ВалютнаяСуммаДт = СтоимостьБазовогоАктиваВВалюте;
					
					Проводка.КоличествоДт = СтрокаДвиженияПартий.Количество;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;

				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Отказ)

	Если ЭтотОбъект.Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
		Контрагент = ЭтотОбъект.Брокер.ЮрФизЛицо;
		КонтрагентПоКомиссии = ЭтотОбъект.Брокер.ЮрФизЛицо;
		СчетДС = ПланыСчетов.Единый.РасчетыСБрокерами02;
		
		ВидСубконтоДС = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
		СубконтоДС = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	Иначе
		Контрагент = ЭтотОбъект.Основание.Контрагент;
		КонтрагентПоКомиссии = ЭтотОбъект.Основание.Контрагент;
		
		Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата) Тогда
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			СчетДС = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		ВидСубконтоДС = ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета;
		СубконтоДС = ЭтотОбъект.РасчетныйСчет;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	АналитикаТела 				= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ТелоЦеннойБумаги;
	АналитикаПереоценкиТела 	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
	АналитикаКупонПриобретенный = Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонПриобретенный;
	АналитикаКупонНачисленный	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.КупонНачисленный;
	АналитикаПремии 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Премия;
	АналитикаДисконта 			= Справочники.ДополнительныеАналитикиЛицевыхСчетов.Дисконт;
	АналитикаИндексацииНоминала	= Справочники.ДополнительныеАналитикиЛицевыхСчетов.ИндексацияНоминала;
	
	
	СуммаСделки = ЭтотОбъект.ЦенныеБумаги.Итог("Сумма");
	СуммаКупона = ЭтотОбъект.ЦенныеБумаги.Итог("СуммаКупона");
	СуммаСделкиВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаСделки, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	СуммаКупонаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаКупона, ЭтотОбъект.ВалютаСделки, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	
	ПараметрыОплаты = Новый Структура;
	
	ПараметрыОплаты.Вставить("Сделка",							ЭтотОбъект.Основание);
	ПараметрыОплаты.Вставить("СуммаТела",						СуммаСделки);
	ПараметрыОплаты.Вставить("СуммаКупона",						СуммаКупона);
	ПараметрыОплаты.Вставить("ВалютаСделки",					ЭтотОбъект.ВалютаСделки);
	ПараметрыОплаты.Вставить("ВалютаОплаты",					ЭтотОбъект.ВалютаСделки);
	ПараметрыОплаты.Вставить("Контрагент",						Контрагент);
	ПараметрыОплаты.Вставить("СчетДС",							СчетДС);
	ПараметрыОплаты.Вставить("СубконтоДС",						СубконтоДС);
	ПараметрыОплаты.Вставить("ВидСубконтоДС",					ВидСубконтоДС);
	ПараметрыОплаты.Вставить("КонтрагентПоКомиссии",			КонтрагентПоКомиссии);
	
	ПараметрыОплаты.Вставить("СуммаСделкиВВалютеУчета",			СуммаСделкиВВалютеУчета);
	ПараметрыОплаты.Вставить("СуммаКупонаВВалютеУчета",			СуммаКупонаВВалютеУчета);
	
	БухгалтерскийУчетЕПС.СформироватьПроводкиНачалаСделкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
	
	БухгалтерскийУчетЕПС.СформироватьПроводкиОплатыПоСделке(ЭтотОбъект, ПараметрыОплаты, Отказ);

	// предварительные затраты
	// если у нас покупка то мы закладываемся на то, что вид учетного актива у нас один
	// если продажа то все списывается на реализацию
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	МИНИМУМ(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК Сумма,
		|	МИНИМУМ(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток) КАК ВалютнаяСумма,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &Сделка) КАК ЕдиныйБухгалтерскийУчетОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ПО (БухПартииЦенныхБумаг.Регистратор = &Исполнение)
		|			И (БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС,
		|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
		|	БухПартииЦенныхБумаг.ЦеннаяБумага";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Исполнение", ЭтотОбъект.Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.Сумма, "Списание предварительных затрат");
		
		Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			
			Если ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость Тогда
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				
				Проводка.СубконтоДт.Контрагенты = ПараметрыОплаты.КонтрагентПоКомиссии;
				Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
				
				Проводка.ВалютаДт  = ВыборкаДетальныеЗаписи.Валюта;
				Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.ВалютнаяСумма;
				
			Иначе
				
				Проводка.СчетДт = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
				
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ВыборкаДетальныеЗаписи.УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
				
				Проводка.Партия = ЭтотОбъект.Основание;
				Проводка.СтрокаПартии = 1;
				
			КонецЕсли;
			
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.ВыбытиеИРеализация10;
			Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
			Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
			Проводка.КоличествоДт = 0;
		КонецЕсли;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами05;
		
		Проводка.СубконтоКт.Контрагенты = ПараметрыОплаты.КонтрагентПоКомиссии;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыОплаты.Сделка;
		
		Проводка.ВалютаКт        = ВыборкаДетальныеЗаписи.Валюта;
		Проводка.ВалютнаяСуммаКт = ВыборкаДетальныеЗаписи.ВалютнаяСумма;
		
	КонецЦикла;
	
	Если ЭтотОбъект.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
	
		БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, Контрагент);
		
	Иначе
		
		БухгалтерскийУчетЕПС.СформироватьПроводкиПродажиСПартиямиНаЛицевыхСчетах(ЭтотОбъект, УчетныйРегистр, ПараметрыОплаты, Отказ);
	
	КонецЕсли;
	
	// Глава Г
	ВидыСубконтоЦБ = Новый Массив;
	ВидыСубконтоЦБ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	ВидыСубконтоЦБ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги);
	
	ВидыСубконтоДС = Новый Массив;
	ВидыСубконтоДС.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
	
	КонтрагентЯвляетсяРезидентом = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Контрагент, ЭтотОбъект.Организация);
	Если ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
		СчетДС = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС01, ПланыСчетов.Единый.ОбязательстваПоПоставкеДС02);
		СчетЦБ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ01, ПланыСчетов.Единый.ТребованияПоПоставкеЦБ02);
	Иначе
		СчетДС = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ТребованияПоПоставкеДС01, ПланыСчетов.Единый.ТребованияПоПоставкеДС02);
		СчетЦБ = ?(КонтрагентЯвляетсяРезидентом, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ01, ПланыСчетов.Единый.ОбязательстваПоПоставкеЦБ02);
	КонецЕсли;
		
	НеВыделятьПереоценкуДляБумагОжидаемыхКПолучениюПоСделкамТПлюс = БухгалтерскийУчет.ОпределитьНастройкуУчета(
								ЭтотОбъект.Дата,
								ЭтотОбъект.Организация,
								ЭтотОбъект.СчетДоверительногоУправления,
								"НеВыделятьПереоценкуДляБумагОжидаемыхКПолучениюПоСделкамТПлюс");
								
								
	Запрос = Новый Запрос;
	Если НеВыделятьПереоценкуДляБумагОжидаемыхКПолучениюПоСделкамТПлюс Тогда
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Единый.КорреспонденцияСПассивом)
			|	КОНЕЦ КАК СчетДт,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК СубконтоДт1,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК СубконтоКт1,
			|	NULL КАК СубконтоДт2,
			|	NULL КАК СубконтоКт2,
			|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК ВалютаДт,
			|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК ВалютаКт,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|	КОНЕЦ КАК КоличествоДт,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|	КОНЕЦ КАК КоличествоКт,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|	КОНЕЦ КАК ВалютнаяСуммаДт,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|	КОНЕЦ КАК ВалютнаяСуммаКт,
			|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитикаДт,
			|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитикаКт,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Единый.КорреспонденцияСАктивом)
			|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Счет
			|	КОНЕЦ КАК СчетКт
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&МоментДокумента,
			|			Счет = &СчетДС,
			|			&ВидыСубконтоДС,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Субконто1 = &ОснованиеРасчетов) КАК ЕдиныйБухгалтерскийУчетОстатки
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Единый.КорреспонденцияСПассивом)
			|	КОНЕЦ,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
			|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
			|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
			|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.КоличествоОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|		ИНАЧЕ -ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток
			|	КОНЕЦ,
			|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
			|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика,
			|	ВЫБОР
			|		КОГДА ЕдиныйБухгалтерскийУчетОстатки.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Единый.КорреспонденцияСАктивом)
			|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстатки.Счет
			|	КОНЕЦ
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&МоментДокумента,
			|			Счет = &СчетЦБ,
			|			&ВидыСубконтоЦБ,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Субконто1 = &ОснованиеРасчетов) КАК ЕдиныйБухгалтерскийУчетОстатки";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетДт КАК СчетДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
			|	NULL КАК СубконтоДт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетКт КАК СчетКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
			|	NULL КАК СубконтоКт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаДт КАК ВалютаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаКт КАК ВалютаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоДт КАК КоличествоДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоКт КАК КоличествоКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.Сумма КАК Сумма,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаДт КАК ДополнительнаяАналитикаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаКт КАК ДополнительнаяАналитикаКт
			|ПОМЕСТИТЬ Движения
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ДвиженияССубконто(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Счет = &СчетДС
			|				И Субконто1 = &ОснованиеРасчетов
			|				И Активность,
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетДвиженияССубконто
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт1,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоДт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СчетКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт1,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.СубконтоКт2,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.КоличествоКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.Сумма,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ВалютнаяСуммаКт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаДт,
			|	ЕдиныйБухгалтерскийУчетДвиженияССубконто.ДополнительнаяАналитикаКт
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ДвиженияССубконто(
			|			&НачалоПериода,
			|			&ОкончаниеПериода,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Счет = &СчетЦБ
			|				И Субконто1 = &ОснованиеРасчетов
			|				И Активность,
			|			,
			|			) КАК ЕдиныйБухгалтерскийУчетДвиженияССубконто
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Движения.СчетДт КАК СчетДт,
			|	Движения.СубконтоДт1 КАК СубконтоДт1,
			|	Движения.СубконтоДт2 КАК СубконтоДт2,
			|	Движения.СчетКт КАК СчетКт,
			|	Движения.СубконтоКт1 КАК СубконтоКт1,
			|	Движения.СубконтоКт2 КАК СубконтоКт2,
			|	Движения.ВалютаДт КАК ВалютаДт,
			|	Движения.ВалютаКт КАК ВалютаКт,
			|	СУММА(Движения.КоличествоДт) КАК КоличествоДт,
			|	СУММА(Движения.КоличествоКт) КАК КоличествоКт,
			|	СУММА(Движения.Сумма) КАК Сумма,
			|	СУММА(Движения.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
			|	СУММА(Движения.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
			|	Движения.ДополнительнаяАналитикаДт КАК ДополнительнаяАналитикаДт,
			|	Движения.ДополнительнаяАналитикаКт КАК ДополнительнаяАналитикаКт
			|ИЗ
			|	Движения КАК Движения
			|
			|СГРУППИРОВАТЬ ПО
			|	Движения.СчетДт,
			|	Движения.СубконтоДт1,
			|	Движения.СубконтоДт2,
			|	Движения.СчетКт,
			|	Движения.СубконтоКт1,
			|	Движения.СубконтоКт2,
			|	Движения.ВалютаДт,
			|	Движения.ВалютаКт,
			|	Движения.ДополнительнаяАналитикаДт,
			|	Движения.ДополнительнаяАналитикаКт";
		
	КонецЕсли;							
	
	Запрос.УстановитьПараметр("ВидыСубконтоЦБ", ВидыСубконтоЦБ);
	Запрос.УстановитьПараметр("ВидыСубконтоДС", ВидыСубконтоДС);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.Основание.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ЭтотОбъект.Дата - 1);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ОснованиеРасчетов", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("СчетДС", СчетДС);
	Запрос.УстановитьПараметр("СчетЦБ", СчетЦБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ВыборкаДетальныеЗаписи.Сумма, "Исполнение сделки");
		
		Если ВыборкаДетальныеЗаписи.СчетДт = СчетДС ИЛИ ВыборкаДетальныеЗаписи.СчетДт = СчетЦБ Тогда
			
			// дебет
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетДт;
			Проводка.СубконтоКт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СубконтоДт1;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СубконтоДт2) Тогда
				Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.СубконтоДт2;
				Проводка.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоДт;
			КонецЕсли;
			
			Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.ВалютаДт;
			Проводка.ВалютнаяСуммаКт = ВыборкаДетальныеЗаписи.ВалютнаяСуммаДт;
			Проводка.ДополнительнаяАналитикаКт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитикаДт;
			
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.СчетКт;
			
		Иначе
			
			// кредит
			Проводка.СчетДт = ВыборкаДетальныеЗаписи.СчетКт;
			Проводка.СубконтоДт.ОснованиеРасчетов = ВыборкаДетальныеЗаписи.СубконтоКт1;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СубконтоКт2) Тогда
				Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.СубконтоКт2;
				Проводка.КоличествоДт = ВыборкаДетальныеЗаписи.КоличествоКт;
			КонецЕсли;
			
			Проводка.ВалютаДт = ВыборкаДетальныеЗаписи.ВалютаКт;
			Проводка.ВалютнаяСуммаДт = ВыборкаДетальныеЗаписи.ВалютнаяСуммаКт;
			Проводка.ДополнительнаяАналитикаДт = ВыборкаДетальныеЗаписи.ДополнительнаяАналитикаКт;
			
			Проводка.СчетКт = ВыборкаДетальныеЗаписи.СчетДт;
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
		ПроведениеПоРегиструЕПСФьючерсы(УчетныйРегистр, Отказ);
	ИначеЕсли БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ОтражатьПартииНаЛицевыхСчетах") Тогда
		ПроведениеПоРегиструЕПССПартиямиНаЛицевыхСчетах(УчетныйРегистр, Отказ);
	Иначе
		БухгалтерскийУчетЕПС.СформироватьПроводкиПокупкиПродажиЦеннойБумаги(ЭтотОбъект, Основание, УчетныйРегистр, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Если  ЭтотОбъект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ДрагоценныеМеталлы") Тогда	
		ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ);
		Возврат;
	КонецЕсли;
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	БухгалтерскийУчет.СформироватьПроводкиПокупкиПродажиЦеннойБумагиБУНУ(ЭтотОбъект, УчетныйРегистр, Отказ);
	
	
КонецПроцедуры

Функция ПолучитьОтложеннуюИндексациюпоПартии(Партия, СтрокаПартии, Дата)
	
КонецФункции

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если  ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтотОбъект.Метаданные().Реквизиты.Основание.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда // ввод на основании
		ЗаполнитьНаОсновании(ДанныеЗаполнения);
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект,
		"Основание, ВидЗадолженности, ВидСделки, СчетДоверительногоУправления, Рынок, Брокер, МестоХранения, РасчетныйСчет, ВалютаСделки");

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	РаботаСДокументами.ЗаполнитьСтрокиПартии(ЭтотОбъект);
	
	ЗаполнитьВидСделки();
		
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		РаботаСДокументами.ПроверитьЗаполнениеРасчетногоСчета(ЭтотОбъект, Отказ);
		
		// проверим, что в основании выбрано отложенное исполнение, но не выбрано раздельное
		ОтложенноеИсполнение = Неопределено;
		РаздельноеИсполнение = Неопределено;
		
		Если      ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделке Тогда
			ОтложенноеИсполнение = ЭтотОбъект.Основание.ОтложенноеИсполнение;
			РаздельноеИсполнение = ЭтотОбъект.Основание.РаздельноеИсполнение;
		ИначеЕсли ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО Тогда
			ОтложенноеИсполнение = ЭтотОбъект.Основание.ОтложенноеИсполнение;
			РаздельноеИсполнение = ЭтотОбъект.Основание.РаздельноеИсполнение;
		ИначеЕсли ЭтотОбъект.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО Тогда
			Если ЭтотОбъект.Основание.ЧастьСделкиРЕПО = 2 Тогда
				ОтложенноеИсполнение = ЭтотОбъект.Основание.ОтложенноеИсполнение;
				РаздельноеИсполнение = ЭтотОбъект.Основание.РаздельноеИсполнение;
			Иначе
				ОтложенноеИсполнение = ЭтотОбъект.Основание.ОтложенноеИсполнениеВторойЧасти;
				РаздельноеИсполнение = ЭтотОбъект.Основание.РаздельноеИсполнениеВторойЧасти;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ОтложенноеИсполнение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В основании не выбран режим отложенного исполнения.", ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
		
		Если Не ОтложенноеИсполнение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В основании выбран режим раздельного исполнения. Поставка и оплата закрываются соответствующими документами.", ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
	
		// работа с ценными бумагами
		ТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Для НомСтр = 0 По ЭтотОбъект.ЦенныеБумаги.Количество() - 1 Цикл
			
			СтрокаЦенныеБумаги = ЭтотОбъект.ЦенныеБумаги[НомСтр];
			
			// проверим, что рынок соответствует типу ценной бумаги
			Если Не ТипЦеннойБумаги.СодержитТип(ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ценной бумаги в строке № " + (НомСтр + 1) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".",,,, Отказ);
			КонецЕсли;
			
			// для рынка векселей проверим количество
			Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя И СтрокаЦенныеБумаги.Количество <> 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество векселей в строке № " + (НомСтр + 1) + " отлично от 1. Обратитесь к разработчикам.",,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// т.к. по документу используется сводная форма в журнале
	РаботаСЖурналамиОпераций.ПередЗаписьюДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью

Процедура ПередУдалением(Отказ)
	
	// т.к. по документу используется сводная форма в журнале
	РаботаСЖурналамиОпераций.ПередУдалениемДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
		
КонецПроцедуры

#КонецОбласти

Процедура ПроведениеПоРегиструБухгалтерииДрагоценныеМеталлы(УчетныйРегистр, Отказ)
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	УчетныйАктив					= БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Рынок, Неопределено);
	НастройкиУчетаАктива			= БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Дата, Организация, СчетДоверительногоУправления, УчетныйАктив, УчетныйРегистр);
	ВалютныйУчет					= НастройкиУчетаАктива.СчетУчета.Валютный;
	СчетПрочиеРасходы				= ПланыСчетов.Основной.ПрочиеРасходы;
	СчетПрочиеДоходы				= ПланыСчетов.Основной.ПрочиеДоходы;
	ВидСубконтоУчетаЦеннойБумаги	= БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Контрагент, ВалютаТорговойКомиссии");
	Контрагент = РеквизитыОснования.Контрагент;
	Сделка = ЭтотОбъект.Основание;
	ВалютаТорговойКомиссии = РеквизитыОснования.ВалютаТорговойКомиссии;	
	
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.ВалютаСделки,
		ЭтотОбъект.Брокер);
	
	СчетУчетаКомиссии = ПланыСчетов.Основной.РасчетыПоКомиссии;
	
	СчетУчетаКомиссииБрокера = ПланыСчетов.Основной.РасчетыПоКомиссии;
	
	СчетУчетаДСДляКомиссии = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ВалютаТорговойКомиссии,
		Брокер);	
		
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр,
		Отказ);
		
	АналитикаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.ВидыЗадолженности.ПоТорговойКомиссии,
		УчетныйРегистр,
		"Аналитика");			
		
	ЕстьСубконтоКонтрагентыПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);						
	
	Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
		Если Брокер <> Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			КонтрагентПоКомиссии = Брокер.ЮрФизЛицо;
		Иначе
			КонтрагентПоКомиссии = Контрагент;
		КонецЕсли
	КонецЕсли;
	
	ЕстьСубконтоСделкиПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено);
	ЕстьСубконтоДоговорБрокерскогоОбслуживанияПоКомиссии = (СчетУчетаКомиссии.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено);
	
	СубконтоДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, Брокер, ЭтотОбъект.Дата);
	
	// списание переоценки незавершенных сделок
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.Субконто1 КАК Сделка,
		|	БухгалтерскийУчетОстатки.Валюта КАК Валюта,
		|	-БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
		|	-БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Граница,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Сделка),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &Сделка) КАК БухгалтерскийУчетОстатки";
	
	Запрос.УстановитьПараметр("Сделка", 								Основание);
	Запрос.УстановитьПараметр("Граница",								Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",							Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",			СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", 	Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ?(ВыборкаДетальныеЗаписи.СуммаОстаток<0,-1,1) * ВыборкаДетальныеЗаписи.СуммаОстаток, "Переоценка НС");
		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток > 0 Тогда
			Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок;
			Проводка.СубконтоДт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			Проводка.СубконтоДт.БрокерскиеКомпании = Брокер;
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			
			Проводка.ВалютнаяСуммаДт = ?(ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток<0,-1,1) * ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток;
			Проводка.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
			
			Проводка.СчетКт = СчетПрочиеДоходы;
			Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоКт.ЦенныеБумаги = ЦенныеБумаги[0].ЦеннаяБумага;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Ложь;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.СуммаОстаток < 0 Тогда
			
			//кредит. дебет потом
			Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоПереоценкеНезавершенныхСделок;
			Проводка.СубконтоКт.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			Проводка.СубконтоКт.БрокерскиеКомпании = Брокер;
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
			
			Проводка.ВалютнаяСуммаКт = ?(ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток<0,-1,1) * ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстаток;
			Проводка.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
				
			//дебет			
			Проводка.СчетДт = СчетПрочиеРасходы;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
			Проводка.СубконтоДт.ЦенныеБумаги = ЦенныеБумаги[0].ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ВидСделки = ПредопределенноеЗначение("Перечисление.ВидыСделок.Покупка") Тогда
		
		СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыПоПокупкамТБС;
		
		Для Каждого ТекСтрока Из ЦенныеБумаги Цикл
			
			Если ТекСтрока.Количество > 0 Тогда
				
				//58.16.1/ 76.21.2 стоимость покупки
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Покупка ТБС");
				
				// Дт.
				Проводка.СчетДт = НастройкиУчетаАктива.СчетУчета;
				Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ТекСтрока.ЦеннаяБумага;
				
				Проводка.КоличествоДт = ТекСтрока.Количество;
				
				Если НастройкиУчетаАктива.СчетУчета.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = ТекСтрока.Сумма;
					Проводка.ВалютаДт = ВалютаСделки;
				КонецЕсли;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
				
				Если СчетРасчетаСКонтрагентами.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = ТекСтрока.Сумма;
					Проводка.ВалютаКт = ВалютаСделки;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекСтрока.Сумма > 0 Тогда
				
				//76.21.2/55.4 оплата по сделке
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекСтрока.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата продавцу");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
				
				Если СчетРасчетаСКонтрагентами.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = ТекСтрока.Сумма;
					Проводка.ВалютаДт = ВалютаСделки;
				КонецЕсли;
				
				// Кт.
				Проводка.СчетКт = СчетУчетаДС;
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
					Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
					Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
				Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
				КонецЕсли;			
				
				Если СчетУчетаДС.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = ТекСтрока.Сумма;
					Проводка.ВалютаКт = ВалютаСделки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		СчетРасчетаСКонтрагентами		= ПланыСчетов.Основной.РасчетыПоПродажамТБС;
		СчетЗатратВСтоимости		= ПланыСчетов.Основной.ЗатратыНаПриобретениеТБС;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Граница",						Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация",					Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("СчетУчетаАктивов",				НастройкиУчетаАктива.СчетУчета);
		Запрос.УстановитьПараметр("СчетУчетаПереоценки",			НастройкиУчетаАктива.СчетУчетаПереоценки);
		Запрос.УстановитьПараметр("СчетЗатратВСтоимости",			СчетЗатратВСтоимости);
		Запрос.УстановитьПараметр("ТЧ",								ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, Количество, Сумма"));
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЦенныеБумаги.Количество КАК Количество,
			|	ЦенныеБумаги.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ТЧ
			|ИЗ
			|	&ТЧ КАК ЦенныеБумаги
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТЧ.ЦеннаяБумага КАК ЦеннаяБумага,
			|	СУММА(_ТЧ.Количество) КАК Количество,
			|	СУММА(_ТЧ.Сумма) КАК Сумма
			|ПОМЕСТИТЬ _ЦенныеБумаги
			|ИЗ
			|	_ТЧ КАК _ТЧ
			|
			|СГРУППИРОВАТЬ ПО
			|	_ТЧ.ЦеннаяБумага
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
			|	БухгалтерскийУчетОстатки.КоличествоОстатокДт КАК КоличествоОстаток,
			|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстаток,
			|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстаток,
			|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
			|ПОМЕСТИТЬ _ОстаткиАктива
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаАктивов,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
			|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
			|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
			|ПОМЕСТИТЬ _ОстаткиПереоценки
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетУчетаПереоценки,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
			|	БухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
			|	БухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
			|	БухгалтерскийУчетОстатки.Валюта КАК Валюта
			|ПОМЕСТИТЬ _ОстаткиЗатраты
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Граница,
			|			Счет = &СчетЗатратВСтоимости,
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
			|					ИЗ
			|						_ЦенныеБумаги КАК _ЦенныеБумаги)) КАК БухгалтерскийУчетОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
			|	_ЦенныеБумаги.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА _ОстаткиАктива.СуммаОстаток
			|				ИНАЧЕ _ОстаткиАктива.СуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаПереоценка,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиЗатраты.СуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиЗатраты.СуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаЗатратыВСтоимости,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА _ОстаткиАктива.ВалютнаяСуммаОстаток
			|				ИНАЧЕ _ОстаткиАктива.ВалютнаяСуммаОстаток * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаВалютнаяЦеннаяБумага,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиПереоценки.ВалютнаяСуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиПереоценки.ВалютнаяСуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаВалютнаяПереоценка,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(_ОстаткиАктива.КоличествоОстаток, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА _ЦенныеБумаги.Количество = _ОстаткиАктива.КоличествоОстаток
			|					ТОГДА ЕСТЬNULL(_ОстаткиЗатраты.ВалютнаяСуммаОстаток, 0)
			|				ИНАЧЕ ЕСТЬNULL(_ОстаткиЗатраты.ВалютнаяСуммаОстаток, 0) * _ЦенныеБумаги.Количество / _ОстаткиАктива.КоличествоОстаток
			|			КОНЕЦ
			|	КОНЕЦ КАК СуммаВалютнаяЗатратыВСтоимости,
			|	_ЦенныеБумаги.Сумма КАК Сумма,
			|	_ОстаткиАктива.Валюта КАК ВалютаЦеннаяБумага,
			|	_ОстаткиПереоценки.Валюта КАК ВалютаПереоценка,
			|	_ОстаткиЗатраты.Валюта КАК ВалютаЗатратыВСтоимости
			|ИЗ
			|	_ЦенныеБумаги КАК _ЦенныеБумаги
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиАктива КАК _ОстаткиАктива
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиАктива.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиПереоценки КАК _ОстаткиПереоценки
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиПереоценки.ЦеннаяБумага
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЗатраты КАК _ОстаткиЗатраты
			|		ПО _ЦенныеБумаги.ЦеннаяБумага = _ОстаткиЗатраты.ЦеннаяБумага";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Сумма > 0 Тогда
				
				//76.21.1/91.01 отражена выручка по сделке
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Начисление дебиторской задолженности");
				
				// Дт.
				Проводка.СчетДт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
				
				Если СчетРасчетаСКонтрагентами.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = Выборка.Сумма;
					Проводка.ВалютаДт = ВалютаСделки;
				КонецЕсли;
				
				// Кт.
				Проводка.СчетКт = СчетПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоКт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ		= Ложь;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.Сумма, ВалютаСделки, Организация, Дата, Отказ), "Оплата от покупателя");
				
				// Дт.
				Проводка.СчетДт = СчетУчетаДС;
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено Тогда
					Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;
				
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
					Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				КонецЕсли;
				
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
				Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПродажаТБС;
				КонецЕсли;			
				
				Если СчетУчетаДС.Валютный Тогда
					Проводка.ВалютнаяСуммаДт = Выборка.Сумма;
					Проводка.ВалютаДт = ВалютаСделки;
				КонецЕсли;
				
				// Кт.
				Проводка.СчетКт = СчетРасчетаСКонтрагентами;
				Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПокупкаТБС;
				
				Если СчетРасчетаСКонтрагентами.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.Сумма;
					Проводка.ВалютаКт = ВалютаСделки;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.СуммаЦеннаяБумага <> 0 Или Выборка.СуммаВалютнаяЦеннаяБумага <> 0 Тогда
				// 91.02 /58.16.1 списана себестоимость
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаЦеннаяБумага, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС");
				
				// Дт.
				Проводка.СчетДт = СчетПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
				
				// Кт.
				Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
				
				Проводка.КоличествоКт = Выборка.Количество;
				
				Если НастройкиУчетаАктива.СчетУчета.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяЦеннаяБумага;
					Проводка.ВалютаКт = Выборка.ВалютаЦеннаяБумага;
				КонецЕсли;
			КонецЕсли;
			
			Если Выборка.СуммаПереоценка <> 0 Или Выборка.СуммаВалютнаяПереоценка <> 0  Тогда
				
				// 91.02/58.16.2 списана положительная переоценка
				// 91.02/58.16.2 (..) списана отрицательная переоценка
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаПереоценка, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС (переоценка)");
				
				// Дт.
				Проводка.СчетДт = СчетПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
				
				// Кт.
				Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
				
				Если НастройкиУчетаАктива.СчетУчетаПереоценки.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяПереоценка;
					Проводка.ВалютаКт = Выборка.ВалютаПереоценка;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.СуммаЗатратыВСтоимости <> 0 Или Выборка.СуммаВалютнаяЗатратыВСтоимости <> 0  Тогда
				
				// 91.02/58.16.3 списаны затраты по покупке
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], РаботаСВалютами.ПолучитьСуммуВВалютеУчета(Выборка.СуммаЗатратыВСтоимости, ВалютаСделки, Организация, Дата, Отказ), "Продажа ТБС (затраты в стоимости)");
				
				// Дт.
				Проводка.СчетДт = СчетПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы	= НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
				Проводка.СубконтоДт.ЦенныеБумаги			= Выборка.ЦеннаяБумага;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ		= Ложь;
				
				// Кт.
				Проводка.СчетКт = СчетЗатратВСтоимости;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Выборка.ЦеннаяБумага;
				
				Если СчетЗатратВСтоимости.Валютный Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.СуммаВалютнаяЗатратыВСтоимости;
					Проводка.ВалютаКт = Выборка.ВалютаЗатратыВСтоимости;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// КОМИССИЯ
	ВыделятьРасходыПриПродаже = Ложь;
	Если (ВидСделки = Перечисления.ВидыСделок.Продажа) Тогда
		ВыделятьРасходыПриПродаже = НастройкиПоВидуУчета.ВыделятьРасходыПриПродаже;
	КонецЕсли;
	
	Если НастройкиПоВидуУчета.МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Начисления
		И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР
		И ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		
		ОбъектКомиссииСсылка = ЭтотОбъект.Основание;
		
		НачислятьКомиссию = Истина;
		ИспользоватьСчет7616 = Ложь;
		
		ТаблицаКомиссий = ЭтотОбъект.Основание.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, ТорговаяКомиссия");
		
		ТаблицаКомиссий.Колонки.Добавить("Валюта");
		ТаблицаКомиссий.Колонки.Добавить("ВидЗадолженности");
		
		ТаблицаКомиссий.ЗаполнитьЗначения(ВалютаТорговойКомиссии, "Валюта");
		ТаблицаКомиссий.ЗаполнитьЗначения(Справочники.ВидыЗадолженности.ПоТорговойКомиссии, "ВидЗадолженности");
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РасходыПоСделкеОбороты.СуммаОборот КАК ТорговаяКомиссия,
		|	РасходыПоСделкеОбороты.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			&МоментСделки,
		|			&МоментИсполнения,
		|			Период,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Сделка = &Сделка
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)) КАК РасходыПоСделкеОбороты";
		
		Запрос.УстановитьПараметр("МоментСделки", НачалоДня(ЭтотОбъект.Основание.Дата));
		Запрос.УстановитьПараметр("МоментИсполнения", КонецДня(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрокаТаблицаКомиссий = ТаблицаКомиссий.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицаКомиссий, ВыборкаДетальныеЗаписи);
			
			НоваяСтрокаТаблицаКомиссий.Валюта = ВалютаТорговойКомиссии;
			НоваяСтрокаТаблицаКомиссий.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии;
			
		КонецЦикла;
		
	Иначе	
		НачислятьКомиссию = Ложь;
		ИспользоватьСчет7616 = Ложь;
		
		ТаблицаКомиссий = Неопределено;
	КонецЕсли;
	
	Если НачислятьКомиссию И ТаблицаКомиссий <> Неопределено Тогда
		Для Каждого СтрокаТаблицыКомиссий Из ТаблицаКомиссий Цикл
			
			Если СтрокаТаблицыКомиссий.ТорговаяКомиссия = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если НачислятьКомиссию Тогда
				
				ОбращаетсяНаОРЦБ = Ложь;
				
				// ТОРГОВАЯ КОМИССИЯ НА 76.16 ИЛИ РАСХОДЫ
				Если ЗначениеЗаполнено(СтрокаТаблицыКомиссий.Валюта) Тогда
					ТорговаяКомиссияВВалютеУчета = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(
						СтрокаТаблицыКомиссий.ТорговаяКомиссия,
						СтрокаТаблицыКомиссий.Валюта,
						ЭтотОбъект.Организация,
						ЭтотОбъект.Дата,
						Отказ);	
				Иначе
					ТорговаяКомиссияВВалютеУчета = СтрокаТаблицыКомиссий.ТорговаяКомиссия;
				КонецЕсли;	
					
				ДанныеАналитики = Новый Структура("Сделка, ВидЗадолженности", ОбъектКомиссииСсылка, Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], ТорговаяКомиссияВВалютеУчета, "Поступление услуг", ДанныеАналитики);
				
				// дебет
				Если ИспользоватьСчет7616 Тогда
				
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоКомиссии;
					
					Проводка.СубконтоДт.Контрагенты = КонтрагентПоКомиссии;
					Проводка.СубконтоДт.Сделка      = Сделка;
					
				ИначеЕсли ВыделятьРасходыПриПродаже Тогда
					
					БухгалтерскийУчет.ЗаполнитьАналитикуРасходов(
						ЭтотОбъект,
						Проводка.СчетДт,
						Проводка.СубконтоДт,
						ПланыСчетов.Основной.ПрочиеРасходы,
						АналитикаУслуг,
						СтрокаТаблицыКомиссий.ЦеннаяБумага,
						ОбращаетсяНаОРЦБ);
						
				Иначе
					
					УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(
						ЭтотОбъект.Дата,
						ЭтотОбъект.Рынок,
						СтрокаТаблицыКомиссий.ЦеннаяБумага);
					
					НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
						ЭтотОбъект.Дата,
						ЭтотОбъект.Организация,
						ЭтотОбъект.СчетДоверительногоУправления,
						УчетныйАктив,
						УчетныйРегистр);		
								
					Если (ВидСделки = Перечисления.ВидыСделок.Покупка И Не НастройкиПоВидуУчета.ВключатьРасходыПоПокупкеВСтоимость) Или (ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы) Тогда
						АналитикаПроводки = АналитикаУслуг;
					Иначе	
						АналитикаПроводки = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;	
					КонецЕсли;
						
					БухгалтерскийУчет.ЗаполнитьАналитикуРасходов(
						ЭтотОбъект,
						Проводка.СчетДт,
						Проводка.СубконтоДт,
						ПланыСчетов.Основной.ПрочиеРасходы,
						АналитикаПроводки,
						СтрокаТаблицыКомиссий.ЦеннаяБумага,
						ОбращаетсяНаОРЦБ);
						
				КонецЕсли;
				
				// кредит
				Проводка.СчетКт = СчетУчетаКомиссии;
				
				Если ЕстьСубконтоКонтрагентыПоКомиссии Тогда
					Проводка.СубконтоКт.Контрагенты = КонтрагентПоКомиссии;
				КонецЕсли;
				
				Если ЕстьСубконтоСделкиПоКомиссии Тогда
					Проводка.СубконтоКт.Сделка = ОбъектКомиссииСсылка;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговорБрокерскогоОбслуживанияПоКомиссии Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = СубконтоДоговорыБрокерскогоОбслуживания;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры
