
&НаСервере
Процедура СкопироватьНастройкиНаСервере(Отчет = Неопределено)

	Расшифровка = Неопределено;	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СкопироватьНастройки(Расшифровка);
	
	Если Расшифровка <> Неопределено Тогда
		Отчет = ОбработкаОбъект.СформироватьОтчетОПроделанныхОперациях(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРегистрНастроекНаСервере(РегистрМД)

	ЭтаФорма.РегистрыНастроек.Добавить(РегистрМД.Имя, РегистрМД.Синоним, Истина);
	
КонецПроцедуры

#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиЦелейРасчета);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧА);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧАПоВидамЗадолженности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаБенчмарков);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаПлановойДоходности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.СоставИНастройкиОтчетов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.ЗначенияДополнительныхСведений);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаСкопироватьНастройки(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСкопироватьНастройки");
	Попытка
		ВыполнитьКопированиеНастроек(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопированиеНастроек(ПараметрыСессии)
	
	Объект.КопируемыеРегистры.Очистить();
	
	Для Каждого РегистрНастроек Из ЭтаФорма.РегистрыНастроек Цикл
		Если РегистрНастроек.Пометка Тогда
			Объект.КопируемыеРегистры.Добавить(РегистрНастроек.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.КопируемыеРегистры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один регистр с настройками", , "РегистрыНастроек");
		ПараметрыСессии.ТекстОшибки = "Не выбран ни один регистр с настройками";
		Возврат;
	ИначеЕсли Не ПроверитьЗаполнение() Тогда
		ПараметрыСессии.ТекстОшибки = "Не заполнены обязательные поля";
		Возврат;
	КонецЕсли;	
	
	Отчет = Неопределено;
	
	СкопироватьНастройкиНаСервере(Отчет);
	
	Если Отчет <> Неопределено Тогда		
		Отчет.Показать("Отчет о скопированных настройках");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОтметкиВсехНастроек(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаУстановитьОтметкиВсехНастроек");
	Попытка
		ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Истина);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметкиВсехНастроек(Команда)

	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаСнятьОтметкиВсехНастроек");
	Попытка
		ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Ложь);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
