
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Период = НачалоДня(НачалоДня(ТекущаяДата()) - 1);
	Объект.Разрядность = 2;
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	НКДРасчетный = РаботаСЦеннымиБумагами.ПолучитьРасчетныйКупон(Объект.Облигация, Объект.Период, Справочники.СчетаДоверительногоУправления.ПустаяСсылка(),, Объект.Разрядность, Неопределено);
	
	Сообщить(НКДРасчетный);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
