
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Настройка = ПланыВидовХарактеристик.НастройкиУчетаЦенныхБумаг.НеВключатьРасходыВСтоимость
			И (НЕ ЗначениеЗаполнено(Запись.Партия) ИЛИ Запись.СтрокаПартии = 0) Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для настройки 'Не включать расходы в стоимость' партия и строка партии должны быть заполнены",,,, Отказ);
		
		КонецЕсли;	
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
