
Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		// если это не недвижимое имущество, то записей в оценке быть не должно
		Если ЭтотОбъект.ВидПрочегоАктива <> Справочники.ВидыПрочихАктивов.НедвижимоеИмущество Тогда
						
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ОценкиСтоимостьИмущества.Имущество
				|ИЗ
				|	РегистрСведений.ОценкиСтоимостьИмущества КАК ОценкиСтоимостьИмущества
				|ГДЕ
				|	ОценкиСтоимостьИмущества.Имущество = &Имущество";
				
			Запрос.УстановитьПараметр("Имущество", ЭтотОбъект.Ссылка);
			
			Если Не Запрос.Выполнить().Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зафиксирована оценка стоимости имущества. Изменение вида прочего актива невозможно", ЭтотОбъект, "ВидПрочегоАктива",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтотОбъект.Обозначение4777 <> СокрЛП(ЭтотОбъект.Обозначение4777) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В поле 'Обозначение для представления в отчетности 4777-У' есть лишние пробелы в начале и(или) в конец текста", ЭтотОбъект, "Обозначение4777",, Отказ);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры
