
&НаКлиенте
Процедура Распределить(Команда)
	
	ЭтаФорма.Закрыть(Новый Структура("ЦеннаяБумага, УчетныйАктивЕПС", ЭтаФорма.ЦеннаяБумага, ЭтаФорма.УчетныйАктивЕПС));
	
КонецПроцедуры

&НаСервере
Процедура ЦеннаяБумагаПриИзмененииНаСервере()
	
	Рынок = Перечисления.РынкиЦенныхБумаг.ПустаяСсылка();
	Если ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.Акции") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.Акции;
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.ВалютныеПары") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.ВалютныеПары;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.Векселя") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.Векселя;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.ПроизводныеФинансовыеИнструменты") Тогда
		
		СвойстваЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтаФорма.ЦеннаяБумага, "ТипПроизводногоФинансовогоИнструмента, ТипБазовогоАктива");
		
		Если СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Фьючерс Тогда
			Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы;	
		ИначеЕсли СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Опцион Тогда
			Рынок = Перечисления.РынкиЦенныхБумаг.Опционы;
		ИначеЕсли СвойстваЦБ.ТипПроизводногоФинансовогоИнструмента = Перечисления.ТипыПроизводныхФинансовыхИнструментов.Спот Тогда
			
			Если СвойстваЦБ.ТипБазовогоАктива = Перечисления.ТипыБазовыхАктивов.ВалютнаяПара Тогда
				Рынок = Перечисления.РынкиЦенныхБумаг.ВалютныеПары;
			ИначеЕсли СвойстваЦБ.ТипБазовогоАктива = Перечисления.ТипыБазовыхАктивов.ДрагоценныйМеталл Тогда
				Рынок = Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы;
			КонецЕсли;

		КонецЕсли;
				
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.Паи;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.ДепозитарныеРасписки") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.Закладные") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.Закладные;	
	ИначеЕсли ТипЗнч(ЭтаФорма.ЦеннаяБумага) = Тип("СправочникСсылка.ИпотечныеСертификатыУчастия") Тогда
		Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия;	
	КонецЕсли;	
	
	ЭтаФорма.УчетныйАктивЕПС = БухгалтерскийУчет.ОпределитьУчетныйАктивЕПС(ТекущаяДата(), Рынок, ЭтаФорма.ЦеннаяБумага);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	ЦеннаяБумагаПриИзмененииНаСервере();
КонецПроцедуры
