
&НаСервереБезКонтекста
Процедура _ОбновитьНумерациюОбъектов()
	
	ОбновитьНумерациюОбъектов();
	
	Сообщить("Нумерация объектов обновлена");
	
КонецПроцедуры // ОбновитьНумерациюОбъектов

&НаКлиентеНаСервереБезКонтекста
Функция ОбъединитьСтрокиТекстовогоДокумента(Текст)
	
	ОбъедСтрока = "";
	
	Для НомСтр = 1 По Текст.КоличествоСтрок() Цикл
		ОбъедСтрока = ОбъедСтрока + Текст.ПолучитьСтроку(НомСтр);
	КонецЦикла;
	
	Возврат ОбъедСтрока;
	
КонецФункции // ОбъединитьСтрокиТекстовогоДокумента

&НаСервере
Процедура ВычислитьВыражениеНаСервере()
	
	Результат = Вычислить(
		ОбъединитьСтрокиТекстовогоДокумента(Объект.Выражение));
	
	Сообщить(Строка(Результат));
	
КонецПроцедуры // ВычислитьВыражениеНаСервере

&НаСервере
Процедура ВыполнитьВыражениеНаСервере()
	
	Выполнить(ОбъединитьСтрокиТекстовогоДокумента(Объект.Выражение));
	
КонецПроцедуры // ВыполнитьВыражениеНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для работы с табло необходимы полные права.",,,, Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Объект.Выражение.КоличествоСтрок() > 0);
	
КонецПроцедуры



&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВыполнить");
	Попытка
		ВыполнитьВыражениеНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры // КомандаВыполнитьВыражение

&НаКлиенте
Процедура КомандаВычислитьНаСервере(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВычислитьНаСервере");
	Попытка
		ВычислитьВыражениеНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры // КомандаВычислитьВыражение

&НаКлиенте
Процедура КомандаВычислитьНаКлиенте(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаВычислитьНаКлиенте");
	Попытка
		ВыполнитьВычислениеНаКлиенте(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВычислениеНаКлиенте(ПараметрыСессии)
	
	Результат = Вычислить(
		ОбъединитьСтрокиТекстовогоДокумента(Объект.Выражение));
		
	Сообщить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьНумерациюОбъектов(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОбновитьНумерациюОбъектов");
	Попытка
		_ОбновитьНумерациюОбъектов();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьНастройкиПользователя(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаОчиститьНастройкиПользователя");
	Попытка
		ВыполнитьОчисткуНастроекПользователя(ПараметрыСессии);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуНастроекПользователя(ПараметрыСессии)
	
	#Если ТолстыйКлиентУправляемоеПриложение	Тогда
		
		СписокВыбора = Новый СписокЗначений;
		
		ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
		Для каждого ПользовательИБ Из ПользователиИБ Цикл
			СписокВыбора.Добавить(ПользовательИБ.Имя);
		КонецЦикла;
		
		ВыбЭлемент = СписокВыбора.ВыбратьЭлемент("Пользователь ИБ");
		Если ВыбЭлемент <> Неопределено Тогда
			ОчиститьНастройкиПользователя(ВыбЭлемент.Значение);
			Сообщить("Настройки пользователя '" + ВыбЭлемент.Значение + "' очищены");
		КонецЕсли;
	    		
	#Иначе
		
		Предупреждение("Необходимо запустить 1С:Предприятие в режиме толстого клиента");
		ДобавитьТекстОшибки(ПараметрыСессии, "Не толстый клиент");
		Возврат;
		
	#КонецЕсли
		
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
