
Функция РассчитатьРезервы(ОбъектРасчета, ТекущаяСЧА = Неопределено) Экспорт

	ПараметрыРасчета = Новый Структура;
	
	ПараметрыРасчета.Вставить("Организация",					ОбъектРасчета.Организация);	
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ОбъектРасчета.СчетДоверительногоУправления);	
	ПараметрыРасчета.Вставить("ПаевойИнвестиционныйФонд",		ОбъектРасчета.ПаевойИнвестиционныйФонд);	
	ПараметрыРасчета.Вставить("Дата",							ОбъектРасчета.Дата);
	ПараметрыРасчета.Вставить("ТекущаяСЧА",						ПолучитьРасчетнуюСЧА(ОбъектРасчета, ТекущаяСЧА));
	ПараметрыРасчета.Вставить("Ссылка",							ОбъектРасчета.Ссылка);
	
	РасшифровкаРасчета = Неопределено;  
	Если ТипЗнч(ОбъектРасчета) = Тип("Структура") Тогда
		ОбъектРасчета.Свойство("РасшифровкаРасчета", РасшифровкаРасчета);
	КонецЕсли;
	
	ПакетДанныхРасчета = Справочники.БазыРасчета.РассчитатьРезервПИФПоБазеРасчета(ПараметрыРасчета, , РасшифровкаРасчета);
	
	Если ПакетДанныхРасчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПакетДанныхРасчета.Свойство("СЧАРасчетная") И ТипЗнч(ОбъектРасчета) <> Тип("Структура") Тогда 
		ОбъектРасчета.ДополнительныеСвойства.Вставить("СЧАРасчетная", ПакетДанныхРасчета.СЧАРасчетная);	
	КонецЕсли;
	
	Резервы = Новый Структура("СуммаНаВознаграждениеУправляющего, СуммаНаУслугиДепозитария, СуммаНаПрочиеРасходы", 
		ПакетДанныхРасчета.СуммаЗаВознаграждениеУправляющего, 
		ПакетДанныхРасчета.СуммаЗаВознаграждениеДепозитария, 
		ПакетДанныхРасчета.СуммаЗаПрочиеВозмещаемыеРасходыУправляющего) ;
	
	Возврат Резервы;
	
КонецФункции

Функция ПолучитьРасчетнуюСЧА(ОбъектРасчета, ТекущаяСЧА)
	
	ПредварительнаяСЧА = Неопределено;
	
	Если НачалоДня(ОбъектРасчета.Дата) = '20171229' И Не ОбъектРасчета.Организация.Код = "000000003" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = &Период
			|	И ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СубъектАналитики
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)";
		
		Запрос.УстановитьПараметр("Организация", 		ОбъектРасчета.Организация);
		Запрос.УстановитьПараметр("Период", 			НачалоДня(ОбъектРасчета.Дата));
		Запрос.УстановитьПараметр("СубъектАналитики", 	ОбъектРасчета.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПредварительнаяСЧА = Выборка.Значение;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСЧА) Или ТекущаяСЧА = 0 Тогда 
		// Это заполнение документа
		ПредварительнаяСЧА = ТекущаяСЧА;
	Иначе
		ПредварительнаяСЧА = Документы.РегистрацияСтоимостиАктивов.ПолучитьПредварительнуюСЧА(ОбъектРасчета);
	КонецЕсли;
	
	Если ПредварительнаяСЧА = Неопределено Тогда
		ВызватьИсключение "Не определено значение СЧА на " + Формат(ОбъектРасчета.Дата, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат ПредварительнаяСЧА;
	КонецЕсли;
		
КонецФункции

