&НаСервере
Функция ПолучитьЭСП(Депозит)
	
	Возврат Справочники.ДепозитныеВклады.ПолучитьДоходностьИДюрацию(Депозит);

КонецФункции

&НаКлиенте
Процедура РасчетЭСП(Команда)
	
	ЭтаФорма.ЭСП = ПолучитьЭСП(ЭтаФорма.Депозит).Доходность;
	
КонецПроцедуры

&НаСервере
Функция РасчитатьСтоимость(ДепозитныйВклад, ЭСП, ДатаРасчета)
	
	ЭтаФорма.ДанныеРасчета.Очистить();
	
	РасчетнаяСтоимость = 0;
	
	Для каждого СтрокаТаблицыПлатежей Из ДепозитныйВклад.ПлановыеВыплаты Цикл
		
		Если СтрокаТаблицыПлатежей.Период < ДатаРасчета Тогда
			Продолжить;
		КонецЕсли; 
		
		КолДней = (НачалоДня(СтрокаТаблицыПлатежей.Период) - НачалоДня(ДатаРасчета)) / 86400;
		
		ДПоток = СтрокаТаблицыПлатежей.Сумма / Pow(1 + ЭСП / 100, КолДней / 365) ;
		
		РасчетнаяСтоимость = РасчетнаяСтоимость + ДПоток;
		
		СтрокаДанныеРасчета = ЭтаФорма.ДанныеРасчета.Добавить();
		СтрокаДанныеРасчета.Дата = СтрокаТаблицыПлатежей.Период;
		СтрокаДанныеРасчета.Поток = СтрокаТаблицыПлатежей.Сумма;
		СтрокаДанныеРасчета.ДПоток = ДПоток;
		СтрокаДанныеРасчета.Дней = КолДней;
		
	КонецЦикла;
	
	Возврат РасчетнаяСтоимость;

КонецФункции

&НаКлиенте
Процедура РасчетСтоимости(Команда)
	
	ЭтаФорма.Стоимость = РасчитатьСтоимость(ЭтаФорма.Депозит, ЭтаФорма.ЭСП, ЭтаФорма.ДатаРасчета);
	
КонецПроцедуры


&НаСервере
Процедура ДанныеДепозитаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ЭффективнаяСтавкаПроцента КАК ЭффективнаяСтавкаПроцента
		|ИЗ
		|	РегистрСведений.РасчетныеПоказателиДепозитногоВклада.СрезПоследних(&Период, ДепозитныйВклад = &ДепозитныйВклад) КАК РасчетныеПоказателиДепозитногоВкладаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДепозитныйВклад", ЭтаФорма.Депозит);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтаФорма.ЭСП = ВыборкаДетальныеЗаписи.ЭффективнаяСтавкаПроцента;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДепозита(Команда)
	ДанныеДепозитаНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

