&НаСервере
Функция ПолучитьЭСП(Депозит)
	
	Возврат Справочники.ДепозитныеВклады.ПолучитьДоходностьИДюрацию(Депозит);

КонецФункции

&НаКлиенте
Процедура РасчетЭСП(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("РасчетЭСП");
	Попытка
		ЭтаФорма.ЭСП = ПолучитьЭСП(ЭтаФорма.Депозит).Доходность;
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры

&НаСервере
Функция РасчитатьСтоимость(ДепозитныйВклад, ЭСП, ДатаРасчета)
	
	ЭтаФорма.ДанныеРасчета.Очистить();
	
	РасчетнаяСтоимость = 0;
	
	Для каждого СтрокаТаблицыПлатежей Из ДепозитныйВклад.ПлановыеВыплаты Цикл
		
		Если СтрокаТаблицыПлатежей.Период < ДатаРасчета Тогда
			Продолжить;
		КонецЕсли; 
		
		КолДней = (НачалоДня(СтрокаТаблицыПлатежей.Период) - НачалоДня(ДатаРасчета)) / 86400;
		
		ДПоток = СтрокаТаблицыПлатежей.Сумма / Pow(1 + ЭСП / 100, КолДней / 365) ;
		
		РасчетнаяСтоимость = РасчетнаяСтоимость + ДПоток;
		
		СтрокаДанныеРасчета = ЭтаФорма.ДанныеРасчета.Добавить();
		СтрокаДанныеРасчета.Дата = СтрокаТаблицыПлатежей.Период;
		СтрокаДанныеРасчета.Поток = СтрокаТаблицыПлатежей.Сумма;
		СтрокаДанныеРасчета.ДПоток = ДПоток;
		СтрокаДанныеРасчета.Дней = КолДней;
		
	КонецЦикла;
	
	Возврат РасчетнаяСтоимость;

КонецФункции

&НаКлиенте
Процедура РасчетСтоимости(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("РасчетСтоимости");
	Попытка
		ЭтаФорма.Стоимость = РасчитатьСтоимость(ЭтаФорма.Депозит, ЭтаФорма.ЭСП, ЭтаФорма.ДатаРасчета);
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры


&НаСервере
Процедура ДанныеДепозитаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ЭффективнаяСтавкаПроцента КАК ЭффективнаяСтавкаПроцента
		|ИЗ
		|	РегистрСведений.РасчетныеПоказателиДепозитногоВклада.СрезПоследних(&Период, ДепозитныйВклад = &ДепозитныйВклад) КАК РасчетныеПоказателиДепозитногоВкладаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДепозитныйВклад", ЭтаФорма.Депозит);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтаФорма.ЭСП = ВыборкаДетальныеЗаписи.ЭффективнаяСтавкаПроцента;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДепозита(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("ДанныеДепозита");
	Попытка
		ДанныеДепозитаНаСервере();
	Исключение
		ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки)

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

