
Функция ПолучитьТипЗадолженностиПоВидуДвижения(ВидДвижения) Экспорт
	
	Если      ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская");
	ИначеЕсли ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции // ПолучитьТипЗадолженностиПоВидуДвижения

Функция ПолучитьВидДвиженияПоТипуЗадолженности(ТипЗадолженности) Экспорт
	
	Если      ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход");
	ИначеЕсли ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ВидыДвижений.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции // ПолучитьВидДвиженияПоТипуЗадолженности

Функция ПолучитьЧастьСделкиРЕПОПоВидуЗадолженности(ВидЗадолженности) Экспорт

	Если      ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО") Тогда
		Возврат 1;
	ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО") Тогда
		Возврат 2;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьЧастьСделкиРЕПОПоВидуЗадолженности

Функция ПолучитьВидДвиженияНакопленияПоВидуДвижения(ВидДвижения) Экспорт
	
	Если      ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход") Тогда
		Возврат ВидДвиженияНакопления.Приход;
	ИначеЕсли ВидДвижения = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход") Тогда
		Возврат ВидДвиженияНакопления.Расход;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции // ПолучитьВидДвиженияНакопленияПоВидуДвижения
