
Процедура ИмпортироватьКотировки(Организация = Неопределено, АдресМассива = Неопределено, Период = Неопределено, ТолькоОтсутствующие = Ложь, ЦеннаяБумага = Неопределено, ПолучателиОповещенийОПогашенныхБумагах = "") Экспорт
	
	Ошибки = Неопределено;
	ИнтерактивныйЗапуск = (Организация = Неопределено);
	
	Если Не ИнтерактивныйЗапуск Тогда
		
		ЗаполнитьПараметры(Организация, АдресМассива, Период, Ошибки);
		Если АдресМассива = Неопределено Тогда
			ОповеститьОбОшибках(Ошибки, ИнтерактивныйЗапуск);
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ДанныеДляСбораСтатистики = Новый Структура("Организация, Период, ЦеннаяБумага, ИмпортТолькоОтсутствующихКотировок, ИнтерактивныйЗапуск",
								Организация, Период, ЦеннаяБумага, ТолькоОтсутствующие, (Организация = Неопределено));
	
	// Открываем сессию
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ДанныеДляСбораСтатистики);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "(ИмпортироватьКотировки)";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	// Получаем файлы
	МассивДвоичныхДанных = ПолучитьИзВременногоХранилища(АдресМассива);
	
	ФайлыДляОбработки = Новый Массив;
	
	Для Каждого ДвоичныеДанные Из МассивДвоичныхДанных Цикл
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ФайлыДляОбработки.Добавить(ИмяВременногоФайла);
		
	КонецЦикла;
	
	// Котировки Bloomberg
	Для Каждого ИмяВременногоФайла Из ФайлыДляОбработки Цикл
		
		ТаблицаКотировок = ПолучитьТаблицуКотировокБлумберг_012018(
			ИмяВременногоФайла, ЦеннаяБумага, ТолькоОтсутствующие, Период, Ошибки, ПолучателиОповещенийОПогашенныхБумагах);
		
		Если ТаблицаКотировок = Неопределено Или ТаблицаКотировок.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные для загрузки. Возможно, в файле отсутсвуют записи"
				+ ?(ЗначениеЗаполнено(ЦеннаяБумага), " по ценной бумаге [" + ЦеннаяБумага + "]." ,"."));
		Иначе
			ЗагрузитьКотировкиБлумбергИзТаблицы_012018(ТаблицаКотировок, "КотировкиЦенныхБумаг" , ЦеннаяБумага, ТолькоОтсутствующие, Период);
			ЗагрузитьКотировкиБлумбергИзТаблицы_012018(ТаблицаКотировок, "КотировкиТорговыхПлощадок", ЦеннаяБумага, ТолькоОтсутствующие, Период);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загружен файл с котировками Блумберг");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЦеннаяБумага = Неопределено Тогда // При отборе по бумаге исключил загрузку индексов
		
		// Индексы Bloomberg
		Для Каждого ИмяВременногоФайла Из ФайлыДляОбработки Цикл
			
			ЗначенияИндексов = РегистрыСведений.ЗначенияБиржевыхИндексов.ПолучитьСтруктуруТаблицыИндексов();
			
			БиржаИндексов = ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg");
			
			ЗаполнитьТаблицуИндексовБлумберг(ЗначенияИндексов, ИмяВременногоФайла, БиржаИндексов, Период);
			
			Если ЗначенияИндексов.Количество() <> 0 Тогда
				ЗагрузитьИндексыБлумбергИзТаблицы(ЗначенияИндексов, БиржаИндексов, ТолькоОтсутствующие, Период);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загружен файл с индексами Блумберг");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ИмяВременногоФайла Из ФайлыДляОбработки Цикл
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЦикла;
	
	ОповеститьОбОшибках(Ошибки, ИнтерактивныйЗапуск);
	
	// Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ЗаполнитьПараметры(Организация, АдресМассива, Период, Ошибки)
	
	// Котировки за последний рабочий день / предпраздничный появляются на следующий рабочий (торговый) день.
	// Следовательно, выполнять автозагрузку или контроль наличия котировок в выходной день бессмыслено.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата = &ТекущаяДата
		|	И ДанныеКалендаря.Календарь В (&КалендарьКотировок, ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
	Запрос.УстановитьПараметр("ТекущаяДата"       , НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КалендарьКотировок", ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"));

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|ГДЕ
			|	ДанныеКалендаря.Дата < &ТекущаяДата
			|	И ДанныеКалендаря.Календарь В (&КалендарьКотировок, ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
			|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
		Запрос.УстановитьПараметр("ТекущаяДата"       , НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("КалендарьКотировок", ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"));
		
		Выборка = Запрос.Выполнить().Выбрать();
	
		Пока Выборка.Следующий() Цикл
			Период = Новый СтандартныйПериод(НачалоДня(Выборка.Дата), КонецДня(Выборка.Дата));
		КонецЦикла;
	
	КонецЕсли;

	КаталогЗагрузкиКотировок = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(Неопределено, "ВнешниеОбработки._ИмпортПрочихКотировок.КаталогФайловКотировок", Организация);
	Если КаталогЗагрузкиКотировок = Неопределено Тогда 
		ЗарегистрироватьОшибку(Ошибки, "Для организации """ + Организация + """ не задан каталог загрузки котировок!");
	Иначе
		
		Файл = Новый Файл(КаталогЗагрузкиКотировок + Формат(Период.ДатаОкончания, "ДФ=ddMMyy") + " NEW.xlsx");
		Если Файл.Существует() Тогда
			
			ФайлыДляОбработки = Новый Массив;
 			ФайлыДляОбработки.Добавить(Новый ДвоичныеДанные(Файл.ПолноеИмя));
			АдресМассива = ПоместитьВоВременноеХранилище(ФайлыДляОбработки, Новый УникальныйИдентификатор);
			
		Иначе
			ТекстСообщения = "В заданом каталоге нет файлов с котировками Блумберг (формат 01.2018) за " + Строка(Период) + "!";
			ЗарегистрироватьОшибку(Ошибки, ТекстСообщения);
			РеквизитыОповещения = Новый Структура("Текст", ТекстСообщения);
			Справочники.Оповещения.СформироватьОповещения("Обработка.ИмпортКотировокБлумберг.ИмпортироватьКотировки()", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики(СтруктураДанныхДляСтатистики)
		
	Описание = "";
	
	Для Каждого Свойство Из СтруктураДанныхДляСтатистики Цикл
	
		Описание = Описание + Символы.ПС + Свойство.Ключ + ": " + Свойство.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(СтруктураДанныхДляСтатистики, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

#Область Котировки_Блумберг

Функция ПолучитьТаблицуКотировокБлумберг_012018(ИмяФайлаXLSX, ЦеннаяБумага, ТолькоОтсутствующие, Период, Ошибки, ПолучателиОповещенийОПогашенныхБумагах = "")
	
	ОтборПоБумагеКодISIN = Неопределено;
	БиржаБлумберг = ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg");
	
	КотировкиБлумберг = Новый ТаблицаЗначений;
	КотировкиБлумберг.Колонки.Добавить("Биржа"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Измерения.Биржа.Тип);
	КотировкиБлумберг.Колонки.Добавить("ISIN"			, Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	КотировкиБлумберг.Колонки.Добавить("Период"			, Новый ОписаниеТипов("Дата"));
	КотировкиБлумберг.Колонки.Добавить("BID"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.BID.Тип);
	КотировкиБлумберг.Колонки.Добавить("HIGH"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.HIGH.Тип);
	КотировкиБлумберг.Колонки.Добавить("LOW"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.LOW.Тип);
	КотировкиБлумберг.Колонки.Добавить("CLOSE"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.CLOSE.Тип);
	КотировкиБлумберг.Колонки.Добавить("LEGALCLOSEPRICE", Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.LEGALCLOSEPRICE.Тип);
	КотировкиБлумберг.Колонки.Добавить("WAPRICE"		, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.WAPRICE.Тип);	
	КотировкиБлумберг.Колонки.Добавить("ACCINT"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.ACCINT.Тип);		
	КотировкиБлумберг.Колонки.Добавить("OFFER"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.OFFER.Тип);
	КотировкиБлумберг.Колонки.Добавить("VOLUME"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.VOLUME.Тип);
	КотировкиБлумберг.Колонки.Добавить("VALUE"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.VALUE.Тип);
	КотировкиБлумберг.Колонки.Добавить("NUMTRADES"		, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.NUMTRADES.Тип);
	КотировкиБлумберг.Колонки.Добавить("Валюта"			, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.Валюта.Тип);
	КотировкиБлумберг.Колонки.Добавить("ADMITTEDQUOTE"	, Метаданные.РегистрыСведений.КотировкиТорговыхПлощадок.Ресурсы.ADMITTEDQUOTE.Тип);
	КотировкиБлумберг.Колонки.Добавить("TradingMode"	, Метаданные.Справочники.РежимыБиржевыхТоргов.СтандартныеРеквизиты.Код.Тип);
	КотировкиБлумберг.Колонки.Добавить("ПустаяЗапись"	, Новый ОписаниеТипов("Булево"));

	// Загружаемые биржы
	ДругиеБиржи = Новый Массив;
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_NYSE"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_NYSE_Arca"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_HKEX"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_FWB"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_LSE"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_Euronext_Paris"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_Euronext_Lisbon"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_Euronext_Brussels"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_Euronext_Amsterdam"));
	ДругиеБиржи.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_Euronext_London"));
	
	Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КодыВТорговыхСистемахСрезПоследних.Код КАК Код
			|ИЗ
			|	РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
			|			&Период,
			|			Объект = &ЦеннаяБумага
			|				И ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних";
		Запрос.УстановитьПараметр("Период",       Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОтборПоБумагеКодISIN = Выборка.Код;	
		Иначе
			ЗарегистрироватьОшибку(Ошибки, "В регистре [Коды в торговых системах] не найден код ISIN для бумаги [" + ЦеннаяБумага + "].");
			Возврат Неопределено;	
		КонецЕсли;
		
	КонецЕсли;
		
	// Читаем файл
	Таблица = Новый ТабличныйДокумент;
	Таблица.Прочитать(ИмяФайлаXLSX, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	СдвигКолонкиВалюта = ?(НРег(СокрЛП(ПолучитьЗначениеЯчейки(Таблица.Область(1, 5, 1, 5)))) = "валюта", 1, 0);
	
	НомСтр = 1;
	Пока НомСтр < 10000 Цикл // защита от зацикливания
		
		НомСтр = НомСтр + 1;
		
		ISIN = СокрЛП(ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 1, НомСтр, 1)));
		
		Если ISIN = "" ИЛИ ВРег(ISIN) = "ISIN" Тогда
			Прервать;
		ИначеЕсли ЗначениеЗаполнено(ЦеннаяБумага) И ISIN <> ОтборПоБумагеКодISIN Тогда 
			Продолжить;
		КонецЕсли;
		
		ДатаКотировки = Дата(УдалитьСпецСимволы(ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 3, НомСтр, 3))));
		
		Если ДатаКотировки < НачалоДня(Период.ДатаНачала) ИЛИ ДатаКотировки > Период.ДатаОкончания Тогда
			Продолжить;
		КонецЕсли;
		
		//Другие биржы
		ЭтоETF = Ложь;
		
		Для н = 1 По ДругиеБиржи.Количество() Цикл
			
			ДругаяБиржа = ДругиеБиржи[н-1];
			
			Если Не ЗначениеЗаполнено(ДругаяБиржа) Тогда
				Продолжить;
			КонецЕсли;
			
			Сдвиг = СдвигКолонкиВалюта + 13 + (н - 1) * 8;
			
			КодВалюты = ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 8, НомСтр, Сдвиг + 8));
			
			Если Не ПустаяСтрока(КодВалюты) И Найти(КодВалюты, "#") = 0 Тогда
				// Если валюта не определена, то котировку не грузим
				Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалюты, Истина);
				
				Если Не ЗначениеЗаполнено(Валюта) Тогда
					ЗарегистрироватьОшибку(Ошибки, "Не удалось определить валюту по коду """ + КодВалюты + """");
					Продолжить;		
				КонецЕсли;				
				
				ЭтоETF = Истина;
				
				Котировка = КотировкиБлумберг.Добавить();
				Котировка.Биржа				= ДругаяБиржа;
				Котировка.ISIN				= ISIN;
				Котировка.Период			= ДатаКотировки;		
				Котировка.LEGALCLOSEPRICE	= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 1, НомСтр, Сдвиг + 1));
				Котировка.BID				= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 2, НомСтр, Сдвиг + 2));
				Котировка.HIGH				= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 3, НомСтр, Сдвиг + 3));
				Котировка.LOW				= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 4, НомСтр, Сдвиг + 4));
				Котировка.VOLUME			= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 5, НомСтр, Сдвиг + 5));
				Котировка.VALUE				= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 6, НомСтр, Сдвиг + 6));
				Котировка.NUMTRADES			= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, Сдвиг + 7, НомСтр, Сдвиг + 7));
				Котировка.Валюта			= Валюта;
				
				Если Не ЗначениеЗаполнено(Котировка.LEGALCLOSEPRICE) И Не ЗначениеЗаполнено(Котировка.BID) И Не ЗначениеЗаполнено(Котировка.HIGH)
					И Не ЗначениеЗаполнено(Котировка.LOW) И Не ЗначениеЗаполнено(Котировка.VOLUME) И Не ЗначениеЗаполнено(Котировка.VALUE) И Не ЗначениеЗаполнено(Котировка.NUMTRADES) Тогда
					
					Котировка.ПустаяЗапись = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ	ЭтоETF Тогда

			// С 31.07.2021 точность котировки купона повысили до 6 знаков, до этого была 4						
			ТочностьКотировкиКупона = ?(ДатаКотировки < '20210731', 4, КотировкиБлумберг.Колонки.ACCINT.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти);
						
			ACCINT     = ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 9, НомСтр, СдвигКолонкиВалюта + 9), ТочностьКотировкиКупона);
						
			CLOSE_BVAL = ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 13, НомСтр, СдвигКолонкиВалюта + 13));
			
			// Блумберг 
			Котировка = КотировкиБлумберг.Добавить();
			Котировка.Биржа			= БиржаБлумберг;
			Котировка.ISIN			= ISIN;
			Котировка.Период		= ДатаКотировки;		
			Котировка.BID			= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 11, НомСтр, СдвигКолонкиВалюта + 11));
			Котировка.CLOSE			= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 5 , НомСтр, СдвигКолонкиВалюта + 5));
			Котировка.WAPRICE		= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 10, НомСтр, СдвигКолонкиВалюта + 10));
			Котировка.OFFER			= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 12, НомСтр, СдвигКолонкиВалюта + 12));
			Котировка.ACCINT		= ACCINT;
			Котировка.ADMITTEDQUOTE	= CLOSE_BVAL;
			Котировка.TradingMode	= "BGN";
			
			Если Не ЗначениеЗаполнено(Котировка.BID) И Не ЗначениеЗаполнено(Котировка.CLOSE) И Не ЗначениеЗаполнено(Котировка.WAPRICE)
				И Не ЗначениеЗаполнено(Котировка.ACCINT) И Не ЗначениеЗаполнено(Котировка.OFFER) И Не ЗначениеЗаполнено(Котировка.ADMITTEDQUOTE) Тогда
				
				Котировка.ПустаяЗапись = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(CLOSE_BVAL) Тогда
				
				Котировка = КотировкиБлумберг.Добавить();
				Котировка.Биржа			= БиржаБлумберг;
				Котировка.ISIN			= ISIN;
				Котировка.Период		= ДатаКотировки;		
				Котировка.CLOSE			= CLOSE_BVAL;
				Котировка.ACCINT		= ACCINT;
				Котировка.TradingMode	= "BVAL";
				
				Если НЕ ЗначениеЗаполнено(Котировка.CLOSE) Тогда
					КотировкиБлумберг.Удалить(Котировка);
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;		
		
	КонецЦикла;
	
	Если КотировкиБлумберг.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	// Режим торгов Блумберга
	РежимТорговBGN = Справочники.РежимыБиржевыхТоргов.НайтиПоКоду("BGN");
	
	Если РежимТорговBGN.Пустая() Тогда
		
		РежимТоргов = Справочники.РежимыБиржевыхТоргов.СоздатьЭлемент();
		РежимТоргов.Биржа 						= БиржаБлумберг;
		РежимТоргов.Код 						= "BGN";
		РежимТоргов.Наименование				= "BGN";
		РежимТоргов.НаименованиеРежимаТоргов	= "Bloomberg BGN";
		РежимТоргов.Записать();
		
		// сообщим о новом режиме
		ЗарегистрироватьОшибку(Ошибки, "Создан новый режим биржевых торгов с кодом BGN. Настройте реквизиты справочника");
		
	КонецЕсли;
	
	// Получаем режимы торгов других бирж
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Котировки.Биржа КАК Биржа
		|ПОМЕСТИТЬ _ДругиеБиржи
		|ИЗ
		|	&Котировки КАК Котировки
		|ГДЕ
		|	Котировки.Биржа <> &БиржаБлумберг
		|	И Котировки.TradingMode = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДругиеБиржи.Биржа КАК Биржа,
		|	МАКСИМУМ(РежимыБиржевыхТоргов.Ссылка) КАК РежимТоргов
		|ИЗ
		|	_ДругиеБиржи КАК _ДругиеБиржи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|		ПО (РежимыБиржевыхТоргов.Биржа = _ДругиеБиржи.Биржа)
		|			И (НЕ РежимыБиржевыхТоргов.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДругиеБиржи.Биржа";
	
	Запрос.УстановитьПараметр("Котировки"    , КотировкиБлумберг);
	Запрос.УстановитьПараметр("БиржаБлумберг", БиржаБлумберг);
	
	РежимыТорговПоУмолчанию = Запрос.Выполнить().Выгрузить();
	
	Для Каждого РежимТорговПоУмолчанию Из РежимыТорговПоУмолчанию Цикл
		
		Если Не ЗначениеЗаполнено(РежимТорговПоУмолчанию.РежимТоргов) Тогда
			
			РежимТоргов = Справочники.РежимыБиржевыхТоргов.СоздатьЭлемент();
			РежимТоргов.Биржа                    = РежимТорговПоУмолчанию.Биржа;
			РежимТоргов.Наименование             = "Основной " + Строка(РежимТорговПоУмолчанию.Биржа);
			РежимТоргов.НаименованиеРежимаТоргов = РежимТоргов.Наименование;
			РежимТоргов.ОсновнойРежим            = Истина;
			
			РежимТоргов.УстановитьНовыйКод("Основной");
			РежимТоргов.Записать();
			
			РежимТорговПоУмолчанию.РежимТоргов = РежимТоргов.Ссылка;
			
			// сообщим о новом режиме
			ЗарегистрироватьОшибку(Ошибки, "Создан новый режим биржевых торгов """ + РежимТоргов.Наименование + """. Настройте реквизиты справочника");					
		КонецЕсли;
		
	КонецЦикла;
	
	// Данные для записи в регистр
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Котировки.Биржа КАК Биржа,
		|	Котировки.ISIN КАК ISIN,
		|	Котировки.Период КАК Период,
		|	Котировки.BID КАК BID,
		|	Котировки.HIGH КАК HIGH,
		|	Котировки.LOW КАК LOW,
		|	Котировки.CLOSE КАК CLOSE,
		|	Котировки.LEGALCLOSEPRICE КАК LEGALCLOSEPRICE,
		|	Котировки.WAPRICE КАК WAPRICE,
		|	Котировки.ACCINT КАК ACCINT,
		|	Котировки.OFFER КАК OFFER,
		|	Котировки.VOLUME КАК VOLUME,
		|	Котировки.VALUE КАК VALUE,
		|	Котировки.NUMTRADES КАК NUMTRADES,
		|	Котировки.Валюта КАК Валюта,
		|	Котировки.ADMITTEDQUOTE КАК ADMITTEDQUOTE,
		|	Котировки.TradingMode КАК TradingMode,
		|	Котировки.ПустаяЗапись КАК ПустаяЗапись
		|ПОМЕСТИТЬ _Котировки
		|ИЗ
		|	&Котировки КАК Котировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыТорговПоУмолчанию.Биржа КАК Биржа,
		|	РежимыТорговПоУмолчанию.РежимТоргов КАК РежимТоргов
		|ПОМЕСТИТЬ _РежимыТорговПоУмолчанию
		|ИЗ
		|	&РежимыТорговПоУмолчанию КАК РежимыТорговПоУмолчанию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Котировки.Биржа КАК Биржа,
		|	_Котировки.ISIN КАК ISIN,
		|	_Котировки.Период КАК Период,
		|	_Котировки.BID КАК BID,
		|	_Котировки.HIGH КАК HIGH,
		|	_Котировки.LOW КАК LOW,
		|	_Котировки.CLOSE КАК CLOSE,
		|	_Котировки.LEGALCLOSEPRICE КАК LEGALCLOSEPRICE,
		|	_Котировки.WAPRICE КАК WAPRICE,
		|	_Котировки.ACCINT КАК ACCINT,
		|	_Котировки.OFFER КАК OFFER,
		|	_Котировки.VOLUME КАК VOLUME,
		|	_Котировки.VALUE КАК VALUE,
		|	_Котировки.NUMTRADES КАК NUMTRADES,
		|	_Котировки.ADMITTEDQUOTE КАК ADMITTEDQUOTE,
		|	_Котировки.TradingMode КАК TradingMode,
		|	_Котировки.ПустаяЗапись КАК ПустаяЗапись,
		|	ВЫБОР
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Акции
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Облигации
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.Паи
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|		КОГДА КодыВТорговыхСистемахСрезПоследних.Объект ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ПустаяСсылка)
		|	КОНЕЦ КАК Рынок,
		|	ВЫБОР
		|		КОГДА _Котировки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА КодыВТорговыхСистемахСрезПоследних.Объект.ВалютаНоминала
		|		ИНАЧЕ _Котировки.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ЕСТЬNULL(РежимыБиржевыхТоргов.Ссылка, _РежимыТорговПоУмолчанию.РежимТоргов) КАК РежимТоргов,
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	""Обработка.ИмпортКотировокБлумберг"" КАК Источник
		|ПОМЕСТИТЬ _КотировкиСДанными1С
		|ИЗ
		|	_Котировки КАК _Котировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _Котировки.ISIN = КодыВТорговыхСистемахСрезПоследних.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|		ПО (РежимыБиржевыхТоргов.Код = _Котировки.TradingMode)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РежимыТорговПоУмолчанию КАК _РежимыТорговПоУмолчанию
		|		ПО (_РежимыТорговПоУмолчанию.Биржа = _Котировки.Биржа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КотировкиСДанными1С.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_КотировкиСДанными1С.ISIN КАК ISIN,
		|	ВЫРАЗИТЬ(_КотировкиСДанными1С.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения КАК ДатаПогашения,
		|	_КотировкиСДанными1С.ПустаяЗапись КАК ПустаяЗапись
		|ПОМЕСТИТЬ _ОшибкиИмпортаКотировок
		|ИЗ
		|	_КотировкиСДанными1С КАК _КотировкиСДанными1С
		|ГДЕ
		|	_КотировкиСДанными1С.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|	И НЕ ВЫРАЗИТЬ(_КотировкиСДанными1С.ЦеннаяБумага КАК Справочник.Облигации).Бессрочная
		|	И _КотировкиСДанными1С.Период > ВЫРАЗИТЬ(_КотировкиСДанными1С.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_КотировкиСДанными1С.Биржа КАК Биржа,
		|	_КотировкиСДанными1С.ISIN КАК ISIN,
		|	_КотировкиСДанными1С.Период КАК Период,
		|	_КотировкиСДанными1С.BID КАК BID,
		|	_КотировкиСДанными1С.HIGH КАК HIGH,
		|	_КотировкиСДанными1С.LOW КАК LOW,
		|	_КотировкиСДанными1С.CLOSE КАК CLOSE,
		|	_КотировкиСДанными1С.LEGALCLOSEPRICE КАК LEGALCLOSEPRICE,
		|	_КотировкиСДанными1С.WAPRICE КАК WAPRICE,
		|	_КотировкиСДанными1С.ACCINT КАК ACCINT,
		|	_КотировкиСДанными1С.OFFER КАК OFFER,
		|	_КотировкиСДанными1С.VOLUME КАК VOLUME,
		|	_КотировкиСДанными1С.VALUE КАК VALUE,
		|	_КотировкиСДанными1С.NUMTRADES КАК NUMTRADES,
		|	_КотировкиСДанными1С.ADMITTEDQUOTE КАК ADMITTEDQUOTE,
		|	_КотировкиСДанными1С.ПустаяЗапись КАК ПустаяЗапись,
		|	_КотировкиСДанными1С.Рынок КАК Рынок,
		|	_КотировкиСДанными1С.Валюта КАК Валюта,
		|	_КотировкиСДанными1С.РежимТоргов КАК РежимТоргов,
		|	_КотировкиСДанными1С.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_КотировкиСДанными1С.Источник КАК Источник,
		|	КотировкиТорговыхПлощадок.ЦеннаяБумага ЕСТЬ NULL
		|		ИЛИ НЕ &ТолькоОтсутствующие КАК КотировкиТорговыхПлощадок,
		|	_КотировкиСДанными1С.РежимТоргов <> &Режим_BVAL
		|		И (КотировкиЦенныхБумаг.ЦеннаяБумага ЕСТЬ NULL
		|			ИЛИ НЕ &ТолькоОтсутствующие) КАК КотировкиЦенныхБумаг
		|ИЗ
		|	_КотировкиСДанными1С КАК _КотировкиСДанными1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиЦенныхБумаг КАК КотировкиЦенныхБумаг
		|		ПО _КотировкиСДанными1С.Период = КотировкиЦенныхБумаг.Период
		|			И _КотировкиСДанными1С.ЦеннаяБумага = КотировкиЦенныхБумаг.ЦеннаяБумага
		|			И _КотировкиСДанными1С.Рынок = КотировкиЦенныхБумаг.Рынок
		|			И _КотировкиСДанными1С.Биржа = КотировкиЦенныхБумаг.Биржа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО _КотировкиСДанными1С.Период = КотировкиТорговыхПлощадок.Период
		|			И _КотировкиСДанными1С.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И _КотировкиСДанными1С.Рынок = КотировкиТорговыхПлощадок.Рынок
		|			И _КотировкиСДанными1С.Биржа = КотировкиТорговыхПлощадок.Биржа
		|			И _КотировкиСДанными1С.РежимТоргов = КотировкиТорговыхПлощадок.РежимТоргов
		|ГДЕ
		|	НЕ _КотировкиСДанными1С.ПустаяЗапись
		|	И (НЕ _КотировкиСДанными1С.Рынок ЕСТЬ NULL
		|			ИЛИ _КотировкиСДанными1С.Рынок <> ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ПустаяСсылка))";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Котировки"              , КотировкиБлумберг);
	Запрос.УстановитьПараметр("РежимыТорговПоУмолчанию", РежимыТорговПоУмолчанию);
	Запрос.УстановитьПараметр("Период"                 , Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Режим_BVAL"             , ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg_BVAL"));
	Запрос.УстановитьПараметр("ТолькоОтсутствующие"    , ТолькоОтсутствующие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОшибокИмпорта = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиИмпортаКотировок"].ПолучитьДанные().Выбрать();
	
	ТекстСообщения = "";
	
	Пока ВыборкаОшибокИмпорта.Следующий() Цикл
		
		ТекстОшибки = "В файле от " + Строка(Период) + " присутствуют данные " + ?(ВыборкаОшибокИмпорта.ПустаяЗапись, "без котировок", "с котировками") + " по погашенной ценной бумаге [" + ВыборкаОшибокИмпорта.ЦеннаяБумага + "]. ISIN [" + ВыборкаОшибокИмпорта.ISIN + "]. Дата погашения [" + Формат(ВыборкаОшибокИмпорта.ДатаПогашения, "ДФ=dd.MM.yyyy") + "]";
		
		Если ПолучателиОповещенийОПогашенныхБумагах = "" Тогда
			ЗарегистрироватьОшибку(Ошибки, ТекстОшибки);
		Иначе
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОшибки; 
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолучателиОповещенийОПогашенныхБумагах <> "" И ТекстСообщения <> "" Тогда
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело",
				ПолучателиОповещенийОПогашенныхБумагах,
				"Импорт котировок блумберг.",
				"Текст сообщения: " + ТекстСообщения);
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);	
	КонецЕсли;
		
	Возврат РезультатЗапроса.Выгрузить();
		
КонецФункции

Процедура ЗагрузитьКотировкиБлумбергИзТаблицы_012018(Котировки, ИмяРегистра, ЦеннаяБумага, ТолькоОтсутствующие, Период)
	
	ТаблицаБирж = Котировки.Скопировать(Новый Структура(ИмяРегистра, Истина), "Биржа");
	ТаблицаБирж.Свернуть("Биржа");
	
	Для Каждого СтрокаТаблицыБирж Из ТаблицаБирж Цикл
	
		ДатаКотировок = НачалоДня(Период.ДатаОкончания);
		
		Пока ДатаКотировок >= Период.ДатаНачала Цикл
			
			КотировкиТекущейБиржи = Котировки.Скопировать(Новый Структура("Период, Биржа, " + ИмяРегистра, ДатаКотировок, СтрокаТаблицыБирж.Биржа, Истина));
		
			НаборКотировок = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборКотировок.Отбор.Период.Установить(ДатаКотировок);
			НаборКотировок.Отбор.Биржа.Установить(СтрокаТаблицыБирж.Биржа);
			
			Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
				НаборКотировок.Отбор.ЦеннаяБумага.Установить(ЦеннаяБумага);
			КонецЕсли;
			
			Если ТолькоОтсутствующие Тогда
				
				НаборКотировок.Прочитать();
				
				Для Каждого СтрокаКотировок Из КотировкиТекущейБиржи Цикл
					ЗаполнитьЗначенияСвойств(НаборКотировок.Добавить(), СтрокаКотировок);	
				КонецЦикла;
				
			Иначе
				НаборКотировок.Загрузить(КотировкиТекущейБиржи);	
			КонецЕсли;
			
			Если ДатаКотировок > Период.ДатаНачала Тогда
				НаборКотировок.ДополнительныеСвойства.Вставить("НеВыполнятьРасчетСводныхКотировок", Истина);
			КонецЕсли;
			
			НаборКотировок.Записать();
			
			ДатаКотировок = ДатаКотировок - (24 * 60 * 60);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Индексы_Блумберг

Процедура ЗаполнитьТаблицуИндексовБлумберг(ЗначенияИндексов, ИмяФайлаXLSX, БиржаИндексов, Период)

	//Грузим всё, что есть в файле. На внутреннем соединении отпадут не индексы.
	
	Таблица = Новый ТабличныйДокумент;
	Таблица.Прочитать(ИмяФайлаXLSX, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	СдвигКолонкиВалюта = ?(НРег(СокрЛП(ПолучитьЗначениеЯчейки(Таблица.Область(1, 5, 1, 5)))) = "валюта", 1, 0);
	
	НомСтр = 1;
	Пока НомСтр < 10000 Цикл // защита от зацикливания
		НомСтр = НомСтр + 1;
		
		SECID = СокрЛП(ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 1, НомСтр, 1)));
		Если ПустаяСтрока(SECID) Тогда
			Прервать;
		КонецЕсли;
		
		ДатаИндекса = Дата(УдалитьСпецСимволы(ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 3, НомСтр, 3)))); 
		Если ДатаИндекса < НачалоДня(Период.ДатаНачала) ИЛИ ДатаИндекса > Период.ДатаОкончания Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИндексов = ЗначенияИндексов.Добавить();	
		СтрокаИндексов.Период		= ДатаИндекса; 
		СтрокаИндексов.SECID		= СокрЛП(ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 1, НомСтр, 1)));
		СтрокаИндексов.CURRENCYID	= ?(СдвигКолонкиВалюта = 1, ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, 5, НомСтр, 5)), "USD");
		СтрокаИндексов.CLOSE		= ПолучитьЗначениеЯчейки(Таблица.Область(НомСтр, СдвигКолонкиВалюта + 5, НомСтр, СдвигКолонкиВалюта + 5));
		
		Если НЕ ЗначениеЗаполнено(СтрокаИндексов.CLOSE) Тогда
			ЗначенияИндексов.Удалить(СтрокаИндексов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьИндексыБлумбергИзТаблицы(ЗначенияИндексов, БиржаИндексов, ТолькоОтсутствующие, Период)

	Запрос = Новый Запрос;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияИндексов.Период КАК Период,
		|	ЗначенияИндексов.Индекс КАК Индекс,
		|	ЗначенияИндексов.Валюта КАК Валюта,
		|	ЗначенияИндексов.SECID КАК SECID,
		|	ЗначенияИндексов.SHORTNAME КАК SHORTNAME,
		|	ЗначенияИндексов.NAME КАК NAME,
		|	ЗначенияИндексов.CURRENCYID КАК CURRENCYID,
		|	ЗначенияИндексов.CLOSE КАК CLOSE,
		|	ЗначенияИндексов.OPEN КАК OPEN,
		|	ЗначенияИндексов.HIGH КАК HIGH,
		|	ЗначенияИндексов.LOW КАК LOW,
		|	ЗначенияИндексов.VALUE КАК VALUE,
		|	ЗначенияИндексов.DURATION КАК DURATION,
		|	ЗначенияИндексов.YIELD КАК YIELD,
		|	ЗначенияИндексов.DECIMALS КАК DECIMALS,
		|	ЗначенияИндексов.CAPITALIZATION КАК CAPITALIZATION,
		|	ЗначенияИндексов.DIVISOR КАК DIVISOR
		|ПОМЕСТИТЬ _ЗначенияИндексов
		|ИЗ
		|	&ЗначенияИндексов КАК ЗначенияИндексов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗначенияИндексов.Период КАК Период,
		|	_ЗначенияИндексов.Индекс КАК Индекс,
		|	_ЗначенияИндексов.Валюта КАК Валюта,
		|	_ЗначенияИндексов.CLOSE КАК CLOSE,
		|	_ЗначенияИндексов.OPEN КАК OPEN,
		|	_ЗначенияИндексов.HIGH КАК HIGH,
		|	_ЗначенияИндексов.LOW КАК LOW,
		|	_ЗначенияИндексов.VALUE КАК VALUE,
		|	_ЗначенияИндексов.DURATION КАК DURATION,
		|	_ЗначенияИндексов.YIELD КАК YIELD,
		|	_ЗначенияИндексов.DECIMALS КАК DECIMALS,
		|	_ЗначенияИндексов.CAPITALIZATION КАК CAPITALIZATION,
		|	_ЗначенияИндексов.DIVISOR КАК DIVISOR,
		|	&Биржа КАК Биржа,
		|	Индексы.Ссылка КАК БиржевойИндекс
		|ИЗ
		|	_ЗначенияИндексов КАК _ЗначенияИндексов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БиржевыеИндексы КАК Индексы
		|		ПО _ЗначенияИндексов.SECID = Индексы.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|		ПО (Индексы.Ссылка = ЗначенияБиржевыхИндексов.БиржевойИндекс)
		|			И _ЗначенияИндексов.Период = ЗначенияБиржевыхИндексов.Период
		|			И (&Биржа = ЗначенияБиржевыхИндексов.Биржа)
		|ГДЕ
		|	ЗначенияБиржевыхИндексов.БиржевойИндекс ЕСТЬ NULL
		|		ИЛИ НЕ &ТолькоОтсутствующие";
#КонецОбласти
		
	Запрос.УстановитьПараметр("ЗначенияИндексов"   , ЗначенияИндексов);
	Запрос.УстановитьПараметр("Биржа"			   , БиржаИндексов);
	Запрос.УстановитьПараметр("ТолькоОтсутствующие", ТолькоОтсутствующие);

	ТаблилцаЗначенийИндексов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблилцаЗначенийИндексов.Количество() > 0 Тогда
		
		ДатаЗначенийИндексов = НачалоДня(Период.ДатаОкончания); 
		
		Пока ДатаЗначенийИндексов >= Период.ДатаНачала Цикл
			
			ЗначенияИндексовЗаПериод = ТаблилцаЗначенийИндексов.Скопировать(Новый Структура("Период", ДатаЗначенийИндексов));
			
			НаборЗначенияИндексов = РегистрыСведений.ЗначенияБиржевыхИндексов.СоздатьНаборЗаписей();
			НаборЗначенияИндексов.Отбор.Период.Установить(ДатаЗначенийИндексов);
			НаборЗначенияИндексов.Отбор.Биржа.Установить(БиржаИндексов);
			
			Если ТолькоОтсутствующие Тогда
			
				НаборЗначенияИндексов.Прочитать();
			
				Для Каждого СтрокаЗначенияИндексовЗаПериод Из ЗначенияИндексовЗаПериод Цикл
					ЗаполнитьЗначенияСвойств(НаборЗначенияИндексов.Добавить(), СтрокаЗначенияИндексовЗаПериод);	
				КонецЦикла;
				
			Иначе
				НаборЗначенияИндексов.Загрузить(ЗначенияИндексовЗаПериод);	
			КонецЕсли;
			
			НаборЗначенияИндексов.Записать();
			
			ДатаЗначенийИндексов = ДатаЗначенийИндексов - (24 * 60 * 60);

		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_функции

Функция ПолучитьЗначениеЯчейки(Ячейка, РазрядностьОкругления = 0)
	
	Если Ячейка.СодержитЗначение Тогда
		Если РазрядностьОкругления = 0 Тогда
			Возврат Ячейка.Значение;
		Иначе
			Возврат Окр(Ячейка.Значение, РазрядностьОкругления);
		КонецЕсли;
		
	Иначе
		Возврат Ячейка.Текст;
	КонецЕсли;
	
КонецФункции

Функция УдалитьСпецСимволы(Знач Значение)
	
	Значение = СтрЗаменить(Значение, Символы.НПП, "");
	
	Возврат Значение;
	
КонецФункции

Процедура ЗарегистрироватьОшибку(Ошибки, ТекстОшибки)
	
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Массив();
	КонецЕсли;
	
	Если Ошибки.Найти(ТекстОшибки) = Неопределено Тогда
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(Ошибки, ИнтерактивныйЗапуск)
	
	ЕстьОшибки = ЗначениеЗаполнено(Ошибки);
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ИнтерактивныйЗапуск Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Ошибки, Символы.ПС));
	Иначе
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(Ошибки, "Импорт котировок Блумберг");
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

#КонецОбласти

#Область Контроль_котировок_Блумберг

Процедура КонтрольКотировокБлумберг(Организация, ДатаКотировок, ПолучателиОповещения) Экспорт
	
	ДанныеДляСбораСтатистики = Новый Структура("Организация, ДатаКотировок", Организация, ДатаКотировок);
	
	//Открываем сессию
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики(ДанныеДляСбораСтатистики);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя()  + "(КонтрольКотировокБлумберг)";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ТемаПисьма = "Отсутствуют котировки Bloomberg для облигаций и еврооблигаций """ + Организация + """ на " + Формат(ДатаКотировок, "ДФ=dd.MM.yy");
	ТекстПисьма = "";
	
	Запрос = Новый Запрос;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиЦенныхБумагОстаткиИОбороты.Рынок КАК Рынок,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			Период,
		|			,
		|			Организация = &Организация
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И (ЦеннаяБумага.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|					ИЛИ ЦеннаяБумага.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						И ЦеннаяБумага.Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ))
		|				И (ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Рынок,
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.ЦеннаяБумага
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			Период,
		|			,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И (ЦеннаяБумага.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|					ИЛИ ЦеннаяБумага.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						И ЦеннаяБумага.Подкатегория = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ))
		|				И (ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ))) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО (КотировкиТорговыхПлощадок.Период = &Период)
		|			И (КотировкиТорговыхПлощадок.Биржа = &Биржа)
		|			И _ЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И _ЦенныеБумаги.Рынок = КотировкиТорговыхПлощадок.Рынок
		|ГДЕ
		|	КотировкиТорговыхПлощадок.BID ЕСТЬ NULL";
#КонецОбласти
			
	Запрос.УстановитьПараметр("Период"		, ДатаКотировок);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("Биржа"		, ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg"));
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + Строка(Выборка.ЦеннаяБумага) + Символы.ПС + Символы.ВК;
	КонецЦикла;

	Если ЗначениеЗаполнено(ПолучателиОповещения) И ЗначениеЗаполнено(ТекстПисьма) Тогда
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(ПолучателиОповещения, ТемаПисьма, ТекстПисьма);		
	КонецЕсли;
	
	//Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#КонецОбласти
