
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Дата) Тогда
		ЭтаФорма.Дата = ТекущаяДатаСеанса();	
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтаФорма.Организация) Тогда
		ЭтаФорма.Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Получатель) Тогда
		ЭтаФорма.Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "АдресЭлектроннойПочты");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКонтрольНаСервере()
	
	ОбработкаОбъект = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьКонтроль(ЭтаФорма.Организация, ЭтаФорма.Дата, ЭтаФорма.Получатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонтроль(Команда)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату",, "Дата");
		Возврат;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите организацию",, "Организация");
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Получатель) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите e-mail получателя",, "Получатель");
		Возврат;	
	КонецЕсли;
	
	ВыполнитьКонтрольНаСервере();
	
КонецПроцедуры