Перем МассивОтчетныхДат;
Перем ВидыАктивов;
Перем Макет, ОбластьСумма, ОбластьПоказатель;

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Справка о размере активов с перечнем включенных в расчет видов активов", 
		"0.08", 
		"", 
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(Результат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	#Область Предварительная_обработка_параметров_и_регистрация_сессии_статистики	
	
	Если Ложь Тогда
		Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);
	
	МассивВидыДоговоровДоверительногоУправления = Новый Массив;
	Для Каждого Элемент Из ЭтотОбъект.ВидыДоговоровДоверительногоУправления Цикл
		Если Элемент.Пометка Тогда
			МассивВидыДоговоровДоверительногоУправления.Добавить(Элемент.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	ЭлементСписковДоговоров = ЭтотОбъект.СпискиДоговоров.НайтиПоИдентификатору(ЭтотОбъект.ИдентификаторСпискаДоговоров);
	Если ЭлементСписковДоговоров = Неопределено Тогда
		СписокДоговоров = Новый СписокЗначений;
	Иначе	
		СписокДоговоров = ЭлементСписковДоговоров.Значение;
	КонецЕсли;
	
	// Начало сессии статистики
	
	УточненныеПараметры	= Новый Структура;
	
	Если ЭтотОбъект.ОтборПоДоговорам Тогда
		УточненныеПараметры.Вставить("СписокДоговоров", ?(ЭлементСписковДоговоров = Неопределено, "", СтрШаблон("%1 [%2]", ЭлементСписковДоговоров.Представление, СтрСоединить(СписокДоговоров.ВыгрузитьЗначения(), ", "))));
	Иначе	
		УточненныеПараметры.Вставить("ВидыДоговоров", СтрСоединить(МассивВидыДоговоровДоверительногоУправления, ", "));
	КонецЕсли;
	
	УточненныеПараметры.Вставить("ВариантОтчета", ВариантОтчета);
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		УточненныеПараметры.Вставить("ДетализацияПоАктиву",							 ЭтотОбъект.ДетализацияПоАктиву);
		УточненныеПараметры.Вставить("ОтображатьНеУдовлетворяющиеТребованиямАктивы", ЭтотОбъект.ОтображатьНеУдовлетворяющиеТребованиямАктивы);
	Иначе
		УточненныеПараметры.Вставить("ДетализацияПоДоговору",						 ЭтотОбъект.ДетализацияПоДоговору);
	КонецЕсли;
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация, СписокОтчетныхДат, ОтборПоДоговорам", УточненныеПараметры);
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	// Определяем период, за который будут формироваться данные, для оборотов и пр.
	
	ДатаНачала		= Дата(1,1,1);
	ДатаОкончания	= Дата(1,1,1);

	МассивОтчетныхДат = ЭтотОбъект.СписокОтчетныхДат.ВыгрузитьЗначения();
	Для Каждого ДатаОтчета Из МассивОтчетныхДат Цикл
		ДатаОкончания = Макс(ДатаОкончания, ДатаОтчета);
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = Мин(ДатаНачала, ДатаОтчета);
		Иначе
			ДатаНачала = ДатаОтчета;
		КонецЕсли;
	КонецЦикла;
	
	#КонецОбласти
	
	ВидыАктивов = Новый Соответствие;
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		ВидыАктивов.Вставить(1, "1. Акции российских эмитентов");
		ВидыАктивов.Вставить(2, "2. Государственные ценные бумаги РФ");
		ВидыАктивов.Вставить(3, "3. Денежные средства на счетах в кредитных организациях");
		ВидыАктивов.Вставить(4, "4. Ценные бумаги субъектов РФ");
		ВидыАктивов.Вставить(5, "5. Облигации российских эмитентов помимо государственных ценных бумаг РФ и ценных бумаг субъектов РФ");
		ВидыАктивов.Вставить(6, "6. Депозиты в кредитных организациях");
		ВидыАктивов.Вставить(7, "7. Дебиторская задолженность");
		ВидыАктивов.Вставить(8, "8. Ценные бумаги международных финансовых организаций");
		Если ЭтотОбъект.ОтображатьНеУдовлетворяющиеТребованиямАктивы Тогда
			ВидыАктивов.Вставить(9, "9. Не удовлетворяющие требованиям активы");
		КонецЕсли;
	Иначе
		ВидыАктивов.Вставить(1, "1. Денежные средства в рублях на счетах в кредитных организациях");
		ВидыАктивов.Вставить(2, "2. Депозиты в рублях в кредитных организациях");
		ВидыАктивов.Вставить(3, "3. МНО");
		ВидыАктивов.Вставить(4, "4. Государственные ценные бумаги Российской Федерации");
		ВидыАктивов.Вставить(5, "5. Государственные ценные бумаги субъектов Российской Федерации");
		ВидыАктивов.Вставить(6, "6. Облигации российских эмитентов помимо государственных ценных бумаг Российской Федерации и государственных ценных бумаг субъектов Российской Федерации");
		ВидыАктивов.Вставить(7, "7. Акции российских эмитентов");
		ВидыАктивов.Вставить(8, "8. РЕПО");
		ВидыАктивов.Вставить(9, "9. Дебиторская задолженность");
		ВидыАктивов.Вставить(10, "10. Кредиторская задолженность");
		ВидыАктивов.Вставить(11, "11. Прочие активы");
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления",	МассивВидыДоговоровДоверительногоУправления);
	Запрос.УстановитьПараметр("ОтборПоДоговорам",						ЭтотОбъект.ОтборПоДоговорам);
	Запрос.УстановитьПараметр("СписокДоговоров",						СписокДоговоров);
	Запрос.УстановитьПараметр("МассивОтчетныхДат",						МассивОтчетныхДат);
	Запрос.УстановитьПараметр("ДатаОкончания",							КонецДня(ДатаОкончания));
	
	Запрос.УстановитьПараметр("ГраницаНачала",							Новый Граница(ДатаНачала, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаОкончания",						Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ВариантОтчета",							ВариантОтчета);
	Запрос.УстановитьПараметр("МинфинРоссии",							ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МинфинРоссии"));
	Запрос.УстановитьПараметр("ДомРФ",									ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ДомРФ"));	
	
	#Область Текст_запроса
			
	#Область Определение_облигаций_акций_и_банков_удовлетворяющих_требованиях
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		
		РейтинговыеАгентства = Новый Массив;
		РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.АКРА);
		РейтинговыеАгентства.Добавить(Справочники.РейтинговыеАгентства.RAEX);
		
		ДопустимыеБанкиДляРазмещенияДенежныхСредств = Новый Массив;
		ДопустимыеБанкиДляРазмещенияДенежныхСредств.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ"));
		ДопустимыеБанкиДляРазмещенияДенежныхСредств.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкВТБ"));
		
		ДопустимыеБанкиДляОткрытияДепозитныхВкладов = Новый Массив;
		ДопустимыеБанкиДляОткрытияДепозитныхВкладов.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкРСХБ"));
		ДопустимыеБанкиДляОткрытияДепозитныхВкладов.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкВТБ"));
		
		Запрос.УстановитьПараметр("РейтинговыеАгентства",											 РейтинговыеАгентства);
		Запрос.УстановитьПараметр("ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_BBBМинус",		 ОбщегоНазначения.ПолучитьИменованныйОбъект("СопоставлениеРейтингов_АКРА+RAEX >= ВВВ-"));
		Запрос.УстановитьПараметр("ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf", ОбщегоНазначения.ПолучитьИменованныйОбъект("СопоставлениеРейтингов_АКРА+RAEX >= ВВВ-/AAA.sf"));
		Запрос.УстановитьПараметр("ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_AAA",			 ОбщегоНазначения.ПолучитьИменованныйОбъект("СопоставлениеРейтингов_АКРА+RAEX >= AAA"));
		
		Запрос.УстановитьПараметр("КалендарьТоргов",												 Константы.ОсновнойКалендарьКотировок.Получить());
		Запрос.УстановитьПараметр("ММВБ",															 ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
		
		Запрос.УстановитьПараметр("ДопустимыеБанкиДляРазмещенияДенежныхСредств",					 ДопустимыеБанкиДляРазмещенияДенежныхСредств);
		Запрос.УстановитьПараметр("ДопустимыеБанкиДляОткрытияДепозитныхВкладов",					 ДопустимыеБанкиДляОткрытияДепозитныхВкладов);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыОтчета.Дата КАК ДатаОтчета,
			|	Облигации.Ссылка КАК Облигация,
			|	Облигации.Эмитент.ЮрФизЛицо КАК Эмитент
			|ПОМЕСТИТЬ _ПроверяемыеОблигации
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДатыОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
			|		ПО (ДатыОтчета.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
			|			И (ДатыОтчета.Дата В (&МассивОтчетныхДат))
			|			И (ДатыОтчета.Дата < Облигации.ДатаПогашения
			|				ИЛИ Облигации.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Облигация,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПроверяемыеОблигации.ДатаОтчета КАК ДатаОтчета,
			|	_ПроверяемыеОблигации.Облигация КАК Субъект
			|ПОМЕСТИТЬ _СубьектыПроверяемыхОблигаций
			|ИЗ
			|	_ПроверяемыеОблигации КАК _ПроверяемыеОблигации
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	_ПроверяемыеОблигации.ДатаОтчета,
			|	_ПроверяемыеОблигации.Эмитент
			|ИЗ
			|	_ПроверяемыеОблигации КАК _ПроверяемыеОблигации
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Субъект,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыИзмененияРейтингов.ДатаОтчета КАК ДатаОтчета,
			|	Рейтинги.Период КАК Период,
			|	Рейтинги.Агрегатор КАК Агрегатор,
			|	Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
			|	Рейтинги.Шкала КАК Шкала,
			|	Рейтинги.Шкала.ТипШкалы КАК ТипШкалы,
			|	Рейтинги.Шкала.Срок КАК Срок,
			|	Рейтинги.Шкала.ВидРейтинга КАК ВидРейтинга,
			|	Рейтинги.Субъект КАК Субъект,
			|	Рейтинги.ЗначениеРейтинга КАК ЗначениеРейтинга,
			|	Рейтинги.ЗначениеРейтинга.Оценка КАК Оценка
			|ПОМЕСТИТЬ _РейтингиСубъектовПроверяемыхОблигаций
			|ИЗ
			|	РегистрСведений.Рейтинги КАК Рейтинги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			_СубьектыПроверяемыхОблигаций.ДатаОтчета КАК ДатаОтчета,
			|			Рейтинги.Агрегатор КАК Агрегатор,
			|			Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
			|			Рейтинги.Шкала КАК Шкала,
			|			Рейтинги.Субъект КАК Субъект,
			|			МАКСИМУМ(Рейтинги.Период) КАК Период
			|		ИЗ
			|			_СубьектыПроверяемыхОблигаций КАК _СубьектыПроверяемыхОблигаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Рейтинги КАК Рейтинги
			|				ПО ((Рейтинги.Агрегатор, Рейтинги.РейтинговоеАгентство, Рейтинги.Шкала) В
			|						(ВЫБРАТЬ
			|							Шкалы.Агрегатор,
			|							Шкалы.Владелец,
			|							Шкалы.Ссылка
			|						ИЗ
			|							Справочник.ШкалыРейтинговыхАгентств КАК Шкалы
			|						ГДЕ
			|							Шкалы.Владелец В (&РейтинговыеАгентства)
			|							И Шкалы.ТипШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыШкалРейтинговыхАгенств.Национальная)))
			|					И (Рейтинги.Субъект = _СубьектыПроверяемыхОблигаций.Субъект)
			|					И (Рейтинги.Период <= _СубьектыПроверяемыхОблигаций.ДатаОтчета)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			_СубьектыПроверяемыхОблигаций.ДатаОтчета,
			|			Рейтинги.Агрегатор,
			|			Рейтинги.РейтинговоеАгентство,
			|			Рейтинги.Шкала,
			|			Рейтинги.Субъект) КАК ДатыИзмененияРейтингов
			|		ПО Рейтинги.Агрегатор = ДатыИзмененияРейтингов.Агрегатор
			|			И Рейтинги.РейтинговоеАгентство = ДатыИзмененияРейтингов.РейтинговоеАгентство
			|			И Рейтинги.Шкала = ДатыИзмененияРейтингов.Шкала
			|			И Рейтинги.Субъект = ДатыИзмененияРейтингов.Субъект
			|			И Рейтинги.Период = ДатыИзмененияРейтингов.Период
			|			И (Рейтинги.ЗначениеРейтинга.РейтингСнят = ЛОЖЬ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Субъект,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПроверяемыеОблигации.ДатаОтчета КАК ДатаОтчета,
			|	_ПроверяемыеОблигации.Облигация КАК Облигация,
			|	РейтингиЭмиссии_АКРА_RAEX.Субъект ЕСТЬ NULL КАК РейтингиЭмиссииОтсутствуют,
			|	РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус.Субъект ЕСТЬ НЕ NULL  КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус,
			|	РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf.Субъект ЕСТЬ НЕ NULL  КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf,
			|	РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA.Субъект ЕСТЬ НЕ NULL  КАК РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA
			|ПОМЕСТИТЬ _РезультатыПроверкиРейтинговОблигаций
			|ИЗ
			|	_ПроверяемыеОблигации КАК _ПроверяемыеОблигации
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_Рейтинги.ДатаОтчета КАК ДатаОтчета,
			|			_Рейтинги.Субъект КАК Субъект
			|		ИЗ
			|			_РейтингиСубъектовПроверяемыхОблигаций КАК _Рейтинги) КАК РейтингиЭмиссии_АКРА_RAEX
			|		ПО _ПроверяемыеОблигации.ДатаОтчета = РейтингиЭмиссии_АКРА_RAEX.ДатаОтчета
			|			И _ПроверяемыеОблигации.Облигация = РейтингиЭмиссии_АКРА_RAEX.Субъект
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_Рейтинги.ДатаОтчета КАК ДатаОтчета,
			|			_Рейтинги.Субъект КАК Субъект
			|		ИЗ
			|			_РейтингиСубъектовПроверяемыхОблигаций КАК _Рейтинги
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&ДатаОкончания, Источник = &ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_BBBМинус) КАК СопоставлениеРейтинговыхШкал
			|				ПО (СопоставлениеРейтинговыхШкал.Активно)
			|					И (ВЫБОР
			|						КОГДА СопоставлениеРейтинговыхШкал.ОтборПоЭталоннойШкале
			|							ТОГДА СопоставлениеРейтинговыхШкал.ШкалаРейтингаЭталонная = _Рейтинги.Шкала
			|						ИНАЧЕ СопоставлениеРейтинговыхШкал.Агрегатор = _Рейтинги.Агрегатор
			|								И СопоставлениеРейтинговыхШкал.ТипШкалы = _Рейтинги.ТипШкалы
			|								И СопоставлениеРейтинговыхШкал.Срок = _Рейтинги.Срок
			|								И СопоставлениеРейтинговыхШкал.РейтинговоеАгенство = _Рейтинги.РейтинговоеАгентство
			|								И СопоставлениеРейтинговыхШкал.ВидРейтинга = _Рейтинги.ВидРейтинга
			|					КОНЕЦ)
			|					И (_Рейтинги.Оценка МЕЖДУ ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМаксимальное.Оценка, 0) И ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМинимальное.Оценка, 0))) КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус
			|		ПО _ПроверяемыеОблигации.ДатаОтчета = РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус.ДатаОтчета
			|			И _ПроверяемыеОблигации.Облигация = РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус.Субъект
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_Рейтинги.ДатаОтчета КАК ДатаОтчета,
			|			_Рейтинги.Субъект КАК Субъект
			|		ИЗ
			|			_РейтингиСубъектовПроверяемыхОблигаций КАК _Рейтинги
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&ДатаОкончания, Источник = &ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf) КАК СопоставлениеРейтинговыхШкал
			|				ПО (СопоставлениеРейтинговыхШкал.Активно)
			|					И (ВЫБОР
			|						КОГДА СопоставлениеРейтинговыхШкал.ОтборПоЭталоннойШкале
			|							ТОГДА СопоставлениеРейтинговыхШкал.ШкалаРейтингаЭталонная = _Рейтинги.Шкала
			|						ИНАЧЕ СопоставлениеРейтинговыхШкал.Агрегатор = _Рейтинги.Агрегатор
			|								И СопоставлениеРейтинговыхШкал.ТипШкалы = _Рейтинги.ТипШкалы
			|								И СопоставлениеРейтинговыхШкал.Срок = _Рейтинги.Срок
			|								И СопоставлениеРейтинговыхШкал.РейтинговоеАгенство = _Рейтинги.РейтинговоеАгентство
			|								И СопоставлениеРейтинговыхШкал.ВидРейтинга = _Рейтинги.ВидРейтинга
			|					КОНЕЦ)
			|					И (_Рейтинги.Оценка МЕЖДУ ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМаксимальное.Оценка, 0) И ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМинимальное.Оценка, 0))) КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf
			|		ПО _ПроверяемыеОблигации.ДатаОтчета = РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf.ДатаОтчета
			|			И _ПроверяемыеОблигации.Облигация = РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf.Субъект
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_Рейтинги.ДатаОтчета КАК ДатаОтчета,
			|			_Рейтинги.Субъект КАК Субъект
			|		ИЗ
			|			_РейтингиСубъектовПроверяемыхОблигаций КАК _Рейтинги
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&ДатаОкончания, Источник = &ТаблицаСопоставленияРейтингов_АКРА_RAEX_НеМеньше_AAA) КАК СопоставлениеРейтинговыхШкал
			|				ПО (СопоставлениеРейтинговыхШкал.Активно)
			|					И (ВЫБОР
			|						КОГДА СопоставлениеРейтинговыхШкал.ОтборПоЭталоннойШкале
			|							ТОГДА СопоставлениеРейтинговыхШкал.ШкалаРейтингаЭталонная = _Рейтинги.Шкала
			|						ИНАЧЕ СопоставлениеРейтинговыхШкал.Агрегатор = _Рейтинги.Агрегатор
			|								И СопоставлениеРейтинговыхШкал.ТипШкалы = _Рейтинги.ТипШкалы
			|								И СопоставлениеРейтинговыхШкал.Срок = _Рейтинги.Срок
			|								И СопоставлениеРейтинговыхШкал.РейтинговоеАгенство = _Рейтинги.РейтинговоеАгентство
			|								И СопоставлениеРейтинговыхШкал.ВидРейтинга = _Рейтинги.ВидРейтинга
			|					КОНЕЦ)
			|					И (_Рейтинги.Оценка МЕЖДУ ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМаксимальное.Оценка, 0) И ЕСТЬNULL(СопоставлениеРейтинговыхШкал.ЗначениеМинимальное.Оценка, 0))) КАК РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA
			|		ПО _ПроверяемыеОблигации.ДатаОтчета = РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA.ДатаОтчета
			|			И _ПроверяемыеОблигации.Эмитент = РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA.Субъект
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Облигация,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПроверяемыеОблигации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _СубьектыПроверяемыхОблигаций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _РейтингиСубъектовПроверяемыхОблигаций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыОтчета.Дата КАК ДатаОтчета,
			|	МАКСИМУМ(ДатыТоргов.Дата) КАК ПоследняяДатаТоргов
			|ПОМЕСТИТЬ _ПоследниеДатыТоргов
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДатыОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДатыТоргов
			|		ПО (ДатыТоргов.Календарь = &КалендарьТоргов)
			|			И (ДатыТоргов.Дата <= ДатыОтчета.Дата)
			|			И (ДатыТоргов.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
			|ГДЕ
			|	ДатыОтчета.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|	И ДатыОтчета.Дата В(&МассивОтчетныхДат)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДатыОтчета.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыОтчета.Дата КАК ДатаОтчета,
			|	Акции.Ссылка КАК Акция,
			|	_ПоследниеДатыТоргов.ПоследняяДатаТоргов КАК ПоследняяДатаТоргов
			|ПОМЕСТИТЬ _ПроверяемыеАкции
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДатыОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
			|		ПО (ДатыОтчета.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
			|			И (ДатыОтчета.Дата В (&МассивОтчетныхДат))
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеДатыТоргов КАК _ПоследниеДатыТоргов
			|		ПО (_ПоследниеДатыТоргов.ДатаОтчета = ДатыОтчета.Дата)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Акция,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПроверяемыеАкции.ДатаОтчета КАК ДатаОтчета,
			|	_ПроверяемыеАкции.Акция КАК Акция,
			|	СоставИндексаММВБ.Объект ЕСТЬ НЕ NULL  КАК ВключенаВСоставИндексаММВБ,
			|	ВходящиеВПервыйКотировальныйЛист.Акция ЕСТЬ НЕ NULL  КАК ВходитВПервыйКотировальныйЛист
			|ПОМЕСТИТЬ _РезультатыПроверкиЛиквидностиАкций
			|ИЗ
			|	_ПроверяемыеАкции КАК _ПроверяемыеАкции
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК СоставИндексаММВБ
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				_ПроверяемыеАкции.ДатаОтчета КАК ДатаОтчета,
			|				СоставИндексаММВБ.ВнешняяСистема КАК ВнешняяСистема,
			|				СоставИндексаММВБ.ВидПеречня КАК ВидПеречня,
			|				СоставИндексаММВБ.Объект КАК Объект,
			|				МАКСИМУМ(СоставИндексаММВБ.Период) КАК Период
			|			ИЗ
			|				_ПроверяемыеАкции КАК _ПроверяемыеАкции
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеречниОбъектов КАК СоставИндексаММВБ
			|					ПО (СоставИндексаММВБ.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ММВБ))
			|						И (СоставИндексаММВБ.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СоставИндексаММВБ))
			|						И (СоставИндексаММВБ.Объект = _ПроверяемыеАкции.Акция)
			|						И (СоставИндексаММВБ.Период <= _ПроверяемыеАкции.ДатаОтчета)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				_ПроверяемыеАкции.ДатаОтчета,
			|				СоставИндексаММВБ.ВнешняяСистема,
			|				СоставИндексаММВБ.ВидПеречня,
			|				СоставИндексаММВБ.Объект) КАК ДатыИзмененияСоставаИндекса
			|			ПО (ДатыИзмененияСоставаИндекса.ВнешняяСистема = СоставИндексаММВБ.ВнешняяСистема)
			|				И (ДатыИзмененияСоставаИндекса.ВидПеречня = СоставИндексаММВБ.ВидПеречня)
			|				И (ДатыИзмененияСоставаИндекса.Объект = СоставИндексаММВБ.Объект)
			|				И (ДатыИзмененияСоставаИндекса.Период = СоставИндексаММВБ.Период)
			|		ПО (ДатыИзмененияСоставаИндекса.ДатаОтчета = _ПроверяемыеАкции.ДатаОтчета)
			|			И (СоставИндексаММВБ.Объект = _ПроверяемыеАкции.Акция)
			|			И (СоставИндексаММВБ.Включен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			_ПроверяемыеАкции.ДатаОтчета КАК ДатаОтчета,
			|			_ПроверяемыеАкции.Акция КАК Акция
			|		ИЗ
			|			_ПроверяемыеАкции КАК _ПроверяемыеАкции
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиММВБ
			|				ПО (КотировкиММВБ.ЦеннаяБумага = _ПроверяемыеАкции.Акция)
			|					И (КотировкиММВБ.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции))
			|					И (КотировкиММВБ.Биржа = &ММВБ)
			|					И (КотировкиММВБ.Период = _ПроверяемыеАкции.ПоследняяДатаТоргов)
			|					И (КотировкиММВБ.LISTNAME = 1)) КАК ВходящиеВПервыйКотировальныйЛист
			|		ПО (ВходящиеВПервыйКотировальныйЛист.Акция = _ПроверяемыеАкции.Акция)
			|			И (ВходящиеВПервыйКотировальныйЛист.ДатаОтчета = _ПроверяемыеАкции.ДатаОтчета)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Акция,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПоследниеДатыТоргов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПроверяемыеАкции
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДатыОтчета.Дата КАК ДатаОтчета,
			|	Банки.Ссылка КАК Банк,
			|	Банки.ЮрФизЛицо КАК ЮрЛицо
			|ПОМЕСТИТЬ _ПроверяемыеБанки
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДатыОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
			|		ПО (ДатыОтчета.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
			|			И (ДатыОтчета.Дата В (&МассивОтчетныхДат))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЮрЛицо,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ПроверяемыеБанки.ДатаОтчета КАК ДатаОтчета,
			|	_ПроверяемыеБанки.Банк КАК Банк,
			|	ЕСТЬNULL(_ПроверяемыеБанки.ЮрЛицо В (&ДопустимыеБанкиДляРазмещенияДенежныхСредств)
			|			ИЛИ ГоловныеОрганизации.РодительскоеЮридическоеЛицо В (&ДопустимыеБанкиДляРазмещенияДенежныхСредств), ЛОЖЬ) КАК РазрешеноРазмещениеДенежныхСредств,
			|	ЕСТЬNULL(_ПроверяемыеБанки.ЮрЛицо В (&ДопустимыеБанкиДляОткрытияДепозитныхВкладов)
			|			ИЛИ ГоловныеОрганизации.РодительскоеЮридическоеЛицо В (&ДопустимыеБанкиДляОткрытияДепозитныхВкладов), ЛОЖЬ) КАК РазрешеноОткрытиеДепозитныхВкладов
			|ПОМЕСТИТЬ _РезультатыПроверкиБанков
			|ИЗ
			|	_ПроверяемыеБанки КАК _ПроверяемыеБанки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица КАК ГоловныеОрганизации
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				_ПроверяемыеБанки.ДатаОтчета КАК ДатаОтчета,
			|				ГоловныеОрганизации.ЮридическоеЛицо КАК ЮридическоеЛицо,
			|				ГоловныеОрганизации.РодительскоеЮридическоеЛицо КАК РодительскоеЮридическоеЛицо,
			|				ГоловныеОрганизации.ТипСвязи КАК ТипСвязи,
			|				МАКСИМУМ(ГоловныеОрганизации.Период) КАК Период
			|			ИЗ
			|				_ПроверяемыеБанки КАК _ПроверяемыеБанки
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица КАК ГоловныеОрганизации
			|					ПО (ГоловныеОрганизации.ЮридическоеЛицо = _ПроверяемыеБанки.ЮрЛицо)
			|						И (ГоловныеОрганизации.ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация))
			|						И (ГоловныеОрганизации.Период <= _ПроверяемыеБанки.ДатаОтчета)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				_ПроверяемыеБанки.ДатаОтчета,
			|				ГоловныеОрганизации.ЮридическоеЛицо,
			|				ГоловныеОрганизации.РодительскоеЮридическоеЛицо,
			|				ГоловныеОрганизации.ТипСвязи) КАК ДатыИзмененияГоловнойОрганизации
			|			ПО (ДатыИзмененияГоловнойОрганизации.ЮридическоеЛицо = ГоловныеОрганизации.ЮридическоеЛицо)
			|				И (ДатыИзмененияГоловнойОрганизации.РодительскоеЮридическоеЛицо = ГоловныеОрганизации.РодительскоеЮридическоеЛицо)
			|				И (ДатыИзмененияГоловнойОрганизации.ТипСвязи = ГоловныеОрганизации.ТипСвязи)
			|				И (ДатыИзмененияГоловнойОрганизации.Период = ГоловныеОрганизации.Период)
			|		ПО (ДатыИзмененияГоловнойОрганизации.ДатаОтчета = _ПроверяемыеБанки.ДатаОтчета)
			|			И (ГоловныеОрганизации.ЮридическоеЛицо = _ПроверяемыеБанки.ЮрЛицо)
			|			И (ГоловныеОрганизации.Действует)
			|ГДЕ
			|	_ПроверяемыеБанки.ЮрЛицо <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Банк,
			|	ДатаОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПроверяемыеБанки";
		
	Иначе	
		
		// Заглушка
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтчета,
			|	ЗНАЧЕНИЕ(Справочник.Облигации.ПустаяСсылка) КАК Облигация,
			|	ЛОЖЬ КАК РейтингиЭмиссииОтсутствуют,
			|	ЛОЖЬ КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус,
			|	ЛОЖЬ КАК РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf,
			|	ЛОЖЬ КАК РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA
			|ПОМЕСТИТЬ _РезультатыПроверкиРейтинговОблигаций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтчета,
			|	ЗНАЧЕНИЕ(Справочник.Акции.ПустаяСсылка) КАК Акция,
			|	ЛОЖЬ КАК ВключенаВСоставИндексаММВБ,
			|	ЛОЖЬ КАК ВходитВПервыйКотировальныйЛист
			|ПОМЕСТИТЬ _РезультатыПроверкиЛиквидностиАкций
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 0
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтчета,
			|	ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка) КАК Банк,
			|	ЛОЖЬ КАК РазрешеноРазмещениеДенежныхСредств,
			|	ЛОЖЬ КАК РазрешеноОткрытиеДепозитныхВкладов
			|ПОМЕСТИТЬ _РезультатыПроверкиБанков"
		
	КонецЕсли;	
		
	Запрос.Выполнить();
		
	#КонецОбласти	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДУ.ДатаОтчета КАК ДатаОтчета,
		|	СчетаДУ.ПоследняяРабочаяДата КАК ПоследняяРабочаяДата,
		|	ПОДСТРОКА(РеквизитыКлиентов.КраткоеНаименованиеПоУставу, 1, 250) КАК НаименованиеКлиента,
		|	СчетаДУ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДУ.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДУ.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаСЧА
		|ПОМЕСТИТЬ _ПериодыОтчета
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|		ДатыОтчета.Дата КАК ДатаОтчета,
		|		МАКСИМУМ(РабочиеДни.Дата) КАК ПоследняяРабочаяДата
		|	ИЗ
		|		Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДатыОтчета
		|			ПО (ДатыОтчета.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|				И (ДатыОтчета.Дата В (&МассивОтчетныхДат))
		|				И (ДатыОтчета.Дата >= СчетаДоверительногоУправления.ДатаЗаключения)
		|				И (ДатыОтчета.Дата <= СчетаДоверительногоУправления.ДатаРасторжения
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК РабочиеДни
		|			ПО (РабочиеДни.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|				И (РабочиеДни.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|				И (ДатыОтчета.Дата >= РабочиеДни.Дата)
		|	ГДЕ
		|		СчетаДоверительногоУправления.Организация = &Организация
		|		И ВЫБОР
		|				КОГДА &ОтборПоДоговорам
		|					ТОГДА СчетаДоверительногоУправления.Ссылка В (&СписокДоговоров)
		|				ИНАЧЕ СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления)
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СчетаДоверительногоУправления.Ссылка,
		|		ДатыОтчета.Дата) КАК СчетаДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.СубъектАналитики = СчетаДУ.СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказатели.Период МЕЖДУ СчетаДУ.ПоследняяРабочаяДата И СчетаДУ.ДатаОтчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДУ.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК Клиент,
		|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|			РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|		ИЗ
		|			РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|					&ДатаОкончания,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо,
		|			РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество,
		|			РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество, 1, 1) + "".""
		|		ИЗ
		|			РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|					&ДатаОкончания,
		|					Организация = &Организация
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд,
		|			РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда,
		|			РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		ИЗ
		|			РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних) КАК РеквизитыКлиентов
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыКлиентов.Клиент)
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетаДУ.СчетДоверительногоУправления,
		|	СчетаДУ.ДатаОтчета,
		|	СчетаДУ.ПоследняяРабочаяДата,
		|	СчетаДУ.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления,
		|	СчетаДУ.СчетДоверительногоУправления.НомерДоговора,
		|	СчетаДУ.СчетДоверительногоУправления.ДатаЗаключения,
		|	ПОДСТРОКА(РеквизитыКлиентов.КраткоеНаименованиеПоУставу, 1, 250)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу
		|ПОМЕСТИТЬ _РеквизитыУК
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПериодыОтчета.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ПериодыОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодыОтчета.НаименованиеКлиента КАК НаименованиеКлиента,
		|	_ПериодыОтчета.НомерДоговора КАК НомерДоговора,
		|	_ПериодыОтчета.ДатаЗаключения КАК ДатаЗаключения
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	_ПериодыОтчета КАК _ПериодыОтчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДУ.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _ВидыДоговоров
		|ИЗ
		|	_СчетаДУ КАК _СчетаДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваМНООстаткиИОбороты.Период КАК Период,
		|	ДенежныеСредстваМНООстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваМНООстаткиИОбороты.МНО КАК МНО,
		|	ЕСТЬNULL(ДенежныеСредстваМНООстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК Сумма
		|ПОМЕСТИТЬ _ОстаткиИОборотыМНО
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваМНО.ОстаткиИОбороты(
		|			&ГраницаНачала,
		|			&ГраницаОкончания,
		|			День,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_ПериодыОтчета.СчетДоверительногоУправления
		|					ИЗ
		|						_ПериодыОтчета)) КАК ДенежныеСредстваМНООстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыНастроекЦелейРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПериодыНастроекЦелейРасчета.ДатаОтчета КАК ДатаОтчета,
		|	НастройкиЦелейРасчета.ВидУчетаДляОстатковПартий КАК ВидУчета
		|ПОМЕСТИТЬ _ВидыУчета
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ПериодыОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ПериодыОтчета.ДатаОтчета КАК ДатаОтчета,
		|		МАКСИМУМ(НастройкиЦелейРасчета.Период) КАК Период
		|	ИЗ
		|		_ПериодыОтчета КАК _ПериодыОтчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
		|			ПО (НастройкиЦелейРасчета.СчетДоверительногоУправления = _ПериодыОтчета.СчетДоверительногоУправления)
		|				И (НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|				И (НастройкиЦелейРасчета.Организация = &Организация)
		|				И (НастройкиЦелейРасчета.Период <= _ПериодыОтчета.ДатаСЧА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ПериодыОтчета.СчетДоверительногоУправления,
		|		_ПериодыОтчета.ДатаОтчета) КАК ПериодыНастроекЦелейРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЦелейРасчета КАК НастройкиЦелейРасчета
		|		ПО (НастройкиЦелейРасчета.СчетДоверительногоУправления = ПериодыНастроекЦелейРасчета.СчетДоверительногоУправления)
		|			И (НастройкиЦелейРасчета.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|			И (НастройкиЦелейРасчета.Организация = &Организация)
		|			И (НастройкиЦелейРасчета.Период = ПериодыНастроекЦелейРасчета.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыОтчета.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ПериодыОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодыОтчета.ДатаОтчета КАК ДатаОтчета,
		|	_ПериодыОтчета.ДатаСЧА КАК ДатаСЧА,
		|	СтоимостьАктивов.РазделОтчета КАК ВидАктива,
		|	СтоимостьАктивов.Актив КАК Актив,
		|	ПРЕДСТАВЛЕНИЕ(СтоимостьАктивов.Актив) КАК АктивПредставление,
		|	СУММА(СтоимостьАктивов.СуммаВВалютеУчета) КАК Сумма,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтоимостьАктивов.Регистратор) = 1
		|			ТОГДА МАКСИМУМ(СтоимостьАктивов.Регистратор)
		|	КОНЕЦ КАК Регистратор,
		|	0 КАК Итог,
		|	ИСТИНА КАК ПроверятьНаличиеСЧА
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	_ПериодыОтчета КАК _ПериодыОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ПериодыОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			_ПериодыОтчета.ДатаОтчета КАК ДатаОтчета,
		|			_ПериодыОтчета.ДатаСЧА КАК ДатаСЧА,
		|			ВЫБОР
		|				КОГДА &ВариантОтчета = ""КонкурсПФР""
		|					ТОГДА ВЫБОР
		|							КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|									И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БанковскиеСчета
		|								ТОГДА ВЫБОР
		|										КОГДА (_ПериодыОтчета.ДатаОтчета, БанковскиеСчета.Банк) В
		|												(ВЫБРАТЬ
		|													_РезультатыПроверкиБанков.ДатаОтчета,
		|													_РезультатыПроверкиБанков.Банк
		|												ИЗ
		|													_РезультатыПроверкиБанков
		|												ГДЕ
		|													_РезультатыПроверкиБанков.РазрешеноРазмещениеДенежныхСредств)
		|											ТОГДА 3
		|										ИНАЧЕ 9
		|									КОНЕЦ
		|							КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|								ТОГДА ВЫБОР
		|										КОГДА (_ПериодыОтчета.ДатаОтчета, БанковскиеСчетаДепозитныхВкладов.Банк) В
		|												(ВЫБРАТЬ
		|													_РезультатыПроверкиБанков.ДатаОтчета,
		|													_РезультатыПроверкиБанков.Банк
		|												ИЗ
		|													_РезультатыПроверкиБанков
		|												ГДЕ
		|													_РезультатыПроверкиБанков.РазрешеноОткрытиеДепозитныхВкладов)
		|											ТОГДА 6
		|										ИНАЧЕ 9
		|									КОНЕЦ
		|							КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|								ТОГДА 7
		|							КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления ЕСТЬ НЕ NULL 
		|								ТОГДА 9
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|								И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БанковскиеСчета
		|							ТОГДА 1
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|							ТОГДА 2
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Документ.МНО
		|							ТОГДА 3
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание ССЫЛКА Документ.СделкаРЕПО
		|							ТОГДА 8
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|							ТОГДА 9
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|							ТОГДА 10
		|						КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления ЕСТЬ НЕ NULL 
		|							ТОГДА 11
		|					КОНЕЦ
		|			КОНЕЦ КАК РазделОтчета,
		|			СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаВВалютеУчета,
		|			ВЫБОР
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание <> НЕОПРЕДЕЛЕНО
		|					ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики <> НЕОПРЕДЕЛЕНО
		|					ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|				КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления ЕСТЬ НЕ NULL 
		|					ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности
		|			КОНЕЦ КАК Актив,
		|			СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Регистратор КАК Регистратор
		|		ИЗ
		|			_ПериодыОтчета КАК _ПериодыОтчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|				ПО (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = _ПериодыОтчета.СчетДоверительногоУправления)
		|					И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = _ПериодыОтчета.ДатаСЧА)
		|					И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация)
		|					И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ПО (БанковскиеСчета.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|				ПО (ДепозитныеВклады.Ссылка = СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаДепозитныхВкладов
		|				ПО (БанковскиеСчетаДепозитныхВкладов.Ссылка = ДепозитныеВклады.БанковскийСчет)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПериодыОстатковМНО.СчетДоверительногоУправления,
		|			ПериодыОстатковМНО.ДатаОтчета,
		|			ПериодыОстатковМНО.ДатаСЧА,
		|			ВЫБОР
		|				КОГДА ОтражениеМНО.Вариант = ""МНО""
		|					ТОГДА 3
		|				ИНАЧЕ 1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ОтражениеМНО.Вариант = ""МНО""
		|					ТОГДА _ОстаткиИОборотыМНО.Сумма
		|				ИНАЧЕ -_ОстаткиИОборотыМНО.Сумма
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ОтражениеМНО.Вариант = ""МНО""
		|					ТОГДА _ОстаткиИОборотыМНО.МНО
		|				ИНАЧЕ _ОстаткиИОборотыМНО.МНО.РасчетныйСчет
		|			КОНЕЦ,
		|			NULL
		|		ИЗ
		|			(ВЫБРАТЬ
		|				_ПериодыОтчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|				_ПериодыОтчета.ДатаОтчета КАК ДатаОтчета,
		|				_ПериодыОтчета.ДатаСЧА КАК ДатаСЧА,
		|				_ОстаткиИОборотыМНО.МНО КАК МНО,
		|				МАКСИМУМ(_ОстаткиИОборотыМНО.Период) КАК ДатаОстаткаМНО
		|			ИЗ
		|				_ПериодыОтчета КАК _ПериодыОтчета
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиИОборотыМНО КАК _ОстаткиИОборотыМНО
		|					ПО _ПериодыОтчета.СчетДоверительногоУправления = _ОстаткиИОборотыМНО.СчетДоверительногоУправления
		|						И _ПериодыОтчета.ДатаСЧА >= _ОстаткиИОборотыМНО.Период
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПериодыОтчета.СчетДоверительногоУправления,
		|				_ПериодыОтчета.ДатаОтчета,
		|				_ПериодыОтчета.ДатаСЧА,
		|				_ОстаткиИОборотыМНО.МНО) КАК ПериодыОстатковМНО
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ОстаткиИОборотыМНО КАК _ОстаткиИОборотыМНО
		|				ПО ПериодыОстатковМНО.СчетДоверительногоУправления = _ОстаткиИОборотыМНО.СчетДоверительногоУправления
		|					И ПериодыОстатковМНО.МНО = _ОстаткиИОборотыМНО.МНО
		|					И ПериодыОстатковМНО.ДатаОстаткаМНО = _ОстаткиИОборотыМНО.Период,
		|			(ВЫБРАТЬ
		|				""МНО"" КАК Вариант
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				""Денежные средства"") КАК ОтражениеМНО
		|		ГДЕ
		|			_ОстаткиИОборотыМНО.Сумма <> 0
		|			И &ВариантОтчета <> ""КонкурсПФР""
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ПериодыОтчета.СчетДоверительногоУправления,
		|			_ПериодыОтчета.ДатаОтчета,
		|			_ПериодыОтчета.ДатаСЧА,
		|			ВЫБОР
		|				КОГДА &ВариантОтчета = ""КонкурсПФР""
		|					ТОГДА ВЫБОР
		|							КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|									И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|								ТОГДА 2
		|							КОГДА РеквизитыЮрЛицДляОпределенияРезидентства.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.МеждународнаяФинансоваяОрганизация)
		|								ТОГДА ВЫБОР
		|										КОГДА _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус
		|											ТОГДА 8
		|										ИНАЧЕ 9
		|									КОНЕЦ
		|							КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|									И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|								ТОГДА ВЫБОР
		|										КОГДА Облигации.Гарант = &МинфинРоссии
		|												ИЛИ Облигации.Гарант = &ДомРФ
		|												ИЛИ _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf
		|												ИЛИ _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмиссииОтсутствуют
		|													И _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA
		|											ТОГДА 4
		|										ИНАЧЕ 9
		|									КОНЕЦ
		|							КОГДА Облигации.Ссылка ЕСТЬ НЕ NULL 
		|									И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|								ТОГДА ВЫБОР
		|										КОГДА Облигации.Гарант = &МинфинРоссии
		|												ИЛИ Облигации.Гарант = &ДомРФ
		|												ИЛИ _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмиссии_АКРА_RAEX_НеМеньше_BBBМинус_AAAsf
		|												ИЛИ _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмиссииОтсутствуют
		|													И _РезультатыПроверкиРейтинговОблигаций.РейтингиЭмитента_АКРА_RAEX_НеМеньше_AAA
		|											ТОГДА 5
		|										ИНАЧЕ 9
		|									КОНЕЦ
		|							КОГДА Акции.Ссылка ЕСТЬ НЕ NULL 
		|									И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|									И (_РезультатыПроверкиЛиквидностиАкций.ВключенаВСоставИндексаММВБ
		|										ИЛИ _РезультатыПроверкиЛиквидностиАкций.ВходитВПервыйКотировальныйЛист)
		|								ТОГДА 1
		|							КОГДА СтоимостьПереоценки.СчетДоверительногоУправления ЕСТЬ НЕ NULL 
		|								ТОГДА 9
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|								И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|							ТОГДА 4
		|						КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|								И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|							ТОГДА 5
		|						КОГДА Облигации.Ссылка ЕСТЬ НЕ NULL 
		|								И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|							ТОГДА 6
		|						КОГДА Акции.Ссылка ЕСТЬ НЕ NULL 
		|								И РеквизитыЮрЛицДляОпределенияРезидентства.РезидентРФ
		|							ТОГДА 7
		|						КОГДА СтоимостьПереоценки.СчетДоверительногоУправления ЕСТЬ НЕ NULL 
		|							ТОГДА 11
		|					КОНЕЦ
		|			КОНЕЦ,
		|			СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета,
		|			СтоимостьПереоценки.ЦеннаяБумага,
		|			СтоимостьПереоценки.Регистратор
		|		ИЗ
		|			_ПериодыОтчета КАК _ПериодыОтчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ВидыУчета КАК _ВидыУчета
		|				ПО _ПериодыОтчета.СчетДоверительногоУправления = _ВидыУчета.СчетДоверительногоУправления
		|					И _ПериодыОтчета.ДатаОтчета = _ВидыУчета.ДатаОтчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|				ПО (СтоимостьПереоценки.Организация = &Организация)
		|					И (СтоимостьПереоценки.СчетДоверительногоУправления = _ПериодыОтчета.СчетДоверительногоУправления)
		|					И (СтоимостьПереоценки.Активность)
		|					И (СтоимостьПереоценки.ВидУчета = _ВидыУчета.ВидУчета)
		|					И (СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки))
		|					И (СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|					И (СтоимостьПереоценки.Период = _ПериодыОтчета.ДатаСЧА)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|				ПО (СтоимостьПереоценки.ЦеннаяБумага = Облигации.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|				ПО (СтоимостьПереоценки.ЦеннаяБумага = Акции.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|				ПО (ЕСТЬNULL(Облигации.Эмитент, Акции.Эмитент) = Эмитенты.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|						&ДатаОкончания,
		|						Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|							И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮрЛицДляОпределенияРезидентства
		|				ПО (Эмитенты.ЮрФизЛицо = РеквизитыЮрЛицДляОпределенияРезидентства.ЮрФизЛицо)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _РезультатыПроверкиРейтинговОблигаций КАК _РезультатыПроверкиРейтинговОблигаций
		|				ПО (_РезультатыПроверкиРейтинговОблигаций.Облигация = СтоимостьПереоценки.ЦеннаяБумага)
		|					И (_РезультатыПроверкиРейтинговОблигаций.ДатаОтчета = _ПериодыОтчета.ДатаОтчета)
		|				ЛЕВОЕ СОЕДИНЕНИЕ _РезультатыПроверкиЛиквидностиАкций КАК _РезультатыПроверкиЛиквидностиАкций
		|				ПО (_РезультатыПроверкиЛиквидностиАкций.Акция = СтоимостьПереоценки.ЦеннаяБумага)
		|					И (_РезультатыПроверкиЛиквидностиАкций.ДатаОтчета = _ПериодыОтчета.ДатаОтчета)) КАК СтоимостьАктивов
		|		ПО _ПериодыОтчета.СчетДоверительногоУправления = СтоимостьАктивов.СчетДоверительногоУправления
		|			И _ПериодыОтчета.ДатаОтчета = СтоимостьАктивов.ДатаОтчета
		|			И (СтоимостьАктивов.ДатаСЧА ЕСТЬ НЕ NULL )
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПериодыОтчета.СчетДоверительногоУправления,
		|	_ПериодыОтчета.ДатаОтчета,
		|	СтоимостьАктивов.РазделОтчета,
		|	СтоимостьАктивов.Актив,
		|	_ПериодыОтчета.ВидДоговораДоверительногоУправления,
		|	_ПериодыОтчета.ДатаСЧА";
	
	#КонецОбласти
	
	Запрос.Выполнить();
	
	ДанныеОтчета	= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДанныеОтчета").ПолучитьДанные().Выгрузить();
	СчетаДУ			= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_СчетаДУ").ПолучитьДанные().Выгрузить();
	РеквизитыУК		= Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РеквизитыУК").ПолучитьДанные().Выгрузить();
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		ДанныеОтчета.Индексы.Добавить("ДатаОтчета");
		ДанныеОтчета.Индексы.Добавить("СчетДоверительногоУправления, ДатаОтчета");
		ДанныеОтчета.Индексы.Добавить("СчетДоверительногоУправления, ВидАктива, ДатаОтчета");
		
		Если ЭтотОбъект.ДетализацияПоАктиву Тогда
			ДанныеОтчета.Индексы.Добавить("СчетДоверительногоУправления, ВидАктива, Актив, ДатаОтчета");
			ДанныеОтчета.Сортировать("СчетДоверительногоУправления, АктивПредставление");
		КонецЕсли;
		
		СчетаДУ.Сортировать("СчетДоверительногоУправления");		
	Иначе
		ДанныеОтчета.Индексы.Добавить("ВидДоговораДоверительногоУправления, ДатаОтчета");
		ДанныеОтчета.Индексы.Добавить("ВидДоговораДоверительногоУправления, СчетДоверительногоУправления, ДатаОтчета");
		
		СчетаДУ.Сортировать("ВидДоговораДоверительногоУправления, СчетДоверительногоУправления");
	КонецЕсли;	
		
	КонтрольНаличияСЧА(ДанныеОтчета);
	
	// Формируем отчет
	
	ИмяМакета	= ?(ВариантОтчета = "КонкурсПФР", "МакетКонкурсПФР", "Макет");
	Макет		= ПолучитьМакет(ИмяМакета);
	
	ОбластьШапкаО	= Макет.ПолучитьОбласть("Шапка|Основная");
	ОбластьШапкаС	= Макет.ПолучитьОбласть("Шапка|Сумма");
	
	Если РеквизитыУК.Количество() > 0 Тогда
		ОбластьШапкаО.Параметры.НаименованиеУК = РеквизитыУК[0].ПолноеНаименованиеПоУставу;
	КонецЕсли;
	
	Результат.Вывести(ОбластьШапкаО);
	
	Для Каждого ДатаОтчета Из МассивОтчетныхДат Цикл
		ОбластьШапкаС.Параметры.ДатаОтчета = ДатаОтчета;
		Результат.Присоединить(ОбластьШапкаС);
	КонецЦикла;
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		
		Результат.Область(1, 1, 1, Результат.ШиринаТаблицы).Объединить();
		Результат.Область(2, 1, 2, Результат.ШиринаТаблицы).Объединить();
		
		ВывестиДоговоры(Результат, ДанныеОтчета, СчетаДУ, Новый Структура); 
		
	Иначе
		
		Результат.Область(1, 1, 1, Результат.ШиринаТаблицы).Объединить();
		Результат.Область(3, 2, 3, Результат.ШиринаТаблицы).Объединить();
			
		Если ЭтотОбъект.ОтборПоДоговорам Тогда
			МассивВидыДоговоровДоверительногоУправления = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ВидыДоговоров").ПолучитьДанные().Выгрузить().ВыгрузитьКолонку("ВидДоговораДоверительногоУправления");
		КонецЕсли;
		
		Для Каждого ВидДоговораДоверительногоУправления Из МассивВидыДоговоровДоверительногоУправления Цикл
			
			ПараметрыПоиска = Новый Структура("ВидДоговораДоверительногоУправления", ВидДоговораДоверительногоУправления);
			
			ВывестиСтроку(Результат, ДанныеОтчета, ВидДоговораДоверительногоУправления, , ПараметрыПоиска);
				
			ВывестиВидыАктивов(Результат, ДанныеОтчета, ПараметрыПоиска, , Ложь);
			
			Если ЭтотОбъект.ДетализацияПоДоговору Тогда
				
				НайденныеСтроки = СчетаДУ.НайтиСтроки(Новый Структура("ВидДоговораДоверительногоУправления", ВидДоговораДоверительногоУправления));
				
				ВывестиДоговоры(Результат, ДанныеОтчета, НайденныеСтроки, ПараметрыПоиска);
				
			КонецЕсли;
		
			Результат.ЗакончитьГруппуСтрок();
		
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("Итог", 0);
	ВывестиСтроку(Результат, ДанныеОтчета, "ИТОГ", , ПараметрыПоиска);
	ВывестиВидыАктивов(Результат, ДанныеОтчета, ПараметрыПоиска, Ложь, Ложь);
	
	#Область Заполнение_настроек_печати_и_фиксация_сессии_статистики
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, Механизм, Истина, ОриентацияСтраницы.Портрет);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	#КонецОбласти	
	
КонецПроцедуры

Процедура ВывестиДоговоры(Результат, ДанныеОтчета, Договоры, Знач ПараметрыПоиска)

	Для Каждого СтрокаСчетовДУ Из Договоры Цикл
		
		ПараметрыПоиска.Вставить("СчетДоверительногоУправления", СтрокаСчетовДУ.СчетДоверительногоУправления);
		
		ВывестиСтроку(Результат, ДанныеОтчета, СтрокаСчетовДУ.НаименованиеКлиента + " договор № " + СтрокаСчетовДУ.НомерДоговора + " от " + Формат(СтрокаСчетовДУ.ДатаЗаключения, "ДФ='dd.MM.yyyy ''г.'''"), , ПараметрыПоиска);
		
		ВывестиВидыАктивов(Результат, ДанныеОтчета, ПараметрыПоиска);
		
		ПараметрыПоиска.Удалить("СчетДоверительногоУправления");
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВывестиВидыАктивов(Результат, ДанныеОтчета, Знач ПараметрыПоиска, НачатьГруппуСтрок = Истина, ЗакончитьГруппуСтрок = Истина)
	
	Если НачатьГруппуСтрок Тогда
		Результат.НачатьГруппуСтрок();
	КонецЕсли;
	
	Для НомерВидаАктива = 1 По ВидыАктивов.Количество() Цикл
		
		ПараметрыПоиска.Вставить("ВидАктива", НомерВидаАктива);
		
		ВывестиСтроку(Результат, ДанныеОтчета, ВидыАктивов[НомерВидаАктива], , ПараметрыПоиска, Ложь);
		
		Если ЭтотОбъект.ДетализацияПоАктиву И Не ПараметрыПоиска.Свойство("Итог") Тогда
		
			Активы = ДанныеОтчета.Скопировать(ПараметрыПоиска, "Актив, АктивПредставление");
			Активы.Свернуть("Актив, АктивПредставление");
		
			ВывестиАктивы(Результат, ДанныеОтчета, Активы, ПараметрыПоиска);
			
		КонецЕсли;
		
		ПараметрыПоиска.Удалить("ВидАктива"); 
		
	КонецЦикла;
	
	Если ЗакончитьГруппуСтрок Тогда
		Результат.ЗакончитьГруппуСтрок();
	КонецЕсли;	
		
КонецПроцедуры

Процедура ВывестиАктивы(Результат, ДанныеОтчета, Активы, Знач ПараметрыПоиска)
	
	Результат.НачатьГруппуСтрок();
	
	Для Каждого СтрокаАктива Из Активы Цикл
		
		ПараметрыПоиска.Вставить("Актив", СтрокаАктива.Актив);
		
		ВывестиСтроку(Результат, ДанныеОтчета, СтрокаАктива.АктивПредставление, СтрокаАктива.Актив, ПараметрыПоиска, Ложь);
		
		ПараметрыПоиска.Удалить("Актив"); 
		
	КонецЦикла;
	
	Результат.ЗакончитьГруппуСтрок();
		
КонецПроцедуры

Процедура ВывестиСтроку(Результат, ДанныеОтчета, Показатель, РасшифровкаПоказателя, Знач ПараметрыПоиска, ЖирныйШрифт = Истина)
	
	Отступ = Макс(ПараметрыПоиска.Количество() - 1, 0);
	
	ВывестиОсновнуюСекцию(Результат, Показатель, РасшифровкаПоказателя, Отступ);
	
	Для Индекс = 0 По МассивОтчетныхДат.Количество() - 1 Цикл
		ДатаОтчета = МассивОтчетныхДат[Индекс];	
		ПараметрыПоиска.Вставить("ДатаОтчета", ДатаОтчета); 
		ВывестиСекциюСуммы(Результат, ДанныеОтчета, ПараметрыПоиска, Индекс);
		ПараметрыПоиска.Удалить("ДатаОтчета"); 
	КонецЦикла;
	
	ТекущаяОбласть = Результат.Область(Результат.ВысотаТаблицы, 1, Результат.ВысотаТаблицы, Результат.ШиринаТаблицы);
	
	ТекущийШрифт = ТекущаяОбласть.Шрифт;
	
	ТекущаяОбласть.Шрифт = Новый Шрифт(ТекущийШрифт,, ТекущийШрифт.Размер - Отступ, ЖирныйШрифт);;
	
КонецПроцедуры

Процедура ВывестиОсновнуюСекцию(Результат, Показатель, РасшифровкаПоказателя, Отступ)
	
	Если ОбластьПоказатель = Неопределено Тогда
		ОбластьПоказатель = Макет.ПолучитьОбласть("Показатель|Основная");
	КонецЕсли;
	
	ОбластьПоказатель.Параметры.Заполнить(Новый Структура("Показатель, РасшифровкаПоказателя", Показатель, РасшифровкаПоказателя));
	
	Результат.Вывести(ОбластьПоказатель);
	Результат.Область(Результат.ВысотаТаблицы, 1, Результат.ВысотаТаблицы, 1).Отступ = Отступ;
	
КонецПроцедуры

Процедура ВывестиСекциюСуммы(Результат, ДанныеОтчета, ПараметрыПоиска, ИндексСуммы)
	
	Если ОбластьСумма = Неопределено Тогда
		ОбластьСумма = Макет.ПолучитьОбласть("Показатель|Сумма");
	Иначе
		ОбластьСумма.Параметры.Заполнить(Новый Структура("Регистратор, Сумма"));
	КонецЕсли;
	
	Сумма = 0;
	МассивСчетовБезСЧА = Новый Массив;
	
	НайденныеСтроки = ДанныеОтчета.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		Если СтрокаДанных.ДатаСЧА = Null И СтрокаДанных.ПроверятьНаличиеСЧА Тогда
			МассивСчетовБезСЧА.Добавить(СтрокаДанных.СчетДоверительногоУправления);
		ИначеЕсли СтрокаДанных.Сумма <> Null Тогда
			Сумма = Сумма + СтрокаДанных.Сумма;
			ОбластьСумма.Параметры.Регистратор = СтрокаДанных.Регистратор;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьСумма.Параметры.Сумма = Сумма;
	
	Результат.Присоединить(ОбластьСумма);
	
	Если МассивСчетовБезСЧА.Количество() > 0 Тогда
		ТекущаяОбласть = Результат.Область(Результат.ВысотаТаблицы, 2 + ИндексСуммы, Результат.ВысотаТаблицы, 2 + ИндексСуммы);
		ТекущаяОбласть.ЦветТекста = Новый Цвет(255, 0, 0);
		
		Если ПараметрыПоиска.Свойство("СчетДоверительногоУправления") Тогда
			ТекущаяОбласть.Примечание.Текст = "По договору не зарегистрирована СЧА";
		Иначе
			ТекущаяОбласть.Примечание.Текст = "По договорам не зарегистрирована СЧА: " + Символы.ПС + СтрСоединить(МассивСчетовБезСЧА, Символы.ПС);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура КонтрольНаличияСЧА(ДанныеОтчета)
	
	СчетаДоверительногоУправленияСАктивами = Новый Соответствие;
	
	НайденныеСтроки = ДанныеОтчета.НайтиСтроки(Новый Структура("ДатаСЧА", Null));
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		
		СчетаДоверительногоУправленияСАктивамиНаДатуОтчета = СчетаДоверительногоУправленияСАктивами.Получить(СтрокаДанных.ДатаОтчета); 	
		
		Если СчетаДоверительногоУправленияСАктивамиНаДатуОтчета = Неопределено Тогда
			
			СчетаДоверительногоУправленияСАктивамиНаДатуОтчета =
				Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(
					СтрокаДанных.ДатаОтчета, Справочники.СчетаДоверительногоУправления.СтруктураДляОтбораСчетовДоверительногоУправления(ЭтотОбъект.Организация));
			
			СчетаДоверительногоУправленияСАктивами.Вставить(СтрокаДанных.ДатаОтчета, СчетаДоверительногоУправленияСАктивамиНаДатуОтчета);
					
		КонецЕсли;
		
		Если СчетаДоверительногоУправленияСАктивамиНаДатуОтчета.Найти(СтрокаДанных.СчетДоверительногоУправления, "СчетДоверительногоУправления") = Неопределено Тогда
			СтрокаДанных.ПроверятьНаличиеСЧА = Ложь; // Еще не было активов, СЧА не требуется
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("По договору '%1' не зарегистрировано СЧА на %2", СтрокаДанных.СчетДоверительногоУправления, Формат(СтрокаДанных.ДатаОтчета, "ДФ=dd.MM.yyyy")),
			СтрокаДанных.СчетДоверительногоУправления);
			
	КонецЦикла;

КонецПроцедуры
