#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза") Тогда
		// удалить весь этот блок "Если", кроме следующей строки
		Объект.Период.Вариант = ВариантСтандартногоПериода.Вчера;
	Иначе
		Объект.Период.ДатаНачала = '20250507';
		Объект.Период.ДатаОкончания = '20250507235959';
	КонецЕсли;
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.Организация.Видимость = ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияГиперссылка.Видимость = Не ЭтоПолноправныйПользователь;
	
	Элементы.ФормаОтладкаВывестиТаблицуСведений.Видимость = ЭтоПолноправныйПользователь;
	
	ТаблицаСведений = Новый ТаблицаЗначений;
	ТаблицаСведений.Колонки.Добавить("ДатаВозникновения", Новый ОписаниеТипов("Дата"));
	ТаблицаСведений.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаСведений.Колонки.Добавить("Обстоятельство", Новый ОписаниеТипов("СправочникСсылка.ОбстоятельстваВозникновенияКонфликтаИнтересов"));
	ТаблицаСведений.Колонки.Добавить("СвязанноеЛицо", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ТаблицаСведений.Колонки.Добавить("ПредметКонфликта", Метаданные.ОпределяемыеТипы.ПредметКонфликтаИнтересов.Тип);
	ТаблицаСведений.Колонки.Добавить("ТипОперации", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Макет");
	
	АдресТаблицыСведений = ПоместитьВоВременноеХранилище(ТаблицаСведений, ЭтаФорма.УникальныйИдентификатор);
	АдресМакета = ПоместитьВоВременноеХранилище(Макет, ЭтаФорма.УникальныйИдентификатор);
	
	ЭтаФорма.ДатаРасследования = "ТекущаяДата";
	
	ДобавитьРегистраторыОстатковДенежныхСредств();
	ВосстановитьДанныеИзНастроек();
	
	ЭтаФорма.СводныйОтчетАдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.СводныйОтчетАдресСКД 				= ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.СводныйОтчетАдресНастроек 			= ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
	УстановитьНеактуальностьСводногоОтчета(ЭтаФорма);
	
	Элементы.НадписьАнализОстатковНаНачало.Видимость = Ложь;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьНеактуальностьСводногоОтчета(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура АнализОстатковНаНачалоПериодаПриИзменении(Элемент)
	УстановитьНеактуальностьСводногоОтчета(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьНеактуальностьСводногоОтчета(ЭтаФорма);
КонецПроцедуры
 
&НаКлиенте
Процедура КонфликтыИнтересовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.КонфликтыИнтересов.ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыОтбора = Новый Структура("ДатаВозникновения, СчетДоверительногоУправления, Обстоятельство, ПредметКонфликта, СвязанноеЛицо");
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Элементы.КонфликтыИнтересов.ТекущиеДанные);
		ЗаполнитьДеталиКонфликта(ПараметрыОтбора, ЭтаФорма.ДеталиКонфликта, АдресТаблицыСведений, АдресМакета, Объект.ГруппаОбстоятельств);	
		
		Элементы.ДеталиКонфликта.ТекущаяОбласть = ДеталиКонфликта.Область(1, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДеталиКонфликта(ПараметрыОтбора, ДеталиКонфликта, АдресТаблицыСведений, АдресМакета, ГруппаОбстоятельств)
	
	ТаблицаСведений = ПолучитьИзВременногоХранилища(АдресТаблицыСведений);
	Макет = ПолучитьИзВременногоХранилища(АдресМакета);
	
	Если Ложь Тогда
		ДеталиКонфликта = Новый ТабличныйДокумент;
		ТаблицаСведений = Новый ТаблицаЗначений;
		Макет = Новый ТабличныйДокумент;
	КонецЕсли; 
	
	ДеталиКонфликта.Очистить();
	
	НайденныеСтроки = ТаблицаСведений.НайтиСтроки(ПараметрыОтбора);
	
	ИдентификаторОбстоятельства = ПараметрыОтбора.Обстоятельство.ИмяПредопределенныхДанных;
	
	Если ГруппаОбстоятельств = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.УказаниеБанкаРоссии6883У Тогда
	
		СоответствиеИдентификаторов = Новый Соответствие;
		СоответствиеИдентификаторов.Вставить("ДоговорОСтабилизацииЦен_6883", "ДоговорОСтабилизацииЦен");
		СоответствиеИдентификаторов.Вставить("ИспользованиеИнформации_6883", "ИспользованиеИнформации");
		СоответствиеИдентификаторов.Вставить("СделкаСоСвязаннымЛицом_6883", "СделкаСУправляющейКомпанией");
		СоответствиеИдентификаторов.Вставить("ЦенныеБумагиНаРазмещении_6883", "ЦенныеБумагиНаРазмещении");
		СоответствиеИдентификаторов.Вставить("ЧастотаСделок_6883", "ЧастотаСделок");
		СоответствиеИдентификаторов.Вставить("ЭмитентСвязанноеЛицо_6883", "ЭмитентСвязанноеЛицо");

		ИдентификаторОбстоятельства = СоответствиеИдентификаторов[ПараметрыОтбора.Обстоятельство.ИмяПредопределенныхДанных];
	
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка" + ИдентификаторОбстоятельства);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка" + ИдентификаторОбстоятельства);
	
	ДеталиКонфликта.Вывести(ОбластьШапка);
	
	Для каждого СтрокаДетали Из НайденныеСтроки Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаДетали);
		ДеталиКонфликта.Вывести(ОбластьСтрока);
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Процедура СводныйОтчетТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
		
		СтандартнаяОбработка = Ложь;
		Значение = ПолучитьЗначениеРасшифровки(ЭтаФорма.СводныйОтчетАдресДанныхРасшифровки, Расшифровка);
		ПростыеТипы = Новый ОписаниеТипов("Строка, Число, Дата, Булево, Неопределено");
		Если ЗначениеЗаполнено(Значение) И Не ПростыеТипы.СодержитТип(ТипЗнч(Значение)) Тогда
			
			ОткрытьЗначение(Значение);
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбстоятельствПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаВыполнитьАнализ(Команда)

	ИмяСправочника = "Справочник.ОбстоятельстваВозникновенияКонфликтаИнтересов";
	
	Если Объект.ГруппаОбстоятельств = ПредопределенноеЗначение(ИмяСправочника + ".УказаниеБанкаРоссии5511У")
		Или Объект.ГруппаОбстоятельств = ПредопределенноеЗначение(ИмяСправочника + ".УказаниеБанкаРоссии6883У") Тогда
		
		КомандаВыполнитьАнализНаСервере();
		СформироватьСводныйОтчет();
		СформироватьЖурналКИНаСервере();
		
	Иначе
		
		ТекстСообщения = СтрШаблон("Автоматическое выявление КИ по группе %1 не поддерживается", Объект.ГруппаОбстоятельств);
		Предупреждение(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОтметки(Команда)
	УстановитьОтметки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметки(Команда)
	УстановитьОтметки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьКонфликтыИнтересов(Команда)
	КомандаСоздатьКонфликтыИнтересовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкиОтбораОпераций(Команда)
	
	АдресНастроек = ПоместитьНастройкиВХранилище();
	
	Результат = ОткрытьФормуМодально("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов.Форма.НастройкиПоискаОбстоятельств", Новый Структура("АдресНастроек", АдресНастроек), ЭтаФорма);
	
	Если Результат = Истина Тогда
	
		УстановитьНеактуальностьСводногоОтчета(ЭтаФорма);
	
	КонецЕсли; 
	
	ЗагрузитьНастройкиИзХранилища(АдресНастроек);
		
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаКлиенте
Процедура УстановитьОтметки(Отметка)

	Для каждого Строка Из ЭтаФорма.КонфликтыИнтересов Цикл
		Если Элементы.КонфликтыИнтересов.ПроверитьСтроку(Строка.ПолучитьИдентификатор()) Тогда
			Строка.Создать = Отметка;
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура КомандаСоздатьКонфликтыИнтересовНаСервере()
	
	КонфликтыИнтересовТаблица = ЭтаФорма.КонфликтыИнтересов.Выгрузить();
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ОбъектНаСервере.СоздатьОбъектыКИ(КонфликтыИнтересовТаблица, ЭтаФорма.ДатаРасследования = "ТекущаяДата");
	
	ЭтаФорма.КонфликтыИнтересов.Загрузить(КонфликтыИнтересовТаблица);
	
КонецПроцедуры

#КонецОбласти 

#Область Выявление_конфликтов

&НаСервере
Процедура КомандаВыполнитьАнализНаСервере()
	
	Если Объект.ГруппаОбстоятельств = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.УказаниеБанкаРоссии5511У
		И ЭтаФорма.СчетаДоверительногоУправления.Количество() > 0 Тогда
		ОтборПоСчетам = ЭтаФорма.СчетаДоверительногоУправления;
	Иначе
		ОтборПоСчетам = Неопределено;
	КонецЕсли;
	
	ЭтаФорма.КонфликтыИнтересов.Очистить();
	
	ОбработкаНаСервере = РеквизитФормыВЗначение("Объект");
	КонфликтыИнтересовТаблица = ОбработкаНаСервере.ПолучитьКонликтыИнтересов(
		ЭтаФорма.НастройкиОтбораОбстоятельств.Выгрузить(), 
		ЭтаФорма.АдресТаблицыСведений,
		ОтборПоСчетам);
		
	ЭтаФорма.КонфликтыИнтересов.Загрузить(КонфликтыИнтересовТаблица);
	
КонецПроцедуры

#КонецОбласти 

#Область Отладка

&НаКлиенте
Процедура ОтладкаВывестиТаблицуСведений(Команда)
	
	ТаблицаСведений = ОтладкаВывестиТаблицуСведенийНаСервере();
	ТаблицаСведений.Показать();
	
КонецПроцедуры

&НаСервере
Функция ОтладкаВывестиТаблицуСведенийНаСервере()
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыСведений);
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ТаблицаЗначений, , , , Истина);    
	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
	
	Возврат ПараметрыВывода.ДокументРезультат;
	
КонецФункции


#КонецОбласти 
 
#Область Настройки_отбора_обстоятельств

&НаСервере
Процедура ВосстановитьДанныеИзНастроек()

	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов/НастройкиОтбора");
	Если ТипЗнч(СохраненныеНастройки) = Тип("Соответствие") И СохраненныеНастройки.Получить(Объект.Организация) <> Неопределено Тогда
		ЭтаФорма.НастройкиОтбораОбстоятельств.Загрузить(СохраненныеНастройки.Получить(Объект.Организация));
	Иначе
		ЗаполнитьНастройкиПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ЭтаФорма.НастройкиОтбораОбстоятельств.Загрузить(ОбъектНаСервере.ЗаполнитьНастройкиПоУмолчанию());
	
КонецПроцедуры
 
&НаСервере
Процедура ДобавитьРегистраторыОстатковДенежныхСредств()

	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипыРегистраторов = Метаданные.РегистрыНакопления.ОстаткиДенежныхСредств.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	
	Для каждого ТипРегистратора Из ТипыРегистраторов Цикл
		
		ДокументМД = Метаданные.НайтиПоТипу(ТипРегистратора);
		
		НовыйРеквизит = Новый РеквизитФормы(
			"ДС_" + ДокументМД.Имя,
			Новый ОписаниеТипов("Булево"),
			"НастройкиОтбораОбстоятельств",
			ДокументМД.Синоним,
			Истина);
			
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЦикла; 
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 

КонецПроцедуры

&НаСервере
Функция ПоместитьНастройкиВХранилище()

	Возврат ПоместитьВоВременноеХранилище(ЭтаФорма.НастройкиОтбораОбстоятельств.Выгрузить(), ЭтаФорма.УникальныйИдентификатор);

КонецФункции
 
&НаСервере
Процедура ЗагрузитьНастройкиИзХранилища(АдресНастроек)

	ТаблицаНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ЭтаФорма.НастройкиОтбораОбстоятельств.Загрузить(ТаблицаНастроек);
	УдалитьИзВременногоХранилища(АдресНастроек);
	
	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов/НастройкиОтбора");
	Если ТипЗнч(СохраненныеНастройки) <> Тип("Соответствие") Тогда
		СохраненныеНастройки = Новый Соответствие;
	КонецЕсли;
	
	СохраненныеНастройки.Вставить(Объект.Организация, ТаблицаНастроек);
	ХранилищеСистемныхНастроек.Сохранить("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов/НастройкиОтбора",, СохраненныеНастройки);
	
КонецПроцедуры

#КонецОбласти 

#Область Сводный_отчет

&НаКлиенте
Процедура КомандаНастройкаСводногоОтчета(Команда)
	
	Если Элементы.СводныйОтчетТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать Тогда
	
		ПараметрыФормы = Новый Структура("АдресСКД, АдресНастроек", ЭтаФорма.СводныйОтчетАдресСКД, ЭтаФорма.СводныйОтчетАдресНастроек);
		Результат = ОткрытьФормуМодально("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов.Форма.НастройкиКомпоновкиСводногоОтчета", ПараметрыФормы);
		Если Результат <> Неопределено Тогда
			СформироватьСводныйОтчет();
		КонецЕсли;		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСводныйОтчет()

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.СводныйОтчетТабличныйДокумент, "ФОРМИРОВАНИЕОТЧЕТА");
	ЭтаФорма.СводныйОтчетТабличныйДокумент = ПолучитьТабличныйСводногоОтчета();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.СводныйОтчетТабличныйДокумент, "НЕИСПОЛЬЗОВАТЬ");

КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйСводногоОтчета()

	ВнешниеНаборыДанных = Новый Структура("ТаблицаСведений", ПолучитьИзВременногоХранилища(ЭтаФорма.АдресТаблицыСведений));
	
	Настройки = ПолучитьИзВременногоХранилища(ЭтаФорма.СводныйОтчетАдресНастроек);
	
	СКД = СоздатьСКДПоТаблицеСведений(ВнешниеНаборыДанных.ТаблицаСведений, Настройки);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ЭтаФорма.СводныйОтчетАдресДанныхРасшифровки);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция СоздатьСКДПоТаблицеСведений(ТаблицаСведений, Настройки)

	// создаем новую СКД
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
		
	// добавляем набор данных Объект
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ТаблицаСведений";
	НаборДанных.ИмяОбъекта = "ТаблицаСведений";
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	
	Для каждого Колонка Из ТаблицаСведений.Колонки Цикл
	
		НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле = Колонка.Имя;
		НовоеПоле.ПутьКДанным = Колонка.Имя; 
		ЗаполнитьЗначенияСвойств(НовоеПоле, Колонка);
	
	КонецЦикла;
	
	ПолеИтога = СКД.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = "ДатаВозникновения";
	ПолеИтога.Выражение = "Минимум(ДатаВозникновения)";
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		//Восстановить настройки
	Иначе
		
		Настройки = Новый НастройкиКомпоновкиДанных;
		НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
		Для каждого ИмяПоля Из ПолучитьПоляГруппировки() Цикл
		
			Поле = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			Поле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
		КонецЦикла; 
		
		ДетальныеЗаписи = НоваяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных")); 
		ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ДетальныеЗаписи.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
		Для каждого ИмяПоля Из ПолучитьПоляВыбора() Цикл
			
			ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбор.Использование = Истина;
			ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
		КонецЦикла;
		
		Для каждого ИмяПоля Из ПолучитьПоляПорядка() Цикл
		
			ПолеПорядка = Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
		КонецЦикла;
		
		Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
		
		ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.СводныйОтчетАдресНастроек);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.СводныйОтчетАдресСКД);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.СводныйОтчетТабличныйДокумент, "НеИспользовать");
	
	Возврат СКД;
	
КонецФункции

Функция ПолучитьПоляГруппировки()

	ПоляГруппировки = Новый Массив;
	ПоляГруппировки.Добавить("Обстоятельство");
	ПоляГруппировки.Добавить("ПредметКонфликта");
	ПоляГруппировки.Добавить("ТипОперации");
	
	Возврат ПоляГруппировки;

КонецФункции

Функция ПолучитьПоляВыбора()

	ПоляВыбора = Новый Массив;
	ПоляВыбора.Добавить("СчетДоверительногоУправления");
	ПоляВыбора.Добавить("ЦеннаяБумага");
	ПоляВыбора.Добавить("Операция");
	ПоляВыбора.Добавить("ДатаВозникновения");
	
	Возврат ПоляВыбора;

КонецФункции

&НаСервере
Функция ПолучитьПоляПорядка()

	ПоляПорядка = Новый Массив;
	ПоляПорядка.Добавить("Обстоятельство");
	ПоляПорядка.Добавить("ПредметКонфликта");
	ПоляПорядка.Добавить("ТипОперации");
	ПоляПорядка.Добавить("СчетДоверительногоУправления");
	ПоляПорядка.Добавить("ЦеннаяБумага");
	ПоляПорядка.Добавить("Операция");
	
	Возврат ПоляПорядка;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНеактуальностьСводногоОтчета(ЭтаФорма)

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.СводныйОтчетТабличныйДокумент, "НЕАКТУАЛЬНОСТЬ", "Отчет не сформирован. Нажмите ""Выполнить анализ"" для получения отчета.");

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРасшифровки(АдресВХарилище, Расшифровка)

	Значение = ПолучитьИзВременногоХранилища(АдресВХарилище);
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
	    // расшифровка результатов проверки
		ДанныеРасшифровки = Значение.ДанныеРасшифровки;
	Иначе
		// расшифровка отчета по базису
		ДанныеРасшифровки = Значение;
	КонецЕсли; 
	
	Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;

КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	ИмяПредопределенного = "Справочник.ОбстоятельстваВозникновенияКонфликтаИнтересов.УказаниеБанкаРоссии6883У";
	Видимость = (Объект.ГруппаОбстоятельств = ПредопределенноеЗначение(ИмяПредопределенного));
	Элементы.Клиент.Видимость = Видимость;
	Элементы.СтраницаЖурнал.Видимость = Видимость;
	Элементы.СчетаДоверительногоУправления.Видимость = Не Видимость;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗначения(Команда)
	
	ТекущаяКолонка = Элементы.КонфликтыИнтересов.ТекущийЭлемент.Имя;
	
	Если ТекущаяКолонка = "КонфликтыИнтересовДатаВыявления" 
		Или ТекущаяКолонка = "КонфликтыИнтересовРешениеОбОтказеОтПредотвращения" 
		Или ТекущаяКолонка = "КонфликтыИнтересовСпособРаскрытияИнформации" 
		Или ТекущаяКолонка = "КонфликтыИнтересовДатаРаскрытияИнформации" Тогда
		
		ИмяКолонки = СтрЗаменить(ТекущаяКолонка, "КонфликтыИнтересов", "");
		
		Значение = Элементы.КонфликтыИнтересов.ТекущиеДанные[ИмяКолонки];
		Если ВвестиЗначение(Значение, "Новое значение") Тогда
		
			Для каждого Строка Из Элементы.КонфликтыИнтересов.ВыделенныеСтроки Цикл
			
				ДанныеСтроки = ЭтаФорма.КонфликтыИнтересов.НайтиПоИдентификатору(Строка);
				ДанныеСтроки[ИмяКолонки] = Значение;
			
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаАнализСвязанныхНаНачалоПериода(Команда)

	Элементы.ФормаКомандаАнализСвязанныхНаНачалоПериода.Пометка = Не Элементы.ФормаКомандаАнализСвязанныхНаНачалоПериода.Пометка;
	Объект.АнализОстатковНаНачалоПериода = Элементы.ФормаКомандаАнализСвязанныхНаНачалоПериода.Пометка;
	Элементы.НадписьАнализОстатковНаНачало.Видимость = Объект.АнализОстатковНаНачалоПериода;
	
КонецПроцедуры

#КонецОбласти 

#Область Журнал_КИ

&НаСервере
Процедура СформироватьЖурналКИНаСервере()

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектНаСервере.СформироватьЖурналКИ(, ЭтаФорма.ВключитьДействующиеКИ);

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЭтаФорма.Журнал = Результат.ДокументРезультат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьЖурнал(Команда)
	СформироватьЖурналКИНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповаяОбработка(Команда)
	ПараметрыФормы = Новый Структура("Организация, ГруппаОбстоятельств");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	ОткрытьФорму("ВнешняяОбработка._ВыявлениеКонфликтовИнтересов.Форма.ГрупповаяОбработка", 
		ПараметрыФормы, 
		ЭтаФорма, 
		ЭтаФорма,,,, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти