Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Инвентаризационная ведомость", 
		"0.03", 
		"", 
		Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура Сформировать(ДокументРезультат)	Экспорт
		
	ДокументРезультат.Очистить();    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						ТОГДА ""Государственная (ГКО) облигация""
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА ""Субфедеральная облигация""
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|						ТОГДА ""Корпоративная облигация""
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
		|						ТОГДА ""Еврооблигация""
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|						ТОГДА ""Муниципальная облигация""
		|					КОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
		|						ТОГДА ""Ипотечная облигация""
		|				КОНЕЦ
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Вид,
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерГосРегистрации,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Номинал
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Номинал,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Акции).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).Эмитент
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Эмитент,
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	БухПартииЦенныхБумагОстаткиЕПС.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстаткиЕПС.СтоимостьОстаток + БухПартииЦенныхБумагОстаткиЕПС.ПереоценкаОстаток + БухПартииЦенныхБумагОстаткиЕПС.ДисконтПремияНачисленныйОстаток + БухПартииЦенныхБумагОстаткиЕПС.СтоимостьКупонаОстаток + БухПартииЦенныхБумагОстаткиЕПС.ПереоценкаКупонаОстаток + БухПартииЦенныхБумагОстаткиЕПС.КорректировкаЭСПОстаток - БухПартииЦенныхБумагОстаткиЕПС.СуммаРезервовПодОбесценениеОстаток КАК СтоимостьОстаток
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиЕПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Остатки.Вид + "", "" + _Остатки.Эмитент.Наименование + "", "" + _Остатки.НомерГосРегистрации КАК Вид,
		|	"""" КАК НомерФормы,
		|	_Остатки.НомерГосРегистрации КАК Код,
		|	""штуки"" КАК ЕдиницаИзмерения,
		|	""796"" КАК КодЕдиницыИзмерения,
		|	"""" КАК СНомера,
		|	"""" КАК ПоНомер,
		|	"""" КАК Серия,
		|	_Остатки.Номинал КАК Номинал,
		|	_Остатки.КоличествоОстаток КАК Количество,
		|	_Остатки.СтоимостьОстаток КАК Стоимость
		|ИЗ
		|	_Остатки КАК _Остатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вид
		|ИТОГИ
		|	СУММА(Стоимость)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ЭтотОбъект.Период)); 
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);     
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ЭтотОбъект.Период, Организация, СчетДоверительногоУправления);
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.Период = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") ;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	НомерПП = 1;
	
	Пока Выборка.Следующий() Цикл   
		ВыборкаЦБ = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаЦБ.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаЦБ); 
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ДокументРезультат.Вывести(ОбластьСтрока);
			
			НомерПП = НомерПП + 1;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка, "Стоимость");
		ДокументРезультат.Вывести(ОбластьИтог);
		
	КонецЦикла;
	
КонецПроцедуры	