
Функция ДоступныеМакеты(Документ, СчетДоверительногоУправления) Экспорт
	
	ДоступныеМакеты = Новый СписокЗначений;
	
	// Получаем фильтрующие свойства
	
	СчетДУ = ?(ЗначениеЗаполнено(Документ),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "СчетДоверительногоУправления"),
		СчетДоверительногоУправления);
		
	Если ЗначениеЗаполнено(СчетДУ) Тогда	
		
		// Заполняем список доступных макетов
		
		Если ЗначениеЗаполнено(Документ) Тогда
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда
			
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_ЦБ");
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_Общий_Будущее");
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_Общий_Эволюция");

			Иначе

				РеквизитыСчетаДУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетДУ, "ВидДоговораДоверительногоУправления");

				Если РеквизитыСчетаДУ.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда 
					ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_ДС_ПР");
				Иначе
					ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_ДС");
				КонецЕсли;
				
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_ДС_2021");
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_Общий_Будущее");
				ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_Общий_Эволюция");
				
			КонецЕсли;
			
		Иначе	
			
			ДобавитьМакетВСписок(ДоступныеМакеты, "Макет_Период");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДоступныеМакеты;	
	
КонецФункции

Функция ДобавитьМакетВСписок(СписокМакет, ИмяМакета)
	
	Вариант = Метаданные.Обработки.ПечатьАктовПриемаПередачиИмущества.Макеты.Найти(ИмяМакета);
	
	СписокМакет.Добавить(ИмяМакета, Вариант.Синоним);
	
КонецФункции
