
&НаКлиенте
Процедура ДоступностьПриИзменении(Элемент)
	Объект.Общий = (ЭтаФорма.Доступен = 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Доступен = ?(Объект.Общий, 1, 0);
	Элементы.ГруппаПолныеПрава.Видимость = РольДоступна("ПолныеПрава");
	
	Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
		ЭтаФорма.АдресНастроек = ПоместитьВоВременноеХранилище(Параметры.ЗначениеКопирования.Настройки, ЭтаФорма.УникальныйИдентификатор);
	ИначеЕсли Не Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.АдресНастроек = ПоместитьВоВременноеХранилище(Параметры.Ключ.Настройки, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПустаяСтрока(ЭтаФорма.АдресНастроек) Тогда
		ТекущийОбъект.Настройки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресНастроек);
	КонецЕсли;
	
КонецПроцедуры
