// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Оборотно-сальдовая ведомость с партиями",
		"0.18",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РаботаСБухгалтерскимиОтчетами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	Форма = Новый Структура;
	
	// своего менеджера нет т.к. отчет внешний - используем менеджер ОСВ
	МенеджерОтчета = Отчеты["ОборотноСальдоваяВедомость"];
	
	Форма.Вставить("НаборПоказателей", МенеджерОтчета.ПолучитьНаборПоказателей());
	Форма.Вставить("Результат", Новый ТабличныйДокумент);
	Форма.Вставить("ВыводитьПодвал", Ложь);
	Форма.Вставить("ВыводитьЗаголовок", Ложь);
	Форма.Вставить("ВыводитьЕдиницуИзмерения", Ложь);
	Форма.Вставить("МакетОформления", "");
	Форма.Вставить("Отчет", ЭтотОбъект);
	
	// ПриЗагрузкеПользовательскихНастроекНаСервере
	Если НастройкиОтчета.Свойство("ВариантОтчета") И ТипЗнч(НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(НастройкиОтчета.ВариантОтчета);
		Настройки = ВариантОтчета.Настройки.Получить();
	КонецЕсли;
	
	ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, Настройки);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Настройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	Настройки.ДополнительныеСвойства.Свойство("ВыводитьПодвал", Форма.ВыводитьПодвал);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	КонецЕсли;	
	
	// АвтоматическоеФормирование
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.НачалоПериода = НастройкиОтчета.Период.ДатаНачала; 
	ЭтотОбъект.КонецПериода = НастройкиОтчета.Период.ДатаОкончания; 
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	// АвтоматическоеФормированиеНаСервере
	АдресХранилища = ПоместитьВоВременноеХранилище("", Новый УникальныйИдентификатор);
	ДополнительныеСвойства = ЭтотОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", 	Форма.ВыводитьЗаголовок);
	ДополнительныеСвойства.Вставить("ВыводитьПодвал", 		Форма.ВыводитьПодвал);

	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета(Форма);
	//РаботаСБухгалтерскимиОтчетами.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	СформироватьОтчетМодуль(ПараметрыОтчета, АдресХранилища);
	РезультатВыполнения 	= ПолучитьИзВременногоХранилища(АдресХранилища);
	Форма.Результат     	= РезультатВыполнения.Результат;

	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Форма.Результат, "Отчет.ОборотноСальдоваяВедомость");
	НастройкиОтчета.Вставить("Результат", Форма.Результат);
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		УдалитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли; 
	
КонецПроцедуры
 
Функция ПодготовитьПараметрыОтчета(Форма)

	МакетОформления = "";
	ПараметрМакетОформления = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПараметрВывода(ЭтотОбъект.КомпоновщикНастроек.Настройки, "МакетОформления");
	Если ПараметрМакетОформления.Использование И Не ПустаяСтрока(ПараметрМакетОформления.Значение) Тогда
		МакетОформления = ПараметрМакетОформления.Значение;
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , ЭтотОбъект.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , ЭтотОбъект.КонецПериода);
	ПараметрыОтчета.Вставить("СчетДоверительногоУправления"     , ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , ЭтотОбъект.ПоказательБУ);
	ПараметрыОтчета.Вставить("ПоказательВалютнаяСумма"          , ЭтотОбъект.ПоказательВалютнаяСумма);
	ПараметрыОтчета.Вставить("ВыводитьЗабалансовыеСчета"        , ЭтотОбъект.ВыводитьЗабалансовыеСчета);
	ПараметрыОтчета.Вставить("РазмещениеДополнительныхПолей"    , ЭтотОбъект.РазмещениеДополнительныхПолей);
	ПараметрыОтчета.Вставить("ПоСубсчетам"                      , ЭтотОбъект.ПоСубсчетам);
	ПараметрыОтчета.Вставить("Группировка"                      , ЭтотОбъект.Группировка.Выгрузить());
	ПараметрыОтчета.Вставить("ДополнительныеПоля"               , ЭтотОбъект.ДополнительныеПоля.Выгрузить());
	ПараметрыОтчета.Вставить("РазвернутоеСальдо"                , ЭтотОбъект.РазвернутоеСальдо.Выгрузить());
	ПараметрыОтчета.Вставить("РежимРасшифровки"                 , ЭтотОбъект.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , Форма.ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , Форма.ВыводитьПодвал);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , Новый ДанныеРасшифровкиКомпоновкиДанных);
	ПараметрыОтчета.Вставить("МакетОформления"                  , Форма.МакетОформления);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ЭтотОбъект.СхемаКомпоновкиДанных);
//	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , "_ОборотноСальдоваяВедомостьПоПартиям");
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , "ОборотноСальдоваяВедомость");
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты["ОборотноСальдоваяВедомость"].ПолучитьНаборПоказателей());
    ПараметрыОтчета.Вставить("ВыводитьЕдиницуИзмерения"         , Форма.ВыводитьЕдиницуИзмерения);
	ПараметрыОтчета.Вставить("УчетныйРегистр"                   , ЭтотОбъект.УчетныйРегистр);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица); 	
	ПараметрыОтчета.Вставить("СтруктураДанныхКонтактногоЛица"	, СтруктураДанныхКонтактногоЛица);
	
	Возврат ПараметрыОтчета;

КонецФункции

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(ФормаОтчета, Настройки, ЗагружатьТолькоРеквизиты = Ложь) Экспорт

	Если Настройки = Неопределено Тогда
		// Установка настроек по умолчанию
		УстановитьНастройкиПоУмолчанию(ФормаОтчета);		
	Иначе 
		// Восстановление сохраненных настроек
		Если Настройки.ДополнительныеСвойства.Свойство("ДанныеОтчета") Тогда
			ДополнительныеСвойства = Настройки.ДополнительныеСвойства.ДанныеОтчета.Получить();
			МетаданныеОтчета = ЭтотОбъект.Метаданные();
			Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл
				
				//организация должна текущая браться
				Если ЭлементСтруктуры.Ключ = "Организация" Тогда
					Продолжить;
				КонецЕсли;
				
				// Восстановление реквизитов отчета
				Если Не (МетаданныеОтчета.Реквизиты.Найти(ЭлементСтруктуры.Ключ) = Неопределено И 
					МетаданныеОтчета.ТабличныеЧасти.Найти(ЭлементСтруктуры.Ключ) = Неопределено) Тогда
					Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
						ФормаОтчета.Отчет[ЭлементСтруктуры.Ключ].Загрузить(ЭлементСтруктуры.Значение);
					ИначеЕсли ЭлементСтруктуры.Ключ <> "РежимРасшифровки" Тогда
						ФормаОтчета.Отчет[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
					КонецЕсли;
				КонецЕсли;
				
				// Восстановление реквизитов формы
				Если ЭлементСтруктуры.Ключ = "ВыводитьЗаголовок" И ФормаОтчета.Свойство("ВыводитьЗаголовок") Тогда
					ФормаОтчета.ВыводитьЗаголовок = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "ВыводитьПодвал" И ФормаОтчета.Свойство("ВыводитьПодвал") Тогда
					ФормаОтчета.ВыводитьПодвал = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "ВыводитьЕдиницуИзмерения" И ФормаОтчета.Свойство("ВыводитьЕдиницуИзмерения") Тогда
					ФормаОтчета.ВыводитьЕдиницуИзмерения = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "ВыводитьДиаграмму" И ФормаОтчета.Свойство("ВыводитьДиаграмму") Тогда
					ФормаОтчета.ВыводитьДиаграмму = ЭлементСтруктуры.Значение;
				ИначеЕсли ЭлементСтруктуры.Ключ = "МакетОформления" И ФормаОтчета.Свойство("МакетОформления") Тогда
					ФормаОтчета.МакетОформления = ЭлементСтруктуры.Значение;
					РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(
						ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки, 
						"МакетОформления", ФормаОтчета.МакетОформления);
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ДополнительныеСвойства.Свойство("ВыводитьДиаграмму") И ФормаОтчета.Свойство("ВыводитьДиаграмму") Тогда
				
				ФормаОтчета.ВыводитьДиаграмму = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		Если Не ЗагружатьТолькоРеквизиты Тогда
			ТекущиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки;
			
			// Установка пользовательских настроек
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "Отбор";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "Порядок";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
			
			// Перенос пользовательских настроек в основные
			ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
			ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ФормаОтчета.Отчет.КомпоновщикНастроек.ПолучитьНастройки());
			
			// Очистка пользовательских настроек
			ТекущиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки;
			ТекущиеНастройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
			ТекущиеНастройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
			ТекущиеНастройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
		КонецЕсли;		
	КонецЕсли;
	
	Если ФормаОтчета.Свойство("МинимальныйВидПериода") Тогда
		МинимальныйВидПериода = ФормаОтчета.МинимальныйВидПериода;
	Иначе
		МинимальныйВидПериода = Неопределено;
	КонецЕсли;
	
	Если ФормаОтчета.Отчет.ДополнительныеПоля.НайтиСтроки(Новый Структура("Поле", "Счет.Наименование")).Количество() = 0 Тогда
		НоваяСтрока = ФормаОтчета.Отчет.ДополнительныеПоля.Добавить();
		НоваяСтрока.Представление = "Выводить наименование счета";
		НоваяСтрока.Поле          = "Счет.Наименование";
		НоваяСтрока.Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиПоУмолчанию(ФормаОтчета) Экспорт
	
	Отчет = ФормаОтчета.Отчет;
	
	Если Отчет.Свойство("НачалоПериода") Тогда
		Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.Свойство("КонецПериода") Тогда
		Отчет.КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.Свойство("Организация") Тогда
		Отчет.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Если Отчет.Свойство("СальдоНаНачалоДт") Тогда
		Отчет.СальдоНаНачалоДт   = Истина;	
		Отчет.СальдоНаНачалоКт   = Истина;
		Отчет.СальдоНаКонецДт    = Истина;
		Отчет.СальдоНаКонецКт    = Истина;
		Отчет.ОборотыЗаПериодДт  = Истина;
		Отчет.ОборотыЗаПериодКт  = Истина;
		Отчет.ОборотыСоСчетамиДт = Истина;
		Отчет.ОборотыСоСчетамиКт = Истина;
	КонецЕсли;
	
	ИдентификаторОбъекта = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьИдентификаторОбъекта(ФормаОтчета);
	Если ИдентификаторОбъекта = "_ОборотноСальдоваяВедомостьПоПартиям" Тогда
		Если Отчет.ДополнительныеПоля.НайтиСтроки(Новый Структура("Поле", "Счет.Наименование")).Количество() = 0 Тогда
			НоваяСтрока = ФормаОтчета.Отчет.ДополнительныеПоля.Добавить();
			НоваяСтрока.Представление = "Выводить наименование счета";
			НоваяСтрока.Поле          = "Счет.Наименование";
			НоваяСтрока.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Установка начальных значений Группировки
	Если Отчет.Свойство("Группировка") Тогда
		Отчет.Группировка.Очистить();
		Для Каждого ЭлементСтруктуры Из Отчет.КомпоновщикНастроек.Настройки.Структура Цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				Для Каждого Серия Из ЭлементСтруктуры.Серии Цикл
					Если Серия.Имя = "Группировка" Тогда
						РаботаСБухгалтерскимиОтчетами.ЗаполнитьГруппировкиИзНастроек(Отчет.КомпоновщикНастроек, Серия, Отчет.Группировка);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Для Каждого Точка Из ЭлементСтруктуры.Точки Цикл
					Если Точка.Имя = "Группировка" Тогда
						РаботаСБухгалтерскимиОтчетами.ЗаполнитьГруппировкиИзНастроек(Отчет.КомпоновщикНастроек, Точка, Отчет.Группировка);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
				Для Каждого Колонка Из ЭлементСтруктуры.Колонки Цикл
					Если Колонка.Имя = "Группировка" Тогда
						РаботаСБухгалтерскимиОтчетами.ЗаполнитьГруппировкиИзНастроек(Отчет.КомпоновщикНастроек, Колонка, Отчет.Группировка);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Для Каждого Строка Из ЭлементСтруктуры.Строки Цикл
					Если Строка.Имя = "Группировка" Тогда
						РаботаСБухгалтерскимиОтчетами.ЗаполнитьГруппировкиИзНастроек(Отчет.КомпоновщикНастроек, Строка, Отчет.Группировка);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Если ЭлементСтруктуры.Имя = "Группировка" Тогда
					Отчет.Группировка.Очистить();
					РаботаСБухгалтерскимиОтчетами.ЗаполнитьГруппировкиИзНастроек(Отчет.КомпоновщикНастроек, ЭлементСтруктуры, Отчет.Группировка);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отчет.Свойство("Интервалы") Тогда
		Отчет.Интервалы.Очистить();
		
		НоваяСтрока = Отчет.Интервалы.Добавить();
		НоваяСтрока.Значение      = 7;
		НоваяСтрока.Представление = "До 7 дней";
		
		НоваяСтрока = Отчет.Интервалы.Добавить();
		НоваяСтрока.Значение      = 15;
		НоваяСтрока.Представление = "От 8 до 15 дней";
		
		НоваяСтрока = Отчет.Интервалы.Добавить();
		НоваяСтрока.Значение      = 30;
		НоваяСтрока.Представление = "От 16 до 30 дней";
		
		НоваяСтрока = Отчет.Интервалы.Добавить();
		НоваяСтрока.Значение      = 60;
		НоваяСтрока.Представление = "От 31 до 60 дней";
		
		НоваяСтрока = Отчет.Интервалы.Добавить();
		НоваяСтрока.Значение      = 90;
		НоваяСтрока.Представление = "От 61 до 90 дней";
	КонецЕсли;
	
	Если Отчет.Свойство("Период") Тогда
		Отчет.Период = ТекущаяДата();
	КонецЕсли;
	
	Если ФормаОтчета.Свойство("ВыводитьЗаголовок") Тогда
		ФормаОтчета.ВыводитьЗаголовок = Истина;
	КонецЕсли;
	
	Если ФормаОтчета.Свойство("ВыводитьДиаграмму") Тогда
		ФормаОтчета.ВыводитьДиаграмму = Истина;
	КонецЕсли;
	
	Если Отчет.Свойство("РазмещениеДополнительныхПолей") Тогда
		Отчет.РазмещениеДополнительныхПолей = РаботаСБухгалтерскимиОтчетами.ПолучитьРазмещениеДополнительныхПолей(Отчет.КомпоновщикНастроек);
	КонецЕсли;
	
	Если Отчет.Свойство("Группировка") И Отчет.Свойство("ДополнительныеПоля") Тогда
		РаботаСБухгалтерскимиОтчетами.ЗаполнитьДополнительныеПоляИзНастроек(Отчет.КомпоновщикНастроек, Отчет.ДополнительныеПоля, Отчет.Группировка);
	КонецЕсли;
	
	Если Отчет.Свойство("ПоказательПоступление") Тогда
		Отчет.ПоказательПоступление = Истина;
	КонецЕсли;
	Если Отчет.Свойство("ПоказательРасход") Тогда
		Отчет.ПоказательРасход = Истина;
	КонецЕсли;
	
	Если Отчет.Свойство("ПоказательЗадолженность") Тогда
		Отчет.ПоказательЗадолженность = Истина;
	КонецЕсли;
	Если Отчет.Свойство("ПоказательПросроченнаяЗадолженность") Тогда
		Отчет.ПоказательПросроченнаяЗадолженность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

&НаСервере
Функция СформироватьОтчетМодуль(ПараметрыОтчета, АдресХранилища = Неопределено)
		
	ВыводитьПолностью = Истина;
	
	Отказ = Ложь;
	ДанныеРасшифровкиОбъект = Неопределено;
	ПараметрыИсполненияОтчета = Неопределено;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация, НачалоПериода,КонецПериода,СчетДоверительногоУправления,ПоСубсчетам,
																																		  |ВыводитьЗабалансовыеСчета,РазмещениеДополнительныхПолей,ПоказательБУ,ПоказательВалютнаяСумма,
																																		  |РежимРасшифровки,УчетныйРегистр,скПоЛицевомуСчету,скПоПартиям");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	МенеджерОтчета = ЭтотОбъект;
	
	//МенеджерОтчета = Отчеты[ПараметрыОтчета.ИдентификаторОтчета];
	
	Попытка
		ПараметрыИсполненияОтчета = МенеджерОтчета.ПолучитьПараметрыИсполненияОтчета();
	Исключение
		// Запись в журнал регистрации не требуется
	КонецПопытки;
	
	ИспользоватьВнешниеНаборыДанных            = Ложь;
	ИспользоватьПриВыводеПодвала               = Ложь;
	ИспользоватьПередКомпоновкойМакета         = Ложь;
	ИспользоватьПослеКомпоновкиМакета          = Ложь;
	ИспользоватьПередВыводомЭлементаРезультата = Ложь;
	ИспользоватьПослеВыводаРезультата          = Ложь;
	ИспользоватьДанныеРасшифровки              = Истина;
	
	
	Если ПараметрыИсполненияОтчета <> Неопределено Тогда
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьВнешниеНаборыДанных") Тогда
			ИспользоватьВнешниеНаборыДанных = ПараметрыИсполненияОтчета.ИспользоватьВнешниеНаборыДанных;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПриВыводеПодвала") Тогда
			ИспользоватьПриВыводеПодвала = ПараметрыИсполненияОтчета.ИспользоватьПриВыводеПодвала;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПередКомпоновкойМакета") Тогда
			ИспользоватьПередКомпоновкойМакета = ПараметрыИсполненияОтчета.ИспользоватьПередКомпоновкойМакета;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПослеКомпоновкиМакета") Тогда
			ИспользоватьПослеКомпоновкиМакета = ПараметрыИсполненияОтчета.ИспользоватьПослеКомпоновкиМакета;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПередВыводомЭлементаРезультата") Тогда
			ИспользоватьПередВыводомЭлементаРезультата = ПараметрыИсполненияОтчета.ИспользоватьПередВыводомЭлементаРезультата;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьПослеВыводаРезультата") Тогда
			ИспользоватьПослеВыводаРезультата = ПараметрыИсполненияОтчета.ИспользоватьПослеВыводаРезультата;
		КонецЕсли;
		Если ПараметрыИсполненияОтчета.Свойство("ИспользоватьДанныеРасшифровки") Тогда
			ИспользоватьДанныеРасшифровки = ПараметрыИсполненияОтчета.ИспользоватьДанныеРасшифровки;
		КонецЕсли;
	КонецЕсли;
	
	//Если ТипЗнч(ПараметрыОтчета.СхемаКомпоновкиДанных) = Тип("Строка") Тогда
	//	Если ЭтоАдресВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных) Тогда
	//		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных);
	//	КонецЕсли;
	//Иначе
	//	СхемаКомпоновкиДанных = ПараметрыОтчета.СхемаКомпоновкиДанных;
	//КонецЕсли;
	
	//_СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
	_СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
	
	_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	_КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыОтчета.НастройкиКомпоновкиДанных);
	_КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(_СхемаКомпоновкиДанных));
	
	ВыводитьЕдиницуИзмерения = Ложь;
	
	Если _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ВыводитьЗаголовок") Тогда
		ВыводитьЗаголовок = _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыводитьЗаголовок;
	КонецЕсли;
	Если _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ВыводитьПодвал") Тогда
		ВыводитьПодвал = _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыводитьПодвал;
	КонецЕсли;
	Если _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ВыводитьЕдиницуИзмерения") Тогда
		ВыводитьЕдиницуИзмерения = _КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыводитьЕдиницуИзмерения;
	КонецЕсли;
	
	ВыводитьЗаголовок = Истина;
	ВыводитьПодвал    = Истина;

	Результат = Новый ТабличныйДокумент;
	
	Если ВыводитьЗаголовок Тогда
		РаботаСБухгалтерскимиОтчетами.ВывестиЗаголовокОтчета(ПараметрыОтчета, _КомпоновщикНастроек, Результат);
	КонецЕсли;
	
	Если ВыводитьПолностью Тогда
		Если ИспользоватьПередКомпоновкойМакета Тогда
			МенеджерОтчета.ПередКомпоновкойМакета(ПараметрыОтчета, _СхемаКомпоновкиДанных, _КомпоновщикНастроек);
		КонецЕсли;
		//Иванов 2016-08-23 Начало...
		//		НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
		
		Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда 
			// Добавление информации об измененном запросе в компановщик
			_КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(_СхемаКомпоновкиДанных, Новый УникальныйИдентификатор)));
			
			// Изменение структуры отчета
			НастройкиДляКомпоновкиМакета = _КомпоновщикНастроек.ПолучитьНастройки();
			
		Иначе 
			_КомпоновщикНастроек.Восстановить();	
			НастройкиДляКомпоновкиМакета = _КомпоновщикНастроек.ПолучитьНастройки();	
		КонецЕсли;		
		//... Иванов 2016-08-23 Конец
		
		РаботаСБухгалтерскимиОтчетами.УстановитьМакетОформленияОтчета(ПараметрыОтчета, НастройкиДляКомпоновкиМакета);
		
		//Сгенерируем макет компоновки данных при помощи компоновщика макета
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		Попытка
			
			//В качестве схемы компоновки будет выступать схема самого отчета
			//В качестве настроек отчета - текущие настройки отчета
			//Данные расшифровки будем помещать в ДанныеРасшифровки
			Если ИспользоватьДанныеРасшифровки Тогда 
				МакетКомпоновки = КомпоновщикМакета.Выполнить(_СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровкиОбъект);
			Иначе
				МакетКомпоновки = КомпоновщикМакета.Выполнить(_СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета);
			КонецЕсли;
			
			//Вызываем событие отчета
			Если ИспользоватьПослеКомпоновкиМакета Тогда
				МенеджерОтчета.ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки);
			КонецЕсли;
			
		
			//Создадим и инициализируем процессор компоновки
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровкиОбъект, Истина);
			
			ДанныеДляРасшифровки = Новый Структура("Объект, ДанныеРасшифровки", ПараметрыОтчета, ДанныеРасшифровкиОбъект); 
			ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеДляРасшифровки, ПараметрыОтчета.ДанныеРасшифровки);
			
			//Создадим и инициализируем процессор вывода результата
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(Результат);
			
			//Обозначим начало вывода
			ПроцессорВывода.НачатьВывод();
			
			Если ИспользоватьПередВыводомЭлементаРезультата Тогда
				//Основной цикл вывода отчета
				Пока Истина Цикл
					
					//ОбработкаПрерыванияПользователя();
					//Получим следующий элемент результата компоновки
					ЭлементРезультата = ПроцессорКомпоновки.Следующий();
					
					Если ЭлементРезультата = Неопределено Тогда
						//Следующий элемент не получен - заканчиваем цикл вывода
						Прервать;
					Иначе
						
						Отказ = Ложь;
						
						МенеджерОтчета.ПередВыводомЭлементаРезультата(ПараметрыОтчета, МакетКомпоновки, ДанныеРасшифровкиОбъект, ЭлементРезультата, Отказ);
						
						Если Не Отказ Тогда
							//Элемент получен - выведем его при помощи процессора вывода
							ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
				//Завершение вывода отчета
				ПроцессорВывода.ЗакончитьВывод();
			Иначе
				ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
			КонецЕсли;
			
			ДанныеДляРасшифровки = Новый Структура("Объект, ДанныеРасшифровки", ПараметрыОтчета, ДанныеРасшифровкиОбъект); 
			ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеДляРасшифровки, ПараметрыОтчета.ДанныеРасшифровки);
			
		Исключение
			// Запись в журнал регистрации не требуется
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
				ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
			КонецЦикла;
			ТекстСообщения = НСтр("ru = 'Отчет не сформирован!'") + Символы.ПС + ИнформацияОбОшибке.Описание;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ВыводитьПодвал Тогда
			Если ИспользоватьПриВыводеПодвала Тогда 
				МенеджерОтчета.ПриВыводеПодвала(ПараметрыОтчета, Результат);
			Иначе
				РаботаСБухгалтерскимиОтчетами.ВывестиПодвалОтчета(ПараметрыОтчета, _КомпоновщикНастроек, Результат);
			КонецЕсли;
		КонецЕсли;
		
		Если ИспользоватьПослеВыводаРезультата Тогда
			МенеджерОтчета.ПослеВыводаРезультата(ПараметрыОтчета, Результат);
		Иначе
			РаботаСБухгалтерскимиОтчетами.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
		КонецЕсли;
	КонецЕсли;
	
	РезультатФункции = Новый Структура("Результат, ДанныеРасшифровки", Результат, ДанныеРасшифровки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		
		ПоместитьВоВременноеХранилище(РезультатФункции, АдресХранилища);
		
		Возврат АдресХранилища;

	Иначе
		
		Возврат РезультатФункции; 		
		
	КонецЕсли;
	
КонецФункции

// ИЗ МЕНЕДЖЕРА

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки,
							|ИспользоватьПередВыводомЭлементаРезультата,
							|ИспользоватьПриВыводеПодвала",
							Истина, Истина, Истина, Истина, Истина, Истина);
							
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат "Оборотно-сальдовая ведомость" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	
КонецФункции

Функция ПолучитьИспользуемыеСчета(ПараметрыОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиныйБухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
	
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(ПараметрыОтчета.НачалоПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(ПараметрыОтчета.КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ПараметрыОтчета.СчетДоверительногоУправления);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");

КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		
	КоличествоПоказателей = РаботаСБухгалтерскимиОтчетами.КоличествоПоказателей(ПараметрыОтчета);
	
	Если КоличествоПоказателей > 1 Тогда
		ГруппаПоказатели = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПоказатели.Заголовок     = "Показатели";
		ГруппаПоказатели.Использование = Истина;
		ГруппаПоказатели.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
		
		Для Каждого ИмяПоказателя Из ПараметрыОтчета.НаборПоказателей Цикл
			Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда 
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаПоказатели, "Показатели." + ИмяПоказателя);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
		
	ГруппаСальдоНаНачало = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаНачало.Заголовок     = "Сальдо на начало периода";
	ГруппаСальдоНаНачало.Использование = Истина;
	ГруппаСальдоНаНачалоДт = ГруппаСальдоНаНачало.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаНачалоДт.Заголовок     = "Дебет";
	ГруппаСальдоНаНачалоДт.Использование = Истина;
	ГруппаСальдоНаНачалоДт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаСальдоНаНачалоКт = ГруппаСальдоНаНачало.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаНачалоКт.Заголовок     = "Кредит";
	ГруппаСальдоНаНачалоКт.Использование = Истина;
	ГруппаСальдоНаНачалоКт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	
	ГруппаОбороты = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаОбороты.Заголовок     = "Обороты за период";
	ГруппаОбороты.Использование = Истина;
	ГруппаОборотыДт = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаОборотыДт.Заголовок     = "Дебет";
	ГруппаОборотыДт.Использование = Истина;
	ГруппаОборотыДт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаОборотыКт = ГруппаОбороты.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаОборотыКт.Заголовок     = "Кредит";
	ГруппаОборотыКт.Использование = Истина;
	ГруппаОборотыКт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	
	ГруппаСальдоНаКонец = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаКонец.Заголовок     = "Сальдо на конец периода";
	ГруппаСальдоНаКонец.Использование = Истина;
	ГруппаСальдоНаКонецДт = ГруппаСальдоНаКонец.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаКонецДт.Заголовок     = "Дебет";
	ГруппаСальдоНаКонецДт.Использование = Истина;
	ГруппаСальдоНаКонецДт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	ГруппаСальдоНаКонецКт = ГруппаСальдоНаКонец.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаСальдоНаКонецКт.Заголовок     = "Кредит";
	ГруппаСальдоНаКонецКт.Использование = Истина;
	ГруппаСальдоНаКонецКт.Расположение  = РасположениеПоляКомпоновкиДанных.Вертикально;
	  
	ВидОстатков = "";
	
	Для Каждого ИмяПоказателя Из ПараметрыОтчета.НаборПоказателей Цикл
		Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда 
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаНачалоДт, "СальдоНаНачалоПериода." + ИмяПоказателя + "Начальный" + ВидОстатков + "ОстатокДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаНачалоКт, "СальдоНаНачалоПериода." + ИмяПоказателя + "Начальный" + ВидОстатков + "ОстатокКт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаОборотыДт,        "ОборотыЗаПериод."       + ИмяПоказателя + ВидОстатков + "ОборотДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаОборотыКт,        "ОборотыЗаПериод."       + ИмяПоказателя + ВидОстатков + "ОборотКт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаКонецДт,  "СальдоНаКонецПериода."  + ИмяПоказателя + "Конечный"  + ВидОстатков + "ОстатокДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаКонецКт,  "СальдоНаКонецПериода."  + ИмяПоказателя + "Конечный"  + ВидОстатков + "ОстатокКт");
		КонецЕсли;
	КонецЦикла;
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить("ВалютнаяСумма");
	
	Для Каждого ИмяПоказателя Из ПараметрыОтчета.НаборПоказателей Цикл
		Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда 
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаНачалоДт, "СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаНачалоКт, "СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокКт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаОборотыДт,        "ОборотыЗаПериод."       + ИмяПоказателя + "ОборотДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаОборотыКт,        "ОборотыЗаПериод."       + ИмяПоказателя + "ОборотКт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаКонецДт,  "СальдоНаКонецПериода."  + ИмяПоказателя + "КонечныйОстатокДт");
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(ГруппаСальдоНаКонецКт,  "СальдоНаКонецПериода."  + ИмяПоказателя + "КонечныйОстатокКт");
		КонецЕсли;
	КонецЦикла;
  	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// Доработка схемы - развернутое сальдо
	НаборДанных = Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое; // Набор "ПоСубконтоРазвернутое"
	ТекстЗапроса = НаборДанных.Запрос;
	НаборДанных.Запрос = "";
	
	ТекстЗапросПоСубконтоРазвернутое       = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало ЗапросПоСубконто РазвернутоеСальдо", "//Конец ЗапросПоСубконто РазвернутоеСальдо");
	ТекстУсловиеСчетаПоСубконтоРазвернутое = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало УсловиеСчета РазвернутоеСальдо"    , "//Конец УсловиеСчета РазвернутоеСальдо");
	ТекстСубконтоПоСубконтоРазвернутое     = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало Субконто РазвернутоеСальдо"        , "//Конец Субконто РазвернутоеСальдо");
		
	ВыводитьРазвернутоеСальдо = Ложь;
	
	ТекстУсловие = "Ложь ИЛИ ";
	
	СписокВсехСчетовРазвернутоеСальдо = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы Из ПараметрыОтчета.РазвернутоеСальдо Цикл
		Если СтрокаТаблицы.Использование И ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
			СписокВсехСчетовРазвернутоеСальдо.Добавить(СтрокаТаблицы.Счет);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ПараметрыОтчета.РазвернутоеСальдо Цикл
		СубконтоРазвернутоеСальдо = Новый СписокЗначений;
		Если СтрокаТаблицы.Использование И ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
			ВыводитьРазвернутоеСальдо = Истина;
			
			ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(СтрокаТаблицы.Счет);
			СписокВидовСубконто = Новый СписокЗначений;
			КоличествоСубконто = СтрДлина(СтрокаТаблицы.ПоСубконто) / 2;
			Для Индекс = 1 По КоличествоСубконто Цикл
				СписокВидовСубконто.Добавить(ДанныеСчета["ВидСубконто" + Сред(СтрокаТаблицы.ПоСубконто, Индекс*2, 1)], ДанныеСчета["ВидСубконто" + Сред(СтрокаТаблицы.ПоСубконто, Индекс*2, 1) + "Наименование"], ?(Сред(СтрокаТаблицы.ПоСубконто, Индекс * 2 - 1, 1) = "+", Истина, Ложь));
			КонецЦикла;
			
			Для Каждого СтрокаТаблицыСубконто Из СписокВидовСубконто Цикл
				Если СтрокаТаблицыСубконто.Пометка Тогда
					СубконтоРазвернутоеСальдо.Добавить(СтрокаТаблицыСубконто.Значение);            
				КонецЕсли;
			КонецЦикла;		
			
			//СписокСчетовРазвернутоеСальдо.Добавить(Строка.Счет, , Истина);
			
			Индекс = ПараметрыОтчета.РазвернутоеСальдо.Индекс(СтрокаТаблицы) + 1;
			
			ТекстУсловие = ТекстУсловие + "Счет = &СчетРазвернутоеСальдо" + Индекс + " ИЛИ "; 
			
			// Формируем текст параметра УсловиеСчета запроса детализации по субконто
			ТекстДляПодстановкиУсловиеСчетаПоСубконтоРазвернутое = "Счет В ИЕРАРХИИ (&СчетРазвернутоеСальдо" + Индекс + ")
																	| И Счет НЕ В (&СчетаИсключенныеИзЗапросаПоСчетамРазвернутое" + Индекс + ")
																	| И ((НЕ Счет.Забалансовый)
																	| ИЛИ &ВыводитьЗабалансовыеСчета)";
			
			// Формируем текст параметра Субконто запроса по субконто развернутое
			ТекстДляПодстановкиСубконтоПоСубконтоРазвернутое = "&СубконтоРазвернутый" + Индекс;
			
			// Установка параметра СчетРазвернутоеСальдо
			РаботаСБухгалтерскимиОтчетами.СкопироватьПараметрСхемыКомпоновкиДанных(Схема, "СчетРазвернутоеСальдо" + Индекс, "СчетРазвернутоеСальдо", СтрокаТаблицы.Счет);
			
			СчетаИсключенныеИзЗапросаПоСчетамРазвернутое = СписокВсехСчетовРазвернутоеСальдо.Скопировать();
			СчетаИсключенныеИзЗапросаПоСчетамРазвернутое.Удалить(СчетаИсключенныеИзЗапросаПоСчетамРазвернутое.НайтиПоЗначению(СтрокаТаблицы.Счет));
			// Установка параметра СчетаИсключенныеИзЗапросаПоСчетамРазвернутое
			РаботаСБухгалтерскимиОтчетами.СкопироватьПараметрСхемыКомпоновкиДанных(Схема, "СчетаИсключенныеИзЗапросаПоСчетамРазвернутое" + Индекс, "СчетаИсключенныеИзЗапросаПоСчетамРазвернутое", СчетаИсключенныеИзЗапросаПоСчетамРазвернутое);
			
			// Установка параметра "СубконтоДетализацииРазвернутый
			РаботаСБухгалтерскимиОтчетами.СкопироватьПараметрСхемыКомпоновкиДанных(Схема, "СубконтоРазвернутый" + Индекс, "СубконтоРазвернутый", СубконтоРазвернутоеСальдо);
			
			// Формируем текст запроса для счета детализации
			ТекстДляПодстановкиЗапросПоСубконтоРазвернутое = ТекстЗапросПоСубконтоРазвернутое;//СтрЗаменить(ТекстЗапросПоСубконтоРазвернутое, ТекстПолеСчетПоСубконтоРазвернутое, ТекстДляПодстановкиПолеСчетПоСубконтоРазвернутое);
			ТекстДляПодстановкиЗапросПоСубконтоРазвернутое = СтрЗаменить(ТекстДляПодстановкиЗапросПоСубконтоРазвернутое, ТекстУсловиеСчетаПоСубконтоРазвернутое, ТекстДляПодстановкиУсловиеСчетаПоСубконтоРазвернутое);
			ТекстДляПодстановкиЗапросПоСубконтоРазвернутое = СтрЗаменить(ТекстДляПодстановкиЗапросПоСубконтоРазвернутое, ТекстСубконтоПоСубконтоРазвернутое, ТекстДляПодстановкиСубконтоПоСубконтоРазвернутое);
			
			Для Индекс = 1 По СубконтоРазвернутоеСальдо.Количество() Цикл
				ТекстДляПодстановкиЗапросПоСубконтоРазвернутое = СтрЗаменить(ТекстДляПодстановкиЗапросПоСубконтоРазвернутое, "//Null КАК Субконто" + Индекс, "ОстаткиИОбороты.Субконто" + Индекс + " КАК Субконто" + Индекс);
			КонецЦикла;
			
			// Доработка запроса набора данных
			НаборДанных.Запрос = НаборДанных.Запрос + ТекстДляПодстановкиЗапросПоСубконтоРазвернутое;
			
			// Доработка запроса набора данных
			НаборДанных.Запрос = НаборДанных.Запрос + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;	
	КонецЦикла;
	НаборДанных.Запрос = Лев(НаборДанных.Запрос, СтрДлина(НаборДанных.Запрос) - 16);
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить("БУ");
	
	Если ВыводитьРазвернутоеСальдо Тогда
		ТекстУсловие = Лев(ТекстУсловие, СтрДлина(ТекстУсловие) - 4);
		Для Каждого ИмяПоказателя Из МассивПоказателей Цикл
			ПолеИтога = Схема.ПоляИтога.Найти("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокДт");
			ПолеИтога.Выражение = "Выбор Когда " + ТекстУсловие + " Тогда Сумма(ЕстьNull(СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйРазвернутыйОстатокДт, 0)) Иначе Сумма(ЕстьNull(СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокДт, 0)) Конец";
			
			ПолеИтога = Схема.ПоляИтога.Найти("СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокКт");
			ПолеИтога.Выражение = "Выбор Когда " + ТекстУсловие + " Тогда Сумма(ЕстьNull(СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйРазвернутыйОстатокКт, 0)) Иначе Сумма(ЕстьNull(СальдоНаНачалоПериода." + ИмяПоказателя + "НачальныйОстатокКт, 0)) Конец";
			
			ПолеИтога = Схема.ПоляИтога.Найти("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокДт");
			ПолеИтога.Выражение = "Выбор Когда " + ТекстУсловие + " Тогда Сумма(ЕстьNull(СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйРазвернутыйОстатокДт, 0)) Иначе Сумма(ЕстьNull(СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокДт, 0)) Конец";
			
			ПолеИтога = Схема.ПоляИтога.Найти("СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокКт");
			ПолеИтога.Выражение = "Выбор Когда " + ТекстУсловие + " Тогда Сумма(ЕстьNull(СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйРазвернутыйОстатокКт, 0)) Иначе Сумма(ЕстьNull(СальдоНаКонецПериода." + ИмяПоказателя + "КонечныйОстатокКт, 0)) Конец";
		КонецЦикла;
	КонецЕсли;
	
	НаборДанных = Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто; // Набор "ПоСубконто"
	ТекстЗапроса = НаборДанных.Запрос;
	НаборДанных.Запрос = "";
	
	МаксимальноеКоличествоСубконто = 3;
	
	Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда
	    // Тут может быть до 7ми субконто! +Лицевик + Партия + СтрокаПартии + Допаналитика
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"ОстаткиИОбороты.Субконто3 КАК Субконто3,",
						"ОстаткиИОбороты.Субконто3 КАК Субконто3,
						|ОстаткиИОбороты.Субконто4 КАК Субконто4,
						|ОстаткиИОбороты.Субконто5 КАК Субконто5,
						|ОстаткиИОбороты.Субконто6 КАК Субконто6,
						|ОстаткиИОбороты.Субконто7 КАК Субконто7,");
		МаксимальноеКоличествоСубконто = 7;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
						"БухгалтерскийУчет",
						"ЕдиныйБухгалтерскийУчет");
	
	КонецЕсли;
	
	ТекстЗапросДетализацииПоСубконто       = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало ЗапросПоСубконто Детализация", "//Конец ЗапросПоСубконто Детализация");
	ТекстУсловиеСчетаДетализацииПоСубконто = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало УсловиеСчета Детализация", "//Конец УсловиеСчета Детализация");
	ТекстСубконтоДетализацииПоСубконто     = РаботаСБухгалтерскимиОтчетами.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//Начало Субконто Детализация", "//Конец Субконто Детализация");
	
	СчетаИсключенныеИзЗапросаПоСчетам = Новый СписокЗначений;
	
	МассивИспользуемыхСчетов = ПолучитьИспользуемыеСчета(ПараметрыОтчета);	
	
	// Доработка для детализации
	ЕстьДетализацияПоСубконто = Ложь;
	УбратьПсевдонимы = Ложь;
	Для Каждого СтрокаТаблицы Из ПараметрыОтчета.Группировка Цикл	
		
		Если МассивИспользуемыхСчетов.Найти(СтрокаТаблицы.Счет) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СубконтоДетализации = Новый СписокЗначений;
		Если СтрокаТаблицы.Использование И ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда	
			ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(СтрокаТаблицы.Счет);
			СписокВидовСубконто = Новый СписокЗначений;
			КоличествоСубконто = СтрДлина(СтрокаТаблицы.ПоСубконто) / 2;
			Для Индекс = 1 По КоличествоСубконто Цикл
				
				ИндексСубконто		= Сред(СтрокаТаблицы.ПоСубконто, Индекс*2, 1);
				ЗнакСубконто		= Сред(СтрокаТаблицы.ПоСубконто, Индекс * 2 - 1, 1);
				ВключатьСубконто	= ?(ЗнакСубконто = "+", Истина, Ложь);
				
				Если ИндексСубконто = "0" Тогда
				ИначеЕсли ИндексСубконто = "Л" Тогда
					СписокВидовСубконто.Добавить("ЛицевойСчет", "ЛицевойСчет", ВключатьСубконто);
				ИначеЕсли ИндексСубконто = "Д" Тогда
					СписокВидовСубконто.Добавить("ДополнительнаяАналитика", "ДополнительнаяАналитика", ВключатьСубконто);
				ИначеЕсли ИндексСубконто = "П" Тогда
					СписокВидовСубконто.Добавить("Партия", "Партия", ВключатьСубконто);
				ИначеЕсли ИндексСубконто = "С" Тогда
					СписокВидовСубконто.Добавить("СтрокаПартии", "СтрокаПартии", ВключатьСубконто);
				Иначе
					СписокВидовСубконто.Добавить(ДанныеСчета["ВидСубконто" + ИндексСубконто], ДанныеСчета["ВидСубконто" + ИндексСубконто + "Наименование"], ВключатьСубконто);
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаТаблицыСубконто Из СписокВидовСубконто Цикл
				Если СтрокаТаблицыСубконто.Пометка Тогда
					СубконтоДетализации.Добавить(СтрокаТаблицыСубконто.Значение);            
				КонецЕсли;
			КонецЦикла;
						
		КонецЕсли;
		
		Если СубконтоДетализации.Количество() > 0 Тогда
			ЕстьДетализацияПоСубконто = Истина;
			
			СчетаИсключенныеИзЗапросаПоСчетам.Добавить(СтрокаТаблицы.Счет);
			Индекс = ПараметрыОтчета.Группировка.Индекс(СтрокаТаблицы) + 1;
			
			// Формируем текст параметра УсловиеСчета запроса детализации по субконто
			ТекстДляПодстановкиУсловиеСчетаДетализацииПоСубконто = "Счет В ИЕРАРХИИ (&СчетДетализации" + Индекс + ")
																   | И ((НЕ Счет.Забалансовый)
																   | ИЛИ &ВыводитьЗабалансовыеСчета)";
											  
			// Формируем текст параметра Субконто запроса детализации по субконто
			ТекстДляПодстановкиСубконтоДетализацииПоСубконто = "&СубконтоДетализации" + Индекс;
			
			// Формируем текст запроса для счета детализации
			ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстЗапросДетализацииПоСубконто, ТекстУсловиеСчетаДетализацииПоСубконто, ТекстДляПодстановкиУсловиеСчетаДетализацииПоСубконто);
			ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто, ТекстСубконтоДетализацииПоСубконто, ТекстДляПодстановкиСубконтоДетализацииПоСубконто);
			
			// Корректировка текста запроса в зависимости от количества указанных видов субконто
			Если УбратьПсевдонимы Тогда
				Для ИндексПсевдонима = 1 По МаксимальноеКоличествоСубконто Цикл
					ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто, " КАК Субконто" + ИндексПсевдонима, "");
				КонецЦикла;
			Иначе
				УбратьПсевдонимы = Истина;
			КонецЕсли;
			
			НомерДляСубконто = 1;
			СубконтоСубконтоДетализации = Новый СписокЗначений;
			Для ИндексСубконто = 1 По СубконтоДетализации.Количество() Цикл
				
				ТекущееСубконтоДетализации = СубконтоДетализации.Получить(ИндексСубконто - 1);
				
				Если ТипЗнч(ТекущееСубконтоДетализации.Значение) = Тип("ПланВидовХарактеристикСсылка.ВидыСубконто") Тогда
					Если НомерДляСубконто <> ИндексСубконто Тогда
					
						ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто,
																			"ОстаткиИОбороты.Субконто" + ИндексСубконто,
																			"ОстаткиИОбороты.Субконто" + НомерДляСубконто);
					
					КонецЕсли;
					СубконтоСубконтоДетализации.Добавить(ТекущееСубконтоДетализации.Значение);
					НомерДляСубконто = НомерДляСубконто + 1;
				ИначеЕсли ТекущееСубконтоДетализации.Значение = "ЛицевойСчет" Тогда
						ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто,
																			"ОстаткиИОбороты.Субконто" + ИндексСубконто,
																			"ОстаткиИОбороты.ЛицевойСчет");
				ИначеЕсли ТекущееСубконтоДетализации.Значение = "Партия" Тогда
						ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто,
																			"ОстаткиИОбороты.Субконто" + ИндексСубконто,
																			"ОстаткиИОбороты.ЛицевойСчет.Партия");
				ИначеЕсли ТекущееСубконтоДетализации.Значение = "СтрокаПартии" Тогда
						ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто,
																			"ОстаткиИОбороты.Субконто" + ИндексСубконто,
																			"ОстаткиИОбороты.ЛицевойСчет.СтрокаПартии");
				ИначеЕсли ТекущееСубконтоДетализации.Значение = "ДополнительнаяАналитика" Тогда
						ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто,
																			"ОстаткиИОбороты.Субконто" + ИндексСубконто,
																			"ОстаткиИОбороты.ЛицевойСчет.ДополнительнаяАналитика");
				КонецЕсли;
			
			КонецЦикла;
			
			Для ИндексСубконто = СубконтоДетализации.Количество() + 1 По МаксимальноеКоличествоСубконто Цикл
				ТекстДляПодстановкиЗапросДетализацииПоСубконто = СтрЗаменить(ТекстДляПодстановкиЗапросДетализацииПоСубконто, "ОстаткиИОбороты.Субконто" + ИндексСубконто , "Null");	
			КонецЦикла;
			
			// Добавление и установка значения параметра СчетДетализации{Индекс}
			
			РаботаСБухгалтерскимиОтчетами.СкопироватьПараметрСхемыКомпоновкиДанных(Схема, "СчетДетализации" + Индекс, "СчетДетализации", СтрокаТаблицы.Счет);
			
			// Добавление и установка значения параметра СубконтоДетализации{Индекс}
			РаботаСБухгалтерскимиОтчетами.СкопироватьПараметрСхемыКомпоновкиДанных(Схема, "СубконтоДетализации" + Индекс, "СубконтоДетализации", СубконтоСубконтоДетализации);
							
			// Доработка запроса набора данных
			НаборДанных.Запрос = НаборДанных.Запрос + ТекстДляПодстановкиЗапросДетализацииПоСубконто;
			
			// Доработка запроса набора данных
			НаборДанных.Запрос = НаборДанных.Запрос + " ОБЪЕДИНИТЬ ВСЕ ";	
		КонецЕсли;
	КонецЦикла;
	
	НаборДанных.Запрос = Лев(НаборДанных.Запрос, СтрДлина(НаборДанных.Запрос) - 16);
	
	Схема.Параметры.ВыводитьЗабалансовыеСчета.Значение = Истина;
	
	Схема.Параметры.СчетаИсключенныеИзЗапросаПоСчетам.Значение = СчетаИсключенныеИзЗапросаПоСчетам;
	
	Если Не ЕстьДетализацияПоСубконто Тогда
		Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.Удалить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто);
	КонецЕсли;
	Если Не ВыводитьРазвернутоеСальдо Тогда
		Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.Удалить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое);
	КонецЕсли;
		
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	
	Для Каждого Параметр Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Параметр.Использование = Истина;
	КонецЦикла;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СчетаИсключенныеИзЗапросаПоСчетам", СчетаИсключенныеИзЗапросаПоСчетам);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.СчетДоверительногоУправления) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "СчетДоверительногоУправления", ПараметрыОтчета.СчетДоверительногоУправления,,, Истина);
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьЗабалансовыеСчета", ПараметрыОтчета.ВыводитьЗабалансовыеСчета);
	
	// Дополнительные данные
	РаботаСБухгалтерскимиОтчетами.ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек);
	
	УсловноеОформлениеАвтоотступа = Неопределено;
	Для каждого ЭлементОформления Из КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.Представление = "Уменьшенный автоотступ" Тогда
			УсловноеОформлениеАвтоотступа = ЭлементОформления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если УсловноеОформлениеАвтоотступа = Неопределено Тогда
		УсловноеОформлениеАвтоотступа = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
		УсловноеОформлениеАвтоотступа.Представление = "Уменьшенный автоотступ";
		УсловноеОформлениеАвтоотступа.Оформление.УстановитьЗначениеПараметра("Автоотступ", 1);
		УсловноеОформлениеАвтоотступа.Использование = Ложь;
		УсловноеОформлениеАвтоотступа.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	Иначе
		УсловноеОформлениеАвтоотступа.Поля.Элементы.Очистить();
	КонецЕсли;
	
	// Формирование структуры отчета
	Структура = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование  = Истина;
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Счет");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
	ПолеОформления.Поле = ПолеГруппировки.Поле;
	
	// Установка отбора на выводимый уровень иерархии счета
	ГруппаЭлементовОтбора = Структура.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
	ГруппаЭлементовОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "ПараметрыДанных.ПоСубсчетам", Истина);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "СистемныеПоля.УровеньВГруппировке", 1);
	СписокСчетовПоСубсчетам = РаботаСБухгалтерскимиОтчетами.ПолучитьСписокСчетовПоСубсчетам(ПараметрыОтчета.Группировка);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "Счет", СписокСчетовПоСубсчетам, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, СписокСчетовПоСубсчетам.Количество() > 0);

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоСубсчетам", ПараметрыОтчета.ПоСубсчетам);
		
	// Отключим вывод отборов
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(Структура, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	
	//Иванов 2016-08-22 Доп. измерение (вариант "на уровень ниже счета")Начало...		
	//Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет"
	//	И ПараметрыОтчета.скПоЛицевомуСчету Тогда 
	//	
	//	Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//	
	//	ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//	ПолеГруппировки.Использование  = Истина;
	//	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("ЛицевойСчет");
	//	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;	
	//	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	//	
	//	ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
	//	ПолеОформления.Поле = ПолеГруппировки.Поле;
	//	
	//КонецЕсли;
	
	//...Иванов 2016-08-22 Доп. измерение Конец

	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));		
		ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование  = Истина;
		ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Валюта");
		ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		
		Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));	
		
		ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
		ПолеОформления.Поле = ПолеГруппировки.Поле;
	КонецЕсли;
	
	
	Если ЕстьДетализацияПоСубконто Тогда
		Для Индекс = 1 По МаксимальноеКоличествоСубконто Цикл 
			Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование  = Истина;
			ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Субконто" + Индекс);
			ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			
			Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			
			ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
			ПолеОформления.Поле = ПолеГруппировки.Поле;
			
			Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
				Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));		
				ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Использование  = Истина;
				ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Валюта");
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
				
				Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));	
				
				ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
				ПолеОформления.Поле = ПолеГруппировки.Поле;
			КонецЕсли;
			
			//Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет"
			//	И ПараметрыОтчета.скПоПартиям Тогда
			//
			//	Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			//	
			//	ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			//	ПолеГруппировки.Использование  = Истина;
			//	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Партия");
			//	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;	
			//	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			//	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			//	
			//	ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
			//	ПолеОформления.Поле = ПолеГруппировки.Поле;
			//
			//КонецЕсли;
			
		КонецЦикла;
	//ИначеЕсли ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет"
	//		И ПараметрыОтчета.скПоПартиям Тогда 
	//	
	//	Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//	
	//	ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//	ПолеГруппировки.Использование  = Истина;
	//	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Партия");
	//	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;	
	//	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	//	
	//	ПолеОформления = УсловноеОформлениеАвтоотступа.Поля.Элементы.Добавить();
	//	ПолеОформления.Поле = ПолеГруппировки.Поле;
	//	
	КонецЕсли;
	
	
	РаботаСБухгалтерскимиОтчетами.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	Если УсловноеОформлениеАвтоотступа.Поля.Элементы.Количество() = 0 Тогда
		УсловноеОформлениеАвтоотступа.Использование = Ложь;
	КонецЕсли;
	
	
	//Иванов 2016-08-23 Начало...
	Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда 
		
		Если Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСчетам") <> Неопределено Тогда 
			
			// Корректировка текста запроса для работы с новым регистром и планом счетов.
			Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			
			//Если ПараметрыОтчета.скПоЛицевомуСчету И ПараметрыОтчета.скПоПартиям Тогда
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//ИначеЕсли ПараметрыОтчета.скПоЛицевомуСчету Тогда 	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,");
			//ИначеЕсли ПараметрыОтчета.скПоПартиям Тогда 	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//КонецЕсли;
			
		КонецЕсли;
		
		
		Если Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСубконто") <> Неопределено Тогда 
			
			// Корректировка текста запроса для работы с новым регистром и планом счетов.
			//Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос = 
			//СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			
			//Если ПараметрыОтчета.скПоЛицевомуСчету И ПараметрыОтчета.скПоПартиям Тогда
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//ИначеЕсли ПараметрыОтчета.скПоЛицевомуСчету Тогда 	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,");
			//ИначеЕсли ПараметрыОтчета.скПоПартиям Тогда 	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//КонецЕсли;
			
		КонецЕсли;
		
		
		Если Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСубконтоРазвернутое") <> Неопределено Тогда
			
			// Корректировка текста запроса для работы с новым регистром и планом счетов.
			Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			
			//Если ПараметрыОтчета.скПоЛицевомуСчету И ПараметрыОтчета.скПоПартиям Тогда
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "ВложенныйЗапрос.Счет,", 	"ВложенныйЗапрос.Счет, ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет, ВложенныйЗапрос.ЛицевойСчет.Партия КАК Партия,");
			//	
			//ИначеЕсли ПараметрыОтчета.скПоЛицевомуСчету Тогда 	
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,");
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "ВложенныйЗапрос.Счет,", 	"ВложенныйЗапрос.Счет, ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,");
			//	
			//ИначеЕсли ПараметрыОтчета.скПоПартиям Тогда 	
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ОстаткиИОбороты.ЛицевойСчет.Партия КАК Партия,");
			//	
			//	Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
			//	СтрЗаменить(Схема.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "ВложенныйЗапрос.Счет,", 	"ВложенныйЗапрос.Счет, ВложенныйЗапрос.ЛицевойСчет.Партия КАК Партия,");
			//	
			//КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;		
	//... Иванов 2016-08-23 Конец
	
КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	//Разные регистры
	Если ЗначениеЗаполнено(ПараметрыОтчета.УчетныйРегистр) Тогда
		Если ПараметрыОтчета.УчетныйРегистр <> "БухгалтерскийУчет" 
			//Иванов 2016-08-22 Текст запроса для "ЕдиныйБухгалтерскийУчет" изменен ранее .Начало...
			И ПараметрыОтчета.УчетныйРегистр <> "ЕдиныйБухгалтерскийУчет" Тогда
			//...Иванов 2016-08-22 Конец
			Если МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСчетам") <> Неопределено Тогда
				МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
				СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			КонецЕсли;
			Если МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСубконто") <> Неопределено Тогда
					МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос = 
					СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконто.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);	
			КонецЕсли;
			Если МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСубконтоРазвернутое") <> Неопределено Тогда
				МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос = 
				СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСубконтоРазвернутое.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Иванов 2016-08-22 Разные планы счетов .Начало...
	Если МакетКомпоновки.НаборыДанных.Найти("СчетИерархия") <> Неопределено 
		И МакетКомпоновки.НаборыДанных.СчетИерархия.Элементы.Количество() = 1 Тогда 
		
		Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда 
			МакетКомпоновки.НаборыДанных.СчетИерархия.Элементы[0].Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.СчетИерархия.Элементы[0].Запрос , "ПланСчетов.Основной" , "ПланСчетов.Единый");
		КонецЕсли;	
		
	КонецЕсли;	
	//...Иванов 2016-08-22 Конец
	
	МакетШапкиОтчета = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетШапки(МакетКомпоновки);
	
	КоличествоПоказателей = РаботаСБухгалтерскимиОтчетами.КоличествоПоказателей(ПараметрыОтчета);
	
	КоличествоГруппировок = 0;
	Для Каждого СтрокаТаблицы Из ПараметрыОтчета.Группировка Цикл
		Если СтрокаТаблицы.Использование Тогда
			КоличествоСубконто = СтрЧислоВхождений(СтрокаТаблицы.ПоСубконто, "+");
			КоличествоГруппировок = Макс(КоличествоГруппировок, КоличествоСубконто);
		КонецЕсли;
	КонецЦикла;
	КоличествоГруппировок = КоличествоГруппировок + 1;

	КоличествоСтрокШапки = Макс(КоличествоГруппировок, 2);
	ПараметрыОтчета.Вставить("ВысотаШапки", КоличествоСтрокШапки);
	
	МассивДляУдаления = Новый Массив;
	Для Индекс = КоличествоСтрокШапки По МакетШапкиОтчета.Макет.Количество() - 1 Цикл
		МассивДляУдаления.Добавить(МакетШапкиОтчета.Макет[Индекс]);
	КонецЦикла;
	
	КоличествоСтрок = МакетШапкиОтчета.Макет.Количество();
	Для ИндексСтроки = 2 По КоличествоСтрок - 1 Цикл
		СтрокаМакета = МакетШапкиОтчета.Макет[ИндексСтроки];
		
		КоличествоКолонок = СтрокаМакета.Ячейки.Количество();
		
		Для ИндексКолонки = КоличествоКолонок - 6 По КоличествоКолонок - 1 Цикл
			Ячейка = СтрокаМакета.Ячейки[ИндексКолонки];
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(Ячейка.Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
		КонецЦикла;
	КонецЦикла;
	
	Если КоличествоПоказателей > 1 Тогда
		Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл
			СтрокаМакета = МакетШапкиОтчета.Макет[ИндексСтроки];
			
			КоличествоКолонок = СтрокаМакета.Ячейки.Количество();
			Ячейка = СтрокаМакета.Ячейки[КоличествоКолонок - 7];
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(Ячейка.Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
		КонецЦикла;
	КонецЕсли;	
	
	МакетПодвалаОтчета            = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетПодвала(МакетКомпоновки);
	МакетГруппировкиОрганизация   = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетГруппировкиПоПолюГруппировки(МакетКомпоновки, "Организация");
	МакетГруппировкиСчет          = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетГруппировкиПоПолюГруппировки(МакетКомпоновки, "Счет");
	МакетГруппировкиСчетДоверительногоУправления = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетГруппировкиПоПолюГруппировки(МакетКомпоновки, "СчетДоверительногоУправления");
	МакетГруппировкиВалюта        = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетГруппировкиПоПолюГруппировки(МакетКомпоновки, "Валюта");
	
	Для Каждого Элемент Из МассивДляУдаления Цикл
		МакетШапкиОтчета.Макет.Удалить(Элемент);
	КонецЦикла;
	
	Для Каждого Макет Из МакетКомпоновки.Макеты Цикл 
		Если Макет = МакетШапкиОтчета Тогда
		Иначе
			Индекс = -1;
			МассивПоказателей = Новый Массив;
			МассивПоказателей.Добавить("БУ");
			
			Для Каждого ИмяПоказателя Из МассивПоказателей Цикл
				Если ПараметрыОтчета["Показатель" + ИмяПоказателя] Тогда
					Индекс = Индекс + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если ПараметрыОтчета.ПоказательВалютнаяСумма И КоличествоПоказателей = 1 Тогда 
				
			ИначеЕсли ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
				Индекс = Индекс + 1;				
				Если МакетГруппировкиВалюта.Найти(Макет) <> Неопределено Тогда
					
				Иначе
					Макет.Макет.Удалить(Макет.Макет[Индекс]);
					Индекс = Индекс - 1;					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоПоказателей = КоличествоПоказателей;
	Если КоличествоПоказателей > 0 Тогда
		ЗначенияПоказателей = Новый Массив(6, КоличествоПоказателей);
		Для Каждого Массив Из ЗначенияПоказателей Цикл
			Для Индекс = 0 По КоличествоПоказателей - 1 Цикл
				Массив[Индекс] = 0;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	МассивИменМакетовСчет = Новый Массив;
	Для Каждого МакетСчет Из МакетГруппировкиСчет Цикл
		МассивИменМакетовСчет.Добавить(МакетСчет.Имя);
	КонецЦикла;
	
	МассивИменМакетовВалюта = Новый Массив;
	Для Каждого МакетВалюта Из МакетГруппировкиВалюта Цикл
		МассивИменМакетовВалюта.Добавить(МакетВалюта.Имя);
	КонецЦикла;
	
	ВременныеДанныеОтчета = Новый Структура;
	ВременныеДанныеОтчета.Вставить("МакетВалюта"          , МассивИменМакетовВалюта);
	ВременныеДанныеОтчета.Вставить("МакетШапкиОтчета"     , МакетШапкиОтчета.Имя);
	ВременныеДанныеОтчета.Вставить("МакетСчет"            , МассивИменМакетовСчет);
	ВременныеДанныеОтчета.Вставить("МакетПодвал"          , МакетПодвалаОтчета.Имя);
	ВременныеДанныеОтчета.Вставить("КоличествоПоказателей", КоличествоПоказателей);
	ВременныеДанныеОтчета.Вставить("ЗначенияПоказателей"  , ЗначенияПоказателей);
	
	//Иванов 2016-08-23... 
	//СмещениеПоСтроке = МакетШапкиОтчета.Макет[0].Ячейки.Количество() - 7;
	СмещениеПоСтроке = Макс(МакетШапкиОтчета.Макет[0].Ячейки.Количество() - 7, 0);
	//...Иванов 2016-08-23 
	
	ВременныеДанныеОтчета.Вставить("СмещениеПоСтроке", СмещениеПоСтроке);
	
	ПараметрыОтчета.Вставить("ВременныеДанныеОтчета", ВременныеДанныеОтчета);
	
КонецПроцедуры

Процедура ПередВыводомЭлементаРезультата(ПараметрыОтчета, МакетКомпоновки, ДанныеРасшифровки, ЭлементРезультата, Отказ = Ложь) Экспорт
		
	// Отсекаем валютные группировки на счетах, по которым не ведется
	// валютный учет
	Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0
		И ЭлементРезультата.ЗначенияПараметров.Найти("П1") <> Неопределено
		И ЗначениеЗаполнено(ЭлементРезультата.Макет)
		//И ПараметрыОтчета.ВременныеДанныеОтчета.МакетВалюта.Найти(ЭлементРезультата.Макет) <> Неопределено
		И ЭлементРезультата.ЗначенияПараметров.П1.Значение = Null Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтчета.ПоказательВалютнаяСумма
		И ПараметрыОтчета.ВременныеДанныеОтчета.КоличествоПоказателей > 1 Тогда
		КоличествоПоказателей = ПараметрыОтчета.ВременныеДанныеОтчета.КоличествоПоказателей - 1;
	Иначе
		КоличествоПоказателей = ПараметрыОтчета.ВременныеДанныеОтчета.КоличествоПоказателей;
	КонецЕсли;
	
	// Обрабатываем элементы, содержащие корневые счета
	Если ЭлементРезультата.ЗначенияПараметров.Количество() > 0 
		И ЭлементРезультата.ЗначенияПараметров.Найти("П1") <> Неопределено
		И ЗначениеЗаполнено(ЭлементРезультата.Макет)
		И ПараметрыОтчета.ВременныеДанныеОтчета.МакетШапкиОтчета <> ЭлементРезультата.Макет
		И ПараметрыОтчета.ВременныеДанныеОтчета.МакетПодвал <> ЭлементРезультата.Макет Тогда
		
		//Накапливаем суммы по корневым счетам
		Если ПараметрыОтчета.ВременныеДанныеОтчета.МакетСчет.Найти(ЭлементРезультата.Макет) <> Неопределено Тогда
						 			
			ИдентификаторРасшифровки = ЭлементРезультата.ЗначенияПараметров.П2.Значение;
			
			//Иванов 2016-08-23...
			Попытка
				ЗначениеСчет = ДанныеРасшифровки.Элементы[ИдентификаторРасшифровки].ПолучитьПоля()[0].Значение; 
			Исключение
				ЗначениеСчет = ПланыСчетов.Основной.ПустаяСсылка();
			КонецПопытки;	
			
			Если НЕ ЗначениеЗаполнено(ЗначениеСчет) Тогда 
				ЗначениеСчет = ПланыСчетов.Основной.ПустаяСсылка();	
			КонецЕсли;	
			//...2016-08-23 Иванов
			
			Если Не ЗначениеЗаполнено(ЗначениеСчет.Родитель) Тогда
				Для Индекс = 0 По КоличествоПоказателей - 1 Цикл
					Для ПодИндекс = 1 По 6 Цикл
						СтрокаМакета = МакетКомпоновки.Макеты[ЭлементРезультата.Макет].Макет[Индекс];
						Ячейка = СтрокаМакета.Ячейки[ПодИндекс + ПараметрыОтчета.ВременныеДанныеОтчета.СмещениеПоСтроке];
						ИмяПараметра = Строка(Ячейка.Элементы[0].Значение);
						
						Значение = ЭлементРезультата.ЗначенияПараметров[ИмяПараметра].Значение;
						ПараметрыОтчета.ВременныеДанныеОтчета.ЗначенияПоказателей[ПодИндекс - 1][Индекс] = ПараметрыОтчета.ВременныеДанныеОтчета.ЗначенияПоказателей[ПодИндекс - 1][Индекс] + Значение;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли; 
		
		// Проставляем накопленные суммы в подвал отчета
	ИначеЕсли ЭлементРезультата.Макет = ПараметрыОтчета.ВременныеДанныеОтчета.МакетПодвал Тогда
		Для Индекс = 0 По КоличествоПоказателей - 1 Цикл
			Для ПодИндекс = 1 По 6 Цикл
				СтрокаМакета = МакетКомпоновки.Макеты[ПараметрыОтчета.ВременныеДанныеОтчета.МакетПодвал].Макет[Индекс];
				Ячейка = СтрокаМакета.Ячейки[ПодИндекс + ПараметрыОтчета.ВременныеДанныеОтчета.СмещениеПоСтроке];
				ИмяПараметра = Строка(Ячейка.Элементы[0].Значение);
				
				ЭлементРезультата.ЗначенияПараметров[ИмяПараметра].Значение = ПараметрыОтчета.ВременныеДанныеОтчета.ЗначенияПоказателей[ПодИндекс - 1][Индекс];
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	РаботаСБухгалтерскимиОтчетами.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
	Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
		Результат.ФиксацияСверху = ПараметрыОтчета.ВысотаШапки;
	Иначе
		Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ + ПараметрыОтчета.ВысотаШапки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	НаборПоказателей.Добавить("ВалютнаяСумма");
	
	Возврат НаборПоказателей;
	
КонецФункции

Процедура ПриВыводеПодвала(ПараметрыОтчета, Результат) Экспорт

	СтруктураДанныхКонтактногоЛица = Неопределено;
	ПараметрыОтчета.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(Результат, ПараметрыВыводаПодписей);

КонецПроцедуры
 
#КонецЕсли